[
  {
    "id": "reddit-1p32cb3",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Full list of degrees not classed as ‘professional’ by Trump admin",
    "text": "[https://www.newsweek.com/full-list-degrees-professional-trump-administration-11085695](https://www.newsweek.com/full-list-degrees-professional-trump-administration-11085695)\n\n",
    "score": 5522,
    "url": "https://reddit.com/r/Accounting/comments/1p32cb3/full_list_of_degrees_not_classed_as_professional/",
    "created_at": "2025-11-21T15:58:15.000Z",
    "num_comments": 902
  },
  {
    "id": "reddit-1iihssh",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "As an intern this job is so funny how do you all not love it",
    "text": "Me to client: hey you only sent me invoices for half of the selections I sent you, we need the rest\nClient: oh we can’t find them\nMe: oh but we need them\nClient: OKAY we will try our best but no guarantees 😠\n\nMy brother in Christ you are being audited 😭😭😭😭😭\n\nGive me the documents so I can go home 😭😭😭",
    "score": 4659,
    "url": "https://reddit.com/r/Accounting/comments/1iihssh/as_an_intern_this_job_is_so_funny_how_do_you_all/",
    "created_at": "2025-02-05T19:01:52.000Z",
    "num_comments": 183
  },
  {
    "id": "reddit-1kamidy",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Anti-WFH people are the laziest employees we've got",
    "text": "The people who never miss a chance to refer to WFH as \"not at work\" or \"a day off\" are the same ones popping into each other's office to gossip, trying to put together office wide coffee hours, and getting revved up for company conferences and trainings \n\nI've learned to tune out the remarks about WFH but stop treating the office like a social club, God damn",
    "score": 4465,
    "url": "https://reddit.com/r/Accounting/comments/1kamidy/antiwfh_people_are_the_laziest_employees_weve_got/",
    "created_at": "2025-04-29T12:19:15.000Z",
    "num_comments": 414
  },
  {
    "id": "reddit-1iz42et",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "My life changed this week",
    "text": "I’m a CPA I’m 31 I’ve had a decent career. I just got diagnosed with leukemia and none of it seems worth it looking back on it. Of course, I’ve earned myself a decent salary and decent insurance and nice remote role which probably is all privilege a lot of others are not offered. \n\nI just always felt I had a lot more road left to run on my career and now that face a real life risk of losing my life, it just seems so meaningless. \n\nI have a wife, a toddler, and now that I’m hospital-bed ridden I just see things so much differently. I really worry I will not have left enough behind for them to thrive. Just needed a place to vent I guess. My mind is generally a dark place and a diagnosis like this does not help.\n",
    "score": 4072,
    "url": "https://reddit.com/r/Accounting/comments/1iz42et/my_life_changed_this_week/",
    "created_at": "2025-02-27T01:27:08.000Z",
    "num_comments": 231
  },
  {
    "id": "reddit-1l2ao3p",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "New Finance Director doesn't understand depreciation... I'm not joking",
    "text": "About six weeks ago, our company hired a new Finance Director. I'm a senior accountant and report directly to her. She came with what looked like an impressive resume 20+ years in corporate finance, Big 4 background, MBA from a respected program.\n\nYesterday, I was walking her through our monthly close process when she asked me to explain why we \"waste money every month on depreciation expenses when we're not actually spending anything.\"\n\nI thought she was testing me at first. I explained that depreciation allocates the cost of assets over their useful lives, matching expenses with the periods that benefit from the asset. She stared at me blankly and said, \"But we already paid for the equipment. Why are we expensing it again?\"\n\nWhen I mentioned that this is basic GAAP and showed her the journal entries, she asked me to \"walk through it step by step because this seems unnecessarily complicated.\" I spent 30 minutes explaining concepts that are literally covered in Accounting 101.\n\nShe also asked why we can't just expense our new $50K server \"to get the tax write-off this year instead of spreading it out.\" When I explained capitalization thresholds and asset vs. expense classification, she suggested we \"check with the tax guy because this doesn't seem right.\"\n\nThe kicker? She's supposed to be reviewing our financial statements for accuracy before they go to the board next week.\n\nEdit: For context, this is a $15M revenue manufacturing company, not some tiny startup where you might expect less formal accounting.\n\nEdit 2: She also asked yesterday why our cash flow statement \"doesn't match the P&amp;L\" and seemed genuinely confused when I explained that net income isn't the same as cash flow.\n\nI'm honestly questioning how she made it through 20 years in finance without understanding these fundamentals. Either she's been coasting in roles where others did the actual work, or there's some serious resume inflation happening here.",
    "score": 3320,
    "url": "https://reddit.com/r/Accounting/comments/1l2ao3p/new_finance_director_doesnt_understand/",
    "created_at": "2025-06-03T12:31:52.000Z",
    "num_comments": 626
  },
  {
    "id": "reddit-1iw3y62",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "From corporate controller to “bookkeeper” and why I’ll never go back",
    "text": "8 years ago, I was at the top of my career, recently promoted to controller of a pre-IPO biotech after building an accounting team from scratch to 10. I thought I’d made it. Then I got pregnant and took maternity leave. \n\nPriorities shifted and I didn’t care to go back to working 50+ hour weeks. So… I started doing some freelance bookkeeping on upwork. I discovered a purpose I didn’t know I had: giving small businesses access to big business talent. \n\nIt was kinda hard calling myself a bookkeeper (holding a CPA) but it isn’t about the title. It’s about being approachable and being able to truly help business owners. \n\nIf you’re trying to figure out your next career move, maybe you’ve been laid off, or you want to stay home with kids… travel the world… there’s millions of small businesses who need your help. Big4 isn’t the only path for accountants. 🩵\n",
    "score": 2602,
    "url": "https://reddit.com/r/Accounting/comments/1iw3y62/from_corporate_controller_to_bookkeeper_and_why/",
    "created_at": "2025-02-23T06:34:53.000Z",
    "num_comments": 254
  },
  {
    "id": "reddit-1n5sr8q",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "R/accounting",
    "text": "This sub sucks. Most depressing sub in the world. According to this sub there will be no accountants in western world in 2 years just firms that offshore everything. With only C suits over here.\n\nNo future as a CPA \nNo future with a major in accounting \nNo future in corporate at all. \n\nWell yall can suck it, I graduated with a 2.5 GPA and got into a cushy industry job where I worked 35 hours from home. \n\nLife is not some bleak hellscape. Do yourselves a favour and unsub from this depressing AF sub. ",
    "score": 1985,
    "url": "https://reddit.com/r/Accounting/comments/1n5sr8q/raccounting/",
    "created_at": "2025-09-01T16:05:55.000Z",
    "num_comments": 256
  },
  {
    "id": "reddit-1onjwho",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Partner Asked Me to \"Just Make the Numbers Work\"",
    "text": "Had a partner call me into his office today. Client's financials show they're barely breaking even, but they need to look profitable for a loan application.\n\nHis exact words: \"Can you just make the numbers work? Be creative.\"\n\nI asked what he meant by that. He said \"You're the accountant, figure it out\" and went back to his emails.\n\nSo apparently my CPA is just decorative and fraud is now part of my job description.\n\nUpdate my resume or call the ethics hotline? Taking suggestions.\n\n**Update:** Called the ethics hotline yesterday. They took it seriously and said they'd look into it. Today I got pulled into an \"impromptu meeting\" with HR and a different partner I've never worked with before.\n\nThey're calling it a \"misunderstanding\" and the partner claims he was just brainstorming hypothetical scenarios with me. Complete BS but they're clearly trying to sweep it.\n\nI've been moved to a different client team effective immediately. Partner won't look at me in the hallway.\n\nAlready updated my resume over the weekend and have two calls lined up for next week. Not sticking around to see how this plays out.\n\nThanks everyone who pushed me to report it. Would've talked myself out of it otherwise.",
    "score": 1467,
    "url": "https://reddit.com/r/Accounting/comments/1onjwho/partner_asked_me_to_just_make_the_numbers_work/",
    "created_at": "2025-11-03T18:34:44.000Z",
    "num_comments": 270
  },
  {
    "id": "reddit-1nkpj34",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Its absurd that kids w/ their accounting degree and sometimes CPA exams passed cant find entry level jobs with firms willing to take a chance on them, but many of these same firms complain about not being able to find seniors &amp; managers. These kids are your senior and manager pipeline you idiots!",
    "text": "If I were a newly grad (or especially a newly minted CPA or had my exams passed) in this market, I'd go work for an H&amp;R block/Jackson  Hewitt/1040 mill for this upcoming season, then start my own firm doing simple 1040 extensions that same year in May through October. \n\nPerhaps even look into paying for a reviewer on marginally more complicated returns.\n\nI wouldn't quit the industry, I would just find creative ways to forge my own opportunities. ",
    "score": 1430,
    "url": "https://reddit.com/r/Accounting/comments/1nkpj34/its_absurd_that_kids_w_their_accounting_degree/",
    "created_at": "2025-09-19T00:49:10.000Z",
    "num_comments": 196
  },
  {
    "id": "reddit-1k57uq0",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Audit workpaper from last year just made my day",
    "text": "Was having a rough morning. Then I open our finalized audit engagement for the previous year to take a look at expense analytics. The companies salary and related benefits was way down. The explanation? A red arrow on Excel that just points to a mugshot of a disheveled older man. Turns out it was their former CEO.\n\nDude got arrested for fraud so their expenses went down substantially. Absolutely hilarious thinking about the partner and internal review looking over that workpaper and signing off on it.",
    "score": 1220,
    "url": "https://reddit.com/r/Accounting/comments/1k57uq0/audit_workpaper_from_last_year_just_made_my_day/",
    "created_at": "2025-04-22T14:35:27.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1mk5ghl",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Baker Tilly is now requiring CPAs that work for them to stop using \"CPA\" on their personal LinkedIn and in email signatures post merger",
    "text": "Per an email sent out from the Chief Risk Officer:\n\n  \n\"To remain in compliance with recent Board of Accountancy requirements as part of our new Alternative Practice Structure as Baker Tilly, we are implementing a new policy outlining when CPA designations can and cannot be used. This is a new policy for both heritage Moss Adams and heritage Baker Tilly.\n\nIn short, the new policy will outline that only principals in the licensed CPA firm, Baker Tilly US, LLP (BTUS), may include their CPA designation, if properly licensed, in their firm email signatures. *No other principals or team members may include their CPA designation in their email signatures*.\n\nIn external materials such as LinkedIn, CPA designation can be listed as part of educational experience or licenses maintained, however, only principals in BTUS should reference their CPA designation in connection with their employment with Baker Tilly.\"",
    "score": 1023,
    "url": "https://reddit.com/r/Accounting/comments/1mk5ghl/baker_tilly_is_now_requiring_cpas_that_work_for/",
    "created_at": "2025-08-07T16:55:44.000Z",
    "num_comments": 286
  },
  {
    "id": "reddit-1ky5tc7",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Is it true that Big 4 opens limitless career opportunities?",
    "text": "People often say that once you put in a few tough years at a Big 4, a world of opportunities opens up and the sky’s the limit. But when I look at the actual work and income, everything seems pretty standardized.\n\nI’ve read a lot on Reddit about CPA salaries, and honestly, even with years of experience, most people seem to cap out around $140K. Occasionally, you’ll see outliers earning over $200K, but they’re usually people who either transitioned out of accounting entirely or became partners at their firms.\n\nSo in the end, even for CPAs who’ve been through the Big 4, it seems like there’s still a ceiling on how far you can go in your career.",
    "score": 1020,
    "url": "https://reddit.com/r/Accounting/comments/1ky5tc7/is_it_true_that_big_4_opens_limitless_career/",
    "created_at": "2025-05-29T08:46:11.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1nljg8g",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Trump Announces $100,000 H1B Application Fee per Applicant",
    "text": "The Big 4 seem to have been caught off guard here.  Will anyone think about the poor partners and how they were planning to buy a 4th vacation home by saving money on American salaries?\n\nSection 1.  Restriction on Entry.  (a)  Pursuant to sections 212(f) and 215(a) of the Immigration and Nationality Act (INA), 8 U.S.C. 1182(f) and 1185(a), the entry into the United States of aliens as nonimmigrants to perform services in a specialty occupation under section 101(a)(15)(H)(i)(b) of the INA, 8 U.S.C. 1101(a)(15)(H)(i)(b), is restricted, except for those aliens whose petitions are accompanied or supplemented by a payment of $100,000 — subject to the exceptions set forth in subsection (c) of this section.  This restriction shall expire, absent extension, 12 months after the effective date of this proclamation, which shall be 12:01 a.m. eastern daylight time on September 21, 2025. \n\nhttps://www.whitehouse.gov/presidential-actions/2025/09/restriction-on-entry-of-certain-nonimmigrant-workers/ \n\nEdit How Indian scam tactics ruined H1B for other countries. \n\nhttps://www.hindustantimes.com/world-news/us-news/big-h-1b-lottery-rigging-racket-exposed-in-us-indian-american-linked-to-bluffing-the-system-denies-allegations-101722488075294.html",
    "score": 1019,
    "url": "https://reddit.com/r/Accounting/comments/1nljg8g/trump_announces_100000_h1b_application_fee_per/",
    "created_at": "2025-09-19T23:57:54.000Z",
    "num_comments": 451
  },
  {
    "id": "reddit-1muhee9",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Hot take: 99% of boomers in this field are inept and useless",
    "text": "From experience, here what they're good at:\n\n1- Showing up to work 2 hours before the standard start time and leaving 2 hours after the work day ends to give the illusion that they're hard workers, when in reality it's because they're extremely inefficient workers. I've seen them struggle to save and open files (they go to File--&gt;Save to save a file or to File---&gt; Open as if file explorer doesn't exist)\n\n2- They suck at technology. I've yet to see a boomer who's actually good using tech and isn't cancerous to work with\n\n3- They give stupid and outdated PEP talks that you're forced to listen to about life that are completely irrelevant in this day and age, and they believe all the bullshit they spew is fact and law which makes it even more unbearable.\n\n4- They don't want to pay employees. They think we still live in the 70s or 80s when everything was dirt cheap. Some of them barely understand inflation.\n\n5- They're super cringe to work with. Their humor is  awkward and old.\n\n6- The ones who are CPA's? I don't get it. The content and material has tripled since then so how do they still hold that title? They suck at accounting.\n\n7-Because they suck at technology, they suck at implementing processes and formulating solutions, so they throw it on the lower level employees and call it a day.\n\n8- They have bad temperament. A lot of the ones at the higher end of the chain are incredibly impatient and bad at understanding the reality of deadlines\n\nIf you disagree with any of this you're coping hard.",
    "score": 987,
    "url": "https://reddit.com/r/Accounting/comments/1muhee9/hot_take_99_of_boomers_in_this_field_are_inept/",
    "created_at": "2025-08-19T12:45:32.000Z",
    "num_comments": 364
  },
  {
    "id": "reddit-1l2n3cq",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "PowerQuery Helped Me Pivot Out of Accounting",
    "text": "Thought I’d share my recent career pivot experience because it might help someone else that’s feeling stuck in a Senior accounting role. Sorry for the long text ahead of time!\n\nTLDR: If you feel stuck in accounting, learn PowerQuery\n\n——\n\nGraduated from college about 7 years ago with my bachelor’s in accounting, quickly got my CPA and joined a middle market firm in audit. I absolutely dreaded it. Somehow lasted 2 years.\n\nMoved into a revenue analyst role, hated it. Lasted 8 months.\n\nMoved into a senior accounting role at a tech company doing technical research and Month-End close shortly after Covid began, enjoyed it more but still dreaded a lot of the job, but felt stuck because it paid well so I “needed” to stay. Lasted 2 years.\n\nTried pivoting out of accounting by going into financial services briefly. Lasted 7 months before I needed a larger salary again, so I again moved back to accounting.\n\nAt this point I was getting pretty depressed. All this time spent studying for the CPA, working weekends, etc. \n\nThese accounting jobs are paying low $100k’s, so by most standards I’m doing pretty well, but internally I had zero fulfillment from my work. I felt trapped in accounting with no easy way to pivot. I took another senior accounting role at a mid-size company, and this one changed my career trajectory.\n\nThe CFO pulled me into his office on my first day as a “get to know eachother”, and said “if you come in here and find a better way to do something, don’t ask, just do it.” For me, this opened the flood gates.\n\nAbout a year ago I started researching a lot on the topic of automation in accounting, and kept coming across PowerQuery, which I hadn’t heard of before. \n\nEvery day I was using PowerQuery to save time. This caught the eye of my team and soon I was doing live demos on PowerQuery for the whole finance and accounting function.\n\nBefore I knew it, I was on ChatGPT trying to speed up my queries, and went down the SQL rabbit hole, and later the Python rabbit hole. I was soon pulling out financial data from SQL to feed my completely automated Python reconciliations, completing hours of mundane work in seconds.\n\nI love doing this so much that I am now on the data analytics team, got a $20k pay bump, and this type of automation work is all I do.\n\nFrankly, finding PowerQuery completely changed my career and instilled a lot of fulfillment and happiness into my day to day. If you feel stuck in accounting, learn PowerQuery.\n\n",
    "score": 870,
    "url": "https://reddit.com/r/Accounting/comments/1l2n3cq/powerquery_helped_me_pivot_out_of_accounting/",
    "created_at": "2025-06-03T20:53:38.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1lpb4ej",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Congrats to Pennsylvania CPA candidates that no longer have to have 150 credits for full licensure starting yesterday June 30, 2025.",
    "text": "120 credits with 2 years work expierence is now an alternative pathway option for those who want it. \n\nBye bye useless and expensive Masters degree or 30 credits of Harry Potter classes.\n\nSources:\n\n* [https://www.palegis.us/legislation/bills/2025/sb0719](https://www.palegis.us/legislation/bills/2025/sb0719)\n* [https://www.palegis.us/legislation/bills/text/PDF/2025/0/SB0719/PN0862](https://www.palegis.us/legislation/bills/text/PDF/2025/0/SB0719/PN0862)\n   * Last page 19: \"Section 9. This act shall take effect immediately.\"",
    "score": 838,
    "url": "https://reddit.com/r/Accounting/comments/1lpb4ej/congrats_to_pennsylvania_cpa_candidates_that_no/",
    "created_at": "2025-07-01T19:34:41.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1j4ii6k",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "I am the only accountant at an S Corp:  Owner threatening to sue me.",
    "text": "I am the only accountant at an S Corp.  The company made $800k last year.  The owner thought that if he paid down debts and the cash balance was low at the end of the year that he would not owe too much in taxes (he is cash basis).  I did not advise him that that would not work and he is pissed.  I am a CPA and he asked if I have insurance.  Honestly, I am very busy covering everything and thinking about his personal taxes was not high on the list.  I have only been here six months and have never prepared business taxes before.  I did not prepare the return; outside accounting firm did.\n\nHe bought out two other partners last year and part of the agreement was that he would pay their taxes in 2024.  So he is pissed that he has to do this now.  \n\nAnyway, I thinking I will be fired.  I just hope that I won’t be sued.\n\n\n\n\n",
    "score": 834,
    "url": "https://reddit.com/r/Accounting/comments/1j4ii6k/i_am_the_only_accountant_at_an_s_corp_owner/",
    "created_at": "2025-03-06T00:20:42.000Z",
    "num_comments": 134
  },
  {
    "id": "reddit-1n2lsrv",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Job Market is actually shit",
    "text": "Just wanted to vent. Accounting Manager getting close to a decade of experience. Not only are the jobs that are posted (Manager and Controller positions) paying bad, but there’s so few of them. In SoCal $120K for a controller is not anything amazing and I’m not commuting for over an hour a day for that. I’ve decided to go off on my own and offer bookkeeping services to not starve and work on my CPA exams.",
    "score": 819,
    "url": "https://reddit.com/r/Accounting/comments/1n2lsrv/job_market_is_actually_shit/",
    "created_at": "2025-08-28T19:29:54.000Z",
    "num_comments": 214
  },
  {
    "id": "reddit-1kdxr5l",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Jeremy Renner blames “penny pinchers, the accountants”",
    "text": "Jeremy Renner, who plays Hawkeye for the Marcel franchise movies recently was offered half the pay to reprise his role in a second season of the Disney + series “Hawkeye”. Among other things he said, he stated “and this is not Marvel, mind you, this is Disney - not even really Disney, it’s just the penny pinchers, the accountants”.\n\nIs he really saying it’s not Disney but just those evil accountants that work at Disney? Putting a bad reputation on the accountants, who we all know more likely than not had absolutely no say on what his salary was going to be.\n\nWhat do you guys thinks about this?",
    "score": 809,
    "url": "https://reddit.com/r/Accounting/comments/1kdxr5l/jeremy_renner_blames_penny_pinchers_the/",
    "created_at": "2025-05-03T17:05:17.000Z",
    "num_comments": 191
  },
  {
    "id": "reddit-1j35k0g",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "OMFG - Another 10pm/7am India Call",
    "text": "Forget the long hours, the asshole partners, the 60 hour week grind for peanut pay. No, that’s not enough. To put the cherry on top, you now have to facilitate the offshoring by being on fucking Sunday night calls and daily early morning and late night calls like a fucking on call ER surgeon. \n\nDo not join this profession. Do not major in accounting. This is the future of onshore work. My god, just major in anything else that doesn’t make you want to blow your brains out. \n\nThe global flattening of salaries to facilitate global margins means we’re all going to be stuck at middling wealth levels without an inheritance or another major asset run up in the long run. \n\nFuck the AICPA for ruining our educational investments and robbing us of our youth to turn this into a developing world profession. They fucking lied and wasted our educational investment of not just our money, but our lives. I hope you all realize just how hard these greedy fuckwit boomers who run the state boards, aicpa, nasba, senior partners have fucked over this profession.\n\nFor anyone with brains go to a decent law school instead. At least you won’t have to deal with people who insist on their way at ungodly hours whose work you have to redo. \n\nHere’s the sad truth. There’s no way out. PE had bought up most decent private companies. Most middle market firms are being bought out. Offshoring is infecting every accounting job. And the onshore cpa boobs are left to pickup the pieces. Demand more for this shit of ruining every morning and every late night evening.",
    "score": 799,
    "url": "https://reddit.com/r/Accounting/comments/1j35k0g/omfg_another_10pm7am_india_call/",
    "created_at": "2025-03-04T07:35:31.000Z",
    "num_comments": 131
  },
  {
    "id": "reddit-1jce895",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "You know… maybe accounting isn’t so bad.",
    "text": "I went into it because it was this or nursing and ya girl don’t do well with blood or death, and pursuing a field in a saturated, unstable job market was just out of the question because… I was poor. And I was good at math and the salary averages looked great, so objectively, I was in.\n\nWhen I was in college, I HATED accounting. I almost dozed off every single lecture cause it was so boring and my professors had the demeanor of stereotypical accountants (meek and monotoned). Being poor with no scholarships I worked the whole time as a student—sometimes even 2 jobs, and was always running around and exhausted. Straight C student compared to the As I always got in high school without trying. To be fair, I also just don’t really know how to study cause I’d never had to.\n\nMy confidence in my intelligence was depleted, everyone was going into big 4 internships (internship was expected to get the last credits necessary for the program to graduate), I really only landed mine VERY last minute mostly due to the unfortunate circumstances of the Firm partner and his inability to participate in the meet the firm sessions. I had no money to get into my MBA then get my CPA like the route they pushed everyone to do, and I honestly had no clue where to go from there. I really struggled with if this was the right path for me.\n\nWell, I’m in my late 20s now and I genuinely enjoy the work. I started a senior accountant role last week, was a staff for a little while before that and compared to other job markets I feel like we still fare pretty well. Hopefully my perspective isn’t too skewed, but I’ve hardly ever had a job gap—even with COVID, even now. The only time I’ve been out of a job was from a toxic workplace where they fired someone once a month and I got the wrong end of the roulette. (Also dreaded working there anyway) Even then, I found something within a couple months (went ham though, obv) and really thrived there.\n\nThe job is honest, I can quantitatively showcase my achievements (I’d suck at pitching myself otherwise), and I enjoy working with excel. A lot. lol\n\nDo you guys genuinely enjoy your work, and what do you do? Or is it that “job that pays you well enough to enjoy life outside of it” kind of thing? I like to think that mine can be both.\n\nEdit: I appreciate the positivity from (most of) everyone! I didn’t think this was such an uncommon post on this sub lmao but I’m glad to inspire and wish everyone great outcomes on their journey. Mine has not been the most well-paying, clear-cut or even lucky path, but I’m glad to call it my own and to know what it took to get here.\n\nOh and to all the miserable people in the comments trying to shame me for liking my life: I work 45 hours a week tops, but typically less than. The people I work with are wonderful and support me when I need it, I am getting paid comfortably, my schedule is flexy and I could start at 10am if I wanted, which I don’t cause I’m excited to contribute and am not burnt out. 💛 sorry for ya life though",
    "score": 798,
    "url": "https://reddit.com/r/Accounting/comments/1jce895/you_know_maybe_accounting_isnt_so_bad/",
    "created_at": "2025-03-16T05:06:17.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1itf52v",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Super Disappointed in the AICPA and other Accounting organizations praising Trump &amp; DOGE, super hypocritical",
    "text": "I am a CPA and recently attended an online AICPA Town Hall webinar for CPE credit. What a few of the speakers said about the DOGE \"auditing\" the government and praising Elon and Trump made me very disappointed in them. DOGE and Trump are not trying to find fraud, waste, and abuse. They are trying to cut necessary programs and agencies to make up for the huge tax for the wealthy that Trump is trying to reinstate this year, along with privatizing those agencies to help the wealthy, and stop oversight of their misdealings. I was surprised that the AICPA speakers didn't at least question that there are zero government auditors and/or forensic accountants on the DOGE team doing these so called audits. Instead a bunch of child hackers/coders, who have very little experience and know nothing about the government are doing them. On top if that, the guy in charge, Elon, is a billionaire, who is also one of the largest government contractors, that gets government subsidies,  tax cuts, and contracts. HUGE red flags and conflict of interest, which is drilled into us CPAs and part of our rules &amp; regulations. I'm so very disappointed in the AICPA, as well as the lack of outcry from our community. Why aren't more accounting and financial professionals calling this crap out. I'm all for finding and weeding out government fraud, waste, and abuse, but what's going on isn't it, and I should know, as it's my job. ",
    "score": 783,
    "url": "https://reddit.com/r/Accounting/comments/1itf52v/super_disappointed_in_the_aicpa_and_other/",
    "created_at": "2025-02-19T20:06:09.000Z",
    "num_comments": 153
  },
  {
    "id": "reddit-1ibpv2i",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Let go today due to outsourcing",
    "text": "Just a rant.  Accounting manager role left a company of 4 years in April 2024 to join this one as I was promised the world and more.  Was let go today due to “restructuring costs” as they were able to bring in a controller and senior accountant from outsourcing to the Philippines  for less than my salary.\n\nThe 9 months of being employed was told nothing but how great I am and the smartest person to have been hired.  Was given 0 warning and 2 weeks of severance which seems like an absolute slap in the face for how “valuable” I was to them.\n\nFeel completely blindsided as I didn’t see this coming.  My team felt completely blindsided when I started walking around shaking their hands wishing them good luck.\n\nI am not even sure how to process this given that even technical skills can’t compete with outsourcing.  Just giving me some time to process before getting to send out job applications.\n\nThank you for reading \n\n\nThank you all for the outpour of support. I did not expect this but I am grateful for this community and all of you.  We are all people first and my hope is that someday we get vindication from companies that treat us like doormats.  For now my job search begins and I hope you all stay vigilant .",
    "score": 782,
    "url": "https://reddit.com/r/Accounting/comments/1ibpv2i/let_go_today_due_to_outsourcing/",
    "created_at": "2025-01-28T01:18:16.000Z",
    "num_comments": 153
  },
  {
    "id": "reddit-1n3fiww",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Today I leave accounting to become a High School Business Teacher",
    "text": "I think the end game for most (not all) people in accounting (and the corporate world in general to be fair) is simply not worth it. Long hours, close cycles, busy season cycles, all so you can be tossed to the side of the road via corporate restructuring, layoffs, offshoring, new leadership, private equity, etc…\n\nThe only routes which really seemed worth it long term in this profession were working for the government (which has absolutely been blown apart by the current administration) and/or potentially self employment.\n\nMy new role will be paying me only $70k in a LCOL area, but I have 15 weeks off, finish teaching at 2:30, and have all the time and energy in the world left to pursue self employment opportunities now.\n\nAccounting was supposed to be a stable role, but it (like pretty much every other white collar job) is under pressure like nothing I’ve seen before. As a teacher I’ll never have to worry about my job being sent overseas, or an AI robot teaching a classroom as if parents would ever accept that.\n\nCrunching the numbers, I’m essentially paid more on an hourly basis than most accounting managers/controllers especially considering the ones averaging 50-55+ hours a week if not more. \n\n•\tSalary: $70,000\n\t•\tContract Days: 187\n\t•\tDaily Rate: $70,000 ÷ 187 ≈ $374/day\n\t•\tHours per Day: 7.5\n\t•\tTotal Hours/Year: 187 × 7.5 = 1,402.5 hrs\n\t•\tHourly Rate: $70,000 ÷ 1,402.5 ≈ $49.9/hr (~$50/hr)\n\n•\tAnnual Hours: 52.5 × 52 = 2,730 hrs\n\t•\tHourly Rate: $130,000 ÷ 2,730 ≈ $47.6/hr (~$48/hr)\n\nI still think there can be rewarding careers in accounting, but it won’t be in corporate America or in large firms. Either go solo, find a small niche company/firm/practice, or explore what other public sector jobs might be worthwhile.\n\nThe purpose of this post isn’t to disincentivize ppl from pursuing accounting as a career, it’s to pivot the attitude and expectations. I already know and expect comments saying how I’m out of touch, or that I’m looking at things the wrong way. So be it, I’ve been at too many places now and every single one has managers, Senior Managers, Directors, VPs, etc… working every moment of every day. That’s not going to be me in my 30s and 40s, life is too precious. ",
    "score": 776,
    "url": "https://reddit.com/r/Accounting/comments/1n3fiww/today_i_leave_accounting_to_become_a_high_school/",
    "created_at": "2025-08-29T18:38:10.000Z",
    "num_comments": 224
  },
  {
    "id": "reddit-1lf2i1p",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Every accounting job has 100+ applicants and this is not okay at all.",
    "text": "We have people with like 3-5 years of experience, cpa finalists/qualified accountants competing for entry level roles. How do you get a damn job nowadays??? ",
    "score": 773,
    "url": "https://reddit.com/r/Accounting/comments/1lf2i1p/every_accounting_job_has_100_applicants_and_this/",
    "created_at": "2025-06-19T05:08:44.000Z",
    "num_comments": 283
  },
  {
    "id": "reddit-1jiuc4u",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "My first paystub at a small CPA firm in 1986",
    "text": "The firm was located in a HCOL area. It had 4 partners &amp; 5 accounting &amp; support staff. We were paid salary twice a month, and we banked all overtime to be used like PTO.",
    "score": 770,
    "url": "https://reddit.com/r/Accounting/comments/1jiuc4u/my_first_paystub_at_a_small_cpa_firm_in_1986/",
    "created_at": "2025-03-24T16:06:35.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1jjc5gn",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Sometimes getting fired is OK",
    "text": "A year ago, I landed what I thought was my dream job. Hybrid schedule, huge salary, and responsibilities and deliverables that were manageable. I had been with my prior company for seven years - I only left for the money. It was a very familial / buddy environment. I was comfortable with my DRs and my boss. I could freely express myself, and I gave them the same courtesy. \n\nAfter a few months at the new company, I started to recognize the strict, conservative hierarchy. Little things... On our WFH days, my start time was watched like a hawk. After being in the office at 5am to accompany an auditor on an inventory count, and staying until 6pm to finish our month end reporting package, the next day I slept in and was online at 9:30. I had no deliverables due that day, yet received an official warning. \n\nA month later, after a hurricane left most of the F&amp;A department without power, I was being badgered by the parent company to get them the financials, without the support of my team. \n\nA month later, it was a working Saturday. I signed on at 9am and was immediately chastised by my boss that \"everyone else has been online since eight\". I thought working Saturdays meant we simply got out shit done, no matter how, or when, we did it. This is when I started having doubts about the company / culture. \n\nI pressed through another six months. I had a freak month of February where I had a series of unfortunate events, involving medical and car issues. Prior to this, I had never missed an in office day. After the last instance, I texted my manager that \"I can't make this shit up - I am unable to make it to the office tomorrow because I'm dealing with this.\" Thirty minutes later, the VP fired me via text. \n\nI spent a day getting drunk, and then started the grind. Updated my resume and called every recruiter I knew, connected with a lot of new recruiters, and started applying for every job directly that I saw on LI. Less than 2 weeks after I was fired, the CEO of a company contacted me directly. Exactly two weeks after being fired, I had an interview with him. Two days later, I met the executive team. The next day, I received an offer, for the same salary I was at, with a guaranteed raise in six months. \n\nToday was three weeks since I was fired, and it was my first day at my new job. I already love it. \n\nGetting fired sucks. But it doesn't have to be the end of the world. I missed a paycheck and a half. We were able to live thru that by adjusting out budget and doing simple things like getting a one month extension on car, mortgage, and student loan payments. \n\nI realize this is not everyone's reality - but if you find yourself fired tomorrow, I hope my story gives you hope. ",
    "score": 755,
    "url": "https://reddit.com/r/Accounting/comments/1jjc5gn/sometimes_getting_fired_is_ok/",
    "created_at": "2025-03-25T05:22:36.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1kspuww",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "8 years in government. You know what? I’m not leaving. ($652k net worth)",
    "text": "As a foreword, I want to acknowledge the many dedicated public servants who, through no fault of their own, are subject to RIFs or are in limbo after being fired and then reinstated. I delayed my annual post significantly this year because it didn’t feel right to do with all the probationary firings happening. I wish all of you the best.\n\n---\n\nTL;DR: I followed this sub in college, decided fuck PA, and started at the federal government in 2017 straight out of college. Work is reasonable(ish). Life is great. My net worth has gone from ($20k) at graduation to $652k as of 12/31/24. My wife’s (elementary teacher turned admin assistant) net worth has grown to $304k. We also have joint assets totaling $14k, giving us a household net worth of $970k for the year ended 12/31/24. We’re both 31. Government jobs might not pay as much as PA and industry, but there's still plenty of room for success.\n\n**Career:**\n \nI work as a financial auditor for the federal government. My OPM career code is 0511 for those interested. My day-to-day work is exactly the same as PA audit work. I have 8 years of experience now. I will always be grateful to this sub for lifting the curtain on the nature of PA work and for pointing me towards a government job. Around 10 years ago (scary to think about) in a thread about internships someone commented that government internships are often overlooked. On a whim I went over to USAJOBS.gov to see what federal internships were available, applied to several, and the rest is history. This post is partially to be that for the next generation of students.\n \nI started out making $60k. Last year my salary was $112k, however my final pay stub for 2024 showed $121k grossed due to overtime pay and student loan repayment benefits. Since then I both took a pay cut due to relocating to a MCOL area and also got a raise due to a promotion to GS-13, the net effect putting me at $118k. I don’t have a masters or a CPA. I considered becoming a CPA after I started working but quickly decided against it. I spent my free time after work as actual free time and met my now wife instead :).\n \nIf you want to climb the ladder quickly government is absolutely not the place to go. I went into it expecting a very slow climb and even I was starting to get disillusioned with the growing gap of my job responsibilities vs title and pay. $118 for 8 years’ experience in a MCOL is nothing special. My peers who went PA are certainly leaps and bounds ahead of me in salary and title. However, it’s more than good enough for me. When I picked accounting, my goal was a career that paid me ‘enough’ to live well, while giving me the best work-life-balance possible. A federal career has absolutely provided that. Any large increase in salary would probably come with a decrease in work-life balance, and that’s simply not worth it to me.\n \n**Work-Life balance:**\n \nExcellent. I work 40-hour weeks nearly year-round. I earn 4 weeks PTO and 2.5 weeks sick leave each year, in addition to 10 federal holidays. Like last year, this past busy season I had about 4 weeks again where I needed to work 60-hour weeks. I’m really not a fan of having to work OT, but the short-ish duration and 1.5x pay makes it bearable. \nMy job is still classified as remote and because of that we were able to move out of the DC area since my 2024 post. Remote work is the single best quality of life work benefit I’ve ever had and is a huge reason I haven’t jumped ship.\n \nOne of the other nice perks is that vacations are truly vacations. I've never had a boss expect me to work or be available when out on PTO. When I’m out of the country it’s literally illegal for me to check my work email. How’s that for forced work-life balance?\n \n**Personal Finance:**\n \nI found the /r/financialindependence sub in college too and decided I wanted to retire early. I made retirement contributions a priority and have maxed out my TSP (gov 401K), IRA, and HSA every year since 2017. It took quite a bit of effort the first couple years but my salary grew quickly. Those first few years of contributions set us up for life. If I dropped my TSP contributions to 5% and we stopped all other contributions, our combined retirement savings are on track to still grow to ~$6.5M (all projections in inflation-adjusted, 2025 dollars. 7% growth rate) by the time we hit age 57.\n \nWe're at around a 43% savings rate right now. We don't feel like those contributions currently hold us back though, so we still make them. With our current savings rate we’re on track to have ~$4.1M by age 45, though we’ll probably back off on our savings well before that due to lifestyle changes like kids. Halving our savings rate starting today would put us at ~$3.3M at 45, which should still be more than enough for us to retire if we wanted.\n \nThe biggest factor (beyond making enough money TO invest, which we’re grateful we do) is investing early. Investing $1k/mo for 10 years from age 25-35, then nothing from age 35-65 results in more money (~$1.4M) than investing $1k/mo for 30 years from age 35-65 (~$1.2M).\n \n**Net Worth:**\n \nThe S&amp;P500 was up ~25% in 2024, so my net worth jumped to $652k. My wife’s net worth jumped to $304k. We also have joint assets totaling $14k, giving us a household net worth of $970k for the year ended 12/31/24. With the market volatility we’ve crossed the $1M threshold many times, both before and after 12/31/24.\n \nOur net worth figures do not include any real assets. It's financial accounts (retirement, brokerage, cash, etc.) only. We do not own any real-estate and continue to rent a single-family home instead. Even in our MCOL area it’s cheaper to rent a SFH than buy. We are the proverbial couple that chooses to rent and invest the difference. \n \nEven though we’re married, I plan to continue posting annual updates outlining my accounts (to demonstrate how I’m progressing with a federal accounting career). We plan to keep our accounts mostly separate, which makes record keeping easier.\n \nHere is my updated net worth tracker.\n\n|**ASSETS**|**12/31/2016**|**12/31/2017**|**12/31/2018**|**12/31/2019**|**12/31/2020**|**12/31/2021**|**12/31/2022**|**12/31/2023**|**12/31/2024**|\n:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|Cash (incl HYSA)|$ 2,576|$ 6,562|$ 15,272|$ 26,022|$ 20,320|$ 26,334|$ 32,257|$ 43,895|$ 47,273|\n|TSP|$ -|$ 22,448|$ 41,213|$ 79,546|$ 124,048|$ 178,928|$ 168,494|$ 241,445|$ 327,007|\n|Pension contributions (refundable)|$ -|$ 2,536|$ 5,880|$ 9,559|$ 13,460|$ 17,498|$ 21,743|$ 26,302|$ 31,194|\n|HSA|$ -|$ 3,535|$ 6,565|$ 11,656|$ 17,766|$ 25,698|$ 24,298|$ 34,632|$ 47,535|\n|IRA|$ -|$ -|$ -|$ 12,538|$ 21,969|$ 32,191|$ 24,338|$ 28,476|$ 33,579|\n|Roth IRA|$ -|$ 6,015|$ 10,924|$ 14,289|$ 17,287|$ 22,248|$ 25,526|$ 40,675|$ 57,652|\n|Brokerage|$ -|$ -|$ -|$ -|$ 29,868|$ 53,980|$ 53,498|$ 77,952|$ 107,875|\n|Total Assets|$ 2,576|$ 41,096|$ 79,854|$ 153,609|$ 244,719|$ 356,877|$ 350,154|$ 493,376|$ 652,115|\n|||||||||||\n|**DEBTS**|**12/31/2016**|**12/31/2017**|**12/31/2018**|**12/31/2019**|**12/31/2020**|**12/31/2021**|**12/31/2022**|**12/31/2023**|**12/31/2024**|\n|Student Loans|$ 22,885|$ 21,639|$ 19,936|$ 17,182|$ 13,454|$ 10,334|$ 7,084|$ 3,393|$ -|\n|Total Debt|$ 22,885|$ 21,639|$ 19,936|$ 17,182|$ 13,454|$ 10,334|$ 7,084|$ 3,393|$ -|\n|||||||||||\n|**Net Worth**|**12/31/2016**|**12/31/2017**|**12/31/2018**|**12/31/2019**|**12/31/2020**|**12/31/2021**|**12/31/2022**|**12/31/2023**|**12/31/2024**|\n||$ (20,309)|$ 19,457|$ 59,918|$ 136,428|$ 231,265|$ 346,543|$ 343,070|$ 489,983|$ 652,115|\n|YoY Change||$ 39,766|$ 40,461|$ 76,510|$ 94,838|$ 115,278|$ (3,473)|$ 146,913|$ 162,132|\n\n**FAQs:** Did you live at home? In community college, yes. After that, no. After moving to DC I split a 2br/1ba apartment with a co-worker to save $$$. A few years later my then-fiancée and I moved into a 1br apartment together.\n \nDid you parents support you financially? Yes. I was given a car (98-02 accord) in HS which I kept until 2020. I went to community college and lived at home. My parents also paid for my first year of rent when I moved away for a cheap in-state college. However, after graduating (with $23k in student loans), the only ongoing financial support I received was staying on the family phone and Netflix plan for several years. I would have lived at home if I could, but a several-hundred-mile commute would have been a bit much.\n \nDid you get lucky gambling in crypto, meme stocks, etc? No. I only do index funds (ex: VTSAX).\n \nHow did your traditional IRA go from $0 in 2018 to $12,538 in 2019? The IRS allows IRA contributions for the PY until approximately April 15th. For 2016 through 2018 I was always a year behind on contributions. By 2019 my salary had grown enough to catch up so I made 2 years of contributions (2018 and 2019) in 2019.\n \nYou don’t have kids, do you? Nope, not yet.",
    "score": 723,
    "url": "https://reddit.com/r/Accounting/comments/1kspuww/8_years_in_government_you_know_what_im_not/",
    "created_at": "2025-05-22T12:49:13.000Z",
    "num_comments": 144
  },
  {
    "id": "reddit-1k4dzor",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Any of yall climb the corporate ladder chasing the salary, then realize you hate the responsibility and workload, but don't want to go down the ladder to a lower salary?",
    "text": "So I have been a controller for the last 3 years, making roughly $130-$150K. I am finding I just don't really like it. I want to analyze data and focus just on financials, not worrying about controlls, procedures, and policies lol. I want to stop being a controller, but not stop making $150K lol.\n\nAnyone else in this boat? What did you do? Is it possible to go work two remote senior accountant jobs making $100K a piece? Is there something else I could look into.",
    "score": 706,
    "url": "https://reddit.com/r/Accounting/comments/1k4dzor/any_of_yall_climb_the_corporate_ladder_chasing/",
    "created_at": "2025-04-21T13:49:47.000Z",
    "num_comments": 162
  }
]