[
  {
    "id": "reddit-1iz42et",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "My life changed this week",
    "text": "I’m a CPA I’m 31 I’ve had a decent career. I just got diagnosed with leukemia and none of it seems worth it looking back on it. Of course, I’ve earned myself a decent salary and decent insurance and nice remote role which probably is all privilege a lot of others are not offered. \n\nI just always felt I had a lot more road left to run on my career and now that face a real life risk of losing my life, it just seems so meaningless. \n\nI have a wife, a toddler, and now that I’m hospital-bed ridden I just see things so much differently. I really worry I will not have left enough behind for them to thrive. Just needed a place to vent I guess. My mind is generally a dark place and a diagnosis like this does not help.\n",
    "score": 4073,
    "url": "https://reddit.com/r/Accounting/comments/1iz42et/my_life_changed_this_week/",
    "created_at": "2025-02-27T01:27:08.000Z",
    "num_comments": 231
  },
  {
    "id": "reddit-1iw3y62",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "From corporate controller to “bookkeeper” and why I’ll never go back",
    "text": "8 years ago, I was at the top of my career, recently promoted to controller of a pre-IPO biotech after building an accounting team from scratch to 10. I thought I’d made it. Then I got pregnant and took maternity leave. \n\nPriorities shifted and I didn’t care to go back to working 50+ hour weeks. So… I started doing some freelance bookkeeping on upwork. I discovered a purpose I didn’t know I had: giving small businesses access to big business talent. \n\nIt was kinda hard calling myself a bookkeeper (holding a CPA) but it isn’t about the title. It’s about being approachable and being able to truly help business owners. \n\nIf you’re trying to figure out your next career move, maybe you’ve been laid off, or you want to stay home with kids… travel the world… there’s millions of small businesses who need your help. Big4 isn’t the only path for accountants. 🩵\n",
    "score": 2610,
    "url": "https://reddit.com/r/Accounting/comments/1iw3y62/from_corporate_controller_to_bookkeeper_and_why/",
    "created_at": "2025-02-23T06:34:53.000Z",
    "num_comments": 254
  },
  {
    "id": "reddit-1ibjv3u",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Accounting has taken me from $7.50/hour to $100k in a few years…",
    "text": "\nMy prior post: https://www.reddit.com/r/Accounting/s/QntkYr3HEm\n\nI rejected the 5% counter and I start the ‘Accounting Manager’ job next week. Pretty scared as I have 3 YOE, but a 15M company owned by a 100M can’t be TOO complex, right?\n\nCareer Trajectory:\n\n2020-2021 : Courtesy Clerk at grocery store making $7.50/hour\n\n2021-2023: Started as a manufacturing planner at a large medical equipment manufacture. Talked the controller into bringing me on as a staff accountant. Went from $15-hour to $19/hour.\n\n2023-2024: Became a Staff Accountant at a me manufacturer down the street from above. Started at $55k and went up to $65k when I graduated.\n\n2024-2025: Financial Analyst for a community hospital owned by a for-profit F500 system. They wanted to bring me in at mid 60s but I negotiated $75k\n\n2025-Present: Accounting Manager for a small (15M rev) company owned as a brand by a $100M+ revenue company. Brought me on because of my experience with their ERP and excel/power platform qualifications. $98.6k plus bonus\n\n\nPretty nervous, but it’s crazy that I have went from $7.50/hour pushing buggies to making basically six-figures ina few years because of ACCOUNTING. \n\nI live in a rural albeit growing area as well. My mom was an escort and my dad was a pimp, in prison for most of my life. I’m not supposed to be here by all accounting, but here I am at 23. AND I’m black lol.\n\nCount your blessings bros. This is an amazing profession. I even flunked out of school my first year. Came home, applied to CC to take classes online, and didn’t fail another class while working fulltime as well. I graduated in 2024 during the Staff Accountant job above.",
    "score": 2242,
    "url": "https://reddit.com/r/Accounting/comments/1ibjv3u/accounting_has_taken_me_from_750hour_to_100k_in_a/",
    "created_at": "2025-01-27T20:57:39.000Z",
    "num_comments": 317
  },
  {
    "id": "reddit-1i87tqv",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Stop Asking if you Can Quit During Busy Season -- You Can",
    "text": "I'll keep this quick, as I am in between management override calls currently and my next one is in 10 mins.\n\nYou can quit during busy season. It's not a faux pas. It's not career suicide.\n\nI understand a lot of you are in your early 20s, but you need to listen to this very closely. This job is the most meaningless thing you will ever do in your life. You are collecting a check. The partners you serve are collecting a check. Some of them provide real value. Some do not. If your team and/or partner gets upset because you left a job, you don't want to associate with them anyway. They are not good people if that's the attitude they have.\n\nThe days of being loyal to any firm, company, or really anyone other than yourself and your family are long gone. You are not deserting patients here. You aren't leaving anyone in battle, or discontinuing important research, or deciding to not serve your community. You are a person who sits at a computer and collects a check by doing accounting work. If it goes further than you doing a good job at that, you have lost the thread.\n\nQuit your job if you want to quit your job. It won't harm you in any capacity. It won't derail your career. It's very unlikely (although not impossible) that your team will think about you for longer than a week after you leave. \n\nI see 10 threads a day (or it seems like that anyway) on if you should quit. Here's the decision path:\n\nDo you want to quit? Quit\n\nDo you not want to quit? Don't quit.\n\n  \nEither way, and this is the most important part, it truly does not make a difference. Nobody else cares.",
    "score": 1666,
    "url": "https://reddit.com/r/Accounting/comments/1i87tqv/stop_asking_if_you_can_quit_during_busy_season/",
    "created_at": "2025-01-23T16:50:38.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1o3h4vw",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "When i was in college, i didn't understand why people left Big 4 firms so quickly",
    "text": "i remember being a naive college kid looking at LinkedIn profiles of people who worked at Big 4. i noticed that there was a tendency to leave the firms quickly. many people left in less than one year.\n\nwhy would they quit working at such a prestigious workplace? Big 4 was the place to be! some of them even quit to go work at smaller, lesser known companies. my young mind couldn't comprehend why this was occurring. it made no sense to me at the time.\n\na few months into my Big 4 job during busy season, i finally understood why people left these firms. the hours are brutal and the work is mind-numbing. you have no life when you work at one of these firms. it's a corporate sweatshop. it's a toxic work environment. \n\nlooking back in hindsight, it's amazing how glorified these firms are when you are a student. it's kind of evil and manipulative how they hype these firms up, as if this is the dream destination and you are a failure if you don't get a Big 4 job. \n\nthe partners at these firms are just looking to exploit young naive kids for cheap labor. they want to hire the try hard type A personalities who are willing to work 80 hour weeks.\n\nthe dream of working in Big 4 is one big evil lie. i've met plenty of people who have successful careers in accounting without ever stepping foot in one of these firms. \n\n",
    "score": 1403,
    "url": "https://reddit.com/r/Accounting/comments/1o3h4vw/when_i_was_in_college_i_didnt_understand_why/",
    "created_at": "2025-10-11T00:01:45.000Z",
    "num_comments": 195
  },
  {
    "id": "reddit-1oemfgs",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Went into IT Audit at Big 4. This has to be the most boring, joke job of all time.",
    "text": "Was completely new to this career line since I never studied it at uni and never took a course on IT auditing or SOX compliance. I'm telling you I feel like a middle schooler could do this stuff. Taking screenshots, being in 10 different Teams calls a day, then asking the client for a list of names that have admin permissions and just copy pasting them into a table. \n\nThis HAS to be the most boring \"accounting\" career bar none.",
    "score": 1322,
    "url": "https://reddit.com/r/Accounting/comments/1oemfgs/went_into_it_audit_at_big_4_this_has_to_be_the/",
    "created_at": "2025-10-24T02:39:52.000Z",
    "num_comments": 158
  },
  {
    "id": "reddit-1k57uq0",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Audit workpaper from last year just made my day",
    "text": "Was having a rough morning. Then I open our finalized audit engagement for the previous year to take a look at expense analytics. The companies salary and related benefits was way down. The explanation? A red arrow on Excel that just points to a mugshot of a disheveled older man. Turns out it was their former CEO.\n\nDude got arrested for fraud so their expenses went down substantially. Absolutely hilarious thinking about the partner and internal review looking over that workpaper and signing off on it.",
    "score": 1228,
    "url": "https://reddit.com/r/Accounting/comments/1k57uq0/audit_workpaper_from_last_year_just_made_my_day/",
    "created_at": "2025-04-22T14:35:27.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1kybypp",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Passed over promotion because my co-worker came into the office more than I did",
    "text": "Was up for VP Finance promotion this year as there was an opening. It was between me and my other team-member. He's a great team-mate to be honest and a hard worker, great skillset. Current company policy is hybrid that entailed coming in at least 2 times per week, which I was comfortable with because I live quite closeby to the office. Employees are free to come in more if they wanted to. I don't mind coming in because I am really close with my team and everyone is incredibly friendly and outgoing, and I get more work done (personally). Our CFO spoke to me yesterday that they were going with my team-mate. Main reasons were that he came in everyday and was closer with the senior management team because they saw him in the office everyday and that he showed \"more initiative\" by being at the office often. CFO said both of us were really talented in our roles, but senior management simply went with the other candidate because he was actively coming in more. \n\nStill bummed out about the decision because I was simply following rules and going in 2 times per week. This is just a warning for those that prefer and think WFH is better for your career. This isn't always the case. For ambitious CPA's out there, just go into the office more and mingle. Facetime at the office goes a long way and being present in the office with upper management really pays off.",
    "score": 1031,
    "url": "https://reddit.com/r/Accounting/comments/1kybypp/passed_over_promotion_because_my_coworker_came/",
    "created_at": "2025-05-29T14:18:20.000Z",
    "num_comments": 318
  },
  {
    "id": "reddit-1nljg8g",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Trump Announces $100,000 H1B Application Fee per Applicant",
    "text": "The Big 4 seem to have been caught off guard here.  Will anyone think about the poor partners and how they were planning to buy a 4th vacation home by saving money on American salaries?\n\nSection 1.  Restriction on Entry.  (a)  Pursuant to sections 212(f) and 215(a) of the Immigration and Nationality Act (INA), 8 U.S.C. 1182(f) and 1185(a), the entry into the United States of aliens as nonimmigrants to perform services in a specialty occupation under section 101(a)(15)(H)(i)(b) of the INA, 8 U.S.C. 1101(a)(15)(H)(i)(b), is restricted, except for those aliens whose petitions are accompanied or supplemented by a payment of $100,000 — subject to the exceptions set forth in subsection (c) of this section.  This restriction shall expire, absent extension, 12 months after the effective date of this proclamation, which shall be 12:01 a.m. eastern daylight time on September 21, 2025. \n\nhttps://www.whitehouse.gov/presidential-actions/2025/09/restriction-on-entry-of-certain-nonimmigrant-workers/ \n\nEdit How Indian scam tactics ruined H1B for other countries. \n\nhttps://www.hindustantimes.com/world-news/us-news/big-h-1b-lottery-rigging-racket-exposed-in-us-indian-american-linked-to-bluffing-the-system-denies-allegations-101722488075294.html",
    "score": 1024,
    "url": "https://reddit.com/r/Accounting/comments/1nljg8g/trump_announces_100000_h1b_application_fee_per/",
    "created_at": "2025-09-19T23:57:54.000Z",
    "num_comments": 451
  },
  {
    "id": "reddit-1ky5tc7",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Is it true that Big 4 opens limitless career opportunities?",
    "text": "People often say that once you put in a few tough years at a Big 4, a world of opportunities opens up and the sky’s the limit. But when I look at the actual work and income, everything seems pretty standardized.\n\nI’ve read a lot on Reddit about CPA salaries, and honestly, even with years of experience, most people seem to cap out around $140K. Occasionally, you’ll see outliers earning over $200K, but they’re usually people who either transitioned out of accounting entirely or became partners at their firms.\n\nSo in the end, even for CPAs who’ve been through the Big 4, it seems like there’s still a ceiling on how far you can go in your career.",
    "score": 1023,
    "url": "https://reddit.com/r/Accounting/comments/1ky5tc7/is_it_true_that_big_4_opens_limitless_career/",
    "created_at": "2025-05-29T08:46:11.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1osol30",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Majoring in Accounting Was the Best Decision",
    "text": "Honestly, majoring in Accounting was the best decision I’ve ever made. I picked it because it didn’t seem overly complicated, just something solid for someone who wanted a stable career and a good life.\n\nI came to the U.S. when I was 13, and it was my first time learning English. My dad worked 60 hours a week for $10/hr, paying rent, bills, and everything. Coming from a background where my dad worked that hard just to make ends meet, earning $55K straight out of college felt unreal.\n\nIn college, a lot of companies came to recruit, including the Big 4. I was terrible at interviews. I’d make it to final rounds but always get rejected. My first internship came through a referral, but I declined their full-time offer because I wanted public accounting experience on my resume.\n\nAfter leaving public accounting 2 years later, getting interviews and job offers became so easy. Some companies were willing to go up to $85K. Now I make around $75K plus a $10–18K bonus, fully remote, and honestly, it’s the easiest job I’ve had. You can usually make more if you keep jumping between firms, but sometimes you have to choose if you like your job. \n\nJust putting this out there, Accounting might not sound flashy, but there’s so much opportunity for growth, stability, and good pay if you stick with it. It’s also one of the easiest majors to find a job in while you’re still in college. ",
    "score": 969,
    "url": "https://reddit.com/r/Accounting/comments/1osol30/majoring_in_accounting_was_the_best_decision/",
    "created_at": "2025-11-09T17:04:30.000Z",
    "num_comments": 91
  },
  {
    "id": "reddit-1l2n3cq",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "PowerQuery Helped Me Pivot Out of Accounting",
    "text": "Thought I’d share my recent career pivot experience because it might help someone else that’s feeling stuck in a Senior accounting role. Sorry for the long text ahead of time!\n\nTLDR: If you feel stuck in accounting, learn PowerQuery\n\n——\n\nGraduated from college about 7 years ago with my bachelor’s in accounting, quickly got my CPA and joined a middle market firm in audit. I absolutely dreaded it. Somehow lasted 2 years.\n\nMoved into a revenue analyst role, hated it. Lasted 8 months.\n\nMoved into a senior accounting role at a tech company doing technical research and Month-End close shortly after Covid began, enjoyed it more but still dreaded a lot of the job, but felt stuck because it paid well so I “needed” to stay. Lasted 2 years.\n\nTried pivoting out of accounting by going into financial services briefly. Lasted 7 months before I needed a larger salary again, so I again moved back to accounting.\n\nAt this point I was getting pretty depressed. All this time spent studying for the CPA, working weekends, etc. \n\nThese accounting jobs are paying low $100k’s, so by most standards I’m doing pretty well, but internally I had zero fulfillment from my work. I felt trapped in accounting with no easy way to pivot. I took another senior accounting role at a mid-size company, and this one changed my career trajectory.\n\nThe CFO pulled me into his office on my first day as a “get to know eachother”, and said “if you come in here and find a better way to do something, don’t ask, just do it.” For me, this opened the flood gates.\n\nAbout a year ago I started researching a lot on the topic of automation in accounting, and kept coming across PowerQuery, which I hadn’t heard of before. \n\nEvery day I was using PowerQuery to save time. This caught the eye of my team and soon I was doing live demos on PowerQuery for the whole finance and accounting function.\n\nBefore I knew it, I was on ChatGPT trying to speed up my queries, and went down the SQL rabbit hole, and later the Python rabbit hole. I was soon pulling out financial data from SQL to feed my completely automated Python reconciliations, completing hours of mundane work in seconds.\n\nI love doing this so much that I am now on the data analytics team, got a $20k pay bump, and this type of automation work is all I do.\n\nFrankly, finding PowerQuery completely changed my career and instilled a lot of fulfillment and happiness into my day to day. If you feel stuck in accounting, learn PowerQuery.\n\n",
    "score": 868,
    "url": "https://reddit.com/r/Accounting/comments/1l2n3cq/powerquery_helped_me_pivot_out_of_accounting/",
    "created_at": "2025-06-03T20:53:38.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1oathlu",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "John Summit went from working 9 a.m. to 9 p.m. in a $65,000 job to a multimillionaire DJ—‘I make more in one show than I would in my entire accounting career’",
    "text": "",
    "score": 845,
    "url": "https://reddit.com/r/Accounting/comments/1oathlu/john_summit_went_from_working_9_am_to_9_pm_in_a/",
    "created_at": "2025-10-19T16:07:27.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1hx19x0",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "This sub went from ~400K to 1M members in just over a year… ",
    "text": "Just wondering if this is mostly new accounting majors, because I'm in the middle of a (2nd career) acc. master's program, and was hoping to take advantage of the fact that, according to the Wall Street Journal, \"over 300,000 accountants left the profession between the years of 2019 and 2021 — a 17% decline in the talent pool.\" Has there been a huge influx of new accounting majors, which will translate to a saturated job applicant pool? Or has Reddit in general just been getting exponentially more popular resulting in huge bumps in membership in lots of subs? I'm not on here enough to be able to tell, but a bump of over 100% membership in less than 2 years seems pretty significant... just curious what others think could be the most likely explanation.",
    "score": 827,
    "url": "https://reddit.com/r/Accounting/comments/1hx19x0/this_sub_went_from_400k_to_1m_members_in_just/",
    "created_at": "2025-01-09T01:42:07.000Z",
    "num_comments": 204
  },
  {
    "id": "reddit-1kdxr5l",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Jeremy Renner blames “penny pinchers, the accountants”",
    "text": "Jeremy Renner, who plays Hawkeye for the Marcel franchise movies recently was offered half the pay to reprise his role in a second season of the Disney + series “Hawkeye”. Among other things he said, he stated “and this is not Marvel, mind you, this is Disney - not even really Disney, it’s just the penny pinchers, the accountants”.\n\nIs he really saying it’s not Disney but just those evil accountants that work at Disney? Putting a bad reputation on the accountants, who we all know more likely than not had absolutely no say on what his salary was going to be.\n\nWhat do you guys thinks about this?",
    "score": 807,
    "url": "https://reddit.com/r/Accounting/comments/1kdxr5l/jeremy_renner_blames_penny_pinchers_the/",
    "created_at": "2025-05-03T17:05:17.000Z",
    "num_comments": 191
  },
  {
    "id": "reddit-1j35k0g",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "OMFG - Another 10pm/7am India Call",
    "text": "Forget the long hours, the asshole partners, the 60 hour week grind for peanut pay. No, that’s not enough. To put the cherry on top, you now have to facilitate the offshoring by being on fucking Sunday night calls and daily early morning and late night calls like a fucking on call ER surgeon. \n\nDo not join this profession. Do not major in accounting. This is the future of onshore work. My god, just major in anything else that doesn’t make you want to blow your brains out. \n\nThe global flattening of salaries to facilitate global margins means we’re all going to be stuck at middling wealth levels without an inheritance or another major asset run up in the long run. \n\nFuck the AICPA for ruining our educational investments and robbing us of our youth to turn this into a developing world profession. They fucking lied and wasted our educational investment of not just our money, but our lives. I hope you all realize just how hard these greedy fuckwit boomers who run the state boards, aicpa, nasba, senior partners have fucked over this profession.\n\nFor anyone with brains go to a decent law school instead. At least you won’t have to deal with people who insist on their way at ungodly hours whose work you have to redo. \n\nHere’s the sad truth. There’s no way out. PE had bought up most decent private companies. Most middle market firms are being bought out. Offshoring is infecting every accounting job. And the onshore cpa boobs are left to pickup the pieces. Demand more for this shit of ruining every morning and every late night evening.",
    "score": 797,
    "url": "https://reddit.com/r/Accounting/comments/1j35k0g/omfg_another_10pm7am_india_call/",
    "created_at": "2025-03-04T07:35:31.000Z",
    "num_comments": 131
  },
  {
    "id": "reddit-1jce895",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "You know… maybe accounting isn’t so bad.",
    "text": "I went into it because it was this or nursing and ya girl don’t do well with blood or death, and pursuing a field in a saturated, unstable job market was just out of the question because… I was poor. And I was good at math and the salary averages looked great, so objectively, I was in.\n\nWhen I was in college, I HATED accounting. I almost dozed off every single lecture cause it was so boring and my professors had the demeanor of stereotypical accountants (meek and monotoned). Being poor with no scholarships I worked the whole time as a student—sometimes even 2 jobs, and was always running around and exhausted. Straight C student compared to the As I always got in high school without trying. To be fair, I also just don’t really know how to study cause I’d never had to.\n\nMy confidence in my intelligence was depleted, everyone was going into big 4 internships (internship was expected to get the last credits necessary for the program to graduate), I really only landed mine VERY last minute mostly due to the unfortunate circumstances of the Firm partner and his inability to participate in the meet the firm sessions. I had no money to get into my MBA then get my CPA like the route they pushed everyone to do, and I honestly had no clue where to go from there. I really struggled with if this was the right path for me.\n\nWell, I’m in my late 20s now and I genuinely enjoy the work. I started a senior accountant role last week, was a staff for a little while before that and compared to other job markets I feel like we still fare pretty well. Hopefully my perspective isn’t too skewed, but I’ve hardly ever had a job gap—even with COVID, even now. The only time I’ve been out of a job was from a toxic workplace where they fired someone once a month and I got the wrong end of the roulette. (Also dreaded working there anyway) Even then, I found something within a couple months (went ham though, obv) and really thrived there.\n\nThe job is honest, I can quantitatively showcase my achievements (I’d suck at pitching myself otherwise), and I enjoy working with excel. A lot. lol\n\nDo you guys genuinely enjoy your work, and what do you do? Or is it that “job that pays you well enough to enjoy life outside of it” kind of thing? I like to think that mine can be both.\n\nEdit: I appreciate the positivity from (most of) everyone! I didn’t think this was such an uncommon post on this sub lmao but I’m glad to inspire and wish everyone great outcomes on their journey. Mine has not been the most well-paying, clear-cut or even lucky path, but I’m glad to call it my own and to know what it took to get here.\n\nOh and to all the miserable people in the comments trying to shame me for liking my life: I work 45 hours a week tops, but typically less than. The people I work with are wonderful and support me when I need it, I am getting paid comfortably, my schedule is flexy and I could start at 10am if I wanted, which I don’t cause I’m excited to contribute and am not burnt out. 💛 sorry for ya life though",
    "score": 794,
    "url": "https://reddit.com/r/Accounting/comments/1jce895/you_know_maybe_accounting_isnt_so_bad/",
    "created_at": "2025-03-16T05:06:17.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1ibpv2i",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Let go today due to outsourcing",
    "text": "Just a rant.  Accounting manager role left a company of 4 years in April 2024 to join this one as I was promised the world and more.  Was let go today due to “restructuring costs” as they were able to bring in a controller and senior accountant from outsourcing to the Philippines  for less than my salary.\n\nThe 9 months of being employed was told nothing but how great I am and the smartest person to have been hired.  Was given 0 warning and 2 weeks of severance which seems like an absolute slap in the face for how “valuable” I was to them.\n\nFeel completely blindsided as I didn’t see this coming.  My team felt completely blindsided when I started walking around shaking their hands wishing them good luck.\n\nI am not even sure how to process this given that even technical skills can’t compete with outsourcing.  Just giving me some time to process before getting to send out job applications.\n\nThank you for reading \n\n\nThank you all for the outpour of support. I did not expect this but I am grateful for this community and all of you.  We are all people first and my hope is that someday we get vindication from companies that treat us like doormats.  For now my job search begins and I hope you all stay vigilant .",
    "score": 782,
    "url": "https://reddit.com/r/Accounting/comments/1ibpv2i/let_go_today_due_to_outsourcing/",
    "created_at": "2025-01-28T01:18:16.000Z",
    "num_comments": 153
  },
  {
    "id": "reddit-1n3fiww",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Today I leave accounting to become a High School Business Teacher",
    "text": "I think the end game for most (not all) people in accounting (and the corporate world in general to be fair) is simply not worth it. Long hours, close cycles, busy season cycles, all so you can be tossed to the side of the road via corporate restructuring, layoffs, offshoring, new leadership, private equity, etc…\n\nThe only routes which really seemed worth it long term in this profession were working for the government (which has absolutely been blown apart by the current administration) and/or potentially self employment.\n\nMy new role will be paying me only $70k in a LCOL area, but I have 15 weeks off, finish teaching at 2:30, and have all the time and energy in the world left to pursue self employment opportunities now.\n\nAccounting was supposed to be a stable role, but it (like pretty much every other white collar job) is under pressure like nothing I’ve seen before. As a teacher I’ll never have to worry about my job being sent overseas, or an AI robot teaching a classroom as if parents would ever accept that.\n\nCrunching the numbers, I’m essentially paid more on an hourly basis than most accounting managers/controllers especially considering the ones averaging 50-55+ hours a week if not more. \n\n•\tSalary: $70,000\n\t•\tContract Days: 187\n\t•\tDaily Rate: $70,000 ÷ 187 ≈ $374/day\n\t•\tHours per Day: 7.5\n\t•\tTotal Hours/Year: 187 × 7.5 = 1,402.5 hrs\n\t•\tHourly Rate: $70,000 ÷ 1,402.5 ≈ $49.9/hr (~$50/hr)\n\n•\tAnnual Hours: 52.5 × 52 = 2,730 hrs\n\t•\tHourly Rate: $130,000 ÷ 2,730 ≈ $47.6/hr (~$48/hr)\n\nI still think there can be rewarding careers in accounting, but it won’t be in corporate America or in large firms. Either go solo, find a small niche company/firm/practice, or explore what other public sector jobs might be worthwhile.\n\nThe purpose of this post isn’t to disincentivize ppl from pursuing accounting as a career, it’s to pivot the attitude and expectations. I already know and expect comments saying how I’m out of touch, or that I’m looking at things the wrong way. So be it, I’ve been at too many places now and every single one has managers, Senior Managers, Directors, VPs, etc… working every moment of every day. That’s not going to be me in my 30s and 40s, life is too precious. ",
    "score": 774,
    "url": "https://reddit.com/r/Accounting/comments/1n3fiww/today_i_leave_accounting_to_become_a_high_school/",
    "created_at": "2025-08-29T18:38:10.000Z",
    "num_comments": 224
  },
  {
    "id": "reddit-1jiuc4u",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "My first paystub at a small CPA firm in 1986",
    "text": "The firm was located in a HCOL area. It had 4 partners &amp; 5 accounting &amp; support staff. We were paid salary twice a month, and we banked all overtime to be used like PTO.",
    "score": 765,
    "url": "https://reddit.com/r/Accounting/comments/1jiuc4u/my_first_paystub_at_a_small_cpa_firm_in_1986/",
    "created_at": "2025-03-24T16:06:35.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1jjc5gn",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Sometimes getting fired is OK",
    "text": "A year ago, I landed what I thought was my dream job. Hybrid schedule, huge salary, and responsibilities and deliverables that were manageable. I had been with my prior company for seven years - I only left for the money. It was a very familial / buddy environment. I was comfortable with my DRs and my boss. I could freely express myself, and I gave them the same courtesy. \n\nAfter a few months at the new company, I started to recognize the strict, conservative hierarchy. Little things... On our WFH days, my start time was watched like a hawk. After being in the office at 5am to accompany an auditor on an inventory count, and staying until 6pm to finish our month end reporting package, the next day I slept in and was online at 9:30. I had no deliverables due that day, yet received an official warning. \n\nA month later, after a hurricane left most of the F&amp;A department without power, I was being badgered by the parent company to get them the financials, without the support of my team. \n\nA month later, it was a working Saturday. I signed on at 9am and was immediately chastised by my boss that \"everyone else has been online since eight\". I thought working Saturdays meant we simply got out shit done, no matter how, or when, we did it. This is when I started having doubts about the company / culture. \n\nI pressed through another six months. I had a freak month of February where I had a series of unfortunate events, involving medical and car issues. Prior to this, I had never missed an in office day. After the last instance, I texted my manager that \"I can't make this shit up - I am unable to make it to the office tomorrow because I'm dealing with this.\" Thirty minutes later, the VP fired me via text. \n\nI spent a day getting drunk, and then started the grind. Updated my resume and called every recruiter I knew, connected with a lot of new recruiters, and started applying for every job directly that I saw on LI. Less than 2 weeks after I was fired, the CEO of a company contacted me directly. Exactly two weeks after being fired, I had an interview with him. Two days later, I met the executive team. The next day, I received an offer, for the same salary I was at, with a guaranteed raise in six months. \n\nToday was three weeks since I was fired, and it was my first day at my new job. I already love it. \n\nGetting fired sucks. But it doesn't have to be the end of the world. I missed a paycheck and a half. We were able to live thru that by adjusting out budget and doing simple things like getting a one month extension on car, mortgage, and student loan payments. \n\nI realize this is not everyone's reality - but if you find yourself fired tomorrow, I hope my story gives you hope. ",
    "score": 762,
    "url": "https://reddit.com/r/Accounting/comments/1jjc5gn/sometimes_getting_fired_is_ok/",
    "created_at": "2025-03-25T05:22:36.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1kspuww",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "8 years in government. You know what? I’m not leaving. ($652k net worth)",
    "text": "As a foreword, I want to acknowledge the many dedicated public servants who, through no fault of their own, are subject to RIFs or are in limbo after being fired and then reinstated. I delayed my annual post significantly this year because it didn’t feel right to do with all the probationary firings happening. I wish all of you the best.\n\n---\n\nTL;DR: I followed this sub in college, decided fuck PA, and started at the federal government in 2017 straight out of college. Work is reasonable(ish). Life is great. My net worth has gone from ($20k) at graduation to $652k as of 12/31/24. My wife’s (elementary teacher turned admin assistant) net worth has grown to $304k. We also have joint assets totaling $14k, giving us a household net worth of $970k for the year ended 12/31/24. We’re both 31. Government jobs might not pay as much as PA and industry, but there's still plenty of room for success.\n\n**Career:**\n \nI work as a financial auditor for the federal government. My OPM career code is 0511 for those interested. My day-to-day work is exactly the same as PA audit work. I have 8 years of experience now. I will always be grateful to this sub for lifting the curtain on the nature of PA work and for pointing me towards a government job. Around 10 years ago (scary to think about) in a thread about internships someone commented that government internships are often overlooked. On a whim I went over to USAJOBS.gov to see what federal internships were available, applied to several, and the rest is history. This post is partially to be that for the next generation of students.\n \nI started out making $60k. Last year my salary was $112k, however my final pay stub for 2024 showed $121k grossed due to overtime pay and student loan repayment benefits. Since then I both took a pay cut due to relocating to a MCOL area and also got a raise due to a promotion to GS-13, the net effect putting me at $118k. I don’t have a masters or a CPA. I considered becoming a CPA after I started working but quickly decided against it. I spent my free time after work as actual free time and met my now wife instead :).\n \nIf you want to climb the ladder quickly government is absolutely not the place to go. I went into it expecting a very slow climb and even I was starting to get disillusioned with the growing gap of my job responsibilities vs title and pay. $118 for 8 years’ experience in a MCOL is nothing special. My peers who went PA are certainly leaps and bounds ahead of me in salary and title. However, it’s more than good enough for me. When I picked accounting, my goal was a career that paid me ‘enough’ to live well, while giving me the best work-life-balance possible. A federal career has absolutely provided that. Any large increase in salary would probably come with a decrease in work-life balance, and that’s simply not worth it to me.\n \n**Work-Life balance:**\n \nExcellent. I work 40-hour weeks nearly year-round. I earn 4 weeks PTO and 2.5 weeks sick leave each year, in addition to 10 federal holidays. Like last year, this past busy season I had about 4 weeks again where I needed to work 60-hour weeks. I’m really not a fan of having to work OT, but the short-ish duration and 1.5x pay makes it bearable. \nMy job is still classified as remote and because of that we were able to move out of the DC area since my 2024 post. Remote work is the single best quality of life work benefit I’ve ever had and is a huge reason I haven’t jumped ship.\n \nOne of the other nice perks is that vacations are truly vacations. I've never had a boss expect me to work or be available when out on PTO. When I’m out of the country it’s literally illegal for me to check my work email. How’s that for forced work-life balance?\n \n**Personal Finance:**\n \nI found the /r/financialindependence sub in college too and decided I wanted to retire early. I made retirement contributions a priority and have maxed out my TSP (gov 401K), IRA, and HSA every year since 2017. It took quite a bit of effort the first couple years but my salary grew quickly. Those first few years of contributions set us up for life. If I dropped my TSP contributions to 5% and we stopped all other contributions, our combined retirement savings are on track to still grow to ~$6.5M (all projections in inflation-adjusted, 2025 dollars. 7% growth rate) by the time we hit age 57.\n \nWe're at around a 43% savings rate right now. We don't feel like those contributions currently hold us back though, so we still make them. With our current savings rate we’re on track to have ~$4.1M by age 45, though we’ll probably back off on our savings well before that due to lifestyle changes like kids. Halving our savings rate starting today would put us at ~$3.3M at 45, which should still be more than enough for us to retire if we wanted.\n \nThe biggest factor (beyond making enough money TO invest, which we’re grateful we do) is investing early. Investing $1k/mo for 10 years from age 25-35, then nothing from age 35-65 results in more money (~$1.4M) than investing $1k/mo for 30 years from age 35-65 (~$1.2M).\n \n**Net Worth:**\n \nThe S&amp;P500 was up ~25% in 2024, so my net worth jumped to $652k. My wife’s net worth jumped to $304k. We also have joint assets totaling $14k, giving us a household net worth of $970k for the year ended 12/31/24. With the market volatility we’ve crossed the $1M threshold many times, both before and after 12/31/24.\n \nOur net worth figures do not include any real assets. It's financial accounts (retirement, brokerage, cash, etc.) only. We do not own any real-estate and continue to rent a single-family home instead. Even in our MCOL area it’s cheaper to rent a SFH than buy. We are the proverbial couple that chooses to rent and invest the difference. \n \nEven though we’re married, I plan to continue posting annual updates outlining my accounts (to demonstrate how I’m progressing with a federal accounting career). We plan to keep our accounts mostly separate, which makes record keeping easier.\n \nHere is my updated net worth tracker.\n\n|**ASSETS**|**12/31/2016**|**12/31/2017**|**12/31/2018**|**12/31/2019**|**12/31/2020**|**12/31/2021**|**12/31/2022**|**12/31/2023**|**12/31/2024**|\n:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|Cash (incl HYSA)|$ 2,576|$ 6,562|$ 15,272|$ 26,022|$ 20,320|$ 26,334|$ 32,257|$ 43,895|$ 47,273|\n|TSP|$ -|$ 22,448|$ 41,213|$ 79,546|$ 124,048|$ 178,928|$ 168,494|$ 241,445|$ 327,007|\n|Pension contributions (refundable)|$ -|$ 2,536|$ 5,880|$ 9,559|$ 13,460|$ 17,498|$ 21,743|$ 26,302|$ 31,194|\n|HSA|$ -|$ 3,535|$ 6,565|$ 11,656|$ 17,766|$ 25,698|$ 24,298|$ 34,632|$ 47,535|\n|IRA|$ -|$ -|$ -|$ 12,538|$ 21,969|$ 32,191|$ 24,338|$ 28,476|$ 33,579|\n|Roth IRA|$ -|$ 6,015|$ 10,924|$ 14,289|$ 17,287|$ 22,248|$ 25,526|$ 40,675|$ 57,652|\n|Brokerage|$ -|$ -|$ -|$ -|$ 29,868|$ 53,980|$ 53,498|$ 77,952|$ 107,875|\n|Total Assets|$ 2,576|$ 41,096|$ 79,854|$ 153,609|$ 244,719|$ 356,877|$ 350,154|$ 493,376|$ 652,115|\n|||||||||||\n|**DEBTS**|**12/31/2016**|**12/31/2017**|**12/31/2018**|**12/31/2019**|**12/31/2020**|**12/31/2021**|**12/31/2022**|**12/31/2023**|**12/31/2024**|\n|Student Loans|$ 22,885|$ 21,639|$ 19,936|$ 17,182|$ 13,454|$ 10,334|$ 7,084|$ 3,393|$ -|\n|Total Debt|$ 22,885|$ 21,639|$ 19,936|$ 17,182|$ 13,454|$ 10,334|$ 7,084|$ 3,393|$ -|\n|||||||||||\n|**Net Worth**|**12/31/2016**|**12/31/2017**|**12/31/2018**|**12/31/2019**|**12/31/2020**|**12/31/2021**|**12/31/2022**|**12/31/2023**|**12/31/2024**|\n||$ (20,309)|$ 19,457|$ 59,918|$ 136,428|$ 231,265|$ 346,543|$ 343,070|$ 489,983|$ 652,115|\n|YoY Change||$ 39,766|$ 40,461|$ 76,510|$ 94,838|$ 115,278|$ (3,473)|$ 146,913|$ 162,132|\n\n**FAQs:** Did you live at home? In community college, yes. After that, no. After moving to DC I split a 2br/1ba apartment with a co-worker to save $$$. A few years later my then-fiancée and I moved into a 1br apartment together.\n \nDid you parents support you financially? Yes. I was given a car (98-02 accord) in HS which I kept until 2020. I went to community college and lived at home. My parents also paid for my first year of rent when I moved away for a cheap in-state college. However, after graduating (with $23k in student loans), the only ongoing financial support I received was staying on the family phone and Netflix plan for several years. I would have lived at home if I could, but a several-hundred-mile commute would have been a bit much.\n \nDid you get lucky gambling in crypto, meme stocks, etc? No. I only do index funds (ex: VTSAX).\n \nHow did your traditional IRA go from $0 in 2018 to $12,538 in 2019? The IRS allows IRA contributions for the PY until approximately April 15th. For 2016 through 2018 I was always a year behind on contributions. By 2019 my salary had grown enough to catch up so I made 2 years of contributions (2018 and 2019) in 2019.\n \nYou don’t have kids, do you? Nope, not yet.",
    "score": 723,
    "url": "https://reddit.com/r/Accounting/comments/1kspuww/8_years_in_government_you_know_what_im_not/",
    "created_at": "2025-05-22T12:49:13.000Z",
    "num_comments": 144
  },
  {
    "id": "reddit-1ivn89o",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Accountants that are BAD at accounting, what paths did you take?",
    "text": "\n\nI don't want to hear any 4.0 CPAs commenting on here.\n\nI am talking about &lt;3.0 people who scratched through school, chegged things, didn't really like accounting. Maybe their first job they got PIPed.\n\nI assume those people are pretty rare as reddit tends to be more nerdy and especially on an accounting subreddit normies will be too busy having fun on a weekend.\n\nHowever, wondering how were you able to carve a successful higher paying career out of this? Did you end up having to pivot out of accounting? Do you have friends like this?",
    "score": 705,
    "url": "https://reddit.com/r/Accounting/comments/1ivn89o/accountants_that_are_bad_at_accounting_what_paths/",
    "created_at": "2025-02-22T16:56:53.000Z",
    "num_comments": 289
  },
  {
    "id": "reddit-1k4dzor",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Any of yall climb the corporate ladder chasing the salary, then realize you hate the responsibility and workload, but don't want to go down the ladder to a lower salary?",
    "text": "So I have been a controller for the last 3 years, making roughly $130-$150K. I am finding I just don't really like it. I want to analyze data and focus just on financials, not worrying about controlls, procedures, and policies lol. I want to stop being a controller, but not stop making $150K lol.\n\nAnyone else in this boat? What did you do? Is it possible to go work two remote senior accountant jobs making $100K a piece? Is there something else I could look into.",
    "score": 698,
    "url": "https://reddit.com/r/Accounting/comments/1k4dzor/any_of_yall_climb_the_corporate_ladder_chasing/",
    "created_at": "2025-04-21T13:49:47.000Z",
    "num_comments": 162
  },
  {
    "id": "reddit-1iuc6ju",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Hey everyone, I was just laid off",
    "text": "I’m not even in government man, but I worked with a company mostly involved with tech startups and foreign ventures. Because of the economic uncertainty caused by the current administration, our foreign ventures clammed up on done deals and we suffered reduced outlook from recurring tech startup revenue. So our cash runway fell short, and I guess the company decided to cut employees first before even trying to reduce expenses. \n\nI’m a senior accountant with nearly 8 years experience. I’ve been screwed so many times repeatedly from every single employer I’ve ever lent my services to. Honestly just feel numb right now. I see the headlines. I’m competing with 6k accountants probably more experienced than me in an extremely uncertain economy. Unemployment, whenever that actually comes through, will not even cover rent + obligated personal loan expense. Not to mention utilities and food. \n\nI uprooted my whole life because of this job. I based my financial decisions around this job, paying down debt from a combination of earlier poor planning in my younger days and repeated emergency situations, like the surgery that saved my dog’s life just last year. But I’ve been walking that tightrope pretty well up to this point. Now though, I feel like I’m screwed. The job market is bad and I have such high financial obligations that I very well may have to declare bankruptcy before ive even made it to 30. Just before in fact. \n\nThe dead-eyed pos who made the decision didn’t say a word, let hr handle it. I bet they still get their bonuses even as the company takes its last breaths. Me though? They laid me off 5 days into a pay period, and it’s not in arrears. 5 days of pay, no severance, and no warning. That’s what I have to work with. Rent and the loan payment are due in about a week.\n\nWhy don’t we have unions man? Why do we let them fuck us like this? No one has ever been there to protect me. It doesn’t matter how strong I feel as an individual, I just get kicked in the fucking teeth over and over again. \n\nIdk man, I guess I just needed to vent. I thought maybe my blessing had finally come. \nI really liked this job, actually. I guess not this time. Maybe next time will be different\n\n______________\n\nEdit: I still feel delirious, but honestly the outpouring of support here has genuinely helped ease my mind a bit. To address some of the themes I’m seeing in the comments generally:\n\n• I was still in a state of sheer panic when I wrote this post. Bankruptcy, while feeling closer than it ever has in my life, is a last resort option I likely won’t have to take. I have no savings, but I can probably request forbearance on the loan and use unemployment plus temporary gig work to pay for rent/cheap food stuff. I’ve never been on unemployment before, I’m just hoping it will be enough to keep my head barely at the water line for the time being, but I still need to move fast\n\n• The company was showing signs of hardship early on. There was lots of executive turnover happening all the time, but they offered me a (relatively small) retention bonus to stay through the hardship and as a token of goodwill for the increased workload. Though hesitant, I needed the money so I took it. That required me to stay with them until basically just before they let me go. Again, i got no severance and I don’t think im getting pto payout, though I still need to check. Yes, I was with them less than a year. They completely and totally fucked me over with zero hesitation. If you think that means the decision is justifiable, you’re a corporate stooge. And they’ll just as easily fuck you next. This is the reality of our economy and the types of people making decisions that have serious, long-lasting and devastating effects on average working people. \n\n• To the many comments implying it was my fault or I deserved this somehow, I am not surprised. Our profession is filled with this type of person. They get fucked over by execs, they’re forced to deal with smaller and smaller teams of peoples from their own country that are effective and longer and longer hours. And they will look at that situation and blame their seniors and associates until they themselves are replaced by outsourced workers. Once that happens, our profession is well and truly fucked. There are good managers out there from what I’ve heard, I’ve only really met one myself so far. Regardless, no it was not an individual performance thing. I was laid off. I wondered why my controller wasn’t in the meeting, so I texted him after. They laid him off too. The company was poorly managed from the start and rather than limiting - oh I don’t know - executive travel or the marketing contracts we were signing for 60k, 6 weeks of work and no clear goal, they instead decided to first fire key players in (at least) the finance department and probably other departments as well. When I asked about those huge contracts for almost no work, no one seemed to have any ideas about it. \n\n• By the way, yes yes you accounting students are very clever to point out that salary/wages are an ‘expense.’ But if you read between the lines, I am implying that people should not be considered a simple expense to be cast aside like you’re cancelling your streaming subscriptions to save some money. I saw what they spent their money on, and the fact that we were some of the first to go speaks volumes as to how our (often extremely unintelligent and short-sighted) business leaders view us. We place no value on human capital at all, which leads to workers being treated like dirt across every industry in our economy right now if you take a look around. \n\n• I am no victim. I will grit up, put my head down and pull myself up and over this nightmare just like I always have. But it becomes harder in some ways to have to do this again and again for different, shit situations with uncaring managers and employers. \n\n• My core competencies are in core/cost/revenue accounting, systems management/integration/transition, process improvement, client comm, budget/flux analysis, audit prep/compliance, etc. etc. Basically, I consider myself to be a very high value senior level accountant with great people skills. I don’t have my cpa, but it is something I’m going to pick back up with vigor after this most recent experience. To those offering me an interview or career advice in good faith, I genuinely very much appreciate that. I will probably reach out to some of you individually, maybe today. For now though, I’m putting my head down and doing what I have to do to survive. Filing what I need to file, updating my resume, shooting out a baseline of applications over the weekend, etc.  Again, thank you. \n",
    "score": 694,
    "url": "https://reddit.com/r/Accounting/comments/1iuc6ju/hey_everyone_i_was_just_laid_off/",
    "created_at": "2025-02-20T23:05:34.000Z",
    "num_comments": 208
  },
  {
    "id": "reddit-1jydldf",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "It’s 4/13 &amp; I’m excited because I plan to tell my job that I’m either going down to 40 hours year round or 32 hours year round, or I just won’t work here anymore",
    "text": "I’m in tax, former EY, been in tax for 7 years and it’s no longer worth the money for the stress and personal time sacrifice. I left EY for a small CPA firm for a better work-life balance and it’s been hell - worst busy season of my career. \n\nIf this job paid $250k or something lucrative then sure, but when it’s just like $500 more than what my 9-5 friends make, there’s just no reason to live this way 😊 here’s to the consequences of an industry that refuses to pay for the amount of time and stress it demands ❤️🫡",
    "score": 684,
    "url": "https://reddit.com/r/Accounting/comments/1jydldf/its_413_im_excited_because_i_plan_to_tell_my_job/",
    "created_at": "2025-04-13T17:53:52.000Z",
    "num_comments": 166
  },
  {
    "id": "reddit-1jenm6c",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "There is hope in accounting after all",
    "text": "Just got a new job…. Went from 109k base + 12% bonus to my new job $132k base + 14% bonus + $6k equity each year. MCOL.\n\nI’m 6 years into my career… I can’t believe just 6 years ago I was making $55k as a first year audit associate at a big 4…. Time flies… all-in, my comp has increased about 178% in 6 short years. \n\nStick with it, kids! It’s not glamorous but it can be a solid career.\n",
    "score": 659,
    "url": "https://reddit.com/r/Accounting/comments/1jenm6c/there_is_hope_in_accounting_after_all/",
    "created_at": "2025-03-19T03:07:46.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1mxn8oi",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Incoming interns got offers $9k higher than my current salary",
    "text": "Just found out that the interns coming in next year (who’ll convert to associates) are getting offers $9k higher than what I make right now as a second year associate.\n\nI’m in busy season right now, putting in the hours, dealing with clients — and now people who haven’t even started full-time yet are coming in ahead of me on pay.\n\nI get that firms have to adjust salaries for inflation and competition, but it honestly feels like a slap in the face. No market adjustment for current staff, no raise to keep things fair — just “congrats, you make less than the new hires. And even if there’s an adjustment, I will have to wait until year end.\n\nAnyone else dealing with this? Do you bring it up to your manager/HR, or is this one of those “suck it up or leave” things that just comes with public accounting?",
    "score": 602,
    "url": "https://reddit.com/r/Accounting/comments/1mxn8oi/incoming_interns_got_offers_9k_higher_than_my/",
    "created_at": "2025-08-23T00:28:58.000Z",
    "num_comments": 104
  },
  {
    "id": "reddit-1io1ajs",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Anyone else 10+ years into their career and hate it",
    "text": "I’m curious to hear about people who have been in accounting for 10+ years and finally realized how much they hate it. \n\nFor me it was fine out of college and had some decent jobs but as I’ve progressed I realized I just don’t care and am not motivated at all by accounting. Anyone else feel like they’ve plateaued due to disinterest in the field. It’s tough because the pay is good but is painfully middle class. Is that really the trade we’ve made to be miserable. 🤷‍♀️\n\nThanks for coming to my ted talk ",
    "score": 566,
    "url": "https://reddit.com/r/Accounting/comments/1io1ajs/anyone_else_10_years_into_their_career_and_hate_it/",
    "created_at": "2025-02-12T20:46:40.000Z",
    "num_comments": 274
  },
  {
    "id": "reddit-1pclh70",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "I am changing jobs and PE partner just said this to me",
    "text": "Good afternoon friends. \n\nI am a seasoned Corporate Controller, CPA, been in industry after PA for a decade. Never had anything quite like what happened to me today. \n\nSo I am leaving my company for another one. My last day is Friday. I am the top of the finance food chain here, Controller reports to the President of the company. I’ve been burned out being basically a CFO getting paid a Controller salary and doing 70+ hr weeks with terrible leadership, ever changing deadlines, terrible communication, etc etc. So I only gave 2 weeks notice cause I’ve been so burned out. \n\nWell they found someone right away to replace me. Good for them. My last day is Friday and their first day is Monday. They tried to get me to stay longer but never offered any additional $$ so I never gave it a second thought. The PE firm that owns us just didn’t care about me. \n\nSo today the Partner from the PE firm comes into our office. He flew 3k miles. And he wants to meet with me. So after some small talk and talking about the transition he asks if I would be available to help if there were any questions. I said yes, in the evening. He said verbally they would compensate me $300/hr for my time and then followed that up with “you say you are willing to help in this transition which is good. If you don’t,  your career is over. I like transitions to go smooth and if you don’t help if the new person needs you it doesn’t bode well for you”. \n\nIs this a threat? Am I in the right to be fuming. I would stomp out of here but I want my PTO paid out. \n\nThese next 3 days I’m going to coast my frigging ass off because of that statement. I’m sure he’s frustrated though. \n\nShould I email him for a contractual agreement before assisting if I need to in the coming weeks? \n\n",
    "score": 561,
    "url": "https://reddit.com/r/Accounting/comments/1pclh70/i_am_changing_jobs_and_pe_partner_just_said_this/",
    "created_at": "2025-12-02T21:42:32.000Z",
    "num_comments": 173
  },
  {
    "id": "reddit-1ptf2nm",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "I asked my boss for a promotion two years ago. Here’s how it went.",
    "text": "I got hired as an accounting assistant in Feb. 2023 with a salary of 55k + bonus and some OT I was at 65k. I busted my butt for two years doing the job of two people! Although my salary wasn’t justified I bit the bullet and pulled through in hopes that it would pay off. \n\nI asked for a title change at the end of the year 2024 from my controller. He asked what I wanted and I said a staff accountant would be more fitting and that my goal is to become a senior and then an assistant controller someday. I got the title! Last year at the end of 2024, I got my promotion to staff accountant with a salary of 70k + bonus and some OT I was at 85k. My boss told me at the time that he didn’t feel I was ready to be a senior. It was tough but I took the criticism and asked him how I could improve and work my way to a senior. He gave me a list of things and I busted my butt in 2025.\n\nToday, my boss calls me in to tell me they are going to make me a senior accountant affective immediately. My raise will come at the end of quarter one next year when all the final numbers come in for year end (I’m in the ag industry so it comes in mid March) but I got my bonus this year too. I am beyond stoked you guys! I worked with my controller and am so glad I took the chance to speak with my boss about these possibilities. Needless to say, today was a good day! I don’t have to cry after all 😂 I’ll take this win! No pizza though. Hopefully my raise is good. Thanks for listening. I was so happy I just had to share! \n\nEdit: Thank you so much everyone! I’ve read every single comment. I really appreciate you all taking the time to read and celebrate this moment with me. I wish you all nothing but the best and success in every way 💕 Happy holidays! May we get the bonuses and raises that we deserve. 🌟 ",
    "score": 527,
    "url": "https://reddit.com/r/Accounting/comments/1ptf2nm/i_asked_my_boss_for_a_promotion_two_years_ago/",
    "created_at": "2025-12-23T00:00:06.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1ohjd2o",
    "subreddit": "Accounting",
    "soc_codes": [
      "13-2011"
    ],
    "title": "Why don’t firms let you have your time back during the summer?",
    "text": "One thing I never understood about the accounting profession is it’s over worked and under paid.\n\n70k salary, but working 2300 hours a year compared to a 40hr/week life at 2080 hours a year. Yet even after the busy seasons your expected to work 40 hours even if there’s not much to do. Why don’t more firms let you just get the work complete and go home?",
    "score": 517,
    "url": "https://reddit.com/r/Accounting/comments/1ohjd2o/why_dont_firms_let_you_have_your_time_back_during/",
    "created_at": "2025-10-27T16:38:18.000Z",
    "num_comments": 151
  }
]