[
  {
    "id": "reddit-1k62psx",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "AITA for refusing to not accept a role because it makes my boyfriend uncomfortable?",
    "text": "Me, 19 female, my boyfriend, 20 been together for 6.5 months (my longest and most serious relationship thus far, his too)\n\nI just joined a shadow cast group for The Rocky Horror Picture Show that tours around my state. When I joined I had a conversation with my boyfriend about what roles I might eventually be cast as because if you don’t know, it’s a pretty raunchy show. I opened the floor to any questions or concerns he might have that I’d be happy to answer and I told him if any other questions or concerns came up to lmk at any point. We got to a good spot with it. \nThe shadow cast group collaborated with my community college to put on a show, I Auditioned for Frank and later on, there was a the first shadow cast show I was in as Dr. Scott which my boyfriend came to see (an added detail, our first week of dating we went to RHPS). \nThat night after the show, the director told me I was being heavily considered for the role of Janet. THE LEAD! \n\nI’ve been doing theatre since I was in 4th grade, 2 elementary musicals and in high school I did 4 plays and 4 musicals, always being cast as a supporting actor, eventually a supporting lead. I’ve never turned down a role no matter how small because the only thing that mattered was being cast because theatre and performing is my passion and where I feel most at home. He knows this, and I’ve told him. \nI’ve never been cast as the lead and only cast as a female once before so this is huge for me! Also I’m in a state I moved to less than a year ago, no one (directors or cats) knew who I was or about my theatre experience before I auditioned so I know I was cast by the talent I showed in my audition.\n\nWhen I told him (at the place we work together) he started to respond, cut himself off mid sentence, and walked away. He came back later and said that he wouldn’t be going which I didn’t really know how to respond to, then later he asked if we could talk when I got off. \nDuring that talk he told me that he’d be fine with me playing any other role, just not Janet. I asked him why and all he said was “it would really fuck with me seeing you get touched up on” I asked what about the other characters? They “get touched up on” and do the touching. Hell, I auditioned for the most sexual character in the show! \nThat’s all he gave me though, that it would make him uncomfortable and “it’s just a role.” It’s not just a role, not at all. It’s an opportunity, and the biggest role I’ve been considered for. We just went in circles neither of us backing down and it ended our relationship. \nThe cast list isn’t even out yet. \n\nAm I the asshole for refusing to not accept the role?\n\nUPDATE! IM JANET DAMNIT 😆😆😆\n\n(Also we’re broken up and not getting back together for more reasons than this, the space made me realize that we’re better off friends…or less) ",
    "score": 1016,
    "url": "https://reddit.com/r/Theatre/comments/1k62psx/aita_for_refusing_to_not_accept_a_role_because_it/",
    "created_at": "2025-04-23T15:56:26.000Z",
    "num_comments": 239
  },
  {
    "id": "reddit-1oaswv8",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "UPDATE: How to tell my friend/dramatic scene partner they've started chewing the scene, and the performance is suffering for it",
    "text": "Original post can be found [here.](https://www.reddit.com/r/Theatre/s/Wulun9ykDY)\n\nTL;DR for the original post: My scene partner recently changed their acting choices during a big, dramatic duet, and their choice to get more and more emotional each performance (including dramatically clawing at me and my clothes, dropping notes to gasp for air, etc) was making the scene suffer.\n\nFirst I want to thank everyone for their advice. There was some good stuff in there. I *do* want to reiterate that she and I are good friends, and that we are both adults, and both capable of healthy communication. Anyway, on to what happened yesterday!\n\nI decided to have two conversations. The first was with the music director. I brought up the fact that the last two performances, she had been dropping notes entirely, including longer held notes and harmonies, leaving me alone in parts that I really shouldn't have been alone in. I asked the music director to give her a gentle note asking her to make sure she was giving herself enough breath support to sing the notes she was supposed to be singing. He said that he was already going to give her a note to not be so loose with her rhythm and phrasing, because it was making the duet off a bit, and he would simply tag my request onto that note.\n\nThe second conversation I had was with the actress directly. I was very gentle with it. I said, \"Hey, so yesterday, during [our song], I got a little uncomfortable with some of the physicality. You were grabbing my clothes a lot and clawing at me, and at one point you thrust my hand against your throat kind of hard, and it just didn't feel very safe. It kind of threw me off. I understand that you're drawing from a really deep well of emotion, but you sort of turned into a hurricane of passion out there and it was just all a bit much, you know?\" \n\nShe immediately apologized, because she is a kind and deeply considerate person, stating that she sort of knew in the moment that it might have been too much. She also explained that she had an estranged and somewhat unliked family member in the audience very unexpectedly, and it had made her extremely anxious during the performance. We had a good conversation about it, no feelings were hurt, and we went on to have two more great shows yesterday.\n\nSo what did I learn? If a performance has become disruptive, you can (and maybe should) bring up the effects of the disruption as a concern, but not the acting choices. Make sure the concerns are voiced to the right people, not all directly to the actor. And be gentle with it. This is such an emotional art form, feelings could get hurt easily.",
    "score": 948,
    "url": "https://reddit.com/r/Theatre/comments/1oaswv8/update_how_to_tell_my_frienddramatic_scene/",
    "created_at": "2025-10-19T15:44:56.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1jq1hlh",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Final update: director strangled me",
    "text": "First post: https://www.reddit.com/r/Theatre/s/WfPwcqjzqY\n\nFirst update: https://www.reddit.com/r/Theatre/s/FKkaUqxV8r\n\n\nFinal update probably, unless even more stuff happens\n\nI've just got a few new notifications on my posts (it was posted to a meta community) which reminded me of my Reddit posts on this, so I'll update you with what's happened and then likely leave it be\n\nlast time, the meeting had been postponed for the third time, and I'd decided to drop out (although not to tell the director before the meeting - if it happened). On Wednesday, I messaged the co-artistic director, asking when the meeting was going to be rescheduled to.\n\nA few hours later, all of the cast get emails saying that due to funding and a \"slight undercurrent of disharmony and discord in the company which we feel is tricky to resolve\" they decided to cancel the show entirely. They also removed us from the cast whatsapps. (Unfortunately I actually felt terribly guilty about the show being cancelled at the time, even though I knew I shouldn't, I was like \"I could have just walked away and nobody else would be disappointed as they are now\" - but massive thanks to u/headlinebay on the update post just being really clear that no, the incident was absolutely over the line and I was okay in kicking up a fuss about it)\n\nShortly afterwards, one of the cast members (who wasn't involved with raising the concerns, but was aware of them afterwards) started a new chat just with the cast, and we all chatted a bit and made plans to meet up, although without going into any details. That night I also sent off an email to Equity informing them of the situation.\n\nTwo days later, on the cast group chat, it comes out that the director had asked everyone EXCEPT those of us who raised concerns to do the production again in September (!!) Which is mad and just, like, unbelievable— speaks to what they want to get away with without actors who are likely to speak up against stuff that's wrong. We shared the emails we'd sent with the rest of the cast, which included descriptions of the incidents and also what we'd asked for (which really wasn't much, just an intimacy and fight director, some boundaries to be discussed, and some written guidelines to be created)— especially reading about the incident in my first post they were horrified and I don't believe anyone from the original cast is planning to join the new production. On the plus side, after we found out about those messages, I no longer feel guilty about the cancellation at all haha\n\nI tried calling the co-artistic director one last time, just because I figured there was a slim chance she'd be receptive to discussing some potential future safety mechanisms/ways she could be a mitigating influence to actors in September or future productions. She declined my call, and when I messaged to ask to speak, told me to talk to the director instead— the same one who grabbed me by the throat.\n\nOh, and equity got back to me, and the director was apparently just straight-up lying about consulting with them for advice lol. Anyway, a cast member who's in the union is now talking with equity about potentially reporting the safeguarding issues and what else is doable for them, and also working with another cast member who's a teacher and has a bit of experience with stuff like this.\n\nI'm sorry to disappoint everyone who wanted me to report it to the police, but I'm just not going to— reporting it to equity, the borough in which the director works for safeguarding reasons, and spreading the word to actor friends is the most I'm going to do, sorry. I am unlikely to update this post again unless something super dramatic happens, but I really do appreciate everyone's replies and advice (well nearly everyone's lol)",
    "score": 923,
    "url": "https://reddit.com/r/Theatre/comments/1jq1hlh/final_update_director_strangled_me/",
    "created_at": "2025-04-02T22:13:31.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1md9lva",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "The past tense of the word \"cast\" IS \"CAST\"...not \"casted\"!",
    "text": "I don't know why this irks me so intensely, but I am constantly seeing posts or even interacting with actors at local theatres who say things like \"did you hear that Steve wasn't casted in the show\".  Even many intelligent adult actors I've worked with say \"casted\".\n\nThe past tense of \"cast\" is \"cast\", not \"casted\".  Example: \"I was recently cast in my dream role!\"\n\nPlease, if you read this and it helps you, help others learn so my eye will stop twitching every time I hear or read it...\n\n*edit*\nTo be clear, I am being hyperbolic with my reaction.  I totally understand that new people may not know the industry norm, and I would always strive to help someone understand an industry term over ridiculing them.  But much like a nuclear physicist saying \"nucular\" and seeming less prepared to do the job, I really wish yound/new actors had someone explain to them the correct industry term to help them not seem under-experienced.  There are way too many reasons a casting team can give you a \"no\", why give them another reason by misusing a standard industry term.\n\nBut no...I don't flip over tables or scream at people who misuse it.",
    "score": 768,
    "url": "https://reddit.com/r/Theatre/comments/1md9lva/the_past_tense_of_the_word_cast_is_castnot_casted/",
    "created_at": "2025-07-30T15:28:04.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1jcf1ww",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "How do you tactfully tell a child’s parent that you won’t be casting their kid in a community theatre play because of her behavior?",
    "text": "I recently held a theatre bootcamp and told the cast of our last kids show to bring a friend or tell people about it in their schools. I was happy to see so many new faces in the group of 14! Essentially this bootcamp was a way to show the kids the basics of theatre, like projecting, stage directions, that sort of thing. We played lots of games, and they all said they enjoyed the experience. \n\nThere was one kid that kept trying to derail the whole thing, though. She has been in some of our previous shows, and in those, she was also a little difficult to direct. I told the whole group upfront the first time they talked over me that I consider it disrespectful, and when I am speaking they should be listening because what I have to say is important. They understood, and we all moved on and had fun with the game that came after. \n\nThis kid, however, couldn’t seem to go without being the center of attention for very long. Almost every time we started a new task, she would get some of her friends riled up or get loud so everyone would look at her. At one point, I even resorted to separating her from the people she kept distracting, and that allowed the other kids to focus. I never had her sit out because I wanted her to have fun. \n\nDuring tech week of the last show we did, the director asked her to bring in a prop so she would have time to practice with it. When she didn’t show up with the prop the next day, her excuse was that she didn’t want the little kids to mess with it. She was told it would not be an issue and to make sure she brought it for the next rehearsal. \n\nThe next rehearsal came, but she still did not have the prop. When she tried telling the director that same excuse, I stepped in and told her that it wasn’t a valid excuse because we have adults who are in charge of props. It has never been an issue with previous productions, so it would not be one during this one either. As if by magic, the prop appeared at the next rehearsal. It took me being incredibly firm with her to get her to do what was asked. \n\nI’m inviting some of these kids from the bootcamp to audition for the upcoming play, but I don’t want to ask her to come, not even to do tech, because I worry she will continue to be a major distraction in the rehearsal process. I also know that her mom started asking when auditions were happening only hours after the bootcamp wrapped. \n\nSo I’m about disappoint some people, but I want to do it tactfully. I need to communicate that this is still an ongoing issue, and I can’t have that in the group moving forward. \n\nWhat should I do? If it helps, I will be including a feedback section in the emails I’m sending out for each kid that participated. ",
    "score": 556,
    "url": "https://reddit.com/r/Theatre/comments/1jcf1ww/how_do_you_tactfully_tell_a_childs_parent_that/",
    "created_at": "2025-03-16T06:03:28.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1kfgr5t",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Current partner hates me doing theatre.",
    "text": "He says he’s proud of me when I finish a show, shows up, buys flowers but during a rehearsals he becomes mean, makes passive aggressive remarks, calls me during rehearsals pissed off if it’s running late, accuses me of cheating, and complains a lot about rehearsals that run until 9pm. A few months ago he slammed the bedroom door in my face when I came home around 9:30 from rehearsal. \n\nHe says he wants me to be at home with him but we don’t do anything or have any kids together and theatre is my passion. I finally found a good group that I’ve been doing shows with and really love them. They honestly feel like a family. He’s threatened by my very old and gay director and any male cast member I talk about. \n\nI feel like he’s making me choose between what I love to do and him. And I guess I’ll have to pick what I love and let him go. Womp womp. \n\nEdit: I just wanted to say thank you everyone for the comments. I feel a lot less crazy and sensitive. I’ll be moving in with my dad in about a week (I’m trying to move stuff around without it looking obvious). I’m not going to try to “talk” to my bf. I’m just going to leave. I’ll be looking at this post every time I get said or second guess myself. I will keep y’all updated. Theatre is so much more than a passion, it’s a community and I love this community forever. Love y’all. Talk soon. ",
    "score": 477,
    "url": "https://reddit.com/r/Theatre/comments/1kfgr5t/current_partner_hates_me_doing_theatre/",
    "created_at": "2025-05-05T17:00:31.000Z",
    "num_comments": 179
  },
  {
    "id": "reddit-1jyltds",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "White Kids Portraying People of Color?",
    "text": "Hi, so, I am im a primarily white theater club, and we live in a very republican area. Just saying that as a preface. \n\nOur theater director wants \"Disenchanted!\" to be our musical for next year,,, and no one seems to see the glaring issues with this. \n\nThe show portrays Mulan, Tiana, and Pocahontas and songs talking about their ethnicities, race, and experiences being a person of color. Now, I myself and white, but I can't be the only one who sees the issye with portraying these characters with white actors. We quite literally have NO asian, black, or native american actors in our club. \n\nSome of the people in our club is saying that it shouldn't be too much of an issue because of their charactets focusing on their characters and experiences rather than their races, but like... They're using the argument that \"if ariel can be black then tiana can be white\" which is just odd to say the least. \n\nI need opinions. My friend and I are going to argue to the director about the issues, but I'd like to have some opinions on this if that's okay. Thank you for reading! \n\n\nEDIT UPDATE!!! :\n\nSo, we confronted our theater director. She had her opinions, which were the same opinions as the other kids in our school (sadly), so she contacted the people who wrote the show. They told her an immediate NO. I also believe she contacted one of her friends from NYC and she also told her no. \n\nWe did it!! I'm sad she can't see the reason why, but I'm happy that we won't be doing this show. We'll be doing Six instead!! (if we can get the licensing) ",
    "score": 469,
    "url": "https://reddit.com/r/Theatre/comments/1jyltds/white_kids_portraying_people_of_color/",
    "created_at": "2025-04-14T00:07:42.000Z",
    "num_comments": 206
  },
  {
    "id": "reddit-1j4bff7",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Boyfriend doesn’t want me to stage kiss in dream show",
    "text": "I have the opportunity to play a dream role and it requires a very classy and not overly involved kiss at the end. I previously did an intimate scene and my boyfriend didn’t object, but now that we are deeper into our relationship he’s expressed he regretted it and that it will be even harder if I do it again.\n\nThis is not a trust issue and he is not upset at me for doing it. He simply believes it’s wrong for a relationship, is emasculating, and invites unwanted assumptions about a relationship. He isn’t involved in theater and says he doesn’t see a difference between doing it in character and real life.\n\nI previously set very healthy boundaries with other scene partners out of respect for him. I will see if the director is open to changing staging a bit at the end, but if this jeopardizes my ability to do the role I’m not sure I can turn it down for his sake.\n\nHas anyone dealt with something similar with a partner and has advice?",
    "score": 406,
    "url": "https://reddit.com/r/Theatre/comments/1j4bff7/boyfriend_doesnt_want_me_to_stage_kiss_in_dream/",
    "created_at": "2025-03-05T19:23:26.000Z",
    "num_comments": 385
  },
  {
    "id": "reddit-1ivxddv",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "FYI Theatre spouses: Stage intimacy is neither romantic nor sexy",
    "text": "Today, the company I’m currently with had an open rehearsal of our Act 1 work through. \n\nI stepped in for a principal, running through some scenes I’ve never actually performed yet, including a sex scene with a man and a kiss with a woman. \n\nThus, I had my first kiss with a man in front of a large audience and the entire cast. And then faked being uncomfortable making out with a woman who I’ve previously dated and am good friends with. \n\nAn acquaintance (who doesn’t know I’m a lesbian) came up to me and raved about how sexy the scene looked and how genuine it looked and *wow he looks just like Chris Pine- aren’t you lucky?* She then said how weird it must’ve been kissing another woman *(gasp)* and how uncomfortable I must’ve been and how obvious that was on stage. \n\nA coworker’s husband also came and confided how glad he was that his wife’s role didn’t require any stage intimacy. I told him my thoughts on the matter and he said it reassured him, so I thought I’d share my experience. \n\nIt’s acting. Kissing and moaning against my male cast member was genuinely the most unsexy experience of my life. It’s all choreographed, so despite lacking an intimacy coordinator and having an audience for the first time running the scene, I still felt in control and frankly, a little bored. \n\nHere’s the exact thought process I had during the scene:\n\n&gt; “Okay, so I need to drag him down, shit- avoid the curtain, thank god I brushed my teeth after lunch. God this is awkward and whoops there’s his face. Ugh I hate hearing this noise, shit there’s the musical cue, I need to moan on the downbeat- and remember the director said to take a beat, regain the balance. Oh shit my lips are dry. Whatever. Do I have rosebud salve in my bag, or is it in the car? Aaand dip back, shake out hair. Gosh my ankle hurts, I should ice it during break. And we’re not far enough stage left; let’s shift downstage again after this kiss. Did I put on enough deodorant? Whelp, too late- point the toe! These shoes are *dead* dead. It’s so weird kissing someone with a beard, oh shit, line! And kiss again and *now* trail hand down chest, twist, land on top of him center stage. Pause. Ugh, I need to work out more. Shit, I think my foundation got on his shirt- I *really* need to find a better setting spray before opening. And I think she kisses him again here? Uhhhh yes, shit *shit shit* what’s the next line after this? Ah yes, “lock the door!” aaand so I need to be more upstage and make the face- freeze, hand on right breast then spin, whoops too fast sorry! Am I putting too much weight on him? And shit, I’m blocking the light still: adjust, adjust, there. Kiss forehead and then left cheek and lips, freeze again, did I bring lunch today? Nope, I wonder if the bodega has anything non-gross. I’ll have to ask the stage manager. Shit, this petticoat is itchy, and his hand is on my ass, wriggle, lean back, freeze and Jesus, why hasn’t tech gone to blackout yet?”\n\nEven kissing a woman who I am attracted to is not arousing. Why? Because I’m acting. There’s nothing sexy about stage intimacy because I’m not thinking about their body or the physical aspects. I’m focused on the mechanics and the scene at hand. It’s choreographed, so I know I need to place my hands and mouth and legs at specific points at the right time. It looks real because we’re actors and we’re performing characters, not because we’re horny degenerates using a public stage as a way to get our rocks off. \n\nAs a disclaimer, showmances are common, but that is a consequence of bonding with cast members, developing friendships. and/or not being professional and respectful while staging intimacy. Shows aren’t an excuse to cheat on your partner, and we need to clarify at every level of theatre that respecting boundaries and understanding the inherent falsehood of performance is key to making stage intimacy work. Productions should have an intimacy coordinator if they’re requesting actors touch or kiss. ",
    "score": 358,
    "url": "https://reddit.com/r/Theatre/comments/1ivxddv/fyi_theatre_spouses_stage_intimacy_is_neither/",
    "created_at": "2025-02-23T00:26:39.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1o1gx09",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "When has getting cast in a smaller role (or the forbidden word *wink wink*) actual felt like a compliment to you?",
    "text": "\nFor me, it was when we did Legally Blonde. I was upset at first that I didn’t get cast in any of the leads and instead got a couple of fun one off characters (y’know, the ones who only have one scene where they play a big role) but it was when i started actually rehearsing my scenes that I noticed they were all very over the top characters. After we had finished the show, I was in my advanced theater class talking to my director about how much fun I had when she told me that she casted me the way she did because out of all the boys, I was the only one who she thought could pull off the craziness of the characters and give 100%. It felt good knowing that I wasn’t given a lead because I wasn’t talented enough, it was because I had strong physical and vocal comedy chops and that really boosted my confidence \n\nPS: Sorry if this came off as self congratulatory or egotistic, I’m really bad at saying good things about myself without sounding at least a little full of myself ",
    "score": 350,
    "url": "https://reddit.com/r/Theatre/comments/1o1gx09/when_has_getting_cast_in_a_smaller_role_or_the/",
    "created_at": "2025-10-08T17:26:07.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1jg8a78",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "I don’t think anyone could’ve prepared me for this",
    "text": "I just preformed on stage for the first time, and my god it was incredible. I was a background actor for my Highschool production of Something Rotten and when the audience laughed at a funny bit I did it was probably the best I've ever felt. When I was backstage during the finale a dancer who's one of my friends ran off screaming because we got a standing ovation and during curtain call we were all crying. My director tried to warn me but I didn't think it would be that incredible. We still have 4 more shows to go. Is it always like this? I hope it is\n(Edit) WE SOLD OUT OUR SECOND SHOW!!! The show starts in 4 hours I can't wait to do it all again for a larger audience ",
    "score": 344,
    "url": "https://reddit.com/r/Theatre/comments/1jg8a78/i_dont_think_anyone_couldve_prepared_me_for_this/",
    "created_at": "2025-03-21T04:02:55.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1j0g2k1",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "To Young Actors and Technicians: You Deserve to Feel Safe in Your Theatre Program",
    "text": "Mods - I think I am in alignment with the rules here, but I meant no ill intent if I am not. I didn’t get the chance to post this before the original post was deleted, but I still want to share it. A young actor was asking if it was okay for a director to tell a student to “act sexier.” That post is gone now, but the question is still important. If the OP—or anyone else—is wondering about this, I hope they see this and know they’re not alone.\n\n**My original comment:**\n\nHey, OP. I know this situation is tough, and I really respect that you’re thinking it through. I want to share something that might help you figure out what’s best for you.\n\nThere are a lot of comments here—some good, some not so good. A lot of people mean well, but it can be hard to see a problem when you're in the middle of it. Others might think it’s “just how theatre is.” But here’s the thing: **A director telling a student to \"act sexier\" is not normal or appropriate.** A good director finds ways to help actors understand their roles without making them uncomfortable.\n\nI used to teach theatre. I’ve seen great programs, and I’ve seen some that crossed the line. I once worked with a guy who, on his very first day, made an inappropriate comment to students just to see how they’d react. Some laughed, some looked uncomfortable. Guess which kids he gave the best roles to? Over time, he built a group of students who thought they were special, who felt like they were in on the joke. The ones who didn’t like it? They stayed quiet, or they left.\n\nAt first, I told myself he didn’t mean harm. I even tried to talk to him about it. But the longer I worked with him, the more I got used to it. And then it got worse. He started making more inappropriate comments, even in front of me. One day, I heard him tell a *freshman girl* that she should pad her bra for a role. This was a **40-year-old man** talking to a 15-year-old. And that wasn’t the only thing he said.\n\nI went to my principal. It wasn’t enough. Eventually, I left my job and moved into administration. Later, I learned my old coworkers had been watching him closely. No one ever caught him doing anything *obvious enough* to take immediate action, but one of my friends—a school leader—told me: **“I really hope he never did anything to a student.”**\n\nI regret not speaking up sooner. He was charming. He was friendly. He made people feel like they were on his side. He even made *me* doubt what I knew was wrong. People like that are hard to see clearly when you’re close to them.\n\nSo, OP—**here’s what I want you to know.**\n\nYou might be right. You might not be. It’s hard to say from what you’ve heard so far. But even if everything else is a misunderstanding, **there is no good reason for a teacher to tell a 13-year-old to \"act sexier.\"** A better director would say something like “be more flirty” or “add some charm”—and even then, if a young actor doesn’t understand, that’s on *the director* for casting someone too young for the role.\n\nSo, what do you do?\n\n* **Talk to older students you trust.** Have they noticed anything? Have they heard worse?\n* **If the upperclassmen say it’s “just how it is,” that’s a problem.** They’ve been around this teacher longer and might not realize something is wrong. But if even one person tells you they’ve felt uncomfortable, **listen to that.**\n* **If something feels off, tell a trusted adult.** This could be a parent, a school counselor, or another teacher. Even if they don’t have the full picture yet, they can help you figure out what to do.\n* **And most importantly: If you’re uncomfortable, you don’t have to stay.** You’re allowed to leave a show if it doesn’t feel right. Will it mean you might not get cast again? Maybe. But I promise you—**you don’t want to be part of a program that allows this kind of behavior.**\n\n**When in doubt, GET OUT.** If something feels wrong, trust your gut. The fact that you’re even asking this question means you’re already paying attention—and that’s a really good thing.\n\nStay safe, OP. You’re not alone in this.",
    "score": 295,
    "url": "https://reddit.com/r/Theatre/comments/1j0g2k1/to_young_actors_and_technicians_you_deserve_to/",
    "created_at": "2025-02-28T19:30:00.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1omgvpj",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Being in ensemble is no joke...",
    "text": "Got cast in ensemble for the very first time and you always see people groaning about not getting the roles they want but nobody tells you about how much work you have to do.... I was told that I'd be in this role and (laughably) thought it's be a pretty laid back job..\n\n..why do I have to do core and strength trainings before every rehearsal.. why do I have 4 different roles to play under 1 role...\n\nI thought I'd be in maybe 1 or 2 scenes, just something light you know.... why am I crawling on the floor, being a sock puppet and moving stuff around with 1 quick change...\n\nIM NOT COMPLAINING!!!😭😭 I absolutely LOVE this role!!!! Its given me so much experience so far and knowledge on how to better my physicalities and acting in general and I really want to be in the ensemble in future productions just because of how fun it genuinely is😭😭 I love my role, just that I was horribly unprepared for what was to come.\n\nI also feel that this post can help others feel abit better about being cast in ensemble!! Its honestly really fun but alot of work!!",
    "score": 279,
    "url": "https://reddit.com/r/Theatre/comments/1omgvpj/being_in_ensemble_is_no_joke/",
    "created_at": "2025-11-02T13:10:32.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1ntqsxl",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Offered role that wasn’t auditioned for",
    "text": "My daughter auditioned for a musical this past weekend. On the form they asked which roles she was auditioning for, which she listed. It also asked if she would take another role to which she wrote no. We received an email today offering her a role she wasn’t interested in. We have worked with this director multiple times, and I don’t want to come off as ungrateful or ruin the relationship. However, my daughter does not want the role she was given. Is there  polite way to decline without causing further issues for future shows? I know my daughter will suck it up and do it, but if there’s a way for her to not without wrecking the relationship that would be great. Thanks for any advice. \n\nEdit: So I’ve replied this several times. My daughter is doing another show at the same time. She thought this show could be fun too, but only wanted to do it if she could get a role she was interested in. The 2 shows rehearsals do not overlap, nor do tech weeks or performances. Also neither my daughter nor myself are mad that she didn’t get one of the roles she wanted. She just doesn’t want to do a second show for a role she’s not excited about. She has done plenty of roles big or small. She’s a team player, and has made some big impacts with some small roles. One of the roles she auditioned for this show is very small but she liked the character. \n\nSecond edit: I have received some great advice on how to respond to the director without causing any tension for future shows. My daughter is going to take the night to think on it, as responses are not due until tomorrow night. ",
    "score": 254,
    "url": "https://reddit.com/r/Theatre/comments/1ntqsxl/offered_role_that_wasnt_auditioned_for/",
    "created_at": "2025-09-29T19:02:15.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1jhybsz",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Update to: director strangled me",
    "text": "https://www.reddit.com/r/Theatre/s/2yTRlQngQp\n\nIt's been almost two weeks since my last post and while the whole thing isn't wrapped up yet thought I'd update you as a bunch has happened. \n\nI called the co artistic director/founder on last Wednesday, briefly explained the situation, and asked her to set up a meeting between those of us cast members concerned, her, and the director before rehearsal last Sunday. She said she would, and then that evening I and all the cast members I mentioned on the phone received emails asking us to put our individual concerns in writing so they could set up a meeting. \n\nAfter discussion we decided for just one of us to reply and cc everyone else in the concerned group as we shared concerns and were also somewhat worried that they were planning to meet with us individually, which we wanted to avoid. A few hours after that email, the director messages the WhatsApp chat (which has all cast members in it, not just those who had emailed), saying that there'd unfortunately been complaints, that on advice from Equity and their legal rep rehearsal on Sunday was cancelled, and that we were all invited to a meeting instead. Via email he also asked me to write up a numbered list of concerns and act as spokesperson for the group during the meeting. They also removed the 16 y/o from the WhatsApp group at the same time.\n\nThen Sunday morning at 10:30, an hour and a half before the meeting was supposed to happen, he messages the WhatsApp group saying that as some cast members can't make it, it's unfortunately postponed to Wednesday. (Which I'm a bit sus about as they knew on Thursday that people couldn't make it. Also a bit shit as a few cast members including myself have commutes in excess of ninety minutes.)\n\nThen Tuesday, the co-founder messages the WhatsApp group saying Wednesday doesn't work for a lot of people, so we'll have it on Sunday (today) instead.\n\nThen this morning, she messages the WhatsApp group again saying that the director is sick so the meeting can't happen, and they'll be in touch early next week.\n\nSo today I've made the decision to drop out, although I'm not going to tell them until after the meeting as I think it puts me in a stronger position to advocate for anyone who decides to stay. I was gonna wait until after the meeting to decide (although felt pretty sure they weren't gonna react in a way that made me feel safe to continue), but the fact it's been postponed three times, and also that while the co-founder has sent messages to the line of \"we're listening and taking your concerns seriously\", there have been no such messages from the director who made the casting decisions and also assaulted me, makes me just want to walk.\n\nThanks so much to everyone who commented on the original post— I read through every comment several times and it was helpful and also validating that I wasn't going crazy and this was indeed not okay. I do not currently plan to report it, but I have a write up of what happened co-signed by the actor in the room with me, and have also got an email by one of the directors of my company talking to the effects the incident had on me at work over the last couple weeks. Just in case.\n\nTo be honest it had way more of an effect on me than I thought while writing my last post, both emotionally and physically (my neck was sore for like three days and I had to cancel a singing lesson lol). It's also been massively stressful organising everyone, writing emails, planning to speak at the meeting that keeps getting postponed. On the plus side, I'll win any future \"who's the worst director you've ever worked with\" pissing contests lmao\n\nP.S. Also on the plus side, I was offered a role in another show on Friday that's both paid and also looks to be run much better - e.g. there's a contract haha, so that's something to look forward to as well",
    "score": 250,
    "url": "https://reddit.com/r/Theatre/comments/1jhybsz/update_to_director_strangled_me/",
    "created_at": "2025-03-23T12:38:38.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1k2l3d1",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Director told me not to give actors notes",
    "text": "This is a long one. I recently received an email from my director that rattled me a bit and I need advice on how to proceed. For some background working with the Musical Theatre department and I came into the process late, I didn’t receive a script till tech week (I was getting by on the previous sm/current actor script) and I have managed to make it work. Anyway, it has been in my experience that during tech week stage managers give notes at the end of each tech week rehearsals and to be fair I have been quite harsh since there has been in my opinion unacceptable behavior (missing cues b/c of phones, not being ready to catch a falling actor, missing lines and cue) we open Tuesday. I have been told not to give notes directly to actor (unless it’s prop announcement and stuff like that) she wants me to send my notes to her and let her deal with them. She told me “I have never seen a stage manager give notes after a performance. While there may be announcements I never in the format that you have used where the sm comments on performances, on stage etiquette, on performer volume” I believe this is all tech related and should be noted on. Is there something I’m missing.\n\nedit: I just want to say thank y’all for the advice and I will definitely proceed with more humility. After reading these messages I realize I overstepped.",
    "score": 238,
    "url": "https://reddit.com/r/Theatre/comments/1k2l3d1/director_told_me_not_to_give_actors_notes/",
    "created_at": "2025-04-19T01:33:42.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1kuham5",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Censorship or copyright? Georgia high school shuts down student-led production of The Crucible after one performance. School first cited “demonic” content, then changed story to a copyright violation.",
    "text": "This happened at Fannin County High School in Georgia. After their drama teacher abruptly left two weeks before opening night, students finished directing The Crucible themselves. The Friday performance went well, until Saturday morning, when students were told the second show was canceled.\n\nAt first, the reason was content:\n\n&gt;&gt;“Somebody in the audience didn’t like the context of the play and said that it was demonic and disgusting and that it was immediately shut down.”\n—Angela Grist, parent of two cast members\n\n&gt;&gt;“He said that certain people had to ‘repent after watching the show’… that it was canceled due to parent complaints.”\n—Abigail Ridings, student director\n\nThen, two days later, the school released a public statement blaming unauthorized script changes and a copyright breach.\n\nBut students say no text was altered, only a wordless opening scene showing the girls dancing in the woods, a moment already described in the original script.\n\nParents contacted Broadway Licensing directly:\n\n&gt;&gt;“She told me that everything that I told her did not sound like copyright infringement.”\n—Angela Grist, recounting her call with the licensor\n\n&gt;&gt;“We are not traditionally one to shut productions down... it would not be as abrupt as this production seems to be.”\n—Broadway Licensing rep (recorded in a call posted by another parent)\n\nThe students weren’t offered a chance to revise or continue. They never got a clear explanation. And with the school year over, it’s likely this story quietly fades.\n\nBut the questions they raised, and the ones this incident leaves behind, probably shouldn’t be.\n\nSource: https://hesherman.com/2025/05/22/silencing-the-witches-in-georgia-high-school-crucible/\n\nScool statement: \n",
    "score": 232,
    "url": "https://reddit.com/r/Theatre/comments/1kuham5/censorship_or_copyright_georgia_high_school_shuts/",
    "created_at": "2025-05-24T17:40:18.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1pilpw1",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Unpopular Theatre Opinions Thread",
    "text": "I'll start:\n\nOur Town is one of the greatest ruminations on community, personal tragedy, life, love and death and continues to hold up as an American Theatre classic but it gets a bad reputation as being cheesy or boring because most of us are forced to read it in school well before we have had life experiences to appreciate its themes.",
    "score": 227,
    "url": "https://reddit.com/r/Theatre/comments/1pilpw1/unpopular_theatre_opinions_thread/",
    "created_at": "2025-12-09T22:42:33.000Z",
    "num_comments": 288
  },
  {
    "id": "reddit-1ijl5mg",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Help! My students actually can’t read",
    "text": "I teach middle school theater teacher of all grades and half of my students can’t read and can barely write. I’m not sure what type of assignments to even give anymore. We’ve done acting exercises, design projects, student led presentations, learning monologues and poems. And many fail because they can’t read the poem/script. Can’t retain information. Can’t grasp design concepts even after I’ve repeated it verbally to the many times and drawn them examples. I’ve had to explain what pantomime and improv is, no lie, once a week for the past semester. And we do hands on acting and designing as well and they still can’t grasp it. I’m getting discouraged.  Is there any advice you guys can give me on how to make lesson plans for students that can’t read, think critically or write?",
    "score": 220,
    "url": "https://reddit.com/r/Theatre/comments/1ijl5mg/help_my_students_actually_cant_read/",
    "created_at": "2025-02-07T03:02:06.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1k8i6qn",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "I hate being the understudy",
    "text": "I have never been more miserable while doing a show. I auditioned for Tuck Everlasting with the hopes of being cast as Winnie. I’ve never worked with this director before so i didn’t really know what to expect. I got a text from him two days after i auditioned and was told it was between me and another girl i’ll call Allie. He chose to give Allie the role while i got understudy. He liked us both too much to pick but since i had one more conflict than she did, i got the understudy.\n\nI was originally very excited to be the understudy. He explained that i was guaranteed at least 2 shows as Winnie, and the rest id be a featured dancer. Things went downhill VERY fast for me. A lot of people were very open about how upset they were that Allie got Winnie over me, saying i deserved it more than she did. I was very excited to work with Allie and the boy playing Jesse (well call him Jack), however a big part of this story is they are dating. So while i was learning Winnie’s part, they would be very flirty and not really include me in rehearsals. Alex then told me that i was just the understudy and this was supposed to be abt him and Allie. \n\nSoon after, Allie told me to my face how thankful she was that i only got two shows because she wanted this to be about her. After that i started feeling pretty awful about being the understudy and i dread going to rehearsal now. I was just told by my mother than she overheard the director saying how frustrated he was that i didn’t know my blocking. For context, i have only run Winnie once (I ran her for the first time two nights ago), and the reason i didn’t know some blocking is because they apparently changed a lot of it and never told me. \n\nSo yeah, pretty pissed off with how this is going down. Really wish i didn’t accept the role. ",
    "score": 211,
    "url": "https://reddit.com/r/Theatre/comments/1k8i6qn/i_hate_being_the_understudy/",
    "created_at": "2025-04-26T17:22:36.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1o9nkvb",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "How to tell my friend/dramatic scene partner they've started chewing the scene, and the performance is suffering for it",
    "text": "So, I'm in a dramatic musical, and in the second act, myself (romantic male lead) and my scene partner (romantic female lead) have a song that starts out as hers, but turns into a duet halfway through. It is a highly emotional, somewhat devastating moment in the play, with excellent music to sing to convey the emotion.\n\nThe actress has done an amazing job, really connecting with me during it, we've sold the shit out of the scene, and up until recently, I've been happy to sit back during the first half and just let her have her big moment. Unfortunately, in the last few performances, she's... changed. \n\nA couple performances ago, she started getting... well, really *internal* with it. She's clearly summoning a deep well of emption, but it's coming out in a way that is very... *extra.* She's gasping, clawing at me, clawing at herself. She's no longer supporting her breathing and isn't holding out long notes, she's dropping words, she's not singing harmonies, all because she's *feeling so much.* She's taken her performance from grounded and devastating (in a good way) to full blown soap opera. It's so much now that I can't connect with her anymore, because she isn't connecting with me. She's only focusing on connecting with herself. And nobody is telling her.\n\nIt sucks, because she's an amazing actress, and our first week of shows didn't have this problem. But when we came back for the second week, it totally changed. \n\nAnd I know it is the greatest taboo to give acting notes to another actor, but our director is allergic to giving acting notes anyway, let alone once performances started. But if it were me, I know I'd want someone to tell me what happened, and I'd want to bring it back in. \n\nWorst thing, her family flew in to watch our most recent show, and they were all crying together in the lobby as she told them this performance was the one she cried the most in. So I simply couldnt tell her tonight.\n\nWhat do I do? How can I bring this up? Should I bring it up at all? I really think the show is suffering for the changes.\n\nEdit: I would like to clarify. The only reason I've considered talking to this person about this at all is for two reasons. The first is that we're friends. We talk frequently outside of the show and hang out outside of the show. The second is that they told me about how their best friend will give them pages and pages of notes after seeing their performances, and how they love it. Additionally, yesterday before the show she literally said to me, \"I respect someone who will call me out,\" when I told her she was anticipating my entrance way too early and cutting me off from completing some blocking.",
    "score": 200,
    "url": "https://reddit.com/r/Theatre/comments/1o9nkvb/how_to_tell_my_frienddramatic_scene_partner/",
    "created_at": "2025-10-18T05:33:01.000Z",
    "num_comments": 105
  },
  {
    "id": "reddit-1kzfbq2",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Started acting later in life and my LTR partner doesn’t want me to do intimacy",
    "text": "Me and my boyfriend have been dating for more than 5 years and I had nothing to do with acting when we met. However 3 years ago I decided to give it a try (childhood dream). The first thing he told me was he wasn’t sure he could handle me kissing other actors. I told him not to worry as it probably wouldn’t become a real career anyways. Fast forward I now have an agent, get submitted for huge projects (though haven’t booked anything big yet). I feel the pressure, as every time I get an audition he’s asking if there’s a kissing scene in it. In the heat of the moment I told him I would try to decline every offer that includes a kiss but after giving it a lot of thought I don’t want to limit myself like this. I know I’m a good actress, I know I have potential. I don’t want to be limiting myself because of his insecurity, but I don’t want to f up a relationship that is otherwise really good. When is it worth putting the dream above your relationship??",
    "score": 103,
    "url": "https://reddit.com/r/Theatre/comments/1kzfbq2/started_acting_later_in_life_and_my_ltr_partner/",
    "created_at": "2025-05-30T20:59:19.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1hz3ty8",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "I feel embarrassed about pursuing a theatre career as an adult with a normal person job who never did a BFA",
    "text": "Forgive me if the tone of this post is unpleasant, but basically I'm an adult in my early 30s with a flexible 9-5 remote job and I'm trying to use that flexibility to get a regional theatre career as a performer off the ground.\n\nThe last few years I did a ton of a community theatre, but I want more. I had a particularly rough time in one show where I was the lead and felt that no one was taking the show seriously (people were missing entrances/jumping to the next scene/dropping tons of lines, the run crew left a joint on the prop table and mics stopped working and cues were missed), and it made me feel frustrated with community theatre. I had been auditioning for nonunion professional shows in my area while doing community theatre, and finally booked my first professional show recently that I'm being paid for! I'm so happy about it but I'm not sure if I'll ever get to the next step (equity/regional houses), and I feel like other people I know from my theatre scene would judge me if they knew how hard I was working on this and how seriously I'm trying to pursue my training to be able to do this.\n\nI'm also embarrassed that everyone would think I'm crazy for spending so much time and money on training. I pay around $500 a month on voice lessons, acting lessons and dance classes and even started doing career coaching as well to get help building a website/repertoire revamp. If people knew this I'm afraid they'd think I was pathetic for spending so much money on a hobby that went off the rails. Most of my theatre colleagues either do community theatre purely for fun or are people with BFAs who \"gave up\" on the industry, left equity/NYC to move to my town and just do theatre on the side while not pursuing any training, and have in some ways become the textbook definition of \"big fish in a small pond syndrome\".\n\nI'm working on a website now but I'm so embarrassed by the fact I'm even trying to do this that I don't want to launch it. I'm also working on putting a solo show/cabaret together and feel like people will scoff at me for trying to create my own work.\n\nJust wondering if anyone else is in the same boat or has developed strategies to not feel ashamed for trying to make this happen.\n\nEDIT: Just updated my post to make it more clear that I'm a performer trying to get a career in regional theatre as an actor off the ground, I do not want to start a regional theatre but that would be cool if that someday could happen!",
    "score": 95,
    "url": "https://reddit.com/r/Theatre/comments/1hz3ty8/i_feel_embarrassed_about_pursuing_a_theatre/",
    "created_at": "2025-01-11T19:35:16.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1ms1enh",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "\"How Much Does It Cost To Put On A Show?\" (a case study)",
    "text": "I’ve seen a few variations of “how much would it cost to…?” posts that have (correctly) received the answer of “well, it depends.”\n\nAnd that’s great and true, but not necessarily the most helpful. I just closed a show as director/choreographer/producer - here’s a case study of our budget breakdown, choices we made, and where we could have changed things, saved money (or, realistically, where we want to spend MORE money next time). \n\n**Some background:**\n\nI live in a moderately large city that’s not NYC/Chicago/LA - think Philadelphia, Austin, Seattle, Atlanta, Boston, DC, Minneapolis, etc. \n\nI’m in my early 30s; my co-Artistic Director is in his early 30s; my (life/romantic) partner is in his mid/late 30s. We’ve been working professionally on alllllllll sides of theatre (making, performing, producing, teaching, admin/management, marketing, fundraising, tech) for our entire careers (minus, y’know, approximately 2020-2021)  - sometimes paid well, sometimes paid poorly, sometimes for ourselves, but we’ve had a lot of training and gained a LOT of skills and scrappy indie DIY spirit.\n\nOur company had its inaugural show in the mid-2010s in a different city. We had three great seasons of festival work and some self-producing in other venues, to both audience and critical acclaim, but COVID and life (including moving cross-country) laid us dormant for a while. This was our first full-length show post-COVID, as well as our first show in this city, and we very intentionally wanted it to be a BIG comeback, so we stretched ourselves a lot.\n\nWe make original, devised work that lives somewhere in the physical theater / dance-theater realm, so the cost for rights/scripts aren’t a thing, but on the flip side we need a lengthier rehearsal process in a dance studio-type space. \n\nAlso, just for my sanity: If you saw this show or live in my current (or maybe past?) city, there’s a chance you recognize it via the details I provide in our cost-breakdowns. If you’re curious if you’re right, DM me. Please don’t dox, this is a throwaway for a reason.\n\n**All right, all of those things out of the way, let’s get to the Big Costs**.\n\n1. **Venue:** $1,600. We wanted to premiere this work in a theater, not a found/outdoor space, for a lot of reasons. I was already somewhat connected with a venue owner whose mission is to support new and experimental work (having performed in his space with other companies before) - I sent him an email introducing myself and our work, including video of past works and a “trailer” of a past workshop version of this piece, and he was interested both in the specific work and in helping us get established in this city. He cut us an absolutely amazing deal: $1,600 for 4 days of tech (Mon-Thurs afternoon/evenings) and 6 shows (Fri/Sat/Sun x 2 weekends). This was a 90 seat black box theater, and ended up being about half the price of comparable local spaces. Part of the reason we got such a fantastic price was because we have our own highly experienced technical director (my partner, who despite his myriad paid professional achievements still volunteers as our lighting designer/stage manager/general technical wizard), and the venue would not need to supply any personnel.\n2. **Rehearsal Space:** $1,100. I cobbled together rehearsal space from the venue we were performing at ($20/hour), a different studio with an extremely good deal on “off-peak” hours ($12/hour, compared to their usual rates of $30/hour), and a training space that our aerial director works at (free, but extremely limited). We spent 11 weeks in rehearsal prior to tech (one week mid-way off for a holiday break), with 2 rehearsals/week for the full cast and an additional weekly aerial rehearsal for our aerialists (who were frequently not called to full rehearsals - everyone was called for 3-7 hours of rehearsal/week before tech, averaging 5.5 hours per week). We totaled about 80 hours of rehearsal between ground and aerial-specific rehearsals; this was definitely the minimum time required for this work.\n3. **Performers:** $3,200. 8 performers at a guaranteed $300 stipend, plus box office split, which ended up being an additional $100, so $400/performer. That pay is on the high end of “indie” for the area, but not a professional rate. We have big goals in this direction.\n4. **Aerial Director:** $500. We hired someone I’ve worked with (as a performer) before and who we got along well with.  She has a strong aerial and performance background, including experience in rigging, but this was her first time doing aerial directing work, which is how we got her for this rate. \n5. **Insurance:** $450. A requirement by our venue, but also just a good idea, and one that’s often overlooked.\n6. **Videography:** $650. Two cameras - a wide angle and a close shot - and editing. This felt like a “splurge,” and is definitely something that in shows past we’ve just DIY’d, but having one less thing to worry about AND knowing that the quality will be good was worth it.\n7. **Marketing:** $275 (ish). A very small run of posters and postcards, plus two different paid IG ads. I don’t include our website costs in this, because those are year-round.\n8. **Fundraising Costs:** $500(ish) - we received fiscal sponsorship through Fractured Atlas; they take 8%. \n9. **Costumes, Props, Tech Miscellany:** $1300 - 18 individual costumes with 1-3 pieces/layers each, the materials (foam, foam clay, acrylics, etc.) and patterns for four custom-made character masks, materials (wire, fabric, solder, dowel rods, LEDs) for three large puppets, materials for a couple of smaller props, quick link and chain to hang a (borrowed) drop mechanism from the grid, spike tape, renting a specific pulley for aerial rigging from our aerial director’s network; a few other things that got mashed into “receipts from X” in my budget spreadsheet, probably. This is a category that, if you're not prepared, can get out of control quickly. Keep an eye on it, set reasonable budgets, and know where to skimp (thrifted shirts! art reuse stores!) and where to not (anything that involves rigging or safety).\n10. **FOH** \\- $150 on wine, beer, la croix, ice, and cups.\n\nIn total, that’s $9,725.\n\nWithout making any artistic changes, we could have saved money on costuming by being better at (or having more time for) thrifting - though I did pull a fair amount from my own wardrobe/past costumes, for the couple of performers who are around the same size I am. Materials-wise, we have leftovers of many things to start creating backstock/a production shop for future shows (think acrylics, extra LEDs, foam clay, Xacto knife blades, etc.), which feels good. We also could have saved money on videography, and… frankly, that’s about it. In an ideal world, we would have had a longer rehearsal process, paid everyone more, and spent slightly more on marketing.\n\n**What we DIDN’T spend money on (or list):**\n\nScripts/rights - original work!\n\nMusic rights - I have an annual rights subscription to SoundForMovement/Michael Wall - he JUST raised his prices after the completion of this project (including a split between individual and company rates, which wasn’t true a few months ago), so we’ll have to revisit that - but he’s a composer for dancers and makes licensing for live shows on the scale of our work extremely easy and accessible. This is a constant cost for me personally, so I don’t include it. \n\nTechnical Director, Lighting Designer, Stage Manager - thanks, partner. \n\nStagehands and FOH - between myself, our Aerial Director, and my co-Artistic Director, we covered these roles internally.\n\nCostume sourcing; props, mask, and puppet design &amp; fabrication - internal, with a lot of learning as we went.\n\nProjection design - internal (though admittedly minimal - I had Plans for this but it’s what got scrapped when we hit an inevitable time/energy crunch)\n\nEquipment - the venue came with almost all the technical elements we needed, including projector, Qlab, lighting console, lighting fixtures, and a small gel stock we could use; we didn’t need to rent anything.\n\nGreen room items - the venue was not well stocked, so I brought in a personal clothes rack and mirror. Literally personal, my clothes were just in a pile on the floor and I had no home mirror for the run of this show.\n\nSound design (outside of music) - internal\n\nGraphic design &amp; social media - internal\n\nGrant-writing - 0 success anyway (out of 2 applied for for this work), but still internal\n\nProduction Photos - co-AD with my partner’s nice DSLR during our least-attended show. This is one of the next things we’re going to start outsourcing to free up production team bandwidth (and had a plan to this time, but unfortunately it fell through).\n\nDirector/Choreographer - co-Artistic Director and I were not paid for this work. We would like to start paying ourselves within the next 2 years, but for now, all our labor was free. I am otherwise self-employed, and was able to spend 10-20 hours/week on this project for about 4 months (pre-production and early rehearsal period), and that slowly ramped up, peaking at 70+ hour weeks right before and during tech. My mantra during this was that I wanted to make a 10k show look like a 20k show through sheer volume of (my own) unpaid labor. \n\n**INCOME**\n\n**Fundraising**: $6000 (before the 8% fiscal sponsorship fee). We offered program shout-outs, VIP tickets, hand-made merch/gifts, and a viewing link to the edited performance footage as rewards. We provided our cast with ask templates to send to their network, posted on social media, and I reached out directly to a lot of my network.\n\nWe were able to secure a couple of large donations from family and network who had never previously supported our work - but, among other reasons, having the donations be tax-deductible swayed them. This crowdfunding campaign was much larger than for our previous work, and not something I would necessarily expect to be able to replicate without a lot more labor and sponsorship outreach. In this case, a couple of sizeable pledges happened early in our campaign, and, honestly, it let me take my foot off the fundraising gas to focus elsewhere, which was a huge relief.\n\n**Online Ticket Sales**: $4210 - 5 shows (we ended up cancelling one due to performer illness, but most attendees were able to reschedule), 90 seat house. We ended up with 230 tickets sold online (of a possible 450); we priced all of our tickets as sliding-scale, from $15-40, with a “recommended price” at the midway point… and subsequently learned that that is NOT really a thing in this particular city, with the majority of ticket sales at the lowest price listed. Our pricing model is something we’ll revisit in the future. We are firm believers that art should be financially accessible to all, but it is also expensive to produce, and is only possible because so many of us are willing to work for no to little pay to make it happen. \n\n**FOH**: $875 - This included drink sales and walk-up tickets, as well as a silent auction item (a painting) that a cast member’s sibling supplied - we split the auction item 50/50 with the artist.\n\n**Costume Buybacks:** $75 - certain performers LOVED particular costume pieces and asked to buy them at the end of the run; I let them go for around 50% of what we paid, and only for pieces we were fairly certain we wouldn’t use again, or that would be really easy to replace.\n\n**Total Income: $11,160**\n\n**Total Expenses: $9,725**\n\n**Total profit: $1,435**\n\nThe show ended up being about 75 minutes plus intermission. We met our audience attendance goals (50%), were able to increase our performers’ stipends by 25% over their guaranteed minimum, received great press and audience feedback, increased our social media following, established a mailing list of patrons in this city, and impressed the owner of the venue we performed at such that he wants to keep hosting us in his space.\n\nOur other big goal for this show was to end with some amount of profit to put towards the next work, starting a shift towards forward-funding. Achieved. \n\nI will say, doing this level of work at this level of funding was HARD, and drew on a lot of random skills and favors - hey, this friend builds puppets for a living, can I buy them a beer and ask questions? This theater my partner used to work for has a drop mechanism that we KNOW they haven’t used in five years, can we borrow it? Hey YouTube, you have a tutorial on this thing, right? I don’t necessarily recommend this way of working as a general rule, but we gambled that making a big, intense work for our regional premiere would pay off in the mid- and long-term. Our goals moving forward are better performer pay, longer development processes, hiring at least 1-2 more production or design team members per show (personally, I really want to hand off costume design because it is my absolute least favorite), starting to pay ourselves, and of course doing so by growing our audiences and teaching ensemble-based theater workshops to create more regular income.\n\nThis is just one case study of one low-budget indie production in one city - when thinking about your own budget, there are lots of variables to consider that might have different answers than the ones we had, and that’s okay! But this kind of information would have helped me a lot when I was getting started producing my own work nearly ten years ago, and I hope that it is at least interesting to you!\n\nI’m happy to answer any questions in good faith that come up in the comments, but know that the answer to some of them might be “that feels way too identifiable to answer specifically.”",
    "score": 94,
    "url": "https://reddit.com/r/Theatre/comments/1ms1enh/how_much_does_it_cost_to_put_on_a_show_a_case/",
    "created_at": "2025-08-16T17:14:36.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1m8arzz",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Broadway Principal. What to expect?",
    "text": "Cross posted to maximize advice: \n\nAfter several rounds of auditions I just booked my first theatre role as a principal. Not first professional, but first ever. No regional theatre or even school plays to reference. It will premiere out of state for a month (relevant to the content of the show) and then have a Broadway run. I am confirmed for both runs. I have solid TV/film credits and that is what my career has been built on, but I do not have stage or theater experience. It is daunting to say the least. It’s a musical (I sing, play guitar, and I’m an okay dancer) which is very much outside of anything I’ve ever done before. I have played guitar and sang in front of crowds (2k+) while in band, but this is a different beast. I’m both excited and overwhelmed because this isn’t something that I ever imagined I would do in my career and it happened so suddenly that I haven’t had time to mentally or logically prepare for it—I have a full time job which pays me well, so it’ll be tough to step away from that for the next 3-4 months and move from LA to NYC. I am truly grateful for the opportunity as I know it’s a once in a lifetime chance for very few actors. What are some expectations that are to be managed? What are rehearsals like? What is the lifestyle like? The full cast hasn’t been made known to me or my reps, but the star of the show is major performer that we have all heard of. How can someone that’s completely green in this world of performance best position themselves for success? For those that have been through this, how did you manage relationship with your significant other? Any sort of info or advice you can possibly think of is welcome. This isn’t a humble brag. I haven’t booked in nearly two years so I know how brutal the industry is right now. I’m just an overwhelmed guy who is very much out of his element. Thanks in advance. ",
    "score": 78,
    "url": "https://reddit.com/r/Theatre/comments/1m8arzz/broadway_principal_what_to_expect/",
    "created_at": "2025-07-24T17:32:44.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1n9ike0",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Going to College for 3 years and STILL haven't been Cast",
    "text": "Hello, I am 20M, and I go to \"one of the best\" colleges for theater arts in my state. When I went to audition for the 4 shows for the year (2 in the winter and 2 in the spring), I was one of the few people in the WHOLE department that hadn't been cast, but I shrugged it off, and I said, \"I'm a freshman, so fair enough, I'm not getting a part right away.\" \n\nCome sophomore year, I don't get cast AGAIN for ANY of the 4 shows (although I did get 2 understudy roles for 2 separate shows, but those don't count because I never performed as an understudy), so then I'm thinking, \"Okay, surely I'll get something my junior year.\" \n\nSo I sang my 32-bar song, \"Sit down, you're rocking the boat,\" and a monologue from \"The Odd Couple,\" and I got called back (nothing to brag about; I always get called back but NEVER cast), and they told me to read a part for a character for a show that they're doing so I did and again I tried my best from what I was given, and I noticed that after the fact when I read the character they had 2 people read for the same part that I just read at least 2 times, and I never went a second time. So that sinking feeling comes back. I am about to not be cast for a THIRD YEAR IN A ROW.\n\n\nSo I ask, what the hell should I do? I need STRONG advice, not just \"keep going forward\" or \"try something else\" or even \"don't be an actor,\" because I always do a different set of pieces for each of my auditions, but they never work. I want to do this for a career; it is my passion and my lifelong dream to be an actor, but how the hell am I going to be one if I don't even get a chance? If anyone else has similar stories I would love to hear back because I feel I'm alone in this.",
    "score": 76,
    "url": "https://reddit.com/r/Theatre/comments/1n9ike0/going_to_college_for_3_years_and_still_havent/",
    "created_at": "2025-09-05T22:08:18.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1ie5w6m",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "My mom keeps telling me that I won’t get into a musical theater school or be successful in musical theater if there aren’t many major/leading roles in my portfolio/experience.",
    "text": "I auditioned for my school’s production of the Wonderland musical, got callbacks for the White Rabbit and the Queen of Hearts, and I ended up getting the understudy for the Queen of Hearts. I was a bit disappointed at first, but after learning I’d still get to be in the ensemble, I felt better about the role. My mom called me today and basically just started yelling at me because she was pissed that I got an understudy/ensemble role and even threatened to send an angry email to my director about it. I told her not to do that because that would in turn make me look bad, but it didn’t seem like she cared and basically used it as blackmail to get me to ask what went wrong with my callback/what I can improve on. But then she made the argument that the past musicals that I’ve been in (the ones at school, which is what she was referring to), which were Into the Woods (I was Rapunzel, which is the role I wanted btw, and I’d make the argument that while she’s not a main character, she’s still a bigger role even though she only has a few scenes) and Newsies (I was a nun/bowery beauty/newsie/mayor) and that I was being “robbed” of performances and that “nobody else but me had talent”. I told her she was being entitled but then she got really defensive. Anyway, she then told me that if I don’t play enough major/leading roles and if I get so many ensemble roles, that I won’t make it in the future and that no musical theater college would accept me based on that portfolio. After thinking about it for a little bit, I started to get scared about “What if she’s right? What if I don’t have a good acting career because of my smaller roles?” Part of me wants to believe that she’s wrong, but I just don’t know. Please help me.",
    "score": 73,
    "url": "https://reddit.com/r/Theatre/comments/1ie5w6m/my_mom_keeps_telling_me_that_i_wont_get_into_a/",
    "created_at": "2025-01-31T03:39:17.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1k00j97",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Performers—what do you do outside of theater that both brings in income and feeds your performing career?",
    "text": "Hey all,\n\nI'm curious to hear from fellow theater professionals: what side gigs, day jobs, or alternate careers do you have that not only help pay the bills but also actually support or enhance your work as a performer?\n\nI’m not just talking about survival jobs (though those are totally valid)—I mean roles or industries that feed your performance work in some way. Maybe they keep you creatively sharp, physically active, socially engaged, or even just in the right mindset. Bonus points if it offers flexibility for auditions, gigs, or rehearsals.\n\nFor example:\n\nDo you teach or coach acting?\nWork in casting or production?\nDo voiceover or audiobook work?\nSomething totally outside the industry that still complements your skills (e.g., fitness coaching, tour guiding, etc.)?\nLooking for inspiration and maybe some ideas to pursue myself, so I'd love to hear what’s worked (or not worked) for you!\n\nThanks in advance!\n\n",
    "score": 65,
    "url": "https://reddit.com/r/Theatre/comments/1k00j97/performerswhat_do_you_do_outside_of_theater_that/",
    "created_at": "2025-04-15T19:19:57.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1maugdn",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "I'm disillusioned and cynical about theatre and art and I don't know what to do.",
    "text": "Theatre was always my dream. At first, it was acting, but I wanted to do so much more. I wanted to design, direct... I wanted all of it. \n\nAnd I've done it. I'm known around town for doing good work in multiple fields of production. People like working with me. I was able to quit my job in retail and survive 100% off of my theatre work. I've been a full time professional theatrical contractor for two years now.\n\nAnd I'm completely miserable. It feels like I've hit a ceiling. The work I do is good enough for professional theatre, but I can't break in to even bigger projects. Broadway levels of theatre feel further away than ever. I dont like half of the projects that I work on, but I take them because I need a paycheck.\n\nI've worked for more than half of the big theatres in town, and they all have some big, glaring issues. Big personalities, cliques, downright discrimination and abuse. There are people I love working with, dont get me wrong. But it feels like the good people get burnt out and leave the industry, and the ones who thrive in toxic environments stay and perpetuate the cycle of toxicity. \n\nI am tired. I'm burnt out. I missed a production meeting and felt nothing, because I just dont have it in me to care anymore.\n\nMy work is still good. My results still speak for themselves.\n\nBut I'm craving stability and an environment that doesn't make me want to pick up a cigarette. (It's hard to stay on the wagon in this business.)\n\nI've looked at switching careers, but what would I do? Literally all my impressive work credits are in theatre, and no one wants to take that employment risk. And besides. This has always been my dream. And it turns out my dream sucks. And I dont know how to cope with that. \n\nI dont know what I'm asking. Maybe I'm just looking for advice, or support, or the knowledge that I'm not alone. ",
    "score": 57,
    "url": "https://reddit.com/r/Theatre/comments/1maugdn/im_disillusioned_and_cynical_about_theatre_and/",
    "created_at": "2025-07-27T18:58:57.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1kh3qge",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Toxic actor",
    "text": "This is my first time posting on Reddit so I'm sorry if I do this wrong. I'm in need of opinions and advice about a situation I just experienced. I'm sorry in advance for the length. I need to start by saying I've been doing musical theater for 14 years. I've worked with a lot of different companies in 4 different states and dealt with my fair share of problematic people.\n\nThe musical I was just in closed last weekend and it was great! I'd never worked with this company before. They're a very small group and from my understanding they don't have much funding so people seem to wear a lot of hats. I made alot of good friends and learned so much from the director. I'd never worked with her before so I didn't quite know what to expect but she has a reputation for being frank but respectful, smart and really talented. During this show I got to know her pretty well and have a lot of respect for her. Especially the way she handled how she was treated by some cast members.\n\nDuring rehearsals there were many times when some cast members did things they're not supposed to do and she always handled it with patience and professionalism. She certainly handled it better than I would've. Almost everyone in the cast was really professional and fun to work with too. There were a couple of people that were difficult and didn't take notes very well but there was one person in particular who obviously had their own personal issues with the director.\n\nThings like being on their phone or talking to other cast members while the director was giving us notes. She'd roll her eyes whenever the director spoke. She'd tell me and other cast members to ignore any notes we were given and do whatever we wanted because that's what she was doing too. She'd say the director doesn't know what she's doing and won't take anybody's ideas or suggestions.\n\nOn opening night this actress started using a wedding ring as a prop in a song she sings towards the end of the show and she threw the ring across the stage in the middle of her solo. No one had ever seen her use this prop before opening night. The character's divorced and doesn't want to reconcile with her husband anymore so she wouldn't be wearing her wedding ring by that point in the story. After curtain call that night I overheard the director tell the actress not to use that prop and explained why. She also explained that it wasn't safe because somebody could slip on it in the dark. The actress then used the ring again in the next show. The following night the director gathered the cast to give us a couple of technical notes from the previous night's performance and again told the actress not to use that prop.\n\nThe actress continued to use and throw the wedding ring every single night until we closed. One night at the end of her song she even flipped both middle fingers up at the director who was in the booth calling the show. I know the director tried talking to the actress a few times privately because the actress kept bragging to us that the director was trying to get in touch with her and she was ghosting her.\n\nThis actress made us so uncomfortable! She had a terrible attitude, was always saying that she could do a better job directing the show, constantly insulted not only the director but other people in the show and even our awesome crew! I think the reason the director didn't fire her is political. This actress is on the board of directors of this company so I think the director might have felt like she had no choice but to keep the actress in the show. And since she was one of the people wearing multiple hats, the director had to be at every performance.\n\nIf it wasn't for this toxic actress my experience in this musical would've been one of the best in my career. It got to the point that we were all trying to avoid her but she kept injecting herself into conversations we were having backstage or inviting herself to get togethers. It was so awkward! She's worked with other companies and I've never heard anything negative about her in this way which makes me think this was definitely personal. As I mentioned I got to know the director pretty well and she's a kind person. I feel really bad for the way she was treated. I'll gladly work with her again anytime but if that actress is ever in another production I'm in, I don't care what the show is or how much I'm getting paid, I won't do it. \n\nThis is where my request for opinions and advice comes in. I've always been taught you don't give notes to other actors. You don't go over the director's head. And you certainly don't make changes on opening night especially without the directors approval. I don't know if the rest of the board of directors is aware of this behavior but they should be! Except I really don't know how to handle this. Is it overstepping if I track down the email address of someone on the board of directors and tell them about my experience? If I do should I do it anonymously? I don't know the pecking order of the board of directors so I'm not sure if sending an email to any of them might end up backfiring me on me and getting me black balled from this company or other companies she might be associated with. Or should I just mind my own business and move on? How should I handle this?",
    "score": 55,
    "url": "https://reddit.com/r/Theatre/comments/1kh3qge/toxic_actor/",
    "created_at": "2025-05-07T17:49:43.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1mw0969",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "I can’t stand going to a conservatory anymore",
    "text": "I am not sure if this is where I should post this, but I didn’t know where else was appropriate. I am currently enrolled in a theater conservatory in NYC. At first I was excited and really wanted to pursue a career in theater, but being here for just about 2 months now has shown me that I don’t really want to do this anymore. Immediately after arriving here, I started getting doubts, and while I love many of the people and staff here, I find the curriculum to be too much for me. I didn’t like dance classes from the start, but I was motivated and pushed through. Now it’s week 9, just after midterms, and I haven’t gone to any dance classes in the past week. I have already paid for the first year so I have to stick it out until the end, but I don’t know how to keep pushing through and keep myself motivated. How do I keep showing up and trying every day? Any advice will be greatly appreciated, as I just feel lost right now.",
    "score": 41,
    "url": "https://reddit.com/r/Theatre/comments/1mw0969/i_cant_stand_going_to_a_conservatory_anymore/",
    "created_at": "2025-08-21T03:37:36.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1i0y4za",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Will working at a Conservative/Christian theatre company hurt me in the long run?",
    "text": "Okay, I am a relatively new actor looking to build my resume beyond community stuff and personally, I'm not a conservative, (nothing against them but whatever,) and I don't mind working with conservatives whatsoever but this company, in particular, is closely associated with Liberty University in Virginia... they're doing 1776, which is weird because there's a number explicitly making fun of conservatives. But my question is, will working with this company and this director (who is very pro trump) screw me over in the long run,/will directors turn me away if they see that I've worked with this place,  I WANNA STRESS I DONT MIND WORKING WITH PEOPLE WITH DIFFERENT POLITICAL BELIEFS I JUST AM VERY CONCERNED ABOUT MY CAREER. So yeah. ",
    "score": 39,
    "url": "https://reddit.com/r/Theatre/comments/1i0y4za/will_working_at_a_conservativechristian_theatre/",
    "created_at": "2025-01-14T04:34:42.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1k3oko1",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Stage Kissing Advice",
    "text": "I’m [redacted]f and am routinely cast in romance roles with older men. The first was gay and 35 and an absolute darling, no troubles, the second was a 70yo which I was expected to kiss (I stood up for myself on that occasion, I’d have been deeply uncomfortable otherwise), and I was iffy about the 23yo I was required to make out with at 18. All these men were lovely and did their best to make me comfortable, so this isn’t about *them* exactly. \nAt 19 I know I’m an adult, this is a career I want to pursue professionally, actors are expected to be professional and seperate theatre and real life, etc. BUT I’ve been cast in a role where I know the man will be at least ten years older than me, and I will have to kiss him, and frankly, it gives me the heebie-jeebies. \nI’m rural, I’m a big fish in a small pond, but the companies I work with are quite professional and I wouldn’t give up a role for the world. ALSO considering I was scouted for this role, without even needing to audition? Everything about it is so exciting, except that I continuously am paired with these old guys, when I barely consider myself an adult. I don’t even know how they feel comfortable kissing me. Everytime, I’ve gotten used to it, I put it aside, I work around it, whatever, I just… don’t… wanna…\n\nSo am I looking for advice? Maybe? I know I should speak to the director and my scene partner and maybe request an intimacy coordinator, set boundaries, whatever. \nI think I’m just looking for solidarity, and a second opinion. Is it weird to be legal and concerned with men older than you? How do I approach this feeling? Have you ever directed a couple with a big age gap? Have you substituted kissing for less intimate blocking? \n\nWhatever is on your mind, about the topic, just say it ig. I’m obviously overthinking it lol.\n\nAlso, i know stage kissing is an overdone topic on the sub, but I couldn’t find a solid answer/anything I was looking for in the search results.",
    "score": 38,
    "url": "https://reddit.com/r/Theatre/comments/1k3oko1/stage_kissing_advice/",
    "created_at": "2025-04-20T15:05:52.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1kiqwtb",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Maybe I’m a failed actor, where do I go from here?",
    "text": "\nProbably a familiar story. I had dreams of being an actor and now I feel so lost. I didn’t know where else to post this. I’ll try to keep it short. \n\nI graduated in 2018 with a BA degree in theatre arts. Originally I wasn’t going to do anything with theatre or acting in college. I’d acted almost at least once a year since I was 6 but I told myself I either wasn’t good enough due to my lack of experience or I should get a degree in something that makes money. But after I got a taste of it, I thought there was nothing else I’d rather do. I found my community after feeling lonely and isolated in high school (I was gay in a conservative religious school). I started with a minor but couldn’t resist getting a major. I got a double major in mass communication for a focus that was admittedly ill-defined but I was so sure that if I kept grinding and working hard I could make it as an actor. At least I didn’t go into debt for it but now I wished I had taken a focus other than acting. Tech, stage management, anything. \n\nI moved to a bigger city in 2019 with a bigger theatre market, but Covid hit right when I was starting to feel like I was getting somewhere in theatre and film. I was already working uphill because my directors were harsh people and didn’t like me for my greenness compared to others while I was in school, they never recommended me for jobs despite me graduating with high honors. The auditions dried up during Covid and I was working in a restaurant but got furloughed, so I had no sources of income. Once I got back to work, I had no funds available to do anything but focus on making money and supporting myself. \n\nAnd that’s where the steady decline started. More and more I thought less of acting and more of just dreaming of the day I could put my bills on autopay. I went from four shows a year to one in the summer. I went from proudly posting on social media about my “career” to stopping posting entirely. I feel like I have nothing worth being proud of at all anyway now. I never did this for likes on social media but even when I said I had a lead role, no one seemed to care and even fewer showed up. Even my first professional show everyone had an excuse why they couldn’t make it. How can you go on when it feels like no one cares? I even tried voice acting but ran out of money for the software and sound-proofing materials after months of lessons. \n\nI don’t know what to do now. I just turned 30. I turned down the only role I was offered this summer so far because it wasn’t worth the money I’d lose taking it. I’ve tried all kinds of service industry job for the last 12 years and found they don’t pay enough for me to survive or I’m constantly angry at being stiffed over and over again. I’m not in crushing debt but debt nonetheless purely from not being able to both eat and pay bills consistently for a few years. I got a well-paying office job at the end of last year but my boss was so angry at me every day for asking questions in a new field that I quit within 3 months and it sent me into therapy (which was cancelled along with my health insurance when I quit). \n\nI deliver pizzas now and I can barely even smile anymore. I feel hopeless and my love of performance has been almost crushed out. I don’t know who to go to for advice. I’ve isolated myself from everyone I know for the most part because I believe I’m a failure. I can’t afford to go to therapy. My parents are good people but they don’t have money either; they worked manual labor jobs their entire lives after high school and I have no one “successful” in my life I can go to for help. \n\nI know I should have made better choices for my future and I don’t even want to be a career actor anymore, but now I just need some guidance of how I can maybe leverage my skills and experience into something that keeps me alive. Or maybe I need to hear that I screwed up too much and need to start over. Is there any hope? \n\nThanks for listening.",
    "score": 35,
    "url": "https://reddit.com/r/Theatre/comments/1kiqwtb/maybe_im_a_failed_actor_where_do_i_go_from_here/",
    "created_at": "2025-05-09T19:22:33.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1hu9g5c",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Can you truly be called a great actor if you can't do Shakespeare?",
    "text": "Reviews of Sigourney Weaver's appearance in *The Tempest* in London have been less than great, to put it mildly. One [writer](https://www.theguardian.com/commentisfree/2024/dec/29/sigourney-weaver-prospero-celebrity-shakespeare-indulgence) worries that movie celebrities who can't cut it in Shakespeare's plays will scare off new audiences entirely. But no matter how poor the reviews in *The Tempest*, Sigourney Weaver is an Oscar nominated actor and Golden Globe winner with a long, successful career. Question: No matter how successful you are, can you truly be called a great actor if you can't do Shakespeare?",
    "score": 35,
    "url": "https://reddit.com/r/Theatre/comments/1hu9g5c/can_you_truly_be_called_a_great_actor_if_you_cant/",
    "created_at": "2025-01-05T15:29:59.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1n55p9g",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "🎭 Ciara Renée Sues “Gun &amp; Powder” Producers Over Alleged Contract Breach – Timeline according to the Lawsuit",
    "text": "This has been discussed on this sub this week, but as someone with some industry experience, I thought I would provide a text breakdown of what is being alleged in the Gun &amp; Powder lawsuit. Public filings linked below:\n\nhttps://www.courtlistener.com/docket/71109448/renee-v-sisters-clarke-limited-liability-company/\n\n\n**⏱️⏱️⏱️ THE TIMELINE, ACCORDING TO THE SUIT FILED:**\n(Note: This summary is based on public records, primarily the plaintiff’s complaint in Renee v. Sisters Clarke LLC. These allegations are unproven and reflect only one side of the case. One’s inclusion in the suit does not mean wrongdoing has been legally established.)\n\n\n*📍 November 2023:* Ciara Renée signed a contract to offer her acting and singing services in the production of a Gun &amp; Powder mounted by Sisters Clarke LLC. The suit notes that the agreement that she signed included the right to continue such services in a production mounted in New York or London, upon completion of good faith negotiations to determine compensation.\n\n\n*📍 February - May 2024:* Renée states she performed the services required of her in this agreement. The suit states that she was never notified by the producers that she was in breach or in default of any of her obligations as stated in the agreement. The complaint notes that she generally received glowing reviews for her performance.\n\n\n*📍 July 2024:* Producers requested that Renée sing and record a selection of songs from Gun &amp; Powder with other performers from the production, and she received a flat fee for this work.\n\n\n*📍 August 2024:* Producers requested in July that Renée come to Martha’s Vineyard in Massachusetts to meet with potential investors for this show. She was introduced to potential investors as a member of the future Broadway cast. Renée was not paid for her travel time, nor for her time speaking with potential investors. The producers paid for her travel, hotel costs, and meals while in Massachusetts, but there was no additional compensation.\n\n\n*📍 September 2024:* Producers requested that Renée attend a “Get Out The Vote” event to promote the play as a cast member of the future Broadway company. She was unable to attend due to a scheduling conflict.\n\n\n*📍 September 2024:* The rights and liabilities of SISTERS CLARKE LLC were assigned to MAKE WAY BROADWAY LLC as a co-producer, with the ability to mount a staged reading of the play. Make Way Broadway LLC is a subsidiary of NAMCO.\n\n\n*📍 October 2024:* Renée entered a written agreement with Make Way Broadway LLC to perform a staged reading of Gun &amp; Powder with some of the other performers from the Paper Mill Playhouse production. This reading allegedly involved all of the individual producers from the original production.\n\n\n*📍 November 18 2024:* Producers requested that Renée attend the [52nd Annual Vivian Robinson/AUDELCO Recognition Awards for Excellence in Black Theatre in Harlem](https://www.instagram.com/p/DBrHlVbvarM/?img_index=1) on behalf of the production. She went to this awards show with the performer who played her mother in the production and the composer of the play.\n\n\n*📍 November 27 2024:* Producers Sammy Lopez and Alecia Clarke allegedly called Ciara Renée on the phone to inform her that Gun &amp; Powder would be transferring to Broadway, she would not be hired to perform in it, and they had advised the production not to negotiate with Renée at all regarding her future employment with the production.\n\n\nOn this phone call, they informed Renée that she had “materially failed to collaborate in the Play performed at the Paper Mill Playhouse, and that she was unwilling to accept feedback from the creative team,” which, according to Renée, was false.\n\n\nThey also allegedly sent her an email about this through her agent:\n\n\n&gt; \"I am writing to inform you that today the Producers of Gun &amp; Powder spoke with Ciara Renee about how they are not moving forward with her for future productions.\" \n\n\nWhen she asked for further elaboration, this is what she says she received via email:\n\n\n&gt; \"Reflecting on information learned during post-mortems from various team members, including Ms. Renee’s lack of collaboration and unwillingness to accept feedback from the creative team, the Producers have decided not to offer a Broadway contract for Gun and Powder.\"\n\n\n*📍 May 2025:* Producers issued a press release stating that they were changing the name of the production from “Gun &amp; Powder” to “Wanted” for the Broadway transfer in 2026, and a workshop for the production would take place in June 2025. Renée was not asked to participate in this workshop.\n\n\n*📍 August 2025, this month:* A complaint was filed by Ciara Renée against Sisters Clark LLC, demanding a jury trial and requesting compensatory damages of at least $486,000, plus punitive damages, pre- and post-judgment interest, consequential damages, attorneys’ fees, and other reliefs as deemed appropriate.\n\n----------\n\n*There have been some interesting responses to this news across the internet, so here are some thoughts on the common ones I saw pop up, again, based on my personal industry experience. I am not a lawyer and none of this is legal advice. Feel free to add your thoughts in the comments!!*\n\n\n**🗣️ “You mean I can sue every time I’m not cast in something?”**\n\nOnly if you have a legally reasonable case, and a binding contract that you are alleging that the producers breached. Ciara isn’t suing because she wasn’t cast; she is seeking legal remediation for these producers allegedly breaching a contract that they were legally required to negotiate in good faith.\n\n\nIn addition to this, a New Jersey labor lawyer would likely not take a case against a large producing entity that implicates a large arts and culture organization unless there was good evidence supporting these claims.\n\n\n**🗣️ “She wants half a million dollars? What planet is she on?”**\n\nCiara lives on a planet where they do math and legal reasoning. $3,000 to $5,000 per week is typical on Broadway for lead performers, especially those with Ciara Renée’s profile. There are usually additional stipulations for a percentage of box office and weekly bonuses, which would bring this up to a 5-figure weekly.\n\n\nIn the suit, she states that she would have accepted a weekly fee of $13,500 in negotiations; this, multiplied by 36 weeks (the number of weeks from the contract beginning until the Tony Awards), creates the figure of $486,000.\n\n\n**🗣️ “Why didn’t she just ask for the AEA buyout amount?”**\n\nWhile we can’t know for sure what was discussed in any private negotiations, the number filed in the complaint likely factors in reputational risk, trial costs, etc.\n\nIt’s also worth noting the additional financial value Ciara contributed to this show before being allegedly cut. According to the complaint, at the very least, she was introduced at investor events as a future member of the Broadway cast and represented the producing entity at an awards show.\n\n\n**🗣️ “Aren’t all actors replaceable? Isn’t that just show business?”**\n\nProfessional acting is labor, and labor is something that we still have some protective unions, rights, and laws for in America. Many of these rights revolve around contracts and agreements, which is exactly what this case pertains to.\n\nProducers are more than welcome to replace the actors in their production. So long as they follow the rules in the contracts and agreements that they write and agree to.\n\n\n**🗣️ “Won’t this brand her as someone difficult to work with on future projects?”**\n\nSee [Patti Lupone’s Andrew Lloyd Webber Memorial Pool.](https://x.com/mrcarl_woodward/status/1680319482726690817?lang=en)\n\n\nIt’s also important to note that career ambitions are not the only thing that drives folks in this industry.\n\n\nThere have been many “hard to work with” allegations circulating around this case, and the two questions we like to ask when seeing these comments are:\n\n\n* Is this a firsthand experience, or something this person heard from another comment section or a friend?\n\n* Could a person anonymously commenting on this have potential ulterior motives for spreading “hard to work with” allegations?\n\n\nAnd even if you have experienced someone as “notoriously difficult,” as artists and creatives who work under producers and management, it is important to be strategic about when and where you mention this: Bosses see this lack of solidarity, and these folks can be picked out and made \"examples of\" in situations like this.\n\n\nThis creates a chilling effect among folks along the margins of our industry who would like to speak up about their contractual rights and workplace violations.\n\n--- \n\nHope this breakdown helps anyone who is too busy to dig through the court docket but still wants to stay informed! 🎭",
    "score": 29,
    "url": "https://reddit.com/r/Theatre/comments/1n55p9g/ciara_renée_sues_gun_powder_producers_over/",
    "created_at": "2025-08-31T20:49:32.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1jw4thn",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Nontraditional Careers in Theatre",
    "text": "Hey everyone! As I've explored this reddit page, I've noticed that there's many conversations regarding \"traditional\" theatre roles, but I absolutely love sharing information, facts, and stories of the many nontraditional roles that keep the theatrical industry afloat. For example, my job is to manage non-traditional events in Broadway/Off-Broadway houses. These range from showcases, to filmings, to memorials, to conferences, and more. If you have a non-traditional theatrical job, or have questions about non-traditional theatrical jobs, I'd love to hear from you!",
    "score": 27,
    "url": "https://reddit.com/r/Theatre/comments/1jw4thn/nontraditional_careers_in_theatre/",
    "created_at": "2025-04-10T18:19:49.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1ngharf",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Take a Break (advice from an Older Creative)",
    "text": "This particularly applies to younger actors who post here to say theater has stopped being fun when they’re 14, 18, 22: you do not actually have to live and breathe theater! If you are not having fun, not enjoying it, not growing and improving and deepening your craft *that is not a failure*. A failure would be to pigeonhole yourself entirely in a field you aren’t passionate about. Get a degree in something else (it doesn’t have to be your career, either!) or spend a few months working a different day job to refresh your well of emotions and characters. Hell, quit for a few years and ease back in. But do not bang your head against the wall until your brain falls out. Making something your career can be a quick path to loathing it, and you can always try again. You are only young once. Listen to those concerns and do what you must. If it’s meant to be, you’ll come back. ",
    "score": 27,
    "url": "https://reddit.com/r/Theatre/comments/1ngharf/take_a_break_advice_from_an_older_creative/",
    "created_at": "2025-09-14T03:58:52.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1i0qpkc",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "too “good” for small community theatre, too “bad” for storefront or professional theatre",
    "text": "i’m an actress (early 20’s - just starting out) in a very large city and i’m having a really difficult time finding my place and understanding where i stand in terms of talent.. \n\nfor context— i did 2 years of a BFA program but absolutely hated the experience for many reasons, and left to pursue theatre on my own terms this past spring of 2024.\nwhile i was there, i found it very difficult to be cast in anything, and never was cast in any productions, which really shot down my self esteem and it’s affected me till this day.\n\ni was recently cast as a lead in a musical for a smaller community theatre. it’s an unpaid gig, but because i’m only starting i’m extremely happy to be in anything, let alone the lead. \nat this theatre, i get many compliments from my castmates such as “your voice is so beautiful” “you sound amazing” “i could listen to you all day” yet, when i find myself auditioning for bigger theaters that pay, i can’t seem to even get a callback. \n\ni feel like i’m in this weird place in between “talented” and “untalented.”i also feel like i’m too old to be not be getting professional gigs. i look at all my ex-classmates from college and many are my age and on contracts at professional places. i want to make this my career because i love it, but i wonder if that ship has sailed and i’m just doomed to be good enough for small unpaid productions. \n\nhas anyone else has had this moment in their career, and if so, what has helped you break out of this weird middle state? \n\nedit: i wanted to add, i do not think i am above any level of theatre since that might be something i mistakenly might have implied. ",
    "score": 26,
    "url": "https://reddit.com/r/Theatre/comments/1i0qpkc/too_good_for_small_community_theatre_too_bad_for/",
    "created_at": "2025-01-13T22:33:51.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1opo8at",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Boring Actor Bios?",
    "text": "Every time I read a bio in a playbill for a local theatre, the actor bios are always kind of boring. they tend to just list the shows they've been in and from an actor standpoint, I can kind of see the importance of that but from an audience perspective I don't really care to know what shows you've been in, in the past. It's just seems like word vomit when I'm reading them during the preshow. \n\nSeeing as I'm just beginning to start my career in the business, I enjoy thinking about the bios I give companies and I want to know if talking a bit about your life as an actor, your gratitude for working for this company is seen as a faux pas. Is it considered unprofessional? Do you as an audience member enjoy reading *about* the actors or just about the shows they've been in previously?",
    "score": 26,
    "url": "https://reddit.com/r/Theatre/comments/1opo8at/boring_actor_bios/",
    "created_at": "2025-11-06T03:26:42.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1n9sbtj",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Des Moines Metro Opera gets investigated for labor practices",
    "text": "Used to work here and I am not at all surprised by any of this. I've posted the article below if you are stuck behind the paywall.\n\nIt's a long read, but I think its worth it. Sounds like they treat their employees like crap with no consequences.\n\n[https://www.desmoinesregister.com/story/news/investigations/2025/09/05/dm-metro-opera-achievements-come-at-cost-of-staff-michael-egel-labor-practices/85206561007/](https://www.desmoinesregister.com/story/news/investigations/2025/09/05/dm-metro-opera-achievements-come-at-cost-of-staff-michael-egel-labor-practices/85206561007/)\n\n\n\n# Register investigation: Des Moines Metro Opera wins immense recognition, but at what cost?\n\n* Des Moines Metro Opera staff complain of overwork, bullying and unsafe conditions.\n* The opera’s general director, Michael Egel, admitted in a 2024 meeting to being unaware of the extent of the issues and said he was unable to offer solutions.\n* A Des Moines Register investigation finds a pattern of long hours, low pay and hazardous working conditions at the opera, with high staff turnover.\n\n*Part of a series on the labor practices of the Des Moines Metro Opera.*\n\nDes Moines Metro Opera leaders filed into a classroom on June 28, 2024, prepared for a madder scene than any they could stage.\n\nThe crew was hours away from opening “The Barber of Seville,” the debut of the opera's 52nd annual summer festival. General and Artistic Director Michael Egel called the last-minute meeting, aware that some on staff were upset.\n\nBut he was not prepared for the anger coiled inside his group of department heads. He started the meeting with a 10-minute pep talk.\n\n“I’ve said it before,” Egel told the roughly dozen managers gathered, according to a recording shared with the Des Moines Register. “This is one of the strongest groups of department heads, especially in how people interact and cooperate and work together, that I’ve ever seen here at this company.”\n\nThen, the department heads spoke.\n\nFor two hours, managers who oversee the opera's costumers and carpenters and electricians listed the organization's failures. They yelled. Egel failed to stand up for them amid artists' bullying, some said. Interns got hurt trying to meet tight deadlines, others said. The days were too long.\n\n  \n“I was at 89-1/2 hours, I believe, last week,” said Ashleigh Poteat, the opera’s costume director.\n\n“One-hundred five,” said wig and makeup designer Brittany Rappise.\n\n“Seventy-nine and a half,” said production stage manager Brian August.\n\nWork at the summer stock company had always been grueling. Staff prepared each year for just a few days off during a two-month stretch, logging more than 80 hours many weeks.\n\nBut 2024 was something else. In an effort to add an original work into a schedule that already included three planned shows, Egel increased the festival's repertory to four shows from three. Without extra time to prepare, workers sewed more costumes, tweaked more sets and hauled more scenery on and off stage between shows.\n\n“Are you OK with the number of people pulling a 14-hour day today?” Poteat asked. “Who pulled it yesterday? The day before that? The day before that? And will pull a 14-hour day again tomorrow? And the day after that? And the day after that?”\n\nAs department heads pressed him, Egel repeated the same answer: He didn’t know how to help.\n\n“I can’t come up with solutions,” he said.\n\n“I know very little about production,” he said.\n\n“I don’t know what goes into your job,\" he said.\n\nBridget Anderson, who, as assistant production manager, helped oversee about 85 workers and interns, had told Egel that the crew was overworked and tired of artists' abuse that summer. Now, she announced that she would take an indefinite leave.\n\n“I’ve lost a lot of faith in this company in the past couple of weeks,” she told Egel during the meeting. “I’ve said it to you three separate times. I’m screaming into the void that these people need help. I say, ‘They need help. They need help.’ And all I get is, ‘How do we help?’”\n\nEgel conceded that Anderson had warned him about the crew's exhaustion. Despite how hard their work had been, he remained optimistic.\n\n“I haven’t always understood the fullness of the reality of it,” he said. “Again, trying to hope that, ‘Yeah, bad today. But maybe tomorrow, the next day will be better.’”\n\nEgel sounded more triumphant two months later, when he met with the opera board's executive committee.\n\nHe told them that the 2024 festival had been one of the organization's most successful to date, according to meeting minutes. Ticket revenue exceeded the opera's goal. A New Yorker critic declared that the Des Moines Metro Opera was “one of America’s boldest smaller companies.” The International Opera Awards listed the organization as the lone U.S. finalist for festival of the year, earning Egel a trip to Munich, Germany. (The New York Times offered another rave review, of the opera's 2025 season, in July.)\n\nThe accomplishments were the latest hits for Egel, 52. Since taking over both the creative and business operations of the opera in 2013, Egel has attracted some of the industry's top directors, designers and singers to stage renowned shows in Indianola.\n\nThe organization’s reputation as a hub for cutting-edge productions and original works has increased, as have donations, government grants and ticket sales. At a time when U.S. opera attendance is shrinking and the country's biggest houses are staging fewer shows, the annual festival in Indianola has increased its budget from $2.2 million in 2013 to $6 million last year.\n\nOver the last decade, the Des Moines Metro Opera's expenses have exploded, growing at more than five times the rate of inflation. The opera did not stage a summer festival in 2020 due to the coronavirus pandemic.\n\nBut the opera's leaders face several challenges. The organization performs in an outdated, 54-year-old theater. According to board meeting minutes last year, contractors estimated that a renovation could cost $20 million to $36 million — likely more than size of the opera foundation's entire endowment. Egel told the Register the opera is \"evaluating other possibilities.\"\n\nThe organization also needs to raise more money to maintain its reputation as a top-tier opera, Egel told the board. At this stage in his career, he said, he is not interested in decreasing production values.\n\nAnd then there are the labor issues. Of the 13 department heads who attended the contentious June 2024 meeting with Egel, 10 did not return in 2025. Some declined to come back. Egel declined to invite others to return, despite his assertion that the leaders were \"one of the strongest groups\" he had ever seen.\n\nSeveral workers said their exits were evidence of a deeper problem at the opera, where they sacrifice their wellbeing for the organization's success. They described a culture of long hours, high pressure, intense heat, mental breakdowns, broken bones, concussions and fainting spells from exhaustion.\n\nTo understand the working conditions at the opera, the Register interviewed 41 current and former workers, interns and apprentice artists. The Register also reviewed internal emails, contracts, tax filings, paycheck stubs, recordings of closed-door meetings and board minutes. Most of the opera alumni, including some 2025 workers, spoke to the Register this year on the condition of anonymity, citing fear of repercussion in a tight-knit industry.\n\nAmong the investigation’s findings:\n\n* Production crew and singers continually work far more than a 40-hour week, with some crew members working more than 100.\n* Despite the intense workload, the opera rarely pays overtime because of an exemption in the federal Fair Labor Standards Act for seasonal work. Interns and apprentice artists receive set daily and weekly rates, with some saying their hourly rate falls below minimum wage.\n* Some workers have suffered serious injuries at the opera. The organization has not recorded all injuries as required by the Occupational Health and Safety Administration, some staff say.\n* Before a renovation this spring, carpenters and the props crew worked for several years without air conditioning in a warehouse where heat rose above 100 degrees.\n* Workers and singers described an atmosphere of bullying where directors, designers and actors berated and insulted young crew members without significant repercussions from the organization’s leaders\n\nIn an interview with the Register, Egel conceded that employees have worked more than 100 hours a week at times. But he said the extreme hours were \"rare.\"\n\nHe attributed the problems to growing pains, as the opera has tried to improve production values since he took over 12 years ago. The company has added video and audio departments. It also has designed more scenery and costumes in house.\n\n\"The productions were getting bigger and more complex,\" he said. \"We're working in more technology.\"\n\nEgel also said the company's pay was in line with industry standards. The problems from 2024 were, in his opinion, mostly the fault of the departments heads who are no longer with the company.\n\nWhile department heads said Egel did not listen to their objections before the 2024 season began, Egel said some did not take his offers to help.\n\n\"It was individual people who needed to change,\" he said. \"And we've made changes to most of our departments, almost all of our departments, this year. And that was the key that solved this issue.\"\n\nMost importantly, he said, the company hired a \"more positive and effervescent\" production director in Clayton Rodney, who oversees all production departments.\n\nThough he was not there in past seasons, Rodney, who joined Egel in the interview, said workers who put in long hours at the opera did so by their own prerogative. He said workers averaged 51 hours a week in 2023, 2024 and 2025.\n\n\"A lot of those people are actually self scheduling as well,\" he said. \"They’re not told that they have to work those hours. What has to happen is, the job gets done. And so whether or not they want to delegate those tasks to others is kind of up to them.”\n\nHe added: \"They want to do what’s best for the company, and they want to do what’s best for the role. I think what I’m attempting to say to you is that there are instances where people are willing to take on that workload. That’s not told to them, to take on that workload.”\n\nTough working conditions are not unusual in the opera industry, but some experts said the long hours and low pay in Indianola seem particularly harsh.\n\nIn \"Mad Scenes and Exit Arias: The Death of the New York City Opera and the Future of Opera in America,\" Wall Street Journal critic Heidi Waleson reported that the New York City Opera's production crew sometimes worked 90-hour weeks as they staged shows in repertory seven days a week in the 1980s. The workload decreased as the company pulled back on the type of shows it staged.\n\nWaleson told the Register that the Metropolitan Opera's backstage crew runs for 24 hours a day. But the company, the oldest and largest in the country, has a large enough team that it can split work into several reasonable shifts.\n\nCori Ellison, a former dramaturg at many opera companies, said in an email that working conditions \"vary so widely\" across the industry, depending on company culture, leadership and whether the crew is unionized. She said many workers don't regret the long hours they put in, but \"there's a big difference between hard work and abuse (which does exist and at which I draw the line).\"\n\nAnne Midgette, a retired classical music critic, said the long hours in Indianola seems \"extreme.\"\n\n\"For someone to work 100 hours a week is just crazy,\" she said. \"You need more staff.\"\n\nSeveral Des Moines Metro Opera alumni blame Egel for the challenges. They say he tries to stage productions on par with those at the country's most-respected summer stock operas, the Santa Fe Opera in New Mexico, Opera Theatre of St. Louis and The Glimmerglass Festival in Cooperstown, New York.\n\nDespite the Des Moines Metro Opera's growth under Egel, those companies have more resources.\n\nGlimmerglass spent about $10.8 million last year, about 80% more than the Des Moines Metro Opera did. Opera Theatre of St. Louis spent $13.7 million. The Santa Fe Opera spent $31 million.\n\nAccording to program booklets, the Des Moines Metro Opera had a production crew of 85 last year. Glimmerglass had about 140. Opera Theatre of St. Louis had about 135. A spokesperson for Santa Fe did not return a request for information about its production crew size, but in a news release, the company announced that its production internship roster alone included 85 workers.\n\nGlimmerglass and Santa Fe also own their theaters, giving employees more time to prepare for the season. In Indianola, the Des Moines Metro Opera rents the theater from Simpson College. The opera can only prepare the stage, rehearse and perform the shows in the period when students are gone for the summer, forcing employees to complete tasks faster than competitors at the bigger organizations do.\n\n\"(Egel is) trying to put himself in that class, at that level, those productions at that size,\" one recent department head said. \"But he doesn't have everything needed to do that.\"\n\nSaid another longtime department head, who left after the 2021 season: \"He should check his ambition. It has never been a hard solution.\"\n\nOpera alumni said changing the workforce does not solve the organization's labor issues. Department heads from more than a decade ago told the Register that long hours, low pay, verbal abuse and dangerous working conditions have persisted despite objections across several generations of crews.\n\nThe hostile 2024 meeting, for example, was similar to another emergency department heads meeting at the same point in the season three years earlier, when crew members and managers threatened to quit for the same reasons.\n\nDepartment heads from more than a decade ago said 100-hour work weeks occurred during their summers under Egel's leadership.\n\nEgel, for his part, said issues across different years are not connected to companywide failures.\n\n“I don’t think that those issues are all exactly the same thing,\" he said. \"I do think, every year we have made strides. And I will say that I believe that much of that is related to personnel. … There just needed to be a change in the vision for how the departments function and who was leading them and what was required.”\n\nWorkers from the 2025 season were divided when they reflected on their experience in interviews with the Register. The company reduced the number of shows in repertory back to three, allowing them to work fewer hours. Some said they received overtime and company leaders limited interns' hours more than they did in past years.\n\nBut two 2025 workers said they were considering leaving the theater industry, telling the Register that the pay was still too low and the working conditions too dangerous.\n\n\"That toll just kind of caused me to no longer enjoy it,\" one worker said. \"I need to take care of myself and regain that love that I had.\"\n\nProduction leaders have, in the past, tried to address the problems of long hours and low pay.\n\nOne department head, who worked at the opera for about a decade, said the working conditions were “heinous” before Egel took over. Like those who would follow him, the department head blamed a lack of planning, with organization administrators failing to think through how technical workers could satisfy artists’ visions.\n\n“The opera fairy will come in the middle of the night and fix everything,” he said, describing the administrators’ planning process. “Well, the opera fairy is 15 people working in the middle of the night for an 18-hour day.”\n\nUnder Chris Brusberg, who became the opera’s production director beginning in 2009, the working conditions got better, some former workers said. Nick Kuhl, the opera's technical director in 2010 and 2011, said Brusberg convinced the organization's leaders to hire a larger crew, lightening each person's load. He also required workers to wear hard hats.\n\nEven with those changes, the work remained difficult. Kuhl, who oversaw the scenery workers and the stage operations crew that changed over the sets, said he and his team worked about 115 hours a week in mid-to-late June each summer.\n\nIn a 2012 letter to seasonal workers, which an alumnus shared, Brusberg wrote that the festival would be \"physically taxing\" with \"long hours, in the traditional summer stock fashion.\" At the same time, Brusberg promised that crew members would have at least eight hours off between shifts — a guarantee that workers told the Register they did not receive before or after his time there.\n\n\"We made a real effort,\" Kuhl said.\n\nBut, as the opera hired bigger-named talent, multiple department heads said, the working conditions eroded. Brusberg quit after the 2016 season, when eight crew members worked more than 100 hours in consecutive weeks, according to an hours log that a department head later shared with the Register.\n\nAnother 10 crew members worked 80 hours each of those two weeks, according to the log. (The department head blacked out the names of the workers in the document.)\n\nDepartment heads said working conditions became more challenging when Brusberg left. The organization had lost a leader with institutional knowledge and a willingness to resist artists’ requests.\n\nIn 2021, carpenters and stage operations workers threatened to quit at the end of June, a couple of days before the festival opened. Other department heads said they threatened to quit as well, pulling their staffs from the theater.\n\nSome blamed the \"Queen of Spades\" set design, which included a decorative deck on top of the stage. Crew members compared the deck’s pieces to a complicated set of large Legos that they had to assemble and take apart each night between rehearsals, keeping them in the theater into the early morning.\n\nThe deck was “heavy as hell,” one worker recalled. Two other crew members said they worked several 16-hour days. A member of the lighting department said his crew worked 29 days in a row.\n\nThe workers said Egel and other opera administrators should have rejected the plan when they debated the show's design the previous fall, months before the production crew arrived.\n\n“No one honed in or gave feedback to that scene designer to say, ‘Hey, this might not be executable,’” lighting designer Jacob Hughes said.\n\n“It ended up being our problem — and the staff’s problem— to dig the company out of,” said another lighting department worker.\n\nJust after midnight on June 24, 2021, production stage manager Brian August requested an “emergency” meeting with business and finance director Elaine Raleigh, according to an email.\n\nThat afternoon, after Raleigh met with August and five other department heads, she shared their concerns with Egel. In a follow-up email to the leaders, she wrote that Egel agreed to give workers $250 bonuses. He also agreed to raise seasonal workers’ pay $2 an hour and to increase the daily pay for interns to $75 from $37.\n\nRaleigh wrote that administrators and workers needed “a lot more long-term discussion” about problems with the organization, including “bringing pay in line with industry standards.”\n\n“It was good to have this sit-down and bring me in on what's going on,” she said.\n\nOne 2021 apprentice artist said the organization offered a mental health counselor during that season.\n\n“So many people were having breakdowns and anxiety attacks,” he said.\n\nOn one of the last days of the festival, the apprentice artist woke up in the middle of the night. After he took a couple of steps inside the Simpson College apartment, he said, he collapsed. His head thudded onto the thinly carpeted floor, resulting in a concussion and a chipped tooth. He soiled himself and awoke to his girlfriend rubbing his back.\n\n“I was loopy,” he recalled. “I was talking slow. I was moving slow. I was dizzy. I was pretty confused.”\n\nWhen a doctor entered his hospital room later that day, the singer said he asked his boss to step outside. He recalls the doctor asked him leading questions, beginning with an inquiry about whether the singer was a victim of human trafficking. He told the doctor that he was not.\n\nThe doctor then asked him about his lifestyle.\n\n“He basically explained that… high stress, not eating well, not sleeping well, can exacerbate a condition,” he said.\n\nAnother apprentice artist who sang that season recalled learning about the collapse and concussion at the time.\n\nWorking conditions improved in 2022 and 2023, several department heads said. Bearclaw Hart, who became the opera's production director in 2021, thoroughly planned the crew’s schedules and resisted artists’ visions for some set flourishes.\n\nOne department head said the crew worked 14 days straight in 2023, down from the organization’s usual 21 days. She also said she didn’t work longer than 70 hours in a week.\n\nThen, Egel decided to stage four shows in repertory during the 2024 season — up from the organization’s usual three. The opera planned to stage two of the shows with nearly identical sets so that workers would not have to remove and install new scenery, a process that can take eight hours between shows.\n\nBut during the June 2024 department heads meeting, technical director Natalie Hining said Egel and the designers abandoned that plan well before the season started. They decided to use four different sets for four different shows, requiring extra work from the stage operations crew. At times, the opera would stage two shows on the same day, forcing the crew to change sets in about half as much time as they usually did.\n\n“I said (in November 2023), ‘That’s not going to work,’” Hining recalled. “And then I said ‘No’ in February. And I said, ‘No,’ in March. And we’re here, and I have to go tell my team that it’s OK that we’re going to fail. … I just don’t feel like anyone listened, even though I was screaming it.”\n\nRappise, the opera’s wig and makeup designer, said the extra show required her to work every morning until 4.\n\n“This was preventable months ago if someone had been overseeing how everything was scaling up in all four productions and saying ‘No’ to people where we cannot say ‘No,’” she said. “I don't have the power to say ‘No’ to people. That's not my job.”\n\nRappise returned to the opera in 2025 and said she intends to continue with the company next year. She said the working conditions improved, and she wants to help the company grow.\n\nDuring that June 2024 meeting, wardrobe supervisor Alexandra Holzem added, “We say ‘No’ (to artists’ demands) in the meetings. And it is constantly in the rehearsal report: ‘Asked again.’ And then in the next production meeting: ‘Asked again.’”\n\n“I don’t know how to back you up in these situations,” Egel said.\n\n“Tell them no,” said August, the production stage manager.\n\n“I don’t know what your workload is like,” Egel responded.\n\nDuring the meeting, Egel blamed Hart, the opera’s production director. Hart left for another theater at the end of 2023, and the opera did not replace him before the 2024 season.\n\n“It’s not fair to throw somebody under the bus,” Egel said. “But I have to trust my director of production.”\n\nIn his interview with the Register, Egel said he and another company leader tried to help an assistant production director and a technical director guide the crew during the summer of 2024. He said those department heads declined his help.\n\nThe department heads also complained during the recorded meeting that Egel failed to discipline misbehaving artists.\n\nOne director, who has worked at the opera for several years, has been the subject of two human resources complaints, according to emails provided to the Register. The director has continued to work at the opera after the investigations. Sixteen former workers told the Register that they had been berated by the director or had witnessed her verbally abusing employees.\n\nSome department heads said the opera changed a policy to keep interns out of walk throughs after the director berated Hart in front of his staff. Another worker said the director yelled at Hining, the technical director, for pausing a rehearsal because glass broke in a pool of water where an actor stood.\n\nDuring the June 2024 department heads meeting, Hining told Egel that she fixed several sets for the director.\n\n“And then I get yelled at and berated for doing it on time,” Hining said.\n\n“Publicly,” said August, the production stage manager.\n\n“Publicly,” a group of department heads said, in unison.\n\nIn late June 2024, Holzem emailed Raleigh, the business and finance director, that a dresser asked an actor if she could help him with a costume he didn't like. The actor did not want to wear the jewelry that a designer picked for him. Holzem wrote that the actor was heard \"cursing\" and \"yelling very loudly\" at the dresser.\n\nAt the request of some department heads, Egel attended a fitting, when the actor and members of the costume department could discuss the jewelry. Poteat, the costume director, said the actor threw bangles, bracelets and shoes on the table. She said he yelled at the staff and \"used expletives quite a lot and very forcefully.\"\n\n“It was one of the most useless meetings I’ve ever been in,” Poteat would later recall to the Register. “Michael Egel just stood there and did nothing.”\n\nLater, Egel would tell another employee that he didn't get rid of the actor because the show's understudy was unprepared.\n\nPlus, he said he did not believe the actor's behavior was as aggressive as Poteat and Holzem thought. He did not believe the actor threw things. At the same time, he conceded that other people in the room could think that the way the actor gestured constituted throwing the jewelry.\n\n\"That's just an interpretation issue,\" Egel said, according to a recording of the conversation.\n\nEgel told the Register that the company conducts internal and external reviews when it receives complaints about personnel.\n\n\"We work in a highly creative, highly intense time frame with a variety of passionate people,\" he said. \"... There's a thousand decisions that have to be made, and there is oftentimes great agreement in that. And sometimes there can be tension as well.\"\n\nAfter the June 2024 department heads meeting, Raleigh emailed the staff to offer incentives, as she had done in 2021.\n\nThe opera would pay department heads an extra $250 a week. Seasonal workers would get overtime after 60 hours in a week. Interns would get paid by the hour — $12 — after 50 hours in a week instead of a flat daily sum.\n\n“A number of interns have been working beyond expectations this season to help some departments undergoing extra stress,” she wrote.\n\nAfter the season, Raleigh told a worker that the conditions at the opera would improve in 2025. They would return to staging three shows. They would hire a replacement for Hart. They would have other new department heads.\n\n“When things got bad last year, we were so out of the loop,” Raleigh told a worker, who recorded the conversation.\n\n“There were so many things beyond everyone’s control last year,\" Egel added.\n\nSome workers from the 2025 season spoke positively about their summers. Jae Goodman, a scenic arts intern, said she worked no more than 36 hours most weeks and gained valuable experience. Ezekiel Ajibade, an assistant technical director, said his work weeks did not stretch to more than 70 hours — a normal number in the industry.\n\n\"Don't work in theater if you don't want to do that,\" one crew member said.\n\nAt least some workers from the 2025 season do no want to do that.\n\nA carpenter said he felt uncomfortable with how fast technical directors ordered him to work. During some shifts that ran past midnight, he stepped outside the theater to scream.\n\n\"After getting hounded for hours, you kind of just break,\" he said.\n\nAnother worker said he would not return to the Des Moines Metro Opera. He was shocked to realize he would not make overtime as he worked beyond 70 hours some weeks.\n\nStill, the season did not include the production department outbursts that characterized past years.\n\n“It is such a new group,” one worker said. “It is such a young group. I’m not sure they will have it in them to go to Michael Egel and yell at him for two hours.”",
    "score": 26,
    "url": "https://reddit.com/r/Theatre/comments/1n9sbtj/des_moines_metro_opera_gets_investigated_for/",
    "created_at": "2025-09-06T06:22:14.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1jmzu9x",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "What do you wish someone told you about the industry earlier?",
    "text": "This is primarily for working professionals, but I’d love to also hear from anyone who has been involved for a while. \nWhether on the performance, tech, creative, or admin side, what do you wish you knew sooner in your career or education?",
    "score": 25,
    "url": "https://reddit.com/r/Theatre/comments/1jmzu9x/what_do_you_wish_someone_told_you_about_the/",
    "created_at": "2025-03-29T23:57:18.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1ju0sy4",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "What are things every new community theater child/parent should know?",
    "text": "Let me begin by saying I'm not an actor at all.  I am a supportive parent\n\nMy child has no interest in acting as a career but is interested in a career which has some crew/tech application.  They might also want to be an ASL interpreter as they have plans to learn ASL.  They enjoy acting, singing and instrumental music as hobbies and want to join at least one community theater group to develop their skills, meet other people with the same interests and carry their hobby and friendships into adulthood.  They'd love to be on stage but crew and pit are also things they'd gladly do if they aren't cast\n\nMy child recently went to their first community theater audition (\"Theater A\") and the experience made it clear that we have no idea what we are getting into despite years of theater camps and school musicals.  We apparently were the only ones not in the clique at Theater A and they treated us coldly in contrast and expected us to know things (or deliberately withheld them?) not publicly listed or communicated\n\nHow prevalent is cliquishness in community youth theater?  Is this something we need to be wary of or does it get better if kiddo actually can get cast/work crew?  Are there any universal norms even children should be expected to know before ever auditioning?\n\nI did some research afterward and learned that other local community theater groups have much better communication, clear information on how to volunteer for crew, and clearer casting policies than Theater A\n\nI noticed most other community theaters either have children do video auditions or have their parents stay with them though the whole process (as young as whenever the theater starts and old as 18 but in HS). Theater A didn't even allow parents in the audition and wasn't communicated about video auditions even existing until after the roles were cast and they had cast some people who weren't at auditions.  Should I be concerned at this or is it all within the norm?\n\nWhat are some things every community theater parent and community theater child should know?",
    "score": 24,
    "url": "https://reddit.com/r/Theatre/comments/1ju0sy4/what_are_things_every_new_community_theater/",
    "created_at": "2025-04-08T00:30:54.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1hni1lo",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Any regrets pursuing theatre as a career? ",
    "text": "I am guessing that \"playing the game\" in terms of casting and job security is just an aspect of the wonders that pursuing theatre will bring, but is there anyone who has any regrets from pursuing theatre that were unavoidable? ",
    "score": 24,
    "url": "https://reddit.com/r/Theatre/comments/1hni1lo/any_regrets_pursuing_theatre_as_a_career/",
    "created_at": "2024-12-27T16:03:35.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1m4gis1",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Not a theatre kid but had one of the best experiences of my high school career impulsively joining my school’s phantom of the opera play",
    "text": "*Simply sharing a positive theatre experience I had as a person who never ever thought I would ever be a part of theatre* I was terrified I mean TERRIFIED of being on stage growing up. When I was in middle school I was put in a theatre class as an elective because my first choice wasn’t available. Any time we had to do any sort of presenting in front of the class acting assignments I would cry and I could never have any on stage role in a play. It was a super small theatre program (15ish kids) so we had no stage hands or tech crew. My teacher ended up adding a stage manager position for me because I literally couldn’t go on stage without crying. So I thought anything on stage was out of the picture for me, but not long after that I started dance and got good at it pretty fast. Dancing requires a certain acting element but no spoken lines so it helped me get over my stage fright pretty fast. My freshman year I decided to watch our schools musical (newsies) and I loved it. I thought it seemed so fun to be in a play but knew it wasn’t something I could or would do. I went back and saw the musical (Matilda) in the spring and another play the next fall. Then that spring I was asked to be a part of Phantom of the Opera since they were short dancers and the theatre teacher knew I had ballet training. I agreed because I thought it would just be dancing and I thought it would be fun. It ended up being a lot more acting than I bargained for but I loved it. I really fell in love with theatre then- especially phantom of the opera. It was magical. To sit in the dimly lit back stage in a white tutu with my friends listening to our lead sing music of the night and waiting for our cue to run back out on stage to dance for a packed audience alongside such talented people was truly an amazing experience. I knew nothing about theatre going into this- I didn’t even know what phantom of the opera actually was or anything about the plot. Everyone was talking about how it was a dream come true for them to be performing in phantom of the opera, which I didn’t know at the time was considered “not a play highschools could put on”. It was definitely something our semi small Colorado public school was able to pull off though! We had great community reviews and sold out our auditorium for the first time in years full of audience members who didn’t even know anyone in the production. I’m so lucky I was able to be a part of it. I met some of the most talented people ever. Our Christine was an INSANE singer- like craziest thing I have ever heard. Every single person in the cast truly contributed to the play, the set was amazing, and our engineering students built the chandelier from scratch by hand. After everything I’ve learned and experienced first hand, I have gained such respect for both cast and crew of any theatre productions. It was just a fantastic opportunity and I’m so grateful. This was almost two years ago now, and I don’t think I would do it again as acting is not my forte per se, but I did absolutely love it and it will always hold a special place in my heart. The best way I can describe being a part of a production like that is just magical. I don’t think I will ever be able to experience something like that again. I guess my whole point in writing this was just to share a wonderful experience I had and to express my love for an art I had once overlooked.",
    "score": 23,
    "url": "https://reddit.com/r/Theatre/comments/1m4gis1/not_a_theatre_kid_but_had_one_of_the_best/",
    "created_at": "2025-07-20T05:00:25.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1nc6qap",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Is life too short for me not to pursue acting?",
    "text": "I’m an 18 year old guy who just began college. I’m going the safe route—cheap state school, finance major, and studying passively for the law school admissions test with the prospect of a career in corporate law. As such, you're probably curious as to why I'm here. Given my current situation, it might come as a surprise to you that I went to the top high school for the arts in my state where I studied theatre.\n\nMy biggest fear right now is that I made the wrong choice. I’m good with words and numbers, sure, but I’ll never be as good at, or as fulfilled by, those things as I was by acting. Most people met my ultimate decision with contempt because they thought I had a future in the industry. Moreover, most of my classmates went on to prestigious BFA programs at places like the University of Michigan and the Boston Conservatory. The caveat here is that they’ll be taking on debt in fields that aren’t outstandingly lucrative.\n\nI’m scared to death of being flying too close to the sun and plummeting into the life of some \"starving artist\", but I also can’t stand the thought of being on my death bed with this idea of “What if?” while knowing my friends went off to achieve greatness in their respective fields of art. I’m afraid that time is slipping away and I’ll be caught in limbo until it’s too late. \n\nI'm sure there are many people on this sub who feed themselves doing this, so I'm asking you:\n\n**Should I bow out while I can and audition for a good BFA program?**\n\nI'm aware of the banality of my dilemma, but I don't know where else to turn for an answer. If I'm being stupid, which I'm 90% sure is the case, please don't give me *too* hard of a time 😭\n\n",
    "score": 22,
    "url": "https://reddit.com/r/Theatre/comments/1nc6qap/is_life_too_short_for_me_not_to_pursue_acting/",
    "created_at": "2025-09-09T02:04:26.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1jm5n8c",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "New Multidisciplinary Theatre Company Launching In Pittsburgh – Seeking Artists &amp; Collaborators",
    "text": "Freedom House Theatre Company is a new multidisciplinary company launching its inaugural season in Pittsburgh, PA. We’re a domestic nonprofit corporation fiscally sponsored by a 501(c)(3) and committed to centering Black/African Diasporic, Indigenous, and historically excluded voices—on stage and in leadership.\n\nWhat sets us apart?  \n– **Livable W-2 salaried wages** for all artists and staff  \n– **Employer-paid healthcare and professional development**  \n– **Creative ownership for artists**  \n– Multidisciplinary, immersive performances that tour underserved communities\n\nWe’re gathering interest from actors, playwrights, dancers, musicians, visual artists, directors, arts administrators, and collaborators. If you're interested in getting involved or learning more, please fill out our interest form and share it with your network:\n\n[https://zfrmz.com/2s6WXpRXK9BHFGyEh9Dt](https://zfrmz.com/2s6WXpRXK9BHFGyEh9Dt)\n\nLet’s build something revolutionary in the arts.",
    "score": 14,
    "url": "https://reddit.com/r/Theatre/comments/1jm5n8c/new_multidisciplinary_theatre_company_launching/",
    "created_at": "2025-03-28T21:05:15.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1i985gh",
    "subreddit": "Theatre",
    "soc_codes": [
      "27-2011",
      "27-2012"
    ],
    "title": "Theatre Salaries",
    "text": "I recently founded a new theatre company in New England. I’ve been working as an actor and director for about 20 years now and I’ve had some success producing theatre with no budget and entirely volunteer casts/crews. It’s looking like my company might have some legs and I’m hopefully going to be able to pay artists soon. \n\nHere’s what I’m wondering: \n\nI know what actors make at the union/non union level. I know when I have and have not been treated fairly when it comes to pay. But as I build budgets and plan for our first season, I’m trying to get a sense of what is appropriate to pay directors/designers/stage managers/etc. We’re a small soon-to-be professional company in New England. I know I could probably get away with paying little or nothing, but I want to get an idea of what’s reasonable and appropriate as I build this company. I’d love to be able to invest every cent we get into our artists, but that’s not really feasible. Especially when it comes to early career theatre artists, or folks who have done work recently with small professional theatres, what has your pay looked like? How long were your contracts? Was the pay appropriate for the work involved? Any info is appreciated!",
    "score": 6,
    "url": "https://reddit.com/r/Theatre/comments/1i985gh/theatre_salaries/",
    "created_at": "2025-01-24T22:39:36.000Z",
    "num_comments": 10
  }
]