[
  {
    "id": "reddit-1pjjja3",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "I was so annoyed that my husband kept getting doctor-themed gifts but no one ever got me any actuary-themed gifts that I learned how to 3D model so I could have calculator earrings and a calculator ornament",
    "text": "You may remember me from my other hit r/actuary post, in which I showed my fellow TI 30XS Multiview enjoyers the pair of earrings I made out of polymer clay. Long story short I got a 3D printer for other reasons but decided to teach myself how to make 3D models so I could make nicer looking earrings and scaled it up to have an ornament to compete against the medicine related ones on my tree. \n\nEverything you see when you search for actuary gifts is so copy paste your job title here. When I got my ASA my boss got me a water bottle that made me physically cringe and he probably found via targeted Facebook ads. Anyway I do sell these on my Etsy as of a few minutes ago, my shop is Sutton Woods Studio. Sorry for the shameless self promo but I need validation from fellow members of the Multiview Cult. ",
    "score": 1117,
    "url": "https://reddit.com/r/actuary/comments/1pjjja3/i_was_so_annoyed_that_my_husband_kept_getting/",
    "created_at": "2025-12-11T00:32:29.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1kzf6sr",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Signing Off",
    "text": "After 43 years in insurance and 30 years at New York Life, I am hanging up my hat and retiring to the country. I'll be unsubbing from r/actuary and joining r/sailing and r/woodworking.\n\nBest of luck on your exams and keep at it.",
    "score": 1020,
    "url": "https://reddit.com/r/actuary/comments/1kzf6sr/signing_off/",
    "created_at": "2025-05-30T20:53:38.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1o5wz6h",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Where do actuaries work...",
    "text": "Found this on linkedin and thought it was good information. Haven't verified the information but seems reasonable given the COL and job openings I've seen\n\nAlso idk who to credit for this since I think it was a repost. If anyone knows just mention the person's name below",
    "score": 478,
    "url": "https://reddit.com/r/actuary/comments/1o5wz6h/where_do_actuaries_work/",
    "created_at": "2025-10-13T21:33:11.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1mf719m",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "TIA's Exam P &amp; FM Courses are Now Completely Free",
    "text": "We have some huge news we wanted to share with you all. Starting today, our full, comprehensive courses for Exam P and Exam FM are 100% free for everyone.\n\nWe know the first question is \"why?\", so our CEO, James Washer, and our Director of Preliminary Exams, Lee Gibson, sat down to discuss the decision. You can watch that conversation here: \n\n[https://youtu.be/fZJUcBwYGcg](https://youtu.be/fZJUcBwYGcg)\n\nFor those who want the key points right now, here’s the breakdown:\n\n* **Are they** ***really*** **free? What's the catch?** Yes, 100% free. There is no catch, no trial period, and no credit card required. Just sign up and you get access.\n* **Are they the full courses? Will they still be supported?** Yes, these are the complete courses we used to sell for $495 each, with all video lessons, practice problems, sample exams, forums, etc. We will continue to update and support them exactly as we always have.\n* **So, why are you doing this?** The short version is that we want to give back to the actuarial community and ensure that students starting their journey have the best possible foundation and study habits to carry them through their entire career.\n\nYou can get access to the free courses here:\n\n* **Free Exam P Course:** [`https://www.theinfiniteactuary.com/P`](https://www.theinfiniteactuary.com/P)\n* **Free Exam FM Course:** [`https://www.theinfiniteactuary.com/FM`](https://www.theinfiniteactuary.com/FM)\n\nWe're really excited to make this step in the actuarial journey more accessible. We'll be hanging out in the comments to answer any questions you have.",
    "score": 419,
    "url": "https://reddit.com/r/actuary/comments/1mf719m/tias_exam_p_fm_courses_are_now_completely_free/",
    "created_at": "2025-08-01T20:16:12.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1oqwq91",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Most likely going to quit for good in March :)",
    "text": "In my late 30s. \n\nMy job is pretty good for an actuary and company is amazing. I’m proud of working for it. But have achieved financial freedom at what i consider 95% success rate of a very comfortable life (based on 10k scenarios of Monte Carlo simulation)\n\nMany many things I want to do outside of the corporate grind. Def kudos to folks who love to continue working 💚 but not providing much fulfillment for me other than money. \n\nUnless company gives me something so interesting and different, then maybe can do another year or two after. There are certianly perks of working for a company you like. \n\nJust want to let it out of my chest, no one really to tell irl. \n\n*Edit: since many asked for the financials, my withdrawal rate (after tax) would be less than 2%. Assuming expense = current average last 5 year of expenses + expected health care cost + best estimate margin",
    "score": 361,
    "url": "https://reddit.com/r/actuary/comments/1oqwq91/most_likely_going_to_quit_for_good_in_march/",
    "created_at": "2025-11-07T15:03:19.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1i6qk6d",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Levels.fyi for Actuaries is here! (Salary Survey)",
    "text": "Hey All, I'm co-founder of Levels.fyi. We're a salary sharing site very popular in the tech industry and have been expanding into more roles recently. Many of you have requested this before and mentioned us here in this sub. We have finally added the Actuary roles to the site - **see / add salaries here:** [**https://www.levels.fyi/t/actuary?countryId=254&amp;country=254**](https://www.levels.fyi/t/actuary?countryId=254&amp;country=254)\n\nThis has taken a while because we do things fairly manually to ensure the data remains clean. This means there's been a ton of prep work to ensure we understand the role, different sub-specialties of the role, adjacent roles, leveling at companies for the role, etc. I've spoken with a few of you in this subreddit and reached out to several folks on LinkedIn in my research.\n\nIt's not perfect still - we are working on adding certifications to the site (which I know is a big deal for actuaries). That will take a few months though and I didn't want to block the launch on that given knowing pay by company + level is super helpful to people already.For now you can add your certifications in the 'Other Details' field on the [salary submission form](https://www.levels.fyi/salaries/add). If you know the [Actuary career levels](https://www.levels.fyi/t/actuary?countryId=254&amp;compare=Nationwide%2CThe+Hartford%2CErnst+and+Young%2CMercer) for your company please [add it here](https://www.levels.fyi/create.html) or DM me!\n\nI hope we can make pay more transparent and fair for Actuary roles as we've done with engineering roles. Please lmk if you have any other feedback!",
    "score": 202,
    "url": "https://reddit.com/r/actuary/comments/1i6qk6d/levelsfyi_for_actuaries_is_here_salary_survey/",
    "created_at": "2025-01-21T19:13:33.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1ho9oyj",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Soooo are the societies paying for the rankings????",
    "text": "https://money.usnews.com/careers/best-jobs/rankings/the-100-best-jobs",
    "score": 176,
    "url": "https://reddit.com/r/actuary/comments/1ho9oyj/soooo_are_the_societies_paying_for_the_rankings/",
    "created_at": "2024-12-28T16:52:06.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1p6ww3r",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Is this career only for the gifted?",
    "text": "I decided to become an actuary about three months ago. I’ve read plenty in the newbie thread(s), posts about others switching careers, resume posts, exam difficulty posts, what math you’re expected to perform, etc. While actually trying my hand at this career by beginning to study for exam P. Forgive me if this post favors others, but, I did want opinions to this particular post. \n\nSome people in the comments were saying they tried actuary science in school and switched to engineering and found it easier. Like wow!\n\nAnyways, while studying or seeing the posts here about the difficulties, I sometimes get discouraged. This post on twitter didn’t help, so i came to ask. \n\nDo you think this career is only for the gifted? If you are an actuary, do you feel like you’re gifted academically, particularly in math? Is studying enough? If I put in the 400+ hours that’s suggested for some exams, will I pass (eventually)? Do you think there’s a cap for certain individuals in this industry? I.e. if you aren’t/don’t feel “gifted” will you ever pass the more difficult exams? Or, if I put in enough hours will it click? Some people take exams 4+ times, so does that mean you keep trying until you pass? \n\nI just started typing, so you don’t have to answer all the questions. Just looking for opinions on this post!",
    "score": 176,
    "url": "https://reddit.com/r/actuary/comments/1p6ww3r/is_this_career_only_for_the_gifted/",
    "created_at": "2025-11-26T03:11:57.000Z",
    "num_comments": 165
  },
  {
    "id": "reddit-1hqi9nw",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Actuarial career timeline",
    "text": "I've posted a play-by-play of my actuarial career in comments sporadically over the years and people seem to like it, so I thought I'd try it as a year-end post. My main motivations are to give the college kids a bit more insight into how the start of a career might look, and hopefully also resonate with some entry level analysts struggling with the learning curve. My comp isn't super typical compared to the surveys, but that's not really the point here. It's just been my experience as I've been very proactive about understanding what the next level requires and making sure I'm doing all the right things, with some bumps along the way.\n\nYOE -2 and -1: I failed my first two exams with 1s a month apart because I totally underestimated them. Then studied properly and passed P and FM six months apart which was enough to get an internship. I also helped start my school's actuarial science club as treasurer and then became president the next year, got an internship just the summer before my last semester graduating in December, passed a third exam in that last semester, and landed a job in health consulting through a club-company relationship starting Jan 2018. \n\nYOE 0 (2018): Was an analyst in consulting trying to find work and figuring out how to study. Tried to study in breaks during the day because work wasn't constant, but that wasn't consistent enough. Also felt like a failure at the work because the learning curve is tough (despite really doing fine), so I put studying on the backburner to get better at the job. No exams passed and accepted all the work I could just to end up pretty slow anyway. $70k total comp.\n\nYOE 1 (2019): My work quality got really good on my main projects and my managers were starting to talk about promotion, but I needed ASA and I was three exams away. Finally passed my first exam while working after an 18 month drought. I started paring my clients back from like ~12 to focusing on three bigger ones, and growing my roles for those clients. I didn't really feel ready for everything I was trusted with, so my anxiety made me try hard to keep up with what I felt my managers' expectations were. But again this stress was pretty self-inflicted. $86k total comp.\n\nYOE 2 (2020): Dialed back on work and delegated more to focus on exams (~3 analysts), prepared for promotion and trusted my managers trust in me. Shifted to studying in the mornings blocking my calendar from 7-9am to protect the time and be mentally fresh. Passed two exams. Doing this also helped me be more defined in a management role, and doing less work helped increased my quality further. My main boss at the time wanted to start using Power BI and I was the only analyst to embrace it with her while others refused to learn. $96k total comp.\n\nYOE 3 (2021): Took two attempts at FA and did a lot of waiting for those results and APC, so I just worked/billed instead of studying this year and got a 50% bonus. ASA and promotion at the end of the year (ASA late delayed my promotion by almost a year). Dropped down to just two clients and fully specialized in one area. Specializing earlier than many helped me have larger roles and advance a bit faster than many, too. Used Power BI to significantly improve/transform internal processes, which also helped grow responsibilities and overall understanding. $135k total comp, also got married.\n\nYOE 4 (2022): Worked less and delegated more again (~8 analysts) to focus on my FSA. Got my own office on the &gt;35th floor of my building on my birthday. Passed my first FSA exam in Nov after failing in May and understanding how I studied wrong. Always just trying to do more and more of my boss' job before passing them back work. Started being a little more client facing and I own a really cool/important/executive level quarterly Power BI deliverable to one of my clients. Newer bigger source of stress was my analysts not really stepping up/growing up with me, so I felt like I was having to extend a lot both down and up to get work done. $130k total comp.\n\nYOE 5 (2023): Passed my last two FSA exams on the first attempts. I became much more client-facing overnight and suddenly own more stuff. Power BI development and the way it enhances our actuarial work/storytelling has become a major part of my job internally and externally. My mentors are really helping connect me to specific opportunities to help prepare for the next promotion approximately with FSA. Working on my presentation skills and subject matter expertise. Still a little too far extended down/doing too much analyst work myself, while really wanting to do the higher level stuff. I also took a ton of PTO this year with like 4.5 weeks. $165k total comp.\n\nYOE 6 (2024): Spring was knocking out the FSA mods, owning the modeling on a really cool brand new insurance product, and taking 2 weeks of PTO for my 10 year (dating) anniversary with my wife. Got my FSA in the fall. Staffing continues to be a bit of a challenge in terms of educating my analysts enough to be independent, but doubling the size of my teams has helped my workload a lot by adding redundancy that isn't me. I decided to fill my regular study time with work again this year for a big bonus to build a custom house I designed myself in Excel. $235k total comp.\n\nYOE 7 (2025 expectations): I'm really aiming to pare back my workload to only accept higher level roles and apply for promotion in summer 2025. I may not quite be the required level of refined by summer, though. This next promotion is a pretty big one in terms of visibility and independence of doing client work and I respect the bar I need to clear despite gunning for it. Because a lot of comp is tied to bonus/promotion, I'm not sure what comp will be. I might successfully cut way back in wait for the right opportunities, or the opportunities might come sooner and I'll stay busy. I've also taken on a few internal non-billable roles that will help lubricate promotions by getting my name out there in a leadership context and giving helpful experience, but won't directly contribute. Outside of work, I'm making joining a rec league soccer team, golfing more, weekly gaming nights with the boiz, and running/lifting weights a bigger priority. I've protected the time to run and lift weights regularly, but this year I want to do more. Comp could be anywhere $210-$300k but I'd bet on ~$230k again.\n\nAlso some unorganized additions - I pretty consistently have ~1800 productive hours in me per year. While I was studying that split was 1400-1500 billing and 300-400 studying. The two years I didn't study (waiting for ASA and FSA) I billed ~1800. There is other non-billable time in there too that pushes my average workweek to ~45 hours, and while I work evenings and weekends when I have to, I'd say my overall WLB is still good because Ive been intentional about my annual workflow and personal time to ensure I get the fun and down time/PTO I want. I'm generally working 7.5 hours per day (really 7 excluding breaks) as a baseline which increases to 9s and 10s during busy seasons, evenings and weekends sporadically when I need to, and I log off early at like 1-3pm or take long breaks in the middle of the day when I know I can. By far the most important thing for me in this career has been time management (aside from all the help I've gotten from others).\n\nOur bonus formula is a bit of a pyramid scheme where even earlier on I get a piece of the work I manage. Since I manage a lot of people/work and got into good opportunities early, this drives an extra chunk of comp in addition to my own hours.\n\nAnyway, happy to go into more detail, answer questions, read about others' experiences, or chat about career progression in general!",
    "score": 169,
    "url": "https://reddit.com/r/actuary/comments/1hqi9nw/actuarial_career_timeline/",
    "created_at": "2024-12-31T16:29:40.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1jxw6ps",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Exam exhaustion",
    "text": "I’m at that time of studying where I start questioning my decisions and generally losing hope for my exam progress. One thing I can’t shake off is feeling behind my peers with exam progress, I have 6 years of experience and I’m still an exam away from ACAS. It truly doesn’t seem like end is near. I’m just feeling exhausted of “sorry I can’t do xyz, I have to study” and “how many exams do you have left.” I don’t hate the actual work I do and I get solid reviews at year end so I’m not seriously considering a career change at this point. Just ranting to the one group who understands. ",
    "score": 162,
    "url": "https://reddit.com/r/actuary/comments/1jxw6ps/exam_exhaustion/",
    "created_at": "2025-04-13T01:08:33.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1ozw0cb",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Entry Level Jobs: An In-Depth Guide",
    "text": "After seeing the past year(s) of people struggling overall to get a job, and not seeing something like this in the subreddit already, I thought I'd make a dedicated post guiding someone through the process of what getting an entry level (EL) job might look like, having been through it recently. This is for anyone who doesn't have a job already in the field, so I'll try to cover all the bases (whether fresh out of college or a career changer). Feel free to skip to the sections you need to.\n\n&amp;nbsp;\n\n#Before we begin:\n\nAt first the career can look a little daunting, and there can seem like there's a lot to know. Thankfully for EL, there's a basic \"progression\" to follow. The first thing you'll want to do is consider: is this career for me? I have heard firsthand the accounts of people who don't realize how much dedication you need. Without beating around the bush, you will need to be studying consistently for the next 4-7 years, depending. You will be studying on weekends, breaks, etc. It's not overwhelming if you pace it right, but it is a commitment to be ready for. Look into what the exams cover and if those topics interest you, as if they don't, maybe reconsider. Also feel free to talk to people here to find out more about what \"a day in the life\" is like or more details on exam coverage. \n\nWith that out of the way:\n\n&amp;nbsp;\n\n#I'm ready, but where do I even start?\n\nOne of the big pros of this career is your degree isn't as consequential as many others. Some are better than others (STEM &gt; non-STEM) but many times it's your experience and exam progression that will get you that first job. Speaking on that latter part, let's talk exams. Often called \"the great equalizer\" due to how it's always what people look at first, and how upping the amount will usually put you ahead of someone with fewer exams. There's no pre-reqs to taking these, all you have to do is sign up. The two you'll take first are called Exam P and FM (Probability and Financial Mathematics). P is like a middle of the road college stats course with 2x the content. FM is a freshman's course in the math behind finance (think annuities, bonds, etc.). If you're unsure where to start, I'd recommend FM as it's shorter and easier. If you want a guide to the exams, [here's one that people seemed to like] (https://www.reddit.com/r/actuary/comments/1eqi22k/p_fm_an_indepth_guide/). Also talk with people on here about the career. You can gain some decent insight in the newbie thread just by reading what others ask. Trust me when I say the questions you're asking now have been asked at least 1000 times before, and will be asked 1000 times again.\n\n\n&amp;nbsp;\n\n#Okay, I've passed 1-2 exams. Now what?\n\n##For my college students/fresh grads:\n\nStart applying to internships before you even finish the first exam. Hiring season will start around late August to mid September. Be willing to move for a summer if needed, one internship will very much help you down the line. Overall focus on passing those exams, applying to internships, starting/being a part of the actuarial club, and making connections through career fairs, LinkedIn, etc. Don't be afraid to go to your colleges career center, they are there to help you. If you've passed 2 exams already, and still have more college to go, either focus on some projects for the resume, or take SRM if you've done an internship (I'll detail why SRM later).\n\n##For my career changers:\nIf you're in a math-adjacent/STEM oriented career, then you can focus just on networking in free time. You likely have done projects that can be talked about in an interview. If non-STEM, then start looking into projects you can do to beef up that resume. There's more to talk about on it in the resume section further down, but long story short find a dataset on tidytuesday you like, and do a passion project using some combo of Excel/VBA, SQL, R, and Python to analyze it. \n\n\n&amp;nbsp;\n\n#The Application Process\n\n##Step 0: Networking\n\nNetworking isn't always required but it can help a lot to know people, especially since they'll often be the ones to recommend you later on. No matter if you're a 10 year graduate or still in college, there's multiple ways you can network.\n\n* Career fairs/centers. These mainly are for college students, so if you're in college look into these heavily. Putting a face to the name makes all the difference in resume review. Career centers also likely have connections to multiple companies who specifically look at your college to hire from, so take advantage of it.\n* Coworkers/friends. You likely know someone who knows someone who's an actuary, or at least works closely with one. Schedule a meeting, add them on LinkedIn. As opposed to the above this is mainly for career changers since you might have a network already.\n* Lastly, the most important method of all in my opinion: Alumni. No matter the situation, this is a very easy way to network with those in the field, but also actually learn about the career and about the nuances of routes you might take later on. While at first you might think to message through LinkedIn, there's a much better way to do it that's free and way more likely to be seen by the person: emailing.\n\n###Cold Emails: a quick walkthrough\n1. Go to LinkedIn\n2. Search your school, and then click \"people\" at the top\n3. Go to \"All Filters\", then scroll down until you hit \"key words\".\n4. Type in \"actuarial\" (or actuary) under \"Title\"and then \"Show Results\"\n5. In a new tab, search [\"Actuarial Directory\"] (https://www.actuarialdirectory.org/) \n6. WITHOUT clicking on anyone's profile, search up people's LinkedIn info on the directory. You won't always get a hit, but when you do, an email will often be listed\n7. Draft them a cold email. Use [this guide] (https://www.reddit.com/r/actuary/comments/ouoir1/cold_emailing_what_not_to_do/#)\n8. Repeat as needed\n\n\n##Step 1: The Resume\n\nSo normally I would write out a bunch of details on this, [but I already did it here] (https://www.reddit.com/r/actuary/comments/1nxjs4c/entry_level_resumes_an_indepth_guide/). So I'll briefly go over what to look for in a project if you're doing one. While having something closely related to insurance is great, a passion project can work just as well. As said above, head to tidytuesday, and find a dataset that makes you excited. Once you have it, use Excel/VBA or R to analyze it. Python and SQL are also good to tie in/swap out if need be, the most important one in there is Excel. No matter where you go, you WILL be using it. The more advanced the project the better, but within reason. You want to push yourself to learn new things, not get demotivated. These projects often get brought up in interviews, especially if you're just out of college, so be ready to talk about them.\n\n##Step 2: The Applications\n\nYou're on LinkedIn anyways, so make sure to be checking it regularly. Use advanced search (like putting quotes around things so you don't get random other results) and trim off what jobs you're not interested in (clicking the little \"x\" button). \n\nBut let's be honest. You most likely hate using that method. So do I, and many others. Thankfully, we have an alternative: company websites. Search \"list of insurance companies\" (wikipedia has a decent one) and just start checking their listings. This will broaden your range, give you better odds, and with repeated checks you'll be applying before the listing is even posted to job sites. I'd recommend making a spreadsheet with names of each company and then a hyperlink to each so you can check these quickly. (And for a good coding project, build a macro to open multiple links at once). Overall, it's a numbers game, and the more places you can apply to the better, so be willing to move and take most any actuarial job if needed. Any job &gt; no job.\n\n##Step 3: The Interviews\n\n1st things 1st: Use the STAR (Situation, Task, Action, Response) method. You'll want to take a few stories/projects you have and structure telling them in this way. Google common interview questions and know how to answer the top 30-50 using STAR. I found it best to have a document with bullet points for them so I had an idea of what I would say long before I went into the interview. Also make sure to do mock interviews with people, or even just talking to yourself in the mirror. Typing is far different than explaining it out loud. \n\nAlso make sure to do research on the company, and have specific, unique questions to ask at the end. Show them not just why you want to be an actuary, but why you want to work as an actuary for them. Mention what this role specifically has that others don't. And overall, remember that this is a two way conversation, be personable. A stone faced monotone conversation will put you both to sleep.\n\n##Step 4: The Misc.\n\nYou'll want to also make a spreadsheet for tracking where you've applied, and the details of that role (location, pay, application#, date applied, etc.). The details will pile up fast and multiple times I've lost track of how long it's been exactly.\n\nIn terms of the process, I've found within 1-2 weeks is usually when you'll hear back from places, a month tops. Once you're in the interview process, 2 weeks is the max length before assuming you won't hear back (a note: once you start interviewing, don't expect a rejection email. It's rare in my experience). I recommend making one your questions \"when can I expect to hear back by\" so you have a specific timeline of when to check in again\n\n&amp;nbsp;\n\n#FAQ\n\n* **How many applications should I expect to send out?** \n    \n     As many as it takes. I know people who sent out under 10, some over 200. The sooner you start, the more rejections before landing something (naturally).\n\n* **I keep getting interviews, but can't seem land a job. Why?**\n     \n     This most likely means there's a weakness in your interview process. Do more mock interviews, record them and watch it back. Think of where weaknesses are/were in previous interviews and how you can correct them. Are the answers to questions in STAR form/said well? Interviews are hard, and there's always room to improve. \n\n* **I've not gotten anything in a while, should I take another exam?**\n\n     Now here's where SRM comes in. SRM is one of the easiest exams, and I highly recommend taking it if you only have 2 on your resume, and are flexible with going to either the P&amp;C side or health/life/pensions side. For jobs in the latter pool, that 3rd exam will be a decent leg up above other candidates. If you end up in the former, SRM's content is basically all on MAS-I (the corresponding 3rd exam). So the time will not have been wasted. Overall, taking another exam is never a bad idea, just realize it'll be a decent cost to you time and money wise, especially once you hit 4+ (but ideally by the time you hit that point you'll be employed). [Here's a guide to SRM if you need one] (https://www.reddit.com/r/actuary/comments/1iq8iti/srm_an_indepth_guide/).\n\n* **Should I take an underwriting/data science job if I can't get an actuarial one?**\n\n     Yes, depending on how much you need/want to switch. Underwriting and data science are the closest you can get without being actuarial (though note there still is a gap). Keep in mind though these can be much more saturated. Also, if you do end up applying, don't include mention of exams or else you risk them thinking you're using them as a stepping stone job.\n\n* **How do I write a cover letter?**\n\n     You don't. From what I've heard, most places don't bother looking at them. Even if they have an option to put one, you're much better off using that time to send out more applications. Now, if there's a job you're extremely passionate about, then go for it, but I don't bother with most places unless they mandate it (and even then, there's hundreds of other places to apply). \n\n&amp;nbsp;\n\nAnd that should about do it. I hope this guide serves as some help for those just entering/looking at the career. If I missed anything, or something needs to be corrected, just let me know and I'll take a look. I'll also try to update this as time goes on and more FAQs/info needs to be added.",
    "score": 146,
    "url": "https://reddit.com/r/actuary/comments/1ozw0cb/entry_level_jobs_an_indepth_guide/",
    "created_at": "2025-11-17T23:28:10.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1linbe7",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "My experience in Mercer Retirement as an International Student",
    "text": "I was an international student. Graduated from college, passed an exam, and finished an internship. I had a couple of offers from different companies that offered me sponsorship for a work visa, but the only remote position was offered by Mercer Retirement. During this time, I was able to work because of my OPT and OPT STEM, which grants me a work permit for a total of three years after graduating. I had about two years and some change left when I started at Mercer. \n\nFrom what I researched, there were three possible times I could enter the work visa lottery before my OPT ended. Not sure on how true the odds are, but everyone seems to think there is a 1/3 chance of being selected in each drawing.\n\nThe first deadline was very close to my starting time, and I inquired about it with my supervisors. By the time HR responded, the deadline had passed. I continued my work as normal.\n\nAfter some time, I was assigned to a client for which I had to work with a lead who is also not from the US. She has been at Mercer for a long time, and everyone considered her a great person. We met over a video call. She asked me a lot of questions regarding my immigration process and asked me how I got hired since I am not in the US permanently. I told her that the company had promised to sponsor me, and she looked surprised. She told me that she was shocked because she had been trying to get her friends from her country hired at Mercer, but the company had told her repeatedly that they don't sponsor. I tried to change the subject after this because I didn't want her to feel bad or anything. \n\nA couple of days after, I received an unusual call from one of the higher-up managers telling me that someone had raised a complaint about the fact that Mercer was working on my sponsorship and that I should keep it on the low and not mention it to anybody. They confirmed to me that they were still going to work with HR about getting the process started. \n\nThe deadline time is approaching, and I reach back out about my sponsorship requirements, asking them if they need any extra information from me to get the process started. The same manager calls me and tells me that the company has updated their policy and that they do not sponsor anymore, but that that might change because of my situation. \n\nI felt betrayed and cheated. \n\nI worked overtime, prioritized work over study time, worked while sick, took work from other colleagues who were struggling with their workload, met all my billable hour goals while others did not. I had to deal with the lack of time management from different leads which led me to work unnecessary overtime. Every performance meeting I had went well, and all my goals were met every year. I did all of this intending to be exceptional and to demonstrate that it was worth taking a chance on me. But they just used me. Denied me appropriate study materials, gave me 1% raises when inflation was at least at 6-8%. Most importantly, they left me hanging. By promising to sponsor me and then going back on their commitment. I rejected other companies that promised to sponsor me, and I tried to reach back to them, but it was too late. Positions were already filled, and I only had one more chance at a lottery.  \n\nSeveral people started leaving the team in my last year. \n\nI started saving heavily from my already unfair salary to prepare for several months of unemployment after my last work permit expired. I even asked for some sort of severance bonus, but I got denied by everyone in management. When my work permit was close to expiring, they asked me several times to send them a letter stating that I was leaving the team voluntarily, and I refused. I had a meeting with an HR lead to complain about the situation and ask for help. She dismissed everything I told her and then proceeded to say, \"That is how life goes\". \n\nEvery time I raised a concern on the matter, it always needed to go up the corporate ladder.\n\nI understand that getting sponsored is not a guarantee since it is a lottery. But the fact that they did not even try to get the process started showed me everything I needed to know.  \n\nThe amount of stress and emotional damage this experience caused is something I do not wish upon anybody. \n\n\n\nI am posting this simply to share my experience and help anyone who may be in a similar situation or is an international student considering joining this company. ",
    "score": 139,
    "url": "https://reddit.com/r/actuary/comments/1linbe7/my_experience_in_mercer_retirement_as_an/",
    "created_at": "2025-06-23T17:49:08.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1krekgc",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Are actuaries really that special?",
    "text": "I'm currently studying to become an actuary and have passed three exams while still in school. Whenever I tell people about my career path, I usually get one of two responses: *\"What’s that?\"* or *\"You’re going to be rich!\"*\n\nI know actuaries are generally well paid, but the way people talk about it, you'd think we were all going to be making a doctor’s salary. It got me wondering—are actuaries really that well compensated across the board, or is that kind of income mostly reserved for FSAs and principals?",
    "score": 138,
    "url": "https://reddit.com/r/actuary/comments/1krekgc/are_actuaries_really_that_special/",
    "created_at": "2025-05-20T19:58:37.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1pr6n14",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "For those who stayed at the same company long-term, did your salary eventually catch up to those who switched companies more often? If not, do you regret staying?",
    "text": "",
    "score": 81,
    "url": "https://reddit.com/r/actuary/comments/1pr6n14/for_those_who_stayed_at_the_same_company_longterm/",
    "created_at": "2025-12-20T05:30:51.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1l3j9kt",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Top Paying Companies and Locations for Entry-Level Actuaries",
    "text": "Hey all, just wanted to share some analysis of the latest total compensation data for entry-level actuaries collected by levels.fyi.\n\nLevels only recently started collecting data for actuaries, so this is kind of a sneak peek of what we have now with more hopefully to come.\n\nFor more context, we're a salary transparency site very popular in the tech industry though we've more recently started branching into all industries and roles. I’d love to hear more about what data would be interesting to you all!a If you find salary data helpful, please consider [adding your salary](https://www.levels.fyi/salaries/add) and share the site in your group chats.\n\nIf y’all have any follow-up questions on the data, how it’s collected, or anything else I can clarify, I’d be happy to share what we’ve got!\n\nYou can view and filter the actuary data yourself here [https://www.levels.fyi/t/actuary?countryId=254](https://www.levels.fyi/t/actuary?countryId=254)",
    "score": 81,
    "url": "https://reddit.com/r/actuary/comments/1l3j9kt/top_paying_companies_and_locations_for_entrylevel/",
    "created_at": "2025-06-04T22:36:40.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1ihpy21",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Interested in full remote P&amp;C modeling job?",
    "text": "**TL;DR:** Team is hiring multiple individual contributor data scientist roles at various levels (5+ yr, 7+ yr, and possibly one level above). Fully remote position, FCAS preferred. Non-traditional role with competitive compensation including RSUs (public stock that can be sold after vesting). DM me for a transparent/honest chat about the role, and I will recommend qualified candidates directly to the manager.\n\nMy manager is hiring, and I'm sharing here because I think actuaries with modeling experience are a really good fit for this role! The team has historically been a mix of actuaries and PhDs. We have multiple openings because we had difficulty backfilling after internal rotations/departures around the time RTO hybrid was enforced. Remote work was not considered until very recently, when upper management granted an exception.\n\n**Must-haves:**\n\n* Strong understanding of probability and statistics (as covered in CAS prelim exams), including probability distributions commonly used in P&amp;C\n* Strong modeling skills and experience, including complex feature engineering, GLM, Tree models, etc. (DL/NLP/Vision/LLM not required). Python preferred, but can consider someone with strong R experience if willing to learn Python\n* Proficiency in data manipulation with huge datasets (pandas, SQL; others like Spark are a plus)\n* 5+, 7+, or above years (2-3 different job levels) of work experience in predictive modeling/data science focused role. FCAS or advanced degree.\n\n**Nice-to-have** (should have 2-3 of these to be competitive): Because finding someone with all these skills is impossible, we're flexible depending on other hires' skillsets:\n\n* Writing clean code, reproducibility, production-ready code, versioning, git/docker – can learn on the job\n* Experience in end-to-end ML/data pipeline and working with MLops and Data engineers\n* AWS experience (Sagemaker, S3, Redshift, Glue, EC2, EMR, MWAA, etc.) – can learn after joining\n* Expertise in building models with limited or no data for new types of exposure\n* Cat modeling (building it, not running it) experience and knowledge in correlation/dependencies/copulas etc. (if relatively weak on DS modeling skills, there might be an opportunity to get started with cat model first then contribute to predictive models later)\n\nI recommend these roles to people who want to keep pursuing IC in their mid-career and enjoy hands-on technical work. In some companies, promotions and salary progression are often limited unless you move into management, which some actuaries prefer not to. I believe the highest point you can reach as an IC here is higher than typical. This is not the best option for those in their mid-career looking to move up the management ladder in the next few years.\n\n**Pros:**\n\n* Fully remote\n* Use latest technology while leveraging actuarial knowledge\n* Good WLB and great compensation with bonus and RSU, plus excellent benefits package and unique perks (DM me for details on this)\n* Work closely with MLops teams and DE teams, with chances to improve engineering skills\n* Lots of paid/internal learning opportunities, conference opportunities\n* Option to interface with clients if you want that experience\n* No micro-management\n\n**Cons:**\n\n* Limited opportunity to move up to management level within the department – However, there are rotations and other job opportunities in different products for actuaries/DS after 2-year tenure\n* No exam support (FCAS preferred). FCAS/MAAA fees are covered\n\n**Exit paths I've seen:** Historically, past team members have rotated internally to different analytics products, gone back to insurance companies/insurtechs, moved to non-insurance tech companies as DS/ML, or become PMs, etc. It depends on what skills you develop here.\n\n**Next steps if interested:** I decided not to make a throwaway account because I've made many contributions to this subreddit with this account, and some people know my identity. However, I don't want to be too openly public and expose my identity in other subreddits I use. So I will be sharing details over DM beyond what's provided here. Feel free to contact me anonymously if you prefer. Ask questions, and I will try to be transparent. Send your resume, redacted resume, or summary of your experience if you want, which will save us some time. If there seems to be alignment, we can take it to LinkedIn or have a call, depending on your preference. For qualified candidates, I will make recommendations directly to the manager to speed up the process.",
    "score": 78,
    "url": "https://reddit.com/r/actuary/comments/1ihpy21/interested_in_full_remote_pc_modeling_job/",
    "created_at": "2025-02-04T19:22:16.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1mprr3e",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Statefarm Salaries",
    "text": "How much salary can I expect with \\~0-1 yoe, 2 exams passed at Statefarm as basically en EL actuarial analyst?\n\nI am also open to dms.",
    "score": 72,
    "url": "https://reddit.com/r/actuary/comments/1mprr3e/statefarm_salaries/",
    "created_at": "2025-08-14T05:29:48.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1lucu8e",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Does Job Hopping Actually Matter for Salary?",
    "text": "I feel like for actuaries there’s a salary table or scale that companies follow strictly and at the end of the day we’ll end up making the same whether job hopping or staying put. Is that true or does job hopping really bring in more $?",
    "score": 67,
    "url": "https://reddit.com/r/actuary/comments/1lucu8e/does_job_hopping_actually_matter_for_salary/",
    "created_at": "2025-07-08T02:09:20.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1mvt72h",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Early Retirement",
    "text": "Considering this is a very well paid profession, how common is it for actuaries to retire early? Depending on one's lifestyle, COL, but also investments and partner's salary, I can definitely see people retiring by the age of 50, depending on what they want their retirement to look like, of course. I am wondering how accurate and/or common this is, or is being a HENRY - high earner, not rich yet, more common?",
    "score": 65,
    "url": "https://reddit.com/r/actuary/comments/1mvt72h/early_retirement/",
    "created_at": "2025-08-20T22:17:30.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1o5d2g3",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "2026 DW Simpson Salary Survey Results - Reactions",
    "text": "Thread for reactions to latest DW Simpson 2026 Survey. \n\nMy takeaways after a quick review are:\n\n(1) Health is in-line on Base but Bonuses lag significantly because the survey is based on 2024 bonuses and they all sucked due to poor Medical trends across the industry and many large insurers having bad financial results. Working in health, I expect this to improve to be more in-line with other sectors. United may lag, but others should rebound. \n\n(2) Base salaries are not meaningfully different between FCAS and FSA.\n\n(3) As always, I hate that the survey does not explicitly include any stock based compensation offered by private insurers (ideally spiked out if it added). It almost makes the results unusable in my opinion. ",
    "score": 65,
    "url": "https://reddit.com/r/actuary/comments/1o5d2g3/2026_dw_simpson_salary_survey_results_reactions/",
    "created_at": "2025-10-13T07:19:46.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1ldawrs",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "ASA job market",
    "text": "What’s the job market look like for a new ASA? I’ve heard recruiters will reach out once you get your ASA. I’ve noticed plenty of people at my company leave once they get their ASA and I assume it’s for better positions and better salaries. Did anyone leave their job and get a big salary bump after getting ASA?",
    "score": 63,
    "url": "https://reddit.com/r/actuary/comments/1ldawrs/asa_job_market/",
    "created_at": "2025-06-17T01:43:17.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1jucnq0",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Current Economy (salary/housing market)",
    "text": "Hi everyone,\n\nI thoroughly enjoy my work, the balance a 40 hour work week + studying gives (less stress than consulting/most fields that offer salaries 100k+).\n\nRight now I’m 25 making about 100k, will be 110 with ASA, probably 140-150 with FSA. My wife also makes about 90k.\n\nRight now, if you look at houses in a great school district in my state (not CA/NY etc), a 2000 sq foot nice house goes anywhere from 500-600k. From my little research, it seems a large % of the housing market is owned by black rock etc. and they don’t plan on selling (renting etc). Do you see these houses eventually dropping in price? The only reason I could see this happening is if there is a major recession with very high unemployment - I could be wrong.\n\n What is your current/projected plan for buying a house? I enjoy my apartment but I can’t imagine I’d want to rent forever. I also invest a lot as I’d like to retire by the time I am 50ish.\n\n",
    "score": 62,
    "url": "https://reddit.com/r/actuary/comments/1jucnq0/current_economy_salaryhousing_market/",
    "created_at": "2025-04-08T12:44:39.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1irq2rl",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Layoff Justification",
    "text": "Actuaries don’t get laid off as often as some other professions, but it does occur. Just wondering, in others experience, who is usually the first to go. Analyst level (little experience)? FSAs (who are making high end of their salary range)?  Career ASA (or maybe they are more likely to be kept since they are credentialed yet don’t demand the same salary of an FSA)?\n\nI’m sure work ethic/performance review is also taken into account, but from the actuaries I’ve known laid off over the years, there doesn’t really seem to be clear justification (from what I’ve observed) on why specific people were picked. ",
    "score": 58,
    "url": "https://reddit.com/r/actuary/comments/1irq2rl/layoff_justification/",
    "created_at": "2025-02-17T17:58:14.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1kqtzqu",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Not sure if this is the right path for me.",
    "text": "I just turned 27 a few months ago and it hit me so hard that I’m in my late 20s now and still not sure what to do with my life. I have four exams under my belt and studying for the fifth but I really don’t know if I can or should keep going. I’m still a new analyst with barely a year of experience but everything still seems super hard to me. \n\nI got a degree in English Literature but took the exams because I always liked statistics. But I really want to be more creative. I find myself writing in my free time and thinking about doing that instead. I don’t really like math/stats compared to writing. \n\nThis is probably a grass is greener situation, but I still can’t get the thought of this not being the right career for me out of my head. I know that the career outcome for English grads are low and the salary even lower but my classmates are in FAANG companies and being kick-ass lawyers with that degree while I’m stuck studying. \n\nI hate the job, I hate my boss, and I hate studying and feeling myself get old in the process. How do I know if I should keep going or just pivot? Would that be a bad decision? ",
    "score": 57,
    "url": "https://reddit.com/r/actuary/comments/1kqtzqu/not_sure_if_this_is_the_right_path_for_me/",
    "created_at": "2025-05-20T02:24:09.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1ja8vsk",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Why become an actuary over an SWE or data scientist?",
    "text": "I'm (24, late bloomer) currently a stats major and Ive been programming on and off since I was 15 and Im fairly confident Im more competent at SWE than a majority of fresh compsci grads. Ive created some quant finance related scripts in the past related to statistical arb (cointegration, PCA, etc), options pricing, vanilla arb.  Id like to go into quant finance ideally but if that doesnt work out I figure Im well positioned to go into data science, actuarial, or SWE.\n\nIm intrigued by actuarial because it seems much more straightforward to break into and progress professionally in than these other fields, but salaries and earning potential are lower from what I can tell. \n\nIs there a reason for someone with my background to become an actuary? Or is data science a better fit if I want to use my programming skills? \n\nAnd to be controversial, why would anyone become an actuary if the salaries are so much lower than SWE and data science? Is it purely because its easier to break into and less of a grind to progress professionally?",
    "score": 53,
    "url": "https://reddit.com/r/actuary/comments/1ja8vsk/why_become_an_actuary_over_an_swe_or_data/",
    "created_at": "2025-03-13T10:30:08.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1n45s07",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Canadian Actuary Salaries",
    "text": "I know this has probably been asked before, but I’m hoping to get some recent updates as I try to figure out what to expect if I pursue this path in Canada. I’d love to hear about base salary, bonus, years of experience, number of exams passed, whether you’re in consulting or non-consulting, and what province or city you’re in. Any insight would be super helpful, thanks in advance!",
    "score": 47,
    "url": "https://reddit.com/r/actuary/comments/1n45s07/canadian_actuary_salaries/",
    "created_at": "2025-08-30T16:22:15.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1j4djm3",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "High Compensation Actuaries",
    "text": "Hi folks, recently during a conversation with a colleague, he mentioned that his actuary friend makes upwards of $800K in base salary alone, working in casualty reinsurance. He's an FCAS, and has been with his current company for 17 years. My question is - does this sound reasonable? Are there specialized actuaries out there who could actually make that kind of money? What would his role, experience, and credentials (additional, beyond the FCAS?) look like?",
    "score": 45,
    "url": "https://reddit.com/r/actuary/comments/1j4djm3/high_compensation_actuaries/",
    "created_at": "2025-03-05T20:49:11.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1l9x1oh",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "Inflation and Salary Bumps",
    "text": "I finally got my first job in the field after a few years in a different industry, and I’m pretty bummed by the salary increase amount, essentially it works out to be ~600 per hour of exam which in this economy and amount of time needed to study no longer seems worth it to me. \n\nI compared the booklet to one from a couple years ago and the numbers haven’t changed at all, and it makes me wonder if they’ve ever been adjusted with inflation whatsoever? \n\nEveryone always said actuaries make great money but I’m just not seeing that personally. For reference I’m in Canada and at a consulting firm. \n\nHoping some of you who have been in the field longer can help to answer my question on whether $ per exams have changed since you started? ",
    "score": 43,
    "url": "https://reddit.com/r/actuary/comments/1l9x1oh/inflation_and_salary_bumps/",
    "created_at": "2025-06-12T20:30:21.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1krn59d",
    "subreddit": "actuary",
    "soc_codes": [
      "15-2011"
    ],
    "title": "What salary should I ask for?",
    "text": "I’m applying for an senior actuarial analyst job for a large health insurance company. They don’t list a salary range and google is giving a range of 90,000-150,000 so I need some help. I have 3 years full time plus internship experience, all in pension. I’ve had my ASA for about a year now. The job would be completely remote but I think the physical location of the job is eastern PA.\n\nSo I don’t have any health experience but I have my ASA which the job doesn’t require (they want 4 exams and 2 years of actuarial experience).\n\nThoughts?\n\nThank you!!!",
    "score": 42,
    "url": "https://reddit.com/r/actuary/comments/1krn59d/what_salary_should_i_ask_for/",
    "created_at": "2025-05-21T02:35:37.000Z",
    "num_comments": 27
  }
]