[
  {
    "id": "reddit-1mebihv",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "My SolidWorks license was expiring in a week, so I decided to make this.",
    "text": "I made this water based wind tunnel for my room, lmk what you think. Think I could add to portfolio or something?",
    "score": 2935,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1mebihv/my_solidworks_license_was_expiring_in_a_week_so_i/",
    "created_at": "2025-07-31T19:49:31.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1mum2dv",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "My job search experience as an Entry Level candidate in Aerospace Engineering",
    "text": "By far one of the most difficult processes I’ve ever had to go through. Learned so much about what worked and what didn’t work. Out of 399 applications, almost 70-80 of those were referrals and high up managers. One of those referrals was an astronaut ( didn’t result into a job ). Only about 5-10 referrals brought interviews. \n\nI ended up getting my dream aerospace job after 444 days. And it was all worth it. \n\nFinal thoughts: \n- I got my offer literally applying through the website. No referral\n- Consistent is key\n- Quality over quantity \n- Learn from every single interview\n- don’t settle for a job you don’t want to do\n- if you’re still in college, get involved ASAP. Do clubs/research/start up/ code apps\n- there is usually no “perfect” time to apply but based on my data, between July- September is the absolute best.\n- Study first principles and general structural questions for entry level technical interviews. Use first principles engineering books to study\n- voice your thoughts when doing technical interviews, took a lot of practice, but generally just try and figure out the answers with more questions and really try to think down to first principles ( Is it electrical? Heat transfer? Dynamics? Structural? )\n- using chatgpt to create technical questions related to the role would sometimes give me questions that recruiters/ hiring managers would actually ask me (Usually kind of a gamble).\n- Do mock interviews with your school or friends \n- I went to a good school but career fairs were pretty worthless and never amounted to any true leads. May work for others but for my case was pretty un-helpful\n\nIf you have any questions, please feel free to reach out! I had a lot of friends of mine who were extremely gifted and skilled who weren’t able to find a job in aerospace at all. It really makes me sad to see and I’d like to help others in this process if I can. ",
    "score": 2689,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1mum2dv/my_job_search_experience_as_an_entry_level/",
    "created_at": "2025-08-19T15:42:27.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1mb3n0c",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "I did it (I think), and you all said I was crazy to even try! /s",
    "text": "So not actually sure if anyone will remember, but a couple weeks ago I made a post on here asking for some advice about my project for the summer. I wanted to \"CAD up an F1 front wing from pictures\", specifically from the RB16B. I got a lot of helpful responses (thank you!!) which actually turned out to be really pivotal in how I went about doing this. I actually managed to model what I think is a pretty good copy of the wing (if I do say so myself, can you tell I'm proud yet?), and I even managed to run some CFD simulations on it and YOU CAN ACTUALLY SEE THE Y250 VORTEX!!\n\nCurrently in the process of writing it all up in a neat document/portfolio, as I said in the last post this is all just me doing something this summer to help my applications to F1 placements come autumn. If anyone has any more advice on how I should go about the write up, or if there's something more I should investigate, please let me know. I absolutely loved reading everyone's comments last time.\n\nThanks again everyone!",
    "score": 2551,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1mb3n0c/i_did_it_i_think_and_you_all_said_i_was_crazy_to/",
    "created_at": "2025-07-28T01:43:13.000Z",
    "num_comments": 131
  },
  {
    "id": "reddit-1iptksx",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "CAD Surfacing for Aerospace",
    "text": "What does the career path look like for someone who does the modeling for aerospace, such as the F-35? How different is that surface modeling compared to automotive and industrial design? I would assume similar fundamentals but wonder where the skillsets or jobs depart. Would love to hear from people who have done the real thing.",
    "score": 1245,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1iptksx/cad_surfacing_for_aerospace/",
    "created_at": "2025-02-15T04:25:46.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1ptltk6",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "This seem almost automatic ?",
    "text": "So that control surface is the **aileron**, right? I noticed that during turbulence it was moving in the opposite direction as the plane go up and down. I did a bit of Googling, but I wanted to understand it better.   \n  \nIs this movement automatic? From the way it looks, is it adjusting the wing’s lift to smooth out the turbulence kind of like how a vehicle’s suspension works?",
    "score": 1240,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1ptltk6/this_seem_almost_automatic/",
    "created_at": "2025-12-23T05:28:13.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1nl47vi",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Nuclear Bombs instead of fuel.",
    "text": "Credit/Source: - @how_page_\nIG\n\nIf anyone knows about this concept please explain. Would love to read the basics and concept how it even work? ",
    "score": 1053,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1nl47vi/nuclear_bombs_instead_of_fuel/",
    "created_at": "2025-09-19T13:54:13.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1mcd6rs",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "I’ve built an open-source orbital simulation engine, and I need your feedback.",
    "text": "I'm a 17-year-old high schooler from Vietnam, and for the past year I've been building what I'm proud to call my life's work: an open-source, high-performance, real-time spaceflight simulation engine called Astrocelerate.\n\nIt’s written from scratch in C++ and Vulkan with modularity, visual fidelity, and engineering precision as core principles. The MVP release features CPU-based orbital physics, GPU-based rendering, and support for basic 2-body physics, all in real time, interactively, and threaded to minimize blocking the main thread.\n\nI just published the very first public release on GitHub:  \n[https://github.com/ButteredFire/Astrocelerate/releases/tag/v0.1.0-alpha](https://github.com/ButteredFire/Astrocelerate/releases/tag/v0.1.0-alpha)\n\nTo anyone who decides to even try my engine in the first place, first of all, I am extremely thankful that you did. Second of all, I want brutally honest, actionable feedback from you. Engineers, hobbyists, developers, if you try it out and tell me what’s broken, missing, confusing, or promising, that would mean the world to me.\n\nWhen you're done testing the engine, please give feedback on it here: [https://forms.gle/1DPtFa5LRjGdQNyk6](https://forms.gle/1DPtFa5LRjGdQNyk6)\n\nI’ll be reading every comment, bug report, and suggestion.  \nThank you in advance for giving your time to help shape this.\n\nIf I'm violating Rule 5, please inform me, and I will remove the post.\n\nI sincerely thank you for your attention!",
    "score": 987,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1mcd6rs/ive_built_an_opensource_orbital_simulation_engine/",
    "created_at": "2025-07-29T14:38:43.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1n39g21",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Our Team Just Won 1st Place in the VFS Student Design Competition with a Hydrogen-Electric Helicopter",
    "text": "Big news, my team just won 1st place in the Vertical Flight Society’s 42nd Annual Student Design Competition beating out 13 other colleges internationally! \n\nOur team at the University of Maryland designed Draco, a hydrogen-electric helicopter powered by Proton Exchange Membrane Fuel Cells (PEMFCs). The whole competition was sponsored by Airbus and focused on designing next-gen zero-emission VTOL concepts.\n\nI personally worked on the power drivetrain, avionics, safety analysis, and fuselage design, making sure the system was not only efficient but also safe and realistic with FAA certification in mind.\n\nIt was a huge challenge, but also a ton of fun to see hydrogen-electric propulsion come together into a clean, zero-emission rotorcraft concept.\n\nWe’ll be presenting Draco at the VFS Annual Forum in 2026, really excited!\n\nhttps://vtol.org/news/press-release-2025-student-design-winners-and-releases-43rd-sdc-rfp",
    "score": 551,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1n39g21/our_team_just_won_1st_place_in_the_vfs_student/",
    "created_at": "2025-08-29T14:47:48.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1i1cr8i",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Why are Aerospace engineers paid so little in the UK compared to the US?",
    "text": "I'm an Aerospace student studying in the UK and decided to check out what kind of salary I'll be earning once I get a job in the industry. I was pretty shocked to see that the median salary for an aero engineer in the UK is £39,000/year ($47,500) whereas it's $126,800/year in the US. Even worse, a senior aero engineer in the UK gets paid about the same as the bottom 10th percentile of US engineers (Aprox $78,000/year).\n\nI got the numbers from these websites:  \n[US Salary Data](https://www.usawage.com/usa/aerospace_engineers-salary.php), [UK Salary Data](https://www.payscale.com/research/UK/Job=Aerospace_Engineer/Salary)\n\nI'm genuinely considering moving to the US after I've worked for a few years in the UK, because the disparity between wages just seems so insane. (Obviously there's the nightmare of visas, but that's something for a different time)",
    "score": 377,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1i1cr8i/why_are_aerospace_engineers_paid_so_little_in_the/",
    "created_at": "2025-01-14T18:27:09.000Z",
    "num_comments": 125
  },
  {
    "id": "reddit-1l7bqnw",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Building My Way Into Aerospace: Orbital Sim Now Has TLEs, Burn Nodes, and Better Physics",
    "text": "Hey all, this is an update on my orbital simulator project. I’m a CS major trying to pivot into aerospace, and I’ve been building this from the ground up as both a learning tool and a technical showcase for job applications.\n\nSince the last post, a few of the most requested features have been added:\n\n1. Upgraded from RK4 to Dormand–Prince 5(4)  \n\n   \\- Someone pointed out RK4 wasn't ideal for long-term accuracy. The core integrator is now DoPri5(4), implemented in double-precision C++ for much better numerical stability.\n\n2. TLE input support  \n\n   \\- Satellites can now be placed directly into the sim from Two-Line Element sets. They're propagated in real-time using the same native physics engine.\n\n3. RK4 now used for trajectory prediction  \n\n   \\- The old RK4 integrator still has a role. It's now used on the GPU to render predicted orbital paths asynchronously, completely separate from the live sim logic.\n\n4. Early maneuver node system  \n\n   \\- You can now create basic maneuver nodes, choose burn directions (prograde, radial, etc.), and have burns auto-execute when the satellite reaches the node. It’s rough, but functional.\n\n5. Atmospheric drag  \n\n   \\- There’s an empirical drag model running during simulation. Its effects are subtle over short timescales, so it's hard to visualize unless you're running longer-term sims.\n\nWhy no GitHub yet?  \n\nThe project is tied to personal details on my GitHub and is part of my job application portfolio. I’m holding off on making the repo public until I’ve cleaned it up and removed identifying info.\n\nOpen to any feedback, if anything seems off, I’d love to know. I’m also still working on improving the video quality. It runs smoothly in real time, but compression makes the rendered lines look a bit rough.",
    "score": 201,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1l7bqnw/building_my_way_into_aerospace_orbital_sim_now/",
    "created_at": "2025-06-09T18:01:47.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1iimtmo",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Working with engineers without degrees",
    "text": "So ive been told that working in manufacturing would make you a better design engineer.\n\nI work for a very reputable aerospace company youve probably heard of.\n\nI just learned that my boss, a senior manufacturing engineering spec has a has a economics degree. And worked under the title manufacturing engineer for 5 years.\n\nThey have converted technicians to manufacturing engineers\n\nKeep in mind im young, ignorant, and mostly open minded. I was just very suprised considering how competitive it is to get a job.\n\nWhat do yall make of this. Does this happen at other companies. How common is this?\n\n",
    "score": 197,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1iimtmo/working_with_engineers_without_degrees/",
    "created_at": "2025-02-05T22:27:18.000Z",
    "num_comments": 163
  },
  {
    "id": "reddit-1jpc5z5",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Test out the PX4 Simulink SIL Simulation",
    "text": "Hey guys,  \nI work with a team of aerospace engineers who like to do fun projects on the side. We've recently released an open-source PX4 Simulink Software In The Loop (SIL) Simulation, and we're looking for people to try it out and leave some feedback on how to improve it (either on GitHub or via email). Here's a little bit of information about the sim, along with a video.  \n🔹 **What It Does:**  \n  \n✅ Simulates an aircraft using the **PX4 autopilot (V1.14.0)**  \n  \n✅ Provides a **Simulink plant model** with physics, sensors, and environment simulation  \n  \n✅ Supports **QGroundControl** for ground station integration  \n  \n✅ Connects with **FlightGear** for 3D visualizations  \n  \n✅ Includes a default **F-16 aircraft model**, with options to add **custom vehicles**  \n  \n💡 **Why You Should Try It:**  \n  \n✔️ Provides an environment to experiment with the PX4 firmware or your custom version of the PX4 firmware  \n  \n✔️ Improve your understanding of PX4 flight controller modes using realistic aircraft physics   \n  \n✔️ Tune controller gains and test vehicle parameters without risking damage to an actual vehicle  \n  \n✔️ Open source method of getting started on your own UAS project  \n  \n🔧 Help improve the simulation by contributing to the repository or simply by providing feedback via email or GitHub  \n  \n🔧 **Get Started Today!** Check out the **PX4 Simulink SIL** GitHub repository and start exploring:  \n  \n[https://bitbucket.org/shaviland/px4sil/src/main/](https://bitbucket.org/shaviland/px4sil/src/main/)  \n[https://optim.aero/px4silsimulink.html](https://optim.aero/px4silsimulink.html)",
    "score": 179,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1jpc5z5/test_out_the_px4_simulink_sil_simulation/",
    "created_at": "2025-04-02T01:02:52.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1k1s2au",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "What’s the biggest misconception about starting a career in aerospace?",
    "text": "When I started looking into aerospace, I thought the only way to make it was to become a rocket scientist or land a job at NASA. But now I realize there are so many other options and career paths in the industry.\n\nWhat do you think is one of the biggest misconceptions people have when they’re just starting out? I’ve been working on a resource to help beginners learn more about the field, but I’d love to hear what you all think matters most.",
    "score": 162,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1k1s2au/whats_the_biggest_misconception_about_starting_a/",
    "created_at": "2025-04-18T00:29:37.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1j9rg73",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Cant land a job in aerospace engineering",
    "text": "I wonder if other recent graduates are facing the same challenge as I am. I graduated in aerospace engineering last winter with honors (3.7/4.0). During my degree, I completed **one year of internships across two different experiences** and was also involved in a technical society.\n\nIt has now been four months since I started my job search, with nearly **a hundred applications sent** but very few responses. I attended career fairs and job expos, which led to **three interviews**, but unfortunately, no offers. Two of the positions were for technician roles, and the other was for a consulting role.\n\nI find the situation quite discouraging, especially given the **limited number of junior positions** and the intense competition (often over a hundred applicants per role). I wanted to know if this is a common experience and if others are in a similar situation.",
    "score": 158,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1j9rg73/cant_land_a_job_in_aerospace_engineering/",
    "created_at": "2025-03-12T18:44:42.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1jg7l9k",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Does it get easier?",
    "text": "I just started my first full time engineering job out of college and I kinda hate it so far. I don’t understand anything and feel like I’m not getting enough help. Everyone around me is always busy and when they try to help me or answer my questions, I don’t understand anything after several rounds of questions. I’ve been told to ask lots of questions and speak to my mentor, but when I did, I didn’t gain much. I feel really dumb because it seems everyone else, even for a new hire, knows what they’re doing and can do much more with less help. \n\nWhen does it get better? Is it my specific company (SpaceX) or am I just not cut out for engineering? When should I consider switching careers or company (ex. If you still hate it after 6 months)? It sucks because I was genuinely interested in space but I guess not in engineering.\n\nLet me know if it was a bad idea to share that I work at SpaceX so I can remove it.",
    "score": 123,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1jg7l9k/does_it_get_easier/",
    "created_at": "2025-03-21T03:23:52.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1jzrpe5",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Is it worth it to get a masters degree in aerospace engineering? Does aerospace require a masters or PhD degree generally? Strong opportunities and wages?",
    "text": "I only met two aerospace engineers they had PhDs and they worked in a shipyard and were not happy about it but it seemed like the only job they could get. \n\nI have a BS in civil engineering and am turned off by the low salary in the field. ",
    "score": 119,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1jzrpe5/is_it_worth_it_to_get_a_masters_degree_in/",
    "created_at": "2025-04-15T13:19:55.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1j5aszw",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Python for Engineers",
    "text": "Hi folks,\n\nI'm a Mechanical Engineer (Chartered Engineer in the UK) and a Python simulation specialist.\n\nAbout 6 months ago I made an Udemy course on Python aimed at engineers. Since then over 5000 people have enrolled in the course and the reviews have averaged 4.5/5, which I'm really pleased with.\n\nBut the best thing about releasing this course has been the feedback I've received from people saying that they have found it really useful for their careers or studies.\n\nI'm pivoting my focus towards my simulation course now. So if you would like to take the Python course, you can do so here: [https://www.schoolofsimulation.com/course\\_python\\_bootcamp](https://www.schoolofsimulation.com/course_python_bootcamp)\n\nIf you find it useful, I'd be grateful if you could leave me a review on Udemy.\n\nAnd if you have any really scathing feedback I'd be grateful for a DM so I can try to fix it quickly and quietly!\n\nCheers,\n\nHarry",
    "score": 118,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1j5aszw/python_for_engineers/",
    "created_at": "2025-03-07T00:34:46.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1m4vvyl",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "I just made my Python course for engineers and scientists free to enrol",
    "text": "Hey folks,\n\nI am a Chartered Mechanical Engineer and Simulation Specialist with over 15 years in industry - [you can read my career story here](https://www.reddit.com/r/MechanicalEngineering/comments/1gh8at0/my_13_year_nontraditional_meche_career_journey/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button). I made a Python course last year aimed specifically for other engineers and scientists. I didn't want it show you how to use Python for software engineering - I aim to get you practically applying Python for industry applications with data processing/analysis, modelling or simulation as quickly as possible, so is very fast paced and gets right into it.\n\nThis is not a course to learn how to use Python for software engineering, it's for learning Python to utilise it in your engineering or scientific work.\n\nFast forward to today, I've kept the course updated and improved over time, and now I have opened it up for free (at least for this Summer).\n\nHere's the link to enrol: [https://www.schoolofsimulation.com/course\\_python\\_bootcamp](https://www.schoolofsimulation.com/course_python_bootcamp)\n\nWhy have I opened it up? My focus is now on selling larger courses for intermediate/advanced applications in simulation and data science, as well as individual consultancy. So I am happy to just give this one away with the goal of getting as many people onboarded to Python and exposed to my school in the process; my hope is that you will like the learning style and consider enrolling in one of my other more advanced courses.\n\nI've had over 10,000 students across both Udemy and my own platform take this course (average rating of 4.5 on Udemy and 4.4 on Trustpilot). I am always grateful for more reviews so please consider reviewing me on Trustpilot if you take the course - it really helps my school reputation.\n\nSome practicalities to note:\n\n* The course is self-paced\n* There is no time limit to compete\n* You can power through in a day if you are very keen. Most people do it in bite-sized pieces. I recommend 10 days of roughly half hour chunks so learning can sink in inbetween days. I designed it to work for people who have busy lives.\n* Lesson order is not enforced\n* You can ask questions in a lesson at any point - I endeavour to respond to all questions.\n* On-demand video lessons which you can also download for offline viewing\n* You can watch it on the go with the Teachable App\n\nAny questions please feel free to give me a shout or comment below.",
    "score": 82,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1m4vvyl/i_just_made_my_python_course_for_engineers_and/",
    "created_at": "2025-07-20T18:14:40.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1lci5rx",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Where is all the technical work?",
    "text": "I've got a BS in Aerospace, working in the industry 9 years now (1 year integration and test, 2 years cyber security, 3 years manufacturing engineering, 3 years propulsion) all at Boeing or Lockheed. \n\nI'm looking at applying to grad school, but having trouble deciding what to major in, and thinking it over made me realize that a big driver behind this decisions is that I have no idea what sort of technical work gets done in aerospace engineering. I don't think I've had to actually use anything I learned for my degree even once in my career.\n\nAnd so I'm wondering, where are all the technical jobs at? What rikes actually make you use your degree?",
    "score": 80,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1lci5rx/where_is_all_the_technical_work/",
    "created_at": "2025-06-16T02:55:13.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1isurfn",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Engineers who are really doing stuff related to aircraft conceptual design or aerodynamic analysis, what do you do with MATLAB?",
    "text": "I'm considering turn my career direction to aircraft conceptual deisgn or aircraft aerodynamic analysis and I see there are requirements about using MATLAB in proficiency in job descriptioin very often. I learnt some fundamentals about MATLAB and used it for some simple data processing and analysis but not very deep during my undergraduate study. Therefore, I'd like to know what should I study about MATLAB for real daily work and any recommended textbook or online course?",
    "score": 77,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1isurfn/engineers_who_are_really_doing_stuff_related_to/",
    "created_at": "2025-02-19T02:35:53.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1khw20f",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Can an aerospace engineer become an astronaut?",
    "text": "Hey guys, \n\nI'm quite new here and I was wondering what were your thoughts on becoming an astronaut after an aerospace engineering career? \n\nI've read that you could technically become either a pilot or an astronaut after an aerospace engineering career, if you were following the right course and if you had shown great capacities in your work prior to applying for these jobs.\n\nI supposed that you needed quite a lot of competences such as a strong physical shape or great skills in a lot of fields. Moreover, it would probably require experience at NASA or any other influent space company in the first place.\n\n  \nI was notably intrigued by Chris Hadfield's career that resembles to the kind of career history I'd like to follow (except being a fighter pilot).\n\n  \nThank you for your answers, they will be greatly appreciated!\n\n",
    "score": 68,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1khw20f/can_an_aerospace_engineer_become_an_astronaut/",
    "created_at": "2025-05-08T17:35:01.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1mac9di",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "The value of a PhD",
    "text": "Hey guys, I’m currently in my undergrad for aerospace and am starting to look at grad school options and decide whether I want to do a masters or PhD. Career-wise, I want to work on the Astro-side of things, designing rockets in industry (As from what I know, research is very, very, slow). Specifically, I’m thinking of wanting to work on rocket thrusters/boosters, but am not fully sure if I want to work on those or another part of the rocket. \n\nSo, for those who have completed a PhD/masters, which degree would be most beneficial to me for doing what I want to do in my career?\n\n\n\n\n",
    "score": 68,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1mac9di/the_value_of_a_phd/",
    "created_at": "2025-07-27T03:31:40.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1lsk2jt",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Graduated and Regretting the job I took",
    "text": "So, as the title says, I just graduated two months ago with a B.S. in Aerospace Engineering. And with the state of the job market, and with this current political climate, I am accepting that it is difficult to find a job in Aerospace engineering. But, fortunately, I at least got a job with a private military contractor that is classified as an aerospace company, but it doesn't necessarily deal directly with aerospace engineering or planes or rockets or satellites. And in that company, my position is a Quality Engineer, and I am having doubts about the position. My dream is to work on commercial aircraft, but I'm confused as to what job titles or positions an aerospace engineering degree would qualify me to be able to work on aircraft. Quality engineering just focuses on the manufacturing process and the quality of the goods coming out and into the hands of the customer. Any advice on a career path?",
    "score": 68,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1lsk2jt/graduated_and_regretting_the_job_i_took/",
    "created_at": "2025-07-05T21:03:50.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1jj7qoz",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Interview with an aerospace engineer",
    "text": "1. Why do you wanted to be an aerospace engineer? \n\n\nWhen I first got introduced to the space industry, through companies like Virgin Galactic and Space X, I was really moved by the message of sending many people to space. Specifically, the idea of settling in another planet ignited a sense of purpose in me. I thought the most impactful and challenging thing to do was to, of course, study rocket science! I considered biomedical engineering for a moment, but it just did not have the focus I wanted.  I later found out thermodynamics and propulsion were not my thing! I gravitated towards materials and structures. My space flight operations course and flight testing engineer course were also amazing electives for my major. Now, I’m a flight test engineer in the US Air Force!\n\n\n\n2. What was your strongest subject in secondary school and your weakest \n\n\nI was pretty good in math class, I was in advanced math placement for awhile, and taking Calculus II really ignited my passion and hope I’d succeed in engineering. I was not very strong in Literature, I was not picking whatever these books and the teacher were laying down!\n\n\n\n\n3. If you would change careers what would you change to?\n\n\nBefore I was interested in a STEM career, I was leading the school’s broadcast journalism class. I probably would have gone towards videography and documentary work. Now, I’d definitely focus on music and songwriting, but I still think art will be a big part of my contribution to the space community.\n\n\n\n4. What are the future challenges that you consider?\n\n\nFor me, I stress way too much about if I am on the “right” path, if I am contributing enough, if I am at the right level to fulfill my dreams. It takes up alot of brain space I could be using to create, learn, gracefully make mistakes, and enjoy my surroundings. I think my biggest challenge is simply getting out of my head and out of my way!\n",
    "score": 66,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1jj7qoz/interview_with_an_aerospace_engineer/",
    "created_at": "2025-03-25T01:18:45.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1jex1y7",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Where did your AE degree take you?",
    "text": "Im a junior AE student in the US and I’ll be finishing up my degree in about a year. I absolutely love aircraft and spacecraft which is why I picked this major. My question to all is where did your degree take you? I know my landing place after university will be some engineering job, but what comes after that? Management? Engineering roles for the rest of my days? I always hear about the jobs people work right after university, but never about what they did at the mid or even senior level of their careers. \n\nI’d love to hear any insight you all have! Thank you!",
    "score": 66,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1jex1y7/where_did_your_ae_degree_take_you/",
    "created_at": "2025-03-19T13:32:50.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1m40os7",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "PhD in Propulsion vs GNC at a Space Company",
    "text": "Hello all, another post inspired me to reorient my current career concerns into this post.\n\nI graduated with a B.S. Aero in December 2024. After interning at a space company doing analyst work for a propulsion system this year, I am on track to start a funded PhD program focusing rotating detonation engines. However, my internship taught me a great deal about the engineering process of propulsion systems and other disciplines like GNC. I've recently been more drawn to the saturation of programming and applied math that occurs at GNC-oriented roles than what occurs in Propulsion (but please prove me wrong if you can). \n\nWhile I can master out of my PhD after 2 years as a backup, I wanted more insight from people with more experience in either academia or industry. I like the challenge of applied math and I love programming, so I am thinking of switching to a GNC career path. However, I am still thrilled by the research that pushes propulsion technology every year for applications of space launch and reentry. Can I forfeit my PhD offer and switch to a GNC path at this point in my career or am I making a premature decision?",
    "score": 64,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1m40os7/phd_in_propulsion_vs_gnc_at_a_space_company/",
    "created_at": "2025-07-19T16:38:56.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1jtbo1l",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "What's a good rule of thumb for job hopping?",
    "text": "Hey everyone, just wanted to throw this out there—maybe it’s obvious, maybe not—but as an aerospace engineer, it really seems like switching jobs is the way to go if you want better pay or faster promotions.\n\nWhen I first started out, I think I jumped ship too soon (only 1.5 years at my first job), and looking back, I probably would’ve been better off staying 2-3 years to gain deeper experience in development before moving on. Since then, I’ve been with the same company for over 5 years, in a couple of different roles, but with the way inflation and the market have moved, my pay hasn’t kept up.\n\nNow I’m feeling the pressure to move on, but things like family stability and good benefits are making it tough to make that jump. I’ve got a bit over 10 years of experience in stress analysis, and I’ve noticed some of my peers—who aren’t necessarily working harder or smarter—seem to have passed me by in terms of compensation. I'm not that far off but still a bit behind. I kind of just winged my way through my career, since no one really taught me how to navigate all this. Meanwhile, others seem to have been a lot more strategic.\n\nNow that I’m back in a development-heavy role, I want to make the most of it, but I’m also thinking ahead. Once I’ve learned the ropes here and built some solid experience, what’s a good balance between staying long enough to gain value and hopping to get paid what you’re worth?\n\nI’m thinking long-term career growth—where maybe pay can wait a little if the experience is high-value—but I’d love to hear how others approach this.",
    "score": 64,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1jtbo1l/whats_a_good_rule_of_thumb_for_job_hopping/",
    "created_at": "2025-04-07T03:11:15.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1n20a2h",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Aerospace engineer willing to do a short student interview? 15–20 min after 6 pm CT (weekends preferred)",
    "text": "Hi! I’m a 10th-grade engineering student. I need to interview an aerospace engineer I don’t already know.\n\n\n\nWhat you’d be agreeing to\n\n• A 15–20 minute chat — Zoom/Google Meet/phone audio preferred (email is fine if easier).\n\n• I only need your name (or alias) for my write-up. No proprietary info; you can stay anonymous beyond that.\n\n• I’ll ask consent before any audio recording for note-taking.\n\n\n\nScheduling (hard rules)\n\n• Time zone: America/Chicago (CT)\n\n• I can ONLY meet after 6:00 pm CT\n\n• Weekends preferred (Sat/Sun evenings ideal)\n\n\n\nExact questions I’ll ask:\n\n1) Background for my write-up: your name (or alias).  \n\n2) How you describe your engineering field (aerospace).  \n\n3) Your current job title.  \n\n4) Your job and typical duties.  \n\n5) Your average work schedule.  \n\n6) Your educational path (from high-school age to now).  \n\n7) If you could redo part of your career/education, what would you change and why?  \n\n8) Advice for a high-school student interested in aerospace.  \n\n9) An ethical dilemma you’ve encountered at work (high-level; no confidential details).  \n\n10) What you did about it and how you decided (e.g., policies, supervisor guidance, professional code of ethics).\n\n\n\nIf you’re willing, please comment or DM with:\n\n• Your focus area (propulsion/structures/GNC/test/avionics/systems/spacecraft)  \n\n• Industry segment (commercial, defense, space, eVTOL, research)  \n\n• A couple of evening windows after 6 pm CT + preferred contact (email/Meet/Zoom)\n\n\n\nThanks for helping a student!\n\n",
    "score": 62,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1n20a2h/aerospace_engineer_willing_to_do_a_short_student/",
    "created_at": "2025-08-28T02:17:16.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1hnnff1",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Are SpaceX and Blue Origin more \"prestigious\" than NASA now?",
    "text": "Growing up, I always wanted to work at NASA and they were always referred to as \"The Aerospace Company\". Whenever any stranger thinks of aerospace engineering, NASA is what comes to mind. \n\nWhile this still seems to be the sentiment for random strangers, inside the world of engineering, people find SpaceX and Blue Origin to be the most prestigious space companies with SpaceX oftentimes regarded as the #1 prestigious engineering company at the moment. \n\nLike everyone wants to intern at SpaceX or Blue origin if possible but NASA seems forgotten. Even full time, people would rather take offers from these companies and turn down NASA. I mean, even if you gave people a choice between NASA and saw a defense contractor like Lockheed or RTX that are a \"tier below\" SpaceX, they would pick the defense company. \n\nI understand that salaries play a huge role since private companies pay a lot more than government jobs and for full time decision this can be the deal-breaker. But even for internship positions where salary is less relevant, people overlook the NASA experience.",
    "score": 59,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1hnnff1/are_spacex_and_blue_origin_more_prestigious_than/",
    "created_at": "2024-12-27T19:58:32.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1om0s9t",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Aerospace engineers: any side income or investments outside your main job?",
    "text": "I’m currently studying Aerospace Engineering, and while I’m truly passionate about it, I’ve realized that salaries in this field aren’t particularly high, especially early in the career.\n\nFor those already working in aerospace: what do you usually do outside your main job to compensate financially?\n\nDo you invest (stocks, ETFs, real estate), do freelance/consulting work, or have any other side projects?\n\nI’d love to hear how you’ve managed to balance your passion for aviation with financial growth.",
    "score": 58,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1om0s9t/aerospace_engineers_any_side_income_or/",
    "created_at": "2025-11-01T22:19:57.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1o6qpat",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Leaving a major aerospace prime for a startup - worth it?",
    "text": "For those who’ve left RTX, Lockheed, Boeing, etc. for a newer startup (under ~10 years old) — how was it?\n\nCurious about the culture, pace, compensation, and career growth differences. Did you find the hands-on, fast-paced environment better or more chaotic?\n\nThinking about making that move myself and would love to hear real experiences.",
    "score": 58,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1o6qpat/leaving_a_major_aerospace_prime_for_a_startup/",
    "created_at": "2025-10-14T20:25:30.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1jqt8gj",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Aerospace Engineer with MS Average Salary?",
    "text": "Hey yall, I'm graduating with my MS in AE this summer and got my first offer as a level 2 engineer. I wanted to ask what salaries people are seeing in this same situation, just so I have a better idea on how competitive my offer is (for aLevel 2 role, MS degree). I see various different things online right now. This role is in upstate NY",
    "score": 54,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1jqt8gj/aerospace_engineer_with_ms_average_salary/",
    "created_at": "2025-04-03T20:26:11.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1k0ci13",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "For those at large companies in their early career, what is the right amount to stay on a program for maximum technical development?",
    "text": "I'm an early/mid career systems engineer working on a large vehicle for the last 2.5 years, and still feel like I have a lot to learn about the vehicle. Now that I've got my feet under me, I can dive deeper into the underlying aerospace principles of the job instead of just trying to hit my deliverables. I think it would be good experience to work a variety of programs and get exposure to new tools and processes, but I also feel like switching jobs come with a steep learning curve where it's harder to go deeper technically.\n\nHow do you all approach a decision like this? Are there pros and cons to moving around vs staying on the same program for a long time?",
    "score": 54,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1k0ci13/for_those_at_large_companies_in_their_early/",
    "created_at": "2025-04-16T05:02:59.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1naxzhd",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Lockheed Martin salary range/negotiations - mechanical design entry level engineer",
    "text": "Hello,\n\n  \nI don't use Reddit very often, but I am having a hard time finding a salary range for an entry-level Mechanical Design Engineer position for MFC Dallas. I know they have different pay ranges, but I am trying to ensure that I get paid what I should be. I was looking at ranges that didn't specify entry level, and most of what I was seeing was 88-102k, so I'm figuring entry level would be a bit less than that. I was offered about 76k, but I'm really hoping for 80 minimum... I'm not sure if that is reasonable or how to go about negotiations with it. I'm a first-gen student, so all of this is very new to me. I would greatly appreciate any advice you may have!\n\n  \nThank you!",
    "score": 49,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1naxzhd/lockheed_martin_salary_rangenegotiations/",
    "created_at": "2025-09-07T16:39:44.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1i4n0ew",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "How can I grow more as an Aerospace Engineer? ",
    "text": "I am currently working as an Aerospace engineer at an Aerospace company that manufactures rockets and some defense products. Hpwever, I want to work in space systems and design satellites/ spacecraft. \n\nI started my career a year ago but somehow feel like I'm not growing as much now. What are some things I can do to grow as an engineer aside from work? Maybe some courses?\n\nI want to stay in the technical side of things and don't have interest in being a manager. I wouldn't mind being specialized in something valuable either. ",
    "score": 48,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1i4n0ew/how_can_i_grow_more_as_an_aerospace_engineer/",
    "created_at": "2025-01-19T01:36:48.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1limaq2",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Propulsion Engineering Opportunities - SoCal",
    "text": "Hiring: Senior Electric Propulsion Engineer | Los Angeles | $150K–$175K+\n\nI’m currently recruiting for a Senior Electric Propulsion Engineer with a cutting-edge company in the spacecraft and satellite sector based in Los Angeles.\n\t•\tFull-time, direct hire\n\t•\t4+ years of experience in electric propulsion\n\t•\tProficiency in CAD and GD&amp;T\n\t•\tHands-on experience with the design, build, and test of hardware\n\t•\tDegree in Mechanical, Aerospace, or related engineering field\n\t•\tSalary range is $150K–$175K, flexible depending on experience\n\nI know the market is tough right now, so even if this role isn’t the right fit, I’m happy to connect and support any engineers out there looking for their next opportunity. Just trying to be helpful — not spamming.\n\nFeel free to DM me if you’re interested or want to chat.",
    "score": 47,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1limaq2/propulsion_engineering_opportunities_socal/",
    "created_at": "2025-06-23T17:11:11.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1pv5tcj",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Aerodynamics is not worth it",
    "text": "I am an aerodynamics engineer working in the defence sector for a foreign country who has defence partnership with my country. Eventually, I want to move to some other country with my expertise as an aerodynamic engineer\n\nA senior from my company told me to not opt for aerodynamics because job market is very bad compared to structures or manufacturing etc. Most of the companies require security clearances for such job. I am a young engineer who recently graduated and I can change fields, however I chose aerospace engineering only because of my interest in aerodynamics. I have studied about aeroelasticity and loads as well but that is also heavily linked to non linear aerodynamics. \n\nI want to be part of the industry for a few years and then move towards an aerospace startup.\n\nMost of y’all would have studied aircraft design by Raymer and he also said the same thing, people study design for passion and job market is bad in his book.\n\nIs this true and do I have to let go of my passion for a successful career?",
    "score": 46,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1pv5tcj/aerodynamics_is_not_worth_it/",
    "created_at": "2025-12-25T05:04:30.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1j9s51u",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Elitism from aerospace stress analysts?",
    "text": "To summarize, I work in design engineering and I work closely with stress analysts daily. I don't know if it's because I have a few bad apples on my team, or if it's a wider issue--The analysts have been majorly disrespectful toward designers, especially recently. From the stress lead all the way down, there is an air of elitism brewing, which makes no sense to me because salary and career progression is almost identical between the two roles at my company. Comments have been made repeatedly about how designers are not equal to analysts, designers are useless without analysts, etc.\n\nIs this a common theme in the industry, or am I just unlucky to have a miserable stress lead on my current team? I'm not sure I want to be in this type of toxic environment 8 hrs/day for the next 30 years.",
    "score": 45,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1j9s51u/elitism_from_aerospace_stress_analysts/",
    "created_at": "2025-03-12T19:11:27.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1hnguvi",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Aerospace Engineering at US as a foreigner with green card, how are you doing?",
    "text": "Aerospace Engineering at US as a foreigner with employment Based green card, how are you doing? Is it greener on the other aside? Where are you guys working? Is the salary good?",
    "score": 28,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1hnguvi/aerospace_engineering_at_us_as_a_foreigner_with/",
    "created_at": "2024-12-27T15:09:26.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1lcs2v3",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Get a second Master’s (AE) or just go for the PhD?",
    "text": "Hello,\n\nIm an aerospace engineer in industry. I’m currently working part time and enrolled in Georgia Tech’s Aerospace PhD program. I have a bachelors and a Masters degree but neither are in aerospace engineering.\n\nI am completely done with the PhD course requirements, and now I am preparing for the qualifying exam. However, I don’t truly know if I will pass (though I am studying responsibly and doing my best). \n\nWhile I am done with course requirements for a PhD, I am two classes away from getting a MS in Aerospace Engineering due to the fact that MS degrees have more stringent allowances for transfer credits.\n\nShould I bother with getting a second Master’s? I am thinking of taking a real time controls systems course taught in C/C++ and a research credit.\n\nThe pros: \n- gain skills that are useful for my career and research skills (real time programming)\n- GT masters is reasonably prestigious in aerospace unlike my MS \n- can master out with my preferred course offerings after only one semester if needed and go back to full time salary (money is not a huge issue though)\n\nThe cons: \n- already have a masters and good aerospace job\n- coursework time may be better spent doing research work for my PhD or touching grass\n- if I really need to master out I can just take some other classes over the next semester or year\n\n\nWhat I’m unsure about is if research I take for credit for the masters can be applied to my PhD progress.\n\n\n\nI will discuss this with my advisor but… What do you think I should do?\n",
    "score": 21,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1lcs2v3/get_a_second_masters_ae_or_just_go_for_the_phd/",
    "created_at": "2025-06-16T12:56:07.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1omjjub",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Aerospace engineer or money?",
    "text": "Hello everyone i am Master aerospace engineer student from Portugal. And i don't know if i will keep in this field... In my first degree i do a bachelor in civil engineering to work after with my father's company but 2/3 years ago i lost my control with my passion about airplanes... So i went the place i am right now, to the best master in my country in aerospace engineer because i really wanna be good in this. \nBut now, while im checking the salary of an aerospace engineer in Europe like for the bests and 10+ experience a 6000€/month net i feel really bad because in my fathers company i can start with more salary and with side work doing houses just to sell or rent them after construction i can make a lot of money...  I don't have a really nice perspective for aerospace engineer career to make me have a nice financial profile, so here im looking for opinions of you guys because i REALLY REALLY LOVE AERONAUTICAL FIELD and i dont wanna regret after this. Im trying to make a plan to work in my father's company and after when I have 30's finish my master degree in aerospace engineer. But please tel me your opinions guys.\n\nThank you!! ",
    "score": 19,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1omjjub/aerospace_engineer_or_money/",
    "created_at": "2025-11-02T15:03:17.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1n8vegw",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "Salary range for Level 3 Mechanical/Design Engineer in Fort Worth?",
    "text": "\nHi everyone,\n\nI’m curious what a typical salary range looks like for a Level 3 Mechanical/Design Engineer at Lockheed Martin in Fort Worth.\n\nBackground:\n*About 4 years of mechanical design/engineering experience, but not related to aerospace/aeronautics \n*Master’s degree in Mechanical Engineering\n*PE license\n*Active DOE Secret clearance\n*Currently earning $125K base in a medium cost-of-living area\n\nI’ve seen ranges online from around $100K to $130K+, but I’d like to hear from folks who have gone through the process recently. What’s a fair expectation for Level 3 in Fort Worth?\n\nThanks!",
    "score": 19,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1n8vegw/salary_range_for_level_3_mechanicaldesign/",
    "created_at": "2025-09-05T04:07:00.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1kcixxa",
    "subreddit": "AerospaceEngineering",
    "soc_codes": [
      "17-2011"
    ],
    "title": "How much more should you expect to make as a subcontractor?",
    "text": "I work for a subcontracting company for one of the big defense companies. My position is indefinite-length, full-time and long-term funded. As a subcontractor, I don’t get PTO or health insurance. When I took this job, I factored this in to my overall salary. However, there are other intangible downsides to working as a subcontractor, such as being the first to be let go when the funding dries up, and being easier to terminate in general. \n\nTaking this all into account, what’s a common % increase a subcontractor can expect to make vs. a direct hire?",
    "score": 10,
    "url": "https://reddit.com/r/AerospaceEngineering/comments/1kcixxa/how_much_more_should_you_expect_to_make_as_a/",
    "created_at": "2025-05-01T20:36:10.000Z",
    "num_comments": 17
  }
]