[
  {
    "id": "reddit-1mdrtbb",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Today, I was a hero",
    "text": "A family came in with their 2mo.  And they were very hesitant about vaccines.  \"Which ones are really important?\"\n\nSo I went through each disease for which the child would be vaccinated today.\n\n* I told them about diphtheria and the 30% mortality rate, how diphtheria toxin is one of the most toxic substances known, as a single molecule can kill a cell.  I told them about how this disease use to terrify communities.\n* They'd already heard of tetanus.  Everyone has heard of tetanus.\n* I told them about pertussis and the baby I saw who coughed and coughed and coughed and coughed and coughed...until he went into laryngospasm.  We did everything we could.  I will never forget his mother throwing herself at our feet begging us to not say what we were going to say.  I let that family see the tears playing in my eyes as I described the memory.  They needed to know that I am doing this *because I fucking care.* Not because of some quality metric.  \n* We'd already discussed how hepatitis B is spread by nonsexual transmission and how in the prevaccine era, as many as 65% of infants born to HBV positive *fathers* had HBV by the tme they were a year old.  We talked about how that is a life sentence before age 1.  \n* They know about polio.  \n* I talked about the baby I watched die of pneumococcal sepsis.  Another mother at our feet.  Another family destroyed by a microbe.\n* I described a cricoidotomy in graphic detail.  \n* I was admitted for rotavirus in February of 1979.  I still have the hospital bill for $20.  My mother told me about how sick I was.  And 25 years later, I became a resident and I saw babies with rotavirus.  You could hear the diarrhea from across the emergency department.  We had to do our own IVs at the NYC hospital.  The babies were just so sick and all we could do was keep them hydrated and wait for them to recover.  And then in the fall of 2006 the rotavirus vaccine came out.  And in February of 2008 I was the senior on the floor and... there weren't any rotavirus kids.  It was just gone.\n\nAnd I asked that mother, now that she'd asked me which vaccines were important, I was going to turn the questions around.  Which ones did *she* think were important?\n\nThat baby got every recommended immunization today.   I won.  RFJ Jr. lost.  The parents won; that mother won't be throwing herself at my feet. \n\nMost importantly, the baby won.\n\n\\-PGY-21",
    "score": 4328,
    "url": "https://reddit.com/r/medicine/comments/1mdrtbb/today_i_was_a_hero/",
    "created_at": "2025-07-31T04:09:32.000Z",
    "num_comments": 156
  },
  {
    "id": "reddit-1mdrwxj",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Today, I was a hero",
    "text": "A family came in with their 2mo. And they were very hesitant about vaccines. \"Which ones are really important?\"\n\nSo I went through each disease for which the child would be vaccinated today.\n\n* I told them about diphtheria and the 30% mortality rate, how diphtheria toxin is one of the most toxic substances known, as a single molecule can kill a cell. I told them about how this disease use to terrify communities.\n* They'd already heard of tetanus. Everyone has heard of tetanus.\n* I told them about pertussis and the baby I saw who coughed and coughed and coughed and coughed and coughed...until he went into laryngospasm. We did everything we could. I will never forget his mother throwing herself at our feet begging us to not say what we were going to say. I let that family see the tears playing in my eyes as I described the memory. They needed to know that I am doing this *because I fucking care.* Not because of some quality metric.\n* We'd already discussed how hepatitis B is spread by nonsexual transmission and how in the prevaccine era, as many as 65% of infants born to HBV positive *fathers* had HBV by the tme they were a year old. We talked about how that is a life sentence before age 1.\n* They know about polio.\n* I talked about the baby I watched die of pneumococcal sepsis. Another mother at our feet. Another family destroyed by a microbe.\n* I described a cricoidotomy in graphic detail.\n* I was admitted for rotavirus in February of 1979. I still have the hospital bill for $20. My mother told me about how sick I was. And 25 years later, I became a resident and I saw babies with rotavirus. You could hear the diarrhea from across the emergency department. We had to do our own IVs at the NYC hospital. The babies were just so sick and all we could do was keep them hydrated and wait for them to recover. And then in the fall of 2006 the rotavirus vaccine came out. And in February of 2008 I was the senior on the floor and... there weren't any rotavirus kids. It was just gone.\n\nAnd I asked that mother, now that she'd asked me which vaccines were important, I was going to turn the question around. Which ones did *she* think were important?\n\nThat baby got every recommended immunization today. I won. RFJ Jr. lost. The parents won; that mother won't be throwing herself at my feet.\n\nMost importantly, the baby won.\n\n\\-PGY-21",
    "score": 3849,
    "url": "https://reddit.com/r/Residency/comments/1mdrwxj/today_i_was_a_hero/",
    "created_at": "2025-07-31T04:14:53.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1ofuc3y",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "My patient made me feel ashamed",
    "text": "I’m a prelim internal medicine resident right now, just trying to make it through the year. It’s been rough. Long days, nonstop stress, and I’m basically in survival mode most of the time.\n\nyesterday, I was doing quick pre-rounds, I went to check on one of my patients, an older Chinese woman with metastatic endometrial cancer. Cancer has spread to her bones and maybe her liver. We’re doing all the scans and workup, but realistically there’s not much that can be done.\n\nShe started speaking to me in Mandarin. I couldn’t understand her, but she looked like she really wanted to ask something. I usually go back after rounds for updates and conversations with pt and their families. And I still had more patients to see, so I was honestly kind of annoyed, but I called the interpreter line anyway. It takes a few minutes to get someone on, which feels like forever during pre rounds.\n\nFinally the interpreter came on, and I asked what she wanted to say. I must have sounded hurried and annoyed. I was expecting something about pain or her treatment. Instead, through the interpreter, she asked me,\n\n&gt;“Doctor, you’re already back. Were you able to get some rest? Did you eat before work? Are you doing okay?”\n\nI just stood there. This woman is dying, and she was worried about *me*.\n\nI felt awful for being irritated. Here I was, thinking she wanted to ask for something, but she just wanted to make sure I was doing alright. It hit me hard.\n\nI got so caught up doing tasks on a list. I forgot that I am treating people who also want human connections and regular conversations. I felt ashamed.",
    "score": 3772,
    "url": "https://reddit.com/r/Residency/comments/1ofuc3y/my_patient_made_me_feel_ashamed/",
    "created_at": "2025-10-25T15:26:27.000Z",
    "num_comments": 116
  },
  {
    "id": "reddit-1najb9w",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "My wife died and I don’t know what to do.",
    "text": "My wife and I had twins last March during my first year of residency. It was unplanned but we figured hey, there’s going to have two of us so my wife can handle most of the childcare and I’ll step in more once I’m done with residency (I’m oversimplifying here). \n\nFlash forward to today. They’re barely a year old. She dies suddenly on a run after being hit by a teenager who was texting and driving, going 40 in a neighborhood. \n\nI’m a second year peds resident. I get, at most, one day off a week where I do nothing but sleep because the day before I’m on call for 24 hours (if I’m lucky but probably not). I work a week of nights once a month. \n\nI cannot take care of two babies and balance this schedule, and I sure as hell cannot pay for this much childcare for two people. I don’t know what to do. \n\nOur parents can’t help because they’re estranged and mine live in a different country. \n\nI want to drop but if I do I’ll be trapped in student loan debt for the rest of my life. \n\nI need help. Any advice appreciated. \n\nUPDATE: My solution as of now is for me to take an LOA while I get shit sorted. Maybe I’ll drop afterwards, maybe I won’t. I honestly don’t give two shits anymore. \n\nThank you to everyone who has offered advice. ",
    "score": 3582,
    "url": "https://reddit.com/r/Residency/comments/1najb9w/my_wife_died_and_i_dont_know_what_to_do/",
    "created_at": "2025-09-07T03:53:00.000Z",
    "num_comments": 622
  },
  {
    "id": "reddit-1kmwart",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Brain dead woman in Georgia kept on ventilator to incubate 9 week pregnancy. Family told they have no choice due to Heartbeat bill",
    "text": "https://www.11alive.com/article/news/local/family-claims-atlanta-nurse-declared-brain-dead-kept-alive-pregnancy/85-eac5257d-a329-4dd7-b80f-5c0ecd30225a\n\n&gt; The family of a 30-year-old metro Atlanta mother and nurse said she was declared brain dead more than 90 days ago — but is still being kept alive because she’s pregnant.\nAdriana Smith, a registered nurse at Emory University Hospital, was nearly nine weeks pregnant in early February when she started experiencing intense headaches. \n\n&gt;According to her mother, April Newkirk, Smith sought treatment at Northside Hospital but was released after being given medication. Smith was declared brain dead. Her family has been by her side every day since, including her young son, who they said still believes his mother is just sleeping. She’s been breathing through machines for more than 90 days,” Newkirk said. “It’s torture for me. I see my daughter breathing, but she’s not there. And her son—I bring him to see her.” \n\n&gt;Newkirk said doctors told the family the baby has fluid on the brain and they're not sure how much fluid. They're concerned about his health.“She’s pregnant with my grandson. But he may be blind, may not be able to walk, may not survive once he’s born,” Newkirk said. \n\n&gt;Under Georgia’s heartbeat law, abortion is banned once cardiac activity is detected — typically around six weeks into pregnancy.  The law includes limited exceptions for rape, incest, or if the mother’s life is in danger. But in Adriana’s case, the law created a legal gray area.\n \n&gt;Because she is brain dead — no longer considered at risk herself — her medical team is legally required to maintain life support until the fetus reaches viability. The family said doctors told them they are not legally allowed to consider other options.\n\nNot mentioned in this article but she was 9 weeks pregnant when she died. Insane to me that apparently the only legal option to turn her into a zombie incubator for 6-7 months. ",
    "score": 3446,
    "url": "https://reddit.com/r/medicine/comments/1kmwart/brain_dead_woman_in_georgia_kept_on_ventilator_to/",
    "created_at": "2025-05-15T01:36:01.000Z",
    "num_comments": 639
  },
  {
    "id": "reddit-1hm9ylp",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Name and Shame Mayo Residency Program",
    "text": "Mayo Clinic, an institution that prides itself on being one of the best in the world, is paying midlevel providers in training more than doctors in training. \n\nPA/NP fellow: 77,000 \n\nPGY 1- 72,565\n\nPGY 2- 75,093\n\nPGY 3-78,199\n\nPhysicians are responsible for the most complex patient cases and are expected to know more than anyone else in the room. They sacrifice years of their lives (relationships, hobbies, kids, home ownership), and for many, go into debt to pursue this path. And yet, despite all of this, Mayo has decided that midlevels—whose training is a fraction of that of a doctor—deserve a bigger paycheck. This is an insult to every doctor.\n\nMayo, you should know better.\n\nYou position yourself as a leader in healthcare, but you’re sending a clear message: the years of sacrifice, the intellectual rigor, the emotional toll that doctors in training go through means less than the financial convenience of training midlevels. This kind of pay discrepancy devalues the medical profession, and honestly, it’s downright disrespectful.\n\nThis is more than just a payroll issue; it’s a values issue. It’s about recognizing the true worth of highly trained professionals and investing in them accordingly. Mayo should be setting the example, but instead, they’re perpetuating a system that undervalues the most rigorous path in healthcare.\n\nAdvocating for yourself is just as important as advocating for the patient.\n\nUpvote101Downvote6Go to commentsShare",
    "score": 2660,
    "url": "https://reddit.com/r/Residency/comments/1hm9ylp/name_and_shame_mayo_residency_program/",
    "created_at": "2024-12-25T21:56:34.000Z",
    "num_comments": 390
  },
  {
    "id": "reddit-1jluhlj",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Had my first baby after the mother attempted an abortion at home due to my state’s abortion ban",
    "text": "I have been a NICU Respiratory Therapist for almost 10 years. In the largest NICU in my state. I have seen a lot of sad cases and infant death but I’m struggling quite a bit with this one. More than I have in a long time. My state like many others recently made abortion illegal with few exceptions. So I knew this day was going to come but nothing prepared me for just how bad this was. The baby had a severe case of a horrible extremely painful and gruesome fetal anomaly which I won’t say what it was. The anomaly isn’t always fatal so it doesn’t fall under one of the exceptions in the state for fatal anomalies. But with how horrible of an anomaly this was the mother tried to do the abortion at home. I don’t know much about the mother’s situation and I wouldn’t share anything if I did. But my state is at the very bottom in the country for access to prenatal care. So I would guess that she wasn’t made aware of the disease until late in the pregnancy. So when she attempted the abortion and had excessive blood loss and came to the maternity ED, the baby was far enough along we are required to resuscitate. \n\nEven though the baby was not wanted, I still had to resuscitate. I had to get an airway and secure it and again in my 10 years experience, this was the most grisly thing I have ever done. And for what, the baby didn’t even live to 24 hours old. It was horrifying. \n\nIt’s been weeks now and I can’t get it out of my head. Due to the abortion ban, I knew something like this would happen but never like this. My heart is broken for that mom. My heart is broken for that baby and how much pain it must have been in. But the biggest feeling I have is anger for all those people that voted for it. I have been talking about and showing google pictures of the disease to everyone I know so they too can know the gravity of what this abortion ban means. Even though there are exceptions in the law, it doesn’t matter because either our access is so low that women are not able to get abortions even when they are suppose to be allowed to or they have a technically not 100% fatal disease and so are not except. This is so inhumane, I don’t know how I’m going to carry on doing what I do. Is this going to be my new normal? I have always had to deal with patients that I thought to myself they should have been aborted. But the parents made the decision to try anyway. But for this baby NO ONE I mean NO ONE in that deliver room wanted this baby. Everyone in the room from the mom, the dad, to the neonatologist did not want to have this baby born and have to resuscitate but some law maker and the people that voted for it that are not even in the fucking room or in the same universe of understanding are forcing us to. Im sitting here sick to my stomach about what happened and for the future of what this means and I don’t know if I can carry on with this. ",
    "score": 2181,
    "url": "https://reddit.com/r/medicine/comments/1jluhlj/had_my_first_baby_after_the_mother_attempted_an/",
    "created_at": "2025-03-28T12:59:54.000Z",
    "num_comments": 187
  },
  {
    "id": "reddit-1n8hc0s",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "20+ medical organizations issued a joint statement yesterday asking RKF Jr to resign as HHS director.",
    "text": " [https://www.idsociety.org/news--publications-new/articles/2025/joint-statement-calling-for-secretary-kennedy-resignation/](https://www.idsociety.org/news--publications-new/articles/2025/joint-statement-calling-for-secretary-kennedy-resignation/) \n\nThis follows after a public call for resignation from 8 former CDC directors, AAP and ACOG defying CDC vaccination recommendations, and 1000 HHS employees signing a petition for his resignation, risking their jobs. \n\n At some point, I believe this will start to turn more public opinion against RFK - I know it's out there, but it's mostly silent. (and reverse the blessing from the White House, *but we have to keep the heat up.* \n\nMeddit, we are half a million strong. Let's all push our professional organizations to make more public statements against RFK. A large petition signed by a good portion of us won't work since there is no way to check professional credentials (and then the MAHA groupies and anti-vaxxers would just easily organize match or exceed the numbers easily and falsely claim they're professionals too).\n\n Unless any of you can think of other ways to show our professional numbers are against him? \n\nThe AMA is too wimpy to help us. I'm a consultant to our state's Department of Health, and they're too terrified that their funding will be cut to say or do anything against HHS. Ditto School of Medicine administrations. ",
    "score": 2082,
    "url": "https://reddit.com/r/medicine/comments/1n8hc0s/20_medical_organizations_issued_a_joint_statement/",
    "created_at": "2025-09-04T17:58:52.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1m6grvg",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "The shift no one warns you about.",
    "text": "It wasn’t the code that broke me.\n\nNot the chest compressions.\nNot the child who didn’t make it.\nNot even the silence when we stopped.\n\nIt was what came after.\n\nThe sound of gloves snapping off.\nThe way we all avoided eye contact.\nThe nurse quietly changing the sheets.\nSomeone laughing at a meme in the next bay.\n\nThe return to normal.\n\nThat’s what broke me.\n\nHow a room resets while your heart doesn’t.\n\nWe never talk about it.\nThat we go from death to documenting vitals\nin thirty seconds.\n\nThat we carry someone’s final moment\nin our chest while answering a question about potassium levels.\n\nI don’t need therapy today.\nI just needed to say it aloud:\n\nWe don’t need to be okay.\nNot all the time.\nNot after every shift.\nNot after every goodbye.\n\nThat is also medicine.\n\n",
    "score": 2052,
    "url": "https://reddit.com/r/Residency/comments/1m6grvg/the_shift_no_one_warns_you_about/",
    "created_at": "2025-07-22T15:14:29.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1okusjg",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Today is one of the best days to be a pediatrician.",
    "text": "Come on, IM docs, when was the last time you got to do an annual physical on Mario followed by a princess followed by Optimus prime?\n\n-PGY-21",
    "score": 1944,
    "url": "https://reddit.com/r/medicine/comments/1okusjg/today_is_one_of_the_best_days_to_be_a_pediatrician/",
    "created_at": "2025-10-31T13:35:51.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1o9a12t",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Remember you are not as dumb as this NP",
    "text": "It happened y'all. I am an ID fellow at a mid/large academic center and got asked by one of the NPs on a surgical service \"Is this staph in the blood a contaminant\". **Y'all it was Staph Aureus**.... as in **Staph Aureus Bacteremia** which has a **conservatively 10-40%, 30-day all cause mortality.** \n\nThis is a person making nearly double our salary and who has \"the brain of a doctor and heart of a nurse\". Though in this case more like \"the brain of a donkey and heart of a flea\". ",
    "score": 1941,
    "url": "https://reddit.com/r/Residency/comments/1o9a12t/remember_you_are_not_as_dumb_as_this_np/",
    "created_at": "2025-10-17T19:01:18.000Z",
    "num_comments": 240
  },
  {
    "id": "reddit-1ie3zgp",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "15,000 doctors signed a letter protesting RFK, Jr's confirmation - but Tonight is the final step",
    "text": "Just wanted to let you know that the Chief of Staff for the swing vote senator's email is an easy google search, since it appears Senator Bill Cassidy / Dr. Bill Cassidy's website is down. \n\nSearch for the name first (bill cassidy chief of staff), then once you have the name, add the name and \"email\" to your search string\n  \nWhatever you write, for or against, include your credentials if you are NOT a Louisiana state resident.  \n  \nInclude your address if you are.\n\nEDIT: another person has posted the email address in the comments, I was more concerned this post wouldn’t last had I done that. Thx\n\nPS: follow AltCDC on BlueSky, and if you have urgent health updates to share try our friends up north https://www.canada.ca/en/public-health/corporate/contact-us.html",
    "score": 1865,
    "url": "https://reddit.com/r/medicine/comments/1ie3zgp/15000_doctors_signed_a_letter_protesting_rfk_jrs/",
    "created_at": "2025-01-31T01:59:11.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1lxqpn2",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Medicine has changed",
    "text": "We were sold a different dream.\n\nMany of us grew up watching physicians who were respected, independent, upper middle class at worst. Hard work, yes, but with autonomy, purpose, and upward mobility.\n\nThat world doesn’t exist anymore.\n\nNow? We’re shift workers with doctorates. Productivity quotas. Prior auths. Burnout rates through the roof. Limited say in staffing.\n\nWe train a decade to become managers in hospital systems that see us as “providers.”\n\nAnd for what? Shrinking pay. Growing debt. Less control. Less time. Less meaning.\n\nThis isn’t just about money. It’s about what we thought this profession stood for.\n\nMedicine has changed and a lot of us are quietly grieving what it’s become.",
    "score": 1838,
    "url": "https://reddit.com/r/Residency/comments/1lxqpn2/medicine_has_changed/",
    "created_at": "2025-07-12T03:41:58.000Z",
    "num_comments": 238
  },
  {
    "id": "reddit-1jgxqzm",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Update on the attending who lied about my attendance",
    "text": "So today I go in again to the same site, and another attending is there.\n\nHe introduces himself as the medical director of the ER there. I said ok bet. I then work my shift silent about what happened.\n\nAs I get along in the day, he jokes about just letting me run the ED while he sleeps since I’ll be graduating in a few months anyway. \n\nWell I tell him in response to that the last guy on Monday didn’t think so. He let me go at a certain time and then called my coordinator the next day to say I left without permission….\n\nHe’s taken aback by this like he can’t believe what he’s hearing. He then proceeds to look at the ER board schedule and asks me who the attending was. I say his name and he says, “that makes sense now. The locums we hire are usually people with serious personality problems that can’t find jobs anywhere else.” We’re a critical access place so they hire these guys because no one else wants to come work there. \n\nHe then says he’ll call my PD and tell him that there was a big misunderstanding and that I was doing stellar on rotation. \n\nSo all in all it worked out! \n",
    "score": 1817,
    "url": "https://reddit.com/r/Residency/comments/1jgxqzm/update_on_the_attending_who_lied_about_my/",
    "created_at": "2025-03-22T01:57:26.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1ml1488",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "We are about to be gaslit so hard by the government",
    "text": "RFK just posted on his X: “medical decisions should be made based on one thing: the wellbeing of the person-never on a financial bonus or a government mandate. Doctors deserve the freedom to use their training, follow the science, and speak the truth without fear of punishment”\n\nNow in a vacuum, this message is 100% true. We should be able to make the decisions without outside influence and interference. However, this administration has bastardized evidence-based medicine and what it constitutes as “science” and “truth”. All of a sudden, decades of science will go down the drain and pseudoscience/quackery will be more common.",
    "score": 1713,
    "url": "https://reddit.com/r/medicine/comments/1ml1488/we_are_about_to_be_gaslit_so_hard_by_the/",
    "created_at": "2025-08-08T17:15:22.000Z",
    "num_comments": 142
  },
  {
    "id": "reddit-1pgosn4",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "12/4/2025 MMWR: Another organ donor has transmitted rabies to a recipient.",
    "text": "[https://www.cdc.gov/mmwr/volumes/74/wr/mm7439a1.htm](https://www.cdc.gov/mmwr/volumes/74/wr/mm7439a1.htm) \n\nTLDR: A 2024 kidney recipient died of acute encephalopathy, determined to be rabies. The only other recipients received corneal tissues. \n\nThe donor had been scratched by an aggressive skunk 6 weeks prior, but this Hx apparently wasn’t volunteered to his medical team. \n\nStill, he had a 2-day history of acute encephalopathy: dysphagia, inability to walk, stiff neck, confusion, and hallucinations. He was then found unresponsive at home and transported to hospital; cardiac arrest was presumed. He died 5 days later. No mention of workup of the neuro symptoms or confirmation of presumed cardiac disease.\n\nMy question for all of you:   HOW IN THE HELL did a man with an acute onset of encephalopathy of unconfirmed origin become an organ donor? ",
    "score": 1710,
    "url": "https://reddit.com/r/medicine/comments/1pgosn4/1242025_mmwr_another_organ_donor_has_transmitted/",
    "created_at": "2025-12-07T17:58:42.000Z",
    "num_comments": 175
  },
  {
    "id": "reddit-1ifljd4",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Report: CDC now forbidding publications from its scientists from containing any reference to gender or LGBT individuals, and is requiring retraction of any accepted but not yet published manuscripts which violate this",
    "text": "Just when you think this administration couldn't get any more horrible or absurd when it comes to science &amp; healthcare, Jeremy Faust has just posted the following claim over on his substack, Inside Medicine (https://insidemedicine.substack.com/p/breaking-news-cdc-orders-mass-retraction?r=5p3cr&amp;utm_campaign=post&amp;utm_medium=web&amp;triedRedirect=true): \n\n&gt;\"...The CDC has instructed its scientists to retract or pause the publication of any research manuscript being considered by any medical or scientific journal, not merely its own internal periodicals, Inside Medicine has learned. The move aims to ensure that no “forbidden terms” appear in the work. The policy includes manuscripts that are in the revision stages at journal (but not officially accepted) and those already accepted for publication but not yet live.\n\n&gt;In the order, CDC researchers were instructed to remove references to or mentions of a list of forbidden terms: “Gender, transgender, pregnant person, pregnant people, LGBT, transsexual, non-binary, nonbinary, assigned male at birth, assigned female at birth, biologically male, biologically female,” according to an email sent to CDC employees.\"\n\nHow long until Trump's NIH scrubs papers or entire journals from PubMed because they contradict his \"anti-woke\" agenda?",
    "score": 1671,
    "url": "https://reddit.com/r/medicine/comments/1ifljd4/report_cdc_now_forbidding_publications_from_its/",
    "created_at": "2025-02-02T01:08:39.000Z",
    "num_comments": 257
  },
  {
    "id": "reddit-1hozjwk",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "The fact that family members are hitting me, a new attending, up for money, after not even a “how are you?” when I was in training is infuriating. ",
    "text": "Title. The holidays mean I’m seeing people I haven’t seen in like over a year. I thought it was weird when some extended family members were like “so you’re a *real* doctor now right?” And I don’t bother explaining more than “yeah I’m done with training”. Then two days later I get a text saying “hey we really want to buy a house but just need a little help with the down payment. Could you help us out?  There’s a home cooked meal in it for you :)” \n\nLike, kindly stfu. I could’ve used a home cooked meal as short as six months ago when I was a resident in a VHCOL area but was paid minimum wage but you didn’t bother to ask if I was even alive. \n\n/vent ",
    "score": 1629,
    "url": "https://reddit.com/r/Residency/comments/1hozjwk/the_fact_that_family_members_are_hitting_me_a_new/",
    "created_at": "2024-12-29T16:29:08.000Z",
    "num_comments": 165
  },
  {
    "id": "reddit-1njte4c",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "This is hell",
    "text": "Husband is in surgical residency and has yet to work a week under 80 hours I stg. We have young kids at home and i literally don’t understand how anyone does this. I knew pretty much what I was getting into but like… this is insane and unsafe and a joke. ",
    "score": 1590,
    "url": "https://reddit.com/r/Residency/comments/1njte4c/this_is_hell/",
    "created_at": "2025-09-17T23:59:59.000Z",
    "num_comments": 293
  },
  {
    "id": "reddit-1joomuv",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Chiropractor causes dissection. Radiologist and ER doc sued. Appeals court upholds $75 million dollars verdict.",
    "text": "[https://radiologybusiness.com/topics/healthcare-management/legal-news/appeals-court-upholds-landmark-75m-verdict-against-radiologist-er-doc](https://radiologybusiness.com/topics/healthcare-management/legal-news/appeals-court-upholds-landmark-75m-verdict-against-radiologist-er-doc)\n\nAn appeals court recently upheld a “landmark” $75 million verdict against a radiologist and emergency physician, plaintiff attorneys announced Tuesday. \n\nThe case dates back nearly a decade, to October 2015, when Jonathan Buckelew collapsed while receiving chiropractic care for his neck. He was transported to a hospital leading to a series of negligent events, *Radiology Business* reported [previously](http://radiologybusiness.com/topics/patient-care/75m-malpractice-verdict-splits-fault-between-er-doctor-radiologist).\n\nEmergency imaging showed Buckelew, 32 at the time, suffered a brainstem stroke—a diagnosis that should have prompted immediate treatment. However, his attorneys argued that the care team failed to reach a definitive diagnosis until the patient’s second day in the hospital. During the protracted wait, Buckelew’s brain was so severely damaged that he is now permanently stricken with “[locked-in syndrome](https://rarediseases.org/rare-diseases/locked-in-syndrome/#:~:text=Locked%2Din%20syndrome%20is%20a,the%20movements%20of%20the%20eyes.),” rendering him unable to feel or control any voluntary muscle groups except those of his eyes.\n\nA jury sided with the man in 2022, awarding $46 million in civil damages and $29 million in medical expenses. About 60% of the sum was pinned on the EM physician, and 40% on the radiologist, while other clinicians were cleared. \n\n**Matthew Womack, MD, an emergency doc at North Fulton Hospital at the time, fought the decision.** But a Georgia Court of Appeals affirmed the $40 million ruling against him on March 10. **Plaintiff attorneys believe this is the largest ER malpractice verdict in the state’s history.** \n\n“This decision is a victory not just for Jonathan Buckelew and his family, but for patient safety in Georgia,” Lloyd Bell, founding partner of [Bell Law Firm](https://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.belllawfirm.com%2F&amp;esheet=54228022&amp;newsitemid=20250325615172&amp;lan=en-US&amp;anchor=Bell+Law+Firm&amp;index=3&amp;md5=271bf87a7c29a641c2c592d0390104e2) and co-counsel in the case, said in a [statement](https://www.businesswire.com/news/home/20250325615172/en/Georgia-Court-of-Appeals-Affirms-Record-Verdict-in-Locked-in-Syndrome-Case) shared March 25. “The court of appeals has made it clear that emergency room physicians must be held accountable when their actions—or inaction—lead to catastrophic harm.”\n\nBell Law emphasized that the ruling “upholds this verdict in full.” According to court [documents](http://belllawfirm.com/wp-content/uploads/2025/03/25-03-10-Opinion.pdf), radiologist James Waldschmidt, MD, also appealed but later filed a notice that Buckelew’s claims against him “had been resolved,” and he withdrew. \n\nWaldschmidt’s attorney had previously pointed the jury to evidence showing the radiologist read Buckelew’s imaging “with an eye to answering the specific question” of whether one of his arteries was torn. The attorney had compared a stroke to a forest fire.\n\n“\\[Waldschmidt’s\\] job is not to go down there and put \\[the fire\\] out,” the radiologist’s attorney said previously. “His job is to identify the smoke, and he did that.”\n\nA 10-year case. Since this was lost on appeal I assume this means bankruptcy and asset loss for the ER doc. Name dragged through the mud online. I wouldn't be surprised if he was experiencing SI. I know I would.\n\nWhat a f\\*\\*\\*\\*\\*g clown world.\n\nGeorgia has no cap on non-economic damages. Think about that when picking a state to practice medicine in.",
    "score": 1581,
    "url": "https://reddit.com/r/medicine/comments/1joomuv/chiropractor_causes_dissection_radiologist_and_er/",
    "created_at": "2025-04-01T06:00:02.000Z",
    "num_comments": 292
  },
  {
    "id": "reddit-1mmkdz7",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Pt's son is an anesthesiology resident in another hospital and he pimped me in front of his family bedside",
    "text": "I’m still trying to process what happened.\n\nI’m a prelim IM intern, and yesterday I was on call covering 40 patients. One new admission came in for a UTI. According to the note, the patient’s son is an anesthesiology resident at another hospital. The nurse told me he wanted to speak with me. I figured it would be a straightforward conversation since he’s a fellow physician.\n\nThe moment I stepped into the room, though, he started aggressively pimping me. asking what organisms ceftriaxone covers, what organisms doxycycline covers, and the differences in empiric treatments for complicated vs. uncomplicated UTIs. My mind stalled for a second, and I found myself answering his questions before realizing I was caught in some kind of power trip.\n\nThen he asked me to list every single medication his parent received in the ED, down to the exact times they were given. It became clear he wasn’t trying to collaborate. he was trying to either embarrass me or assert dominance in front of his family.\n\nI eventually just said, “If you have any concerns, please let me know and I’ll share them with the team.” At that point, he switched to saying he thought ceftriaxone should be escalated to Zosyn. I told him I’d pass that along to the team.\n\nThe way he was pimping was so unnecessarily aggressive that I’m still unsettled by it. Honestly, I just feel bad for the junior residents in his own program. ",
    "score": 1565,
    "url": "https://reddit.com/r/Residency/comments/1mmkdz7/pts_son_is_an_anesthesiology_resident_in_another/",
    "created_at": "2025-08-10T14:44:52.000Z",
    "num_comments": 202
  },
  {
    "id": "reddit-1is0uob",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "This fucking sucks.",
    "text": "Jfc I knew intern year was going to be brutal but I didn’t know how bad it would be. They warn you about the hours, the exhaustion, the imposter syndrome. They say you’ll question your career choice at least once weekly. They tell you to sleep when you can and eat when you can.\n\nBut no one tells you what it’s like to see a child with injuries that shouldn’t happen outside of car accidents. No one prepares you for the way your stomach knots when you hear a three-year-old say, “I was bad,” as an explanation for why they have more broken bones than some grown adults in ski accidents. No one warns you that the worst part isn’t even the injuries but the way some of these kids accept their pain as normal.\n\nThen comes the CPS call and the documentation. The parents act concerned, shocked, offended that you’d even fucking suspect them. And you have to keep your face neutral through all of it, even though part of you wants to scream at them, even though another part wants to look away because the whole situation is unbearable.\n\nI go home and tell myself I won’t think about it. That I’ll leave it at the hospital. \n\nBut I can’t. \n\nI get off work and cry alone in my car. It took me 45 goddamn minutes to leave that fucking parking lot today because of one fucking kid. ",
    "score": 1561,
    "url": "https://reddit.com/r/Residency/comments/1is0uob/this_fucking_sucks/",
    "created_at": "2025-02-18T01:28:47.000Z",
    "num_comments": 107
  },
  {
    "id": "reddit-1ltw1nb",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Hey floor residents, Especially on nights...",
    "text": "This is your friendly ICU attending. Just a reminder that I am here too. If you are worried about a pt, and maybe your attending is... Not available... or scary... and you want to make sure you are doing the right thing, vs should the pt be in the ICU? Just call me. You can preface the call with something like \"hey this isn't a consult or a transfer request, but can I run something past you?\" I would much rather we have a brief chat than to end up getting a call when the pt is much worse and should have already been in the unit. This also helps me help you keep the transfers that can stay on the floor on the floor. \n\nDepending on where you are, this might be call to the ICU attending, or the PA, or the Fellow, etc. But still, calling with a question if you need help is OKAY. (Yeah obviously ask your senior/attending first when you can, but we get thats not always an option, or easy)\n\nAlso about nights in small hospitals: You may feel alone. You are NEVER alone. If a patient is crashing, there is an ER doc you can call. There is someone in the ICU you can call. The ICU charge RN is great resource. Don't feel alone. Feel comfortable asking for help.",
    "score": 1550,
    "url": "https://reddit.com/r/Residency/comments/1ltw1nb/hey_floor_residents_especially_on_nights/",
    "created_at": "2025-07-07T14:45:31.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1nkb8f9",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "My rural patients are so much more insufferable than my urban ones",
    "text": "I work 4 days a week in a large city and commute 1 day a week quite a ways out to a rural community. I have found that this 1 day a week is quite a bit worse in terms of patients' decorum. My rate of \"firing\" patients for being belligerent towards staff, being overly demanding and entitled, blaming me for things outside my control (insurance coverages, their co-pay amounts) to be drastically higher at this location than any of my city folks. When I've discussed this with other physicians, the sentiment seems to be the same even in different specialties in different rural areas.\n\nObviously these rural communities have shortages of providers and need healthcare access, but perhaps it's not solely due to access to nice restaurants, good schools, and nice views. Higher pay is often tried to use to incentivize working in these locations, but is it worth it?",
    "score": 1530,
    "url": "https://reddit.com/r/medicine/comments/1nkb8f9/my_rural_patients_are_so_much_more_insufferable/",
    "created_at": "2025-09-18T15:22:24.000Z",
    "num_comments": 307
  },
  {
    "id": "reddit-1jbjp5b",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "I’ve never seen someone so horribly mismanaged before…",
    "text": "Patient referred to psych before establishing with me by old pcp and of course gets scheduled with the NP. \n\nHistory of bipolar and seizure disorder. Reported to this provider that she had periods of feeling depressed and feeling really energetic. \n\nNP decides to start Wellbutrin for depression at the highest dose immediately. \nAlso puts patient on 3 different SSRIs for “synergistic effect…” \n\nPatient was also started on trazodone for sleep at the highest dose immediately(notice the trend)? \n\nPresents to clinic complaining of feeling hot and sweaty, anxious, tachycardic, with hyperreflexia  and tells me she feels like she’s going to have a seizure…\nImmediately send her to the ED for evaluation \n\n\nI just cannot believe we have now staffed incompetent people with this much power in a very hard specialty to manage. This kinda stuff scares the crap out of me. ",
    "score": 1464,
    "url": "https://reddit.com/r/Residency/comments/1jbjp5b/ive_never_seen_someone_so_horribly_mismanaged/",
    "created_at": "2025-03-15T01:14:03.000Z",
    "num_comments": 155
  },
  {
    "id": "reddit-1jds056",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "I like and appreciate 99% of the nurses I work with. And then there’s the other 1%.",
    "text": "I was evaluating a patient this morning and the patient’s family member referred to me as a nurse several times. I politely corrected her, saying, “Actually, I’m the doctor.” One of the nurses in the room rolled her eyes, turned to me, and said, “We’re all a team here—does it really matter?”\n\nThe same nurse was annoyed a few minutes later when I asked for an IV.\n\n“But WHY does he need an IV?”\n\nI don’t know, maybe because his lactate is 6.1 so maybe he needs fluids ?? jfc\n\nAs a petite woman, I’m constantly being mistaken for a nurse (despite having a huge badge that says “DOCTOR”) and frequently met with skepticism over simple things that no one would ever question a male physician about. And I’m so f*cking tired of it.",
    "score": 1441,
    "url": "https://reddit.com/r/Residency/comments/1jds056/i_like_and_appreciate_99_of_the_nurses_i_work/",
    "created_at": "2025-03-18T00:08:51.000Z",
    "num_comments": 169
  },
  {
    "id": "reddit-1kzalnu",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "US physicians seeking Canadian licensure up 750% in 7 months",
    "text": "In the last seven months, the Medical Council of Canada has seen a 750% increase in the number of Americans creating accounts on its site to initiate the licensure process, NPR reported May 29.\n\nThe number of American physicians seeking to move to Canada to practice has ebbed and flowed for decades, usually in reaction to political and economic fluctuations, but it has never been this high, experts told NPR.\n\nHere are five things to know:\n\n1. The first step in becoming licensed in Canada is to create an account on physiciansapply.ca. In the past seven months, 615 physicians have created accounts, compared to 71 applicants during the same time last year. In recent years, Canadian provinces have relaxed some licensing regulations and expedited licensing for U.S.-trained physicians.\n\n2. Both medical licensing organizations and companies that recruit physicians into Canada reported many physicians citing the Trump administration as their primary reason for moving.\n\n3. The Trump administration declined to comment on the trend when asked by NPR, but did ask if the news outlet knew the number of physicians and their citizenship status. The news outlet did not provide or have this information.\n\n4. Some recruiting companies reported a 65% increase in the number of American physicians looking for Canadian jobs between January and April. The College of Physicians and Surgeons of Ontario said it received license applications from about 260 U.S.-trained physicians — and registered 116 of them — in the first quarter of 2025. British Columbia, another province, said it licensed 28 U.S.-trained physicians in the fiscal year that ended in February — triple the total of the prior year.\n\n5. Rural communities in Canada launched an advertising campaign after President Trump’s election to recruit American physicians. The campaign focuses on physicians in Florida and North and South Dakota. Its key selling point: “zero political interference in physician patient relationship.”\n\nhttps://www.beckershospitalreview.com/quality/hospital-physician-relationships/us-physicians-seeking-canadian-licensure-up-750-in-7-months-5-notes",
    "score": 1322,
    "url": "https://reddit.com/r/medicine/comments/1kzalnu/us_physicians_seeking_canadian_licensure_up_750/",
    "created_at": "2025-05-30T17:45:37.000Z",
    "num_comments": 134
  },
  {
    "id": "reddit-1ke9sup",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "I was wrong.",
    "text": "I’m a surgical subspecialty resident. I’ve spent more nights than I can count where I silently (or not so silently) judged my colleagues in the ER. Rolling my eyes at consults that felt lazy. Laughing along with other specialists about how emerge is just glorified triage. How they call for the stupidest shit. How they punt. How they don’t think.\n\nBut I had a moment tonight that I feel embarrassed even admitting.\n\nI realized I’m the fool.\n\nI’ve spent years getting irritated at what I thought was incompetence, when really I’ve just been blind to how structurally opposed our incentives are. I want them to do more; assess thoroughly, initiate treatment, tidy up the mess so my clinic stays clean. So I don’t get woken up at 3am when I have to work regardless the next day. \n\nBut they’re under relentless pressure to move people. The hospital isn’t judged on the quality of the primary assessment. It’s judged on time to bed, time to disposition, minutes to triage. They’re trying to stay afloat in a system that punishes them for doing too much and rewards them for offloading.\n\nAnd here I am, acting like their priorities should match mine. Like they’re just bad at their jobs, instead of crushed under an entirely different set of expectations.\n\nIt hit me that if emerge did everything the way I wanted, they’d clog up worse than ever. There aren’t enough staff. There isn’t enough space. Every minute they spend thinking deeply about a case is a minute someone else waits in a hallway. So of course they defer. Of course they cut corners. It’s not laziness. It’s survival.\n\nThe real problem, again, like always, isn’t each other. It’s the system. It’s the horrific, machine we’re all trapped inside, where throughput wins over thought, and deferral is built into the architecture. And the worst part is, we all know it. But we still act like it’s each other’s fault.\n\nBut it’s not just a nameless machine. It has a face. It’s the administrators shoveling quality metrics down our throats, who haven’t spent a single minute talking to a real patient in their entire miserable lives. Who make rules about our work without understanding its substance. Who treat “efficiency” like it’s the same thing as care.\n\nI don’t know what to do with this realization yet. But I know it’s changed how I see things. I know I’m not going to laugh so easily next time.\n\nEdit: yes I was an asshole. Probably still am. Will try to be less of one.",
    "score": 1265,
    "url": "https://reddit.com/r/Residency/comments/1ke9sup/i_was_wrong/",
    "created_at": "2025-05-04T02:48:17.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1hsrdi7",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Moral injury of working in the US increasingly unbearable\n",
    "text": "I came to the US from my home country in the EU for residency after finishing intern year back home about ten years ago. I was excited to be where real innovative medicine was practiced and doctors were well-paid, and didn't have strong feelings one way or the other about private insurance (back home it is socialized healthcare). Over the past few years as an attending though I have been increasingly haunted by the feeling that I am profiting from blood money, even though I deliberately chose to work at a state hospital that provides care to uninsured patients we are still billing and bankrupting them. I scaled up my free clinic hours, my husband and I donate to M4A advocacy groups, I am not sure what more I can do. I tried waiving my copay for patients in my clinic who indicated it was a barrier. But, my chairman somehow found out about this and was LIVID, he just came in and shouted at me \"do you have any idea how much trouble this could get the whole department in\" and \"how could you possibly think this was an OK thing to do?\" I just broke down crying because, who is it hurting? It only comes out of my compensation, and made me feel like I was making a system that feels like a sea of sh!t just a tiny bit more human.  \n\nSomething else I have noticed is that Americans are sooooo sick. I did med school and internship in one of Europe's top teaching hospitals which handles the most medically and socially complex patients. The sickest patient I ever saw would be just a regular patient in America. You get young patients presenting with diseases in advanced stages that basically only exist in textbooks in my country, for example kids in their 20s with no kidneys anymore because of being unable to treat T1DM.\n\nAm I the only one to feel this way? I have been really contemplating moving back. Attendings make just above $100k, which is considered a very good salary in my country, I am just worried about whether my husband could take that adjustment psychologically as he is procedural and currently makes a lot more--he is American and when I have talked to him about it, his solutions basically amount to vote for Bernie Sanders. \n\n",
    "score": 1262,
    "url": "https://reddit.com/r/medicine/comments/1hsrdi7/moral_injury_of_working_in_the_us_increasingly/",
    "created_at": "2025-01-03T17:10:43.000Z",
    "num_comments": 245
  },
  {
    "id": "reddit-1pr6faz",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "U.S.-Trained Doctors, Suddenly Unallowed to Work",
    "text": "Many of you have heard the phrase “travel ban” and assumed it only affects people trying to enter the United States. Since 2017, that was largely true. You would occasionally see stories about residents unable to start training because a visa was delayed or a ban blocked entry. But earlier this month, under the current administration, the scope shifted. What is happening now is different, and unprecedented in how far it reaches.\n\nThis has expanded beyond the border and is now impacting legal immigrant physicians already living and working inside the U.S. These are not new arrivals. These are physicians who have been here for 7 to 15 years, trained in the U.S., and built their lives here, not because of anything in their individual history, but solely because of their country of birth. For many international graduates, the path from intern year to a green card takes close to a decade, often longer with fellowship.\n\nMany of these doctors completed U.S. residency and fellowship, served in underserved communities under waiver obligations, and worked through COVID in ICUs, nights, weekends, and holidays. They followed the legal pathways: waivers, approved employment-based green card petitions, including cases deemed in the national interest, and routine work authorization renewals while their green card cases remain pending.\n\nNow those pathways are being placed on indefinite hold.\n\nGreen card processing, visa renewals, and work permits, the basic administrative steps required to keep showing up to work, are being placed on indefinite hold with no clear timeline and no meaningful guidance. People who have lived here for a decade are being pushed into quiet, indefinite limbo.\n\nThis is not theoretical. I personally know multiple physicians affected.\n\nI know nine colleagues, including a cardiologist, a critical care physician, and a plastic surgeon, who are months away from losing their ability to work solely because their pending green card work permits are not being adjudicated or renewed. They also cannot travel because re-entry is effectively impossible under current entry restrictions. I know an internist at a major institution who has already been forced off work for three months, despite multiple prior work permits and doing everything by the book. I know a friend recruited to become the first pediatric subspecialist in an underserved rural area whose contract negotiations stalled, not due to need or qualifications, but because the hospital cannot take the risk of hiring someone whose authorization could be arbitrarily frozen.\n\nThe human side is hard to describe unless you have lived it.\n\nOur profession demands certainty and accountability. We cannot practice medicine with “maybe.” Patients do not get to pause heart failure, STEMI, septic shock, or an airway emergency until bureaucracy feels ready. Our duties demand that we be present, calm, precise, and deeply empathetic. Many of us perform life-saving procedures and make high-stakes decisions that require focus and emotional stability.\n\nAnd yet we are being asked to do all of that while our own lives are held in suspense.\n\nImagine walking into the ICU to treat someone else’s crisis while not knowing whether you will be allowed to keep working next month. Imagine trying to reassure families and plan discharges while you cannot plan your own children’s schooling, your mortgage, your lease, or even whether you will still have an income. Imagine being placed in limbo indefinitely, not because of anything you did, but because of where you were born.\n\nIt is not just stressful. It is degrading. It feels like being denied basic dignity.\n\nI am not posting this for pity. I am posting because this is a patient-care and workforce issue, and it is happening quietly. Its been only 2 weeks since the expansion to include legal immigrant inside the US. Hospitals will feel this. Patients will feel this. Underserved areas will feel it first.\n\nIf you can help, please do.\n\nIf you have connections to medical societies, hospital leadership, government affairs offices, journalists, advocacy groups, or lawmakers, raise this issue. Ask them to look into the impact of this broad freeze on legal immigrant physicians already practicing in the U.S. Push for transparency, timelines, and a process that does not destroy careers and patient access by default.\n\nWe understand the need for security vetting and sensible reform. But blanket sweeps without precision create predictable collateral damage. Many of the physicians I know with approved green card petitions and waiting final step are not even asking for the green card to be issued immediately. They are simply asking for the ability to keep working through a stable, lawful immigration pathway. Placing work permits on hold and pushing long-term physicians, their families, and their patients into indefinite limbo should not be an acceptable outcome, especially when training each physician in the U.S. costs taxpayers roughly $750,000 to $2 million.\n\nEven sharing this helps. This is already happening, its been two weeks and it will get worse unless people speak up and advocate.",
    "score": 1237,
    "url": "https://reddit.com/r/medicine/comments/1pr6faz/ustrained_doctors_suddenly_unallowed_to_work/",
    "created_at": "2025-12-20T05:19:04.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1l7ow8o",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "A letter to the AMA",
    "text": "Dear American Medical Association,\n\nI am an emergency medicine-critical care physician practicing at a rural hospital in New England. I had the privilege of doing my fellowship in critical care during the two big waves of COVID-19 that were responsible for millions of deaths. I had the privilege of holding the hands of many, many dying men and women who were not ready to die. I was the one who told their families that we could no longer oxygenate their loved ones. I ordered the paralytics. I placed the dialysis lines. I hopelessly silenced the vent alarms while standing in five layers of PPE. I also had the privilege of watching the COVID-19 vaccine slowly make this disappear. \n\nI did this already. I do not intend to watch millions more die from vaccine preventable diseases. \n\nPlease do something. \n\n-a tired physician ",
    "score": 1184,
    "url": "https://reddit.com/r/medicine/comments/1l7ow8o/a_letter_to_the_ama/",
    "created_at": "2025-06-10T03:37:35.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1op5nvi",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "22 states sue the Trump administration over 2026 PSLF changes",
    "text": "On October 30, the Department of Education released the [final rule](https://www.businessinsider.com/what-are-the-pslf-loan-forgiveness-changes-trump-debt-relief-2025-11) to limit eligibility for the Public Service Loan Forgiveness program.\n\nThe AAFP has [called for the withdrawal of the new rule](https://www.aafp.org/news/government-medicine/public-service-loan-forgiveness-proposed-rule.html).\n\n&gt;\"Studies show that more than 40% of physicians rely on PSLF, and family physicians are among the most reliant,\" the Academy said. The letter warned that the proposed rule would lead to \"fewer primary care physicians, fewer clinics and fewer options for patients\" if it were finalized as written.\n\nAAP, ACOG, ACP, AOA, and APA also released a [joint statement opposing the new rule.](https://www.aafp.org/news/media-center/statements/department-of-educations-pslf-rule.html)\n\nNow, [22 states are suing](https://www.washingtonpost.com/education/2025/11/03/public-service-loan-forgiveness-lawsuits/) to prevent the rule from going into effect:\n\n&gt; The lawsuits arrived days after the Education Department released revisions to eligibility requirements for Public Service Loan Forgiveness, which cancels the education debt of government and nonprofit employees after 10 years of service and 120 monthly loan payments. The regulation will allow the education secretary to disqualify employers — not individuals — who engage in activities the department deems to have a \"substantial illegal purpose,\" such as assisting undocumented immigrants, providing gender transition care for minors or engaging in diversity, equity and inclusion.\n\n&gt; A group of 22 state attorneys general argues that the Education Department lacks the legal authority to carve out exceptions based on ideology, noting that the agency’s definition of illegality aligns with President Donald Trump’s policy objectives. In their lawsuit, filed in U.S. District Court in Massachusetts, the group said the rule is \"arbitrary and capricious,\" as it grants the department unfettered power to target specific state policies or social programs.\n\n&gt; \"This administration has created a political loyalty test disguised as a regulation,\" said New York Attorney General Letitia James, who is leading the coalition of state AGs. \"It is unjust and unlawful to cut off loan forgiveness for hardworking Americans based on ideology.\"",
    "score": 1113,
    "url": "https://reddit.com/r/medicine/comments/1op5nvi/22_states_sue_the_trump_administration_over_2026/",
    "created_at": "2025-11-05T15:19:44.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1ndes63",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Family Physicians Call on President to Reconsider Secretary Kennedy’s Ability to Serve",
    "text": "**FOR IMMEDIATE RELEASE:** September 10, 2025\n\n**Media Contact:**     \n[pr@aafp.org](mailto:pr@aafp.org)\n\nIn February, the nation – and particularly, the health care community – listened to Secretary Robert F. Kennedy, Jr., commit to preserving Americans’ access to vaccines and protecting the nation’s scientific and public health infrastructure. We, like so many others, hoped that the legions of career public health professionals who valued evidence and science would be able to educate the Secretary and his team, thus safeguarding our nation’s public health infrastructure and preserving public confidence in the work of these important institutions. Under the Secretary’s leadership, key public health protections have been weakened, and the immunization review process is devoid of experts and evidence.   \n\nThe Secretary’s consistent pattern of circumventing process and ignoring or downplaying scientific evidence is undermining the ability of any member of the Health and Human Services department to operate effectively. His own conflicts of interest and inability to see the conflicts of those in his inner circle further undermine his credibility and that of his entire department.  \n\nToday, we are in an environment where HHS and its leaders are fostering confusion, chaos and conspiracies. As a result, we are seeing an alarming decline in confidence among the American public.  According to the [Pew Trust](https://www.pewresearch.org/politics/2025/08/27/republicans-views-of-justice-department-fbi-rebound-as-democrats-views-shift-more-negative/?utm_source=Pew+Research+Center&amp;utm_campaign=e22c94cc3c-Weekly_8-30-25&amp;utm_medium=email&amp;utm_term=0_-e22c94cc3c-399891433%22%20%5Cl%20%22shifting-views-of-health-agencies), confidence in HHS is now below 50% - an astonishing 8-point drop in 8 months and a 20-point drop over the past decade.   \n\nThe pattern of behavior demonstrated by Secretary Kennedy and his recent testimony have led to declining confidence among the American people in HHS’s ability to provide clear, concise and evidence-based direction on important public health issues. **The American Academy of Family Physicians has no choice but to call for action.** Our call is not driven by politics or partisanship but rather by our deep commitment to the health and wellness of the patients we serve. **We urge the President to continue prioritizing the health and safety of the American people by re-evaluating Secretary Kennedy’s ability to serve in his current capacity.** Similarly, we call on Congress to strengthen its oversight and protect the health of the American people.   \n\nAmerica’s health depends on swift and decisive action.  \n\n[Family Physicians Call on President to Reconsider Secretary Kennedy’s Ability to Serve  | AAFP](https://www.aafp.org/news/media-center/statements/family-physicians-call-on-president-to-reconsider-secretary-kennedys-ability-to-serve.html) ",
    "score": 1113,
    "url": "https://reddit.com/r/medicine/comments/1ndes63/family_physicians_call_on_president_to_reconsider/",
    "created_at": "2025-09-10T13:51:27.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1p2cx3q",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Nursing, PT, PA will no longer be considered \"professional\" degrees",
    "text": "Article: [https://www.newsweek.com/nursing-not-professional-degree-trump-admin-11079650](https://www.newsweek.com/nursing-not-professional-degree-trump-admin-11079650)\n\n\"The department determined that the following programs were professional: medicine, pharmacy, dentistry, optometry, law, veterinary medicine, osteopathic medicine, podiatry, chiropractic, theology and clinical psychology.\n\nThis meant that physician assistants, nurse practitioners, physical therapists and audiologist were excluded from the list.\"\n\nAdditional Article: [https://www.nasfaa.org/news-item/37609/Neg\\_Reg\\_Continues\\_Discussion\\_of\\_Program\\_of\\_Study\\_Legacy\\_Provisions\\_and\\_New\\_Professional\\_Degree\\_Definition?utm\\_source=chatgpt.com](https://www.nasfaa.org/news-item/37609/Neg_Reg_Continues_Discussion_of_Program_of_Study_Legacy_Provisions_and_New_Professional_Degree_Definition?utm_source=chatgpt.com)\n\nCriteria for being considered professional:\n\n\"1. A professional degree is a degree that:\n\n(i) Signifies both completion of the academic requirements for beginning practice in a given profession and a level of professional skill beyond that normally required for a bachelor's degree:\n\n(ii) Is generally at the doctoral level, and that requires at least six academic years of postsecondary education coursework for completion, including at least two years of post-baccalaureate level coursework:\n\n(iii) Generally requires professional licensure to begin practice; and\n\n(iv) Includes a four-digit program CIP code, as assigned by the institution or determined by the Secretary, in the same intermediate group as the fields listed in paragraph (2) (i) of this definition.\n\n2. A professional degree may be awarded in the following fields:\n\n(i) Pharmacy (Pharm.D.), Dentistry (D.D.S. or D.M.D.), Veterinary Medicine (D.V.M.), Chiropractic (D.C. or D.C.M.), Law (L.L.B. or J.D.), Medicine (M.D.), Optometry (O.D.), Osteopathic Medicine (D.O.), Podiatry (D.P.M., D.P., or Pod.D.), Theology (M.Div., or M.H.L.), and Clinical Psychology (Psy.D.) \n\n(3) A professional student under this definition:\n\n(i) May not receive title IV aid as an undergraduate student for the same period of enrollment; and\n\n(ii) Must be enrolled in a program leading to a professional degree under paragraph (2) of this definition.”\n\nI have mixed feelings on this, because I have a great respect for each of these fields. I think each healthcare team member is vitally important (from the sanitation technician to the physician). My dad is a PT (DPT, OCS), and to think of him as not a professional, given his level of expertise, seems short-sighted. I also hate the idea of people not being able to afford to become a nurse, PA, PT, etc., because their loans are capped at a much lower tier, because they are not \"professional\" degrees. Overall, I am just not sure if this is a W or L.\n\nTL;DR Loans are going to be capped lower for non-\"professional\" degrees per a new definition created by the Dept of Ed; nursing, PT, PA, and others appear to not qualify as professional per new guidelines to be potentially implemented July 2026.",
    "score": 1108,
    "url": "https://reddit.com/r/medicine/comments/1p2cx3q/nursing_pt_pa_will_no_longer_be_considered/",
    "created_at": "2025-11-20T19:43:00.000Z",
    "num_comments": 583
  },
  {
    "id": "reddit-1kq3mqx",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Resident salary should be minimum to that of midlevels",
    "text": "Obviously know were exploited for our cheap labor and our pay goes up after residency, but it’s insane how we complete 4 years of medical school and are paid half of a middie who completed half ass 2 year curriculum that scratches the surface. Currently on an off service rotation where the midlevels can barely manage 2 low acuity patients at a time and get paid &gt; $100k. Decided to move at their pace and even slower. They can see twice as much patients if they’re getting paid double as me, change my mind ",
    "score": 1103,
    "url": "https://reddit.com/r/Residency/comments/1kq3mqx/resident_salary_should_be_minimum_to_that_of/",
    "created_at": "2025-05-19T05:03:55.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1jixarb",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "\"Grieving husband says \"reckless\" Texas abortion law led to pregnant wife's death\" - CBS",
    "text": "[https://www.cbsnews.com/news/grieving-husband-says-reckless-texas-abortion-law-led-to-pregnant-wifes-death/](https://www.cbsnews.com/news/grieving-husband-says-reckless-texas-abortion-law-led-to-pregnant-wifes-death/)\n\n\"I blame the doctors, I blame the hospital, and I blame the state of Texas,\" Ngumezi said.\n\n...\n\n\"I feel like the law is very reckless...very dangerous,\" Ngumezi said.\n\nPorsha Ngumezi wasn't given a D&amp;C, a surgical procedure that can be used when a miscarriage isn't complete and the patient is bleeding excessively — as Ngumezi was at the time. It's the same procedure used for many abortions, but doctors told CBS News their colleagues [hesitate to perform them](https://www.cbsnews.com/news/doctors-say-texas-strict-abortion-laws-put-pregnant-women-and-physicians-at-risk-60-minutes-transcript/), fearing the state's criminal penalties.\n\nNgumezi believes that's what happened in his wife's situation. She eventually went into cardiac arrest and died.\n\n\"I just felt like the doctor turned his back on us. You know, 'I don't want to go to jail. I don't want to lose my license or get fined, so the best course is for me to protect myself,'\" Ngumezi said.\n\n...\n\nState Sen. Bryan Hughes, who authored the legislation banning most abortions in Texas, said, \"Most hospitals are getting this right, but some are not.\"\n\nIn response to doctors' concerns about the [ramifications](https://www.cbsnews.com/news/texas-abortion-law-impact-pregnant-women-60-minutes/), Hughes said, \"I hear that. And I can show you the definition of abortion in Texas and it says removal of a miscarriage is not an abortion.\"\n\nHughes said the legislature is working on clarifying the language, but the law has yet to be amended.\n\n\\-------------------------------------------------------------------------------  \n[https://www.propublica.org/article/porsha-ngumezi-miscarriage-death-texas-abortion-ban](https://www.propublica.org/article/porsha-ngumezi-miscarriage-death-texas-abortion-ban)\n\n...\n\nBut because D&amp;Cs are also used to end pregnancies, the procedure has become tangled up in state legislation that restricts abortions. In Texas, any doctor who violates the strict law risks up to 99 years in prison. Porsha’s is the fifth case ProPublica has reported in which women died after they did not receive a D&amp;C or its second-trimester equivalent, a dilation and evacuation; three of those deaths were in Texas.\n\n...\n\nTexas doctors told ProPublica the law has changed the way their colleagues see the procedure; some no longer consider it a first-line treatment, fearing legal repercussions or dissuaded by the extra legwork required to document the miscarriage and get hospital approval to carry out a D&amp;C. This has occurred, ProPublica found, even in cases like Porsha’s where there isn’t a fetal heartbeat or the circumstances should fall under an exception in the law. Some doctors are transferring those patients to other hospitals, which delays their care, or they’re defaulting to treatments that aren’t the medical standard.\n\n...\n\n“Stigma and fear are there for D&amp;Cs in a way that they are not for misoprostol,” said Dr. Alison Goulding, an OB-GYN in Houston. “Doctors assume that a D&amp;C is not standard in Texas anymore, even in cases where it should be recommended. People are afraid: They see D&amp;C as abortion and abortion as illegal.”\n\n...\n\nStill, the doctor didn’t mention a D&amp;C at this point, records show. Medical experts told ProPublica that this wait-and-see approach has become more common under abortion bans. Unless there is “overt information indicating that the patient is at significant risk,” hospital administrators have told physicians to simply monitor them, said Dr. Robert Carpenter, a maternal-fetal medicine specialist who works in several hospital systems in Houston. Methodist declined to share its miscarriage protocols with ProPublica or explain how it is guiding doctors under the abortion ban.\n\nAs Porsha waited for Hope, a radiologist completed an ultrasound and noted that she had “a pregnancy of unknown location.” The scan detected a “sac-like structure” but no fetus or cardiac activity. This report, combined with her symptoms, indicated she was miscarrying.\n\nBut the ultrasound record alone was less definitive from a legal perspective, several doctors explained to ProPublica. Since Porsha had not had a prenatal visit, there was no documentation to prove she was 11 weeks along. On paper, this “pregnancy of unknown location” diagnosis could also suggest that she was only a few weeks into a normally developing pregnancy, when cardiac activity wouldn’t be detected. Texas outlaws abortion from the moment of fertilization; a record showing there is no cardiac activity isn’t enough to give physicians cover to intervene, experts said.\n\nDr. Gabrielle Taper, who recently worked as an OB-GYN resident in Austin, said that she regularly witnessed delays after ultrasound reports like these. “If it’s a pregnancy of unknown location, if we do something to manage it, is that considered an abortion or not?” she said, adding that this was one of the key problems she encountered. After the abortion ban went into effect, she said, “there was much more hesitation about: When can we intervene, do we have enough evidence to say this is a miscarriage, how long are we going to wait, what will we use to feel definitive?”\n\n...\n\nPerforming a D&amp;C, though, attracts more attention from colleagues, creating a higher barrier in a state where abortion is illegal, explained Goulding, the OB-GYN in Houston. Staff are familiar with misoprostol because it’s used for labor, and it only requires a doctor and a nurse to administer it. To do a procedure, on the other hand, a doctor would need to find an operating room, an anesthesiologist and a nursing team. “You have to convince everyone that it is legal and won’t put them at risk,” said Goulding. “Many people may be afraid and misinformed and refuse to participate — even if it’s for a miscarriage.”\n\n...\n\nSince Porsha died, several families in Texas have spoken publicly about similar circumstances. This May, when Ryan Hamilton’s wife was bleeding while miscarrying at 13 weeks, the first doctor they saw at Surepoint Emergency Center Stephenville noted no fetal cardiac activity and ordered misoprostol, according to medical records. When they returned because the bleeding got worse, an emergency doctor on call, Kyle Demler, said he couldn’t do anything considering “the current stance” in Texas, according to Hamilton, who recorded his recollection of the conversation shortly after speaking with Demler. (Neither Surepoint Emergency Center Stephenville nor Demler responded to several requests for comment.)\n\nThey drove an hour to another hospital asking for a D&amp;C to stop the bleeding, but there, too, the physician would only prescribe misoprostol, medical records indicate. Back home, Hamilton’s wife continued bleeding until he found her passed out on the bathroom floor. “You don’t think it can really happen like that,” said Hamilton. “It feels like you’re living in some sort of movie, it’s so unbelievable.”\n\nAcross Texas, physicians say they blame the law for interfering with medical care. After ProPublica reported last month on two women who died after delays in miscarriage care, 111 OB-GYNs sent a letter to Texas policymakers, saying that “the law does not allow Texas women to get the lifesaving care they need.”\n\nDr. Austin Dennard, an OB-GYN in Dallas, told ProPublica that if one person on a medical team doubts the doctor’s choice to proceed with a D&amp;C, the physician might back down. “You constantly feel like you have someone looking over your shoulder in a punitive, vigilante type of way.”\n\nThe criminal penalties are so chilling that even women with diagnoses included in the law’s exceptions are facing delays and denials. Last year, for example, legislators added an update to the ban for patients diagnosed with previable premature rupture of membranes, in which a patient’s water breaks before a fetus can survive. Doctors can still face prosecution for providing abortions in those cases, but they are offered the chance to justify themselves with what’s called an “affirmative defense,” not unlike a murder suspect arguing self defense. This modest change has not stopped some doctors from transferring those patients instead of treating them; Dr. Allison Gilbert, an OB-GYN in Dallas, said doctors send them to her from other hospitals. “They didn’t feel like other staff members would be comfortable proceeding with the abortion,” she said. “It’s frustrating that places still feel like they can’t act on some of these cases that are clearly emergencies.” Women denied treatment for ectopic pregnancies, another exception in the law, have filed federal complaints.\n\n...\n\nThis past May, Marlena Stell, a patient with symptoms nearly identical to Porsha’s, arrived at another hospital in the system, Houston Methodist The Woodlands. According to medical records, she, too, was 11 weeks along and bleeding heavily. An ultrasound confirmed there was no fetal heartbeat and indicated the miscarriage wasn’t complete. “I assumed they would do whatever to get the bleeding to stop,” Stell said.\n\nInstead, she bled for hours at the hospital. She wanted a D&amp;C to clear out the rest of the tissue, but the doctor gave her methergine, a medication that’s typically used after childbirth to stop bleeding but that isn’t standard care in the middle of a miscarriage, doctors told ProPublica. \"She had heavy bleeding, and she had an ultrasound that's consistent with retained products of conception.\" said Dr. Jodi Abbott, an associate professor of obstetrics and gynecology at Boston University School of Medicine, who reviewed the records. \"The standard of care would be a D&amp;C.\"\n\nStell says that instead, she was sent home and told to “let the miscarriage take its course.” She completed her miscarriage later that night, but doctors who reviewed her case, so similar to Porsha’s, said it showed how much of a gamble physicians take when they don’t follow the standard of care. “She got lucky — she could have died,” Abbott said. (Houston Methodist did not respond to a request for comment on Stell’s care.)\n\nIt hadn’t occurred to Hope that the laws governing abortion could have any effect on his wife’s miscarriage. Now it’s the only explanation that makes sense to him. “We all know pregnancies can come out beautifully or horribly,” Hope told ProPublica. “Instead of putting laws in place to make pregnancies safer, we created laws that put them back in danger.”\n\n\\------------------------------------------------------------------------------------------------------------\n\n[https://www.smfm.org/emtala#:\\~:text=In%20January%202025%2C%20the%20Alliance,care%2C%20even%20in%20emergency%20situations](https://www.smfm.org/emtala#:~:text=In%20January%202025%2C%20the%20Alliance,care%2C%20even%20in%20emergency%20situations)\n\nSigned into law in 1986, the Emergency Medical Treatment and Labor Act (EMTALA) requires hospitals that receive Medicare funds to treat and stabilize anyone who presents with an emergency medical condition, regardless of their ability to pay and regardless of the type of care required.  If the hospital is not equipped to provide treatment, it must arrange a transfer.  [EMTALA requires hospitals to offer abortion care](https://www.cms.gov/files/document/qso-22-22-hospitals.pdf) if needed to stabilize a pregnant person in an emergent situation, and the US Department of Health and Human Services (HHS) offers several [resources](https://www.cms.gov/medicare/regulations-guidance/legislation/emergency-medical-treatment-labor-act)[ ](https://www.cms.gov/medicare/regulations-guidance/legislation/emergency-medical-treatment-labor-act)for providers. \n\nSince the Dobbs decision, there has been litigation focused on whether EMTALA’s requirements to provide stabilizing care supersede state abortion bans.\n\n...\n\n*Texas*\n\n* In October 2024, the US Supreme Court denied the [Biden Administration's petition](https://www.scotusblog.com/2024/10/court-turns-down-bidens-bid-for-intervention-in-texas-emergency-abortion-dispute/#:~:text=By%20Amy%20Howe,threatens%20their%20lives%20or%20health) to hear the Texas case, thereby leaving the lower court’s ruling intact. \n\n* In August 2022, a federal judge agreed with the State of Texas and temporarily blocked the HHS EMTALA guidance. HHS appealed the ruling, and again, SMFM joined partner organizations in filing an [amicus brief ](https://assets.noviams.com/novi-file-uploads/smfm/Advocacy/Reproductive_Health/Becerra_Texas_Doc__38_Motion_and_Amicus_Brief-ed3c1dfb.pdf)detailing how Texas and the lower court misunderstood EMTALA and the realities of emergency medical care. \n\n* In July 2022, Texas filed a lawsuit against HHS asserting that the July 2022 [HHS EMTALA guidance](https://www.cms.gov/files/document/qso-22-22-hospitals.pdf) did not provide a basis for the federal government to compel clinicians to offer abortion care. In response, SMFM joined ACOG, ACEP, and the American Medical Association to file an [amicus brief](https://s3.amazonaws.com/cdn.smfm.org/media/3629/Amicus_Brief_8.16_-_Texas_v._Becerra.pdf) explaining the importance of the federal law requiring clinicians to provide stabilizing medical care, including abortion care, to patients experiencing medical emergencies.  \n\n# Federal Agency Activities\n\n* The Centers for Medicare and Medicaid Services (CMS) [continues to provide guidance](https://www.cms.gov/medicare/regulations-guidance/legislation/emergency-medical-treatment-labor-act) on EMTALA including a 2022 [letter from Secretary Becerra](https://www.hhs.gov/sites/default/files/emergency-medical-care-letter-to-health-care-providers.pdf) reaffirming that EMTALA requires clinicians to offer necessary stabilizing care for patients suffering emergency medical conditions, including abortion care. Some portions of this guidance are now unenforceable in Texas and for members of certain anti-abortion organizations due to a court injunction.  \n\n\\-------------------------------------------------------------------------------------------------------------\n\nI hate how lawmakers and families are putting the blame on their physicians and hospitals when we have elected representatives who campaigned on and wrote an anti-abortion law with massive penalties for violation and unclear exemptions for emergency care. No wonder Ob/Gyns are fleeing the state, who wants to watch their patient hemorrhage to death while you wonder if you will be prosecuted with a risk of life imprisonment for providing life-saving treatment?",
    "score": 1056,
    "url": "https://reddit.com/r/medicine/comments/1jixarb/grieving_husband_says_reckless_texas_abortion_law/",
    "created_at": "2025-03-24T18:04:07.000Z",
    "num_comments": 141
  },
  {
    "id": "reddit-1iarmma",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "More From UB Residents",
    "text": "Hey everyone,\n\nI'm a resident in Internal Medicine at the University at Buffalo (UB), and I need to vent about how awful things have gotten here. You might've seen our campaign a few months back when we voted to unionize and strike in September—yeah, that fight.\n\nAfter more than a year of painful negotiations, we finally ratified a contract in December. It gave us a much-needed salary bump and some bonuses, including a $2k educational stipend from GME. It felt like a win for, like, five seconds.\n\nNow? GME has *completely gutted* every residency program's wellness and programmatic funds. These were the funds that covered things like lunches during didactics, wellness activities, and even our graduation celebrations. All gone. It seems like they just repackaged our old funds into this “new” educational stipend to make it look like they were giving us something extra. And to add insult to injury, they're claiming we’re not even eligible for the full $2k because we signed the contract mid-academic year.\n\nIt feels like this was their plan all along—throw us a bone, take everything else away, and punish us for standing up for ourselves. Wellness? Nah, apparently not something we deserve anymore.\n\nTo give you an idea of how desperate things are, someone even started a GoFundMe to help us cover what GME ripped away. I’m not linking it here (because rules), but just know: it’s bad.\n\nI’m so sick of the exploitation. If you're in the medical community or just care about how healthcare workers are treated, please spread the word about what’s happening here. UB residents deserve better.\n\nEnd rant.",
    "score": 1007,
    "url": "https://reddit.com/r/Residency/comments/1iarmma/more_from_ub_residents/",
    "created_at": "2025-01-26T21:54:04.000Z",
    "num_comments": 91
  },
  {
    "id": "reddit-1jotpzz",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Follow up on the study showing discrepancies in outcomes for black babies cared for by white and black doctors",
    "text": "Some new reporting came out yesterday regarding a previously widely publicized study that purported lower mortality rates in black babies cared for by black rather than white physicians.\n\nHere is the initial reddit post when the study was published: https://www.reddit.com/r/medicine/s/HMNte8DCTy\n\nAnd here is the discussion of a review of the study performed in PNAS: https://www.reddit.com/r/medicine/s/7Wo8Qr6zPf\n\nThe short summary is that the review showed that the initial statistical analysis failed to control for birth weight of the infants, one of the strongest predictors of infant mortality. White doctors were much more likely to care for low or very low birth weight infants, leading to their higher overall mortality rates. When controlling for this variable the survival rates were not significantly different. \n\nNow there's this. A reporter filed a FOIA request for correspondence between authors and reviewers of the article and found that the study did see a survival benefit with racial concordance between physician and patient, however it was only with white infants and physicians. They removed lines in the paper stating that it does not fit the narrative that they sought to publish with the study. \n\n\nhttps://dailycaller.com/2025/03/31/exclusive-researchers-axed-data-point-undermining-narrative-that-white-doctors-are-biased-against-black-babies/\n\n\nPretty wild that they were so open about that in official correspondence. I sincerely hope that they face some sort of institutional consequences for such blatant academic dishonesty. ",
    "score": 1005,
    "url": "https://reddit.com/r/medicine/comments/1jotpzz/follow_up_on_the_study_showing_discrepancies_in/",
    "created_at": "2025-04-01T11:55:05.000Z",
    "num_comments": 192
  },
  {
    "id": "reddit-1pq1v4g",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Sadness after experiencing pediatric death at work",
    "text": "I’m a junior doctor training in ENT, working at a highly specialized hospital. Last night, we received a transfer of a small child who, due to complications from what was supposed to be a simple elective procedure, was declared brain dead and subsequently passed away.\n\nIn my six years as a doctor, I have very little experience with pediatric death — especially not from something that was considered minimal risk.\n\nI am completely broken. I’ve been crying all day. I have children of my own around the same age, and I’m sure I’m projecting a lot of my own feelings onto this situation.\n\nRight now, it honestly feels like I never want to go back to work. This is without a doubt the worst thing I have experienced in my career as a physician.\n\nHow have you dealt with situations like this?",
    "score": 941,
    "url": "https://reddit.com/r/medicine/comments/1pq1v4g/sadness_after_experiencing_pediatric_death_at_work/",
    "created_at": "2025-12-18T20:52:03.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1ld8nre",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "I just found out that starting salary for our hospitalists (PGY-4) is the same as what I make as a senior transplant ID attending (PGY-24)",
    "text": "I mean, I knew that hospitalists earn more than ID in general.  But that the fact I've been working like a dog for years, getting promoted to full professor, and make the same as someone with two decades less experience than me?\n\nFuck this shit.\n\nFuck my instituion.\n\nFuck American medicine.\n\nEDIT: \"Get another job.\"  The underlying issue is clearly the fact that my field is undervalued.  If you complain about your job, someone reflexively telling you to get a new one is unhelpful.  Think about it if that was everyone's response to your complaint.\n\nEDIT 2:  \"You chose lower salary.\"  Yes and no.  Hospitalist medicine was brand new when I was a trainee, so it wasn't a default option for anyone in my residency class.   I did sub-sub-specialize.  I have made a conscious choice to not go into, say, ID private practice.\n\nAnd to clarify, I value my hospitalist colleagues greatly, and respect their difficult job, which I am not currently equipped to do.  But this post was not about comparing what I made versus a PGY-24 hospitalist. It was a FIRST YEAR hospitalist, SAME INSTITUTION.\n\n  \nEDIT 3.  Thanks all.  To the sympathetic and appreciative, thanks.  To those that are not, your point that I made my bed and get to lie it it is not wrong, but you may be in my position someday.\n\nLet me tell you why I'm still here:, so I look like less of a whiny bitch:  My cases are interesting.  My colleagues are very helpful and supportive.  The people who consult me are appreciative.  I like my patient population.  Teaching residents and fellows can be fun.\n\nYeah, I'm burned out as fuck, but I'm also having difficulty finding an alternative that gives me a big enough salary bump that I don't lose something big and possibly priceless.\n\nAs they say on the internet: \"Stay fresh, cheese bags.\"",
    "score": 915,
    "url": "https://reddit.com/r/Residency/comments/1ld8nre/i_just_found_out_that_starting_salary_for_our/",
    "created_at": "2025-06-16T23:53:25.000Z",
    "num_comments": 271
  },
  {
    "id": "reddit-1nnz8h9",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "So will patients sue us when we recommend Tylenol in pregnancy?",
    "text": "So I’m sure we’ve all seen the press conference or heard about RFK suggesting a link between acetaminophen use and autism.  Obviously, there are many large retrospective studies and meta analyses which have discredited this.\n\n\nHowever, aren’t we as physicians nonetheless potentially legally exposed if we recommend Tylenol to pregnant patients?  Suppose you get a MyChart message from one of your pregnant patients asking if they can take Tylenol.  You explain why you think the position of the current HHS secretary is BS.  Patient takes your advice.  Three years later, child starts developing stereotypical behaviors.  Parents are pissed and looking for someone to blame.  Viola…there is your MyChart message encouraging them to take Tylenol.\n\n\nAnd their med-mal lawyer now has the authority of the CDC and FDA behind them when they bring up expert testimony.\n\n\nHas anyone else thought about this?\n",
    "score": 874,
    "url": "https://reddit.com/r/medicine/comments/1nnz8h9/so_will_patients_sue_us_when_we_recommend_tylenol/",
    "created_at": "2025-09-22T21:31:16.000Z",
    "num_comments": 211
  },
  {
    "id": "reddit-1id0ch2",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "RFK Jr.'s views on antidepressants and mental health",
    "text": "\\- Thinks that they're linked to school shootings\n\n\\- Thinks that they're worse than heroin (and that patients who take them are essentially addicts)\n\n\\- Wants to ship people receiving mental health medications (like SSRIs) off to some detox facility\n\nAm I getting this correct? Are our psychiatry colleagues hearing this? I feel like he's going to absolutely cripple the progress made against stigmatizing mental health. This is frightening because I'm sure a lot of physicians have had our own struggles with mental health throughout our lives and during training as well.",
    "score": 871,
    "url": "https://reddit.com/r/medicine/comments/1id0ch2/rfk_jrs_views_on_antidepressants_and_mental_health/",
    "created_at": "2025-01-29T18:11:22.000Z",
    "num_comments": 211
  },
  {
    "id": "reddit-1j9xdvn",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "2025 Averages - How much does __ specialty make after training?",
    "text": "Hey all - I’ve seen several posts asking “Is this a good offer” or ”What’s typical pay for X specialty” (and my favorite - “does anyone have MGMA data for X?” \n\nA few of us had started an anonymous salary sharing project on Marit. Thanks to all the inputs so far - we now have enough data to put together some averages, **specifically for new attendings**, to help answer these questions. \n\nAlso - since it's easy to get obsessed with just the $ comp, I’ve added avg hrs/wk and compensation satisfaction as well to help get the full picture. I’ll post a summary below, but feel free to head over to Marit (marithealth dot com) if you want to see specific details of comp, bonuses, hours, schedules, benefits, etc. for specific locations\n\nAnd if you have any specific questions - feel free to post below. I’ll be around for a couple of hours and will do my best to answer them.\n\n**Data below are averages for new attendings with 0-2 yrs of experience**  \n**Specialty:** Avg Total Comp | hours / week | Compensation Satisfaction  \nTotal Comp (signing bonus\\*) broken by Academic and Non-Academic  \n*\\* Signing bonus avg is based only on those that reported it. Not everyone receives one.*  \n*PS: ?? below indicates not enough “n”*\n\n**Anesthesiology** \\- $538k | 49.9 hrs | 3.8 ★  \nAcademic: $527k ($52k) | Non-Academic: $543k ($51k)\n\n**Cardiology** \\- $572k | 49.0 hrs | 4.0 ★  \nAcademic: $578k ($24k) | Non-Academic: $559k ($37k)\n\n**Dermatology** \\- $498k | 39.0 hrs | 3.5 ★  \nAcademic: ?? | Non-Academic: $484k ($35k)\n\n**Emergency Medicine** \\- $388k | 34.7 hrs | 3.5 ★  \nAcademic: $364k ($34k) | Non-Academic: $405k ($33k)\n\n**Endocrinology** \\- $278k | 40.0 hrs | 3.6 ★  \nAcademic: ?? | Non-Academic: $273k (N/A)\n\n**Family Medicine** \\- $290k | 40.6 hrs | 3.7 ★  \nAcademic: $281k ($23k) | Non-Academic: $291k ($38k)\n\n**Gastroenterology** \\- $550k | 45.3 hrs | 3.9 ★  \nAcademic: ?? | Non-Academic: $521k ($24k)\n\n**Genetics** \\- $225k | 40.0 hrs | ??\n\n**Hematalogy** \\- $347k | 49.5 hrs | 3.0 ★\n\n**Hematalogy Oncology -** $445k | 42.1 hrs | 3.9 ★\n\n**Hepatology** \\- $345k | 45.5 hrs | 3.0 ★\n\n**Hospital Medicine** \\- $328k | 48.0 hrs | 3.7 ★  \nAcademic: $308k ($25k) | Non-Academic: $345k ($29k)\n\n**Infectious Disease** \\- $227k | 50.0 hrs | ??\n\n**Internal Medicine** \\- $330k | 45.7 hrs | 3.6 ★  \nAcademic: $312k ($22k) | Non-Academic: $341k ($33k)\n\n**Internal Medicine (Critical Care)** \\- $417k | 42.0 hrs | 3.6 ★  \nAcademic: $415k ($18k) | Community: $412k ($21k)\n\n**Internal Medicine (Pulmonary and Critical Care)** \\- $421k | 45.7 hrs | 3.5 ★\n\n**Nephrology** \\- $267k | 47.8 hrs | 3.6 ★  \nAcademic: $260k (??) | Non-Academic: $276k (??)\n\n**Neurology** \\- $348k | 48.8 hrs | 3.8 ★  \nAcademic: $328k ($33k) | Non-Academic: $382k ($34k)\n\n**Neurosurgery** \\- $874k | 62.7 hrs | 3.7 ★  \nAcademic: $814k (N/A) | Non-Academic: N/A (N/A)\n\n**Nuclear Medicine** \\- $464k | 40.0 hrs | ??\n\n**Obstetrics &amp; Gynecology** \\- $345k | 48.3 hrs | 3.5 ★  \nAcademic: $344k (N/A) | Non-Academic: $349k ($31k)\n\n**Oncology** \\- $495k | 41.2 hrs | ??\n\n**Ophthalmology** \\- $366k | 41.1 hrs | 3.8 ★  \nAcademic: $329k (N/A) | Non-Academic: $374k ($26k)\n\n**Orthopedic Surgery** \\- $571k | 49.9 hrs | 3.7 ★  \nAcademic: $550k (N/A) | Non-Academic: $575k ($42k)\n\n**Otolaryngology** \\- $425k | 45.1 hrs | 3.8 ★  \nAcademic: $369k ($20k) | Non-Academic: $449k ($38k)\n\n**Pathology** \\- $287k | 43.4 hrs | 3.6 ★  \nAcademic: $284k ($15k) | Non-Academic: $286k (??)\n\n**Pediatrics** \\- $231k | 41.1 hrs | 3.5 ★  \nAcademic: $228k ($16k) | Non-Academic: $233k ($20k)\n\n**Physical Medicine &amp; Rehabilitation** \\- $353k | 40.3 hrs | 4.0 ★  \nAcademic: $261k ($24k) | Non-Academic: $401k ($25k)\n\n**Plastic Surgery** \\- $448k | 57.5 hrs | 3.5 ★\n\n**Podiatry** \\- $260k | 44.6 hrs | 4.3 ★\n\n**Preventative Medicine** \\- $230k | 40.0 hrs | 2.5 ★\n\n**Psychiatry** \\- $336k | 40.1 hrs | 3.8 ★  \nAcademic: $328k ($33k) | Non-Academic: $336k ($54k)\n\n**Pulmonology** \\- $410k | 43.4 hrs | 3.7 ★\n\n**Radiation Oncology** \\- $538k | 40.7 hrs | 4.0 ★\n\n**Radiology** \\- $534k | 45.7 hrs | 3.7 ★  \nAcademic: $520k (??) | Non-Academic: $537k ($56k)\n\n**Rheumatology** \\- $305k | 43.8 hrs | 4.2 ★\n\n**Surgery** \\- $500k | 51.7 hrs | 3.8 ★  \nAcademic: $485k ($40k) | Non-Academic: $515k ($39k)\n\n**Surgery (Vascular)** \\- $539k | 59.5 hrs | 3.4 ★\n\n**Urology** \\- $462k | 48.9 hrs | 3.8 ★  \nAcademic: $457k ($31k) | Non-Academic: $465k ($50k)\n\n\\---- Not enough data  \nAllergy &amp; Immunology - ??  \nBariatric Medicine - ??\n\n***Source: Marit (marithealth dot com)***\n\nPhew… Hope this is helpful. Feel free to check out more details on Marit.\n\nPS: Thanks to everyone who has contributed to this! If you find this helpful - and are an attending or know one - please add to the dataset",
    "score": 860,
    "url": "https://reddit.com/r/Residency/comments/1j9xdvn/2025_averages_how_much_does_specialty_make_after/",
    "created_at": "2025-03-12T22:57:56.000Z",
    "num_comments": 304
  },
  {
    "id": "reddit-1nlgcav",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Trump to impose $100,000 fee for H-1B worker visas, White House says",
    "text": "https://apnews.com/article/h1b-visa-trump-immigration-8d39699d0b2de3d90936f8076357254e\n\nThe biggest impact is going to be prospective non-US international medical graduates - physicians who did their training but now who, under a proclamation signed by Trump, must pay a $100,000 application fee for the H-1B visa process. Unfortunate timing right before programs download ERAS next week. ",
    "score": 851,
    "url": "https://reddit.com/r/medicine/comments/1nlgcav/trump_to_impose_100000_fee_for_h1b_worker_visas/",
    "created_at": "2025-09-19T21:41:55.000Z",
    "num_comments": 329
  },
  {
    "id": "reddit-1j91r38",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "British Columbia is removing barriers for US licensed physicians.",
    "text": "It has previously been somewhat complicated to move from the US to British Columbia, in fact I've seen a few posts on here saying you would essentially have to start your residency over, however the BC government is making changes to attract US doctors and nurses.\n\nThe Province is working with the College of Physicians and Surgeons of BC on a direct process to enable U.S.-trained doctors, who hold certification from the American Board of Medical Specialties, to become fully licensed in B.C. without the need for further assessment, examination or training. \n\n[Link to press release](https://archive.news.gov.bc.ca/releases/news_releases_2024-2028/2025HLTH0013-000194.htm)\n\nGiven the current political climate, is this the sort of thing that would entice you to move north?\n\nMore reporting on it:\n\nhttps://www.cbc.ca/news/canada/british-columbia/doctors-recruitment-1.7480911",
    "score": 830,
    "url": "https://reddit.com/r/medicine/comments/1j91r38/british_columbia_is_removing_barriers_for_us/",
    "created_at": "2025-03-11T21:10:20.000Z",
    "num_comments": 130
  },
  {
    "id": "reddit-1kjlxvp",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Ob/Gyns, why don't you provide topical anaesthesia or cervical blocks for office procedures?",
    "text": "Full disclosure, i'm a male EM Doctor, so my perspective here may be limited.\n\nIn my practice, i've noticed that women tend to find a simple speculum exam quite uncomfortable and the only reason i'm not more liberal with versed or fentanyl/morphine is i don't want allegations of impropriety (though i always have a female chaperone present). I tend to provide topical/local anaesthesia for bartholin cysts/abscess drainage and IV pain meds (which i also do for normal abscesses).\n\nBut talking to my gf, female friends/family/coworkers/patients, it seems the only analgesic used in the office is ibuprofen. For anything -- IUD insertion, cyst/abscess drainage, biopsy. A lot of these are at least somewhat invasive and definitely painful. I know conscious sedation isn't an option on the office, but topical lido and cervical blocks exist. It just seems more nicer.\n\nEDIT:  \n1. I've removed some of my more inflammatory wording, since i was definitely in a bad mood when i posted this.  \n2. I've also removed some of the procedures i initially listed as i was probably just misinformed.  \n3. To the many of you responding that you offer pain control or anxiolysis other than ibuprofen, i appreciate it. It would seem the women in my life and the patients i get in my ER are just unlucky with their physicians.  \n4. Pertaining to the people who've been kind enough and thorough enough to provide literature support, that's fair. In my own practice, i'm still erring on the side of offering meds. Not that i do the more invasive stuff you guys do.  \n5. And yes, my knowledge here was limited, so i appreciate those of you who took the time to educate me.",
    "score": 829,
    "url": "https://reddit.com/r/medicine/comments/1kjlxvp/obgyns_why_dont_you_provide_topical_anaesthesia/",
    "created_at": "2025-05-10T22:19:40.000Z",
    "num_comments": 303
  },
  {
    "id": "reddit-1momz5s",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "What is wrong with pediatrics and why won't things improve?",
    "text": "For context, I graduated IM residency. Wife is in peds residency. I came from a program that works you pretty hard especially during intern and second year, but arguably my wife has worked harder and done more inpatient and nights despite being at a known academic program. \nI could write a separate post about the problems I see her encounter in her residency with the standard of care not being met, or a lack of supervision on nights, but more so, my concern is why pediatrics is going to shit and no one does anything about it? \n\nWhen I see her board exam prep compared to mine, the peds boards look objectively way more random, harder and difficult to pass, and test more than half the content these people don't see in their training. \n\nI also cannot understand why their board is a thousand dollars more expensive, and they need a hospitalist fellowship for jobs? Or any fellowship at all is 3 years except maybe 1 or 2. \n\nWhen trying to look for primary care jobs, there is maybe 3-4 MDs and multiple clinics being run by mid- levels.\nNot to much mention most peds fellowships make less than Gen peds? And academic salaries don't even cross $200k? \n\nShe chose it out of her own passion, and I respect her a lot for it, but what I cannot understand is why the people tasked to treat our sick kids are so undervalued, underappreciated and being shafted by the ABP? \n\nWhere is the advocacy? ",
    "score": 824,
    "url": "https://reddit.com/r/Residency/comments/1momz5s/what_is_wrong_with_pediatrics_and_why_wont_things/",
    "created_at": "2025-08-12T22:23:28.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1le4wf4",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Doctor who supplied Matthew Perry with ketamine pleads guilty, faces 40 years in prison",
    "text": "https://www.usatoday.com/story/entertainment/celebrities/2025/06/16/salvador-plasencia-matthew-perry-pleads-guilty/84234683007/\n\n&gt;Dr. Salvador Plasencia, a physician charged along with four others in the death of actor Matthew Perry, has pleaded guilty to his role in the substance abuse that contributed to the \"Friends\" star's tragic passing.\n&gt;\n&gt;Plasencia, also known as \"Dr. P,\" pleaded guilty on June 16 to four counts of distribution of ketamine, according to a copy of the plea agreement filed in the U.S. District Court for the Central District of California and obtained by USA TODAY. The physician faces up to 40 years in prison for the offenses.\n&gt;\n&gt;As part of the plea deal, Plasencia acknowledges that he \"knowingly distributed ketamine\" to Perry before his 2023 death, behaved in a manner \"outside the scope of professional practice,\" and that the drug distribution lacked \"a legitimate medical purpose.\"\n\nGood. They need to make the penalties for this quite severe. They were laughing and mocking him while simultaneously facilitating his drug addiction. Using your medical license to become a legal drug dealer should come with major criminal penalties. I'll be interested to see what his sentence turns out to be. Some \"pill mills\" at least have a theoretically valid purpose, and some are probably actually valid, but this guy was just going for cash from a rich celebrity with a drug addiction.",
    "score": 805,
    "url": "https://reddit.com/r/medicine/comments/1le4wf4/doctor_who_supplied_matthew_perry_with_ketamine/",
    "created_at": "2025-06-18T01:38:07.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1jdjsiv",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Updates regarding the H1B visa deported physician",
    "text": "The officer asked her to explain why she had multiple photos of Hezbollah fighters and martyrs on her phone.\n\n“I have a lot of WhatsApp groups with families and friends who send them,” she replied. “I am a Shia Muslim, and he is a religious figure. He has a lot of teachings, and he is highly regarded in the Shia community. He the head of Hezbollah.”\n\nThe officer asked how Alawieh feels about Nasrallah.\n\n“I think if you listen to one of his sermons, you would know what I mean,” she replied, according the transcript. “He is a religious, spiritual person.”\n\nThe officer asked her if she supported Hezbollah and what the organization stands for.\n\n“I don’t,” Alawieh replied.\n\nBut, the officer said, she had high regard for the leader of Hezbollah.\n\n“From a religious perspective,” she said.\n\nThe officer asked if she knew that Hezbollah had been designated as a terrorist organization. “Yes,” she said. “I’m not much into politics. But yes.”\n\nThe officer then asked her about the photos of Iran’s leader, Khamenei.\n\n“Again, I am a Shia Muslim,” Alawieh said. “He’s a religious figure. It has nothing to do with politics. It’s all religious, spiritual things.”\n\nThe officer asked why she deleted photos from her phone one or two days before flying into Logan.\n\n“Because I didn’t want the perception,” Alawieh said. “But I know I’m not doing anything wrong. I’m not related to anything politically or militarily.”\n\nThe interview ended with the officer telling her she would not be allowed to re-enter the United States.\n\nEDIT: the source also mentions that she visited his funeral. It wasn’t intentionally omitted from this post. The purpose of this post was to update people, like me, who were terrified for the past 24 hours to go see their families\n\n[Source + other important details](https://www.bostonglobe.com/2025/03/17/metro/deported-ri-doctor-rasha-alawieh-photos-hezbollah-iran-phone-prosecutors-say/)",
    "score": 801,
    "url": "https://reddit.com/r/medicine/comments/1jdjsiv/updates_regarding_the_h1b_visa_deported_physician/",
    "created_at": "2025-03-17T18:24:47.000Z",
    "num_comments": 460
  },
  {
    "id": "reddit-1npjuox",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Englewood Health Surgeon speaks out against Charlie Kirk  allegations after being forced to resign",
    "text": "https://patch.com/new-jersey/ridgewood/nj-surgeon-who-resigned-over-charlie-kirk-comments-calls-nurses-accusations\n\nThe article below:\n\n“BERGEN COUNTY, NJ — A doctor who resigned from a North Jersey hospital last week after a nurse reported his reaction to the assassination of Turning Point USA founder Charlie Kirk disputed the accusations against him in a statement released Tuesday.\n\nSurgeon Matthew Jung said he \"do[es] not condone violence for any reason\" and said that the stories about him have resulted in \"a wave of racial slurs and death threats against me. Sadly, it also led to threats against other minority physicians I once worked alongside, and against the hospital itself.\"\n\nJung said that he resigned from the hospital on Sept. 15 not because he was guilty, but because he wanted the threats to end.\n\nPolitical violence against health professionals has been on the upswing, reports say.\n\nThe controversy began after media outlets reported that Lexie Kuenzle, a nurse at Englewood Hospital in Bergen County, filed a lawsuit in Bergen County Superior Court on Sept. 12, alleging that she was suspended after reporting Jung's comments in relation to Kirk's killing.\n\nFind out what's happening in Ridgewood-Glen Rockfor free with the latest updates from Patch.\nYour email address\nSubscribe\nKirk was assassinated during a stop on his \"American Comeback\" tour on the Utah valley University campus on Sept. 10. A suspect in the fatal shooting, Tyler Robinson, 22, was taken into custody two days later. READ MORE: 5 Things To Know About Tyler Robinson, Charlie Kirk's Accused Killer\n\nIn her lawsuit, Kuenzle alleged that when news was reported about Kirk's fatal shooting, \"In front of patients and staff, Dr. [Matthew] Jung cheered and publicly praised the murder.\"\n\nKuenzle said that she was concerned that a doctor who had taken the Hippocratic Oath had celebrated someone's death in earshot of other medical professionals and a patient.\n\nShe alleged that as a Christian, his comments created a \"hostile work environment.\"\n\nThe hospital responded with a statement on Sept. 13 saying that it had not fired Kuenzle—as some news outlets reported—but that it had suspended both Kuenzle and Jung in order to investigate the situation.\n\nTwo days later, the hospital sent a short statement saying that they had accepted Jung's resignation.\n\nAt the time, Jung did not give his side of the story publicly.\n\n\"I Am Also A Christian...'\n\nKuenzle's lawsuit noted that her employers were aware of her Christian faith and asked, \"What happened when a horrified Christian Nurse was the victim of Dr. Jung’s anti-religious rant? As a result of Plaintiff’s engagement in the protected activity above, she suffered an adverse job action.\"\n\nJung said in his statement on Tuesday afternoon that he, too, is a Christian, as well as a \"minority and queer\" man.\n\n\"Several hospital staff asked me who he was and why this [the assassination] might have happened,\" Jung said in his statement on Tuesday, giving his own account of that day. \"In trying to explain, I mentioned that his platform had included rhetoric that many – including minorities like myself and several of the staff – found discriminatory. I spoke about how hatred can fuel more hatred and often leads to violence. But I was in no way 'cheering' for Mr. Kirk to be shot and killed, as has been alleged.\"\n\nJung said, \"While his words have caused real pain for many, he did not deserve that kind of hatred – nor did racial minorities or those in the LGBTQ+ community who were targets of his rhetoric. Words are powerful – both his and mine. And I am deeply sorry I did not choose mine more carefully, especially as they’ve been so badly misrepresented.\"\"\n\n\"I am a minority and Queer,\" he said, \"two groups Mr. Kirk frequently targeted. But I also am a Christian, born and raised in New York who worked my way through college and then medical school. I dedicated my life to serving my patients with compassion at their most critical moments, regardless of their race, political beliefs, gender identity, or anything else. Those who have worked with me know me best. And amidst all the hatred and vitriol, I also have received a tremendous outpouring of support.\"\n\nHe said his discussion was with hospital staff, and that the nurse released a \"misleading narrative about what I said and meant. She did this while casting herself as the victim ... In fact, I am the one who no longer works at the hospital. She continues to seek the television limelight for her own publicity.\"\n\nEnglewood Hospital did not respond by press time when asked for a comment.”\n\nSounds like this started as a verbal misunderstanding at work, nurse doxxed him online, led to threats against him, coworkers, and hospital. And the hospital forced him to resign but kept the nurse….\n",
    "score": 799,
    "url": "https://reddit.com/r/medicine/comments/1npjuox/englewood_health_surgeon_speaks_out_against/",
    "created_at": "2025-09-24T18:24:01.000Z",
    "num_comments": 185
  },
  {
    "id": "reddit-1la5gcl",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "dear ACGME, final year senior residents should not be expected to work June, at all",
    "text": "I’m sitting here fuming at the thought right now that i am expected to be “on service” until June 27th.\n\nmy real job starts July 1st. \n\nsoon to be fellows start July 1st.\n\nFuck you ACGME, after 7-11 years of this, you expect people to turn around their entire life, family, everything in THREE days???\n\nluckily for me i am only moving a state away and so i can make this commute back and forth multiple times to make this move work. \n\nbut seriously, as if the ACGME hasn’t ruined medicine enough, they can’t even give us a break for the last month?\n\n/end rant  \n\nedit: wow the amount of attendings who are on those post disagreeing. people really forget what being a resident is. go back to your own bubble and life and get out of the residency subreddit if you’re that much better than all of us and have it all figured out with your now 6 figure salaries \n\nedit 2:\n\ni think a lot of people are missing the point here. i’m doing fine. i’m doing what i need to do. they said i work till june 27th, im doing that, per my contract, yes. but just because im doing it because i know i have to, doesnt mean subsequent residents should have to do this.\n\ni’m not stupid, i understand a contract is a contract and we must work X to get paid Y or have Z benefits. \n\nmany many commenters have it way worse than me, and i have total sympathy for them. but what all of this really demonstrates to me is that this last month of residency should be a mandated, streamlined time to allow for graduating residents to transition to their next stage. whether it’s finishing up research, moving, finalizing a poster/journal/case conference, etc. - i’m not crying saying “woe is me, i don’t want to work” - no, im actually literally so excited to work - so why am i wasting time doing busy work to check off boxes? i’ve satisfied all my requirements for graduation... now allow us this time to finish/mobilize/transcend to what we are going to become. \n\nto all the snotty replies going “blah blah blah you signed up for this job, you signed the contract, shut up” - you sound like you have a conservative mindset and not one of flexibility and advancement which is what medicine is all about. residency and physicians are the backbone of our healthcare system, if you can’t acknowledge that it’s broken and needs repairs, you are blind, and this is but one quality of life fix that can make everyone’s lives so much better, so why would you want to potentiate a broken system? ",
    "score": 789,
    "url": "https://reddit.com/r/Residency/comments/1la5gcl/dear_acgme_final_year_senior_residents_should_not/",
    "created_at": "2025-06-13T02:59:45.000Z",
    "num_comments": 241
  },
  {
    "id": "reddit-1k5ru24",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Hawaii’s largest hospital alerts staff after imaging backlog reaches 8,000 exams",
    "text": "[Link.](https://radiologybusiness.com/topics/healthcare-management/healthcare-staffing/hawaiis-largest-hospital-alerts-staff-after-imaging-backlog-reaches-8000-exams)\n\nHawaii’s largest hospital recently alerted staff after its backlog of unread medical images reached 8,000, according to a report published Thursday. \n\nQueen’s Medical Center in Honolulu—and others in the Aloha State—are grappling with significant shortages of both radiologists and technologists. The state needed at least 10 more rads as of last year, a number that has likely worsened in 2025, the University of Hawaii’s John A. Burns School of Medicine estimates. \n\nAmid these shortages, Queen’s Medical Center radiologists are prioritizing exams for emergency patients and individuals with upcoming appointments or procedures, Hawaii News Now reported [April 17](https://www.hawaiinewsnow.com/2025/04/18/radiology-workforce-shortage-hits-hawaii-hospitals-with-thousands-patient-scans-queue/). \n\n“Like other healthcare organizations in Hawaii and across the United States, we are facing a shortage of radiologists,” Darlena Chadwick, Queen’s Health Systems chief operating officer, told the TV station. “We are seeing high volumes of diagnostic imaging requests, which \\[tend\\] to be some of the sickest patients in our community. The care of our patients is our highest priority, and we are working diligently every day to address any delays.”\n\nChadwick said this includes active efforts to recruit additional full-time radiologists, along with bringing aboard telerad temps to work through the queue. Meanwhile on the technologist front, the Healthcare Association of Hawaii [estimated](https://www.hah.org/hwi) in January that there are about 160 open positions. This represents a 39% increase since 2022 and includes 49 ultrasound technologist job openings, a 24% vacancy rate. \n\n“Healthcare leaders are increasingly concerned about filling radiologic technologist and ultrasound technologist roles,” the association, which represents over 170 healthcare organizations in Hawaii, said earlier this year. “The demand for these professionals is growing, but because these roles require specialized education, employers struggle to find qualified candidates,” the HAH added, noting there was no sonographer training program in Hawaii at the time of the report.  \n\n[Indeed.com](http://Indeed.com) currently lists over 50 open radiology-related jobs in Hawaii including radiologist, tech, PACS administrator and nurse. Queen’s Health System is [advertising](https://www.indeed.com/viewjob?jk=920f90872ae5f748&amp;from=shareddesktop_copy) a salary of $840,000 for a general radiologist who’d work at its North Hawaii Community Hospital in Waimea. (That’s compared to a national average of $520,000, [Medscape](https://radiologybusiness.com/topics/healthcare-management/radiologist-salary/radiology-rises-no-2-highest-paid-specialty-surpassing-cardiology-and-plastic-surgery-medscape) estimated last week.) The four-hospital system has 11 CT scanners and 7 MRI machines, according to the job listing. Queens wants a rad who’d work a 40-hour week on a hybrid basis with shifts ending at 3:30 p.m. at its 35-bed rural acute care facility. It’s also offering a $20,000 signing bonus, $25,000 for relocation and $4,000 annually toward CME. \n\nWhile providers nationwide are grappling with staffing challenges, Hawaii’s struggles may be more pronounced due to its isolation and high cost of living. As of January, the state had about 4,700 open healthcare positions, the Healthcare Association of Hawaii estimated. When adjusting for various factors, the tally was about 3,835 (or 14% unfilled), down from 3,873 (or 17% unfilled) in 2022. ",
    "score": 767,
    "url": "https://reddit.com/r/medicine/comments/1k5ru24/hawaiis_largest_hospital_alerts_staff_after/",
    "created_at": "2025-04-23T05:47:47.000Z",
    "num_comments": 148
  },
  {
    "id": "reddit-1iceq4i",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Seeing my husband’s WLB makes me insanely jealous",
    "text": "Burnt out PGY1 here. Need to rant.\n\nMy husband works in tech on Wall Street. Makes $350k including stocks. 5 YOE. He works strictly 9-6 M-F. All weekends and holidays off. 20 days PTO. Free unlimited office food, free parking, free EV charging, free equinox membership. He got $10000 joining and relocation bonus. He gets to WFH whenever he feels too lazy to leave the house. He can call out sick at 8.55 am and doesn’t have to worry about coverage and what his manager/colleagues will think of him. He gets yearly appraisals, these don’t have any upper limit so if you’re a top performer in the company you can easily cross $1 million salary \n\nThe perks my husband enjoys is standard in the tech industry. He’s had jobs like this since he graduated from his 4 year undergrad. He graduated with an average GPA and had only 1 tech focused internship so it’s not like he was the top 0.1% of his class to be able to get jobs like this.\n\nAnd here I am slaving away in residency, working 80 hour weeks for &lt;$12/hr. I’ve been grinding for this since I was 18, went to one of the top med schools in my country, now I’m nearly 30 and I don’t even have 1/50th of my husband’s net worth. I’m in IM so the only job I can think of that comes close to my husband’s WLB is being a PCP, for half his salary alas. If I want to make as much money as him as a pcp I would need to move to rural middle of nowhere. PD and seniors are unsupportive and passive aggressive, no matter how hard we work we can never catch a break. We don’t get free cafeteria food and have to pay $200/month for parking.\n\nI hate my life. I wish I could go back in time and do engineering instead of med school. Rant over",
    "score": 714,
    "url": "https://reddit.com/r/Residency/comments/1iceq4i/seeing_my_husbands_wlb_makes_me_insanely_jealous/",
    "created_at": "2025-01-28T22:46:56.000Z",
    "num_comments": 264
  },
  {
    "id": "reddit-1jpr1ba",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Stop settling for being employed",
    "text": "I know this might sound priviledged and many of you have debt and family to take care of but please for the love of god stop settling for the shitty employed jobs. Ownership and private pactice has gone down significantly in the last 10 years. Yes, the median mgma salary and 6-figure sign on bonus is very tempting but you’ll always be on a leash. You’ll have to bend over backward to please the administration. When you run your own practice, you’re your own boss. You can practice the best medicine, spend however much time with patients YOU feel is appropriated without being pressured by the non-physician admin. ",
    "score": 672,
    "url": "https://reddit.com/r/Residency/comments/1jpr1ba/stop_settling_for_being_employed/",
    "created_at": "2025-04-02T15:12:44.000Z",
    "num_comments": 110
  },
  {
    "id": "reddit-1o9xtvr",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "NP salary post",
    "text": "The NP subreddit has a recent salary post discussion. Their salaries approach those of primary care doctors, pediatricians, and hospitalists in many cases. This does not even mention CRNA salaries.\n\nNPs/nurse midlevels do not deserve to make more than residents under any circumstance. \n\nShould future CIR / union negotiations use midlevel pay as a starting point for resident salaries? \n\nIn what world is a degree mill NP worth more to society than a board certified pediatrician? \nIn what world is the service of an anesthesia resident who takes call worth less than the service of a CRNA who works from 8-4? \n\nSomething needs to change.\n\nEdit: for those with reading comprehension issues: I am not suggesting we lower midlevel pay, I am suggesting residents have pay raises. And yes, I am fully aware of the government-funded nature of residency positions. ",
    "score": 617,
    "url": "https://reddit.com/r/Residency/comments/1o9xtvr/np_salary_post/",
    "created_at": "2025-10-18T14:50:31.000Z",
    "num_comments": 144
  },
  {
    "id": "reddit-1ndrkos",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Clinic Fucking Sucks",
    "text": "Shoutout to all my primary care homies out there - you’re seriously the glue that holds everything together. Wish you got 10x your salary. I could never do this as a career.\n\nClinic fucking sucks.",
    "score": 552,
    "url": "https://reddit.com/r/Residency/comments/1ndrkos/clinic_fucking_sucks/",
    "created_at": "2025-09-10T21:59:44.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1jq6kjc",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Calling pharmacies to figure out patients’ med lists makes me want to quit my job",
    "text": "I know I’m being dramatic but I’m highly annoyed after playing pharmacy phone tag when I’m not even working in clinic this week so that’s that on that\n\nI FUCKING HATE having to call Walgreens and CVS to figure out people’s med lists. It is easier to kidnap my states governor as a hostage or fly a rocket to the moon. \n\nHow is that my responsibility? If you’re grown enough to guzzle the pills, you’re grown enough to bring the damn bottles to your damn appointment. I should not have to call them, check out what you need refilled, wipe your ass, and kiss you on the forehead before bed. I am salaried for fucks sake. I should not be calling pharmacies after my shift to figure your shit out. YOU make the call. \n\nIf you’re seeing multiple PCPs, sort your shit out. Why is it my job to figure out who sent in your Valsartan when I’ve had you on Lisinopril for over a year? YOU no-showed your appointment with me because “the front desk is rude” and went to a random clinic outside of our health system who’s EMR I can’t view who sent meds without checking your med list. And when asked if you want to make them your PCP, why is your answer no? Please go to them lol. At the very least, YOU call them and figure it out. Don’t task me with useless shit. Pick one of the meds, swallow it, discard the other, and stfu. \n\nI don’t think that this should be my job. Mentally competent adults should have SOME degree of responsibility for themselves for fucks sake. ",
    "score": 544,
    "url": "https://reddit.com/r/Residency/comments/1jq6kjc/calling_pharmacies_to_figure_out_patients_med/",
    "created_at": "2025-04-03T02:08:25.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1jr265g",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "“No Money” in general surgery",
    "text": "Yeah, yeah, we’ve all heard it. There’s no money in general surgery, right? Funny, because I somehow made $700K this year while spending most of my life inside an OR and answering nonstop consults at 3 AM for things that definitely aren’t surgical.\n\nHow?\n\t•\tI learned how to bill properly. Turns out, saving someone’s life is actually worth more than a Taco Bell salary, who knew?\n\t•\tI own a surgery center. Because if the hospital is going to make millions off my work, I might as well get a cut.\n\t•\tI say yes to everything. Hernia? Sure. Gallbladder? No problem. Someone stubbed their toe but thinks it’s an emergency? Why not.\n\nI have partners who make over $1M, but they also haven’t seen their kids in years, consider sleeping four hours a “win,” and spend their vacations taking trauma call in a different state.  No, I do not need a “sign-on bonus” or a “stipend” I need RVU multipliers and a real buy-in, thank you very much.\n\nAnd let’s not forget profit sharing. Turns out, when you actually own a piece of the pie—whether it’s an SC, imaging center, or even a stake in the anesthesia group. You get a little extra on top of your base salary. While some docs cry about RVUs, I’m out here getting a cut every time someone orders a CT scan. \n\nOh, and before you cry about loans, I paid mine off in cash within two years. You can do it too, just say goodbye to sleep, happiness, and most of your relationships.\n\nFor any med students wondering if general surgery is worth it. Yes, if you like long hours, high stress, and being the person everyone calls when things go wrong.\n\nAnyway, gotta go, I just got consulted for an “acute abdomen” that’s really just constipation.",
    "score": 515,
    "url": "https://reddit.com/r/Residency/comments/1jr265g/no_money_in_general_surgery/",
    "created_at": "2025-04-04T03:17:48.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1hz3yol",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "2025 Attending Salary Thread",
    "text": "Can we get real numbers on attending salaries with working hours? Offers could be too.\n\nSome of us really burned out and seeing the light in the end of the tunnel would be really help? ;)\n\nEspecially psychiatry.",
    "score": 513,
    "url": "https://reddit.com/r/Residency/comments/1hz3yol/2025_attending_salary_thread/",
    "created_at": "2025-01-11T19:41:09.000Z",
    "num_comments": 802
  },
  {
    "id": "reddit-1n84qxn",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Why would any sane neurosurgeon accept this?",
    "text": "On the website of UCLA, they're looking for a spine surgeon with a base salary from $173,000 - $457,200. I know this is the \"base\" salary and that there is additional income, but why would anyone with 7 years training in one of the hardest specialities in medicine accept such a low income in one of the most expensive cities in the nation?",
    "score": 426,
    "url": "https://reddit.com/r/Residency/comments/1n84qxn/why_would_any_sane_neurosurgeon_accept_this/",
    "created_at": "2025-09-04T08:41:46.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1inh9ey",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Bipartisan bill Medicare Patient Access and Practice Stabilization Act (H.R. 879) introduced to House to reverse 2.83% payment cuts while also granting payment adjustments for inflations, for a total positive adjustment of 6.62%",
    "text": "[https://www.congress.gov/bill/119th-congress/house-bill/879](https://www.congress.gov/bill/119th-congress/house-bill/879)\n\nThe bipartisan bill [Medicare Patient Access and Practice Stabilization Act (H.R. 879)](https://www.congress.gov/bill/119th-congress/house-bill/879?q=%7B%22search%22%3A%22hr+879%22%7D&amp;r=1&amp;s=4) was reintroduced in Congress to try and block the 2.83 percent Medicare pay cut physicians and actually increase the amount paid to cover inflationary costs.\n\nIf passed, this legislation would prospectively stop the 2.83% pay cut physicians received starting Jan. 1, 2025. The bill would be in effect from April 1 through Dec. 31, 2025. Compounded with the Centers for Medicare and Medicaid Services (CMS) estimates of a projected 3.6% increase in practice cost expenses for this year due to inflation, physicians could face a 6.43% cut unless Congress acts. This bill looks to reverse the payment cuts while also granting payment adjustments for inflations, for a total positive adjustment of 6.62%.\n\nAccording to the [American Medical Association (AMA)](https://www.ama-assn.org/), when adjusted for inflation, Medicare reimbursement for physician services has declined 33% from 2001 to 2025. This has spurred loud outcry from all of the major U.S. medical associations. The AMA and many societies have predicted that Medicare reimbursement cuts for physicians are creating far-reaching consequences for the American healthcare system, particularly in rural and underserved areas.\n\nCosts for staffing and operations continue to climb, and declining reimbursement rates are forcing practices to make difficult decisions, such as layoffs, reduced services, or permanent closures. These closures are disproportionally impacting rural and lower-income areas. The AMA has said some physicians have already decided to no longer accept Medicare patients because the payments do not cover the costs for providing care.\n\nThis is also being compounded by a growing shortage of physicians and an aging population of doctors nearing retirement. These these cuts have exacerbated physician burnout and medical groups have said threaten to further limit access to care for Medicare patients.\n\nThe bipartisan bill was reintroduced Jan. 31 by [Congressmen Gregory F. Murphy, MD](https://murphy.house.gov/bio), (R-North Carolina) a urology and renal transplantation surgeon, along with 37 co-sponsors from both sides of the aisle, including numerous physician members of the House.\n\n\"Physicians in America are facing unprecedented financial viability challenges due to continued Medicare cuts. Access to affordable and quality healthcare for millions of seniors is in severe jeopardy,\" said Congressman Murphy in a statement. \"Doctors see Medicare patients out of compassion, not for financial gain. The cost of caring for a Medicare patient far outpaces the reimbursement that physicians receive for seeing them. On top of that, the expense of providing care continues to rise due to medical inflation. This inflation, coupled with declining reimbursement rates, creates enormous financial pressures on physicians, forcing many to retire early, stop accepting new Medicare patients, or sell out to larger, consolidated hospital systems, private equity, or even insurance companies.\"\n\nMurphy said the future of private practice medicine is at stake. Policies such as Medicare awarding higher payments and inflationary increases to hospitals, but not to physicians, has led to a rapid decline in private practices. In cardiology for example, private practices employed about 90% of physicians, but that has eroded to about 12% today. He said private practices are the most cost-efficient and enable the most personalized care for patients. \"This bipartisan legislation prevents further cuts, provides a modest inflationary adjustment to help ease the cost of care, and ensures Medicare remains viable for both doctors and patients,\" Murphy said.\n\n\"Over the past 22 years, adjusting for inflation, physicians have essentially taken a 26% pay cut from Medicare,\" said [Congresswoman Kim Schrier, MD](https://schrier.house.gov/about), (D-Washington) a pediatrician, said in a statement. \"Their reimbursement has been flat or declining, while overhead costs have increased by about 47% for rent, labor, equipment and insurance. I cannot think of another profession whose compensation has dropped by 26% over two decades. Physicians have been holding their breath, year after year, hoping that Congress will act to avert these devastating decreases in reimbursement. Without adequate reimbursement, solo and small practice physicians—most often in rural or underserved areas—are already closing their doors.\"\n\n# March deadline approaches to reverse Medicare cuts\n\nThe AMA said the next legislative chance to reverse the Jan. 1 Medicare cuts comes in mid-March, which is the deadline for the 119th Congress to fund the federal government through the end of the fiscal year. At the end of 2024, The AMA said the 118th Congress passed a scaled-back resolution to keep the government running amid a very politically charged lame-duck session. The AMA said the language that would have stopped the physician Medicare payment cut was removed from the bill.\n\nThe [AMA said it strongly supports the legislation ](https://www.ama-assn.org/practice-management/medicare-medicaid/new-congress-same-legislative-focus-fix-medicare-now)and is working with members of Congress to meet that deadline. The group is also asking members to call their members of Congress in support of the bill, and to attend the \"Fix Medicare Now” event the AMA is hosting on Capitol Hill Feb. 11, where physicians are invited to wear their white coats.\n\n\"We are using this bill...to help position ourselves in the best possible way to be in that \\[March\\] package to reverse as much of the cuts as possible and to try to get an update,” explained [Jason Marino, AMA](https://www.linkedin.com/in/jason-marino-525355173/) director of Congressional affairs said during a recent webinar. “We need to tell the story about the rural practice on the verge of closing because of these cuts. And they can’t afford to see Medicare patients. I’ve heard some stories from physicians that aren’t even taking a salary. They’re keeping the practice open by not taking a salary because the medical payments are going for their staff and technology. They’re not getting paid. But that’s not sustainable.”\n\n# Medical societies applaud effort to stop Medicare cuts\n\nMedical societies responded positively to the bill and said stopping payment cuts and keeping up with inflation would go a log way to improving Medicare patient care, rather than causing frustration and forcing doctors and health systems to make tough choices.\n\n\"The [Medical Group Management Association (MGMA)](https://www.mgma.com/) urges swift passage of the Medicare Patient Access and Practice Stabilization Act of 2025. Physician practices are now a month into the new year, facing uncertainty and financial shortfalls from the congressional failure to reverse the 2025 Medicare fee schedule cuts,\" explained [Anders Gilberg, MGMA](https://www.linkedin.com/in/andersgilberg/) senior vice president, government affairs in a statement. \"These cuts have negatively impacted the viability of their Medicare business, commercial contracts tied to Medicare rates, as well as Medicaid reimbursement in states that use Medicare as a benchmark. With nearly 80% of all physicians now employed by facilities and larger entities, Medicare beneficiaries in areas of the country that rely solely on community-based medical practices are especially vulnerable to access issues. Without immediate congressional action on this important legislation, more and more physician practices will be forced to close their doors.”\n\n\"The [American Society of Nuclear Cardiology (ASNC)](https://www.asnc.org/) is urging Congress to take action, as declining reimbursement and the absence of inflationary updates pose grave challenges to physician practices,” said ASNC President [Panithaya Chareonthaitawee, MD](https://www.mayoclinic.org/biographies/chareonthaitawee-panithaya-m-d/bio-20053255), in a statement. “According to CMS, practice costs are projected to rise 3.5 percent this year. Physicians must have increased financial stability to continue providing care to patients.”\n\n# Physician members of Congress understand the impact of Medicare cuts\n\nThe concerns shared by the AMA, MGMA and other medical associations are being echoed by several congressional co-sponsors.\n\n\"The bipartisan Medicare Patient Access and Practice Stabilization Act is crucial to reversing the damaging trend of cuts that threaten our healthcare providers, especially in underserved communities. We must act now to prevent further early retirement, burnout and consolidation,\" said [Congresswoman Mariannette Miller-Meeks, MD](https://millermeeks.house.gov/about), (R-Iowa) an ophthalmologist, in a statement.\n\n\"Physicians, unlike the rest of the players in healthcare, have never received an inflationary update and consistently received cuts. This bill ensures a more stable Medicare payment system, allowing providers to focus on delivering care rather than worrying about losing their practice. With this bipartisan effort, we are working toward a system that supports both doctors and patients,\" said [Congressman Ami Bera, MD](https://bera.house.gov/about/), (D-California) a doctor of internal medicine and former health system administrator, in a statement.\n\n\"After yet another cut to the physician fee schedule, more physicians will be forced to limit the number of Medicare patients they see, or in some cases, shutter their doors. This will result in a lack of access to care for many Medicare beneficiaries. While the price to administer high-quality care has continued to rise over the last 20 years, the Medicare reimbursement rate for physicians has continued to drop,\" explained [Congressman John Joyce, MD](https://johnjoyce.house.gov/about), (R-Pennsylvania) a dermatologist, in a statement.\n\n\"Rising costs and administrative burdens make it clear that Medicare reimbursement policies must reflect the true costs of providing care,\" said [Congressman Raul Ruiz, MD](https://ruiz.house.gov/about/biography), (D-California) an an emergency room doctor, in a statement.\n\n[https://healthexec.com/topics/healthcare-management/healthcare-policy/congressional-bill-could-reverse-medicare-cuts-and-increase-physician-pay](https://healthexec.com/topics/healthcare-management/healthcare-policy/congressional-bill-could-reverse-medicare-cuts-and-increase-physician-pay)",
    "score": 385,
    "url": "https://reddit.com/r/medicine/comments/1inh9ey/bipartisan_bill_medicare_patient_access_and/",
    "created_at": "2025-02-12T03:05:39.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1pdzlpu",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "B.C. has recruited more than 140 health-care workers from the U.S., minister says",
    "text": "Is there a new rush in Canadian healthcare coming? From this article it seems that many more  American doctors are moving to Canada than before and the province is recruiting quickly as salaries in many specialities are competitive and the single payer system makes things more administratively simple so many doctors like that. Do you think this trend will increase and there will be a massive physician and healthcare worker brain drain from the USA? \n\n\nhttps://www.cbc.ca/news/canada/british-columbia/bc-us-health-care-worker-recruitment-1.7640649",
    "score": 382,
    "url": "https://reddit.com/r/medicine/comments/1pdzlpu/bc_has_recruited_more_than_140_healthcare_workers/",
    "created_at": "2025-12-04T13:10:02.000Z",
    "num_comments": 108
  },
  {
    "id": "reddit-1jqh9zi",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Why would anyone work at MGB/Harvard as an attending physician?",
    "text": "I understand why people choose to train at MGB/Harvard affiliated hospitals for residency or fellowship. But why would anyone choose to work there as an attending physician? Salary is low (especially with high cost of living in Boston, the low salary will feel even lower), new attending start out as an instructor and not assistant professor. And I heard they've been more stingy with employee benefits. Does the \"Harvard\" name truly provide a long-term advantage for your career? Is it actually worth it? For those who decided to work there, why did you choose to work at MGB? ",
    "score": 355,
    "url": "https://reddit.com/r/medicine/comments/1jqh9zi/why_would_anyone_work_at_mgbharvard_as_an/",
    "created_at": "2025-04-03T12:36:05.000Z",
    "num_comments": 110
  },
  {
    "id": "reddit-1i2sj1y",
    "subreddit": "medicine",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "13 numbers on plummeting physician pay",
    "text": "**2.83%.** The physician pay cut CMS finalized on Nov. 1 in its 2025 Medicare hospital outpatient prospective payment system and ASC payment system. \n\n**1.25%.** The physician pay [cut](https://www.beckersphysicianleadership.com/compensation/cms-axes-physician-pay.html) CMS finalized in its 2024 Medicare hospital outpatient prospective payment system — a 3.4% decrease from 2023. \n\n**Up to 9%.** The additional cut physicians could have [faced](https://www.beckersphysicianleadership.com/compensation/the-additional-pay-cut-physicians-are-facing-in-2024.html) in 2024 due to the cost-performance category of the merit-based incentive payment system.\n\n**5.** The number of consecutive years CMS has cut physician reimbursements. \n\n**13.** The number of specialties that saw year-over-year pay increases of 3.4% or less. According to May 12 [data](https://www.bls.gov/news.release/cpi.nr0.htm) from the Bureau of Labor Statistics, the Consumer Price Index, a common inflation metric, increased 3.4% in 2024. This means that 12 specialties, all with pay increases of 2%, according to [*Medscape's*](https://www.medscape.com/slideshow/2024-compensation-overview-6017073#7) 2024 report on physician compensation, essentially received pay cuts compared to their salaries last year. \n\n**2.3%.** The decline in physician reimbursement amounts, per Medicare patient, between 2005 and 2021 when accounting for inflation, according to a [study](https://www.neimanhpi.org/press-releases/continued-medicare-reimbursement-declines-could-threaten-access-to-physicians/) from the Harvey L. Neiman Health Policy Institute.\n\n[https://www.beckersasc.com/asc-news/13-numbers-on-plummeting-physician-pay.html](https://www.beckersasc.com/asc-news/13-numbers-on-plummeting-physician-pay.html)",
    "score": 323,
    "url": "https://reddit.com/r/medicine/comments/1i2sj1y/13_numbers_on_plummeting_physician_pay/",
    "created_at": "2025-01-16T16:16:54.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1on29fs",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "CT Tech Vs Resident Salary",
    "text": "Talking to a CT Tech working in BFE Missouri. 40hrs/wk, $3750/wk gross, $15k/mo. For those thinking BS like I did, she showed me her payslip. \n\nMe, a pgy3: “79hrs/wk”, $5300/mo\n\nLet that sink in 🙃🙃",
    "score": 316,
    "url": "https://reddit.com/r/Residency/comments/1on29fs/ct_tech_vs_resident_salary/",
    "created_at": "2025-11-03T04:13:11.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1kbitgl",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Financially Doomed",
    "text": "I’m $450,000 down in loans, after residency going to move back to a HCOL area (avg house $800k), make maybe $300-350k(?) as a new grad, and going to be starting a family with my SO stopping full-time work for at least a couple years (salary $80k). \n\nI get panicked when I think about this reality. I’ll be renting until I’m 40, and all my money will go to loans, kids, etc.. Feels like there’s no real light at the end of the tunnel and the struggle bus won’t stop for a while lol",
    "score": 294,
    "url": "https://reddit.com/r/Residency/comments/1kbitgl/financially_doomed/",
    "created_at": "2025-04-30T15:07:47.000Z",
    "num_comments": 185
  },
  {
    "id": "reddit-1iqverd",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "What’s the point of TY year",
    "text": "TY year is a the biggest scam and an absolute waste of time and effort. Increase PGY-1 salary to $120-150k and see how fast they try to get rid of it. Speaking of, resident salary is absurd. People with bachelor’s degree getting higher starting salaries. We need to strike and demand for better pay. It’s absolutely unacceptable anyone with MD/DO degree should be paid less than $100k ",
    "score": 289,
    "url": "https://reddit.com/r/Residency/comments/1iqverd/whats_the_point_of_ty_year/",
    "created_at": "2025-02-16T16:05:45.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1ly1is9",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "You don't realize how much residency pay sucks until you get that first paycheck with the taxes deducted.",
    "text": "Look, I'm not saying you can't do *anything* on a residency salary. You can. On top of that, I live in a somewhat low COL area (avg rent here &lt;900) with the hospital sub 2 miles away.\n\nAnd look, pre med school, I've mostly worked under the table for cash and I make way more now than then. And I am thankful for that. To be clear, I def paid taxes appropriately but it was nice to pay them on my own terms instead of having it be decided for me that it will be deducted month to month. Particularly when starting a new job and haven't been making $ for a while.\n\nBut the other side of it is I also work way more than then too. And couldn't exactly get a second job like I did when times were tough. My residency pay is around 5k a month, and given the cheap rent, I was super excited ngl. I definitely had some thoughts about \"oh why do people complain\" but once I got the *post taxes* check, yeah, I 1000% understand why people complain. That website salary is meaningless lol. The post tax one really, really gets you. For more over the table workers, this probably isn't new for you. But damn, I knew residency pay was lower than most who work as much as us, but I wouldn't have guessed it was *that* low.",
    "score": 283,
    "url": "https://reddit.com/r/Residency/comments/1ly1is9/you_dont_realize_how_much_residency_pay_sucks/",
    "created_at": "2025-07-12T14:16:47.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1k57c0o",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "The attendings are telling us to quit",
    "text": "Not to me specifically. To anybody they encounter. They are seriously dissatisfied anesthesiologists. They have an ever-growing list of reasons to be displeased. The mentioned reasons include, but are not limited to:\n\n1) You are always the surgeon's subordinate\n\n2) You are too stressed\n\n3) Patients don't recognize what you do, even other physicians may not sure what you do\n\n4) Most surgeons can't when an anesthesiologist is good so you can't build a reputation\n\n5) The routes of EM, ICU (both sub-specialties of anesthesia here) are not tolerable when you get older. Neither is anesthesia itself\n\nHere if you change your mind and say hey you know what I'm gonna be \\[put the name of a residency you like\\] you won't receive salary for the months you stayed in anesthesiology (or other specialty). I told my attending that I like anesthesia and she said that she can't understand how this is possible nor why the other residents picked it too. She said it's never too late to quit this specialty.\n\nAnd I'm like... why? I really need to find a person who is passionate\n\nPS I never planned on staying an anesthesiologist, I always wanted to become an EM doctor and that road goes through anesthesia.",
    "score": 246,
    "url": "https://reddit.com/r/Residency/comments/1k57c0o/the_attendings_are_telling_us_to_quit/",
    "created_at": "2025-04-22T14:13:14.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1i9fjii",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Doctor life sucks",
    "text": "I am Indian not sure how many in this sub could relate to it, but hopefully mods don’t remove it. I have sacrificed nearly a decade + to pursue medicine. Do i love the job yes. But do i love the outcomes? Heck no. Out here it’s the hospital owners politicians, venture capitalists and the like get the piece of cake rather than doctors. I used to make USD 600 dollars when i worked as a student resident as an attending i make about 1200 USD, for a standard 42 hour work week and i have to work locums and clinics to make ends meet. And it was through rigorous training and unbelievably tough exams like NEET that i have reached here. Sure this is high when you compare this with the average salary of people in other jobs is only around 200USD. You don’t get into it for the money right, but then how are you supposed to feed your family, take care of self and make support for the ward. Respect and dignity don’t feed you. \n\nAlso the violence against doctors in India is ridiculously high. I have seen doctors beat up, i have even broken up a fight during intern period. I was attacked once by a patient who tried to stab me with a glass shard because the govt didn’t think it was necessary to offer security services with in the premises. Also we get only 12 days of leave which cannot be taken more than 4 days continuously. No maternity benefits either for women.\n\nI don’t think medicine is quite as rewarding anywhere as northern hemisphere of America. \n\nTldr life as an attending also sucks when you dont live in the  North American region.",
    "score": 244,
    "url": "https://reddit.com/r/Residency/comments/1i9fjii/doctor_life_sucks/",
    "created_at": "2025-01-25T04:58:14.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1paww78",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "I cannot stand wards and I have 12 more weeks of them",
    "text": "Matched DR currently doing an IM year and I’m feeling crispy. I think the underlying science and medicine of IM can be some of the most interesting stuff in the world, but the practice of it is painful to me at this point. I almost chose IM cause the medicine can be so interesting and comprehensive, but intern year has me thanking the old gods and the new that I only have a year of this.\n\nI’d say my biggest gripe with it is how little medicine a day in internal medicine can have. This may be my bias as an intern tasked with doing all the scut, but I feel like only 30% of my time (at best) is spent actually using my MD and the knowledge that I worked hard to get. I really enjoy the times I get to think about lab values, differentials, pathophys, diagnosis, treatment plans, etc but that is dwarfed by the amount of time I spend reaching out to consultants/case managers, answering endless epic chats, endless chart reviewing, putting in orders, writing notes, getting people to do their jobs (“hey why aren’t those stat labs I ordered 3 hours ago collected?”) etc. I feel more like an overqualified scribe/secretary than I do a doctor half the time. I’m getting more efficient with everything but it’s still tedious and unrewarding.\n\nAnyway time for another 13 hour shift",
    "score": 211,
    "url": "https://reddit.com/r/Residency/comments/1paww78/i_cannot_stand_wards_and_i_have_12_more_weeks_of/",
    "created_at": "2025-11-30T23:28:43.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1jtjgq4",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "POST MATCH THREAD: IF YOU HAVEN'T STARTED RESIDENCY YET AND/OR ARE A MEDICAL STUDENT, PLEASE POST IN THIS THREAD",
    "text": "Since the match there has been a huge increase in advice threads for matched students that haven't started residency yet. Please post all post-match questions/comments here if you haven't started residency. All questions from people who have matched but haven't started yet will be removed from the main feed. \n\nAs a reminder to medical students, \"what are my chances?\" or similar posts about resident applications or posts asking which specialty you should go into, what a specialty is like or if you are a fit for a certain specialty are better suited for r/medicalschool. These posts have always been removed and will continue to be removed from the main feed.",
    "score": 103,
    "url": "https://reddit.com/r/Residency/comments/1jtjgq4/post_match_thread_if_you_havent_started_residency/",
    "created_at": "2025-04-07T11:57:42.000Z",
    "num_comments": 241
  },
  {
    "id": "reddit-1j42xhh",
    "subreddit": "Residency",
    "soc_codes": [
      "29-1211",
      "29-1216"
    ],
    "title": "Leaving my residency, do I still have time to SOAP?",
    "text": "My program is aware, they are extremely supportive. I'm leaving on good terms without any red flags. The specialty is just not a good fit.\n\nI'm coming from an integrated vascular surgery program, looking to pivot into IM with plans to pursue cardiology fellowship. My question is, is it too late to SOAP? I just registered for the match, but noticed that my application needs to be \"verified\" by my former medical school. I know that tomorrow is the last day to alter your rank list so I assume my app needs to be verified by then? Does anyone know?",
    "score": 82,
    "url": "https://reddit.com/r/Residency/comments/1j42xhh/leaving_my_residency_do_i_still_have_time_to_soap/",
    "created_at": "2025-03-05T13:21:59.000Z",
    "num_comments": 35
  }
]