[
  {
    "id": "reddit-1i9wi6u",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "My patient died during a hearing test",
    "text": "First, sorry this isnt a post about a regular audiologic topic, but I always wonderwd if this happened to anyone else? \n\nSo, this happened a few years ago while I was working as an audiologist in scandinavia. Monday morning, got to work with my eyes barely open. First patient was quick, just a normal pure-tone-audiometry for the ENT. Then a quite old lady got wheelchaired through the doors alongside her son. She was 90+, her son in his late sixties/early seventies. She wasnt in very good shape, but could communicate and understood my instructions. She was getting new hearing aids. \n\nGot her into the booth helped by her son. This particular day I had two students with me, they were learning the basics of audiometry. I instructed one of them to start the testing, and I sat next to her observing.\n\nWe got to 4khz on her right ear, and then, no more response. The booth had a window, and I watched her head fall to her chest through it.\n\nI quickly understood something was wrong, and rushed inside and tried to get contact with her, but she was lifeless. I then ran over to her sok and said something like: I think your mother fell asleep (I was really stressed out). He walked up to her and shook her, and then turned to me and said: I think she’a dead.\n\nI have never been in a situasion like this before, but gathered my thoughts and realized there is a doctor and a nurse in the floor above. I ran up, told them what happened, and we all went back stairs. They brought a heart starter, and I called the pramedics. They started giving her mouth to mouth and applying the electrodes on her chest, and her son yelled «no, please, she has said that she dont want medical attention in a situasion lile this, please stop trying to bring her back to life».\n\nThey kept going anyway, but she was dead, and soon the ambulance and a doctor came and called it. Quite a start of the week! Really unpleasant experience.\n\nSorry for all the misspelt words, English isnt my first language",
    "score": 2421,
    "url": "https://reddit.com/r/audiology/comments/1i9wi6u/my_patient_died_during_a_hearing_test/",
    "created_at": "2025-01-25T20:42:27.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1i2qum6",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Not impressed with r/audiology lately ",
    "text": "Is it just me or is this Reddit page going downhill? The description says the page is primarily for audiologists and students but I see a whole lot of posts the last year or so that are clearly from consumers with a lot of pseudoscience and medical advice. I’ll admit first- I’m guilty of giving medical advice at times… Very disappointed and I’m about ready to leave :/ \n\nModerators where ya at? ",
    "score": 149,
    "url": "https://reddit.com/r/audiology/comments/1i2qum6/not_impressed_with_raudiology_lately/",
    "created_at": "2025-01-16T15:02:54.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1kbruu5",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "If audiologists are in demand, why are salaries so horrible?",
    "text": "Seriously every single salary I've seen max out  at 90K, which might be awesome for some, but for me its not ideal at all. Everyone tells me its because this field is so female dominated, but so is nursing. But I have seen multiple $100K+ RN position, whereas for audiology it was lackluster. \n\nSeriously, why are we lowballing AuD jobs so much? Lets start accepting higher positions people!",
    "score": 113,
    "url": "https://reddit.com/r/audiology/comments/1kbruu5/if_audiologists_are_in_demand_why_are_salaries_so/",
    "created_at": "2025-04-30T21:25:43.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1hmmkdb",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Recent trend in tinnitus postings",
    "text": "This sub is respectfully for Audiologists. The increase in recent postings about the harms of sound therapy for tinnitus/ hyperacusis patients by people suffering from tinnitus is distressing. \nAfter spending 20 yrs in this profession, I still can never predict how a patient with severe tinnitus will react to amplification and I think it goes without saying that my fellow colleagues would say the same thing. Also, refer when case is beyond my scope. \nI also think there is consensus that if something is making it worse, stop.To those posting here lately suggesting we are gaslighting our parents, I  am sorry you have that feeling but it is deeply hurtful to assume we are not looking out for our patients' best interests. We welcome friendly debate but please stop with the gaslit rhetoric. \nSincerely, an Audiologist that will not force you to do anything you do not want to do. \n",
    "score": 111,
    "url": "https://reddit.com/r/audiology/comments/1hmmkdb/recent_trend_in_tinnitus_postings/",
    "created_at": "2024-12-26T11:31:07.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1mhsqjf",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Patients are horrible",
    "text": "After 25+ years in this field, I’m constantly surprised at how people can be so awful. Just when I think I’ve experienced the pinnacle of entitled and rude behavior, a newer and worse patient appears. Don’t get me wrong, I have many wonderful patients and a great work team… but I almost had to call the police today because an angry patient refused to stop shouting because we needed to reschedule her for being late and not filling out any of her paperwork. ",
    "score": 81,
    "url": "https://reddit.com/r/audiology/comments/1mhsqjf/patients_are_horrible/",
    "created_at": "2025-08-04T23:03:58.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1ilgm3b",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Peds AuDs, how do you deal with kids like this?",
    "text": "I work in ENT and see a fair amount of kids for hearing tests. I recently had a 9 year old boy, neurotypical, who was inattentive during behavioral testing, despite reinstruction, giving false positives every 3 seconds for hand raises. I switched to SRTs and had him repeating words back to me, however he was being somewhat obstinate in his guesses (e.g. Base Mall for baseball, Snow Girl for Snowman, etc). I then tried suprathreshold WRS (60 dB HL) and he was pulling the same shit (Peas for please, Gate for Grape, etc). I'd had it and just stopped the testing if he wasn't going to work with me, especially as an add-on audio. \n\nHow do you deal with kids (or adults even) who are being deliberately disobedient? Mom had zero concerns with hearing so i was positive it was behavioral and not audiologically related.",
    "score": 76,
    "url": "https://reddit.com/r/audiology/comments/1ilgm3b/peds_auds_how_do_you_deal_with_kids_like_this/",
    "created_at": "2025-02-09T15:03:50.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1mhvr9a",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Tired of the pay",
    "text": "I’ve always known audiologists aren’t exactly rolling in cash, but it’s getting ridiculous. In 2025, with a doctorate, 10+ years of experience, the ability to sell a ton of hearing aids, and all the hand-holding we do for patients, you’d think $150k wouldn’t be out of reach. Between inflation, the cost of hearing aids, and the workload, I’m feeling burnt out, underpaid, and undervalued. Especially when people who have less training, skills and an overall less serious job make equal or more 🤯. \n\nSigned,\nA jaded career ENT audiologist",
    "score": 72,
    "url": "https://reddit.com/r/audiology/comments/1mhvr9a/tired_of_the_pay/",
    "created_at": "2025-08-05T01:18:58.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1i2j098",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Started my first day in a clinic!! Wanted to share the earrings I made to wear :)",
    "text": "Not an audiologist!! (at least yet) But doing some work in a clinic and was so excited to start and wear these bad boys!!",
    "score": 70,
    "url": "https://reddit.com/r/audiology/comments/1i2j098/started_my_first_day_in_a_clinic_wanted_to_share/",
    "created_at": "2025-01-16T06:41:37.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1lbjw1f",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "ASHA Is Removing DEI Language from Certification Standards",
    "text": "**🖊️ Petition Link**: [**https://chng.it/q8Cy7ZqpNd**](https://chng.it/q8Cy7ZqpNd)\n\nThe American Speech-Language Hearing Association (ASHA) is proposing to remove specific language from Speech Language Pathology and Audiology certification standards - including terms like cultural competence, diversity, equity, inclusion, and culturally responsive practice.\n\nThese terms are not political statements. They represent shared values across our professions: that communication is shaped by identity, culture, language, and lived experience. That systemic barriers impact access to care. That we must be equipped - not just generally compassionate, but specifically prepared - to recognize and respond to these realities in practice.\n\nASHA is proposing to replace this language with broader terms like person-centered care and professional interactions. While those terms have value, they are not interchangeable with equity work. Vague language does not require deep understanding. It does not ask clinicians to name bias, examine privilege, or confront systemic injustice. And if we don’t name it, we don’t address it.\n\nFor many of us, these standards are not just checkboxes. They are commitments. They tell the communities we serve: we see you, we’re learning, and we’re accountable. Removing them sends the opposite message.\n\nThis petition is about making our voices public. Not just for ASHA leadership, but for the next generation of clinicians, for our clients and families, and for anyone watching to see what kind of professional organizations we belong to.\n\nYou can read more and submit private comments to ASHA through their official feedback form here:\n\n🔗 [ASHA's Survey Link](https://view.mail.asha.org/?qs=b0e3d526e5292d67d3def9ec5a7e57ad1e82f2ea5df60f70bf28bad547b370aab1ae6a006ae85e517c601f74fa61f581a3e16e9c3b3930e7f03c8371e4b63afd9693dcc138dbfd929c91eb7be243f9e4)\n\nI have created sample survey responses available [here](https://docs.google.com/document/d/1DNVeq8FWfyfjGXJYy6BrlxRV_95DLCo3o9vcet0yy_w/edit?usp=sharing), to save you time.\n\nBut here's the problem: those individual comments aren’t public. They can be acknowledged without being addressed. They can be quietly filed away and forgotten.\n\nWhat we need now is public outcry. We need to show, collectively, that these values matter to us. That naming bias, culture, and equity is not optional. That stripping this language from our standards erases the lived experiences of the very people we’re here to serve.\n\nSign the public petition before the comment period ends on **June 29, 2025.**",
    "score": 50,
    "url": "https://reddit.com/r/audiology/comments/1lbjw1f/asha_is_removing_dei_language_from_certification/",
    "created_at": "2025-06-14T21:40:36.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1p4q620",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Are we screwed?",
    "text": "I’m graduating in January (funky timeline due to a leave of absence) and I can’t help but worrying it was all for nothing. The field is getting encroached on by techs and gets no respect in most professional circles. Even things like vestibular testing and CI programming don’t seem to be valued by professionals with money and power. Did I go through all this trouble to only have a job for 10 years tops??",
    "score": 42,
    "url": "https://reddit.com/r/audiology/comments/1p4q620/are_we_screwed/",
    "created_at": "2025-11-23T15:56:46.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1p3k74c",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Audiologist is not a professional degree",
    "text": "“Students doing certain degrees may no longer receive the same amount of reimbursement for their studies now that the Department of Education is implementing various measures from President Donald Trump's One Big Beautiful Bill.”\n\n",
    "score": 41,
    "url": "https://reddit.com/r/audiology/comments/1p3k74c/audiologist_is_not_a_professional_degree/",
    "created_at": "2025-11-22T04:32:32.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1mhti8i",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Thank you",
    "text": "Sorry if this goes against the subs rules as I am not an audiologist.\n\nI’ve just seen so many negative posts about the profession. \n\nI wish you guys were paid better and I wish you guys got better respect. \n\nBut I want to say thank you. I had some severe trauma to my ear. I lost all hearing in my right ear.  \n\nMy GP sent me to an audiologist who worked me in within an hour. He prescribed me steroids and had me fill it immediately… He said “don’t go to your normal pharmacist, just full it downstairs and take the pill immediately.”\n\nI’ve had 100% full and complete recovery of all hearing. Had tinnitus for a couple months and now it is completely cured.\n\nI cannot express how grateful I am to this community of professionals. \n\nThank you very much.",
    "score": 40,
    "url": "https://reddit.com/r/audiology/comments/1mhti8i/thank_you/",
    "created_at": "2025-08-04T23:36:58.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1m0215b",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "AuD transition to physician/ENT?",
    "text": "I’ve been an audiologist for 6 years and practicing at the top of our scope (hospital setting seeing all populations and everything including vestib, electrophysiology, implantables, and peds). I don’t see much more upward mobility and not interested in healthcare admin so seriously considering going to med school with the goal of becoming an ENT. I love audiology and hearing and ears but I’m afraid that if I’m getting bored 6 years in, I will definitely be bored in 25+ years. \n\nHas anyone successfully made the transition from AuD to MD/DO and what has the process been like? Working with CI now, I’d love to be an ENT surgeon and feel like I’d have a lot of experience and perspective to offer but the process is intimidating to say the least. I was a good student and did not have trouble through grad school but know med school and residency take a lot of time and effort. I know ENT residencies are competitive but I would hope my audiology experience would give me an upper hand there.",
    "score": 39,
    "url": "https://reddit.com/r/audiology/comments/1m0215b/aud_transition_to_physicianent/",
    "created_at": "2025-07-14T23:25:07.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1k0vxtp",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Why do Audiologists make LESS compared to similarly educated professionals?",
    "text": "Everything about this profession is amazing, I am so interested to become an audiologists, but however the only thing thats making me nervous is the average salary. According to BLS, [https://www.bls.gov/ooh/healthcare/home.htm](https://www.bls.gov/ooh/healthcare/home.htm), you guys make about $87,740 annually, significantly less than Pharmacists, Dentists, Optometrists, Physical Therapists and Podiatrists (btw whom all have a doctorate degree too). \n\nIs it true that if I go into Private Practice only then I can see good money? Or is this profession gonna be doomed?",
    "score": 39,
    "url": "https://reddit.com/r/audiology/comments/1k0vxtp/why_do_audiologists_make_less_compared_to/",
    "created_at": "2025-04-16T21:26:16.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1hscctm",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "I love what I do, but I’m frustrated",
    "text": "I’ve been in the field for about 10 years now, and I’m worried that audiology will not be a long-term career for me. I feel burnt out. I see eight patients every day, 5 days a week, with zero administration time, and I’ve noticed that I am so mentally exhausted by the end of the day that I don’t have any energy to do anything else. I feel like there are so many demands for audiologists to do better, but the payout or benefits don’t equate to that. Has anyone else had feelings like this? Does anyone have any recommendations on what I should do to stop feeling like this?",
    "score": 39,
    "url": "https://reddit.com/r/audiology/comments/1hscctm/i_love_what_i_do_but_im_frustrated/",
    "created_at": "2025-01-03T02:57:12.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1nxvjik",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "AuDs who are happy - please share!!",
    "text": "Hi all,\n\nI feel like there is a lot of (very understandable) frustration/negativity/etc on this sub and in the AuD grad school sub. I totally get it...there are aspects of our profession that are really frustrating and that we should continue to work to change.\n\nThat said, I would love to hear the things that current AuDs or even AuD students LOVE about their careers. What makes you happy? What makes you content? Anything goes, please just share something (or many things!) that you enjoy about your job and/or our profession to spread some love and sunshine this weekend. :)",
    "score": 38,
    "url": "https://reddit.com/r/audiology/comments/1nxvjik/auds_who_are_happy_please_share/",
    "created_at": "2025-10-04T14:31:35.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1lh2au0",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "I don't understand overmasking / masking dilemma",
    "text": "I am an audiologist, practicing almost 5 years, and understand the principles of masking, such as when it's needed and starting levels, interaural attenuation, etc. \n\nWhat I struggle with is \"overmasking\" and masking dilemmas. I don't understand what constitutes overmasking or when I can officially call something a masking dilemma (I just write \"could not mask effectively). \n\nCan someone please explain both to me as nicely as possible with examples? I am so disappointed with my grad program, graduating and doing my externship during covid, I feel like i got robbed of a lot of practical experiences. So please be kind.",
    "score": 37,
    "url": "https://reddit.com/r/audiology/comments/1lh2au0/i_dont_understand_overmasking_masking_dilemma/",
    "created_at": "2025-06-21T17:43:49.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1nrzg2x",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Hearing test song",
    "text": "Thought some of you may enjoy this. Awhile back I made a song entirely out of hearing test and hearing aid calibration sounds. I took my phone to work and recorded all the sounds from the soundfield speaker (pure tones, ISTS, spondees, various calibration squelches, etc.)  Took them home and loaded them onto my sampler (Digitakt 2) and made them into percussion, melody (thanks pure tones), some ISTS vocal chops. Anyway, this one goes out to those of you who hear these sounds all day. ",
    "score": 33,
    "url": "https://reddit.com/r/audiology/comments/1nrzg2x/hearing_test_song/",
    "created_at": "2025-09-27T16:24:52.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1iw4em7",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Comparison of Apple's AirPods hearing test vs office test (unilateral conductive loss)",
    "text": "I'm not an Aud, but I am a hearing-impaired data nerd with a science background. I recently picked up some AirPods Pro 2, which feature the hearing test and OTC hearing aid function. I also saw an audiologist for an in-booth test this week, which gave me the opportunity to compare the results. I think they are interesting and figured maybe some folks here would be curious as well.\n\nBackground on my hearing: I (43F) was first diagnosed with unilateral mild-moderate (initially 25-40dB) conductive loss 14 years ago. The first ENT I saw attributed it to otosclerosis, though I've always scratched my head a bit given my bad ear's high compliance (Ad curve). Both the compliance and my thresholds have gradually increased through the years, and the 2k bone notch has deepened to almost no gap at 2k. Pressurizing my ear noticeably improves my hearing until it releases. (Sharing all this not as a hunt for a Dx but in case the mechanisms underlying my loss might influence how the tests work.)\n\nI took the Apple hearing test 5 different times in a very quiet space over a few weeks leading up to my audiologist appointment, with the last test taken the same day as my appt. If nothing else, the test is impressively reproducible, in my experience. However, I was immediately suspicious of the results, especially at low frequencies, since they would suggest my hearing below 1k has meaningfully improved over every test I've had since diagnosis. Both the audiologist's results and my lived experience debunk any notions of that miracle.\n\nAnyway, I plotted all the Apple tests against my official audiogram. Forgive the negative axis and not-perfectly-matched symbols; I did the best I could with Google Sheets.\n\nThe Apple test gives me undue credit in both ears at the low frequencies. Given how much more firmly the AirPods sit in my ears compared to the foam inserts, I'm wondering if perhaps I'm picking up the tones via some bone conduction?? Whatever the case, it got pretty close in my worst frequencies, and the compensating EQ it programmed made for a night and day difference in listening to music. I've since programmed them with my aud-administered audiogram, and I find myself wanting to re-listen to every album I've remotely enjoyed over the last 20 years to experience everything I've been missing. And, since the EQ is programmed into the buds themselves, they aren't tethered to a single device or app... I now use them for work calls and am struggling less when people have less than great mics. This has long been a challenge for me, since my work headset doesn't work well over a HA, and bluetooth through the HA isn't great when you only have the one side.\n\nMy conclusion - the AirPods are generally awesome for someone in the mild-moderate HL range, they seem likely give you an accurate enough hearing assessment to know if you might benefit from seeing an audiologist for a proper exam, and the OTC hearing aid capabilities aren't a total substitute but can make listening to music 1000% more enjoyable. For me, I like that I can use them and alternate between comfortably having a conversation and listening to music without needing to pop my HA on and off. Also great for gardening, the gym, and other times I'm worried about my HA getting abused and would otherwise just deal with feeling half deaf.\n\nhttps://preview.redd.it/m17zbkio0uke1.png?width=735&amp;format=png&amp;auto=webp&amp;s=3c8081136b95aa9c20eaf05621d8ae5502d85888\n\nUpdate 24-Feb: Here's a simplified view, since someone asked:\n\nhttps://preview.redd.it/9qb8l6yp26le1.png?width=735&amp;format=png&amp;auto=webp&amp;s=716a4a484443a190278dcc1ba3935d4fcfa037e4\n\n  \n",
    "score": 33,
    "url": "https://reddit.com/r/audiology/comments/1iw4em7/comparison_of_apples_airpods_hearing_test_vs/",
    "created_at": "2025-02-23T07:05:43.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1lp0p3s",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Audiologist who have moved from the US to another country, what was your experience?",
    "text": "Hello, I am looking to see how would moving to another country would work. I want to know how you find someone to sponsor you? Where you looked? How long it took? How getting accredited works? Etc. Thank you",
    "score": 32,
    "url": "https://reddit.com/r/audiology/comments/1lp0p3s/audiologist_who_have_moved_from_the_us_to_another/",
    "created_at": "2025-07-01T12:44:27.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1paxg10",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "What hearing aids do we think Alison from ‘Code of Silence’ wears? 👀",
    "text": "I only just started watching the show so this is not an endorsement, but I am so curious!! \n\nAlso wondering if anyone has insight on the hearing aid landscape in the UK. I imagine they gave her NHS -issue hearing aids to make things more realistic to her middle class status (as I know there is private-pay as well), but again am curious!! ",
    "score": 31,
    "url": "https://reddit.com/r/audiology/comments/1paxg10/what_hearing_aids_do_we_think_alison_from_code_of/",
    "created_at": "2025-11-30T23:53:20.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1jjukba",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Feeling burned out",
    "text": "This is more of rant really as I'm not sure there is really any good solution. \n\nI'm a Hearing Specialist in Texas operating in a private practice since 2014 when I got licensed - after getting licensed I was accepted into an audiology doctorate program (bio undergrad) but dropped out after being told by several audiologists I was already making more money than them and my job duties wouldn't change much by getting the extra degree - that if I wanted to make 6 figures I'd be working with hearing aids one way or another. I worked out a deal the university and applied my credits to receive a masters in audiology and went to work full time in 2016.\n\nAny way - Idk what my problem is, I'm just tired of the customer service aspect of the job maybe. I feel like a lot of the people I see are really mean and somewhat abusive. I really don't see myself as a \"salesperson\" and don't treat the job that way but so many clients try to treat the interaction like they are buying a used care in 1985 - no matter how professional and patient health oriented I try to make it. I'm so sick of smiling and bending over backwards for people I consider to be retarded assholes and I also don't like that that is how I view half my clients. Even the the nice people are becoming burdensome setting service appointments with me regularly basically just to have small talk. \n\nI see about 7-12 people/day between new tests, services, and a LOT of Tele-audiology and remote fittings for new aids (which really isn't bad but it gets monotonous and repetitive as all hell). \n\nI work in office by myself - no receptionist or anything. All other staff (receptionists, service staff, bookkeeping, etc) are housed in a remote single location that clients do not go to - offices usually have one specialist and that is it. So between appointments I constantly have to get up and interrupt the appointment I'm with to greet a walk-in and they often get really pissed if I can't just drop what I'm doing to troubleshoot their issue - They already have me right in front of them and are already going into their issue and just cant understand that I can greet them but have to tell them I'm with another client please call and make an appointment with a 1 week lead time. For some reason those interactions stress me out so bad.\n\nOn one hand I'm extremely spoiled. I work 9-4:30 m-t and 9-1 on fridays just doing telehealth. I've considered other avenues but it seems like I may already be at the top of the earning field doing around 125k/year. I feel like I just need to see less clients or only do certain types of appointments or something. Constantly jumping through hoops with 3rd parties, price shoppers, services, etc is so tiresome. The 3rd party people are always sooo pissed when we have to charge for appointments and they cuss at me for charging them $65 for 30 minutes of my time\n\nIt goes on and on and I feel like I still haven't been able to express myself well enough here but do what you want with this info. Idk maybe I'm just depressed or something and need a change in scenery ",
    "score": 31,
    "url": "https://reddit.com/r/audiology/comments/1jjukba/feeling_burned_out/",
    "created_at": "2025-03-25T21:14:51.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1nangh9",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Why Hearing aid's are so expensive",
    "text": "Most hearing aids cost more than 12 month's salary of most people in the world. Even OTC one's are min 1000 USD+ . What drives the cost? Or is it distribution that drives the cost high? ",
    "score": 21,
    "url": "https://reddit.com/r/audiology/comments/1nangh9/why_hearing_aids_are_so_expensive/",
    "created_at": "2025-09-07T07:59:03.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1j2k8wl",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Transferrable skills to a new career",
    "text": "For those of you who have been an audiologist in the past and wanted a career change, what did you go into?\n\nI feel like we're very limited in job transfers as (in the UK) it's pretty much just private/NHS audiology work or looking to become some form of hearing aid rep. There isn't really much job diversity in our field if we want to change career, but still involving or relating to the general field of hearing.",
    "score": 19,
    "url": "https://reddit.com/r/audiology/comments/1j2k8wl/transferrable_skills_to_a_new_career/",
    "created_at": "2025-03-03T14:46:32.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1k2y9m0",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "What type of job made you happy?",
    "text": "I’m not as interested in salary for this question. Where did you folks find work that made you happy (or at least at peace and not miserable)?  Common complaints I know, but I am having very bad luck with ENT clinics that don’t understand my value, or hearing aid companies that only see it as a dollar sign. I’m curious if anyone here has non conventional work in audiology that has worked for them, or tips for weeding out bad employment opportunities? ",
    "score": 17,
    "url": "https://reddit.com/r/audiology/comments/1k2y9m0/what_type_of_job_made_you_happy/",
    "created_at": "2025-04-19T15:03:34.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1jwd6hc",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "How much do you make as a private practice owner?",
    "text": "Title. Is it really true that if you own your own practice (or multiple ones) that you can make 6 figures consistently? For those who have their own practice, whats your salary and how did it start off with?",
    "score": 17,
    "url": "https://reddit.com/r/audiology/comments/1jwd6hc/how_much_do_you_make_as_a_private_practice_owner/",
    "created_at": "2025-04-11T00:30:42.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1mj0p67",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Vestibular predicament",
    "text": "Hi! I’m a vestibular audiologist working adjacent to an ENT clinic (we are distinctly different departments allegedly) with PAs and otologists. We’re absolutely buried in vestibular patients thanks to some outdated clinic policies, wishy washy ENT philosophies and the neurology department refusing to see patients unless we’ve done testing. \nI have devoted my career to vestib and have a pretty good knowledge base but by no means think I know it all. I recognize our scope is non- diagnostic but depending on the day, the otologist who more or less is our decision maker feels that we are either overpaid techs (her words) or should be doing more counseling and differential diagnostic decisions and recommend different treatments. It’s so confusing but I’ve realized  that it’s likely a way to offload the work from the PAs who admittedly hate don’t like ears or vertigo (wrong department imo) and keep their referral stream more manageable. \nI do not diagnose patients and I’m really careful when counseling but find that people are just not really getting the help they need. I find I counsel about different possibilities of causes of symptoms and will help them make VRT plans so they can get started or modify what they’re doing to prevent plateaus. Patients are so appreciative but I feel like I WANT to be doing more and depending on the day ENT does to, but the scope will not allow for it. I’ve toyed around with going to PA school but the time and cost would be terrible. \nDoes anyone out there in vestib world have a similar predicament or even in adult diagnostics? I feel like this is a common rock and hard place we fall into. ",
    "score": 16,
    "url": "https://reddit.com/r/audiology/comments/1mj0p67/vestibular_predicament/",
    "created_at": "2025-08-06T10:10:38.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1kwbljh",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Audiology or Pharmacy or Optometry?",
    "text": "I really cannot decide btw these 3 professions. I'm a current Speech Undergrad major, but I am really loving Audiology and the classes and everything about it. At one point, I was interested in Pharmacy, but decided against it bc of saturations and limited career prospects (you need a PGY-1/2 residency to get into hospital positions these days).\n\nI looked into Optometry, and loved everything about it (higher salary than AuDs, more prescribing authority, etc), but I felt that its wayy too competitive to get into Optometry school and take the OAT exam.\n\nAudiology doesn't really require a \"set\" entrance exam, just the pre-req courses. I am disheartened by the salary and limited scope of this field, but LOVE what an audiologist does on a daily basis. \n\nAm I making the right decision?",
    "score": 15,
    "url": "https://reddit.com/r/audiology/comments/1kwbljh/audiology_or_pharmacy_or_optometry/",
    "created_at": "2025-05-27T01:52:25.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1pfhh2v",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Fears of Audiology becoming oversaturated",
    "text": "Hello, I just recently made a post earlier this week but it is now midnight and my mind can not stop racing about this. I’m going to college next year I have planned out my life since middle school, I’m going to take all the speech and hearing prerequisites in undergrad apply to a dual Aud/Phd program and finally get to call myself an audiologist by 2036-2037. But I fear that by time I get to finish my schooling the career field will become so oversaturated that it will be hard to find a job. I know audiology is a rapidly increasing career path and I also know that hearing loss is going up in all generations (especially mine gen z). I just fear that all my hard work and passion will just result in me fighting just to land a job that pays less than my student loans paybacks. I love audiology to my core. It’s the thing that keeps me going I love the ear, language, and communication. I love learning about hearing aids and CIs. I love interacting acting with the Deaf/HoH community. I have never wanted something more. But at the end of the day I also want to be able to make a living. I can’t tell if I’m being irrational or if this is a valid fear. Sorry for my rant I’m truly just an anxious teenager. ",
    "score": 14,
    "url": "https://reddit.com/r/audiology/comments/1pfhh2v/fears_of_audiology_becoming_oversaturated/",
    "created_at": "2025-12-06T05:33:52.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1idkamf",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Educational audiology",
    "text": "I'm an early career audiologist and so far I've only been in ENT and hospital clinic settings. I'm planning to move out of state within the next year, and I'm seeing openings for educational audiologists in the area that I'll be moving to. My experience in this area of practice is extremely limited, I never did a single educational audiology placement in grad school. But prior to changing careers I was working in education (ESL) for about a decade so I'm wondering if it would be a good fit for me.\n\nI'd love to hear from anyone who has made a similar switch, or just any educational audiologists in general. What is your day to day like? How does it compare to working in clinic? Do you love it, hate it, somewhere in between?",
    "score": 13,
    "url": "https://reddit.com/r/audiology/comments/1idkamf/educational_audiology/",
    "created_at": "2025-01-30T10:44:39.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1mvucz9",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "A question about audiology",
    "text": "Hi. I recently discovered this career and it seems like an interesting field. As I looked for more information, I quickly realized that this is a job that requires communication. My question is, can you perform your duties as an audiologist if you have trouble speaking English? I'm from a Spanish-speaking country and while I have no problem communicating (I interact with American co-workers regularly), I know my spoken English leaves a lot to be desired. Will this be a barrier if I pursue this occupation, considering I want to practice in the States? Thanks in advance.",
    "score": 12,
    "url": "https://reddit.com/r/audiology/comments/1mvucz9/a_question_about_audiology/",
    "created_at": "2025-08-20T23:05:11.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1n9upup",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Are audiology companies in the UK selling new grads a dream with over £50K OTE claims?",
    "text": "I am a recent graduate currently looking for my first role in audiology and I’m trying to get a realistic sense of salaries in the UK’s private sector. I have seen some companies advertise £40K basic salaries with total earnings ranging from £50K to £100K through commission. \n\nFor instance the hearing care partnership advertises their roles with an apparent possible salary of £70K - £100K \nOn the surface it sounds great, but I am skeptical as to how achievable this is in practice. It seems like it may just be a best-case scenario recruitment pitch.\n\nIf anyone has experience with the hearing care partnership or other private providers, what do audiologists actually tend to earn once commission is factored in? \n\nAny insights on how commission structures usually work in the industry would be greatly appreciated. As would some input into what salary I could expect to earn as an audiologist in the UK in general.  \n\nThanks in advance for any responses 😃\n",
    "score": 11,
    "url": "https://reddit.com/r/audiology/comments/1n9upup/are_audiology_companies_in_the_uk_selling_new/",
    "created_at": "2025-09-06T08:54:40.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1jh0qw2",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Audiology student seeking advice",
    "text": "Hi audiologists of Reddit! I'm an AuD student in their second year of their program and I've been facing a lot of burnout lately. I'm struggling to see where I fit in in the field and sometimes I wonder if I'm better suited for a different career. I was wondering if I could ask for some advice here and I would love your input and perspectives if you'd like to share them!\n\nI initially became interested in audiology as a career because I loved the rehabilitation and accessibility aspects of it. I enjoy performing testing and the devices are cool and very essential and all but the tech just doesn't interest me that much personally. Fitting hearing aids is so so important but right now it's hard to see myself with that as the bulk of my work, it just doesn't feel for me I guess. My auditory rehab class in undergrad really got me hooked on the field because I feel excited to help patients through a difficult part of their lives and work with them in the hearing and communication realm to improve their quality of life. I was looking forward to doing a lot of counseling and helping people work with their devices to achieve a better quality of life, but after having been in the program and in a variety of placements it has all felt a bit tedious and impersonal to me, like there isn't that level of human connection and collaboration that I was hoping to find. The only exception has been at the university clinic, where there is much more time than in pretty much all non-teaching settings. I've spent a lot of time at ENT practices as an assistant and that just wasn't for me — I loved working with patients but everything felt extremely procedural and rushed, like there was barely any time to interact in a personable manner and really counsel them with anything. I feel like I also had to pick up the slack for audiologists that didn't have time to cover everything during their quick appointments. \n\nWould you recommend a specific side of the field, like tinnitus management, working with CIs, vestib, etc. for someone like me who enjoys counseling much, much more than fitting?  Or do you think that if I want to work with counseling and rehab so much, should I just become a mental health therapist or OT or something else instead? Sometimes it feels like I'm missing the mark of what I should be doing in this field but there's so much I like about it that I want to stick with it. Would love to hear any thoughts and opinions on this, and if you read this all, thanks for your time!!",
    "score": 11,
    "url": "https://reddit.com/r/audiology/comments/1jh0qw2/audiology_student_seeking_advice/",
    "created_at": "2025-03-22T04:44:29.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1nlgyjz",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Is AuD mom-friendly?",
    "text": "Hey guys! I'm a senior in my undergrad program just starting to apply to grad schools for audiology. I know that I want to have a fulfilling career throughout my life, but my number 1 goal is to be a mother and raise my children. I was wondering if there are any mother/audiologists out there who can tell me about the work-life balance in this career? Thanks so much!",
    "score": 11,
    "url": "https://reddit.com/r/audiology/comments/1nlgyjz/is_aud_momfriendly/",
    "created_at": "2025-09-19T22:08:24.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1owdvfm",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Are private practice audiologists making $$$?",
    "text": "IK money is not everything, and that you have to look at different aspects of your job: lifestyle, stress, salary, workplace.\n\nBut as a current undergrad, I really want to open my own practice in Audiology and be able to benefit society. It's gonna be a while to get there, but if I have that goal in the long run, is it feasible to be able to make at least $200K+?\n\nPopulation only grows older, and hearing loss will be inevitable and will increase overall. So is this a goal attainable, as I am both really passionate in both audiology and the business venture side to it.\n\nAny input much appreciated!",
    "score": 10,
    "url": "https://reddit.com/r/audiology/comments/1owdvfm/are_private_practice_audiologists_making/",
    "created_at": "2025-11-13T21:39:59.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1ogsahf",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Honest thoughts from UK audiologists — is the profession plateauing or still worth pursuing?",
    "text": "Hi everyone,\n\nI’m currently exploring a career in audiology and I’ve noticed a lot of mixed opinions about the profession. Many discussions seem to suggest that audiologists and hearing aid dispensers often end up doing very similar work, and that audiology might just be an overqualified or roundabout route to becoming a hearing aid dispenser.\n\nFrom what I understand, becoming a qualified audiologist offers access to work within the NHS or hospitals, which is something that really interests me. However, I’ve also seen that many audiologists are leaving NHS roles due to low pay progression, and then moving into private sector hearing aid dispensing.\n\nThis has left me feeling quite conflicted. I genuinely want to pursue audiology because I’m passionate about hearing health and patient care — but I also don’t want to invest years into a degree and training if the career ultimately leads to limited progression or the same roles available through an apprenticeship route. \n\nI’d also really like to hear about the salary progression side of things. From what I’ve seen, it looks like newly qualified audiologists start on around £30k or so, but I’m unsure what the reality is after a few years in the job. What does pay actually look like after about five years of experience — is there much upward movement? And for those earning in the £50–£60k range, how did you get there? Was it through private work, management roles, extra training, or something else entirely? I’d really appreciate any honest insight into what the financial progression looks like in this career.\n\nCould any UK-based audiologists share their honest, even brutally honest thoughts about the profession? How do you feel about your career — has it been rewarding, or do you feel it’s plateauing? Would you still recommend it to someone just starting out?\n\nAny insight would be hugely appreciated.",
    "score": 10,
    "url": "https://reddit.com/r/audiology/comments/1ogsahf/honest_thoughts_from_uk_audiologists_is_the/",
    "created_at": "2025-10-26T18:38:47.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1jya2gm",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Is it worth it?",
    "text": "Hello, I’m a second year college student and going to start my CSD next semester, it will take me another two years then grad school would take me another 4 years and a ton of tuition, is it worth it being an audiologist? Do you regret it? Ik the pay isn’t great but do you think it would increase overtime? \nI really need help time is running out and I still haven’t decided on a career yet, any help would be appreciated ",
    "score": 10,
    "url": "https://reddit.com/r/audiology/comments/1jya2gm/is_it_worth_it/",
    "created_at": "2025-04-13T15:20:55.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1hwo5aw",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "AP Anatomy &amp; Physiology - Audiology Guest Speaker Ideas",
    "text": "Hi All! First time posting here - I'm an AuD based in the United States and have been working as a VA contractor for the last 4.5 years since graduating. I've been invited to speak at a local AP Anatomy and Physiology class (high school juniors and seniors) to share a little bit about audiology as a career, as well as briefly discuss basic info (hearing aids, cochlear implants, balance system, etc.) I've been told the students will have already covered their \"sensory\" unit including hearing. Unfortunately the class is only 40 minutes long, which doesn't leave much time. There are 22 students.  \n  \nI'm looking for ideas about how to interactively engage the class and get them interested in audiology, or at the very least, some memorable activity involving hearing and balance (an idea: spin classmates on chairs then stop them and look for nystagmus? Hearing loss simulation videos? Teach them how to look in ears safely so they can visualize a TM?) I don't have any ear or CI models at my clinic, only hearing aids/otoscopes that I could feasibly bring in for hands-on experiences. I do plan to give out ear-shaped erasers as well as \"Only You Can Prevent Noise-Induced Hearing Loss\" stickers from Etsy. Thanks in advance! ",
    "score": 10,
    "url": "https://reddit.com/r/audiology/comments/1hwo5aw/ap_anatomy_physiology_audiology_guest_speaker/",
    "created_at": "2025-01-08T16:27:27.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1jhcok8",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Is Audiology a good career to go into?",
    "text": "Hi! Im about to be a freshman in college and I plan on majoring in CSD and becoming an Audiologist in the long run. I feel very passionate about it and I am excited for it!\n\nHowever recently I’ve been overthinking it and having doubts if it’s the right career I want to go into. I have heard the pay isn’t great for the amount of school it requires and I really don’t want to become a “hearing aid salesperson”. I am super interested in patient interaction and I would love to work in a medical/clinical setting. Is this achievable with audiology? What would be the best thing to specialize in to achieve the more clinical feeling with patient interaction?\n\nI guess I just want to ask actual Audiologists on here if you love your career and if you think it’s worth it etc etc. I would love to hear first hand accounts from anyone in the audiology field (whether an AuD student or a practicing Audiologist) about your job and experiences and stuff!!",
    "score": 10,
    "url": "https://reddit.com/r/audiology/comments/1jhcok8/is_audiology_a_good_career_to_go_into/",
    "created_at": "2025-03-22T16:43:17.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1l8zhzg",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Realistic to solely pursue vestib?",
    "text": "Howdy! Currently a 3rd year AuD student at a large state school in the US. At the moment I feel like it’s hard for me to be interested in a side of the field outside of balance. Is it at all realistic to focus solely on vestibular audiology for externship, career opportunities, etc? Or will that constantly be an uphill battle…\n\nNot like I hate all other sides of the field, but I feel far more passionate about balance than most other things. I do love counseling though so tinnitus management is also attractive",
    "score": 10,
    "url": "https://reddit.com/r/audiology/comments/1l8zhzg/realistic_to_solely_pursue_vestib/",
    "created_at": "2025-06-11T18:00:14.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1kkt95h",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Terrible start to my career.. what should i do?",
    "text": "I live in Virginia, I am deaf in my left ear and wear one hearing aid in my right ear and my dream is to be an audiologist assistant, i graduated with my associates degree in 2024 and wanted to continue my education with the asha C-AA credential. completing 1,000 hours as an intern position under supervision of an ASHA certified audiologist to get myself the certification to be a licensed hearing specialist.\n\nI began with my first location on October 2024, they let me in to start but it really wasn’t what i expected. I was getting taught from the front desk for admin work and a month went by without me getting to learn the tech stuff. they assigned me to work on only Mondays and Tuesdays every week. Most of the time i was left alone with nothing to do since they didn’t bother to give me any tasks. I would frequently ask if there’s any work i could do but their same answer was that they will ask the main audiologist to give me more stuff. Eventually i was able to work on basic stuff like sending out invoices, my co worker’s overdue tasks that were many years old? and testing some hearing aids that came back from repair, making phone calls telling patients that their aids were ready to be picked up. that’s about it. then late November i was terminated. The reason being they had no work for me. I could say i saw it coming, this place was no help at all. I felt mistreated and that they didn’t even try. \n\n I asked my own audiologist if there was anyone in the area that’s looking for help, any opportunities that could provide with the chance for the certification. She did gave me a place right away for me to look into, and i emailed first chance i got.\n\nThen i got accepted to work with the second location right away on March 2025, and it was a complete opposite of the last place. They allowed me to work with me going full time as an audiologist assistant in 3 months. The two main audiologists of the place were Titans. with one being 20 years of being an audiologist, and the other with 30 years. I was put to training the second i got there with amazing co workers willing to help. I learned super fast thanks to them, and worked every day with getting tasks left and right. In less than 3 weeks, I knew how to do everything my Co-workers could and was put to audiologist assistance training. What i’ve finally been waiting for. I enjoyed it, and the audiologist i worked with was the best teacher i could have. We worked as a team, she would always give me pointers and advice on how to get things done correctly. And most importantly, she cared. \n\nI was born with profound hearing on my left, and needed a Cochlear implant. Throughout all my life, it never worked out and i stopped using it. After having the first surgery failed, I had to have a 2nd surgery and after hoping that it would work, it still did not. I would always have trouble trying to hear through the left ear.\n\nI told my audiologist teacher everything since she was willing to hear, and offered me to try out the new Cros phonak hearing aids. I somehow never heard of these before, and I was extremely shocked when i tried them on. Because for the first time, i was able to hear through my left ear. I was visibly happy and i thankful for telling me about it. She allowed me to keep it until i am ready to make a decision on getting Cros phonak aids. \n\nAfter one full month of training my teacher told me that I am going to run the ship all by myself. My co worker (who also was my teacher) was sick and not coming back for a long time and it was just me as the only tech in the office. It was then up to me to show what i’ve learned.\n\n2 months go by and I am fully trained as an audiologist tech and assistant. I am able to see patients one on one and help them with any trouble they have with hearing aids. I am in charge of lots of things, and I am happy because i’m really enjoying this job.\n\nJust the week before May began, My audiologist teacher told me that she was retiring on the end of June. I was a bit saddened by this news since she was the best teacher i could have and i wish i got to work with her longer. But i am happy for her and wish all the best.\n\non May 2025, I suddenly got terminated because they were dissolving the intern position at the location. After an ongoing insurance issue, the company had a big financial loss. And it was very poor timing. I was devastated. I had to return the Cros hearing aids immediately and it was hard going back to hearing on only one ear. My teacher audiologist with 30 years of experience was also terminated too and I didn’t even get the chance to say goodbye. What should i do? I was so happy being there. I even offered to work there for free. I just need the experience, or anything to help me get back on track.",
    "score": 10,
    "url": "https://reddit.com/r/audiology/comments/1kkt95h/terrible_start_to_my_career_what_should_i_do/",
    "created_at": "2025-05-12T14:01:01.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1k14x3f",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Interested in this career field",
    "text": "Hello, I’m interested in this career but my family is saying it’s not worth studying, one family member in particular seems to think audiologist will be replaced despite official sources saying otherwise. However, it has slightly gotten to me and while I’m not 100% set on this career for a couple reasons (mainly salary) I do find it interesting as I myself have am heard of hearing and have been in and out of audiologist rooms since I was 3. So I’m just wondering if the people within the field have insight on if it’s a lasting career path? ",
    "score": 9,
    "url": "https://reddit.com/r/audiology/comments/1k14x3f/interested_in_this_career_field/",
    "created_at": "2025-04-17T05:03:53.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1otks88",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Advice for new grads about to start their first job?",
    "text": "Hello there! I'm a new canadian graduate and I'm starting to get my first offers of employment come in. The thing is, I am quite nervous about starting to work as an audiologist \"for real\", about making the wrong choice of which job offer to accept, and... I think I just have alot of general anxiety about starting my career...\n\nDoes anyone here have any advice for new grads?\n\nThanks a million.",
    "score": 8,
    "url": "https://reddit.com/r/audiology/comments/1otks88/advice_for_new_grads_about_to_start_their_first/",
    "created_at": "2025-11-10T17:56:01.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1mjmnee",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "What is your favorite thing about your role",
    "text": "I began my audiology program this month, and I am very excited. I know that in any profession, it is very easy to see the negative, but I would love to hear some of your favorite things about being an audiologist. Even on days where you’re groggy and just over it, what makes you glad you chose this career? ",
    "score": 7,
    "url": "https://reddit.com/r/audiology/comments/1mjmnee/what_is_your_favorite_thing_about_your_role/",
    "created_at": "2025-08-07T01:16:16.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1k3c954",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Pre Grad School Job Advice?",
    "text": "Hello. I am looking for advice and suggestions for jobs. I was recently rejected from grad school. I had great grades in undergrad and did a ton of research. I know my faculty very well and made relationships with faculty from different schools. I'm not too worried about the rejection or grad school at this point. \n\nI am looking for a job, though. I can't seem to find anything I am qualified to do. My degree is in Speech-Language and Hearing Sciences. I am not qualified to be a SLPA (and would prefer not to get certified for a career I dont't want to pursue). There aren't any audiologist assistant jobs available. Unlike SLPAs, Aud assistant jobs are available for anyone with a highschool diploma and unregulated in my state. I can't seem to find any hearing screening jobs that aren't asking for a licensed registered nurse. What else is there? I'm really struggling with my self worth and I am regretting my undergrad degree. It seems to only be useful if I get my AuD. Otherwise, I have no prospects. I'm hoping I'm wrong about that. \n\nAre there any jobs that are considered \"in the field\" for between undergrad and grad school?\n\nExtra context: I am applying to be a hearing aid dispenser, but I am unlicensed. Costco trains and pays for licensing. I have applied to every Costco near me. If you know of any other ways to get licensed to dispense hearing aids, please share! The one apprenticeship I found requires relocation across the country.\n\nThanks!",
    "score": 7,
    "url": "https://reddit.com/r/audiology/comments/1k3c954/pre_grad_school_job_advice/",
    "created_at": "2025-04-20T02:11:54.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1nhko4l",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Wheelchair friendly career?",
    "text": "Currently looking at a career change because I’ve topped out where I am currently at and there is no where for me to go. I was talking to a person at a party who is an AuD in my local area and she told me about what they do and honestly it sounds really fascinating and scratches my itch of getting people to get the equipment and answers they need to live a more normal life. I’ve watched and read every piece of information i can find over the last two weeks and also talked with my local university. My only issue is getting a better answer than “you can do anything you want to” when I ask “is me being in a wheelchair going to be a barrier or just an annoyance to doing the job of an AuD?” I’m just looking for some real world perspectives and insights. ",
    "score": 7,
    "url": "https://reddit.com/r/audiology/comments/1nhko4l/wheelchair_friendly_career/",
    "created_at": "2025-09-15T12:37:51.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1ljafmm",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Writing externship letters of recommendation",
    "text": "Anyone have advice for writing strong letters of rec for students applying for externships? This is the first year I have supervised students, so it's the first time in my career I have needed to do this. I would love advice from both audiologists who have written letters and from audiologists who hire externs based on these letters. Also, for context, I am a pediatric audiologist writing letters for students applying to children's hospitals/pediatric placements. ",
    "score": 7,
    "url": "https://reddit.com/r/audiology/comments/1ljafmm/writing_externship_letters_of_recommendation/",
    "created_at": "2025-06-24T12:58:14.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1l7i0x9",
    "subreddit": "audiology",
    "soc_codes": [
      "29-1181"
    ],
    "title": "Career change to Audiology UK",
    "text": "Hi all, I'm looking at a potential career change into audiology in the UK and wondered what the best routes are. I would rather a 'work as you learn' apprenticeship type role rather than a 3/4 year degree. \n\nAlso what are differences and pros and cons between retail (Specsavers, Boots) and the NHS? And do you get pushed to make sales in retail.\n\nThanks in advance.",
    "score": 7,
    "url": "https://reddit.com/r/audiology/comments/1l7i0x9/career_change_to_audiology_uk/",
    "created_at": "2025-06-09T22:07:02.000Z",
    "num_comments": 19
  }
]