[
  {
    "id": "reddit-1nzobvh",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Update: tech fired in middle of timing job",
    "text": "Update: apparently the last time the manager spoke to the customer he said the truck would be done this morning (Monday). So right after I discovered my universal harmonic damper installer doesn't work on 2.7 ecoboosts, the customer called to find out if it was done. The manager is on vacation all week so the advisor got to deal with the angry customer. Consequently the service advisor just turned in his 2 week notice.in the meantime I'm waiting for a pulley installer to be delivered tomorrow. I got the chains, actuators, and oil pump belt done though. ",
    "score": 2573,
    "url": "https://reddit.com/r/mechanics/comments/1nzobvh/update_tech_fired_in_middle_of_timing_job/",
    "created_at": "2025-10-06T16:44:58.000Z",
    "num_comments": 184
  },
  {
    "id": "reddit-1myfwx6",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Would it be pretentious to wear these?",
    "text": "I got some ASE certifications last year and I wanted to get some patches for my shirts. A bit hesitant, don't want to rub people the wrong way or look pretentious at interviews.",
    "score": 612,
    "url": "https://reddit.com/r/mechanics/comments/1myfwx6/would_it_be_pretentious_to_wear_these/",
    "created_at": "2025-08-23T23:07:30.000Z",
    "num_comments": 200
  },
  {
    "id": "reddit-1o3g9tx",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Got fired from my dealer today!",
    "text": "So there’s a lot of people getting fired today as I see, and I’m here to add to that lol but I’m a regular tech and just got fired from my dealer due to “performing at an unsatisfactory level”\n\nSo, where I’m at, I get paid hourly, however there are bonuses when my proficiency/flat rate is above my actual hours and my numbers are GREEN, so we’re incentivized to stay above 100% at all times. However it’s been very slow, and I’ve stayed clocked in because at this rate, I’ll get paid more doing hourly than my flat rate hours by a large margin. So, while others clock out and get paid less, I just stay clocked in and get paid normally.\n\nBut you can already tell that this company HATES that move, because essentially they’re the ones losing money, not me. I know what I’m doing, I’m very thorough, I don’t complain, I don’t create drama. I’m just there to work and listen to my music, I rarely even talk to anyone there, I literally just mind my business and do my work.\n\nIt’s been slow, the lube techs have been getting all the preferred services for whatever reason, and us techs have been stuck with recalls and diags with declined repairs and recommendations. So fuck it, I’ve just stayed clocked in, cleaning, doing my modules. The company is making millions, I’m not sacrificing my pay for them.\n\nBecause of that, I’ve been in RED. Doesn’t matter if my proficiency is 92%, hell even 99%, it’s still on RED. So management spoke to me a few times about being on RED and lecturing me about time management and all that. I did and continue to do my best but bro, I got a family to feed, I’m the head of the household I’m the ONLY breadwinner.\n\nSo after a time, I got fired today!\n\nLowkey a bummer, but it just goes to show you that they don’t care about you. All they care about is numbers.\n\nWith that being said, I’m done being a tech. This is an incredibly under-appreciated job and a very unforgiving one. My uncle introduced me to an opportunity a while back, and I believe this is a good time to try that opportunity.\n\nKeep your heads up! Keep moving forward! God is good all the time! And all the time, God is good!",
    "score": 543,
    "url": "https://reddit.com/r/mechanics/comments/1o3g9tx/got_fired_from_my_dealer_today/",
    "created_at": "2025-10-10T23:21:58.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1oen7oo",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Go to professionals",
    "text": "Had a customer come in ask me to do a tune up for him, I told him the price and got hit with \"Why the hell would I pay a woman that much when I can do it myself.\" Three days later her comes back with 3 intermittent missfires XD this was my favorite of the repairs.",
    "score": 475,
    "url": "https://reddit.com/r/mechanics/comments/1oen7oo/go_to_professionals/",
    "created_at": "2025-10-24T03:19:39.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1picbv0",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "One of Those Days That Reminds You Why the Quiet People Matter",
    "text": "Had one of those long, greasy days in the shop where everything feels heavier than it should and nothing wants to cooperate. Midday I’m fighting with a suspension job that looked like it had survived a decade of salted roads and zero love. I’m annoyed, hungry, and ready to let the torch “solve” the problem.\n\nThen one of our senior techs, the calm, no-nonsense guy who rarely says more than a few words, walks over. He watches me struggle for maybe ten seconds, then just says, *“Hold it like this,”* and shows me a trick he probably learned back when these cars were still new. Suddenly the job that felt impossible is done in minutes.\n\nIt hit me afterward how people like him are everywhere in essential work, the folks who don’t get any spotlight, don’t complain, don’t get thanked, but carry entire industries on their backs. Someone mentioned this project called ꓑеорꓲеꓪоrtһꓚаrіոցꓮbоսt that documents the lives of people in jobs like caregiving, recycling, and trades, the kind of work nobody notices until it stops. And honestly, it made me think of guys like him, the invisible backbone of the shop.\n\nEvery place has that one person who keeps things running, not by being loud, but by quietly sharing decades of experience when you need it most.\n\nSo I’m curious, just for conversation:  \nWho was the quiet backbone in your shop, past or present, that made you a better tech without ever making a big deal about it?",
    "score": 465,
    "url": "https://reddit.com/r/mechanics/comments/1picbv0/one_of_those_days_that_reminds_you_why_the_quiet/",
    "created_at": "2025-12-09T16:44:43.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1o0un16",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Part 3: Tech got fired in the middle of a timing job... It lives!",
    "text": "Part 1: https://www.reddit.com/r/mechanics/s/UfcTFovDSz\n\nPart 2: https://www.reddit.com/r/mechanics/s/FdsNSMEvL3\n\nIt sounds much louder in the video. In person it's smooth and quiet. Successfully test drove for 20 miles. The customer picked it up. I double and triple checked enough that I'm sure it won't be back. I did get a brief chance to talk to the customer. I didn't go into detail. I simply said \"Sir, I want to thank you for your patience. I was asked to step in in the middle of this project to make sure it was done correctly. I did the best I could and I'm confident you won't need to bring it back until your next oil change.\" \n\nHe thanked me and said he will be changing his own oil. And we had brief conversation about the decision to make a wet oil pump belt instead of a chain.\n\nWhen the manager gets back, if he still has a job, I'm going to explain why I need a raise, but won't plan on leaving until I see what happens with management and staffing. This experience has given me much more confidence in my own abilities. I got into the automotive field late. I'm 32 and have 1.5 years of automotive experience. I used my past work at a lawn mower shop after high school as my work experience to get my ASE certifications, as they were required with my hiring here. So on paper I'm a \"master\" but in reality most of my experience has been gained on my own vehicles.\n\nThanks for all of your comments!",
    "score": 465,
    "url": "https://reddit.com/r/mechanics/comments/1o0un16/part_3_tech_got_fired_in_the_middle_of_a_timing/",
    "created_at": "2025-10-07T23:21:47.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1mzxtzt",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Just got fired.",
    "text": "Definitely a lot of my fault, some on a level of personal disdain from new GM.\n\nOld GM gets pushed out about 2 years ago. Owner hires a new guy who installs buddies from his previous employer in all departments and puts some tech friends on the line, firing 5 guys in one day.\n\nAnyway, 2 years later and I have made it well known that it was scummy of them to give all the gravy to their friends on the line leaving the rest of us that had been their for 10+ years with brain damage diag work and the occasional recall. \n\nI failed to recommend of failing wheel bearing, or that was their reason for firing me. I hadn't been written up prior to this, so that's why I feel it was a mix of personal beef and my own shortcomings.\n\nNot really interested in wrenching anymore, for anyone, anywhere. Any of you guys switch careers, and if so, into what line of work?",
    "score": 370,
    "url": "https://reddit.com/r/mechanics/comments/1mzxtzt/just_got_fired/",
    "created_at": "2025-08-25T18:02:34.000Z",
    "num_comments": 293
  },
  {
    "id": "reddit-1og6jaz",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "REPLACE SERVICE ADVISORS WITH THOSE TOUCH SCREENS THEY HAVE AT MCDONALDS",
    "text": "I understand why service advisors exist but god damn man why do they get paid so much to be the most annoying middle man. Today one of our new service advisors (he’s “new” as in he used to work here then left and came back) tried to second guess me on if a car really needed rotors as opposed to just cutting them. Not only did I take pictures of the rotors and send through the p/a but I told this jackass to his face that the rotors couldn’t be cut. I’m a flat rate line tech and it just blows my mind that some glorified secretary wants to question me when I’m the one who works on these cars every day. He did some other shit that pissed me off today and now he’s not aloud to come to my bay to ask stupid questions but this all just made me think like why do these guys get paid so much? Right now a lot of dealerships (including mine) are in a drought so us techs are basically eating off of what we sell but we can only sell this shit if the service advisors do their job which a lot of the time they don’t! It blows my mind because they get a commission but will wait 4 hours to call the customer. Most of the time they don’t even call them they just send a text. What kills me is that it’s such a one way relationship man they always ask for favors but what could they really do for me? “I got your back man” ok so does my dead homie and he can’t do a damn thing for me. Now there are good service advisors and they are incredibly valuable but they are rare! A good service advisor works with you and doesn’t get in the way of you because they understand that this is a team effort but what sucks is those service advisors usually have to pick up the slack of the bad service advisors and don’t get the commission for selling another advisors work. Idk man I could go on forever but I’m curious what you guys think about it. How important are service advisors and should they make as much money as they do?",
    "score": 337,
    "url": "https://reddit.com/r/mechanics/comments/1og6jaz/replace_service_advisors_with_those_touch_screens/",
    "created_at": "2025-10-26T00:02:40.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1pehzwv",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "Please help a dad out!",
    "text": "My son is starting in the industry.  He's been working at the local shop for a few months, and loving it.  He's planning on a 2 year program for school next year.  I would like to buy him a diagnostic scanner.  Any advice would be greatly appreciated.  Here's where I'm at with my decisions. I'm open to suggestions.  I hear the Icon T8 is decent.  ",
    "score": 288,
    "url": "https://reddit.com/r/AutoMechanics/comments/1pehzwv/please_help_a_dad_out/",
    "created_at": "2025-12-05T01:26:31.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1plzndl",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Mechanic here my knees are shot, work’s backing up, and I’m the breadwinner. Need advice",
    "text": "I’ve been a mechanic most of my life, spending most of my days on concrete, crawling under cars, dragging parts around. Lately, my knees are killing me  swollen, stiff, grating with every move I make. Getting up and down from a job has been tough, and it’s really slowing me down. Delays are piling up, customers are complaining, and the cash is slipping away.\n\nThis is the worrisome part because I am the primary breadwinner in my household. It is especially stressful when things are not going so well at my job. On top of my knees, my back hurts, my hands are numb from all the equipment, I am tired even though I am getting plenty of sleep, and the stress is giving me headaches. It feels like my body is depleted, but I don’t have a choice.\n\nI have to keep working in order to survive, but my job is consuming me, which is making all of this even worse. Going to doctors and therapy is a waste of my money and time, which I don't really have, because changing careers is not a possibility because people rely on me.\n\nAre there other mechanics/tradesmen who might know what the situation is like, how to cope with your body betraying your need to provide, even when your body’s not playing along? Just seeking honest advice before I’m faced with a choice I’m not yet prepared to make.",
    "score": 220,
    "url": "https://reddit.com/r/mechanics/comments/1plzndl/mechanic_here_my_knees_are_shot_works_backing_up/",
    "created_at": "2025-12-13T23:49:46.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1odo1cy",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Another one bites the dust",
    "text": "I just clocked out from my last shift as an automotive technician. I was able to put in and work my last two weeks here.I feel bummed out because I really wanted to make this work. I’ve been a tech for 7 years and started from the bottom. I’ve always liked working on cars and still actually enjoy it,but this industry as a whole needs to get the pay system and other issues figured out. I gained a lot of knowledge over the years and it sucks I won’t do what I like to do as a job anymore as well as not see my shop crew that I got along with. I’m leaving for an electrical apprenticeship and I’ll actually be making a little more than what I was currently making, Which I’m looking forward to but I still feel like my passion was being a mechanic. I did look at other shops prior to switching careers but it seems like it’s the same issues everywhere just different locations. Although I am leaving I am interested in seeing what the future holds for technicians and mechanics in the industry as you might have heard of ceos commenting  (or just one ceo at the moment) about not having enough technicians in the industry, maybe there might be changes happening at some point.As for all of you Technicians and Mechanics I wish you all good luck and a better paying automotive career than mine.",
    "score": 212,
    "url": "https://reddit.com/r/mechanics/comments/1odo1cy/another_one_bites_the_dust/",
    "created_at": "2025-10-22T23:33:20.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1nx9jqa",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Fucked up, might be fired. Feel like a fucking idiot and a child.",
    "text": "I'm a lube tech for Hertz Rental Car. Me and another coworker at my shop, let's call him M, don't get along at all. I crashed out. Now I'm suspended without pay while the company investigates. I feel like a dumbass.\n\nContext: I'm fairly new to the trade. Got a lube tech position to start my career. He is an A level technician. At first, we got along fine. We would laugh and joke and he would help me and whatnot. This continued for 11 months. Then, suddenly, he began to indirectly mess with me.\n\nNothing crazy, a lot of little minor things that by themselves, I'd brush off. But he did so many of these minor things that it was really getting under my skin. All of it is dumb petty bullshit and I hate it.\n\nI usually work in the bay thats right next to the tire balancer and tire machine because I do a lot of tires. Then, he started clocking in early and using that bay, forcing me to work across the shop and roll all my tires over there to do them. A little annoying yeah, but honestly whatever. I don't really care. There's bigger issues abound.\n\nI always parked my car in one spot the past year in the lot. Now he takes that spot. Whatever. It's a damn parking space. Who cares.\n\nI'm one of the few people who organizes the oil filter shelf for all our different makes. He messes it up constantly on purpose. I've seen him do it. OK yeah that's not cool. Getting annoyed.\n\nI play chill lofi music in my bay at a soft volume since we can't wear headphones. I ask everyone if they think it's too loud, they dont care. M decides to get his radio and blast his music across the whole shop. Bruh.\n\nI make a mess in my bay during oil changes sometimes, but always mop up and clean at the end of my shift. M antagonizes me for being messy. Fuck you dude, whatever.\n\nAmong other things. This then continues for about a month. I tell manager, he says he'll handle it. Does nothing in 2 weeks. Go to corporate HR and explain. They sit me and manager down and tell him to fix it. He agrees. Does nothing in 2 weeks. I remind him. Says OK ill fix it. Goose egg. Get fed up and make a formal harassment complaint to corporate.\n\nThe next day, everything that can go wrong is going wrong. I wake up late and get into a fight with my mother. Almost get run off the road on the way to work, arriving 15 mins late. Discover I have 4 sets of tires to mount. Get set up, the tire balancer is broken. Ask boss what to do. Boss says mount the tires and then put the cars back in the line to balance them later once machine is fixed. 4 tires on a Malibu mount and balance. The tire changer breaks on me also.\n\nAt this point, I just completely and utterly crash out. I throw the tire iron onto the floor in frustration and cuss up a storm. It bounces outside. I then go out to grab it and I see M staring at me with a really smug look on his face. Lash out at him. Cuss him out. Ask him if he has any more dumb shit to say to me that he already hasn't, if he's happy that I'm upset, among other things. He doesn't reply. I come into work today and get told I'm suspended. They will contact me once the investigation is finished. Ask what exactly is on the table. They say they will have to find out. Could be termination, could be nothing. Could be docked pay. Could be further suspension.\n\nI feel like a fucking idiot. This is all so dumb. This is all so fucking dumb. My stupid mouth and my stupid temper issues got me in trouble AGAIN. It's happened at every single job I've had. Have I improved? Yes. But its still there and I hate it. I hate that I let him get under my skin. I hate that I couldn't keep my cool and crashed out. I'm a grown ass man. This is childish. This is elementary. This is playground bullshit. I hate my fucking temper. I hate my fucking mouth. I hate my fucking stupid mouth that doesn't know when to shut up. I hate all these problems I've caused myself.\n\nSped home today. Hit 125mph on the interstate in a Honda Accord. Locked myself in my room for close to 3 hours now. I feel like I'm about to blow a fuse. Doing all my calming exercises. Gonna go for a drive and hope that clears my head. Hope I dont wreck my car.\n\nThanks for reading.",
    "score": 141,
    "url": "https://reddit.com/r/mechanics/comments/1nx9jqa/fucked_up_might_be_fired_feel_like_a_fucking/",
    "created_at": "2025-10-03T20:01:06.000Z",
    "num_comments": 117
  },
  {
    "id": "reddit-1i1y3x5",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Seriously question.. What are we doing?",
    "text": "So seriously I’m getting tired of seeing people working for scraps in this industry. Trash benefits, horrible wages, clock held over your head all day and being required to keep up with changing technology every year and from what I see people are working for maybe 3 or 4 dollars more per hour then before inflation… Fortunately I got out of this rut and found my way, doing this work for myself but that doesn’t change the fact that if things don’t work out for me I’m back at square one. We need to seriously step up, shops charging 180/hr and complaining about paying a guy more than 30/hr, claiming high rent etc… Sorry it’s not our fault you made a bad business decision by renting and not buying.. We need to seriously wake up, leave your job go find a new one, retell co workers what you make. SPEAK UP!! Half of the problem is these old guys who have been working for chump change at the same place for 30 years so they won’t pay a “new guy” more then what that old guy is making because he will have a fit but he is the one who kept his mouth shut for 30 years. We need to come together and make some serious change because this is getting insane. 9/10 will agree with me but there is always that 1 who sticks up for this trash career because he is in a good spot but doesn’t realize if he lost that job or business closed he would be back to square one again. The only upside is job security, of course we can find a job anywhere… But it’s all trash jobs… The only change I see happening if we don’t do something is when so many people leave the industry the world will have trouble keeping up so they will have no choice but to pay up. Name your price if you will? But why does it have to be this way? Why did we get to this point? What can we do to make change? If I’m missing something please tell me but I been in this business a long time and talked to a lot of people and 99% hate this and wouldn’t recommend it to anyone. Yes of course, “if you don’t like it leave” well now people are starting to when you can make as much as a Union apprentice in another trade starting out for the price they want to pay you to be a skilled tech. It’s 2025 let’s come together and shake this up!! If you agree drop your opinions below and feel free to share this as we need to have everyone on the same page or nothing will change… And nothing has changed but all we can do is try! ",
    "score": 115,
    "url": "https://reddit.com/r/mechanics/comments/1i1y3x5/seriously_question_what_are_we_doing/",
    "created_at": "2025-01-15T14:06:01.000Z",
    "num_comments": 142
  },
  {
    "id": "reddit-1jjn94b",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Question for American mechanics",
    "text": "If I'm being paid flat rate on top of having to buy my own tools, I basically work for myself, I'm my own boss. I'm not gonna be anybody's bitch.\n\nWriter's taking a timing belt waiter? Fuck that.\n\nBoss cutting my hours to give discount to customer? Fuck that\n\nStay late? Fuck that\n\nPicking up tires? Fuck that I only get paid on cars I work on\n\nLike why do you guys endure all these bullshit? With all the technician shortage I heard I thought you guys will have more leverage.\n\nEdit: I'm not American. I am paid salary. I am curious why most American mechanics just suck it up. Where I'm from, boss actually buy the tools, and we got paid on the times we're not working, so we don't have the leverage here",
    "score": 112,
    "url": "https://reddit.com/r/mechanics/comments/1jjn94b/question_for_american_mechanics/",
    "created_at": "2025-03-25T16:18:15.000Z",
    "num_comments": 149
  },
  {
    "id": "reddit-1p02iys",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Heavy Duty Fleet Technician, can I answer any questions",
    "text": "I started my wrenching career on automotive. Worked at a Ford dealer and recieved various certifications. I ended up taking a small pay cut and starting over at a refuse company (trash trucks) now I mostly turn wrenches on equipment. Most of my time is on the road service calls. Maybe I can answer some questions or even give advice to some of the younger guys. Im mid 20s and this field has allowed me to buy a home in SoCal. Love Heavy Duty Fleet work 🤑👌🏽👌🏽",
    "score": 111,
    "url": "https://reddit.com/r/mechanics/comments/1p02iys/heavy_duty_fleet_technician_can_i_answer_any/",
    "created_at": "2025-11-18T04:25:47.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1pn12o4",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Moving too quickly?",
    "text": "Pic of a job i did for attention\n\nHello all! This is my first ever post (I'm also on mobile, please be gentle)\nSo for some background, I (27M) am currently a technical instructor for a certain German manufacturer at a certain tech college (being vague incase anyone I work with sees this haha)\nI started in the automotive industry around 2019 working as a basic maintenance and repair tech at a mom &amp; pop shop while I was doing college, no real diagnostic work other than identifying leaks. It wasn't difficult work and it paid the bills during school so I didn't really have a drive to pursue it as a career. Then Covid hit shortly after and I dropped out of school to try to wait it out and avoid online course work.\n\nNow with school out of the way, I ended up putting my efforts into my automotive skills while I waited out the pandemic. About a year in I moved with my GF to a different city and found a used car technician job at a Nissan dealer (very lucky after realizing how hard it is to find a job at any dealer in the area with my experience at the time). I used my time there to practice my diag skills, go to their training, and get my ASE certifications. I focused a lot into electrical and drivabilty diagnosis and ended up getting my A6,7,8 and L1 ase certs in just under 2 years there. \n\nI moved around 2 other dealers(both different brands) in the area chasing better offers when I suddenly got a call out of the blue from my local tech school asking if I was interested in a position as an instructor. After a few rounds of interviews I got offered the position since my credentials fit pretty much exactly what they were looking for to fill in a specific advanced course in their school. While I would make a little less, I thought it would be a pretty good opportunity so I took it. \n\nAs soon as I started at the school I felt in over my head because while I had the credentials, I just didnt have the skills/experience to really back them up in a practical sense. I stayed focused, however, and learned as much as possible while they were training me and I felt like I did pretty well when I was left on my own. My student surveys were really good, I got all the rest of my ASEs, and the management seemed to really like. They liked me so much that when one of the instructors for our post-grad premium/luxury German manufacturer program left suddenly, my name was put into consideration. (This was just 4 months after starting at the school mind you)\n\nThey ended up making me an instructor for that program and I had to learn a whole bunch of new things really quickly since I never actually had any experience with this brand. I tried the same process as when they first hired me, but there's just so much new information that I have to master enough to teach it, and its getting overwhelming at times. They threw me into this program about 3 months ago, and they already have me leading classes solo and I feel just unbelievably out of my comfort zone that im not sure if I can continue. \n\nI only had around 4ish years of experience as a real technician before becoming an instructor, and now im supposed to be a manufacturer specific technical instructor? For a brand i never worked with??? Sorry for the long winded story of my life, but I just want to see if theres other techs/instructors here thay have gone through something similar and if they can offer any advice. Am I moving too quickly into areas I shouldn't be in? Should I got back into the field and get more experience? There's just so much stress thay I can't seem to think clearly any more.\n\nTLDR: I am a very young instructor at a tech achool for a premium/luxury German brand that I have no experience with. I only have 4 years of real technician experience at other dealers, and while the management seems to like me, I feel way too in over my head and I'm wondering if anyone else has a similar experience and if they're able to offer any advice.\n\n(Im not sure if a post like this violates this sub's rules, I just didnt really know where else to ask. If it does I'm sorry, I dont mind this getting deleted)",
    "score": 98,
    "url": "https://reddit.com/r/mechanics/comments/1pn12o4/moving_too_quickly/",
    "created_at": "2025-12-15T07:00:59.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1jai5no",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "You know what? This career may suck sometimes. But atleast we will always have a job.",
    "text": "I’m seeing all the white collar people struggling to find jobs. Especially the computer science jobs. \n\nThis job may suck but atleast it’s always in demand.",
    "score": 95,
    "url": "https://reddit.com/r/mechanics/comments/1jai5no/you_know_what_this_career_may_suck_sometimes_but/",
    "created_at": "2025-03-13T17:53:49.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1nun29n",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Officially left the automotive industry",
    "text": "Well I finally decided to let go of this industry. Did it for about 8 years. Worked up from a Lubie to a full certified dealership tech. Officially decided I am joining the Air Force. Going in hoping to get my footing in the aircraft technician space, A&amp;P license all that while I’m in. I used to love this trade and used to love modding my cars or watching car content (donut, top gear, hoonigan) but the whole auto / car scene feels so broken. This trade drained me, stopped loving cars. Sold my big turbo focus ST loved it to death, just is expensive to be in the car scene these days. Wanted to stop wrenching all day then trying to just drive home but had issues with my car, etc. Bought a basic Tacoma after a few years and slowly lost my passion for anything to do with cars. Flat rate is not a great pay system and the lack of career movement upwards (don’t want to be service manager / shop owner). Not to mention I have about $17k of tools invested. But to all those who continue I wish the best. It’s a thankless job. Don’t regret it but when I first started wishing I listened to all the people who said don’t get into the trade. TLDR : Retiring from auto trade after 8 years to join Air Force. ",
    "score": 85,
    "url": "https://reddit.com/r/mechanics/comments/1nun29n/officially_left_the_automotive_industry/",
    "created_at": "2025-09-30T19:42:40.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1l6t1v5",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Spend the least amount possible on tools",
    "text": "My quick two cents on tools.\n\nStarted as a kid, always been into cars, always bought the cheapest stuff at first, slowly got more as I progressed career wise.\n\nThe dollar store stuff is abysmal. \n\nI do both diesel &amp; automotive and run my own business now.\n\nAlmost everything tool truck like Snap on is not worth it, over priced, but just nice to have.\n\nI am partial to MAC precision torque wrenches, and all their ratchet the have a smaller foot print and better feel\n\nThe overseas clones have become just as great as tool truck brands.\n\nNo tool box over $2K is really worth it, a box is a box, marketing would have you to believe you need a big tool truck brand box.\n\nMy customers like that I have a clean place, clean box, etc, it shows professionalism but they don’t care if my box was SNAP ON or SNAP OFF. I would occasionally ask customers what they thought of my shop and boxes, news flash 99% don’t care.\n\nI like tools from big box stores, Milwaukee hand tools, Klein, Princess Auto / Harbour Freight. Their warranty process is great.\n\nSpeciality tools to turn a 1 hour job into a 10 minute job from the tool truck are always worth it, but the overseas clones come out just as fast and are just as good for a 1/3 of the price.\n\n\nBuy what you like, but the best place for your money is in your pocket. \n\nOnly buy what you need, I have tools I bought 7 years ago and never used once.\n\nHumble brag, i just turned 30 and I have more tools than the average mechanic, in the high 6 figures dollar wise. I wouldn’t do it again,  I’d rather take that money and enjoy life.\n\nDon’t finance tools, if you’re really in a pinch, ask a buddy, family, etc for help.\n\nCheers 👍",
    "score": 80,
    "url": "https://reddit.com/r/mechanics/comments/1l6t1v5/spend_the_least_amount_possible_on_tools/",
    "created_at": "2025-06-09T01:57:46.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1mydyyj",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Does anyone else get a little annoyed with the pay for others in the car business?",
    "text": "Maybe im just a little peeved, but when salesmen and advisors who literally know nothing or the bare minimum about automotive in general getting paid 50 percent or double what were getting paid its a little frustrating. Advisors who constantly ask the Forman or techs what this part is or how to explain something to a customer. Or sales not being able to do a single thing on their own such as inflating tires or putting plates on, when they just read the spec sheet of the car and convince people to just buy that car today. I get it, their jobs aren't always easy too dealing with the public, I entirely understand that. But they dont have to spend thousands on tools they cant write off on their taxes, or spend a year or more of their lives going to school. Every year we need more tools, we need more training, we need to know how these brand new models work more than the sales team. Yet they all get commission, thousands in bonuses,  and we maybe make 50 or 60 hours a week if we're lucky? If its not slow and we actually get gravy work and not warranty bs. Im beginning to think this career isn't worth it, not like how it was 10 or 20 years ago. Which is a shame because I do enjoy what I do.",
    "score": 66,
    "url": "https://reddit.com/r/mechanics/comments/1mydyyj/does_anyone_else_get_a_little_annoyed_with_the/",
    "created_at": "2025-08-23T21:44:34.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1omjb8a",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "How much are mechanics paid vs the hourly rates charged?",
    "text": "First off, I’m not a mechanic, but I spent about 4 years turning wrenches in a service station that did light mechanic work. I was paid an hourly rate a little over minimum wage. Enough to survive on in the early ‘90s. \n\nI have a son who has helped me with shade tree work in the driveway. Now he’s in high school and thinking about this as a possible career. \n\nI see all these posts and comments about how little mechanics are paid these days, but I also regularly see shop rates starting at $150/hour and mostly going up from there. I know that doesn’t all go to the mechanic doing the actual labor, but I’m wondering… how much do you realistically get paid relative to the labor rates? Can yall explain the pay structures for this as a career? \n\nETA: wow! What an incredible discussion. Thank you all so much! I’m going to share this entire thread with my son. ",
    "score": 64,
    "url": "https://reddit.com/r/mechanics/comments/1omjb8a/how_much_are_mechanics_paid_vs_the_hourly_rates/",
    "created_at": "2025-11-02T14:53:52.000Z",
    "num_comments": 178
  },
  {
    "id": "reddit-1lfejlx",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "I’m done!",
    "text": "In over it. So early into my job history I started off working white color and always kept cars as a hobby on the side, never went to school or anything. However I’ve had tons of project cars, build engines did wiring etc. does this mean I’m a good mechanic at all ? Absolutely not, however I had a willingness to learn and I wasn’t an idiot with some of this stuff. However I recently joined a shop a few months ago, and I’m tired of this game. First off my foreman is beyond horrible and has extreme anger issues, will get mad over the smallest things and cuss you out. He doesn’t help out at all even when we are busy, he finds ANYTHING to complain about and is never satisfied. You can scrub the floors spotless, and will still find something to be mad at. And now it’s somehow turned into where it seems like everyone in the shop has something against me. One of the other managers who has his ASEs but has never picked up a wrench to actually do anything in his life thinks he knows it all, and thinks he’s better than everyone. Listen I get it, I understand that I’m the new guy and I’m suppose to get picked on etc. but why ? This shits not worth it, I can go flip burgers at McDonalds and make the same if not more. There is 0 incentives to even trying in this career anymore, I’m so over it. I have no desire to even try anymore. ",
    "score": 63,
    "url": "https://reddit.com/r/mechanics/comments/1lfejlx/im_done/",
    "created_at": "2025-06-19T16:03:35.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1irjjye",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Universal Technical Institute",
    "text": "5 things I wish I knew before going-\n\n\\#1 If you are moving from another city or state to attend, do not use your new address in any of your onboarding paperwork, use your address from before you moved so you can get a relocation grant. I made this mistake, and my financial aid adviser told me far too late and there was no going back.\n\n\\#2 Do not use compass rose housing unless you want to pay around $1200 a month to share a bedroom with someone and also share the same apartment with another bedroom with two more people. find a roommate/roommates and a place on your own. \n\n  \n\\#3 Do not buy the overpriced snacks or drinks from the self service marts in the hallway, they will rob you. use the compass rose office, they have a popcorn machine, mini fridge with water bottles, Gatorade, soda, and the table lifts and there's snacks in there. when you walk in simply say \"just getting a snack\" it is something promised to you in orientation, but most people forget about it.\n\n  \n\\#4 If the school tells you you're getting a \"refund\" from an overpaid student loan Distibution, and you get a check for several hundreds, or even thousands of dollars either in the mail or even directly into your bank account, do not spend it, they will be asking for it back and if you are unable to give it back you will have your $850 snap on voucher taken away from you and still owe the school. \n\n  \n\\#5 go to every career day, even if its for something your program may not seem aligned with, you absolutely never know, plus they normally feed you, have free energy drinks, sponsored goodies like tire pressure gauges, tape measures, pens, hats, ect, and so many recruiters and people in the industry you can talk to. \n\n  \nbtw I went to the Orlando location so it may be different in others. at the end of the day, this school is taking a lot of money from you so look out for yourself and try to get the most out of it, in class as well, a lot of the teachers are super good and you can get a lot from them if you choose to.\n\nalso use your snap on tool discount while going, thats the cheapest youll ever get it.",
    "score": 57,
    "url": "https://reddit.com/r/mechanics/comments/1irjjye/universal_technical_institute/",
    "created_at": "2025-02-17T13:14:26.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1p7uqgk",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Something positive for once",
    "text": "I came to this sub to chat with fellow mechanics about my career but 90% of it is just bitching and moaning and as I’ve found a good shop with nice people I want to share some of the positives in this line of work and specifically at my shop. I see way too much “leave the industry it sucks” and I think it has more to do with the shop than the industry. I’ve been a mechanic for almost 2 years and am looking forward to getting certified. I have done engine repair, suspension, brakes, almost everything short of transmission repair. I really like my job and I think telling everyone interested it sucks is killing a lot of dreams\n\n• People is #1, I have enjoyable and skilled coworkers, we buy each other lunch often and telling stories and cracking jokes, and still turning hours well over what we worked \n• I hear a lot of shit about flat rate pay but the flat rate is much higher than any of my hourly positions as a maintenance tech and I turn around 40 hours a week all the same anyway. Making way more money and even if it’s dead my guarantee has it so I make more than I did hourly\n• My shop pays non productive time, so when there’s no work you can still make money doing housekeeping and fixing stuff around the shop or doing training for ASE’s or HR \n• People also talk a lot of shit about buying your own tools but I see it as a way to have your own way of making money but doing work directly with other customers, and on top of that it’s nice to have your own tools that you can organize and use efficiently, as a flat rate tech it’s really nice to have that convenience\n\nI think this industry is getting a bad rep to both customers and mechanics alike through bad shops. Your toolbox has wheels, if you don’t feel right but you like turning wrenches find another place to do it",
    "score": 55,
    "url": "https://reddit.com/r/mechanics/comments/1p7uqgk/something_positive_for_once/",
    "created_at": "2025-11-27T06:07:04.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1mfj7ck",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "New to the tech life… why is the payment structure so convoluted?",
    "text": "Generally, when you work somewhere, say a computer technician, for instance you either get paid a salary or hourly. You never get paid period/flag.. why can’t mechanics either agree to an hourly or salary wage like literally any other position? To me it seems unfair to do it any other way, but I’m new and I don’t really understand things fully yet.",
    "score": 53,
    "url": "https://reddit.com/r/mechanics/comments/1mfj7ck/new_to_the_tech_life_why_is_the_payment_structure/",
    "created_at": "2025-08-02T06:04:28.000Z",
    "num_comments": 105
  },
  {
    "id": "reddit-1lkgmkz",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "The other side…",
    "text": "I hear a lot of people complain about this career. Hell, when I see young people asking about it, I warn them off, telling them if it isn’t a passion, to go into aviation or some other field with better pay and less demanding on the body. \n\nI myself have an injury that limits me. I can’t wrench full time anymore. Not even close. Now I work up front. \n\nI have spent the last 2 weekends working on a project. It was a real puzzle. I had to reassemble a job another guy started 18 months ago. Missing parts, all the bolts in one box. I spent 23 hours over 4 days installing heads on an engine I had never worked on. (3.0 Chrysler Ecodiesel)\n\nI help out in the shop when I can. Do a small job here and there on busy days or when someone calls out sick. \n\nBut doing this big job, man I miss this career. Hearing it fire up for the first time, oh that felt good. \n",
    "score": 50,
    "url": "https://reddit.com/r/mechanics/comments/1lkgmkz/the_other_side/",
    "created_at": "2025-06-25T20:29:46.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1nri8oq",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Are there any other salaried mechanics here or is it as rare as I’m being told?",
    "text": "I’ve been at 3 shops over my 12 years of wrenching.  I have been salary at 2 of them: the 1st and the 3rd (current). I keep being told that no mechanics are salaried. Just curious.\n\nFWIW they were/are all independent shops. 1st was mostly an engine repair/replacement shop, 2nd shop (the only hourly one) was a trans shop and the current is general repair.",
    "score": 44,
    "url": "https://reddit.com/r/mechanics/comments/1nri8oq/are_there_any_other_salaried_mechanics_here_or_is/",
    "created_at": "2025-09-27T01:06:20.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1lz3mma",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Owner just got divorced over cheating. What's gona happen to my job?",
    "text": "Yep title says most of it.\nSmall shop, just 3 of us the boss me head tech and a apprentice.\nThe boss is going thru with a divorce that he caused.\nI in my 20 year career have never had this happen and hes being tight lipped.\nShould I be looking for new pastures or put a life vest on and hope this works out?\n",
    "score": 42,
    "url": "https://reddit.com/r/mechanics/comments/1lz3mma/owner_just_got_divorced_over_cheating_whats_gona/",
    "created_at": "2025-07-13T20:55:16.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1kryw80",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Feeling like a have been",
    "text": "I was a mechanic for 10 years, the last 8 working in Heavy Equipment. I loved the field, liked working in the shop but the 16 hour days 7 days a week was killing me and causing problems in my life. I now work for a company that is popular in the high reach side of equipment as one of their technical support guys for just under a year, so now my job is to tell other people how to repair the equipment and not be the one repairing it myself. I'm still extremely young when it comes to who are in these types of  positions, but was hired based on my knowledge and experience. Doing tech support for my company was also always my end goal as a equipment mechanic, I just didn't think I'd achieve that position so quickly in my career comparatively speaking. \n\nRecently I have been starting to feel like a \"have been\", and no longer a mechanic. I don't work on cars on the side because I hate everything about cars. I joke to my family that im going to buy a run down piece of equipment to wrench on just so I don't go insane. I definently am overthinking my career path because everyday I wake up and go to my office and stare at my entire collection of tool. Some days I wish I could hop in a truck and get some window time while on my way to a jobsite. \n\nMy post isn't so much about advice or anything, somewhat a rant. Just wanted to finally get that out there. ",
    "score": 42,
    "url": "https://reddit.com/r/mechanics/comments/1kryw80/feeling_like_a_have_been/",
    "created_at": "2025-05-21T14:14:37.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1kulukm",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Why I'm leaving the automotive industry",
    "text": "Hiya M(22) in the Uk here currently just finished my apprenticeship as a classic vehicle technician specialising in a German brand however already leaving the industry I've always dreamed of.\n\nObviously turning spanners is never really the most glorious job however I always hoped it would keep my happy and be able to provide for me to just exist well money wise, but realised neither of these will be possible.\n\nPlagued with being underpayed, lack of holiday and no job progression after 4 years of working as technician 3 of which at my current place of employment. I've gained skills such as machining, welding and general bodywork however don't get payed as much as anyone in those professions. I also have to utilise my engineering degree for custom fab and design.\n\nHowever with the workload and skilled work there's no sight of a matching salary no matter where I could go as a technician, so I'm looking elsewhere and have found a new career I'm working towards, it's boring and it's IT but I'll have time to do the things I love and the money to support it. I just can't see any way to stay a technician.\n\nJust wondering if anyone's made the transfer out of being a mechanic, is thinking about doing so, or has no will too.\n\nAny discussion is welcome!",
    "score": 39,
    "url": "https://reddit.com/r/mechanics/comments/1kulukm/why_im_leaving_the_automotive_industry/",
    "created_at": "2025-05-24T21:06:26.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1ov6gu3",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Can I make almost 80k as an automotive technician",
    "text": "I’m 21 and I want to drop out of college and become an automotive technician I wanted to get an AAS degree and hopefully as many certs as I can I don’t know what to specialize in to make the most money but cars and hands on work always been the mentality for me do you think I can make an 80k salary in 4 years or is that just wishful thinking ",
    "score": 34,
    "url": "https://reddit.com/r/mechanics/comments/1ov6gu3/can_i_make_almost_80k_as_an_automotive_technician/",
    "created_at": "2025-11-12T14:23:21.000Z",
    "num_comments": 138
  },
  {
    "id": "reddit-1omyrgn",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "From 17 years in turbos to starting my own shop — almost ready to fire up the new gear!",
    "text": "My wife and I bought our house with the plan that I’d eventually make a career shift — and it’s finally happening.\n\nAfter 17 years in the automotive aftermarket (mostly in turbocharger product management), I helped grow my current employer from about $3M to $17M in sales. It’s been an awesome ride, but now it’s time to take that experience and build something of my own.\n\nSo… I’m in the process of starting a low-volume turbo reman company. And let me tell you — it’s been a ton of work. Thankfully, I’ve got an amazing and supportive wife who’s been behind me the whole way.\n\nMajor respect to everyone here who’s built out their own garage or workshop — this stuff is no joke. I’m about a month away from putting the new equipment to work, and it’s finally starting to feel real.\n\nHere’s a small photo sequence of the progress so far. Ignore the mess — I’ve been collecting tools, cores, and equipment while keeping things on an extreme budget.\n\nAppreciate any feedback, tips, or just some good old encouragement from others who’ve taken the leap into doing their own thing!",
    "score": 32,
    "url": "https://reddit.com/r/AutoMechanics/comments/1omyrgn/from_17_years_in_turbos_to_starting_my_own_shop/",
    "created_at": "2025-11-03T01:21:16.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1hu7sm1",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Manager offered for me to transition to flat rate",
    "text": "Ill try to keep it brief but just want to pick your guys brain if I give you my situation/context.\n\nI'm going to be 35 years old. I used to be a chef and hated the hours and nature of the work. I thought auto tech would be more interesting/rewarding given the flat rate system I could hopefully get into one day, also the open weekends and day light hours were what I needed for my relationship and life. \n\nWent to school for auto tech for 1 year. Learned some stuff but it was a lot of bullshitting around reading the textbook and dealing with bunch of clowns in the class who didn't want to be there. I began looking for work as a lube tech and after a lot of denials I stumbled into a VW dealership and the guy gave me a job. They were desperate for good workers and techs, he started me at 22/hr without any experience and then bumped me to 25/hr within a couple months. Dealership is in a pretty well to do area economically and the shop labor rate is 219.00 hr. Now its been about six months. Im starting the first couple weeks of \"fast track\" training at VW at one of their facilities and my boss asked me if I want to become flat rate. \n\nPersonally I think it would be a pretty big mistake without a guarantee of weekly salary. I think I've probably become a burden as far as labor cost is concerned and if I transition to flat rate I wont even make 20hrs a week unless Im fed jobs I can actually handle. I think if I went flat rate I could probably fly by the seat of my pants and figure it out but it opens the potential to complete economic disaster if I dont figure it out. What do you guys think? ",
    "score": 32,
    "url": "https://reddit.com/r/mechanics/comments/1hu7sm1/manager_offered_for_me_to_transition_to_flat_rate/",
    "created_at": "2025-01-05T14:08:29.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1ncxu5i",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Is it common to not receive overtime?",
    "text": "Okay so started working for this shop and I got my pay stubs and I haven't been receiving any overtime, and I stay an hour or more everyday. I was under the influence I was hourly, and then I see my pay stubs and there's zero overtime on my checks. Is this normal? Still getting used to the hourly pay. \n\nEdit: I'm familiar with overtime laws in my state, I was a mobile mechanic who recently went to a shop, I'm a b tech. I'm recently asked to see my pay stubs and realized even though I stay late almost every day(6-10) hours ot a week, my checks all say 80 hours. Almost every tech in my shop is salary with bonus's for flagged hours. I opted for hourly when I started. On the flip side \nmy boss is fantastic and does a lot of little stuff to help us. So maybe it evens out? Idk I'm just trynna see if this is a common experience. I've only ever worked on a pulling unit or for myself. And that's an overtime heavy job. ",
    "score": 28,
    "url": "https://reddit.com/r/mechanics/comments/1ncxu5i/is_it_common_to_not_receive_overtime/",
    "created_at": "2025-09-09T22:56:40.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1k8l0rq",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "I’m thinking of leaving",
    "text": "Hey guys I’m 23 years old, which I know is young. But at my age I want to get ahead. I know alot about cars, and I’ve done all sorts of work. Building engines, suspension, wiring etc. I do not know everything, but I’m fairly comfortable with enough. however because I don’t have any on paper experience most shops won’t hire me past a lube tech. I enjoy working on cars, but I’m starting to think maybe I should just keep it as a hobby. I have experience in cooperate, and it’ll be faster for me to go back to my old work place and move up and make more money. I’d say in less than a year, if I work hard in my old corporate job I can easily make a comfortable salary. It’s just that the work would be boring, and feel like “fake work” being a mechanic I you my friends and I feel accomplished at the end of the day. However the hours; and pay isn’t worth it. As well as the fact in burnt out of being a lube tech. What’s your guys advice ? For me it would be ideal to find a small mom and pop shop who trust me and that pays decent. ",
    "score": 25,
    "url": "https://reddit.com/r/mechanics/comments/1k8l0rq/im_thinking_of_leaving/",
    "created_at": "2025-04-26T19:26:35.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1n97vc3",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "What steps did you take to move away from flat rate?",
    "text": "Hello all. 25 year old dealer tech here, looking to move away from dealerships and flat rate in general. While I’ve learned to play the game of flat rate and have been successful, I want to get away from in to find stability. \n\nSo my question is, how did you all go from flat rate to hourly/salary? (preferably with good benefits as well). I’ve seen it’s common to go into fleet, public service etc, but I haven’t seen much on this sub as to how. Specifically looking for advice on industries to enter, what’s certifications to get, where to make connections. ",
    "score": 22,
    "url": "https://reddit.com/r/mechanics/comments/1n97vc3/what_steps_did_you_take_to_move_away_from_flat/",
    "created_at": "2025-09-05T15:10:23.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1llezmn",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "What about benefits?",
    "text": "Salary is brought up a lot, but what does everyone get for benefits? \n\n10 days vacation after 2 years\n15 days vacation after 10 years\n3 days of bereavement \n2 sick day\n0.25% 401k match up to 4%, ie you put in 4% and they match 1% max",
    "score": 17,
    "url": "https://reddit.com/r/mechanics/comments/1llezmn/what_about_benefits/",
    "created_at": "2025-06-26T23:28:35.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1megyid",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Going from Flat Rate to Salary",
    "text": "So I’m a tech for Subaru for about 2 years, all my Skill groups complete making some nice money. However just got a job offer for a private shop with higher end cars. I’ve only worked on Subarus but they asked me what kind of salary I’d want. I’m not sure what to say and figured let me ask around. I know my way around a Subaru and basic Japanese and some Americans with the occasional forum search for a euro. But these cars are high end, I know I shouldn’t sell myself short but I also don’t want to go to high\nFor reference I’m making $35/hr flat rate\nAnything helps, and any similar stories help too!",
    "score": 15,
    "url": "https://reddit.com/r/mechanics/comments/1megyid/going_from_flat_rate_to_salary/",
    "created_at": "2025-07-31T23:30:20.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1mdo0q5",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Shop talk",
    "text": "To get this started i want to say thanks for reading this. Criticism positive and negative is welcome. Im 21, 1 year at my current shop. honda/acura only independent shop. (the salary here is not substantial enough for a career long term for me and my goals) i have gained lots of experience here and i believe they will set me up good for the future. My question is - am I bitching and moaning and this is a sob story or run as fast as I can? \n\nThe work is steady, I am 1 of 3 techs including the boss. I work about 36hrs a week. Customers are super loyal. we’re married to most of the cars that come in. I am on track to make 48-55k this year. (More than I have made before) I make 50% commission of the shop hourly rate. We get 1 week off for the 4th of july and about 2 weeks off for xmas. I only work on hondas and acuras. \n\nI do not receive a flag sheet so i dont know how many hours i am getting flagged for each week. I pull cars in all day to check stuff for free. Pre purchase inspections and multi points all day for free. Many other things for free that I shouldnt do but i basically haft to. $40 labor for a diag to hook my computer up. No benefits no health no dental no vision. No week paid vacation on my own terms. Only bonus pay for the weeks off that I mentioned before. I make no spiffs off parts. Me and the other tech do all the oil changes. They will never turn a car away. Sometimes i do waiters while doing waiters. I am expected to figure out the problem (customer concerns) to make my recommendations. No time is approved until recommendations are approved (majority of the time). I spent 4hrs diag on a car to make my recommendation just for the ticket to get given to the other tech that they upsold a 105k mile service on and decline the other stuff. \n\nThe boss does not know how to use his words. Communication is terrible. He does not like to talk to customers. lets the secretary talk to all the customers. He does all the pricing and estimates. More than positive he guesses at a lot of the labor times. Shows up late every morning. Filters tickets and turns as many hours as me and the other guy taking most of the good timing belts and ac work and other good stuff. leaves us with some good stuff but a lot of bullshit. If theres a issue The parts are never to blame. The communication thing is the worst. Labor times dont make any sense sometimes mostly short and parts prices are 400+% markup. No extra time ever for any reason. I am not in control for how much time is approved for any job. Theres more that im leaving out not on purpose but you understand whats going on and I do too mostly. Im not perfect i make mistakes sometimes im still learning i am not a master tech by any means and honestly nobody in the shop is. tell me, Do i have it good or bad? ",
    "score": 15,
    "url": "https://reddit.com/r/mechanics/comments/1mdo0q5/shop_talk/",
    "created_at": "2025-07-31T01:03:24.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1nti1xm",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "What do you guys use for video inspections?",
    "text": "Work at an independent shop. We aren't required to do video inspections but have the ability to add photos and videos to our tickets. I do occasionally if I feel it's necessary but my boss has been asking for them more and more. I'm salary so doing them doesn't bother me, what does bother me is that I have to use my personal cell phone to take hundreds of pictures of broken cars that I then have to go and delete all the time. Also, I'm not a fan of using my expensive mobile phone as a glorified digital camera. I'm sure work would be happy to provide us a solution but just curious what everyone else is using so I could give them some suggestions. Ipads? Digital cameras? Dedicated phones just for inspections?\n\n  \nOur program is pretty shitty so any picture you take, you then have to go into a browser on your phone, go to the shop webpage, and upload photos from your phone. It's a pain in the ass since most of the inspection is filled out on a PC.",
    "score": 15,
    "url": "https://reddit.com/r/mechanics/comments/1nti1xm/what_do_you_guys_use_for_video_inspections/",
    "created_at": "2025-09-29T13:29:10.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1in1sdk",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "There's a mechanic shortage according to Fox News",
    "text": "The industry is projected to be short 642,000 auto repair technicians.\n\nAre you seeing the effects of this shortage? Is there a way to fix this and make being a mechanic a more attractive career path?\n\nIn a nutshell, they believe the auto mechanic exodus is due to retiring workers, low pay, and tech-heavy vehicles requiring more training. I saw this looming pre-pandemic, it’s a problem for shops, mechanics, and customers alike.  ",
    "score": 13,
    "url": "https://reddit.com/r/AutoMechanics/comments/1in1sdk/theres_a_mechanic_shortage_according_to_fox_news/",
    "created_at": "2025-02-11T15:54:55.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1ii0q06",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "Female mechanics",
    "text": "Hi, I’m 20F and I’m soon going to school for automotive technology. Not body collision or paint. I just need advice on how to prepare myself for the workforce since I am a minority since there is not a whole lot of female mechanics. Advice and tips would be helpful. ",
    "score": 13,
    "url": "https://reddit.com/r/AutoMechanics/comments/1ii0q06/female_mechanics/",
    "created_at": "2025-02-05T03:22:36.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1ndxj9w",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Pay rates at Ford?",
    "text": "anyone here that works at a ford dealership as a Technician how much are you making? Hourly, flat rate, maybe even salary? P.s: I just got hired at ford, starting at $15/hr as an Oil Technician",
    "score": 11,
    "url": "https://reddit.com/r/mechanics/comments/1ndxj9w/pay_rates_at_ford/",
    "created_at": "2025-09-11T02:41:30.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1k3a893",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "Can I become a mechanic?",
    "text": "I'm thinking maybe I'm too old with limited experience but I really need to find a good job and I think I have potential here. Ive managed to fix my car twice through pure googling, articles and YouTube videos and I thought maybe I can really do this, I feel confident. But I'm 26f with no true experience and I'm wondering where to even get started. ",
    "score": 10,
    "url": "https://reddit.com/r/AutoMechanics/comments/1k3a893/can_i_become_a_mechanic/",
    "created_at": "2025-04-20T00:19:22.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1ojd5g2",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Switching shops",
    "text": "So, as the title says i am looking at switching shops, my current dealership pays 22hr, 23.17 flat rate, but we have full benefits, 401K, life insurance ect.  The shop i am looking at switching to has none of that, but the pay is salary at 1k a week.  Not exactly sure what to do, was hoping to get some advice from people who have done this before.",
    "score": 10,
    "url": "https://reddit.com/r/mechanics/comments/1ojd5g2/switching_shops/",
    "created_at": "2025-10-29T18:53:51.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1phk637",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Opinions",
    "text": "Hi all looking for advice or to hear your similar stories. So I am an auto tech with 10 years of experience , inspection and emissions licenses for my state.i have been at my current job for a couple years, just a small independent shop with a few employees in the country. It was a easy place to work at first and felt appreciated. However here recently things have changed. The owner has alot going on with expanding the business and hiring a new guy to work there.. And recently we have been switched from salary to flat rate. No real warning, just learned about it on a Friday and came in Monday to a totally different pay scale. I have never asked for a raise and no benefits, 1 week vacation...and now with flat rate making less when I run into a rusty bolt or a faulty part which is often in the independent world. Also there's no real system in place to keep track of hours.i have no clue what im making day to day until payday. Only ever did salary jobs ..and now feeling rushed to make the same paycheck as the last 5 years. Guess im just trying to hear from others and figure out if its time to jump ship. \n",
    "score": 9,
    "url": "https://reddit.com/r/mechanics/comments/1phk637/opinions/",
    "created_at": "2025-12-08T18:30:39.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1ps2sfg",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "shop is busy now, heres what worked",
    "text": "i commented on a post here maybe 6 months ago complaining about having empty bays and no customers. bunch of you told me my marketing probably sucked and you were right been turning wrenches since the 90s, opened my own shop finally in 2018, have wanted to for so long. tough times during covid but was able to hold on. even then, i always survived on word of mouth but lately even thats dried up. tried building a website myself, looked like hot garbage. tried running Facebook Ads -- crickets. ive seriously thought about closing up but i'm so averse to it because it feels like at this stage in life it would be a big step back for me.\n\ni have sought advice from so many people and places before it clicked that i just needed to focus on what i was good at and delegate out. i ended up finding an agency who specialized in local digitl marketing/SEO for small business and it ended up as the best business decision I made in a long while. the particular company i ended up going with was Hibu. my sister-in-law owns a small salon uses them and had good things to say. i was orriginally skeptical because monthly cost but i was also going broke and had her recommendation which i prefer over online research these days, so, said f\\*ck it and gave them my credit card. \n\nin the last 5 months or so, they redid everything. rebuilt my website, fixed my google listing, got customers to leave reviews took about 3 months to start picking up, but its a night and day difference. phone rings all day. people say they found us on google which never happened before the investment pays for itself pretty quick when you're actually busy anyway it worked and hope this helps someone else struggling.",
    "score": 8,
    "url": "https://reddit.com/r/AutoMechanics/comments/1ps2sfg/shop_is_busy_now_heres_what_worked/",
    "created_at": "2025-12-21T09:40:35.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1ktb7yq",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "Torque wrench issues",
    "text": "Today I did my first shock assembly replacement. I tried to be very particular and do everything right so I got a torque wrench from O'Reilly's loaner program where I also got the shocks. The installation went fine until it came to torque everything. The largest bolts behind the breaks were supposed to be 81 ft.lb and the torque wrench worked as expected. The top bolts for the strut mount were supposed to be 33 ft.lb and this is where my inexperience (and tired brain) messed me up. The torque wrench wouldn't limit out on the drivers side and I thought maybe the shocks were just gapped a little more than I thought. It didn't feel right so I went to the passenger side and that's where I broke the bolt. I don't think the torque wrench was working correctly and looking back I probably shouldn't have used it for only 33 ft.lb or continued tightening, clearly. Anyway, O'Reilly's warranty is covering a new shock for the passenger side.\n*My question is, I am fairly confident I overtightened the drivers side strut mount. Should I loosen the nuts, leave it as it is, or replace it?",
    "score": 8,
    "url": "https://reddit.com/r/AutoMechanics/comments/1ktb7yq/torque_wrench_issues/",
    "created_at": "2025-05-23T04:50:49.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1p3ly6s",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "I can’t use my windshield wipers…",
    "text": "So, this may be a little long winded and I’m on mobile so the formatting may not be awesome—but I’ll try my best anyway.\n\nLast year, I hit a deer. And I mean PLOWED that bitch. It was a 6 point buck and it basically front flipped over my hood and landed down a hill, DOA. It tore my poor Honda Fit to pieces. (See attached.) Well, after this my insurance stepped in to have my vehicle fixed. The body shop and mechanic was nice and all, the work they did was lovely and it’s back to normal. Well—sort of.\n\nAbout 3-4 months after I had it fixed and returned to me, I go to replace my windshield wiper fluid as it had run out. I pour in the appropriate amount, let it settle and then replace the cap and close the hood to test it out. Give it a couple of sprays to get it going and nothing. Huh. Weird. Maybe a few more will do it?? No? What the heck?? \n\nSo I get out and pop the hood again only to notice my windshield wiper fluid is all over the inside of my hood. I leave it popped and give a test spray and sure enough, the sprayers work just fine. Looking at the hood for a bit longer I come to the realization that when the body shop replaced my hood they used a different part for the shield and now there isn’t a hole for the spray to go through and get the windshield. \n\nNow its been so long that I fear I can’t ask them to replace it properly. Yeah, I know. \n\nIs there anything I can do?? ",
    "score": 8,
    "url": "https://reddit.com/r/AutoMechanics/comments/1p3ly6s/i_cant_use_my_windshield_wipers/",
    "created_at": "2025-11-22T06:10:13.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1o0z339",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Moving shop",
    "text": "Long story short, ive been called up and poached for other shops. What should i look for when moving shops? Is fleet work harder than everyday cars? I got a 2nd home where i work now so only thing that can improve is salary and distance with potential for more upskill. New shops are offering minimum 13k per year aud more, promising good culture and the lot too.",
    "score": 8,
    "url": "https://reddit.com/r/mechanics/comments/1o0z339/moving_shop/",
    "created_at": "2025-10-08T02:49:01.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1m0bo94",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Curious About Education Pathways for Automotive Technicians in Different Countries",
    "text": "Hi all, was reading u/JJJJust 's post about ASE certs and job applications and it got me wondering about what the actual requirements are for Automotive Techs in different countries.\n\nAs a Canadian we are made aware of the US system and ASE certs, and I believe we can apply and test for them. But we are told this in trade school by an instructor who inevitably tells us that our system is better. Personally, I'd rather hear about it from actual Americans, our best friends and neighbours.\n\nIs there a nationally recognized trade qualification in the US?\nAre there a lot of differences between states? \nAre there \"traditional\" or formal 3-4 year apprenticeships with requirements for work and classroom hours?\nAre there mandated emissions or safety inspections for passenger vehicles, commercial vehicles, and vehicles being imported from other jurisdictions? \nDo these require certain certifications or \"tickets\"?\nWhat about doing warranty work at a dealership?\nWhat type of shops pay the best? \nPayment plans. Salary, flat-rate, hourly, or hourly with flat-rate \"bonus\"?\nAre there union shops in your area? Public or private sector?\n\nLastly,\nDo you think trade certifications are pointless, and have nothing to do with a technician's actual skill and ability? \nOr do you think that making certifications optional, or splitting the trade into \"microcredentials\" suppresses wages?\n\nI'm happy to talk about the Canadian system. I hold a Red Seal as an Automotive Service Technician. Quick googling tells me that the UK, New Zealand, and Australia have similar pathways to Canada, but I'd like to hear more. I'm also very curious about South East Asia and Western Europe. Or anywhere really.",
    "score": 7,
    "url": "https://reddit.com/r/mechanics/comments/1m0bo94/curious_about_education_pathways_for_automotive/",
    "created_at": "2025-07-15T07:45:26.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1mk4dhh",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "Mechanic pay at dealerships",
    "text": "Question.  My son just graduated with a degree in auto mechanics and is working at a local dealership.  They have been throwing jobs on him that are warranty work.  He's told me that for warranty work he only gets paid half the hours that the job takes to complete.  (I.e. 5-hour repair job. He only gets paid for two and a half billable hours).  Also stated that warranty work only pays for 1 hour of diag even though it could take a lot longer to figure out the problem.  To me that doesn't sound right or fair to the mechanic, so I'm just asking if that sounds right? \n\nAlso.  The dealership seems to be goodwilling a lot of repair costs for customers in an effort to try to keep them happy (and get good surveys).  When they do that, shouldn't that cost be coming out of the dealerships budget, not the mechanics pay?  He's being told that he's not getting paid to do it because they're goodwilling the cost back to the customer.  To me that sounds like labor law violations.  \n\nAm I right? Or is that just how this business works? (I'm coming from a finance background).  Any information would be greatly appreciated.",
    "score": 5,
    "url": "https://reddit.com/r/AutoMechanics/comments/1mk4dhh/mechanic_pay_at_dealerships/",
    "created_at": "2025-08-07T16:14:48.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1o6wrrr",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "98 wrangler died as I backed out now won't start",
    "text": "Thoughts here? Video is of me trying to start the Jeep after it died. Wrangler has been driving just fine. Tonight i started it up like normal and as I backed out of the driveway and cut the wheel to the left like normal (sharp turn into the service alley), it just died. Tried to start it again and the starter seems normal/strong but the engine won't turn over.\nSwapped the fuel pump relay out with a working one (horn and fuel pump use the same relay) and got the same thing (and the horn worked fine). \nWhat do I look at next, or thoughts based on the video? \nI'm a decently inclined mechanical guy, but don't know a lot about troubleshooting this. (Am reading up now but Reddit is usually light years better than googling anything these days).\nAppreciate you, Reddit!",
    "score": 5,
    "url": "https://reddit.com/r/AutoMechanics/comments/1o6wrrr/98_wrangler_died_as_i_backed_out_now_wont_start/",
    "created_at": "2025-10-15T00:35:49.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1pg2ghp",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "Can an oil leak cause a timing issue?",
    "text": "I'll try to make a long story short here. I have a 2007 Saturn Ion-2 2.2 that I recently replaced a water pump on. Now, maybe weeks before I did the water pump replacement, I had an issue where the engine started stalling when trying to start some times. It didn't happen every time, but when it did, it would usually be after the car had been sitting for a while. Also, it stalled only one time, but on the second time trying to start it, it always started right up.\n\nNow, after the water pump replacement, I had gotten rid of a slow leak from an obvious worn gasket, but I had a few new codes. The codes were P0016, P034, and P0520. Hate to mention that when I was in the middle of swapping the water pump, I had the timing sprocket tool that holds the chain in place installed but at some point, on two different occasions, the bolts that hold it in place were loose some how. I think it was after I removed the actual timing chain bolts and after I put them back. This was a mystery on how they became loose.\n\nAnyways, after I got done putting everything back together, the car drove fine other than the installing issue and now the new codes in addition.\n\nNow my issue is, after about a week or so, I started the engine, and after about a minute or two, the engine shut off and wouldn't fire back up. The sound it's making reminds me of when my timing chain snapped years ago and after the mechanic replaced the chain and water pump, he warned me that it probably had done too much damage to the valves. That's something I knew since this car has an interference engine. But trying to start it sounds kinda like a winding noise.\n\nSo, with the info I've shared here, does this sound like a timing issue or a fuel related issue. I've probably made this more complicated by not hopping on the engine start stalling problem soon enough. I've also had a slow oil leak for probably over a year that I've been procrastinating on approaching, which adds to the equation. 😭\n\nNote: I have cleared the top code before the other two popped up, which was before the engine died, and it came back immediately. Now I have cleared all three codes and and can't get them to come back. \n\nNote 2: I have kept an eye on the super slow oil leak and topped it off when needed.\n\nThanks for any tips in advance",
    "score": 5,
    "url": "https://reddit.com/r/AutoMechanics/comments/1pg2ghp/can_an_oil_leak_cause_a_timing_issue/",
    "created_at": "2025-12-06T22:53:15.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1imngsx",
    "subreddit": "AutoMechanics",
    "soc_codes": [
      "49-3023"
    ],
    "title": "BETWEEN AUTO MECHANICS AND AVIATION MECHANICS WHO EARNS MORE?",
    "text": "I love both Auto and aviation maintenance careers and I'm contemplating getting into either of them. I have been doing research on both for a while and I have seen way more high paying automotive technician jobs with less experience/certification than Aviation technicians job in the US. I used to think aviation technicians are paid more until i started this research . Is there something I'm missing?? I'm located in United States.",
    "score": 5,
    "url": "https://reddit.com/r/AutoMechanics/comments/1imngsx/between_auto_mechanics_and_aviation_mechanics_who/",
    "created_at": "2025-02-11T02:01:25.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1l1xrum",
    "subreddit": "mechanics",
    "soc_codes": [
      "49-3023",
      "49-3031"
    ],
    "title": "Hey guys I need help and any advice will be appreciated!",
    "text": "I’ve been doing this for 4 years and I have gained a lot of experience and lots of tools. Right now I’m doing performance like bolt on mods, blowers, engine builds, and lots of heavy line which I love doing. However there is a lot of shakiness with the doors remaining open and I’m working 50 plus hours a week just to get a 40 hour work week salary and I haven’t gotten a raise in a year. I’m very dedicated to what I do and my work and take a lot of pride in what I do. However I got a new offer where I would have a lot better schedule and pay which I will probably take but it’s specializing in euros. I like euro cars as I have an m2 and I’ve worked on some but how different is it jumping from domestic to euros? At the end of the day it’s all nuts and bolts but are people just scared of working on euros? Is there a huge learning curve with euros and a lot more understanding or am I just over thinking this? Any help and advice will be greatly appreciated!!! Thanks!!! Keep on wrenching!!!",
    "score": 5,
    "url": "https://reddit.com/r/mechanics/comments/1l1xrum/hey_guys_i_need_help_and_any_advice_will_be/",
    "created_at": "2025-06-03T00:02:00.000Z",
    "num_comments": 8
  }
]