[
  {
    "id": "reddit-1n4f6vj",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "New gf visited my bar during close",
    "text": "It was a very busy close.  I couldn't start any of my closing duties until last call was done, as I was slammed.\n\nShe sat at the bar and watched me do a complete close, that I was working as hard as possible to do quickly, yet making sure done properly (barely ANY fruit flies all Summer!)\n\n1.5hrs later, I'm sweating and sitting down to do my cash out when she says, \"I don't think I'm going to ask you to do as much dishes anymore.  I had no idea what you do every night at work.\"\n\nMy god, I've never had an ex ever say that.  After 18 years of bartending, not once has an ex ever been sympathetic when I say \"I want to rest before I do any cleaning at home.  I don't have it in me right this moment.\" They just got upset and called me lazy and unhelpful.\n\nFeels good to be recognized.",
    "score": 2204,
    "url": "https://reddit.com/r/bartenders/comments/1n4f6vj/new_gf_visited_my_bar_during_close/",
    "created_at": "2025-08-30T23:02:31.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1jz5vbd",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "$500 tip on $30 tab",
    "text": "Had to share this one. Guy came in wearing the nicest suit I'd ever seen. Was kind, but not very talkative, just got a normal lunch with a younger guy and asked for the Wizards game to be put on. He started asking me if I go to the nearby university (I do), and we chatted a bit. Talked to me about his Ferrari, gave me life advice, etc. I could see there was some massive number written next to \"Tip,\" but I don't like to look or even pick up customers' signed receipts while they're still at my bar. When he left, he threw me 3 more $100 bills on top of the $200 tip on the card. Absolutely incredible, super nice guy. ",
    "score": 1275,
    "url": "https://reddit.com/r/bartenders/comments/1jz5vbd/500_tip_on_30_tab/",
    "created_at": "2025-04-14T18:18:59.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1p9hp2w",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "I love little notes on the check.",
    "text": "He came in and ordered and app and a water. Stumbled his way through his slurred words to do so. Was hiccuping and burping loudly as he ate. Thought I was in the clear til he ordered a beer. Told him I wasnt going to serve him for the reasons I stated above and he legitimately said \"I dont think that's a reason to not give me a beer but OK if that's how it is then that's how it is\" payed, then proceeded to give me the tough guy staredown til he left. This note got us through the rest of the shift. Admitting he was drunk, misspelling drunk, and the tiny dick on signature line are *chef's kiss*",
    "score": 1225,
    "url": "https://reddit.com/r/bartenders/comments/1p9hp2w/i_love_little_notes_on_the_check/",
    "created_at": "2025-11-29T06:19:51.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1iwyd5m",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "The cig in my beanie barely moved",
    "text": "Dude had already been cut off and kicked out; the guy he’s shoving is a suuuper chill nice dude, who simply asked drunky to stop invading their conversation. Literally my second shift back from vacation, and first time I’ve ever gone hands on at this bar, which I actually really love despite this.",
    "score": 1060,
    "url": "https://reddit.com/r/bartenders/comments/1iwyd5m/the_cig_in_my_beanie_barely_moved/",
    "created_at": "2025-02-24T09:43:36.000Z",
    "num_comments": 219
  },
  {
    "id": "reddit-1hzuwjv",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Dry January people, I support you, but can you please get a clue?",
    "text": "I had a two top come into my bar and grab a booth. Split a single N/A corona and ordered fries. Took out their laptops and camped out for two whole hours. Then left a $2 tip.\n\nWhile we're on the subject of tips, I have never had an N/A cocktail drinker tip decently. They order an N/A cocktail from the menu (where the price is listed) then complain about the price of the cocktail. Then tip 10% or less. Idk man if money is an issue for you maybe order the $3 coke instead of the $15 mocktails?\n\nAnd the drink orders are truly deranged. You want me to come up with an N/A cocktail on the spot? Well we have one N/A spirit and it tastes like rotten grass so I hope you enjoy that in a daiquiri! Oh you want a mocktail but you don't want any N/A liquor in it? Here's some lime plus whatever two juices are closest to me!\n\nHey that's fun, the one person at the table doing dry January convinced everyone else at the table to only drink water. Fantastic, next time when you visit would it be more convenient for me to just give you my money straight out of my tip jar?\n\n-\n\nI'm sorry I just had to rant. Non-drinkers, I support you and I love you, but also you're fucking annoying.",
    "score": 1054,
    "url": "https://reddit.com/r/bartenders/comments/1hzuwjv/dry_january_people_i_support_you_but_can_you/",
    "created_at": "2025-01-12T19:38:42.000Z",
    "num_comments": 155
  },
  {
    "id": "reddit-1irqgl9",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "This fucking kid",
    "text": "Working my day off yesterday - solo day shift.... covering\n\nOne of our barbacks has been asking me a bit about getting trained up - so I had him come behind the bar for a couple hours (he was there to do prep/juices/syrup). \n\nThis motherfucker.  \nTold him exactly once the builds for our cocktail menu and he just absolutely nailed it.  Our menu isn't overly fancy, mostly classics, but still. \nWhen I saw him shaking for the first time I asked if he'd done it before...\n\"No, first time\" \nMe: WTF?!\n\nAnd he's a great barback so of course I didn't have a chance to wash a single glass or shaker.  \n\nI was chatting him up a bit when we got a breather and he told me he recently turned 21.   \nIf I was half as good as he his at 21 I'd be a legend by now\n\nKid absolutely has it.   Can't wait to work with him again.  ",
    "score": 949,
    "url": "https://reddit.com/r/bartenders/comments/1irqgl9/this_fucking_kid/",
    "created_at": "2025-02-17T18:12:43.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1mn9ori",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Proud of myself for not going ape shit at work Saturday night",
    "text": "Fucking assholes. Spent over 4.5 hours serving this group of like 15 middle-aged Brittish guys loudly talking about how wealthy they were and all the traveling and golf they're playing over here in the US. We gave excellent service and laughed at all their stupid fucking jokes all night. They asked to close out in the middle of a massive rush and completely stiffed us. Worst stiff I've ever received in over 3 years of bartending. \n\nAnd before anyone mentions it, the owner of the bar I work at refuses to allow us to auto-grat anything. She'll also chew us out if we mention anything about bad tips to customers. ",
    "score": 803,
    "url": "https://reddit.com/r/bartenders/comments/1mn9ori/proud_of_myself_for_not_going_ape_shit_at_work/",
    "created_at": "2025-08-11T10:49:35.000Z",
    "num_comments": 248
  },
  {
    "id": "reddit-1jhfl13",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "\"You are no longer allowed to walk to your car alone.\"",
    "text": "This was said to me halfway through my very busy shift on Thursday by the owner.\n\nOn Thursdays, we open at 3pm, so things aren't too busy during the first few hours, so I'm allowed to take a few tables around the bar. I'm doing my usual serving schpiel, cracking jokes about queso and offering up desserts, normal job stuff. One table in my section as a single guy, mid-40s-ish. Haven't been talking to him much except to get his order as he's not been as chatty as my other tables. When we're getting to check out using the Ziosk, he says that it's not allowing him to tip. I saw that it accepted his payment, and didn't really understand what the issue was with the tip part, so I just opted to grab my manager/owner and see what she wanted to do. Since it already took his payment, she just printed out another CC paper for him to leave the tip on the paper, the old-school way. He says that'll work perfectly so I thank him for coming up and start bussing my other tables or cleaning some bar glasses. After he leaves, I go back to collect the bill/tip...\n\n$100 tip on a $40 bill. I was floored, but appreciative! He left a note saying, \"Thank you, you were very nice -Mark.\" Well, I'm glad he liked my service, didn't feel like I went above and beyond for him, but didn't question it too much.\n\nI went and let my manager know that he'd finished tipping and the tab was ready to be closed up. She went to finish up closing everything between the Ziosk payment and paper bill, saw the tip on the receipt and said, \"Wow, nice job! He seemed to really like you.\" I just said, \"I don't even know what I did, just did my job.\" Then she looked at me and said, \"No, he *really* liked you,\" and pointed at the bottom of the receipt, where Mark left his *PHONE NUMBER*.\n\nEw. Creepy and gross, but I'm a 25-year-old woman working as a bartender so it was bound to happen. Whatever, $100 is $100 so we laugh it off and I continue with my shift. A few hours go by, we're just wrapping up the dinner rush and my bartop is a warzone. Some guy walks up to my bar holding his phone and I recognize immediately that it's a DoorDash.\n\nOur restaurant does to-go orders and lots of Dashers come up to the bar unsure where the pick-up area is, so I walk up to him ready to point out where to get his order. Instead, this guy lifts two MASSIVE Walgreens bags onto the bar stop and asks, \"Sarah?\"\n\nI was like... \"Uhh, yeah, how do you know my name?\" The Dasher turns his phone to me to show that a DoorDash order was made to be delivered *to the bar, to me by name*. The message left with the order?\n\n\"Just wanted to make sure you got my number. -Mark\"\n\nPoor Dasher doesn't speak a lot of English, so the guy is as confused as I am, but I take the bags from him, thank him, and kinda stand there shocked. My coworker walks up to me and asks what I got. I told her, \"The guy that left his number and the $100 tip? Yeah, he just delivered these to me.\" My coworker, bless her soul, said, \"Oh sweet, free shit!\" but I was unnerved as hell. Took it back to the owner and gave her the update. She looked me in the eye and said, \"You are no longer allowed to walk to your car alone.\"\n\nI was definitely a little skeeved out for the next hour or two. It's weird for someone as old as my dad to leave his number on a receipt for me, but it's fucking WACK to DoorDash $50+ worth of Walgreens candy to a bartender's workplace cause you *really* wanna make sure she got your number. But after I divvied up the candy with my coworkers and we all started to dig in, my anxiety let up a bit. And yes, the owner, all 5'2\" of her, would not let me leave the building after we closed without her walking me to my car.\n\nAnyways, fun lesson on how to freak out your local bartender I guess. The Halloween-sized bag of KitKats I've been destroying is a bit of a plus though.",
    "score": 758,
    "url": "https://reddit.com/r/bartenders/comments/1jhfl13/you_are_no_longer_allowed_to_walk_to_your_car/",
    "created_at": "2025-03-22T18:48:35.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1nksrcs",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Bartending in the Midwest has made me hate men (as a man)",
    "text": "Moved to the Midwest recently and in less than a year I have seen so much more disgusting behavior from men than i saw in 5 years on the coasts. Today a man, at the restaurant with his wife, was going on to the 17 year old host about how mature she was for her age and how she looked 21. \n\nBanned for life, obviously, though I seriously regret not confronting him in front of his wife. I didn't want to escalate in the moment in a way that would drag our host into things, but what the fuck is wrong with you dude? \n\nThis week alone I've seen so much disgusting behavior from dudes. Absolutely no shame.\n\nI \n\n",
    "score": 744,
    "url": "https://reddit.com/r/bartenders/comments/1nksrcs/bartending_in_the_midwest_has_made_me_hate_men_as/",
    "created_at": "2025-09-19T03:23:12.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1k2r1lx",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "\"Are you Hiring?\"",
    "text": "I'm a beverage director of a high-end restaurant after 12 years of bartending. We open for service at 4:30pm. This happened months ago, but I'm awake now and just thinking about it.\nI'm talking to my bartenders making sure they understand a few changes on the drink menu. I can overhear this guy coming in the restaurant at the host stand, insisting to the host that they talk to whomever is in charge of the bar. They want to bartend here. The hosts know I won't talk to anyone between doors open and 8pm, but they're getting nervous. This guy is not aggressive, but definitely loud. \n\nAnyways, I walk over and ask if there's a problem. This guy within a minute of talking to me tells me he used to bartend at a place I helped open as a bartender, he got wrongly let go, and immediately needs a new job for paying his rent.\n\nI tell him bluntly service is starting, here's my card, send me your resume, and I'll take a look on Monday. He leaves. \n\nI text one of the managers of the bar he just got fired from asking about him. That manager has become a good friend after working with them. They call me and tell me this guy showed up shitfaced to his shift (not the first time) and they told him he was told he could either pass a breathalyzer or get fired. He blew a .1. \n\nThe fucking audacity. You get fired for being shitfaced. You show up drunk to my job at 5pm on a Friday scaring my hosts and insisting we hire you on the spot. You lie to me about what happened with a friend of mine. People are crazy.\n\nCrazy enough that I still think about this 2 months later.",
    "score": 727,
    "url": "https://reddit.com/r/bartenders/comments/1k2r1lx/are_you_hiring/",
    "created_at": "2025-04-19T07:45:05.000Z",
    "num_comments": 104
  },
  {
    "id": "reddit-1ln0j2t",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "USE 👏🏼 AN 👏🏼 ICE 👏🏼 SCOOP",
    "text": "I have to rant before I blow up about this. I am absolutely blown away by how many FOH staff don’t know not to use a goddamn glass to scoop ice, or just don’t care. That is serving/bartending 101, and I’m starting to view it as an immediate red flag if starting somewhere new. Seriously, is this not taught to new servers/tenders anymore, or do people just not give a shit? Use the fucking scoop. I don’t want glass, nor your dirty hands, in the clean ice. \n\nGlasses aren’t as sturdy as you think, even that one Old-Ironsides pint glass from the Nixon administration. One chip or break of glass and you’ve sunk your ice well. I’ve just started at a new place, and the majority of the servers just plunge a glass into the ice. Don’t come bitching to me if you chip a glass and we have to burn our one well of ice during a dinner slam because you couldn’t be bothered to use the scoop.\n\nIf you’re training people, please, PLEASE impress this upon them right off.\n\nEnd rant.",
    "score": 713,
    "url": "https://reddit.com/r/bartenders/comments/1ln0j2t/use_an_ice_scoop/",
    "created_at": "2025-06-28T23:33:51.000Z",
    "num_comments": 127
  },
  {
    "id": "reddit-1neal23",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "I feel like bartender sold me out to a regular",
    "text": "Im kinda upset about something a bartender did last night and I'm curious if I'm being overly sensitive or if it was indeed a faux pas.\n\nI was at an upscale pub, it wasn't a very busy last night. Maybe a third of the 50ish seats were occupied  and there was 3 bartenders working. I was dining alone and chose to sit at the bar. I looked nice but it was what I wore to the office, nothing over the top attention grabbing. A guy there kept inching closer to me as seats opened up. He struck up a conversation and I obliged, I was trying to keep it platonic he kept flirting. As he drank more he began invading my personal space. My body language was clearly leaning away from him and occasionally scooting my chair further. He's obviously a regular at this bar as all 3 of the bartenders knew him and he made some chit chat with them at various points.\n\n After the third time I'd removed his hand from my waist I got up to go to the bathroom and when I came back I didn't sit back down and asked for my check instead. The guy sat there and didn't give me any problems or anything and he still had a full glass of wine in front of him.  Then the bartender looks at him and asks him if he wants his check now too?!?  \n\nOur collective body language did not indicate we were leaving together, he still had a drink and he didn't ask for his check himself. WHY?!? I felt so uncomfortable the last thing I needed was this drunk dude offering to walk me to my car. I couldn't pay that stupid bill fast enough and I high tailed it out of there and to my car SOOOOOOO fast. It felt like the bartender was helping him out to not leave alone instead of looking out for a potentially vulnerable female patron. \n\nAm I right to be upset? Or do I need to put my big girl pants on? ",
    "score": 672,
    "url": "https://reddit.com/r/bartenders/comments/1neal23/i_feel_like_bartender_sold_me_out_to_a_regular/",
    "created_at": "2025-09-11T14:38:48.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1nrdznz",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Cant believe how hostile people have become towards tipping and service industry people",
    "text": "I was scanning reddit the last few days and as a girl that made her living in the bar industry I know I am preaching to the choir that people have no idea how hard the job can be until they work in the industry and then I come across r/10thDentist and the attack on people in the service industry and how if we all made $15 an hour they wouldnt have to pay our salaries anymore. Literally made me sick to my stomach!  The lack of understanding that NOBODY is doing the job we do for $15 an hour!  The reason we do the job and yes there are nights where I loved the job but there were also nights where I have wanted to sit down and cry and I am sure as hell not doing the job for $15 a hour!  The people that do all this complaining about tipping are always the ones that are the most high maintenance in my experience and want to treat us like its our lot in life to wait on them.  If people get a chance read that post and see the hostility and misunderstanding or ignorance for the job we all do and I will be shocked if it doesnt enrage anyone that has ever done the job for 2 shifts?",
    "score": 287,
    "url": "https://reddit.com/r/bartenders/comments/1nrdznz/cant_believe_how_hostile_people_have_become/",
    "created_at": "2025-09-26T21:48:00.000Z",
    "num_comments": 252
  },
  {
    "id": "reddit-1ng7uo5",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Shout out to the Barbacks",
    "text": "My husband and I are career industry, 16+ years apiece. I currently bartend at a lil local venue and hes at a trendy, high volume arcade bar as a barback. Visited him last night and gosh dang he's a stocking, cleaning, ice-getting, dishwashin' fuckin' machine. So, I dunno. Shout out to all the good barbacks out there, we love you. Cheers!",
    "score": 249,
    "url": "https://reddit.com/r/bartenders/comments/1ng7uo5/shout_out_to_the_barbacks/",
    "created_at": "2025-09-13T20:26:50.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1jfnz5e",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Got Yelped tonight",
    "text": "Group of six order six shots of Jack from the other bartender while I’m working the other side. Tells me “group that was over there stiffed on six shots. FYI”. They weren’t still there there. Maybe 5 minutes later guy with glasses comes up to the bar and accuses me of stealing two shots. Likely the shots got swept with the empty ones minutes prior, thinking they were chasers. Don’t leave drinks unattended for long periods of time. Definitely don’t bark at me. I talked to the other bartender to see if he swept up full shots. He doesn’t remember because why would he. We were burning and churning and sweeping glasses we think are done to make the bar presentable to the next customers. He says glasses guy is part of the no tip group. I say something snarky about the no tip. Like “Are you accusing me of stealing but part of the group that tipped zero on six shots?” I turn and serve some other customers. The entire group is there now. Guy I assume bought the first round says we’ll just get six Jameson’s and six Ginger backs. I’m still willing to try to salvage this. I line up the 12 shot glasses. Pour six gingers. One second into my first Jameson pour, guy with glasses tells me two off those should be free in a demanding disrespectful tone. I stop my pour and say “That’s enough. You guys need to get out.” Day 6 of St Pat’s weekend. Wednesday during  college finals week. Was expecting it to be dead. It wasn’t. I had no more gas. They amazingly left. Could hear the girl who left the Yelp review muttering about me being racist. Guy that bought the first round actually seemed cool. My take is he can’t afford to tip cuz he’s buying drinks for his friends that can’t afford to drink. I’ve been there with broke friends, and find that a cool thing to do, if that was the case. I was gonna comp a shot and apologize to him. He was the one that said to his group let’s just go to another bar. His tone of voice was calm and collected and he was always so talking to me. I’m certain this wasn’t the first time his friends got him and their group kicked out of places. Glasses guy and girl were just being disrespectful out of the gate. It’s a dive bar. It’s most definitely not a casino. We don’t have to tolerate it. \n\n\nNot even mad. I just had a feeling there’d be a Yelp review, and sure enough. I had nothing to do with the original round or transaction. Just have the receipt with zero dollar tip. Being a dive bar poor Yelp reviews are to be expected. Maybe even a badge of honor.\n\nFor the record I’m definitely not racist. (I know someone will comment that’s what a racist would say.). I have however been in the bar industry long enough to hate the entire human race.  Im an equal opportunity hater. Treat me with respect and don’t act a fool in my bar, and I’ll do the same. I’ve been called everything hateful thing in the book in my career. I would say none of the hateful terms bother me anymore, except thief. Being accused of stealing gets my goat. \n\nHate crime, I’m clueless on. But from experience when a customer is being a dick to staff, they’ll likely be a dick to the wrong customer. Then there’s a fight. A real crime. Cops come. I have to fill out paperwork. I hate that. I’m not shy to kick out customers if I think that can become an issue. I don’t think the group tonight was that bad. Just wasn’t having the their attitude tonight.",
    "score": 205,
    "url": "https://reddit.com/r/bartenders/comments/1jfnz5e/got_yelped_tonight/",
    "created_at": "2025-03-20T12:40:42.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1n9e5t3",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Managers are asking me (a barback) to train a new Bartender.",
    "text": "So i’ve been working at this restaurant for almost 6 months now and although I improved drastically and can make any drinks in under a minute or two, I quickly realized that the chances of me becoming a bartender at this place a slim to none. Instead of training us to become bartenders, they’re hiring random people and are asking me to train them so they can become bartenders. To me that is extremely disrespectful. I don’t want to be training someone who will end up making double my salary + tips when i’m getting paid minimum wage without the chance of getting any tips. \nIs it normal for managers to ask barbacks to train their bartenders??? (I’m talking training, not how the bar is set up which is obviously normal) And am I in the right to tell them I don’t want to be training someone who’s supposed to already know the classic drinks and all? ",
    "score": 117,
    "url": "https://reddit.com/r/bartenders/comments/1n9e5t3/managers_are_asking_me_a_barback_to_train_a_new/",
    "created_at": "2025-09-05T19:11:36.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1kzvybq",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Update: I did the busy shift and learned that this just isn’t my thing lol",
    "text": "Well, I didn’t call off.\n\nBut I have officially learned that I am just burnt out of the restaurant industry. Bartending is an entirely diff scenario from waitressing. My lack of experience over the past decade was so limited so idk wtf they hired me anyway. the few times before I did it was when I had private parties at the old venue I worked at with limited mixed drink menus. I do not like being trapped behind the bar at all. I absolutely hate small talk. And I don’t know shit about cocktails except for simple mixers, everything else takes me 3 mins to make and the severs are just aggravated with wait times as much as I am making them. \n\nUnfortunately I have to work this job until Sept but I cannot wait to put in my two weeks and find a career path that doesn’t involve customers and food. \n\nUntil i can quit ill be taking as many breaks as I possibly can during my shifts cause I feel so uncomfortable behind a bar. Cheers 👍🫠\n",
    "score": 99,
    "url": "https://reddit.com/r/bartenders/comments/1kzvybq/update_i_did_the_busy_shift_and_learned_that_this/",
    "created_at": "2025-05-31T12:29:48.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1o8g346",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "About to leave the game for good and it's bittersweet",
    "text": "Well friends, I've finally had to give up the game. I've been working for the last three years with a degenerative motor neuron disorder and I'm finally at the point where I can't be behind the bar anymore. It's getting difficult to communicate and moving around is tough. I've had all the patience in the world from staff, management, and guests. They've restored some measure of faith in humanity. Take care of your health and appreciate that we have a really amazing career. We all have tough days but leaving is even tougher. If any of you are working through persistent injury or pain, my heart goes out to you.",
    "score": 92,
    "url": "https://reddit.com/r/bartenders/comments/1o8g346/about_to_leave_the_game_for_good_and_its/",
    "created_at": "2025-10-16T19:41:42.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1ik8k43",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "For those who no longer tend, what do you do for work now? And does it earn you a better income than bartending?",
    "text": "The “job/employee search” flair made the most sense\n\nSo I’m a bartender at a casino in Vegas. My service industry career has not been what I thought it would be BUT it did get me above the poverty line after 10 years working in retail for minimum wage and growing up on government benefits thanks to an addict parent and another parent who was physically able but chose not to work. \n\nNow I feel I’m ready to take my income to new levels, to rise higher, I just feel like their has to be a greater purpose to my life than making vodka sodas, bourbon diets, and rum cokes to elderly gamblers. \n\nFor those of you who left being behind the pine, what are you doing now, and is it more lucrative than bartending?",
    "score": 85,
    "url": "https://reddit.com/r/bartenders/comments/1ik8k43/for_those_who_no_longer_tend_what_do_you_do_for/",
    "created_at": "2025-02-07T23:08:33.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1nc9jah",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Has anyone here actually done a bartending course, then got a bartending job with no hospitality background?",
    "text": "18 years in the industry, I never met someone who has.  Every career bartender I've met started at the bottom of a restaurant, and worked their way up.  I was a dishwasher for example.\n\nIf you personally have, or met someone who did, what was it like after getting hired?\n\n",
    "score": 78,
    "url": "https://reddit.com/r/bartenders/comments/1nc9jah/has_anyone_here_actually_done_a_bartending_course/",
    "created_at": "2025-09-09T04:27:14.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1nvq5eo",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Ex-bartenders, what do you do now?",
    "text": "Thought I’d be in the industry for much longer, then covid shifted my plans. Currently enjoying the shift to tech sales, but have retirement dreams to open a cafe/brewery fusion as a passion project.\n\nI still think about bartending again just for Sunday brunch. Wanted to see what fellow ex-hospitality workers are doing as a career, post-FOH life.\n\nFor those who are no longer in the industry full-time, ever thought you’d end up where you are now? Any considerations on going back?",
    "score": 78,
    "url": "https://reddit.com/r/bartenders/comments/1nvq5eo/exbartenders_what_do_you_do_now/",
    "created_at": "2025-10-02T01:06:07.000Z",
    "num_comments": 150
  },
  {
    "id": "reddit-1myaacs",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Sober bartenders - how did you quit while in an industry where drinking is so prevalent?",
    "text": "Didn’t know what to add for flair since none really fit this post\n\nStarting to realize I have a problem and something needs to change but I love my job and don’t want to find another career now. I work at a spot that is very much ok with drinking on shift and the boss will even do shots with me so i think it will make it harder to quit or moderate. Any advice is helpful. I know lots of sober bartenders that had issues with alcohol but I’m not comfortable enough with them to discuss and I don’t want to admit my problem in case I continue to struggle with it.\n\nEdit: this support and advice is actually making me tear up and means so much to me. I love this community thank you all for being so kind and supportive ❤️",
    "score": 73,
    "url": "https://reddit.com/r/bartenders/comments/1myaacs/sober_bartenders_how_did_you_quit_while_in_an/",
    "created_at": "2025-08-23T19:15:06.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1igh20w",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Anyone else having the slowest night of their career?",
    "text": "I've sold a little over $200 since my shift began at 5. My bar has been completely empty since my last customer left 2 hours ago. I don't think I've ever experienced a night this dead since working through a hurricane 15 years ago. Anyone know what's up? I thought things were picking up this last week, my Thursday mid-shift was very solid.\n\nI'm in Seattle if that helps.",
    "score": 53,
    "url": "https://reddit.com/r/bartenders/comments/1igh20w/anyone_else_having_the_slowest_night_of_their/",
    "created_at": "2025-02-03T04:37:34.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1masok1",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Tough night last night. Feeling shitty about it",
    "text": "sorry, this is gonna be long af.\n\nI've been doing this a while as a lot of us have, and have had my fair share of insane, wall to wall nights. Last night was just a clusterfuck of epic proportions and I wanna know if yall would've done the same thing.\n\nOne of our bartenders was fired recently, a week before another was set to take a 6 week vacation. She's on vacation now, so i've been given 2 bartenders from another location who have been gone for years. So i'm training them on menu items/closing/opening etc. for the next 6 weeks until she's back. This has created some confusion this weekend, but it's been manageable. it's been slow in town so it felt alright.\n\nProblem is, we're without a bar back right now as well. Barback usually does the typical duties, but also busses the floor, takes IDs, bounces/crowd control, as we're not a restaurant and there's no host or anything. It was just me and a trainee last night. Normally operations are smooth and we can handle crazy service when we're fully staffed.\n\n3 hours in it was completely dead. I caught up on cleaning, batching and such. about 10:30 it was still so quiet that I made the decision to have the trainee close the second well and start barbacking - he was cool with this. I felt fine taking guests myself if he could keep everything else in line.\n\nno less than 10 mins after fully closing the well, 50 people walk in. 2 large groups, one being a bachelorette party and the other a group of college kids and the remaining just some stragglers from a local concert. It was pandemonium. They were cutting each other in line, screaming orders at me, etc all before even being able to grab ids. at that point, me and my trainee came to the conclusion that both groups were wayyyyy too fucked up to serve. They had lost phones, lost IDs, couldn't read the menu, keeling over level fucked up. they were reaching into my beer fridge, knocking tables over, etc. It was a mess. My trainee took the lead to ask everyone to leave as we couldn't serve them. This led to the stragglers thinking we were referring to them as well before we even had the chance to check their ids and size them up. For context, it is a very small bar with an outdoor patio for overflow. We do not have the capacity for people to be blocking exits and keeping the door open.\n\nWell, a couple of members of the groups were okay, I could tell they were kind of the designated wranglers of the group. Like the maid of honor of the bach, and a couple of girls from the college kids. I got everyone some water at least and they went to sit on the patio to cool off. Everyone was super pissed except for the sober people in the groups who were trying to get their friends to calm down. Like there were people straight up threatening to fight us and shit, some of the girls were crying because they couldn't find their shit and everyone was overall just confused and frustrated. \n\nThis big mess of anger and drunkness led to me totally breaking down in frustration and I just closed the whole bar and asked everyone to leave immediately. It was an unprecedented situation and i've never done that before. We were closing in an hour anyway, all of the regulars and okay guests had already closed out and were just chilling anyway, and felt that if i served these people, i could be responsible for something deadly and I was going to be lucky if they even paid their tabs. My manager and trainee agreed that the situation was not salvageable and everyone had to go, but I still feel guilty for shutting it down. Never in my bartending career have I had to just kick the whole bar out, but it was heading into a situation where I wasn't going to be able to control anything, we were so understaffed, and I was afraid it would get even more out of control. I didn't want to add fuel to an already massive fire. \n\nSorry this was so long, I think i'm just trying to make myself feel better about kicking out so many people, and putting into writing what i'd tell our owners if they asked what happened. It just felt like woodstock 99 in there and I didn't have the manpower to figure this shit out.\n\n",
    "score": 39,
    "url": "https://reddit.com/r/bartenders/comments/1masok1/tough_night_last_night_feeling_shitty_about_it/",
    "created_at": "2025-07-27T17:48:09.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1pumf3b",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Craziest night of my career, and WWYD?",
    "text": "This happened Saturday night \n\n2 lesbians walk into my bar and I'm doing the things; asking where they are from and why they are here, etc. They are seated at one end of the front bar and another guy sits Kitty corner from them on the end of the side next to them and they start chatting. \n\nNow, the butch lesbian must have had untreated adhd because she was bouncing around all over the place and she was funny as hell. I catch the lesbians asking the guy if he would be down for a threesome with them. He's like \"I'm married, my wife would kill me\". Then it begins:\n\nThey start saying they really want a baby and are looking for a man, any man, to \"hit it and quit it\". They start giving reasons why he should do it and some of them had me rolling in the floor laughing \"we will build a statue of you!\".\n\nNow, the guy was laughing and occasionally mouthing \"help me\" to me, but he wasn't making any effort to help himself. In fact, he actually got up and moved to the front of the bar to be even closer to them and kept trying to kiss them and at one point he was groping both of them. He seemed to be more into the butch girl than the other one, but she was willing to put up with it for \"the cause\". They kept asking if he had brothers, or if I knew anyone I could call. At one point or another, they propositioned every single man in my bar. \n\nNow, this was all in good fun, right??? \n\nI told the guy at the bar \"now you know what it's like when men won't take no for an answer\", but I did feel kinda bad for him on one hand. (I'm a woman, for context.) On the other hand, his feet weren't nailed to the floor and I told him so several times. \n\nI went and told some friends on the floor what was happening at the bar and then everyone was at the bar and another local girl joined in pressuring the guy at the bar. That's when things kinda cross the line imo because they were joking about how the guy has a rape fantasy and asking me if I had any roofies or zip ties. At this point I started to worry that I could get in trouble somehow so I went to the guy and told him to take my hand and I would escort him out of the bar or at least away from these women and he never took me up on it. His words did not line up with his actions. He seemed to be loving the attention and they were all getting drunk. Finally, the guy apparently agrees to do it and goes to the bathroom and the girls were huddled together \"OMG it's really happening\" etc. When the guy comes back they tell him they have changed their minds and decided not to go thru with it because she couldn't really bring herself to have sex with a stranger. That's what she said, but I think she was offended because the guy was more into the butch girl than her. But they still didn't leave. The other girl started cuddling the guy and eventually last call comes and they all leave together. They told me they would come back the next night and let me know what happened, but they came before I started my shift and left me a note. It did NOT say what happened, just \"it was so nice to meet you, we had a blast, we will definitely be back, etc\". They did include their phone numbers and said I'm welcome to stay with them when I come to their town in 3 weeks, but I've decided it's best not to text them. \n\nI was all by myself that night as my co-worker had called off. Not sure if I should be worried when MGMT checks surveillance of that night or not.\n\nWhat would you have done? ",
    "score": 36,
    "url": "https://reddit.com/r/bartenders/comments/1pumf3b/craziest_night_of_my_career_and_wwyd/",
    "created_at": "2025-12-24T12:36:15.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1olmqmd",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Need advice dealing with creepy regulars",
    "text": "So the past few weeks I 27f have been getting super creeped out by two of my regulars and these interactions are making me straight up want to quit. (I've been bartending for almost 5 years now, only had a strange feeling about one other customer during my bartending \"career\" before this.) Both come in during my shifts, all the time now. Which I kinda thought like whatever, they're lonely dudes looking to socialize with someone familiar. Who cares, ya know. I have a bunch of cool regulars that I love seeing that come in to talk to me. \n\nBut recently, they've both been trying to push boundaries. One of them has asked me out several times. To which I've always been like no dude, I have a boyfriend. The other night he wrote his number down 3 times on the back of the recipient paper (didn't even tip me btw). Like he just won't take no for an answer and it's getting to be super fucking weird. Tonight he ordered one round, finished it, didn't get anything else and just stared at me. To the point another customer at the bar asked him if he was okay bc it was that fukin weird. I told him that since he's cashed out and finished that he needs to go and he just giggled to himself. I was so busy that I couldn't really address it further but he did end up leaving a few minutes after. \n\nThe other guy already refers to himself openly as an incel. And at first I didn't mind this customer, always been chill and polite. Once I heard my coworker say he said he was an incel to her, it kinda put me on guard a bit. I wore makeup to work a week ago and he was super weird, calling me hot and stuff. I kinda just tried to brush it off. The other night my boyfriend came in and it seemed like this dude was actually upset. Said I was hot right in front of my boyfriend like kinda aggressively which was pretty weird. And he's been like asking for hugs recently, which I've been turning down every time. \n\nI'm not sure what to do exactly bc its not like they've really done anything to ger 86ed yet. But they've been really creeping me out and idk if I'm just being paranoid but the way they both stare at me is fucking strange. \n\n( I also am a closer and get off around 3:30 in the morning and I have to walk to my car alone. Which makes this situation a bit more like not cool and makes me afraid) \n\nAny suggestions from a female who's dealt with this weird shit would be awesome. Seriously considering not working there anymore bc this has been freaking me out even though I know it doesn't sound like much but my intuition is telling me this is freaky. Going to bring this up in therapy next week bc I can't tell if I'm overreacting or picking up on something. ",
    "score": 30,
    "url": "https://reddit.com/r/bartenders/comments/1olmqmd/need_advice_dealing_with_creepy_regulars/",
    "created_at": "2025-11-01T12:37:05.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1jg93bo",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "trans bartending rant",
    "text": "so i (22, ftm) have been bartending for about 3 years now. in that time i have about 4 different bars under my belt. the first two jobs, i got largely for looking feminine. i would do my makeup, wear super tight clothes, and leave with super fat pockets of tips, but insane amounts of sexual harassment. i am really passionate about the art of bartending, put regulars together really quickly and built a nearly encyclopedic knowledge of whatever each job paid me to know. i’ve been the highest paid at every job i’ve had after 3 months. i quit 1 job for wage theft, was fired from 1 in retaliation for reporting wage theft (after receiving my settlement), quit one over daily increasingly violent sexual harassment, and am currently working at a bar that does not pay well due to little foot traffic but treats me wonderfully. \nsince making an effort to look more masculine, my pay has plummeted. i’m looking for a stable job that treats me well, doesn’t have to respect me but let’s me in to prove myself and pays half decent but they all keep turning me away and on my way out i see the bartender always hyper feminine. so i went to the gay bars, always overpopulated with men and having male bartenders, but even after hormones and surgery, qualifying states of queerness im not the kind of queer they’re looking for. i’m starting to feel like all of the thick skin i’ve built against transphobia, sexism, general stress of a high volume industry got me nowhere. i used to get a fire under me when customers or management would say trans or homophobic things to me, id be like “yes this is the thick skin everyone says i need to survive in this industry. this is how i learn to stick up for myself, remain professional, build resilience” and i did. i got touched on grabbed and each time i didn’t take it home with me. i was the perfect professional victim, i was a team player, i was someone queer people came to for comfort. i was everything we learn to be in our homes and in school. \nand now i’m visibly trans. i see the look on my interviewers face when i walk in and they see i’m not the girl name on my resume and i think wow all the muscle i built to be brushed off. i’m feeling beaten down. this industry punishes people who want to serve it as a career. people who have given their personhood for the very few and far between perks. i’ve shmoozed and i still have no idea how anyone gets a solid longterm job. this sucks. sorry for the long rant. ",
    "score": 29,
    "url": "https://reddit.com/r/bartenders/comments/1jg93bo/trans_bartending_rant/",
    "created_at": "2025-03-21T04:52:41.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1ijp7yu",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "75K a Year Bartending. Do I leave and go back to school?",
    "text": "I'm kind of at a crossroads right now. I'm trying to decide if I should dive into bartending/hospitality as a career or go back to school and get a business degree (or really any degree). I'm 27 and working in Seattle as a Bartender making $1200 net paychecks a week working 35hr weeks. (Seattle has the highest minimum wage in the country for a tipped employee at $21/hr).\n\nI'm really torn and would probably still bartend through school. Just not sure if making the switch and going back to school is worth it. Sometimes it feels late in life to be switching up careers so drastically. I like working strange hours and meeting different types of people all of the time. I think I mostly just crave a changing non-monotonous work environment. Traveling for work could be cool!\n\nThere are obviously parts about bartending I don't like as l'd find with any job. I'm not sure if l'd love working in an office environment in front of a screen all day. I'm really just ignorant about the kind of careers that are out there and what doors a degree would really open up if any. I definitely don't want to make less than I do now.\n\nWondering what's out there? Any other bartender out here made the switch? Was it worth it?",
    "score": 28,
    "url": "https://reddit.com/r/bartenders/comments/1ijp7yu/75k_a_year_bartending_do_i_leave_and_go_back_to/",
    "created_at": "2025-02-07T07:02:12.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1jwhgbg",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Diet Coke garnish",
    "text": "Every diet Coke that I serve comes with a lemon garnish. I don't remember when I started doing this. It it must have been early on in my bartending career. I don't know why this is done. I have never garnished a regular coke. Do people actually enjoy lemons in their diet Coke or is it just to distinguish between diet and regular coke?  (I really wasn't sure which flair to put for this post, there should be a flair for stupid questions)",
    "score": 24,
    "url": "https://reddit.com/r/bartenders/comments/1jwhgbg/diet_coke_garnish/",
    "created_at": "2025-04-11T04:22:41.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1j0wej8",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Ive recently started bartending at a place with 250+ bourbons. Ive been in restaurants for 20 years, but only recently started bartending.",
    "text": "What are some things that maybe able to help me out?  Besides the Manhattans, Old Fashioneds, what else?  Should I attempt a sour with egg?  I dont even know what's 'hip', because this is newer territory for me, and ive really only focused on food and wine my whole 'career'.  I like being creative.  We have a ton of great steaks, tomahawks, porterhouses, that kind of thing.  Occasional 'gamey' meats as well.  We have a bunch of other stuff, so we dont exclusively sell ourselves as a steakhouse.\n  \nI also 'created' a new drink, that I know could use refinement, but it's gone over quite well.  It's definitely very 'bold' (sour/tangy), but it's this Devils Due Blackberry Moonshine (50 proof) 1 oz., Any other whiskey/bourbon 1 oz. (to bring the proof of the drink up, ive been using Crown because it seems to be a liquor no one really will turn down), splash sour about .5 maybe a smidge over, splash simple .5 but probably a smidge under, and then 2 ounces of half fresh lemon and lime juice.  Shake, pour over ice, top with soda.  \n  \nThanks!  \n  \nEdit: thanks for the feedback, got lots of things to look into!",
    "score": 20,
    "url": "https://reddit.com/r/bartenders/comments/1j0wej8/ive_recently_started_bartending_at_a_place_with/",
    "created_at": "2025-03-01T10:15:13.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1i261zj",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "What’s your martini recipe?",
    "text": "I’ve been a bartender for around 8 years. I feel very comfortable in my position and know the majority of classic cocktails, but I’ve always questioned my classic martini’s. \n\nI’ve worked in the same restaurant chain my entire career. We serve 2oz martinis unless upgraded to 3oz which rarely happens. Unless specified to be extra dry or dirty we usually rinse the glass with vermouth then double strain the alcohol into the glass. I know that might be incorrect since a rinse would lean into dryer territory. \n\nI’m just wondering what your suggestions are for a 2oz martini in terms of the amount of spirit/vermouth. \n\nSorry if this has been covered before. I searched Reddit and most recipes call for 2/1 or 3/1 which isn’t really an option at my work. ",
    "score": 19,
    "url": "https://reddit.com/r/bartenders/comments/1i261zj/whats_your_martini_recipe/",
    "created_at": "2025-01-15T19:50:23.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1jl0408",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Getting burnt out, considering career change.",
    "text": "I just got fired a few days ago for calling in sick with a flu so horrendous I was hallucinating. My job was put on poached the day after I got my shift covered. I'm so tired of dealing with sleazy owners and managers. \nI'm sober almost three years and I feel like I'm stuck in some sort of death loop. I lost most of my connections, and in my city, connections are the only way to get the GOOD bartending gigs. So I'm left dealing with all the B team bars that are constantly hiring on poached. Until something like this week happens and then I'm back on the hunt in desperation. \n  I'm great at my job, kill it with guests, I rock a busy rail, I truly do believe I'm great at my job, I just can't seem to get an in at a truly worthwhile place that isn't ran by degenerates or sleazy boomers. \nHas anyone made a successful transition to liquor rep/sales or something of the sort? How'd you pull it off? I'm in a spiritual bankruptcy atm. I just wanna have fun at a good spot, work hard, get paid well, and go home. I feel like I'll never get a shot at a good gig again. ",
    "score": 18,
    "url": "https://reddit.com/r/bartenders/comments/1jl0408/getting_burnt_out_considering_career_change/",
    "created_at": "2025-03-27T09:39:25.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1n5baep",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Do I go all in on bartending?",
    "text": "Seriously need some advice from some professionals that may have some experience with this and can give me some guidance.\n\nThe biggest life choice I have is right in front of me and it could have a huge impact on my future.\n\nFor context, I currently work 2 jobs bartending at 60/hrs a week at a country club and restaurant and clear about $3-4k a month. It’s draining, I’m burned out, and want to accomplish 2 things: financial freedom and living a meaningful life full of connections.\n\nThis is where it gets tricky. I have 2 paths in front of me that differ heavily. I’ll label them A and B.\n\nPlan A is to get my financial licenses to become a sales consultant for annuities and insurance. The base is salary $58k and I’m eligible for commission in 12 months from when I receive my license. It is an in person 9-5 however hours could go over what I’m expecting.\n\nPlan B has just come across my plate from a connection at one of my bartending gigs. My coworker used to bartend at major events, golf championships, festivals, banquets, car races, boat shows. It’s a life full of traveling, exhausting hours, meaningful experiences, and risk. So much risk.\n\nI live at home, I’ve worked sales before and have been really burned out from every position I’ve been in up to this point. The salary I’m being offered is the most I’ve ever received, and the bartending gig is a void into the unknown. My parents are risk averse, they want me to take the 9-5. My friends and siblings are not so much so, but nobody knows anything about that scene except my coworker. I’ve never travelled like that really(I have somewhat but yearn to travel more and meet new people).\n\nI’m seriously stuck, and I am scared to make a choice here that doesn’t meet my financial goals and will have me behind and having missed the other opportunity. Can somebody help me decide which choice will leave me feeling the least with regret?\n\nTLDR: Deciding between Special events bartender or annuities sales consultant, what choice will leave me with the least regret?",
    "score": 15,
    "url": "https://reddit.com/r/bartenders/comments/1n5baep/do_i_go_all_in_on_bartending/",
    "created_at": "2025-09-01T01:04:02.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1izb3w4",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Anyone else's hands suffering?",
    "text": "Been bartending around the Midwest to East Coast and back for 10 years now. \nIs anyone else suffering their hand skin health as much as I am? \nCracks, peeling, bleeding, and pain. \nI do have eczema but hands have been fine for the first 5 years of my career. \nThese days I need 3 days of healing just to do my fuckin job. \nAny advice or thoughts? ",
    "score": 14,
    "url": "https://reddit.com/r/bartenders/comments/1izb3w4/anyone_elses_hands_suffering/",
    "created_at": "2025-02-27T08:27:27.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1pcgxlo",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Suggestions for industry books not focused on mixology",
    "text": "Long story short, I’m changing g careers and moving back into a bar manager position. \n\nInterested to hear any recommendations on books about staff culture, training, keeping high standards etc. \n\nThis is the type of bar that should do the classics well and have some variety for the niche customers, but it’s not a very high volume place. \n\nThanks in advance!",
    "score": 14,
    "url": "https://reddit.com/r/bartenders/comments/1pcgxlo/suggestions_for_industry_books_not_focused_on/",
    "created_at": "2025-12-02T18:52:55.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1i6ypmq",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Been in the industry for 13 years and looking for new career path.",
    "text": "Long story short been bartending along time and I make decent money at it. But I want to move closer to my kid and she doesn't live near good bars or restaurants where I can make enough money to live there (source: I used to work there). I'm open to a new job in anything but with having a kid and high cost of living, as well as no experience in anything else minus a short stint in the army, I can't start at minium wage. \n\nSo who has jumped jobs and what kind of job did you do? Would love to hear some potential options for me. Thanks for the help! ",
    "score": 14,
    "url": "https://reddit.com/r/bartenders/comments/1i6ypmq/been_in_the_industry_for_13_years_and_looking_for/",
    "created_at": "2025-01-22T01:01:48.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1puwqwl",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "lady who does payroll for my bar keeps getting my paychecks wrong",
    "text": "there is a big issue at the place i work where im missing tips from my paycheck and/or im missing my weekly “salary”. this happens way more often than it should, every time i discuss this manner its like pulling teeth trying to get my money and im quite tired of it. what can i do about this cause its pissing me off, i get mistakes happen especially when it’s one person doing payroll for 5 bars/restaurants but i don’t really care cause i don’t work my ass off to be missing tips and my weekly salary",
    "score": 13,
    "url": "https://reddit.com/r/bartenders/comments/1puwqwl/lady_who_does_payroll_for_my_bar_keeps_getting_my/",
    "created_at": "2025-12-24T20:36:40.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1nq8p21",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Potential tip theft?",
    "text": "Started working at a family establishment with multiple bar locations on site. A coworker told me that our bar manager (position is named bar leader) takes a portion of pooled tips from all locations before they are split amongst the bartenders at their respective locations. \n\nWhat I was told is he does not bartend directly but is responsible for checking in with us, refilling kegs, restocking our bar, taking empty bottles or trash, etc. Apparently, he has directly acknowledged he does not think the tip taking for him is fair because he is also salary and full-time. He takes the tips nonetheless. \n\nWould rather not shoot myself in the foot by asking if this is legal in front of management should the topic come up. Is this reportable? Anonymously\n\nU.S. Based - IL",
    "score": 11,
    "url": "https://reddit.com/r/bartenders/comments/1nq8p21/potential_tip_theft/",
    "created_at": "2025-09-25T14:45:00.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1n7jsqz",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Newbie seeking advice",
    "text": "25 y/o female, quit a five year career in finance to become a golf course bartender this summer and absolutely fell in love. 60 hour weeks and having more fun than I’ve ever had in my working life. I’m trying to make the move from WI to the eastern Mass/north shore/Cape Cod area. Is anyone local to that area and have a gauge on how possible that would be? I’m applying for some jobs now but I have a feeling it will be hard to find a place to give me a chance given my limited experience and the fact that I’m not currently local. \n\nIf it’s seeming highly improbable I may find something local or seasonal to gain more experience then try applying again in the spring/summer…. Any and all advice will be highly appreciated!! \n\nEdit: also looking at Newport, RI if anyone is local with insight! ",
    "score": 8,
    "url": "https://reddit.com/r/bartenders/comments/1n7jsqz/newbie_seeking_advice/",
    "created_at": "2025-09-03T16:37:40.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1jj5n86",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "How do you cope with being highly skilled in a “low-skilled” industry?",
    "text": "We’ve all heard it (some of us 1000’s of times) - “Why don’t you get yourself a “real” job?” For years it didn’t phase me. For years my optimism outweighed my doubts in having chose the career I wanted. \n\nI’m 23 years in this year and I’ve fallen deeper in love with my career despite how much society and circumstances say and amplify how much of a bad idea it is. \n\nI’ve had horrendous luck with employers too, but a few opportunities that boosted my skill, creativity and knowledge to the point that the stubbornness in my bones don’t want to give it up. The creativity within liquid flavor gets me excited still and maybe always.\n\nI should be a consultant by now, but poor leadership (blocking me out), a lack of marketing skills, and most importantly a lack of capital have been a roadblock to that. \n\nI’ve made the same wages across the board. From the time I was 15 hustling at local restaurants and catering on the side until this day (doing the same), more than two decades in the industry, I still have the same salary, ahem, wages. \n\nI have more and more bills (you know that while inflation thing) and now the lack of health insurance, time off, and freedom (cause I’m always broke &amp; becoming more broken) have left me wearing financial stress like it’s an actual shackle (it kind of is).\n\nI guess I’m mostly looking for light in the abyss. I can’t afford to “re-educate” myself into  a “real” job and it feels like a dagger in my heart and soul every time my profession is considered “not real.” Is about as real as labor can get.\n\nI’ve avoided having a family, lived out of a car for awhile (a few times) and still find it extremely difficult to be treated with respect by my leaders and coworkers. I’ve firmly learned how to not care about my customer’s opinion, they are the easiest part of my career and a big part of why I’m still here, it brings me gratitude to serve the public. That said, I feel like I’m working twice as hard for half the wages due to the work ethic (or really lack thereof) of the industry.\n\nIf I ever get my hands on enough capital or find the right opportunity, I could run an impeccable establishment and it’s my dream to create a space that’s exciting for everyone to be in. Where the staff gets to constantly learn off each other (and actually enjoy being there like it was when I started, it was DO much fun!) and the customers just gravitate towards it because it’s a great place to be.\n\nIs there anyone else in the abyss feeling squashed by the industry and it’s lack of respect while we’re out here working harder than most, longer than most, on just about every street corner (as exploitation within the industry is at an all time high i.e, doordash, trust funds &amp; having to pay for our own permits and often train off the clock to attain them)? \n\nMost importantly is anyone noticing their health slip due to lack of wage increases and benefits in the industry? Along with constantly being told to “pick yourself up by your bootstraps.” \n\nRestaurants &amp; hospitality are the backbone of modern human existence. It’s the modern third place where social health is thriving (and I believe always will), but somehow we’re not important, low skilled 😖🤬, &amp; in many people’s view “undeserving” because we didn’t choose a higher wage job.\n\nI guess I’m trying to differentiate if it is just my luck, or a common thread? Maybe I really am outright stupid for sticking with it (shrug).\n\nI always hear about people who “make bank” bartending, but as my skills increase I’ve found them more and more exploited in the industry (shrug).\n\nI don’t know, guess I’m just feeling like I’m floating on a clouded island out here right now. Can’t afford therapy, so I guess I’m just seeking other points of view.\n\nMore than anything Santé to those out there everyday getting paid less than your worth! I care about you! A LOT!\n",
    "score": 7,
    "url": "https://reddit.com/r/bartenders/comments/1jj5n86/how_do_you_cope_with_being_highly_skilled_in_a/",
    "created_at": "2025-03-24T23:40:02.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1jj29u6",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Are Tip Pools a Scam?",
    "text": "hello! sorry for a lot of numbers off the bat and potentially bad grammar.\n\nso i bartend ~30 hours a week for a social club in a city. i make $20 an hour with health insurance (taken out of my paycheck) so they call it “salaried”.\n\nwe do make “tips” due to a 20% auto-grat on all transactions. HOWEVER all of that money goes towards our hourly pay with any extra tips getting pooled between all FOH employees every paycheck, so i really make only 2 or 3 extra dollars an hour.\n\nam i getting scammed? i’ve seen this business model before but never with health insurance and can’t decide if it’s worth it i suppose.\n\nmost days are slow but some nights i make at least 100 drinks if not way way more during parties and weddings. but i’ve been here 7 months and i can’t help but feel like i’m just giving free (or customer paid, really) labor for the higher ups to make BANK off of. it’s not just beer and wine or something but $15 cocktails. i prepped and made the drink but don’t see the money that my craft cocktail bartender friends at traditional places walk with at the end of the night. \n\nsome of the members leave generous additional tips and are shocked to learn not only will it get pooled to 25 other people, i could lose my job for pocketing it. lmao i suppose that’s kind of its own issue with pooling.\n\nit’s a beautiful place and the people are incredible. they’re truly the only reason i’m still working there, but my partner and i are paycheck to paycheck. i’ve been in this industry long enough to know that tip pools are fucked but i need a third opinion here to solidify it. \n\nwhat do?\n\nthanks yall",
    "score": 7,
    "url": "https://reddit.com/r/bartenders/comments/1jj29u6/are_tip_pools_a_scam/",
    "created_at": "2025-03-24T21:18:59.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1mgk4x6",
    "subreddit": "bartenders",
    "soc_codes": [
      "35-3011"
    ],
    "title": "Any bartenders in Vancouver Fairmont hotels?",
    "text": "I work in Montreal with the same group and I have the opportunity to get transferred to another hotel.\n\nI'm comparing the salaries and cost of life and wondering how much tips can I expect in high-end place in Vancouver?\n\nSeems like the base salary is a little under than in Montreal, but every appartment I look at is almost double. The move wouldn't make any sense unless there is a lot more tips to be made. \n\nCan anyone with experience in Fairmont hotels from there tell me approximately how much they were making per week? Thanks!\n\n",
    "score": 5,
    "url": "https://reddit.com/r/bartenders/comments/1mgk4x6/any_bartenders_in_vancouver_fairmont_hotels/",
    "created_at": "2025-08-03T14:06:56.000Z",
    "num_comments": 1
  }
]