[
  {
    "id": "reddit-1nnrju8",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Only ~7% of premed college freshmen get into medical school.",
    "text": "Many students think they will get into medical school. The reality is far from that.\n\nOver 15,000 premed students were analyzed between 100 different universities. Only 16.5% of those students completed all the prerequisite courses to apply for medical school.\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC7769285/\n\nBetween 35-45% of med school applicants are ACCEPTED.\n\nhttps://www.aamc.org/media/6091/download\n\nOut of those 15000 freshman premed students, only 990 will get accepted to medical school. 15000 x 0.165 x 0.4 =990\n\nIf you aren’t a top tier student, you should prepare to use your degree rather than expect to get into medical school.\n\nHow many biochemists do you know?\n",
    "score": 389,
    "url": "https://reddit.com/r/Biochemistry/comments/1nnrju8/only_7_of_premed_college_freshmen_get_into/",
    "created_at": "2025-09-22T16:40:46.000Z",
    "num_comments": 98
  },
  {
    "id": "reddit-1mny1jo",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Which of these textbooks is better?",
    "text": "I'm trying to declutter, but figured I should keep one of these for future reference.\n\nWhich one should I keep? Pros and cons of each book? Thanks.",
    "score": 335,
    "url": "https://reddit.com/r/Biochemistry/comments/1mny1jo/which_of_these_textbooks_is_better/",
    "created_at": "2025-08-12T03:30:49.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1koqfuc",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Bro I need help I can't understand aNADPH and it's been 2 hours",
    "text": "Jk it's only been an hour but I can't seem to find answers.\n\nNo one cares\n\nI know that ATP has an adenine, ribose and triphosphate yes yes, and that adenine has NH2 which is a amino and that triphosphate are connected with phosphoanhydride bonds and ribose with covalent bonds, OH is hydroxyl and Ch2O of triphosphate to Ribose is a methylene. \n\nI've done atp for two hours, I don't think it should matter much but come on I can't find an easy source specially now with nadph I hate it!\n\nPlease help label it nadph\n\nI can see the same ribose and adenine structure they are the same, and I see a phosphate bridge if that's even right? I consulted a bot and it said there's a 2 phosphate  group? Top one is nicotinamide. But what is the 2 phosphate ?\n\nWhy are there no labels!\n\nI'm at my wits end and I shouldn't even care!\n\nDeleting the post after answer 🙏\n\nI understand if this post is deleted, can't seem to find a place to ask.",
    "score": 248,
    "url": "https://reddit.com/r/Biochemistry/comments/1koqfuc/bro_i_need_help_i_cant_understand_anadph_and_its/",
    "created_at": "2025-05-17T11:09:14.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1ikdfzi",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Scared my degree is gonna become useless.",
    "text": "Hi all, I’m about to graduate my undergrad as a biochem major next fall. I’m in the US and given the current funding issues, I’m worried I won’t be able to get into a PhD program or find a job. Am I right to be worried?",
    "score": 187,
    "url": "https://reddit.com/r/Biochemistry/comments/1ikdfzi/scared_my_degree_is_gonna_become_useless/",
    "created_at": "2025-02-08T03:04:32.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1jpciik",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Update to my previous post",
    "text": "I forgot to update the community after y’all liked my original post from the first weeks of my biochem course. So here is the finished product of my manuscript through ETC.\n\nAlso, I’m about to graduate with my bachelors after 8 years (ik) and am feeling sentimental. I got dismissed after my first year, started a career, went to community college, worked my ass off, and am now graduating from an Ivy. This community is incredible and I am so grateful for all your help along the way.\n\nI’ve also included some pics of exam notecards from biochem as well as some of my favorite textbooks I’ve gathered along the journey. Lehninger being my favorite, of course. ",
    "score": 178,
    "url": "https://reddit.com/r/Biochemistry/comments/1jpciik/update_to_my_previous_post/",
    "created_at": "2025-04-02T01:20:07.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1jchjvj",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Feeling hopeless about my degree",
    "text": "Recently applied to 120+ jobs after pursuing a biochemistry degree from a ‘prestigious’ school and got auto denied from like 70 of them already. For context, I mostly applied to associate medical or pharma sales jobs. Or the occasional medical affairs or sales associate PRN jobs (all entry level). I have B2B sales experience and three other related job experiences. The jobs listed all said they just required a bachelor’s degree and sales experience was ‘preferred’, but I got promptly denied and didn’t even get an interview. \n\nI feel like I wasted the last 4 years killing myself in school while everyone else lived their lives and it was all for nothing. I don’t wanna do research or go to grad school. Just thought that being a biochem major would at least give me an edge in the job market and at least help me get an entry level sales job but nope. I’m only getting callbacks from insurance salesperson jobs that I could also get with zero work experience and no college degree. Does it get better? ",
    "score": 158,
    "url": "https://reddit.com/r/Biochemistry/comments/1jchjvj/feeling_hopeless_about_my_degree/",
    "created_at": "2025-03-16T09:12:43.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1hziwdl",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "About To Graduate And Don’t Remember 80% Of What I’ve Studied",
    "text": "I will be graduating with an B.S in Biochem (non pre-med, in US) this June and I’ve recently been losing sleep over the thought that I can’t recall a lot of the stuff that I was taught as prior to second semester of my junior year. I understand you learn a lot while working post undergrad but what is considered a good baseline for undergrads? To preface this, I played a division 1 sport my first two years of school (had to fight with the idea of actually learning and doing “well-enough in school to be academically eligible) then after I left the team I basically coasted to the end (just need at least a 75% in all of my classes). I should graduate with between a 3.0-3.1 GPA. I can do what I am told, learn on the fly, and have pretty good recall when I’m stressed enough 😂😂. But, I fear my lack of recall for some fundamental concepts I was taught early on could hurt me in the long run. I don’t really have any intentions on continuing in research or sticking around to do a masters or PhD but I still feel like I should have something to show for my time.",
    "score": 158,
    "url": "https://reddit.com/r/Biochemistry/comments/1hziwdl/about_to_graduate_and_dont_remember_80_of_what/",
    "created_at": "2025-01-12T09:10:16.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1kdnx7m",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Jobless after 2 years. I am losing hope.",
    "text": "I honestly don't know what I am doing wrong. I've applied to probably 100+ jobs in the past 2 years and can't seem to land a single one. I graduated in 2023 with a bachelor's in biochemistry. During my undergraduate years I worked with several labs and built a resume. Looking back, the labs I worked with didn't really require me to work with complex experimental techniques so I feel a bit untrained in some areas. Neither did I managed to publish a research paper. When I graduated, I moved back home to my parents in Florida. Because I believed I didn't have much skills, I applied to lower level jobs such as research assistant, research internships, and research associate 1 at nearby universities and companies. These jobs usually had posted \"no experience required\". I managed to get some interviews, 1-2 a month, but I am always ghosted or rejected afterwards. Usually when I am rejected, I email them and ask for feedback on my interview and resume, but they never respond so I have zero clue what I am doing wrong. My goal was to go to grad school, but I feel so unprepared and behind. I can't get into a good grad school if I don't have enough experience. I don't know what to do. If anyone has some advice, please let me know.",
    "score": 96,
    "url": "https://reddit.com/r/Biochemistry/comments/1kdnx7m/jobless_after_2_years_i_am_losing_hope/",
    "created_at": "2025-05-03T08:10:59.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1j47wqy",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Thoughts on the recent Veritasium video about AlphaFold?",
    "text": "I'm in the third year of my biochemistry bachelor's degree and I just saw this [Veritasium video](https://youtu.be/P_fHJIYENdI?si=2qKpYlrWdg5kBhiN) that came out three weeks ago about AlphaFold. It was hard not to feel incredibly hyped after watching this, but I know pop science channels can sometimes overhype recent discoveries, so I was wondering what people who actually work in the field think!",
    "score": 84,
    "url": "https://reddit.com/r/Biochemistry/comments/1j47wqy/thoughts_on_the_recent_veritasium_video_about/",
    "created_at": "2025-03-05T17:03:59.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1js679h",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Going back to school in Biochemistry as a mature student",
    "text": "I am currently 29, never finished college but am planning to go back for next year. Originally, I was in an art program and dropped out to pursue my own career. Now I am at a point where I want to go back and finish college but am restarting completely and decided on Biochemistry because it interested me the most. I had good grades in my chemistry and physics during high school and have self studied a lot on human anatomy as I work as a personal trainer as a side gig. I joined this subreddit to sort of brush up on concepts but I find a lot of the material goes over my head. I want to really get a head start before starting school because it has been so long since I did any science or math class. Does anyone have any suggestions? I thought of buying Lehninger’s principles of biochemistry but I wonder if that is even too advanced to begin with.  ",
    "score": 80,
    "url": "https://reddit.com/r/Biochemistry/comments/1js679h/going_back_to_school_in_biochemistry_as_a_mature/",
    "created_at": "2025-04-05T15:38:11.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1k3asap",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Is biochemistry only a \"foundational\" degree?",
    "text": "Hi!! I’ve never posted on Reddit before but I don’t have many resources in person and figured I’d reach out here. I’m graduating community college with an associate’s in applied science, and while I wanted to initially get into nursing I’m looking into other avenues (because realistically, I’m not sure I could take the emotional strain of that field).\n\nI applied and got accepted to various universities for biochemistry, but I’ve been told by a few people that I wouldn’t get very far with a bachelor’s degree and would need to pursue a graduate program if I wanted to find a well-paying job. Is this true? Regardless of the things I’ve asked prior, any stories about a career in the biochemistry field would be appreciated! I love biology and chemistry, but I’m not 100% sure what it entails. \n\nExtra info here, if it affects anything:\n\n-I’m a C-B+ student at best. I usually score above the average on exams but never set the curve. \n\n-I live in NJ and would prefer to stay in the east coast, but I know certain jobs tend to fester in specific states/areas.\n\n\nIf you’ve made it this far, thank you for reading my blurb! I appreciate it a lot. \n\nEdit: THANK YOU ALL VERY MUCH!! I appreciate you all sharing your experiences and giving me some good advice. You’re all very nice thank you so very much :)))",
    "score": 70,
    "url": "https://reddit.com/r/Biochemistry/comments/1k3asap/is_biochemistry_only_a_foundational_degree/",
    "created_at": "2025-04-20T00:49:15.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1pbk89j",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "I might be f*cked.",
    "text": "I am a senior in high school. I've already been accepted into college majoring in biochemistry as a prerequisite for medical school. \n\nI chose this major out of no deep thought. I know chemistry is important, and biology is important, so biochemistry sounded good. But the fact is I am not smart. Once people find out I was accepted and what major I'm doing, their reaction is typically \"Wow, you must be smart!\" When I tell them biochemistry. But I literally have no idea what I am doing. I have coasted my entire high school journey. I have never studied. I have never sat down and put serious effort into my work. I still managed to slide by with As and Bs, and scored a 4 on the AP bio exam, but I literally know nothing. I never took chemistry (despite my efforts) and I know close to nothing about it. I don't know how many particles are in a mole. I don't know how to equalize a reaction. I don't even know many of the elements in the periodic table. I didn't even put thought into my future career path either. I literally sat in my car sophmore year, realized I need to choose something, and chose being a surgeon, because why not. Now I am an adult now, and my decisions are coming to encompass my life. I am so scattered and I am almost certain that I will utterly fail at studying this major because everything I have done in high school was done with a \"get it done with good enough\" attitude and by some miracle slipped by in what others perceive as academic excellence. \n\n  \nI need advice bad. I don't even know how you do research, or like what you do to get started or involved at all. I still don't know how the krebs cycle works. I am a poser and need to know what I need to do right now to lock in for next august before I fuck everything up. How to study, what to study. Please help",
    "score": 69,
    "url": "https://reddit.com/r/Biochemistry/comments/1pbk89j/i_might_be_fcked/",
    "created_at": "2025-12-01T18:15:15.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1mbjduy",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Wanting to learn for my wife",
    "text": "Hey everyone, my wife is a biochemist and I am really wanting to learn more about biochemistry to have deeper discussions about her work. I loved science, but wasn't my path when college came around. I will be starting to learn through Kahn Academy, but I was hoping people in this sub would help me out by linking videos, courses, anything that might supplement or even be a better alternative to Kahn Academy.\n\nEdit: thank you for for all the feedback! I'm already getting some great information that has given me plenty of questions to ask. I really appreciate the specific topics to look up and the emphasis on reading scientific papers/reviews. As I'm sure you all knew, its going to be a long process and I'm really glad to start the process of diving in deep into her world.",
    "score": 65,
    "url": "https://reddit.com/r/Biochemistry/comments/1mbjduy/wanting_to_learn_for_my_wife/",
    "created_at": "2025-07-28T15:32:57.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1jf4iho",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Kind of lost on what I want to do with biochemistry degree.",
    "text": "I'm in my 3rd year of my BS in biochemistry and I feel like I'm barely just starting to learn how vast biochemistry and related fields are. I don't have any lab experience yet (I'm trying tho), but I'm kind of getting the feeling like \"biochemistry\" isn't really something you can apply to get a job or create anything. Like I feel like \"biochemistry\" is less skills and mostly academia research of a bunch of phd dudes researching some super specific mechanism of a some random enzyme and they spend their whole life doing this and idk if I'm into that (correct me if im wrong). I'm more interested in having biochemistry knowledge and applying it to something and the two general areas I'm looking at are bioinformatics/coding and pharmaceutical like drug development (not clinical pharmacy). However, i haven't taken any pharmacology classes and I know nothing about coding or machine learning I'm barely just learning python on my own but it looks really cool. \n\nIs there anyone with experience in either of these fields that can tell me more? I've been reading and I feel like literal dunning krueger like I don't really know enough to be really interested without taking additional undergrad classes and dedicating myself to a career path.",
    "score": 64,
    "url": "https://reddit.com/r/Biochemistry/comments/1jf4iho/kind_of_lost_on_what_i_want_to_do_with/",
    "created_at": "2025-03-19T18:50:36.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1m2a00a",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Will a career in biochem or biotech make decent money?",
    "text": "Always loved life sciences but from what I've seen things like pure biology and such won't really make good money specially with just a bachelor. Will biochem or biotech make decent money? For reference I live in San Diego and thinking of using my GI Bill when I leave the military. \nWhat options should I look into? ",
    "score": 50,
    "url": "https://reddit.com/r/Biochemistry/comments/1m2a00a/will_a_career_in_biochem_or_biotech_make_decent/",
    "created_at": "2025-07-17T15:06:25.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1mbwbpq",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "What do I do with my degree?",
    "text": "I recently graduated in 2024 with a BS in biochemistry with minors in pre-med, math, and biology and about 6 months of research experience. Out of college I got a job working at a restoration company because I had an easy in there and at the time it seemed like a quick, easy way to join the salaried work force. \n\nHowever, I hate my job and can’t stand to be here much longer. I desperately want to use my degree for something in the field. The job market I’m in (central Texas) isn’t fantastic as far as I can tell. I’m making ~$60k now and can afford to take some kind of pay cut if it meant being in the field I want to be in.\n\nI’m not sure if I should continue looking for the opportunities that may or may not be out there, or if I should switch focus and try to work towards a master’s degree, or even some other third thing. I just feel like I did all this work to get my BS and I’m not even using it. Please let me know if you have any thoughts or advice 🙏",
    "score": 41,
    "url": "https://reddit.com/r/Biochemistry/comments/1mbwbpq/what_do_i_do_with_my_degree/",
    "created_at": "2025-07-28T23:49:02.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1m6aw5h",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "AMA- Doctor of Biochemistry at Russell Group University",
    "text": "Hi guys.\n\nLet me introduce myself, I am a doctor of biochemistry at a Russell group university and I have published many papers in high ranking journals including nature, and have taught biochemistry for a number of years. I am an expert in this field, although like everyone still learning :)\n\nI love this sub and everyday I see questions about science, about career advice/help applying,  the future of science. All sorts...\n\nAnd today is my day off. So im trying to give back to the public. \n\nBut yeah my aim is to answer every single question I get on here so ask away. \n\nIf you want to see me talk more about science just search justjoe97 on tiktok.\n\n",
    "score": 41,
    "url": "https://reddit.com/r/Biochemistry/comments/1m6aw5h/ama_doctor_of_biochemistry_at_russell_group/",
    "created_at": "2025-07-22T10:52:11.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1j1gxe7",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "What do you do for a living?",
    "text": "I’m currently studying biochem in undergrad. I’d like to go into research but tbh, I’m not all too familiar with all the careers for this field. \n\nWhat are some jobs you’ve had with a biochem degree? What is a day in the life look like? I’m so curious about people who are in the field rn and what they do. ",
    "score": 38,
    "url": "https://reddit.com/r/Biochemistry/comments/1j1gxe7/what_do_you_do_for_a_living/",
    "created_at": "2025-03-02T02:53:18.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1k4ukin",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Graduating next year. Honours in biochemistry.",
    "text": "Hello Biochemistry Community,\nI’m seeking advice as I approach a career crossroads. I’m 28 and graduating next year with my bachelor’s degree. I’m considering whether to pursue a master’s degree in biochemistry or transition directly into industry. I feel a bit behind in building an academic career due to my age, so I’m leaning toward industry roles for now.\nI currently work in a research lab, and by the end of next year, I expect to have two publications ready. Will these publications provide strong leverage for securing a well-paying industry position, or does a master’s degree play a more significant role in this context? Any insights on the value of publications versus a graduate degree for industry jobs would be greatly appreciated!",
    "score": 27,
    "url": "https://reddit.com/r/Biochemistry/comments/1k4ukin/graduating_next_year_honours_in_biochemistry/",
    "created_at": "2025-04-22T01:37:52.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1li9gxo",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "My dream is to be a Biochemist— but I’m horrible at Math. Should I give up?",
    "text": "Hi, my name is Kris and in January 2025– I dropped out of my senior year of High School. I have many severe cognitive disabilities, which have prohibit me from being able to function in large crowds and cause my brain to mess up with numbers. I can ace all of my subjects— EXPECT Math. I was a straight A student until Middle School when my mental health tolled, and grades dropped. Math got harder and I couldn’t even read what’s on the paper. The highest amount of math I can understand is Algebra, MAYBE Geometry but that’s pushing it. I love science and Biochemistry— and it’s a dream of mine to do research on projects to discover new facts about history, the earth, animals and the human body. I love learning about genetic mutation and I’m great at connecting dots and problem solving— but to even get a job in the convent field, you have to have some type of college degree. I’m currently in the works of getting my GED, and I plan on community college after that. My community college offers an associates degree in Science— but heavy math (calculus) is involved and I know I’m gonna fail, BAD. Should I give up and find a realistic job, or keep pushing and try even harder?",
    "score": 26,
    "url": "https://reddit.com/r/Biochemistry/comments/1li9gxo/my_dream_is_to_be_a_biochemist_but_im_horrible_at/",
    "created_at": "2025-06-23T06:28:09.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1nkc7n5",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Struggling at my lab job",
    "text": "I’m fresh out of college, and four months into my new job. For context, it’s in R&amp;D. I can do some experiments independently but I’m struggling so badly, I make silly mistakes, mess up my gels, I’m stressed all the time and as a consequence of that extremely disorganised (i.e forgot where to put my pipettes, racks, pool the wrong fractions together, make a mess on the bench, forget to label stuff). I know that four months is not super long, but it’s long enough to become confident . At this stage I start to wonder whether this will ever pass or it just means that a lab job is not for me and I’m not capable of doing it? I keep comparing myself to other people who are also early in their careers (1-3yrs) and the difference is insane I feel like a total loser comparing to them. \n\nThose who currently work in a lab - will it pass? Are those just “growing pains” of being new and gaining independence or a red flag? Any tips how to cope with the stress? \nThanks.",
    "score": 25,
    "url": "https://reddit.com/r/Biochemistry/comments/1nkc7n5/struggling_at_my_lab_job/",
    "created_at": "2025-09-18T15:59:07.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1n6m7ka",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "What eats up most of your time as a PhD/postdoc/PI/or beyond (that no one warned you about)?",
    "text": "Hi everyone,\n\nI’m in the final year of my Master’s in the UK, and while I’ve had the chance to work in a few different labs, I still feel like I don’t really grasp the day-to-day realities of a long-term academic career.\n\nI’m curious about the kind of “hidden” tasks that don’t get talked about much but actually take up most of your time. What parts of the job end up being the most draining or the least enjoyable? And do you think some of those struggles are unique to your field?\n\nAlso, with AI becoming more common in research, I wonder how people really feel about it. Not in the “write my paper” sense, but more as a research assistant for very specific tasks. Do you use it like that? Or do you avoid it? What are your biggest concerns around it?\n\nI’d honestly love to hear anything you’re willing to share - especially the stuff you never hear anyone else talk about but that shapes your everyday experience.\n\nThanks so much! 🙏",
    "score": 23,
    "url": "https://reddit.com/r/Biochemistry/comments/1n6m7ka/what_eats_up_most_of_your_time_as_a/",
    "created_at": "2025-09-02T15:13:49.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1k3ewse",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "what path to take after graduating? is my life over??? help????",
    "text": "hi. im in my first year of college and really stressing out because im not sure what path I want to take with this degree. I really enjoy lab work so I always saw myself working in a lab, but I also want a job with a stable income that keeps me fairly comfortable. i know it sounds stupid and materialistic but it's very important to me that i make enough money to support myself. anyways, im not sure what i want beyond that vague job description, could anyone help me find more specific jobs in that ballpark? i'm also really stressing out because i might get a C+ in gen bio 1. again, i know, very stupid, but it really feels like my life is over. i also got another C+ in another class last semester as well (i'm an idiot) so my gpa would go from a 3.7 to a 3.4 with that C+ in bio. and it's just really disheartening to me. i know it's still early in my college career and i'll be able to bring it up, but would grad schools care about those C+s? ",
    "score": 22,
    "url": "https://reddit.com/r/Biochemistry/comments/1k3ewse/what_path_to_take_after_graduating_is_my_life/",
    "created_at": "2025-04-20T04:53:06.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1n8t5ha",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Planning to take a gap year between my undergrad and grad school. Am I making a mistake",
    "text": "I’m on track to graduate with my bachelors in biochemistry this spring, but I’ve struggled a bit over the years as so I probably wouldn’t get accepted into my uni’s grad program next year if I dove straight into it (2.8 GPA). I figured my only option was to seek some volunteer, internship or entry level work in a research lab to gain experience over the course of the next year before applying again. I am also planning to meet with my career advisor tomorrow, but I also wanted to ask if you all had any life experience/insight into this kind of stuff. Thank you for your time as always 🙇‍♂️",
    "score": 20,
    "url": "https://reddit.com/r/Biochemistry/comments/1n8t5ha/planning_to_take_a_gap_year_between_my_undergrad/",
    "created_at": "2025-09-05T02:13:44.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1jwgin3",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Is a CLS degree a viable career choice after getting a biochemistry BS?",
    "text": "Hi all! I chose a biochemistry major when in high school, since I figured that nutrition had interested me enough as a teen and that I would find something in my 4 years of college that gripped me enough to continue doing research on it and possibly go for a MS and such.\n\nWell, that did not happen, and now I'm about to graduate with a degree that honestly doesn't interest me too much. I tried applying for internships as an undergrad, but all of them either fell through or I genuinely wasn't motivated enough to go through with them. And as a result, I'm stuck trying to apply for jobs without proper experience and with a degree that is normally continued into grad school, which I just have no interest or desire for right now.\n\nMy mother has been suggesting getting a CLS degree and getting certified(NY resident), since that would give me the proper qualifications and exposure to get a decent job. The thing is, it's a big commitment, both financially and educationally, and even then, I'm not even guaranteed a job with it in this market. Nonetheless, would this be the best option for someone who simply just wants to put what they learned in undergraduate to good use, without going into research/graduate school? Thank you in advance!",
    "score": 19,
    "url": "https://reddit.com/r/Biochemistry/comments/1jwgin3/is_a_cls_degree_a_viable_career_choice_after/",
    "created_at": "2025-04-11T03:29:18.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1mo969j",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Can a Biochemist work as an quality control in pharmaceutical industry?",
    "text": "I have recently completed my Bachelors in Biochemistry and currently looking to apply for internships to gain some experience i have seen many internships and jobs advertisements with eligibility as \"Bachelors in chemistry\" to work in quality control and aassurance. Am i as a biochemist eligible for these jobs? ",
    "score": 19,
    "url": "https://reddit.com/r/Biochemistry/comments/1mo969j/can_a_biochemist_work_as_an_quality_control_in/",
    "created_at": "2025-08-12T13:45:48.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1oyd34e",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Is a BA in biochemistry unless?",
    "text": "I’m currently a sophomore in college pursuing a degree in biochemistry. I recently found out, though, that my college only gives BAs not BSs. I know this was probably a dumb oversight on my part, but I legitimately thought I was getting a BS (I guess I just assumed that a science major = a bachelor of science). I don’t have anyone in my family in the STEM field so I have no idea how important this is career wise. Can I be employable in the medical &amp; research field with a BA instead of a BS? How much does this put me at a disadvantage? Should I transfer to an institution I can get a BS at? ",
    "score": 18,
    "url": "https://reddit.com/r/Biochemistry/comments/1oyd34e/is_a_ba_in_biochemistry_unless/",
    "created_at": "2025-11-16T05:06:08.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1lpak7v",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Share your post biochemistry bachelors experiences with me!",
    "text": "I am a senior in college and my major is biochemistry. I love science and picked biochemistry with the idea it could open more doors for me then just biology if I decided to just do my bachelors (I was originally nursing and hated it). I was a lot more biology forward though. I live on my own and haven’t considered an internship before, but now feel like I need one or I won’t find a job post graduation. I have done teacher and lab assisting for bio 1 and 2 lecture and labs at my school. I have been looking through my school resources and such and nothing seems to be in my area. Another point actually have found more interest in my chemistry courses last year and took a organic research methods course because I loved the spectroscopy we did in ochem lab and I have a analytical chemistry class as well, so I’m hoping to see if I really like it. I would love to further my education with a masters in chemistry and concentration in analytical chemistry, but I’m not sure about the cost of graduate school. I haven’t taken any loans out so far for my undergraduate. I plan on bringing this all to my career center and advisor, but I do like to hear real world experiences. If you have a bachelors in biochemistry, how long did it take you to find a job and what do you do now? If you went masters or PhD how did the financial/aid work for you? Things like that, I would love to hear what it was like for you after graduation! Thank you in advance for sharing! ",
    "score": 17,
    "url": "https://reddit.com/r/Biochemistry/comments/1lpak7v/share_your_post_biochemistry_bachelors/",
    "created_at": "2025-07-01T19:12:44.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1n2hdh5",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Biochemistry vs Biological Chemistry",
    "text": "I'm interested in becoming a biochemist or having some type of job relating with biochemistry. Can you still become a biochemist with a Biological Chemistry degree, or just doing a biochemistry degree good enough?",
    "score": 16,
    "url": "https://reddit.com/r/Biochemistry/comments/1n2hdh5/biochemistry_vs_biological_chemistry/",
    "created_at": "2025-08-28T16:43:21.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1ihyp6m",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Career opportunities for someone that doesn’t perform well in the lab",
    "text": "Hello! I have a bachelors degree in a degree titled BCMB (Biochemistry Cell and Molecular Biology). I was lucky enough to land a position in a laboratory setting after graduation (I started the Monday after graduation). Unfortunately I have been underperforming in the laboratory and my boss has been eluding to the fact that I may be terminated if things don’t turn around. I have been giving 110% effort to produce the results expected of me but the precision required for this position is out of my scope. I continuously come up short, specifically in genotyping with PCR and gel electrophoresis. I was hoping to see if anyone has experienced this and made a career in other areas of this field or if anyone had any advise for me. Your feedback would be much appreciated. Thank you!",
    "score": 15,
    "url": "https://reddit.com/r/Biochemistry/comments/1ihyp6m/career_opportunities_for_someone_that_doesnt/",
    "created_at": "2025-02-05T01:42:10.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1jszjuf",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "What can I do with a biochemistry bachelor's degree?",
    "text": "Hello! I'm graduating this spring with a bachelor's degree in biochemistry from University of Houston. I was going to apply to dental schools but now I'm reconsidering my career goals. During my undergrad I did work in a research lab at UT school of dentistry in the biomedical sciences and craniofacial diseases department, I liked it so much that made me now consider a research career. \nSo my question is what kind of master or PhD I can do after my biochem bachelor that would level up my education. I was thinking about bioinformatics sciences. \n\nI want something that uses software, statistics, and algorithms to study biological data, especially genetics, genomics, and protein biology. Analyze DNA, RNA, or protein sequences. Study gene expression (e.g., from RNA-seq data). Build models of biological pathways or molecular interactions. That's the field that interest me the most but I'm not sure if that's what they do or they other things. There are just a lot of broad things in the biochemistry/biology field and I'm unsure about the paths.\n\nAlso, what kind of jobs that I can work in right after I graduate with a bachelor's degree that is related to Bioinformatics? Is it worth? \n\nI don't want something like a research assistant or lab technician where they only follow protocols and that's it. Plus they don't make money a lot, I would make the same thing when I was working full time as a dental assistant and that's without a bachelor's degree. I want something that I could grow in in the science field and research (I'm dreaming big lol😅)\n\nI'd appreciate it if you could share your thoughts about it or if you have experience in the field!\n\n\nThank you!!",
    "score": 15,
    "url": "https://reddit.com/r/Biochemistry/comments/1jszjuf/what_can_i_do_with_a_biochemistry_bachelors_degree/",
    "created_at": "2025-04-06T17:32:11.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1m7laqi",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "I need advice as an undergrad biochem major. Times are tough.",
    "text": "The title says pretty much everything as I'm in a rough spot regarding my progress in my major. I'm a rising sophomore and I've taken a pre-requisite biology course at my university twice already and I just found out that I, once again, failed the course. There's always the option to retake the course at a CC or something, but I'm still at a loss. My first time taking the course, I struggled with my mental health quite a bit which I felt severely affected my performance in the course so, during this summer, I invested all of my time and energy into ensuring I'd pass. Office hours, late nights of textbook reading, and every flashcard in the book to assist me and I've still let myself down. Moreover, my GPA's taken a huge hit and I feel like this is rock bottom. Is there any hope for me at this point? Has anyone had a similar experience to mine and still found success in their career? Any input or advice would be really appreciated right now. Thanks in advance.",
    "score": 15,
    "url": "https://reddit.com/r/Biochemistry/comments/1m7laqi/i_need_advice_as_an_undergrad_biochem_major_times/",
    "created_at": "2025-07-23T21:08:27.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1n1ht6e",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Is there hope for me?",
    "text": "Hi! This is my first time posting to Reddit so bear with me if I sound awkward or incoherent in this post.\n\nI’m currently 21 years old attending university, this upcoming semester I’m doing a temporary leave of absence due to some mental health issues. I’m a biochemistry major and I’m supposed to be in my senior year but credit wise I’m a sophomore. To make a long story short my college career has been a roller coaster. Sure there have been semesters where I’ve done good but also semesters where it got so bad to the point of me to withdraw from my classes from that semester so it doesn’t go on my gpa. Speaking of gpa, my current gpa now is a 2.1 \n\nThe reason I’m posting on the engineering Reddit is because I want to switch over to chemical engineering. I’ve always been into chemistry and I’ve heard engineering, for the most part, is a guaranteed job right after college.\n\nSo what I’m asking in this post is, given my academic history I’ve shared with you guys above, should I go into Chemical engineering? \nI know it’s something I have to do more research on career wise but I’m just afraid of going for another thing I’m interested in, started off strong, and just burning out. The same thing happened with biochemistry too.\n\nIf anyone can share some wisdom/advice I’d more than appreciate that. ",
    "score": 14,
    "url": "https://reddit.com/r/Biochemistry/comments/1n1ht6e/is_there_hope_for_me/",
    "created_at": "2025-08-27T13:58:33.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1mx2yni",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Which major has a bright future, applied chemistry, biotechnology, analytical science, regulatory science, or biochemistry?",
    "text": "Hello, I'm a high school girl currently living in Korea. I'm interested in bio, analytical science, and biochemistry, so I'm going to make career plans for that field. But the best department I can go to varies from major to major. Which field is the most promising and good one to go to, such as bio, life science, applied chemistry, analytical chemistry, and regulatory science? If you majored or are in the field, I'd appreciate it if you could give me some advice.",
    "score": 13,
    "url": "https://reddit.com/r/Biochemistry/comments/1mx2yni/which_major_has_a_bright_future_applied_chemistry/",
    "created_at": "2025-08-22T10:37:21.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1jpn0n3",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Is a Master's in Biochemistry and Biomedicine Worth It? Opinions, Experiences, and Career Perspectives?",
    "text": "Hello everyone!\n\nI'm seriously considering pursuing a master's degree in Biochemistry and Biomedicine, and I would love to hear your opinions and experiences, especially regarding career prospects after the program. I have a few questions:\n\nIs it worth it? In your opinion, is this master's degree \"worth it\" in terms of career progression and future opportunities?\n\nWhat do you do exactly? For those with a similar background, what do you do in your daily work? What are your main tasks?\n\nWhere do you work? In which types of places/sectors do people usually work (e.g., academic research, pharmaceutical/biotech industry, clinical/hospital laboratories, etc.)?\n\nDoes the job involve more hands-on lab work or more data analysis? Or is it usually a mix of both?\n\nDo you have any specific recommendations for European countries with good job opportunities or a strong market in this field?\n\nI'm asking these questions because I'm currently finishing my degree and doing an internship. And it's been awful because I've been here for two months and have only actually done something for about five days. And what I did wasn’t even anything significant—it was mostly standing around for two hours, recording pressure and temperature every minute. And the rest of the people here also don’t seem to do much, so I just spend my time in the office reading articles and writing… I wanted to learn things from this internship, but I guess I’m out of luck.",
    "score": 13,
    "url": "https://reddit.com/r/Biochemistry/comments/1jpn0n3/is_a_masters_in_biochemistry_and_biomedicine/",
    "created_at": "2025-04-02T12:11:19.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1k5o17t",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Thinking of exiting Biochemistry",
    "text": "I thought I loved STEM and Biochemistry. I really chose my degree based off of interests and strengths as advised. Now I strongly just want a job that will pay me and would be prefer a job in the creative industry (maybe I watch way too many films these days). I honestly feel like I am losing my mind but have to make the 'brain not your heart' decision and keep grinding. I think I may take look at optometry. My whole shtick in science was the love for learning more and the reward of learning challenging concepts (ahem feeling smart). \n\nYear 1: Everything was great, I cracked at everything enthusiastically. \n\nYear 2: It was okay but I began suffering a mental health crisis and became very disinterested in my studies as a result. At least I had an idea of what I wanted to do. \n\nYear 3: I no longer have interest in anything and struggle to connect with the idea of working in STEM because we barely ever did practical work. I am all about putting my knowledge to a real world concept!\n\nWhile my institution is great at teaching, I feel like they betrayed my interest a bit by having very little lab contact time. We really do the bare minimum one can get for shilling out so much money for a degree.  If you complained, then it was carefully outlined how the bare minimum was being executed for your benefit. Another complaint and it would be just find an internship. In this job market and economy? I really yearned for the ~~mines~~ laboratory but lost interest due to this. I took great interest in bioinformatics but did a module this year and thought, yeah that's definitely not for me either. Perhaps computational biology? Plant biology? No clue, but I know that Biochem and Molecular Biology may not be for me. I just want to be a whimsical fairytale princess at this point. \n\nHas anybody ever gone through this? Any advice? I fear that this may be a phase and if I make a rushed decision I may end up hurting my career. ",
    "score": 12,
    "url": "https://reddit.com/r/Biochemistry/comments/1k5o17t/thinking_of_exiting_biochemistry/",
    "created_at": "2025-04-23T02:09:34.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1i0i7eb",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Biochem PhD To Sales",
    "text": "Hello, I am currently 4 years into my PhD and I am looking to progress my career development forward by looking into internship opportunities. I would like to go into industry work and have been particularly interested in the idea of going into Sales. I wanted to see if there is any advice people have for me online as somebody who is just starting out, I have a lot of research experience but just now trying to acquire some industry experience. Additionally if you have had a similar career path I would love to know your thoughts about the job as well.",
    "score": 12,
    "url": "https://reddit.com/r/Biochemistry/comments/1i0i7eb/biochem_phd_to_sales/",
    "created_at": "2025-01-13T16:43:21.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1m4imlx",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Master's or Bachelor's?",
    "text": "Hi everyone. I've finished some time ago the university of medicine (I'm a certified MD; also I live in europe) and am looking to either apply for a master's program in biochemistry and molecular biology or to get a bachelor's degree in biochemistry.  I'm somewhat uncertain which path to pursue at the moment since to work in a lab as a biologist you need to be certified in either biochemistry or biology and the master's degree won't bring me that. I'm unsure what career path I can pursue with only a master's but to graduate biochemistry would be somewhat of a step-back for me and it's also more time consuming (master's takes 2 years, graduating in biochem takes 3). Any advice you can give is welcome!\n\nPS: Most of you would probably ask why not work as a MD, but my goal in life isn't just having a good salary. I feel like i've stagnated atm and I'm mostly interested in biotech/microbiology/genetic/biomedical research.\n\nEdit: The way I've written it it seems like I know what I'm talking about, but I have fuzzy ideas about what you can do being a certified biologist/biochemist vs not.\n\nPlease help! :D",
    "score": 10,
    "url": "https://reddit.com/r/Biochemistry/comments/1m4imlx/masters_or_bachelors/",
    "created_at": "2025-07-20T07:09:30.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1knex3f",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Will a biochemistry degree keep my options open as I figure out what specific career I want?",
    "text": "\nI’m [18F, UK] am going to do a 3 year course in biochemistry at Bristol university hopefully this year once I finish my A Levels maths chem and biology. I’m aiming for As. \n\nHowever I’m not too sure what I want to do after this and I’m the first in my family to go to uni so I’m unsure what options will be available to me once I commit to the course. I’m unsure how masters degrees work (infact I’ve applied for one but I’m going to change it to a bachelor’s once I get there), unsure how people do a degree in one thing then end up with a qualification in something else. \n\nI like biochemistry but something I’ve found out I’m interested in is child development. I’ve always loved working with children but never wanted to be a teacher due to the pay compared to the work required. (I’m from a low income family so a good salary is somewhat important to me). Once I have an undergraduate degree in biochem, would it be possible to do a masters in something like child neuroscience, or psychology? Forensics also interests me so maybe that would be a route to go down. The reason I won’t go for it now is because I’m scared to specialize so early incase I find something else I enjoy. I was looking into speech + play therapy but I’m not sure if I want to commit to the therapy route. \n\nI suppose what I am asking is how flexible a biochemistry degree is once you have it and where it can lead. \n\nThank you so much for anyone who can help give advice :)\n ",
    "score": 7,
    "url": "https://reddit.com/r/Biochemistry/comments/1knex3f/will_a_biochemistry_degree_keep_my_options_open/",
    "created_at": "2025-05-15T18:02:31.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1kf6zxg",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Need advice If I am to inexperienced for this job offer. Not sure if the benefits are matching the responsibility required either.",
    "text": "I recently recieved my first job offer for graduating with my B.S of Biochemistry from a small oil company (US Based) as a chemist. They only have 1 other chemist on staff who is leaving in less than a week.\n\nThey gave me a job offer of $60,000 / year and are giving me my own pretty nice sized lab and will send me to get trained in oil chemistry. (For comparison on salary in my state the avg salary is ~$49,000) They are offering me a 4% match on the 401K for a 5% investment. There is health and vision insurance. They also offer quarterly bonuses based on profit share &amp; performance.\n\nFor duties I would be responsible for making sure all the oil the company is producing is meeting federal/state standards and would be responsible for testing of it. I would be the only one in the lab and thus managing it as well as running all the testing in it. I would also be responsible for designing new oils (think like gear, hydraulic oils etc) for customers.  I would also ocassionally oversee the people manufacturing the oil I design to make sure it is made correctly. I would be the one also doing the documentation on all testing and products and will be responsible for managing laboratory supplies.\n\nIs this a good offer for a recent grad? While I feel the benefits are great I also feel like I am super under-experienced for this role. While I am confident in my general laboratory skills I have no experience in managing a lab or in preforming oil design. I do have some of the testing experience and what I don’t have seems decently easy to learn for the tests they preform such as flash-point or aniline tests. I have the official job offer and they do not plan on hiring another chemist so it will be just me for sole responsibility of the lab and product testing.",
    "score": 6,
    "url": "https://reddit.com/r/Biochemistry/comments/1kf6zxg/need_advice_if_i_am_to_inexperienced_for_this_job/",
    "created_at": "2025-05-05T09:01:56.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1ka9083",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Looking for a job to go after PhD in Biochemistry and Cell Biology (Structural Biology)",
    "text": "I’m currently exploring my options within the field I did my PhD in. Of course, I am working as a RA at the moment. \nWhat fields are you working in, and what kind of salary ranges are typical? What steps did you take to get into your current area?\nAlso, how do you find the work itself — day-to-day?\nI’m considering moving into academia the most but open to industry jobs as well, but I’m worried that the current competition for jobs makes it so hard for me to find one! Any advice would be highly appreciated! \nThanks 😊 ",
    "score": 5,
    "url": "https://reddit.com/r/Biochemistry/comments/1ka9083/looking_for_a_job_to_go_after_phd_in_biochemistry/",
    "created_at": "2025-04-28T22:51:20.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1naxpfl",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Bioengineering or Biochem (and biotechnology)?",
    "text": "I’m starting university this year, and I can’t decide between these two options. Honestly, I just want to choose the one with better statistics, like work–life balance, salary, job market, and so on.\n\n(I live in Europe, Belguim if that makes a difference)",
    "score": 5,
    "url": "https://reddit.com/r/Biochemistry/comments/1naxpfl/bioengineering_or_biochem_and_biotechnology/",
    "created_at": "2025-09-07T16:28:48.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1hskelb",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "What tablet are you using?",
    "text": "Hi! I'm a biochem student needing some advice and thought I'd ask here. I really need a tablet for note taking and reading and I'd like to know what people are using. \n\nRight now, the remarkable paper pro is the best one I could find by far, but it's insanely expensive (it's the median monthly salary where I'm from and I'm a broke college student living off of rice and beans). I want something that feels like paper because I'm the type of person who needs to write on paper or I won't focus on anything I'm writing, and, as any biology/biochem student knows, I need it to have a good color display for drawing, books, and pictures. I am also constantly using like 10-15 different tools for citing, finding articles easier, etc etc so I'd like something that's compatible with such tools or has alternatives. I would also like it to be pretty light because my backpack has been giving me some back pain recently, but it's not that important. \n\nI should also probably specify that I don't have a set budget and for now I'm studying the market to see what options I have.\n\nSo if anyone has any suggestions I'm open to hearing them.",
    "score": 5,
    "url": "https://reddit.com/r/Biochemistry/comments/1hskelb/what_tablet_are_you_using/",
    "created_at": "2025-01-03T11:25:56.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1nxekh1",
    "subreddit": "Biochemistry",
    "soc_codes": [
      "19-1021"
    ],
    "title": "Uni Major Advice: Corporate Pharma",
    "text": "Hi! I’m currently a sophomore university student majoring in biochemistry and minoring in finance. I’m looking for some advice as someone trying to join corporate pharma post-grad.\n\nWhat are your thoughts on my major and minor combination? Does anyone have any experience or takes? Ideally, I’m looking to work outside of R&amp;D/lab-based environments and more into roles like clinical data management, business analytics, etc. for fortune-500 pharmaceuticals and other biotech/skincare/beauty companies. Long term, is this achievable? How is the job outlook and salary for those in the field?\n\nI’d really appreciate any insight or thoughts :)",
    "score": 5,
    "url": "https://reddit.com/r/Biochemistry/comments/1nxekh1/uni_major_advice_corporate_pharma/",
    "created_at": "2025-10-03T23:28:39.000Z",
    "num_comments": 0
  }
]