[
  {
    "id": "reddit-1mkh6jp",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Is the job market really that bad?",
    "text": "I’m a freshman majoring in bioengineering at UH Manoa. While the salary for an entry-level biological engineer looks promising, I keep seeing people on here talking about not being able to find a job. Is this just in the USA? I’m willing to move to Germany after graduation. Do you need internships to break into the industry? Am I going to be stuck working retail for the rest of my life? ",
    "score": 33,
    "url": "https://reddit.com/r/bioengineering/comments/1mkh6jp/is_the_job_market_really_that_bad/",
    "created_at": "2025-08-08T00:44:14.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1ml6ixi",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Current bioengineers, what’s something you’re kicking yourself for doing (or not doing) in college?",
    "text": "I’m a freshman majoring in bioengineering. I was top of my class in high school and definitely not a partier, so slacking off isn’t something I see myself doing (but you never know). Anyways, so I can learn from you, what’s something you regret that might have impacted your career? What actions helped you? What kind of things make you stand out to employers and internships? ",
    "score": 29,
    "url": "https://reddit.com/r/bioengineering/comments/1ml6ixi/current_bioengineers_whats_something_youre/",
    "created_at": "2025-08-08T20:44:24.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1hpzo8f",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Medschool as a Biomedical Engineering student",
    "text": "Hello, I am a Biomedical engineering junior passionate about being in the medical field, either as an R&amp;D engineer or a doctor. I have been focusing on the engineering side of it until now, with research experience and internship applications, however the competitiveness and layoffs within the medical industry have given me some doubt. \nI specifically chose this degree so I could do either, and I could choose to orient myself towards medschool now. I initially put doctor lower due to the increased time to get a living wage and the desire to be independent from my parents earlier, but I am also very good at school and believe I could succeed in medschool. If there is any advice anyone would be able to give, I would love to hear it. For reference again I am halfway through junior year and have a 3.72 gpa, with some relevant research experience but no internships, shadowing, or significant medical volunteering.",
    "score": 28,
    "url": "https://reddit.com/r/bioengineering/comments/1hpzo8f/medschool_as_a_biomedical_engineering_student/",
    "created_at": "2024-12-30T22:40:50.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1mhq0nq",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Doctors of Reddit: If a Biomedical Engineering Student Could Build You Anything to Make Your Job Easier — What Would You Ask For?",
    "text": "I'm a biomedical engineering student heading into my final year, and I’ve got one shot to build something that actually matters.\n\nNot just another academic project. Not just an app or a sensor for the sake of it.\nI want to design something that makes your life easier — whether you’re in the ER, the OR, the clinic, or on call at 3am wondering why the tools you're using still feel like they were made in 1995.\n\nSo I’m asking you — doctors, surgeons, nurses, EMTs, techs — what do you need?\n\nWhat's the task you silently hate but have no choice but to do?\n\nWhere does time slip through the cracks?\n\nWhat’s the tiny inefficiency that builds up over time into major burnout?\n\nWhat do you wish someone would invent — but no one has?\n\n\nAnd engineers, if you've worked in healthcare tech, what’s the gap nobody’s filling?\nWhat’s the problem no one dares touch?\n\nI don’t want to just check a box and graduate. I want to build something with teeth — something born from your reality, not just my imagination.\n\nIf there’s a problem you think is too small, too messy, or too chaotic to solve... that’s exactly where I want to start.\n\nThanks for reading. Hit me with the truth — I’m listening.\n",
    "score": 28,
    "url": "https://reddit.com/r/bioengineering/comments/1mhq0nq/doctors_of_reddit_if_a_biomedical_engineering/",
    "created_at": "2025-08-04T21:15:25.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1oh9ah5",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Bioengineering student looking for feedback on his resume",
    "text": "Hello everyone, I am a student from Belgium currently looking for his first internship. I would be interested to work in the fields of Pharma and bioprocess. Any constructive feedback on the resume welcome. Nb: Internships are standard during the maser as an undergard degree is not enough to start working as an engineer in my country.",
    "score": 22,
    "url": "https://reddit.com/r/bioengineering/comments/1oh9ah5/bioengineering_student_looking_for_feedback_on/",
    "created_at": "2025-10-27T08:49:52.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1keyn5m",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "I graduated with a Bioengineeirng degree with a 2.6, and i don’t know what to do now",
    "text": "I Graduated with  my Bachelors of Science in Bioengineering. I don’t know what to do now because throughout my 5 years in school I couldn’t land a real internship. I did research volunteering work in bioinformatics, and I was involved in student organizations. But in terms of a real company, no.\n\nThe job market sucks pretty bad and I know it’s very competitive for us bioengineers, but I’m wondering\n\nFor those of you who did graduated with bioengineering, what’s were the things you did for you to land a job?",
    "score": 21,
    "url": "https://reddit.com/r/bioengineering/comments/1keyn5m/i_graduated_with_a_bioengineeirng_degree_with_a/",
    "created_at": "2025-05-05T00:23:43.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1hz85v8",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Hello r/bioengineering! 👋",
    "text": "\nI’m excited to join this community and connect with all of you who are passionate about bioengineering and innovation.  A quick intro on me: I’ve spent over 20 years working in the MedTech industry, starting as an engineer and eventually leading corporate development and M&amp;A deals.  Along the way, I’ve been fortunate to lead teams in the development of products that impact the lives of millions of patients worldwide, including the daVinci Stapler and Vessel Sealer.\n\nA few other highlights:\nEducation: BS, majoring in Bioengineering at University of Illinois, Champaign.  EMBA at Northwestern’s Kellogg School of Management. Biodesign Graduate Certificate at Stanford\n\nCareer: I’ve worked across 10+ specialties and currently am Managing Partner of my own venture studio and fund.\n\nLinkedIn Group: I started the Medical Device Inventor’s LinkedIn group in 2008. \n\nThe purpose of this post isn’t to talk about myself though.  I’m here to offer advice for anyone looking to study bioengineering and pursue a career in the field.  It’s my way of giving back to all those who helped me.  Whether you’re figuring out next steps in school, navigating your early career, or thinking about making your idea a reality via a start-up, I’m happy to help.\n\nLooking forward to learning from all of you and contributing where I can.\n\nCheers,\nEric\n\nwww.heinzventures.com\nhttps://www.linkedin.com/in/eheinz",
    "score": 19,
    "url": "https://reddit.com/r/bioengineering/comments/1hz85v8/hello_rbioengineering/",
    "created_at": "2025-01-11T22:49:19.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1myrkb0",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Career paths for biomedical engineers outside the medical field?",
    "text": "Hi everyone,\nI keep hearing that the job market in hospitals for biomedical engineers is quite limited and salaries don’t grow much.\n\nI was wondering: what other fields can someone with this background develop themselves in and work in outside the medical field?\nFor example, I’ve heard about areas like AI, software, embedded systems, or even technical sales, but I’d love to know from people in the industry what paths are actually realistic and worth investing time in.\n\nIf you’re a biomedical engineer who shifted to another area, I’d really appreciate hearing your experience. Thanks in advance!",
    "score": 17,
    "url": "https://reddit.com/r/bioengineering/comments/1myrkb0/career_paths_for_biomedical_engineers_outside_the/",
    "created_at": "2025-08-24T09:56:48.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1l1liwg",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Best Content Ideas for a Biomedical Engineering Education Channel?",
    "text": "Hey everyone! I’m working on building a YouTube channel focused on biomedical engineering education and career insights, and I’d love to get your input.\n\nAs biomedical engineers, what kind of content would *you* actually find helpful, interesting, or inspiring—either when you were a student or even now in your career",
    "score": 17,
    "url": "https://reddit.com/r/bioengineering/comments/1l1liwg/best_content_ideas_for_a_biomedical_engineering/",
    "created_at": "2025-06-02T15:50:00.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1lidepr",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Is a career in Tissue Engineering and Regenerative Medicine really worth it???",
    "text": "Hello,  \nI’m a biotechnology engineering graduate and I am really interested in tissue engineering and regenerative medicine but I’m unsure about its career potential. \n\nIf anyone here has experience studying or working in TERM (or even considered it), I’d really appreciate your insights on:\n\n* What are the **job opportunities** like (in both academia and industry)?\n* Is the field mainly research-focused, or are there industry roles without needing a PhD?\n* What kind of salary/pay range can one expect in early and mid-career stages?\n* Overall, would you say it’s **worth pursuing**?   \n\nThanks!",
    "score": 15,
    "url": "https://reddit.com/r/bioengineering/comments/1lidepr/is_a_career_in_tissue_engineering_and/",
    "created_at": "2025-06-23T10:46:26.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1osttvr",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Best college?",
    "text": "Hi, I’m interested in biological engineering (not really bio-med). I’m looking into schools where I would qualify for in-state tuition. I’m choosing between Washington State University, Oregon State University, University of Idaho, and Utah State University (I’m not sold on their excellency). My long-term goal is Stanford‘s masters program so a great program + great opportunities is my top priority ",
    "score": 14,
    "url": "https://reddit.com/r/bioengineering/comments/1osttvr/best_college/",
    "created_at": "2025-11-09T20:28:39.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1o661f0",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Is bioengineering/biomedical engineering a good major for genetic engineering?",
    "text": "These are the requirements for two positions at CRISPR Therapeutics.\n\nI’m using them as a reference.\n\n1. Scientist I/II CRISPR-X\n\nPh.D. in biology, bioengineering, or related discipline. \n\n\n2. Senior Scientist, Analytical Development mRNA\n\nPhD in Biochemistry, Molecular Biology, Analytical Chemistry, or related discipline with 5+ years of relevant industry experience, or non-PhD and 12+ years progressive, relevant experience.\n\n\nim thinking of doing a double major of biomedical engineering and molecular biology but i dont know \n\nI dont know if i should do a double major or just one major. \n\nI really want to figure this out, im a senior in highschool. Please help. \n\n",
    "score": 13,
    "url": "https://reddit.com/r/bioengineering/comments/1o661f0/is_bioengineeringbiomedical_engineering_a_good/",
    "created_at": "2025-10-14T04:30:05.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1lfwdqz",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Is Bioengineering a good major?",
    "text": "I'm a junior in high school. And I've started thinking about what I want to major in, and I had some questions. For any bioengineers out there do you have any regrets and would you recommend biomedical over bioengineering. I just want to do something with a biology or chemistry lens over it plus from what I've researched the job market is pretty good but Im not sure how accurate that is.",
    "score": 13,
    "url": "https://reddit.com/r/bioengineering/comments/1lfwdqz/is_bioengineering_a_good_major/",
    "created_at": "2025-06-20T05:49:31.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1k7jysd",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Help with spinal implant!! Going into 100s of people’s bodies!! Mad incompetence!!",
    "text": "\nHi, I’m a stoner/geek off the street who is responsible for designing some thread cutters for a spinal fusion device. How some random guy with nothing but 3d modeling experience became responsible for this is beyond me. I don’t want to say the company name but they make the majority of spinal fusion devices on planet earth I’ve been told.\n\n\nMy issue is that their print calls out a \n\nM9 X 1.411, -5/45 CLASS 2 \nReverse Angle Thread\n\nThat’s what I’m making a cutter for. There is no tolerance or even dimensions on the print for the thread flat widths. \n\nOther companies are taking shot in the dark guesses to try and get the flat width right. It’s the worst incompetence I’ve ever seen. The cost of this project is going through the roof cause of some missing dimensions that apparently no one can get the design company to add to their print. \n\nI got a copy of the solid model, but that still doesn’t tell me anything about the tolerance range on the thread.\n\nI’ve been told that these threads often fail and loosen in people’s bodies. I’m sadly pretty confident that no one is actually properly inspecting the threads. I think they will just screw the two parts together and be like “eh, good enough”. \n\nCan anyone point me to a document which has tolerances for this obscure medical thread? I’d love to be able to ensure that the fit on these critical parts is actually correct and nominal.\n\nThanks a ton \n\n",
    "score": 12,
    "url": "https://reddit.com/r/bioengineering/comments/1k7jysd/help_with_spinal_implant_going_into_100s_of/",
    "created_at": "2025-04-25T12:42:11.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1nqvx20",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "What course should I pick ?",
    "text": "I’m struggling to choose between Biochemical Engineering, Biomedical Engineering, and Biochemistry/Biotechnology. I’m genuinely interested in all of them, but I realize that what I imagine doing in the future might be very different from the actual jobs available. I want a realistic understanding of the types of careers each degree leads to, as well as how much each relies on having a master’s or PhD to secure good employment.\n\nBiochemical Engineering – I have a rough idea of what this involves but I’m still quite uncertain about the range of jobs and day-to-day responsibilities.\n\nBiomedical Engineering – I’m particularly drawn to tissue engineering and related medical technology applications. However, I suspect that pursuing a career in this area may require a master’s degree, and I’ve also heard that many companies might prefer hiring mechanical or electrical engineers over biomedical engineers. I’m not entirely sure if that’s accurate.\n\nBiochemistry / Biotechnology – I find both fields very interesting, and I think I would enjoy working in them. My concern is that getting a good job in these areas may require further study, such as a master’s or PhD, especially if I want to work in research or high-level biotech/pharma roles.",
    "score": 12,
    "url": "https://reddit.com/r/bioengineering/comments/1nqvx20/what_course_should_i_pick/",
    "created_at": "2025-09-26T08:30:06.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1m9780a",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Exhausted with job search",
    "text": "I had a job lined up after school but things went wrong, laid off everyone at the company. Till then I have applied to 800+ positions went to two final round interviews and both chose other candidates. I am an international student with Masters in biomedical engineering and 2 years of experience in medical device industry. \n\nI had a breakdown after hearing the bad news from the position I interviewed 3 rounds, it happened again with another position now. Went to onsite for two rounds and still the same result. I don’t know what went wrong or what I’m doing wrong. \n\nI am at a fragile phase right now and can’t talk to anyone about what I’m going through. People just say that the market is bad and I get that but I can’t go through it, I’m mentally drained and exhausted. I miss my family and friends, need some break from all this ;(\n\n",
    "score": 12,
    "url": "https://reddit.com/r/bioengineering/comments/1m9780a/exhausted_with_job_search/",
    "created_at": "2025-07-25T18:39:11.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1k2it95",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Is Bioengineering Worth It",
    "text": "Hi, I’m a student trying to find a major. Is bioengineering worth it over, let’s say, biochem? Is it a solid path toward med school, and do you have to learn how to code? Thank you!",
    "score": 12,
    "url": "https://reddit.com/r/bioengineering/comments/1k2it95/is_bioengineering_worth_it/",
    "created_at": "2025-04-18T23:33:35.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1i2v8ao",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "What symbol best represents Bioengineering?",
    "text": "Hello my wife and I run a company, Cognitive Surplus, that makes products for nerds and a few years ago we made an [engineering notebook series](https://cognitive-surplus.com/collections/the-engineer). Bioengineering wasn't part of the intial launch but I'm working on adding it to the series. Each design is comprised of two parts, a collage of art that attempts to capture the main aspects of the field and a symbol on the front cover. My question to you:\n\n**Question 1:**\n\nDoes this design do a good job capturing Bioengineering? Is there anything missing or something that you feel would make the design better?\n\nhttps://preview.redd.it/qrzolebebede1.png?width=2966&amp;format=png&amp;auto=webp&amp;s=f283cd92edb5ea254ddf0f3df136e26f6f617ec8\n\n**Question 2:**\n\nWhat symbol would best represent the field of BioEngineering? A prosthetic hand? A pacemaker? What's your opinion?\n\n(here are examples of the other symbols from the series)\n\nhttps://preview.redd.it/09a6a1vacede1.png?width=1664&amp;format=png&amp;auto=webp&amp;s=79be007ddbc924b7406251dfe8b82f52dfe90ace\n\n  \n",
    "score": 12,
    "url": "https://reddit.com/r/bioengineering/comments/1i2v8ao/what_symbol_best_represents_bioengineering/",
    "created_at": "2025-01-16T18:10:28.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1hyydzg",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Studying Bioelectricity and bioengineering",
    "text": "I am a recent medical graduate seeking to pursue physician scientist training. I have always been most excited about neuroplasticity, neurogenesis, and neuromodulation, but lately I’ve been delving into lung regeneration. There are plenty of approaches to take in these fields, but the one I’ve become most convinced of (or at least, what excites me the most) is bioelectricity. \n\nI was first introduced to bioelectricity through Michael Levin, who is emerging as the world’s leading authoring on bioelectricity and manipulation for bioengineering purposes. Even though the field is still very much in its infancy, I have a gut feeling that it’ll start to gain more and more prominence as the work starts speaking for itself. \n\nAs such, I wanted to dive head-first into the study of bioelectricity and bioengineering. The issue is I feel the scope can be too wide or too narrow, and so I want to eliminate any unnecessary rabbit holes while also maximizing the core topics at hand. Does anyone have any idea how to go about studying bioelectricity/bioengineering in a focused and intentional manner? Any resources or ideas would be much appreciated! ",
    "score": 12,
    "url": "https://reddit.com/r/bioengineering/comments/1hyydzg/studying_bioelectricity_and_bioengineering/",
    "created_at": "2025-01-11T15:34:38.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1i12p0t",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Switching from Criminology to Biomedical Science with Interest in Tissue Engineering",
    "text": "Hey everyone,\n\nI’m currently finishing up my master’s in criminology, but I’ve been seriously considering a career shift into biomedical sciences. My plan is to pursue a bachelor’s and master’s in biomedical sciences as a more secure career path. That’s 5 years in total. However, I’m also very interested in biomedical engineering, specifically in tissue engineering.\n\nThe problem is that to access the master’s in biomedical engineering, I’d need to complete a 2-year preparatory program first, adding up to 2 more years of study on top of the 5. That’s a big commitment, especially since I’m mainly interested in tissue engineering, which is already a subject offered in the biomedical sciences master’s program I want to pursue.\n\nSo here’s my question:\nWould it be realistic to skip the full engineering track and instead take Coursera, edX, or other specialized courses in engineering concepts and tissue engineering to strengthen my CV?\n\nWould companies in the biotech or tissue engineering industry consider someone with a biomedical sciences background plus self-taught technical skills for roles in this field?\n\nAre there any specific certifications or skills that could make up for not having a formal engineering degree?\n\nThanks in advance for your insights",
    "score": 12,
    "url": "https://reddit.com/r/bioengineering/comments/1i12p0t/switching_from_criminology_to_biomedical_science/",
    "created_at": "2025-01-14T09:54:15.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1m2al08",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Is BME for me?",
    "text": "I love biology and chemistry a little less but I still find it interesting. I love math and physics too. But, I'm not like a straight A student and tend to get a lot of B's, especially in math and physics. I don't know if biomedical engineering is a good idea if I'm not the best at math and physics because from what I've read, it's more math/physics than biology. Thoughts?\n\nAlso, I'm looking into going to uni somewhere in Europe because I have an EU passport. Would anyone recommend a English-taught course/university somewhere in Europe?",
    "score": 11,
    "url": "https://reddit.com/r/bioengineering/comments/1m2al08/is_bme_for_me/",
    "created_at": "2025-07-17T15:28:56.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1khgutn",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Bioengineering or Clinical research",
    "text": "Hi everyone,\n\nI  somehow lucked out got accepted by two great universities, one for clinical research and one for bioengineering. Now I am debating which to pick. Would love some advice on it from the program/ post graduation employment/ career growth perspective and etc.... anything is welcomed. Feel free to pm for more details if you are willing to help out!\n\nThank you in advance",
    "score": 11,
    "url": "https://reddit.com/r/bioengineering/comments/1khgutn/bioengineering_or_clinical_research/",
    "created_at": "2025-05-08T03:46:57.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1jlddwr",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "How's the job market been for 2024 grads?",
    "text": "I graduated in 2024 with a BS in bioengineering hoping for a career in pharmaceuticals/biotech and decided that it was in my best interest to pursue a masters degree from a university with better name recognition and co-op opportunities than my undergrad (mostly because I thought getting industry experience through a co-op would help me secure a full-time position when I start looking). With the recent funding crisis my search to find a co-op has got me feeling like this has just been a huge waste of time and money. I think a lot about how it would've gone if I had just searched for a job straight out of undergrad. For those of you that didn't pursue a MS, hows that been going for you? Did I make a huge mistake? Or are we all just going through it right now?",
    "score": 11,
    "url": "https://reddit.com/r/bioengineering/comments/1jlddwr/hows_the_job_market_been_for_2024_grads/",
    "created_at": "2025-03-27T20:53:18.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1it0r6q",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "New student in BME without exp",
    "text": "Hi\n\nSo i just got into Master's BME studies on my university after graduating with Bachelor in cybersecurity. Weird choice but life writes different scenarios..\n\nI am working for 2 years as a c++ developer and basically i have 0 knowledge of BME/Chemistry/Biology etc but i am terribly interested in it and would like to do it in the future.\n\nSomebody could tell me where to start with catching up? I already bought some chemistry or biology/anatomy books but i think it would be nice to also have some basic understading of BME.\n\nWhere I can find cool additional materials or maybe you have and wanted to share some disk with university presentations or something.\n\nI am hoping for ur support :D",
    "score": 11,
    "url": "https://reddit.com/r/bioengineering/comments/1it0r6q/new_student_in_bme_without_exp/",
    "created_at": "2025-02-19T08:30:31.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1pefvv7",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Need bioengineer brains for smart clothing idea",
    "text": "Hi everyone! I come from a fashion design background, and I’m working on an early-stage idea that blends smart textiles with health monitoring. Since my experience is purely on the design/wearability side, I’m hoping to get some advice  \n\nConcept:\n\nClothing is something we wear everyday, 24 hours a day. So to me it is a missed opportunity not to innovate health benefits. I’m interested in undergarments in particular as I believe we could make significant improvements on the bra for example. I want to create clothing that actually enhances the body as opposed to restricting and damaging it. To innovate new ways of thinking about clothing. As not just a means of modesty, protection or self expression. But as an aid to wellbeing. One example is from Hong Kong Polytechnic University where they have developed a 3d bra cup that can scan for breast cancer. I want to take this amazing new technology and make it wearable, beautiful and accessible to the world. \n\nLong-term I’d love to explore more advanced ideas (responsive textiles, low-profile biometric sensing, micro-vibration support, etc.), but right now I’m trying to understand feasibility and the smartest way to get started.\n\nI’m 23 and this would be my first startup. I don’t have a bioengineering or electrical engineering background. I would like to learn that side too but my primary role will be in design, marketing and vision. What I’m trying to figure out is:\n\n* What kind of bioengineering expertise would be needed for a project like this?\n* Are there standard sensor types/materials used for temperature or circulation-related data in e-textiles?\n* Is it realistic to collaborate with researchers or students on early prototyping?\n* If anyone is experimenting with wearable sensors, what would you want a designer to understand?\n\nI am open to potential collaborations if you are a student, researcher or hobbyist. This is pre-funding, so I’m not looking to hire full-time. But if you are excited about building new technology this could be an opportunity to push your work out to the market so the world can really experience and wear your creations. I'd love to hear any advice or ideas you may have! Even if you are working on a similar project, I’d love to hear about it. \n\nYou can reach out to me at [sacrumdesign@gmail.com](mailto:sacrumdesign@gmail.com)\n\nThank you!",
    "score": 11,
    "url": "https://reddit.com/r/bioengineering/comments/1pefvv7/need_bioengineer_brains_for_smart_clothing_idea/",
    "created_at": "2025-12-04T23:52:39.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1ilytui",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Should I pursue a PhD?",
    "text": "Hi, I completed a B.S. in Biomedical Engineering 3 years ago. During my undergrad I was a research assistant for two labs at an R1 university. One of which was for over a year and another less than a year. Afterwards I worked at 2 different companies as a lab technician ever since.\n\nMy first job was at a startup working with placenta-based stem cell therapies. Even though it was a contract job I was excited to work with stem cell technology and grow in the company. In about one summer, the entire company fell apart and how corporate really felt about its employees really started to show. Budget cuts led to a lot of people getting let go and half of our technician/manufacturing team. Our CEO said at a lunch that everyone who were let go from various departments are \"lazy and not pulling their weight\". I left that place as soon as I could so I didn't have to be caught in the wreckage when it all crumbles.\nMy second job where I currently work is a lot more stable and a lot less toxic. Unfortunately due to schedule changes and disagreements I had with my first supervisor I haven't been promoted to senior tech.\n\nSince I paid off most of my loans, I started a M.S. in mechanical engineering to hopefully have a way out of the biotechnology industry if I need and to obtain skills to become an automation engineer. I plan to take half of the classes while doing tech work and taking a year off to finish the M.S.\n\nMy advisor in my undergrad told me to get a PhD because I enjoyed doing research in his lab. I also took 2 masters classes during my undergrad degree because I wanted to learn more about the field. I wanted to do research in bioprinting and stem cell differentiation. However, I only did projects in undergrad that studied gene expression in tissues and cell image analysis. Therefore, I felt that I would have more luck climbing the corporate latter and maybe getting a masters. Flash forward 2.5 years later, it's really not been a great time.\n\nIf I get a PhD would I be able to get an engineering job afterwards? In this field is the PhD worth the money/time investment? Can I use any of my experience towards a manufacturing engineer role in biotech with a masters instead? Would it be better financially to move up the corporate latter and forget about higher education altogether?\n\nThank you in advance for any advice or just reading this post.\n\nEdit: Spelling\n",
    "score": 11,
    "url": "https://reddit.com/r/bioengineering/comments/1ilytui/should_i_pursue_a_phd/",
    "created_at": "2025-02-10T05:25:22.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1i0to1f",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Career Advice for new grad ",
    "text": "Hello! \ni’m looking for some help about which jobs to apply for and what jobs i should be looking into. Unfortunately i don’t have an internship or fellowship experience. I’m currently in the Michigan area. \n\nI know that i need to get industry experience but im not sure which entry level jobs i should pursue in order to get my feet on the ground. \ni don’t know how to widen my search correctly or which areas i should be hitting harder to find jobs. \n\nI have interests in pharmaceuticals, product design, biomaterials, and biomechanics \n\n\nany advice is appreciated! \n\n",
    "score": 10,
    "url": "https://reddit.com/r/bioengineering/comments/1i0to1f/career_advice_for_new_grad/",
    "created_at": "2025-01-14T00:47:25.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1o16e5c",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Biomedical engineering",
    "text": "The second i majored in biomedical engineering i started hearing that it’s hard to find a job in the field, what other options do i have? Can i work as a mechanical engineer?",
    "score": 10,
    "url": "https://reddit.com/r/bioengineering/comments/1o16e5c/biomedical_engineering/",
    "created_at": "2025-10-08T10:06:54.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1o48sy9",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Should I continue majoring in biomedical engineering?",
    "text": "I’m a freshman in college and I’m not so sure if BME is a good path for me anymore. I want to be a trauma surgeon one day but I also know that that path is long and expensive so I picked BME as a way to maybe work and save up if needed. I’m now realizing that getting a job with this degree isn’t as easy as I thought it was. I know I still have like 3-4 years before I graduate but i picked this major because I thought it was a safe pick. So maybe I should switch to biology and go the full pre-med route but I want a degree I know I can use. Then again everyone around me is saying that the job market is a dumpster fire and it’s hard to get hired and it’s especially in BME. I’m kinda worried I’m limiting myself with my major. I want to do something in medical field if possible. If not a doctor then something else in the field. I also want to know I’ll be able to get a good well paying job with my degree. I am starting to like engineering so Im alright with not becoming a doctor and just staying an engineer. I’m also okay with moving out of country after graduation if somewhere else has better job opportunities so that’s not an issue for me. It’s just extremely discouraging seeing everyone graduating and complaining about not finding jobs as I enter college. Maybe I should do mechanical engineering and minor in bio? Or just do biology? I really don’t know anymore.",
    "score": 10,
    "url": "https://reddit.com/r/bioengineering/comments/1o48sy9/should_i_continue_majoring_in_biomedical/",
    "created_at": "2025-10-11T22:33:07.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1o7vevj",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Experienced engineers: any tips for navigating the job market?",
    "text": "Hello! I’m currently in school in the U.S. and am graduating from a Masters program in Bioengineering next year. I have about one year’s worth of R&amp;D experience in med devices. Do you have any tips for searching for a full-time job for graduation? When should I start looking? What are good companies for early-career professionals? Any tips for trying to find work abroad? How transferable are R&amp;D skills to other departments such as Quality? I’ve done my own research but hoping to hear from other perspectives. Thank you! ",
    "score": 9,
    "url": "https://reddit.com/r/bioengineering/comments/1o7vevj/experienced_engineers_any_tips_for_navigating_the/",
    "created_at": "2025-10-16T03:10:24.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1mom9dd",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Is biomedical engineering worth it?",
    "text": "Hello everyone, I’m currently in middle school and planning to take a biomedical engineering course next year. If I find that I enjoy it, would pursuing a degree and career in biomedical engineering be a worthwhile path? I’m especially curious about how in-demand biomedical engineers are in Canada. Any insights into the field’s challenges, opportunities, and job prospects there would be greatly appreciated.",
    "score": 9,
    "url": "https://reddit.com/r/bioengineering/comments/1mom9dd/is_biomedical_engineering_worth_it/",
    "created_at": "2025-08-12T21:54:35.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1k05a0c",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "What's the biggest career-related challenge or roadblock you're facing?",
    "text": "For early-career Biomedical Engineers who are exploring or transitioning into the world of medical device development, I’m curious - what’s your biggest career-related challenge right now?\n\n* Breaking into the medical devices industry in today’s competitive market\n* Translating academic and lab experience into real-world applications\n* Crafting a standout resume and preparing effectively for interviews\n* Any other questions or topics you’d like to explore?\n\nI'm a seasoned BME with over ten years in the industry and I’m passionate about supporting students and recent graduates by sharing insights, lessons learned and practical advice. I'm hosting free workshops to help early-career Biomedical Engineers. If there's anything I can help you with feel free to send me a DM - happy to chat!",
    "score": 9,
    "url": "https://reddit.com/r/bioengineering/comments/1k05a0c/whats_the_biggest_careerrelated_challenge_or/",
    "created_at": "2025-04-15T22:42:24.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1iia06e",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "(BME Networking) Let's learn &amp; and grow together!",
    "text": "Hey BME friends! Whether you're a student, researcher, or professional, we all know how tough it can be to navigate the challenges in the field of BME. Whether it's dealing with coursework, career advice, tackling software issues, or just keeping up with the rapidly evolving field, having a supportive community can make all the difference. A group of us created a small peer-support Discord server where we can ask questions, share experiences, and help one another out. It's been awesome to see students getting support, professionals discussing trends in both academia and industry, and everyone connecting over BME topics.\n\nIf that sounds helpful to you, feel free to check it out. I’d love to hear what aspects of BME you find most challenging or interesting at the moment as we continue to shape our group.\n\n**Discord invite code:** nkvbQEBBy2\n\n",
    "score": 9,
    "url": "https://reddit.com/r/bioengineering/comments/1iia06e/bme_networking_lets_learn_and_grow_together/",
    "created_at": "2025-02-05T13:32:59.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1oc6gyl",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "What fields of study should I select as a student who wants to do AI/CS and Synthetic Biology/Biotech in college?",
    "text": "Hey everyone,\n\n\n\nI’m a high school student planning for college, and I want to focus on both Artificial Intelligence / Computer Science and Synthetic Biology / Biotechnology. I know these are broad areas, but I’m trying to figure out the best combination of majors or fields of study that would give me the skills to work at the intersection of biology and AI.\n\nHere are the options available\n\n\n\nBiomedical Engineering B.A.\n\n\n\nChemical and Physical Biology B.A.\n\n\n\nChemistry B.A.\n\n\n\nChemistry and Physics B.A.\n\n\n\nClassics B.A.\n\n\n\nComparative Literature B.A\n\n\n\nComparative Study of Religion B.A.\n\n\n\nComputer Science B.A\n\n\n\n. Earth and Planetary Sciences B.A.\n\n\n\nEast Asian Studies B.A. Economics B.A.\n\n\n\nElectrical Engineering B.A.\n\n\n\nB.S. Engineering Sciences B.A.\n\n\n\nB.S. English B.A.\n\n\n\nEnvironmental Science and Engineering B.A.\n\n\n\nEnvironmental Science and Public Policy B.A.\n\n\n\nFolklore and Mythology B.A.\n\n\n\nGermanic Languages and Literature B.A.\n\n\n\nGovernment B.A.\n\n\n\nHistory B.A.\n\n\n\nHistory and Literature B.A.\n\n\n\nHistory and Science B.A.\n\n\n\nHistory of Art and Architecture B.A.\n\n\n\nHuman Developmental and Regenerative Biology B.A.\n\n\n\nHuman Evolutionary Biology B.A.\n\n\n\nIntegrative Biology B.A.\n\n\n\nLinguistics B.A\n\n\n\n. Material Science and Mechanical Engineering B.A\n\n\n\n. B.S. Mathematics B.A. Molecular and Cellular Biology B.A.\n\n\n\nNeuroscience B.A. Philosophy B.A.\n\n\n\nPhysics B.A.\n\n\n\nPsychology B.A.",
    "score": 9,
    "url": "https://reddit.com/r/bioengineering/comments/1oc6gyl/what_fields_of_study_should_i_select_as_a_student/",
    "created_at": "2025-10-21T07:24:35.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1p6es2o",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Trying to go into biomedical engineering but I need some real advice",
    "text": "Hey, I’m a high school student and I’m trying to figure out my path.\nI love building stuff, I love helping people, and I’m really interested in prosthetics and medical robotics.\n\nI’ve been working on a robotic arm project, and it made me realize this might be what I actually want to do. I want to be the type of engineer who builds prosthetic limbs, understands the medical side, and can actually work in hospitals or rehab centers around patients.\n\nBut when I look up biomedical engineering online, I keep seeing stuff about genetics, diseases, tissue engineering, etc. That’s not really what I’m going for. I’m more into biomechanics, prosthetics, rehab engineering, and hands-on device building.\n\nFor anyone who’s already in BME, graduated, or working in the field:\n\t•\tWhat path did you take?\n\t•\tIs biomechanics/rehab robotics a good direction?\n\t•\tDo biomedical engineers actually get to work in hospitals?\n\t•\tWould you recommend BME, mechanical engineering, or a mix of both?\n\t•\tAnything I should start focusing on now?\n\nI’d honestly appreciate any advice or real experiences. I don’t really know anyone in this field, so hearing from people actually doing it would help a lot.\n\nThanks.\n",
    "score": 9,
    "url": "https://reddit.com/r/bioengineering/comments/1p6es2o/trying_to_go_into_biomedical_engineering_but_i/",
    "created_at": "2025-11-25T15:06:17.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1ighuts",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "[Hiring] Biomedical Engineer, US based, remote",
    "text": "Hi everybody,\n\nwe are working in the field of bioprinting and looking for a biomedical engineer.\n\nPreferably with some experience in cell cultures/bioprinting.\n\nThe position would be fully remote but requires a lot of travelling inside the US.\n\nDrop me a DM if you are interested/curious and we can have a short chat.",
    "score": 9,
    "url": "https://reddit.com/r/bioengineering/comments/1ighuts/hiring_biomedical_engineer_us_based_remote/",
    "created_at": "2025-02-03T05:23:20.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1l1z36u",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Break Into MedTech: Free Workshop for Aspiring Professionals",
    "text": "I’m hosting a **free workshop** on Saturday, **June 7** at **9-10 AM PST** for recent graduates and early career professionals who are interested in transitioning into the MedTech industry.\n\nIn this session, I’ll cover:\n\n* Common **challenges and misconceptions**\n* How to **stand out** to MedTech hiring managers\n* A clear, actionable **roadmap to break in — even without direct experience**\n* **Live Q&amp;A** at the end\n\nThis session is for you if:\n\n* You’ve been applying to MedTech roles but feel **discouraged by the lack of responses**\n* You’re **uncertain whether your resume or background is strong enough** to stand out in a competitive MedTech market\n* You’re looking to **make a successful transition from another industry** and want to **position yourself as a strong candidate**\n* You want to approach your MedTech job search with **confidence and a clear strategy**\n\nIf you’re ready to take the next step in your career, **sign up using the link in my profile**— and let’s get you moving in the right direction.\n\nBonus: If you're interested in **mentorship,** stick around for 15 extra minutes after the session — I’ll share more about how you can get involved. Or feel free to reach out to me directly on LinkedIn.",
    "score": 8,
    "url": "https://reddit.com/r/bioengineering/comments/1l1z36u/break_into_medtech_free_workshop_for_aspiring/",
    "created_at": "2025-06-03T01:06:43.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1kswgrx",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Free workshop for engineers wanting to break into medical devices industry",
    "text": "I am hosting a free workshop on Sunday May 25 for students, graduates or early career professionals wanting to transition into the medical device industry. During the workshop I will provide tips on the common mistakes during the job search process and what traits help you stand out. If you are interested, sign up using the link in my profile.",
    "score": 8,
    "url": "https://reddit.com/r/bioengineering/comments/1kswgrx/free_workshop_for_engineers_wanting_to_break_into/",
    "created_at": "2025-05-22T17:22:58.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1o1sl40",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Career prospects?",
    "text": "Hi, I am a engineering student, I was thinking about specializing in bio-med. However I'm worried about job career prospects with this whole college/engineering thing. I have a few years of work experience in entry level jobs, and I'm fairly good at school, in honors classes and all but I am definitely not good with people. Very quiet and nervous, and I probably have autism. What are the chances of being able to turn a college education into a good high paying job that's worth it? Or am I screwed?",
    "score": 8,
    "url": "https://reddit.com/r/bioengineering/comments/1o1sl40/career_prospects/",
    "created_at": "2025-10-09T00:56:56.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1pt92z5",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Switching from biochem to bioengineering",
    "text": "I finished a Biochem BA last spring. I applied senior year to grad school and cast a pretty wide net of focuses. I got into a few bioeng/biomed eng masters programs and a few chem PhD programs. I chose to go the chem PhD route for financial reasons and also bc of the whole political scene last spring. \nI also thought I would really enjoy the academic environment of the PhD, but I’m one semester in and I’m finding that’s not the case. I’m debating mastering out in a couple years and going into a bioeng or biomed eng program after. \nPart of the problem is I’m the first in my family to go to college and pursue a career in this sort of field - so I really have no idea what is and is not realistic in terms of this pivot. I’m thinking of taking one of two routes: \n(1) Applying to go directly into a bioeng or biomed eng masters program after mastering out of chem\n(2) Applying to work a biophysics/bioengineering-based industry job and then later applying to go back to school for another masters\nI’ll take any advice/opinion/brutal honesty anyone has to offer on this. One last question - one of the reasons I want to change fields is because I want to do more applied science as opposed to basic science. Am I misunderstanding bioengineering as a more applied field? Again, literally any thoughts are appreciated. \n",
    "score": 8,
    "url": "https://reddit.com/r/bioengineering/comments/1pt92z5/switching_from_biochem_to_bioengineering/",
    "created_at": "2025-12-22T19:49:36.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1oo0pkf",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Title: How can I connect my BTech in Bioengineering with the animal health industry?",
    "text": "I’m currently in my first year of BTech Bioengineering and I’ve always had a strong passion for helping animals. I’d love to eventually work in or contribute to the animal health or pet care industry.\n\nWhat are some ways I can align my degree with this field? Are there particular majors, electives, or specializations in bioengineering that would be most useful for careers involving animal health, nutrition, or veterinary biotechnology?\n\nWould really appreciate any advice, examples, or experiences from people who’ve taken a similar path!",
    "score": 7,
    "url": "https://reddit.com/r/bioengineering/comments/1oo0pkf/title_how_can_i_connect_my_btech_in/",
    "created_at": "2025-11-04T06:55:21.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1laak8h",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Career Help",
    "text": "I'm an incoming Undergraduate student and chose to major in Chemical Engineering. Was it the right choice if I plan to work in the field of Pharmaceuticals/Biomedical Engineering after I graduate? \n\nShould I have chosen to major in other engineering such as mechanical, electrical, etc.? ",
    "score": 7,
    "url": "https://reddit.com/r/bioengineering/comments/1laak8h/career_help/",
    "created_at": "2025-06-13T08:16:08.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1iav2ac",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "How bio-focused is biomedical engineering exactly?",
    "text": "I'm applying for programs soon and I've been interested in a biomedical engineering program for a while now. \n\nI've heard people say it's not great with job prospects that specifically have the title \"Biomedical Engineer\" but the school I'm applying to offers a co-op program where I hope I can make connections, get more experience, and find a job quicker.\n\nHowever, I'm mostly applying to this program because I liked bio. I've also always been sort of good at physics and thought that might be helpful, but if its essentially just the same as any other engineering degree, I might reconsider as I really do want to have a more bio-focused career.\n\nThanks for taking the time to read this!",
    "score": 7,
    "url": "https://reddit.com/r/bioengineering/comments/1iav2ac/how_biofocused_is_biomedical_engineering_exactly/",
    "created_at": "2025-01-27T00:29:05.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1mk9ygx",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "BME Grad struggling to land a job, seeking career advice",
    "text": "I'm a biomedical engineering graduate from an average university who is still struggling to land a role in the field. I understand that the nature of the program is fairly \"jack of all trades\", so I ultimately chose to follow my passion towards the data centric side of things. Additionally, I've also been pursuing ML/AI learning (certs and projects) and am very much open to learning more about how I can pivot myself into both data engineering and ML/AI engineering roles. I've been applying to biomedical engineer, r&amp;d engineer, data analyst, data engineer, clinical data engineer and any other roles with similar names in the data/healthcare field. I've had no luck landing any interviews in the field and don't know what to do anymore. \n\nI've spoken to recruiters and professionals in the field who have been fairly consistent about the idea of building a solid project portfolio, but aside from that is there any other way to stand out in the application process? It appears that I'm either not being seen by recruiters/hiring managers or whatever they've seen from me in just not worth a second glance, so my overall goal is to figure out how I can improve my visibility and stand out (whether that means fixing resume, projects, application strategy, or something else). \n\nNot sure if it's common to post my resume here but I'd be open to share, my DMs are also open to anyone willing to provide advice or just looking to vent about the job hunt nightmares",
    "score": 6,
    "url": "https://reddit.com/r/bioengineering/comments/1mk9ygx/bme_grad_struggling_to_land_a_job_seeking_career/",
    "created_at": "2025-08-07T19:44:45.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1ihxgmc",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "Should I restart my college career at a better school for BME?",
    "text": "I am a junior at a school that has a BME program… but it’s not very good. Like it’s basically falling apart. We have almost no faculty members, no research, no funding, no labs, etc. However, the most important part to me is that we have almost no advising. There are no resources for getting your foot in the door for anything, internships, REUs, grad school, industry jobs, nothing. Another big thing is the curriculum, it’s not comprehensive and it’s not enough to be a successful student. The upper level courses teach you the bare minimum, they don’t even use math to explain concepts ROOTED IN MATH? The majority of the learning I have done has been on my own, and I feel like I’m paying for a degree that isn’t preparing me for further education or a job. I want to get my PhD, and from the numerous faculty members I’ve talked to in other stem disciplines, university name recognition can help with applications, AND universities with name recognition often have a plethora of resources to help students looking to apply for things like PhDs, REUs, internships, etc. So, I found a university that has a great BME program, it’s rigorous, has a LOT of funding for research, and top notch facilities. Should I put in an application to transfer there? I am young to be a junior in college, so I wouldn’t be set back as much, but I’m wondering if I should send in an application.",
    "score": 6,
    "url": "https://reddit.com/r/bioengineering/comments/1ihxgmc/should_i_restart_my_college_career_at_a_better/",
    "created_at": "2025-02-05T00:42:45.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1i65sww",
    "subreddit": "bioengineering",
    "soc_codes": [
      "17-2031"
    ],
    "title": "JHU Masters for Engineering Professionals a worthwhile pivot? ",
    "text": "I am currently a r&amp;d process engineer, got my BS in Materials engineering three years ago. I am working in the EV industry and want to get back into biotech. I have two years experience working in biotech and switched for location/pay. Now I feel like I made a mistake switching industries. I want to get back into biotech, but the jobs I qualify for are lower than my current salary. I got into Johns Hopkins online engineering for professionals masters applied biomedical engineering. I was hoping to do this while I stay at my current job and pivot once I get the degree. I am hoping this would make me more desirable and likely for a managerial position. I am worried without this degree I will never be seriously considered for a management position let alone be back in the biotech industry with competitive pay. The investment would be 50k. I am not sure if it would be worthwhile. Could someone who currently works in biotech tell me how they would approach a candidate who has a masters obtained this way and from JHU? Is the ROI there, or is it a complete waste of time? ",
    "score": 5,
    "url": "https://reddit.com/r/bioengineering/comments/1i65sww/jhu_masters_for_engineering_professionals_a/",
    "created_at": "2025-01-21T00:28:34.000Z",
    "num_comments": 13
  }
]