[
  {
    "id": "reddit-1ni3w5a",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Lab instructor said AI lab reports are dangerous and here's why.",
    "text": "Arganic chem lab instructor went off about AI-generated lab reports. Not just about cheating but safety.\n\nStudent submitted AI report with made-up results. Didn't match actual experiment. If someone tried to replicate, could be dangerous.Now all reports go through gptzero before grading. If flagged, you redo the experiment and report in person.\n\nInstructor said \"in science, faking data isn't just academic dishonesty, it's ethical violation\". Careers have ended for less.\n\nMade me realize why authenticity matters in stem. It's not just about grades but scientific integrity.",
    "score": 1147,
    "url": "https://reddit.com/r/biology/comments/1ni3w5a/lab_instructor_said_ai_lab_reports_are_dangerous/",
    "created_at": "2025-09-16T01:10:07.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1jtvrir",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "About the Colossal \"dire wolf revival\" - I'm very Skeptical",
    "text": "Tl;dr: there are many red flags in their claims, so be skeptical until we have more details and the scientific community can scrutinize what they've done.\n\nI am seeing lots of posts in other subs and platforms about the supposed revival of dire wolves that Colossal claims to have achieved. It's mostly based on this Times article https://time.com/7274542/colossal-dire-wolf/?utm_source=reddit.com.\nSince this is a platform with many biologists but also many people seeking to learn about, I think it's important to address some things.\n\n1- they didn't clone dire wolves, nor did they splice dire wolf DNA in gray wolf embryos. What they say they've done is that they analyzed dire wolf DNA from a skull and a tooth, identified certain regions they believe to be responsible for some characteristics they deemed important, and made edits to the gray wolf DNA to match it.\n\n2- the changes are small. Their claims are that they made 20 edits to 15 genes. 15 of those edits are supposedly identical to dire wolf DNA, with the other 5 made done to genes they claim are responsible for important differences between gray wolves and dire wolves. This is not a lot.\n\n3- dire wolves aren't even in the same genus as gray wolves. They diverged over 5 million years ago. That's quite a considerable difference. Also, they went extinct over 10,000 years ago, so DNA sequences wouldn't be that well preserved.\n\n4- we don't know how or why they chose the characteristics they did. This may change if they actually publish a peer reviewed paper, but, at the moment, it's very possible that the choices were completely arbitrary, not based on actual research on what would differentiate dire wolves from modern wolves. Also, they do emphasize white fur as one of the chosen traits. This, paired with one of their wolf puppies being named Khaleesi, indicate that their view of dire wolves may be heavily influenced by Game of Thrones. So it seems they aren't even making them similar to actual dire wolves, but to a fictional image of them.\n\nOver all, I'm skeptical of this, especially coming from a private company that seems interested in making big claims about their research in order to profit. Until they publish an actual scientific paper, I can't make more assertive claims, but there are many red flags, and I would advise people to be skeptical at this moment.",
    "score": 534,
    "url": "https://reddit.com/r/biology/comments/1jtvrir/about_the_colossal_dire_wolf_revival_im_very/",
    "created_at": "2025-04-07T20:42:25.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1jufq5x",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "I am SO happy about the Dire Wolves! Colossal reached a great result! They showed us what they do! They dropped the mask, outed themselves and shown the scientific community once more the enormous problems that rise when science meets capitalism.",
    "text": "\nI hope this is a good wake up call for the scientific community and science enthusiasts on how much seeking funds, seeking profit exploits and misuses science. How much people are willing to cut corners and bend the truth so that they can profit more.\n\nColossal did in fact achieve some important results, but they HAD to bend the truth and pump and hype themselves. Exactly like Musk. Because they have to appear grandiose, they have to make a profit, to sell, to push their economic agenda.\n\nAnd i am glad, i am happy people are realising how scummy it is. How easily they lie, they mislead, the declare half truths, they subtly use words to convince people in the neutral zone. This is a fundamental problem with private companies doing scientific research. Who keeps them in check? Especially when they gain power. Who is there to guarantee the bona fide? Sure the scientific community can dismiss any claim through the peer review process, but it ends there. \n\nThis is why it's always important to have governments involved with scientific research. This is why it's important to decouple scientific research and private investments.\n\nScience is being forced to submit to money, to the market. Our career, our progress as a human species is once more leashed by economy.\n\nAnd i am glad Colossal was sloppy in this, i am glad that although they are subtle they jumped the shark. People can once again see it. And i hope from here a more serious discussion on the role of governments in research can spring up. Public vs Private, anticapitalism, leftism ultimately. And yeah.. not this government, for you USA people, but this government and capitalism are hand in hand, sooo..\n\nIt's important to have institutions dedicated to researche, financed with public funding.\n\nAnd i want to add that i am a science enthusiast, i even like the idea of artifical speciation, the creation of new species through genetic engineering, it's fascinating, although risky. Man i can see scientists giving us dragons from the draco genus. But that's all fun and games, until it's not anymore.\nThey said they would be happy to return these \"direwolves\" to their rightful place in the ecosystem. I MEAN.\n\n  \nRegulations are needed. As a bare minimum companies have to be kept in check. We could talk about scientific fraud. We need to address this seriously and qwe need to reflect on how much the market affects science. And therefore it gets political and i think it's time, once more after the climate crisis, that scientists became political. And honestly, we can ask for what we know is important, we can push for it. I mean i guess doctors know even better than us, but public healthcare is a daily topic, no?\n\nLet's all thank Colossal.\n\n",
    "score": 363,
    "url": "https://reddit.com/r/biology/comments/1jufq5x/i_am_so_happy_about_the_dire_wolves_colossal/",
    "created_at": "2025-04-08T15:02:45.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1jltxvl",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Noone believes I can study biology",
    "text": "For the past year I’ve been studying a few courses to be able to meet the prerequisite in order to get admitted to a biology program. I’ve passed all my courses with good grades so far and I am just a couple of months away from hopefully passing the final course. I’ve sent in my application for a BA in biology next fall already.\nWhile studying for the the prerequisite, I’ve spent most of my time alone during this year mostly because I have no support from anyone and people have this idea about me that I’m useless based on the fact that I have previously studied fine art. People think artists are artists only because they’re too stupid to do anything else apparently :) \nYesterday I made some new friends and they treated me to some lunch. During lunch they both expressed that biology is too difficult for ”an artist” and that I will fail. These people are not biologists themselves and know nothing about the subject.\nIt’s just that I feel very down about being spoken to this way by people, and actually I’m just writing this in the hopes that you biologists can tell me that I can do this.  My dream is to work as a conservation biologist and this means the world to me. So please if you have some encouragement to give… I really need it.. :) thank you 🙏 \nEdit: Thank you so much for taking the time to share your kindness and experience. \nIt has meant a lot to me. I’m sorry I haven’t gotten around to replying to each post yet. But thank you. ☺️ ",
    "score": 227,
    "url": "https://reddit.com/r/biology/comments/1jltxvl/noone_believes_i_can_study_biology/",
    "created_at": "2025-03-28T12:30:44.000Z",
    "num_comments": 198
  },
  {
    "id": "reddit-1pr9kqa",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Do you guys regret majoring in Biology / sciences?",
    "text": "I hear about many people regretting majoring in biology because of how low the pay is, that they have to go back to school to actually get a decent salary, etc. I love learning about biology or any of the sciences but many people steered me away because of the pay. I still think about switching my major all the time because I just enjoy learning about it, I don’t know what career I’d be interested in though since I’m more interested in diseases / human biology but don’t want to do pre-med. Do any of you regret majoring in biology / any of the sciences? Why or why not?",
    "score": 180,
    "url": "https://reddit.com/r/biology/comments/1pr9kqa/do_you_guys_regret_majoring_in_biology_sciences/",
    "created_at": "2025-12-20T08:29:48.000Z",
    "num_comments": 144
  },
  {
    "id": "reddit-1j4ch0p",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Why are there no known extant or extinct freshwater cephalopods? (ft a creature that came to me in a dream last night, the cenote-dwelling Tortilla Octopus)",
    "text": "This is a crude representation of an octopus that came to me last night in a dream (Latin name *Octopus tortillis*). In this dream I caused my team to lose at biology trivia night by insisting there was no such thing as a freshwater cephalopod. It turned out that marine biologists had recently discovered an endemic octopus in a remote cenote in Mexico. It resembled a dumbo octopus with stubby tentacles, but was a beige color with brown spots and so it was dubbed “el pulpo de tortilla” (the tortilla octopus). I woke up and immediately googled whether there are in fact any freshwater cephalopods and discovered that I was correct, they are exclusively marine and I should have championed my dream trivia team to victory. \n\nThis begs the question, however, why has no freshwater taxon ever arisen in Cephalopoda? I am a herpetologist so I know relatively little about cephalopods/other marine taxa, but what evolutionary modifications would be necessary in order for organisms of this class to tolerate a freshwater environment? Obviously there are many species of freshwater mollusk in other classes, so are there certain cephalopod-specific traits that would make the marine to freshwater transition more difficult, or is it more likely just an byproduct of this class having a lower diversification rate and fewer members than others in the phylum, so there wasn’t as much opportunity/necessity to colonize freshwater environments as in other more species rich classes of mollusk? \n\nLastly, is it possible that at some point in history, the mythical tortilla octopus or other undiscovered members of its freshwater kin could in fact have existed (perhaps not in a cenote, but in some body of water isolated from ocean populations over a long geologic time span) but was lost to fossil record due to the difficulty of preserving soft bodied organisms? I know the nautiloids were relatively ubiquitous and species rich during the Ordovician period, and those guys also seem much more likely to be fossilized than shell-less cephalopods, so I’m guessing if anything freshwater DID arise and WAS preserved in the fossil record it would be a nautiloid, but maybe bodies of freshwater were not yet amenable to colonization during the time period when nautiloids were dominant? I digress. \n\nThank you for your time and consideration of these very important questions. \n\nSincerely, \nAn ignorant land-dwelling biologist with weird dreams ",
    "score": 121,
    "url": "https://reddit.com/r/biology/comments/1j4ch0p/why_are_there_no_known_extant_or_extinct/",
    "created_at": "2025-03-05T20:05:25.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1j1wq83",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Can an evolution denier succeed in the cellular biology research field?",
    "text": "I would like to make it very clear, this is a question I am asking for a friend that I am very concerned about. I am studying biotechnology and fully believe in evolution.\n\nMy friend goes to a private christian school where only microevolution is seen as legitimate, their main focus is teaching creation. I am aware of some of their teachings and they consist of excluding all of the good research on evolution and including the failed theories for evolution, like spontaneous generation. My friend wants to work in cellular biology research and I am doubtful that she will have enough information to function as a researcher. Her beliefs are so strong and based in her religion that I typically avoid these conversations with her. However, if I get some advice suggesting her career is at risk, I will talk to her about gaining more information about actual science. If anyone has had a similar situation please give advice on how to handle it.",
    "score": 98,
    "url": "https://reddit.com/r/biology/comments/1j1wq83/can_an_evolution_denier_succeed_in_the_cellular/",
    "created_at": "2025-03-02T17:50:31.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1jwzr8t",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Is a BS in Biology that bad?",
    "text": "I recently switched from applied math to biology and the way my peers talk worries me. A lot of them say that a biology degree is worthless and the worst part about failing the MCAT is that you're stuck with a bachelors in biology, which scares me as someone who isn't going down the pre-med path.\n\nOn the other hand, my parents both have bachelors degrees (one in biology and the other in chemistry) and have become pretty well off working in the pharmaceutical industry; however, the job industry has changed a lot since when they applied. Now they both recommend getting a phd since they tell me it's exponentially worth more than a bachelors/masters in their field. \n\nWhile I have enjoyed my classes so far and think I could have the passion to go to graduate school, I am still worried since so many people have told me that if you don't go down the med or grad route you're stuck career wise.\n\nSo is it still worth pursuing a BS in Biology if I'm not certain of my future?\n\n(also side question but is it worth transferring from ucla to ucsd for biology?) ",
    "score": 87,
    "url": "https://reddit.com/r/biology/comments/1jwzr8t/is_a_bs_in_biology_that_bad/",
    "created_at": "2025-04-11T20:28:23.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1ns1ayo",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "bio grad...need a new job",
    "text": "Im 25 years old and was on the premed track. Ever since I graduated Ive been working as a medical assistant and I can not take it anymore. Im underpaid and overworked. Ive reached a breaking point where I can not work as a medical assistant anymore. Ive done a total of close to 3 years as a medical assistant. I really want a new job with an actual decent pay that's not 21 an hour. I know I don't have experience in anything but being an MA but id like to start a new career...any advice on what careers I can apply to?",
    "score": 68,
    "url": "https://reddit.com/r/biology/comments/1ns1ayo/bio_gradneed_a_new_job/",
    "created_at": "2025-09-27T17:39:16.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1lq34iz",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Should I quit my Masters in Biology?",
    "text": "I’m one year into my masters program. I would love to have a job/career where I’m out in the field collecting samples or studying animals. \n\nI’ve applied to nearly 100 biology-related jobs (anything I can find) over the past year and I’m getting nearly no responses, not even rejections. \n\nI’m getting really discouraged from this path since it seems like there’s no hope of getting hired even when I get this masters degree; I can’t even get my foot in the door in this field with an entry level job. \n\nEven my professors have said that I’ll need to have a lot of passion to make continue on this path since I’ll probably only get a dead end job. I’m losing that passion because it seems impossible for me to do what I actually want to (field work). \n\nI’m in New York btw. \n\nShould I give up on studying biology? I don’t know what to do anymore. \n\nEdit: additional info - I have much more than a year left in this program since I can only take 1 or 2 courses per semester (because the classes just aren’t available due to lack of professors), my parents yell at me at least once monthly that biology is a waste of time and I should just become a nurse (they never supported me being a biologist), my main goal right now is to move out ASAP but I can’t save money from work since I pay for my own college, I’ve pretty much given up and applied to a nursing program (and got in). ",
    "score": 53,
    "url": "https://reddit.com/r/biology/comments/1lq34iz/should_i_quit_my_masters_in_biology/",
    "created_at": "2025-07-02T18:15:37.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1o93n41",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Degree Panic Advice",
    "text": "I’m a senior majoring in Biology (B.S) and lately I’ve been panicking about my degree and future career prospects and such.\n\nI love biology, and I love learning about it, in particular I’ve found myself especially interested in learning about arthropods (especially spiders and insects), phylogenetics, evolution, ecology, and conservation.\n\nBut I’m so terrified that I’m not going to be able to do anything with my degree…\n\nI’ve heard it said that biology is a very oversaturated degree without a ton of demand, and a lot of the career paths I’m interested in seem very competitive, low demand, and low turnover.\n\nAnd what’s more is that I feel like I need to make a decision very soon on what I specifically want to do so that I can start preparing for it.\n\nLike, once I graduate, if I want to do research, everyone I’ve talked to about it has mentioned I should go for a graduate degree ASAP, like, immediately after graduating with my bachelor’s.\n\nBut for some of the other careers I’m interested in (park ranger, conservation, beekeeping…) it’s more fuzzy because I don’t know many people in those fields, but it seems to me that I should go for work experience first in those fields and then go for a grad degree?\n\nAnd underlying all of this is that from what I understand there’s very little demand for these careers; there aren’t many jobs here and people working in these careers tend to stay there. So it’s very competitive and I am doubting my competitiveness (I have a 2.8 GPA…)\n\nSo I guess I’m looking for advice… what should I do?",
    "score": 43,
    "url": "https://reddit.com/r/biology/comments/1o93n41/degree_panic_advice/",
    "created_at": "2025-10-17T14:59:39.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1js72d1",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "If you graduated with Bachelors in Biology, what do you do now? Seeking advice moving forward.",
    "text": "\nHi everyone! \n\nI have graduated with my Bachelors in Biology and I’m seeking some advice. I was originally pre-veterinary, but have changed my track and looking into Forensics now. Interested in helping people and seeking justice for those who have been wronged in life. I feel forensics would be very rewarding, thinking more of the lab side of things or even autopsy tech . But, I do know forensics entry level jobs can be hard to obtain and you may need a masters degree or move states away to find a job opening. I am currently in a general diploma program for forensics and almost done with it. \n\nI’ve also considered maybe sonography program or MLS degree... So I am still using my bio degree towards my career and can further myself into another program. I would still do something rewarding and get to help people in some sense. I am 27, so I know that I am still young, but mentally feel I’m running out of time. I’m trying to keep my options open \n\n I really want to get into a career track and would like to hear some personal stories of what you did, or if you have any suggestions for me based off my current interests what my best move would be. I’m 90k + in debt from just my Bachelors and want to make smart monetary decisions going forward in life. \n\nThank you for any advice or taking time to comment it means a lot!",
    "score": 35,
    "url": "https://reddit.com/r/biology/comments/1js72d1/if_you_graduated_with_bachelors_in_biology_what/",
    "created_at": "2025-04-05T16:16:59.000Z",
    "num_comments": 131
  },
  {
    "id": "reddit-1nno3n3",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "struggling biology major",
    "text": "Hi. \n\ni've seen this same post time and time again. i am currently a freshman in college, and I'm in as a biology transfer, hoping to transfer to purdue and pursue a career in vet science. \n\nI love biology. all of it so fascinating to me. but chemistry...I can't do it. nothing is clicking. I know it's only been the first three weeks, but ive failed two quizzes so far, and have a major exam back to back with a major biology exam.\n\nI'm thinking about switching my major. my mother keeps encouraging me to drop it, because she's known people who wanted to be biochemisists or geneticists but couldn't hack it, so they became lawyers or teachers. one of my major passions is writing, and I understand it and am good at it. but im also so incredibly enamored with biology\n\nbut chemistry is really fucking killing me. I'm in gen chem 1, and my professor has a very heavy accent and is constantly talking loud and rushing lectures (his lectures are allotted only 1:45). nothing is clicking, im so overwhelmed and discouraged at the failing grades. he's always telling us that this is \"high school chemistry\" and it's easy stuff, which is making me feel worse and worse. I don't know what to do anymore. I feel as though I should just drop my major. ",
    "score": 33,
    "url": "https://reddit.com/r/biology/comments/1nno3n3/struggling_biology_major/",
    "created_at": "2025-09-22T14:32:32.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1jbvmcr",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Best way to Study Biology Without Attending College?",
    "text": "I am 27M and have always had a huge interest in biology, including zoology, botany, genetics, immunology, and some others. Unfortunately, I joined the military 6 years ago and have settled into a career which has led me through multiple deployments, overseas tours, and unknown work schedules and duty locations that make attending college nearly impossible. Earning a biology degree is 100% impossible due to the in-person requirements I found at most reputable universities. I tried earning a degree in finance instead, due to biology being unavailable at the one university available near my duty station on the other side of the world, but my heart is not there and I just can’t reliably attend college due to my deployments and work schedule. I am determined to pursue biology in some form. What are the best resources for this? I will buy textbooks, online courses, podcasts, online lectures, whatever it takes, but unfortunately I may never be able to get a degree until I leave the military. ",
    "score": 27,
    "url": "https://reddit.com/r/biology/comments/1jbvmcr/best_way_to_study_biology_without_attending/",
    "created_at": "2025-03-15T13:55:15.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1k038r8",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "what are your careers?",
    "text": "hi i’m graduating soon with a B.S. in Biology and Environmental Science. just curious as to what jobs yall have? expand my mind on all my possible options! \n\nbe so specific on your day to day life please i’m so curious\n",
    "score": 21,
    "url": "https://reddit.com/r/biology/comments/1k038r8/what_are_your_careers/",
    "created_at": "2025-04-15T21:12:14.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1pomh74",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Biology undergrad, what jobs do you guys hold within the field?",
    "text": "Curious to know what you all went into if you pursued biology fields as a career. Also just to see what other options I may have, biology is so versatile and I want to hear more about the different career paths people take within it ",
    "score": 21,
    "url": "https://reddit.com/r/biology/comments/1pomh74/biology_undergrad_what_jobs_do_you_guys_hold/",
    "created_at": "2025-12-17T03:42:50.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1i36jas",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "What biology jobs exist?",
    "text": "Question: \nWhat kind of biology degree do you have and what is your job/salary?\nWhat did you get involved in (or wish you got involved in) in high school that helped foster your love for science?\nContext:\nMy daughter is 14, has ADHD, really enjoys learning science but often lacks motivation for things. She's smart and will be taking AP science next year. We are starting to discuss college and careers. I've done some internet research and looked on LinkedIn for jobs that require a bio degree but I'd love some anecdotal info too.\nWhen I asked her what she likes about biology she said, classifying animals, how cells work, and life. Lol Her ADHD makes her better at hands on things. She cannot do anything medical due to her passing out at the sight of blood/needles, etc. \nThanks for your help in setting her up for success!",
    "score": 20,
    "url": "https://reddit.com/r/biology/comments/1i36jas/what_biology_jobs_exist/",
    "created_at": "2025-01-17T02:47:03.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1hv6eka",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Best career paths for a BS in Biology?",
    "text": "Graduated this past year with a BS in biology and been struggling to figure out what career path is best to take now. Seems like I need at least a master degree in a related field to find work and even there I'm not sure what's the best choice. So am wondering if anyone here whose taken biology as a college major has any advice for careers that require just the degree or what I could do for a masters or other higher education to find other career opportunities. ",
    "score": 20,
    "url": "https://reddit.com/r/biology/comments/1hv6eka/best_career_paths_for_a_bs_in_biology/",
    "created_at": "2025-01-06T18:46:54.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1ojf6rj",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Education path for anti aging field",
    "text": "What education should i pursue if i want to a career in anti aging, anything from reversing aging, longevity, cloning, cryogenics, mind upload, whatever. I want to contribute to humanity's ability to prolong life.\n\nHowever there isn't such a thing as a degree in biogerontology, so what would be the best next thing",
    "score": 18,
    "url": "https://reddit.com/r/biology/comments/1ojf6rj/education_path_for_anti_aging_field/",
    "created_at": "2025-10-29T20:10:33.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1o0z3vq",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Classic question: what career do you have with a bachelors in bio?",
    "text": "The search for a decent paying job with this degree is so tiring. Jobs either want a masters, lab jobs want a cert or a special degree, and or just 5 years of experience. ",
    "score": 18,
    "url": "https://reddit.com/r/biology/comments/1o0z3vq/classic_question_what_career_do_you_have_with_a/",
    "created_at": "2025-10-08T02:50:06.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1mzr9hn",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "What did you do with you B.S. in Biology?",
    "text": "Biology is of course very broad, so I’m curious what directions you ended up going in career wise. Did you stay in biology, try something outside of it, go on to get a masters?\n\nI was always very interested in the ecology side of bio, but I’m learning that this field is very limited with opportunities and highly competitive, and it seems as though many jobs are seasonal/temporary, don’t pay all that great, and often require you to have flexibility to move around to where the jobs are. Im in the US for reference. I’m thinking about trying something different as I would like to have more stability, so I’d like to hear your experiences regarding what you’ve done, what you liked/didn’t like, etc.\n\nThanks!",
    "score": 16,
    "url": "https://reddit.com/r/biology/comments/1mzr9hn/what_did_you_do_with_you_bs_in_biology/",
    "created_at": "2025-08-25T13:59:36.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1j9qgq4",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Should I get a PhD",
    "text": "I’m currently a freshman undergrad majoring in biology and minoring in German. I’m currently a premed and have wanted to be a physician for a while. My school has an undergraduate research program where students can be matched with a faculty member and get paid to be a research assistant and present at a school run research symposium (or multiple if you choose to). I’ve been working in my lab since around October and my PI is wonderful and I really connect with her. At one of our first meetings she said she was a premed as an undergrad as well but decided to pursue a PhD in cellular signaling mechanisms because she was having so much fun in the lab. I feel like I’m following in her footsteps and I’m wondering if it would be a good idea to pursue a PhD in genetics or molecular bio. \nI eventually want to live in Germany and become a citizen because my partner is a German/US dual citizen and I want to move to his home country for the foreseeable future when I’m done with my studies, and I’m open to doing a PhD in Germany. \nWhat are the job prospects for a genetics/molecular bio PhD? Is the time and energy commitment worth it for the future career prospects it could give me?",
    "score": 15,
    "url": "https://reddit.com/r/biology/comments/1j9qgq4/should_i_get_a_phd/",
    "created_at": "2025-03-12T18:04:42.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1njf04k",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Lost with what Career to go into now",
    "text": "I'm 26 with a biology degree and first worked as a MLS for about a year after graduating undergrad in 2021. I then switched to more of an industry job for 2 years with vaccines that was hybrid work from home but paid garbage (\\~$20/hr with two promotions). I then went back to MLS and moved all the way to Michigan (now getting paid \\~34/hr) which is great pay but I think the job itself is very stressful and I'm still not certified as I have to do the long route (almost eligible). Although, the stress of the hospital and my management has been really getting to me and I don't know if this is the career for me anymore. Working weekends, holidays, very little PTO, the gossip, the drama, it's a lot. I was wondering if anyone has pivoted to something else that still paid well with just a biology degree? Even if it's not biology related job, I'd love to hear. I guess I'm just a little lost and feel like I'm running out of time to pick something for good. Ideally, I would love a hybrid job, even if it's an office job, if it pays well. Just looking for any advice! Thanks!",
    "score": 14,
    "url": "https://reddit.com/r/biology/comments/1njf04k/lost_with_what_career_to_go_into_now/",
    "created_at": "2025-09-17T14:40:58.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1o6u89d",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "How can I start getting into a research/lab career?",
    "text": "I’m still in school for my bachelors degree and I’m unsure where to start for a career. I’m debating between entomology/zoology and pathology for a career. \n\nI’m unsure where to look for jobs. Everything I’ve found so far is asking for people with about a decade of experience. Or it’s on indeed or zip recruiter which haven’t been the best for actually getting a job from my experience. I’m willing to get a certification that may take a few months but I just want a starter job in either career. I have lab experience for chemistry and biology. \n\nWhere did you guys start looking for beginner jobs?",
    "score": 13,
    "url": "https://reddit.com/r/biology/comments/1o6u89d/how_can_i_start_getting_into_a_researchlab_career/",
    "created_at": "2025-10-14T22:43:23.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1ig8z2o",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Redditors with Biology majors",
    "text": "Hello !!\n\nKind of a long complicated question here.\nI’m a second year biology major, trying to set a plan for my future 😅. I’m trying to decide what would be my best option after college. I would like to stay away from medicine as it is not a passion of mine. From people that have already been down this road, what kind of jobs would you recommend?? I know there’s not much to do with only a bachelors and I wouldn’t mind getting a masters, I was extremely lucky to find a university that is going to cover all of my tuition for my bachelors, so if it would help me find a better paying job I would definitely invest on myself and get a masters. I know this is a vague question but just want to look at possible careers.",
    "score": 13,
    "url": "https://reddit.com/r/biology/comments/1ig8z2o/redditors_with_biology_majors/",
    "created_at": "2025-02-02T22:00:20.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1n8uzsi",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "How do folks who study insects for the sake of studying insects themselves feel about Drosophila folks who only use them as model organisms for human diseases?",
    "text": "I work in a Drosohila lab studying Parkinson's disease, so I was just wondering about this out of curiosity. I mostly just think about Drosophila in the context of neurons, and tbh I only recently looked into their gastrointestinal system very briefly because I was sorting virgins and got curious about what it actually all looks like. The post doc in my lab also use to work in Drosphola patterning, so she very much has studied flies for the sake of understanding flies, but she moved to studying neurodegenerative diseases later in her career. \n\nAre we like cousins?",
    "score": 13,
    "url": "https://reddit.com/r/biology/comments/1n8uzsi/how_do_folks_who_study_insects_for_the_sake_of/",
    "created_at": "2025-09-05T03:45:49.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1mgx913",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Having second thoughts about majoring in biology, looking for advice (especially from people in Europe)",
    "text": "I (17M) am about to finish high school and I really enjoy biology. I would love to turn it into a career, but I also want to make sure I have nice job perks like a good salary, benefits etc. My plan is to move to Europe, since I have family there, and pursue a degree.\n\nI’m still unsure about what to specialize in, but I'm considering genetics, molecular biology or something towards biochemistry or biomedicine (it's a bit broad ik).\n\nLately I’ve been going through the sub and noticed many people sharing frustrations about job security, salaries, and overall usefulness of a biology degree, which made me a bit insecure about my decision.\n\nHowever, most of these complaints were coming from people in the US, so I wanted to ask:\n\nWhat is the life of a biologist like (generally) in Europe?\n\nIs it worth pursuing a biology career there?\n\nWhat career paths in biology offer good job perks (salary, benefits, job security, etc.)?\n\n(Sorry if the terms aren't correct, I'm still very new to this)",
    "score": 11,
    "url": "https://reddit.com/r/biology/comments/1mgx913/having_second_thoughts_about_majoring_in_biology/",
    "created_at": "2025-08-03T22:59:28.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1myzpqe",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "What careers have a good employment rate and average salary?",
    "text": "I’m about to start my first semester of college and I’m majoring in biological sciences. The reason I chose this major is b cause I don’t really have any ambitions or dream careers and just chose this because as a kid I said I wanted to be a wildlife biologist/zoologist so now I’m really just rolling with it. The truth is Im having a lot of doubts because I hear that it’s hard to land a stable job in those fields and it’s mostly just seasonal/temporary jobs. I feel it’s too late to change my major now and even if I did, I don’t know what other major I would do. That being said, what careers in biological sciences have a good employment rate and a good average salary? Like what would almost guarantee a stable job coming straight out of college?\n\nEdit: I’m not saying I hate biology, I like it I’m just not all that passionate about it. Also, my question is about careers in biological sciences. The problem isn’t that I don’t want to do biological sciences, it’s that wildlife biology/zoology have a low employment rate, so I’m asking about other careers in biological sciences.",
    "score": 10,
    "url": "https://reddit.com/r/biology/comments/1myzpqe/what_careers_have_a_good_employment_rate_and/",
    "created_at": "2025-08-24T16:11:18.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1kd3oj3",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Do bioinformaticians only assist biologists or conduct their own research?",
    "text": "I'm very interested in Biology esp. for a career in research/academia but, because of the salary expectations and poor market for it in my country, I'm thinking of getting a Statistics BS and then specialize in BioInformatics, BioStatistics or other fields that cross both Bio and Stats. My worry though is that those professionals only help other biologists conduct their research and don't do their own, independent biological research. Is that the case?",
    "score": 7,
    "url": "https://reddit.com/r/biology/comments/1kd3oj3/do_bioinformaticians_only_assist_biologists_or/",
    "created_at": "2025-05-02T15:23:30.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1kawyyv",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Promising Biology Careers?",
    "text": "I’m a high schooler in the U.S. who wants to pursue a career that I actually am interested in - Unfortunately my two passions are biology and art.\n\nI’ve been considering biology a lot but I’ve heard about over-saturation and underpay (especially for BS degrees) and I was wondering if there are any specific fields or jobs that have a comfortable salary and/or better employment rates. It doesn’t have to be lab work or anything, honestly I’m open for all sorts of options so long as they’re not completely unrelated. \n\nIf it helps I’m good at math and while I don’t really like programming I’m fine with learning non advanced stuff. As for biology itself I love anything from microbio to zoology and whatever’s inbetween!",
    "score": 6,
    "url": "https://reddit.com/r/biology/comments/1kawyyv/promising_biology_careers/",
    "created_at": "2025-04-29T19:43:06.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1jw646i",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Master's degree in Neurobiology or Bioinformatics? Need advice",
    "text": "Hello everyone,\n\nI am about to finish my degree in Biology and next year I have to do a master's degree. I am quite undecided and I would like to ask you for advice, especially those of you who work in neurobiology, bioinformatics or know these fields well.\n\nI am passionate about neurobiology. I love everything related to the brain, the nervous system, plasticity, molecular neuroscience, etc. The problem is that I am not very clear about the job market in this field: I don't know if there are many outlets, if it is easy to find a job beyond academia, and if it pays well or not.\n\nOn the other hand, bioinformatics also interests me. I don't like it as much as neurobiology, but I recognize that it has many advantages: there are more job offers, you can work remotely, the salaries are better and it seems that there are more options outside the purely academic field.\n\nSo I'm in a dilemma: do I go for what I like the most even if it has fewer outlets, or do I play it safe even if I'm not so passionate about it?\n\nI would really appreciate any advice, especially if you work or have worked in any of these fields. What is the day to day life like? What would you recommend to someone who is just starting out? Is it possible to combine both interests in any way?\n\nThanks in advance for reading me.",
    "score": 6,
    "url": "https://reddit.com/r/biology/comments/1jw646i/masters_degree_in_neurobiology_or_bioinformatics/",
    "created_at": "2025-04-10T19:13:58.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1k05v00",
    "subreddit": "biology",
    "soc_codes": [
      "19-1029"
    ],
    "title": "Potential Career Route For Bachelor's in Bio?",
    "text": "Hi all!\n\nI'm currently a sophomore biology major and I realized that pursuing a Phd, which to my understanding is standard for most undergraduate general biology majors, may not be for me. I've heard from an alumni from my school (bachelor's in bioinformatics and graduated with a 2.9 gpa), who found a promising career in the biotech sales industry. I know that a biology major is not the same as bioinformatics, but that made me consider as to whether that could be a viable career path for me.\n\nI find that I'm generally pretty good at marketing myself and am an above average speaker/presenter, despite being fairly introverted. I feel like that skill in conjunction with my understanding of biology may allow me to work my way up in the sales industry. Furthermore, from what I've seen from a few google searches, this path is also fairly lucrative salary-wise as well, at least compared to other potential biology careers.\n\nDoes anyone have any insight into this? Is this generally a bad plan, or is it even necessarily viable? I imagine there are a few things that I'm completely overlooking, but I'd rather be called an idiot now rather than later lol!\n\nEdit: I'm from the US",
    "score": 5,
    "url": "https://reddit.com/r/biology/comments/1k05v00/potential_career_route_for_bachelors_in_bio/",
    "created_at": "2025-04-15T23:09:20.000Z",
    "num_comments": 3
  }
]