[
  {
    "id": "reddit-1m2w99p",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "WARNING to anyone using WeTransfer to send files",
    "text": "WeTransfer have updated their T&amp;Cs, which is a shocking breach of copyright in my opinion - read 6.3 for the full statement, but this is the worrying part:\n\n'You hearby grant us a perpetual, worldwide, non-exclusive, royalty free, transferable, sub-licensable license to use your content'......\n\n'Such license includes the right to reproduce, distribute, modify, prepare derivative works'....\n\nThis is unbelievable! Thought it was worth informing others who use this service.",
    "score": 4161,
    "url": "https://reddit.com/r/Filmmakers/comments/1m2w99p/warning_to_anyone_using_wetransfer_to_send_files/",
    "created_at": "2025-07-18T07:50:03.000Z",
    "num_comments": 403
  },
  {
    "id": "reddit-1l1flvk",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I Quit My Job to make the Japanese Horror of my Nightmares",
    "text": "**I quit my 5-year teaching job three months ago to pursue directing full-time here in Japan.**\n\nA few months back, I shot this fake trailer in Tokyo and put it up on YouTube titled *“This Movie Doesn’t Exist. Here’s the Trailer.”* Made with tax returns, friends, mid-day pizza, and late-night coffee.\n\nMy original goal was to become a trailer editor.  \nBut with no films to cut, I made my own.\n\nAnd it WORKED!\n\nThe trailer hit 66k views. I landed trailer editing jobs.  \nBut then people in the comments kept asking for the real film.\n\nI joked about it not existing. But after 100s of comments, I started to believe it *could*.\n\nNow, we’re turning it into a real film.\n\n**The story:** \n\nA psychological horror about a parasite that lives on a man’s face.  \nThink early 2000s J-horror meets *Perfect Blue* — with a little dry comedy beneath the dread.\n\nI’m the writer, director, costume designer, SFX, and post team — all on a micro-budget.  \nLuckily, I brought on Keita Arai (*Netflix’s City Hunter*) to star, and we’re keeping the production as raw and intimate as the trailer.\n\n**And we’re live on Kickstarter** 👉 [https://www.kickstarter.com/projects/kdwilson/it-doesnt-exist-a-thriller-film](https://www.kickstarter.com/projects/kdwilson/it-doesnt-exist-a-thriller-film)\n\nI’ve learned more about filmmaking in the last 3 months than I did in 5 years of teaching and side jobs.\n\nHoping this community can support — even just by sharing\n\nThanks for reading,  \n— K.D. Wilson",
    "score": 2662,
    "url": "https://reddit.com/r/Filmmakers/comments/1l1flvk/i_quit_my_job_to_make_the_japanese_horror_of_my/",
    "created_at": "2025-06-02T11:29:29.000Z",
    "num_comments": 181
  },
  {
    "id": "reddit-1mp1wpp",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Not paid in 1.5 years as an AD - movie called the Barista",
    "text": "I was the Assistant Director—and at times, even acted as the Line Producer—on the film The Barista, which wrapped in May 2024. I still haven’t been paid.\nWhen I called out the director and producers on social media, they threatened to sue me for “embarrassing” them.\nThe producers and director of the project are:\n\n* Brian Shackelford - Director/producer\n* Joyce Fitzpatrick - Producer\n* Marc Harris - Producer\n* Carolyn Nelson Henry - Producer\n* Vivian Matito - Producer\n* David Skato - Producer\n* Doug Schwab - Producer\n\nI was hired at the very last minute—literally confirmed the day before filming began. All I was told:\nIt would be a 10-day shoot.\nThe script was over 100 pages.\n“Most” cast and crew were confirmed (they weren’t).\nThe crew constantly changed, key roles were filled last-minute, and locations were still being found during the shoot. There was no production designer or production assistants—I did much of that work myself.\n\nWe finished filming in 9 days. After that, they vanished. No communication. No payments. \nCrew members and agents began contacting me about money they were owed.\nThey also broke promises to my friends who helped as PAs, refusing to pay them because they “didn’t have cars.” I drove them to set myself.\nSerious misconduct: An actress had a contract clause requiring an intimacy coordinator. The producers ignored it. \nWhen her agent complained, they dismissed her as “acting out.” She was later injured during a fight scene, and the producers’ response was: “It doesn’t matter, we got the shot.”\n\nI’ve filed a complaint with the California Labor Department and will continue speaking out. I may never get paid, but I won’t stay silent while people like this exploit others.\n\n[Evidence &amp; conversations here](https://drive.google.com/drive/folders/1-IeGCgYQaszmi2spF6o7E_h5Nn69okQK?usp=drive_link)",
    "score": 2286,
    "url": "https://reddit.com/r/Filmmakers/comments/1mp1wpp/not_paid_in_15_years_as_an_ad_movie_called_the/",
    "created_at": "2025-08-13T11:32:11.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1li3oq9",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "28 years later shot on IPhone",
    "text": "Can we talk about this?? I honestly can’t believe that rig. \n\nI thought it was well shot and loved the zombie POV shots . Also, the angle when they kill some of the zombies. The colors were awesome! \n\nSome things that stood out to be was some blurry shots I guess ?? I might have to watch it again. \n\nhttps://m.dpreview.com/news/4499233144/28-years-later-movie-20-iphones-film\n\nhttps://m.dpreview.com/news/4499233144/28-years-later-movie-20-iphones-film",
    "score": 2206,
    "url": "https://reddit.com/r/videography/comments/1li3oq9/28_years_later_shot_on_iphone/",
    "created_at": "2025-06-23T01:01:39.000Z",
    "num_comments": 363
  },
  {
    "id": "reddit-1kzofbi",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "First restaurant gig, took a massive and humbling L :(",
    "text": "I got hired last week by a marketing company, the deal was to take some pictures and record some reels, they showed me some references and they were the usual video of a guy making a pizza and showing it to the camera and a phone recording of someone grabbing a slice of cake. I got early to the restaurant because it was a 100 dollar job so I wanted to make sure lighting was good and have a look at the place. The place was extra small and had only two white lights in the roof. My dumbass don’t bring enough lighting equipment and long story short the marketing agency straight up told me the video it’s unusable and that they just can’t show it to the client. They told me that as a recommendation I should restrain myself from taking creative liberties and just try to replicate what they sent me. What do you guys recommend in this situations I offered a reshoot and to make basically the same reel they sent me as an example and they declined, but idk I guess this would eventually happen and I already apologized for the underdeliver but wanted to know what you guys think of the video I mean the client already told me it’s unusable but is there a way to rescue this footage? Also if you have a similar story please share it I wanna know how did it go and what did you learn from it",
    "score": 1229,
    "url": "https://reddit.com/r/videography/comments/1kzofbi/first_restaurant_gig_took_a_massive_and_humbling_l/",
    "created_at": "2025-05-31T04:25:33.000Z",
    "num_comments": 594
  },
  {
    "id": "reddit-1jmqqob",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Reminder: We are not invincible when we film, we can still very much die.",
    "text": "My friend passed away this week and it was completely avoidable. They were out in a storm reccing in the woods and a tree fell over. An amazing filmmaker by all accounts with a career just starting. Noone fought them for safety guidelines and in other sets I've been outcasted for caring too much about the \"what ifs\" and I'm not even the assistant director. \n\nSo the reminder, if the assistant director can't do their fucking job to keep you safe then you have to do it for you. We're making content, it's not the end of the world if it takes an extra day or even worse doesn't get made. But you'll film something the day after as long as you're still here.",
    "score": 1067,
    "url": "https://reddit.com/r/Filmmakers/comments/1jmqqob/reminder_we_are_not_invincible_when_we_film_we/",
    "created_at": "2025-03-29T16:57:34.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1knyvug",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Is Hollywood dying? Yes. Here's why:",
    "text": "Hollywood is built on a foundation of exploitation, censorship, control, and profit-at-all-costs. They couldn't hide it forever and now the shit is visible for everyone to see.\n\nHollywood’s entire structure is based on fucking people over. Whether its distribution deals, studio contracts, or casting, Hollywood fucks anyone not on the inside. They destroy artists, bankrupt studios, steal original materials, are racist as fuuuuuuuuuuuuuuuuckkk and crush indie productions to protect its own stale mediocrity. The “studio system” is designed to keep power consolidated in the hands of a few executives who wouldn't know a good story if it hit them between the eyes.\n\nInstead of championing new ideas, new creators and telling the stories of our time, Hollywood circle-jerks around whats \"safe\"—reboots, sequels, and bland storytelling chosen by committee. Their boardrooms are think tanks for IP asset management. They don't make films; they make content—sterile, focus-grouped, algorithm-churned content. They’re don't create, they repackage.\n\nThey create and protect absolute monsters because they were profitable. From Weinstein to Diddy, Hollywood not only looked the other way—it *actively empowered* them. “Open secrets” are ignored until they become public liabilities. How many careers were ruined? How many victims were silenced to protect weekend box office returns? How many people killed themselves?\n\nIndependent filmmakers are frozen out, underfunded, and treated like amateurs. Hollywood steals their aesthetics and authenticity when those ideas proved lucrative—think Mumblecore, New Black Wave, DIY horror. They take originality, polish it for mass appeal, and sell it back as their own.\n\nHollywood laughed at YouTube, underestimated TikTok, and belittled online creators, and now it's their undoing. DSLR cameras, crowdfunding, streaming platforms, and affordable editing software gave the power to the smaller creators, who don't need studios, don’t need agents, and only need a vision and internet.\n\nWith the exception of the dipshit trump, nothing in existence congratulates itself more for doing less than Hollywood. They hand themselves gold statues for making movies about struggle, justice, and social change—then turn around and blackball those voices in real life. They love to pretend they’re on the cutting edge of progress while maintaining a system that was outdated even in the 70s.\n\nHollywood is dying because it betrayed the medium in favor of market share. It’s dying because it couldn't stop strip-mining its own past for profit. It’s dying because the new generation of storytellers no longer sees it as the dream.\n\nHollywood could have been a cultural legacy for centuries. Instead, it will be remembered as a bloated, elitist machine that finally collapsed under the weight of its own ego, and I don't see a single thing wrong with that.\n\nThe story of Hollywood is the story of America.",
    "score": 929,
    "url": "https://reddit.com/r/Filmmakers/comments/1knyvug/is_hollywood_dying_yes_heres_why/",
    "created_at": "2025-05-16T11:51:05.000Z",
    "num_comments": 253
  },
  {
    "id": "reddit-1mhlb8n",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Interior Warehouse Interview Lighting &amp; Grip BTS for Amazon shoot.",
    "text": "Gaffed a few interviews for an Amazon production about a month ago at one of their warehouses. Normally I try to avoid taking lighting jobs where I don’t have any other lighting technicians or grips, but the producer budgeted several hours in the schedule for me to get set up while the DP wen right and shot b roll that I wasn’t needed for. The hardest part was really just physically moving everything around as the warehouse is absolutely gigantic and we had to film in a few different places throughout it. Thus, I put everything I could on stands with wheels to make my life easier. \n\n\n\nKey light was a 6x6 book light made with Aputure 1200D bouncing into a 4x4’ Ultrabounce floppy and then back through a 6x6 of full silent grid cloth, with a 6x6’ LCD (“light control device” aka “egg crate,” not liquid crystal display) in front of it for control. I added a 2x3’ solid flag in front to take down some of the intensity on her white shirt. \n\n\n12x12’ solid on a T bone for negative fill. \n\n\nAmaran F22C rigged to a junior boom mounted in a Matthews Panel Stand for a hair light. ",
    "score": 928,
    "url": "https://reddit.com/r/videography/comments/1mhlb8n/interior_warehouse_interview_lighting_grip_bts/",
    "created_at": "2025-08-04T18:20:49.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1i5r2ro",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I am a nobody filmmaker who cast Harvey Keitel in a movie and then got in Forbes. AMA",
    "text": "As a broke nobody who came from nothing and never went to film school, I shot my first-ever film in Cambodia and got a distribution deal with Sony - blew my mind, and opened the door to shooting my second feature and landing a couple names like Arnold Vosloo and Michael Ironside. And  subsequently that got me my third film, LAWS OF MAN, in which I cast and directed Harvey Keitel, Keith Carradine, Dermot Mulroney, and a bunch of others. It released in theaters last week.\n\nForbes came out with a piece on the journey (article attached) which has been a nice counterbalance to the movie getting panned by critics, typical of the highs and lows of this fuckin' rollercoaster of a career. Article here:  \n\n# [Cinema’s Every Man: How Phil Blattenberger Is Reshaping The Industry In His Working Class Image](https://www.forbes.com/sites/joshweiss/2025/01/17/cinemas-every-man-how-phil-blattenberger-is-reshaping-the-industry-in-his-working-class-image/)\n\nI wrote, directed, and produced all three movies. I am offering an AMA if anyone is interested in any part of the journey, especially as it relates to us no-name producers trying to add big name talent, secure financing, getting your ass kicked by the critics, etc. My name is Phil Blattenberger. AMA!",
    "score": 914,
    "url": "https://reddit.com/r/Filmmakers/comments/1i5r2ro/i_am_a_nobody_filmmaker_who_cast_harvey_keitel_in/",
    "created_at": "2025-01-20T14:15:47.000Z",
    "num_comments": 289
  },
  {
    "id": "reddit-1lz7bnj",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "I just got a great paying job as a porn videographer but hate it.",
    "text": "Here’s a little context. I’m a really good videographer. I recently got hired in as a videographer for porn which is completely new to me. The pay is $60k/yr but the work is.. less than ideal. The hours are 9-5 and most of that time is spent waiting for straight guys to watch porn to get hard so they can fuck other straight guys. \n\nThe position also requires cleaning up used bedding, providing meds where needed, and after 7-10 days of not filming it’s 9-5 in an office editing the work we shot. I know a lot of people would kill for this gig. 40 hrs per week, $60k salary, benefits if wanted, travel (Hawaii next) but it’s just not making me “good” inside. I feel weird directing a grown man to say “fuck me harder” or to slowly stroke himself.\n\nAm I the crazy one and should just change my mindset? I can provide more context where needed.\n\nEdit #1: Yes this is real haha! And I’m real. Here’s my portfolio https://www.instagram.com/lockexknight?igsh=ZWRiamt2bXE3dmRz&amp;utm_source=qr\n\nPart of the job description said 10% chaperoning the performers but it turns out they film 7-10 days out of the month and for those 7-10 days you live in the shoot house with them to make sure they don’t fool around with each other, break anything, and for discretionary reason nobody can leave the house at any point in that time frame. Granted it is a gigantic house.\n\nSo far a 20 minute video takes 2 hours because the guys are actually straight and need to pause every few minutes to “get ready” again to go with the other guy. Yesterday we had to use a turkey baster to shove fake cum up one of the guys butts for a creampie shot… luckily the other actor did it but for a second they looked around like they were wondering who would do it 🤣\n\nIn terms of other benefits I mean regular full time benefits like health insurance, retirement, blah blah blah. Not a ton of vacation time though. Only 10 days per year after your first year. The team it’s VERY small. Two owners, one head videographer, talent scout, and now me I guess. But TONS of money. This is for very well known brands. Like millions of dollars.\n\nAlso to me, my situation, and where I live $60k (along with my partners salary) is plenty of money. Might not be a ton for everyone haha!\n\nEdit #2 -\n\nWhat I meant by many people would kill for this gig I was more speaking that in this economy for a $60k/yr for full time regular work, a lot of people would appreciate that not just videographers.\n\nThe job itself if pretty easy. My skill level is far more advanced than what’s required. I’m one camera of a three camera team and we just walk around to get different angles then give out a direction every now and then. Lots of pauses. It’s definitely ruins the fantasy of porn haha!\n\nEdit #3\n\nI don’t want to say what city I’m in because I don’t want thing to somehow get back to anyone. The company has a front for a media company and has a legit office under BLANK media. The office is very nice and upscale where all the editing happens. It’s a legit company and I’m a W2 employee and everything so in terms of how a business operates, it’s very legit and professional. Just the position (no pun intended 🤣) isn’t ideal.\n\nThanks for all the responses! Imma update this thread once I make a decision but right now I think I’m going to tell my bosses that I have boundaries and will film and edit but not for the hours they are expecting and they’ll have to find another person for the chaperone tasks. If they don’t accept that I’ll just have to find another gig. I saw how many people applied to this job as I was asked to look at the other applicants for a 4th videographer and they received over 78 apps in one day. So I guess if I don’t do the job, someone will. Okay, bed time!\n\nEdit #4\n\nDamn this went nuts since I went to bed haha! To answer a few questions, the company has 3 websites. The larger gay site, a bi site, and a straight site. They do have actual gay men there as well as straight men. I’ve just been on the straight/straight shoots so far. The reason they said is because they like to make as many combinations as possible. I guess it’s easier for a straight guy to fuck gay than it is for a gay guy to fuck straight 🤣 \n\nA lot of you say find a different video gig but truth is where I live there aren’t a lot. This was probably the first one in about 5 months. Unless you do freelance work but the market here is so saturated that newer guys bring it down by doing it basically for nothing. My regular rate is $350/hr for freelance but I would make more having a steady $60k/yr job.\n\nThanks for the follows on instagram and the messages there! Also, for those thinking this is fake because there aren’t examples on instagram, first of all I can’t post their content in my instagram, I don’t own it. Second, I CAN’T POST PORN ON INSTAGRAM! \n\nI woke up to a message from the talent scout guy and he said they’re bringing on a 5th video guy so we can do multiple productions at once in the house. I’m not crazy for wanting to try this job as a ton of people interviewed for it and more people are good with taking it. I’m just crazy if I keep it 🤣\n\nUpdate: Okay I tried to take a little advice from everybody and I decided to tell them that I won’t be doing the chaperoning side of things which they were OK with because the other videographer is just fine with it, which is crazy to me. I also told them that I could be there for the shoot days and part-time editing remotely. They said as it’s a 40+ hour a week gig they couldn’t accept that. I then tried to negotiate a much higher salary, and they said that I was trying to barely work for them for a ton of money, so I politely bowed out of the position.\n\nANYWAY, please give me a follow on instagram so I can actually try to make some money 🤣 https://www.instagram.com/lockexknight?igsh=ZWRiamt2bXE3dmRz&amp;utm_source=qr\n\nTLDR; I temporarily got a job as a porn videographer for a very big adult entertainment company and they’re asking me to do outrageous things so I tried to negotiate less hours or more money and they said no so I quit.",
    "score": 714,
    "url": "https://reddit.com/r/videography/comments/1lz7bnj/i_just_got_a_great_paying_job_as_a_porn/",
    "created_at": "2025-07-13T23:36:46.000Z",
    "num_comments": 322
  },
  {
    "id": "reddit-1n70486",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "This style of property shoot has to stop",
    "text": "The issue isn't with the motion or effects. It's primarily that for a property tour/introduction it has to be clear where the motion flows. The continuity is completely broken. This is a core videography principle and I'm not sure if it's coming from novice shooters or poor direction but it's extremely hard to follow and from a pure movement perspective it's not consistent and only adds to the confusion. \n\nSpeed ramping in itself is ok when not overdone. Push transitions, even when the direction is implied (unless lead by camera movement for a mask transition with foreground elements), rarely aids the viewer in following along. Trying creative ways to engage the viewer is part of the process but editing it like a sports highlight reel is not one of them. \n\nI don't like to rag on learning videographers but these kinds of edits don't have a place in the real estate market for potential buyers. Imagine if you went for an open house and the realtor grabbed your hand and started speeding you through the house up, down, out the window, back in the window, up the stairs, down the toilet, etc. It's crazy!\n\nThat's my rant. \n\nIf this was your video, I'm sorry. Please don't do this. \n- A prospective buyer",
    "score": 696,
    "url": "https://reddit.com/r/videography/comments/1n70486/this_style_of_property_shoot_has_to_stop/",
    "created_at": "2025-09-03T00:13:52.000Z",
    "num_comments": 233
  },
  {
    "id": "reddit-1pk0cis",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I made a tiny indie doc… and years later Gus Van Sant made the Hollywood version with Al Pacino.",
    "text": "r/filmmakers **has been with me since around when I started my video career in 2012.** Back then, I was just trying to figure out cameras, storytelling, lighting, editing, etc. This subreddit became a quiet mentor for me. Seeing so many of you share struggles, experiments, failures, and breakthroughs shaped how I approached my own work.\n\nA year later, I dove into creating a documentary about a 1977 hostage crisis in my hometown of Indianapolis. I had no idea what the path would look like. It turned into five years of tracking down people who didn’t want to talk, digging through forgotten archives, restoring footage that was literally falling apart, learning as I went, and piecing together a story that had existed only in fragments.\n\nI wasn’t chasing Hollywood. I just wanted to tell the story as truthfully and completely as I could. Zero budget. No producers. Just a stubborn belief in the project and a lot of late nights wondering if anyone would ever see it.\n\nThen, unexpectedly, people reached out. A screenwriter, Austin Kolodney (who I know is a fellow Redditor, chime in Austin if you want), contacted me. He was scrappy, persistent, and absolutely determined to make a feature film about this story—and honestly, his drive is what pushed the Hollywood version into existence. Without his hustle, *Dead Man’s Wire* wouldn’t have happened the way it did or at all, probably. \n\nAlong the way, I also had an experience with a well‑known director/producer that… let’s just say *did not go well at all*. I won’t get into names or details, but it was one of those classic indie‑filmmaker moments where you realize not every door that opens actually leads anywhere. Hollywood is filled with people who promise big and never deliver. \n\nA few more producers came and went. And thanks to Austin’s great script gaining traction, Werner Herzog signed on, and eventually Gus Van Sant made a feature film based on the same case—*Dead Man’s Wire*, starring Al Pacino and Bill Skarsgård. Somehow, my documentary became the historical foundation the filmmakers looked to while shaping the world of their film. \n\nIt’s surreal. You make something in a room with no guarantees, and years later it becomes part of a major production’s research and reference point.\n\nI’m not posting this as a brag. I’m posting it because I know a lot of us here spend years on projects that feel like they’re going nowhere. We grind, we doubt, we revise, we restart. Most of the work feels invisible. But sometimes the thing you make quietly travels further than you ever expected.\n\nBefore the trailer, I should also mention one more part of the journey: distribution. I went through the festival circuit, then traditional streaming, and now I’m releasing the film on YouTube—each step teaching me how fragile visibility can be for an independent filmmaker. Happy to dig into that if anyone’s curious.\n\nIf you’re curious about the project or want to see how I approached the real story, here’s the trailer.  \nAbsolutely no pressure to watch—just sharing the journey in case it helps someone else pushing through their own project. AMA.\n\n[Trailer](https://youtu.be/gQZMFksVFhU?si=i8YH1ivMZQcJwlIq)",
    "score": 541,
    "url": "https://reddit.com/r/Filmmakers/comments/1pk0cis/i_made_a_tiny_indie_doc_and_years_later_gus_van/",
    "created_at": "2025-12-11T15:29:39.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1kks1xo",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Is the film industry fucked?",
    "text": "I used to get regular work constantly. There were tv shows, features and commercials happening so there was enough to go around. Now trump has announced these %100 tariffs.. am I the only one seeing all the work dry up around me and thinking it’s time to find a real job? What do I even do? I’ve built my career in this industry for 8 years and how is that even transferable to anything else? Feeling pretty low about the future of it all",
    "score": 539,
    "url": "https://reddit.com/r/Filmmakers/comments/1kks1xo/is_the_film_industry_fucked/",
    "created_at": "2025-05-12T13:06:46.000Z",
    "num_comments": 414
  },
  {
    "id": "reddit-1ip6nur",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Streamers are robbing indie filmmakers",
    "text": "I just confirmed with two producers that their films streaming on Amazon Prime are paid 3 cents per 100 hours viewed on the platform.\n\nTHREE CENTS PER HUNDRED HOURS!!\n\nCheck my math, but in order to recoup your budget on a 5-million dollar film, you'd have to rack up over 16 *billion* hours of playback. For a 90-minute film, you could be watched by every single person on planet Earth and still be in the red.\n\nFor comparison, the top-playing content on Netflix in 2023 was Season 1 of the Night Agent (812,100,100 viewing hours). That show would have earned less than $250k from Amazon's pricing model.\n\nThey are spitting in our faces.\n\nMeanwhile, Netflix is paying less for deals while juicing their profit margins. A career producer I know described Netflix as \"the worst buyer he's ever sold to,\" taking months to respond to emails and offering worse deals each year with more strings attached, forcing you to go through distributors who take 20% cuts for doing almost no work...all because...who else are you going to sell to? Amazon?\n\nTruly...who else can indie producers sell to? Are there good buyers out there anywhere? Sales agents and foreign distributors either rip you off or honestly can't recoup past their marketing spend. Streamers have squeezed their business, and indie films can't make money in theaters.\n\nIs it possible for indie films to make money in this market? How?",
    "score": 410,
    "url": "https://reddit.com/r/Filmmakers/comments/1ip6nur/streamers_are_robbing_indie_filmmakers/",
    "created_at": "2025-02-14T09:11:17.000Z",
    "num_comments": 116
  },
  {
    "id": "reddit-1j3wnjf",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "How did Quentin Tarantino actually start his career?",
    "text": "I know he worked at a movie store and studied movies and acting while working. \nI guess my question is, don't you need a budget to make any project decent? Were actors just working for free? Or just getting paid a small amount? Did he happen to have old money that he put to use? This is all I'm trying to wrap my head around when it came to production for his projects. \nI apologize if this a dumb question but im genuinely curious and have recently had a big interest in the film industry. ",
    "score": 400,
    "url": "https://reddit.com/r/Filmmakers/comments/1j3wnjf/how_did_quentin_tarantino_actually_start_his/",
    "created_at": "2025-03-05T06:13:10.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1ofzcdl",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "They say you can’t make a real film with nothing. I just did.",
    "text": "I’m Kyle, a filmmaker from Long Beach, CA.  After years building under El Primo Brand, I just laid the cornerstone for what real indie cinema can look like.\n\nI spent years chasing budgets, crews, and approval until I realized the system I wanted into doesn’t work for filmmakers like us. So I stopped asking. My wife and I drew up a roadmap and made the first brick ourselves. \n\nWe shot a feature film right here in Long Beach. No investors, no middlemen,  just honest contracts, fair terms, and the same city that raised me. The movie was shot for $938, and an iPhone, but the paperwork behind it is stronger than a lot of six-figure deals I’ve seen. Everyone who showed up has ownership in what we built.\n\nPeople twist it when I say you don’t need a crew… what I mean is, stop waiting for everything to be perfect. Build small, build smart, and keep building so you can make a second film, and a career, not just a moment.\n\nThe flick’s called SORRY — “Just when you thought your day couldn’t get any worse, it does.”\n\nIt’s the start of El Primo Brand’s next phase: A home for real indie moviemakers with  unique voices and perspectives looking to get their voices heard and movies seen. \n\nThe industry’s broken. Distribution’s a trap. Everybody’s chasing validation and calling it progress.\nI just wanted to prove you can still build something real with your own two hands.\n\nWatch it, don’t watch it, but if you’ve been sitting on your story, thinking you need more time, more gear, more “yeses”… this is your excuse killer.\n\nMovie + trailer → https://elprimobrand.com \nMore info about El Primo Brand\n → https://elprimobrand.com/wtf\n\nThe reasoning behind only putting the movie on my site, is because I want to show other indie folks what is possible and am going to use this movie as a case study to improve every step moving forward, hopefully. Why not go to my site to catch a flick vs going to Netflix’s site? It comes down to marketing, and that’s where this whole guerrilla plan comes into play. But I have to show it can work before I start reaching out to others to join the guerilla army. With this being said, I also have hit a hurdle with the VOD as I try to send my movie out to people to review, people that don’t have the time for hurdles themselves,  have to put their payment info into Vimeo before the promo codes work which is just so off-putting and a big turn off to a large portion of people I am trying to cold-reach out to.  Annnnyyywayyyyy, with that being said, I had to bend a small amount and get a private link going as well,  but the site shows the bigger mission behind the film, and that’s where the future lives.  So if you don’t want to rent or buy the movie, at the moment..\nThat link is → https://vimeo.com/1130517746?fl=ip&amp;fe=ec  PW is: PRIMO\n\nAsk me anything.  About making a feature for under a grand, raising kids through chaos, or trying to build art that still has a pulse, I’m here for all of it, and I really just want to be the guy you blame making your first movie on. \n\nThanks for your time, \nKyle  🎬\n",
    "score": 335,
    "url": "https://reddit.com/r/Filmmakers/comments/1ofzcdl/they_say_you_cant_make_a_real_film_with_nothing_i/",
    "created_at": "2025-10-25T18:47:45.000Z",
    "num_comments": 210
  },
  {
    "id": "reddit-1p2dylp",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I spent my life savings to make a 35mm short film and the response was lackluster. Why do you think this film failed to make an impact?",
    "text": "Hi my name is Taylor Thompson, I'm a Writer/Director from Sacramento, California. I've been making films for over ten years now, and in an effort to land my first feature film I decided to financially ruin myself to make yet another short film.\n\nThe process of making this film was one of the best chapters of my life. I worked overtime for over a year to save up enough cash to get started, then put the rest on my credit cards. I shot this film three years ago and have just now paid off my debts.\n\nUpon release it was a hit with my friends and local community but despite my best effort the film fell flat in the festival circuit. It was accepted by two festivals that you've probably never heard of. Beyond that it's done little else than gain me a bit of local notoriety. No feature film, no music video offers, no writing jobs.\n\nI love this film, I don't regret a thing, but obviously it was a bad idea to destroy myself financially to do this.\n\nSo my question is, what was my mistake? What about this film may have caused it to fall flat with programmers, and why has it failed to bring me the opportunities i had hoped for? I am preparing a new film now and want to try my best to correct the mistakes i made in the past.\n\n**UPDATE - 11/21**\n\nFirst off thank you so much to everyone who's taken the time to discuss my film and lend their two cents. I was not expecting nearly this much engagement, and I fear I will not have the time to respond to you all. This has been extremely helpful and gave some real clarity on what went right and what went wrong with this one.\n\n**Here is a summary of the points I'm really resonating with so far:**\n\n\\- The film is too long! That has been made very clear, and I do agree with this point. I completed this film last year and with some distance I can see several ways to trim this down. Earlier cuts of this film were actually much longer (around 27 min if i remember correctly) the montage nature of the first half is a result of trying to find out how to simplify things. but nevertheless I was too close and naive to really shave it down to its purest form. This is a lesson I will certainly carry into future works.\n\n\\- The script is bloated and unrefined. I agree with this as well. I wrote this three years ago and have written a few features and a handful of shorts since then. I have grown a lot since i wrote this film and can feel the amateur nature of the script. Had i written the story with a concise hand and stronger arc i think the film would have been much shorter and more impactful.\n\nSome have critiqued the unlikable nature of the leading man, and i disagree that this was a mistake. In fact it's the whole damn point of the character. And personally I do find him likable, certainly abrasive especially in the beginning, but by the end i'm in love with his madness and related to his failure to self reflect, among other things. I know it's not the easiest way to connect with an audience, but I would never dream of changing who Dennis is as a character, and in general find flawed protagonists to be the most interesting people to observe in a film.\n\n\\- I should not have spent so much money on this film. I think this is a fair assessment, especially after going through the three years of financial ruin to recover from this decision. Do i regret it? Not really. Making films is my greatest joy in life and making this film in particular was a peak life experience that has allowed me to evolve as a filmmaker and even more-so evolve as a human being. The experience has gained me a much broader network, ironically most of the friends I have today are people i met through the process of making this film, and I've learned invaluable lessons along the way. That being said, I have vowed not to spend this kind of money on a short film again and plan to strive for greatness on a more humble budget.\n\n\\- \"Shooting on 35mm was a terrible and ego-driven idea\" - Yeah, I think this is a silly take, and have read a heap of asinine opinions on this point. I understand thinking this is what made my film so expensive but you'd be surprised to find that maybe $7k out of the entire $25k budget was spent on film related costs. I was able to get a reduced-cost camera/lens package from Panavision. I purchased the film stock with a student discount (50% off). And my good friend owns a film scanner so that was entirely free. I think it's an obvious truth that film is superior to digital, but clearly this is a hot take these days. Of course there are consequences to the workflow but there are plenty of advantages as well. All the movies that made me into the person i am today were shot on film and if you don't think that modern cinematography has failed to uphold the standard of the past then I think you just have bad taste (there are exceptions of course). But I do believe that shooting on film is an essential ingredient that makes up the magic of movies, and that's the standard I strive for as a filmmaker. Life is short and i'll only be able to make so many movies in my lifespan, this is the thing i love most about being alive and for me this was worth every penny. Obviously i don't think the format makes something automatically good, there are incredible films made on the worst digital cameras you can imagine, quality comes from the story and the vision. I will shoot on film again, but I have never been above shooting digital and have done so many times.\n\n\\- The days of short films breaking out a director are long gone. This is the hardest truth to face, I do agree with this. The industry is not what it was when I was growing up and planning my strategy. Maybe a bit of a cope, but i do think if I had made this film in the 90's the outcome would have been very different. But that's irrelevant, it's a different world, and it's very confusing to determine what the necessary steps are to finding a career as a director. I now know that making another short will not change my life, i will likely do it anyway because i just love doing it. But i have accepted the fact that if I want to direct my first feature then i will simplify have to green light myself and do it on a budget close to what i spent on \"People Person\". Even then incredible directors with incredible films are facing the same struggles I am, failing to make an impact in the modern world. I pray that the film industry has a bright future, but if we are living in the end times then i'll proudly go down with the ship.\n\n**Again, thank you so very much to everyone who has taken the time** **to watch and review the film. This has been illuminating for me in many ways. And I am grateful to be surprised by the generosity of complete strangers. My work is certainly not for everyone, so i am touched to find a few new faces that connected with what we've made. And have learned from those who haven't. Love you all.**\n\nIf you are interested you can find my previous short film \"Foulmouth\" on my Youtube channel [https://www.youtube.com/@aldentay92](https://www.youtube.com/@aldentay92)\n\nAnd follow me on Instagram to keep updated with what I'm making next. [https://www.instagram.com/taylor.alden.thompson/](https://www.instagram.com/taylor.alden.thompson/)",
    "score": 326,
    "url": "https://reddit.com/r/Filmmakers/comments/1p2dylp/i_spent_my_life_savings_to_make_a_35mm_short_film/",
    "created_at": "2025-11-20T20:22:07.000Z",
    "num_comments": 285
  },
  {
    "id": "reddit-1ljrr3a",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I’ve only worked 36 “paid” days in the past 7 months (Crew)",
    "text": "I’m a 29 year old 1st AC (when fortunate DP) based in LA. I’ve been lucky enough to do this full-time since I was 17. I used to be in 600, but had to request an honorable withdrawal two years ago due to inconsistent union work. Most of my career has been supported by non-union DPs, producers, and AC friends who’ve kept me afloat with steady gigs over the years.\n\nBut like a lot of folks this year… it’s been rough. I’ve only worked 36 (paying) days in the past 7 months. Checks aren’t as big or consistent, and for the first time in a long time, my savings are starting to take a hit. I’m starting to stay up late most nights applying to all kinds of “media” related jobs around SoCal and the US.\n\nSo I’m wondering, how are you all finding work right now? Facebook groups? Craigslist? LinkedIn? Discord? Cold emails?\n\nOr are you also considering a career pivot that still pays in the ballpark of our Operator/AC rates? If so, what path did you take? Trades? Tech? Medical? I’ve been strongly considering going the RN or Welders route for something more stable, if anyone’s gone down that road, or any route, I’d love to hear how it’s going.\n\nAny insight, advice, or personal experience would mean a lot. Just trying to figure out the next move and hoping I’m not alone in this. Thanks in advance friends 🤘",
    "score": 311,
    "url": "https://reddit.com/r/Filmmakers/comments/1ljrr3a/ive_only_worked_36_paid_days_in_the_past_7_months/",
    "created_at": "2025-06-25T00:29:57.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1mw4c17",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "15 years in and considering giving up",
    "text": "I'm in my early 40's and have been shooting video for the past 15 years. My wheelhouse has been high quality branded documentary style projects, usually with a crew of 2 or 3. In my city in the UK i was one of the first doing this, and though I posted things to social media, it's usually higher ROI more long term videos rather than disposable social media 'content'. I always saw my work as standalone pieces rather that 'assets'. \n\nIn the past 2 years I've seen the industry change more more globally and specifically in my local town than ever before. I really invested my time into video as a career as I was sure it would be the future of digital; but what I've seen happen instead is a race to the bottom where young people come in and shoot totally fine stuff with a good phone on a gimbal.\n\nWhat's really sent me over the edge a bit over the last few months are clients now asking for so many social media edits, including the original files. I've had two regular clients with new internal media managers who see my more as a gun for hire for the day rather than the producer of a finished project.\n\nThey now are asking for the original files so their internal team can do edits (its now so much more common for a junior person coming in to be able to do this), and asking for a multitude of formats and versions, with and without baked in subtitles.  \n  \nAnd what's worse is now everything has to be 'snappy'. Whereas a video before had room to breath, now it's all about attention span and selling. A young video pro before might talk about video skills as lighting, composition, narrative - now it's about grabbing the attention of people addicted to their phones, with techniques like 'disrupting the scroll' and 'visual stacking'.\n\nPeople will say I just need to stick to the higher quality stuff and let the bottom feeders do their thing; but even the clients with the bigger budgets are changing; its what I feel being a video producer is that seems to have changed.\n\nI'm not trying to be a gatekeeper; if people want to do that then that's fine go for it, but i'm not sure I want in anymore. How do others feel? How are they navigating this change? i'd really apprecaite nay insight as I'm frankly very down and ready to call it a day.",
    "score": 311,
    "url": "https://reddit.com/r/videography/comments/1mw4c17/15_years_in_and_considering_giving_up/",
    "created_at": "2025-08-21T07:30:47.000Z",
    "num_comments": 184
  },
  {
    "id": "reddit-1mg8jq8",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "How hard did it hit you?",
    "text": "When you realized your career isn't going any further and you need to pivot into something else? I'm 35 and have been at it for a little over ten years with varying levels of success and failures. I've worked on everything on all levels in various positions but this year has hit me I don't have shit to show for it and its probably time to call it quit. ",
    "score": 283,
    "url": "https://reddit.com/r/videography/comments/1mg8jq8/how_hard_did_it_hit_you/",
    "created_at": "2025-08-03T02:56:09.000Z",
    "num_comments": 136
  },
  {
    "id": "reddit-1ij6qwj",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "A 6 figure salary in creative video",
    "text": "Is a 6 figure salary in this industry even realistic? I feel like my family and I are in dire straits financially. Mortgage interest rate is killing us. Daycare costs are killing us (a surprise 2nd child).\n\nFor the last 13+ months I've been looking for a new full time gig. I'm simply a one man band at the company I'm with now, video isn't the product being sold, so there's no real path for advancement. I feel like my salary with the company is stagnate.\n\nI just want to know, are there full time positions in the creative video field out there? Or am I better off starting my own thing/production company and grinding my ass off?\n\nI'm in the Midwest, moving isn't an option for my family. I have 10 years of professional experience running cameras, setting up lights, and running audio for interviews, shooting b-roll for all kinds of industries. I edit, color grade, make basic motion graphics for all my stuff. I feel like I'm at a crossroads, and I could stay where I'm at and hope, find a new gig (ideally in a production environment where my skills are more appreciated) or do my own thing. \n\nSorry this turned into a rant, thanks for reading. \n\nTL;DR anyone out there leverage their solo shooter/editor experience into a director level role with another company? Tell me your story.\n\nEdit: didn't expect this to get so many comments, thank you all who provided thoughtful insights, I really appreciate it. This has given me some new hope and a better idea of where I should aim for my next career move.",
    "score": 234,
    "url": "https://reddit.com/r/videography/comments/1ij6qwj/a_6_figure_salary_in_creative_video/",
    "created_at": "2025-02-06T16:35:32.000Z",
    "num_comments": 199
  },
  {
    "id": "reddit-1j3dciy",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I want to be a filmmaker",
    "text": "Just want to say it out loud because it sounds crazy. I’m 34, currently living in DC working as a data analyst for a startup (I WFH) and have never filmed anything. I have a completed screenplay that needs some work but I’ve gotten decent feedback so that’s a start. Problem is the thought of making a movie, even a short, sounds crazy. I’m almost embarrassed to tell anyone other that my wife because everyone will think I’m going through some kind of identity crisis (even my wife just kind of dismisses it). I’m not, or at least I don’t feel like I am.\n\nI’ve always gravitated towards writing and other creative pursuits. Studied photography and design in college along with history. I wound up in corporate America because I needed to pay rent and I’ve hated every minute of it. I’ve never excelled at “work” and never could pin down why I hated it so much. Now almost 8 years later I kind of realize maybe I’m just not meant for it. I love movies and have been writing as a hobby for about 10 years now. I understand the financial security of a decent career is not something to just toss aside on a whim so I’m trying to plan it out. \n\nAnyways I’m just taking the first steps and saying it out loud in hopes it will sound less crazy the more I say it. I’m open to any advice but really just wanted to share my dream with internet randos. ",
    "score": 229,
    "url": "https://reddit.com/r/Filmmakers/comments/1j3dciy/i_want_to_be_a_filmmaker/",
    "created_at": "2025-03-04T15:30:13.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1pa5jim",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "The Film Festival Tips Nobody Tells You",
    "text": "After 15+ years of submitting films to festivals (and getting into some big ones), and also directing and programming a film festival for 7 years, as well as programming shorts for 14 film festivals: here’s the strategy I wish someone told me earlier:\n\n**95% of filmmakers submit the** ***wrong*** **film to the** ***wrong*** **festival.**\n\nHere’s the system that finally worked for me:\n\n**1. I stopped thinking “What festivals do I LIKE?”**  \n**I started thinking: “What festivals PROGRAM films LIKE MINE?”**\n\nMost filmmakers carpet-bomb every major festival with a film that was designed for maybe three of them. If you've ver been to Sundance you know EXACTLY what I'm talking about. If you ever see the Sundance Short Blocks you will have your mind-blown on what type of shorts they actually program.\n\n**2. Look at the last 3 years of programming.**  \nIf you can’t see your film fitting into at least 6 films per year, don’t submit.  \nIt's not personal. It’s programming.\n\n**3. “Bigger” does NOT mean “better for your film.”**  \nI’ve had small festivals make a bigger impact on my career than larger ones.  \nSmall = more attention, more community, more networking.\n\n**4. Use the rule of thirds:**\n\n* 1/3 “reach” festivals\n* 1/3 realistic festivals\n* 1/3 guaranteed category-fit festivals\n\n**5. And here’s the part nobody teaches:**  \n**Know exactly how long the shorts blocks are (short films only).**  \nIf they only have 1 hour or so for shorts then your 15 minute short film has a very small chance of getting in. \n\n**Think of it from the Programmers side**: If they program your 15 minute short, then they have to say no to 3 filmmakers who have 5-minute shorts and not give them an opportunity. Or 7 filmmakers who made 2minute shorts. They are not giving people an opportunity in order to program yours. So it better either be 1) Amazing or 2) Cut the damn thing shorter so that you've got a better chance of being programmed.\n\n  \nOne more quick tip: Programmers HATE HATE HATE 2 minutes of credits at the beginning of short films!",
    "score": 212,
    "url": "https://reddit.com/r/Filmmakers/comments/1pa5jim/the_film_festival_tips_nobody_tells_you/",
    "created_at": "2025-11-30T01:24:46.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1k24g16",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Took me till I was 37 to make my first short, ‘Love Hurts’ - an absolute idiot tries to win the heart of a paramedic by getting himself into a series of accidents.",
    "text": "Thought I’d share my first short! I’m 37, and my day job has been in advertising for 15+ years. My ambition has always been to try get into directing, but despite thinking (and talking) about it a lot I've always really struggled to get started in any real sense. In the end I found what I needed was a deadline, so I applied for an evening course in directing at Metfilm London, where the task was to write, produce and direct out own shorts over a few months. Now it’s just off its festival run and despite its many flaws it managed to pick up over 20 selections and even a few awards. \n\nFor anyone struggling to get started, my learning has been to find a way to set yourself a deadline. Whether this is a short course or even just agreeing a date to send a first draft to a friend by, it will help get the first thing made. I’ve found that just finishing something and feeling like I've taken one concrete step in the right direction has been hugely energising.\n\nAt 37, the classic intrusive “most successful directors have already made it by your age” thoughts have also done their best to hold me back, so I’m partly posting this to encourage anyone coming from other careers or people later in life to ignore that bastard of a voice and just get it done! I have to say, watching it on the big screen for the first time felt like a huge fuck you to those thoughts and while I’m still a while away from directing becoming my ‘real job’, it's nice to finally be able to post it (and probably have it get slated by you lovely people).\n\nNow on to the next one!",
    "score": 198,
    "url": "https://reddit.com/r/Filmmakers/comments/1k24g16/took_me_till_i_was_37_to_make_my_first_short_love/",
    "created_at": "2025-04-18T13:04:38.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1iegnj1",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Connecting with other video creatives near Zurich",
    "text": "I‘m Kaitek, a Zurich based videographer. \n\nMy career has too many ADHD detours to list, but I ended up in a place I really like: Working freelance on TV episodes, documentaries, corporate stuff and operating live cameras. My approach is multimedial, using different techniques like Macro, Timelapse, Claymation, 3D animation and tracking, 3D printing etc. I also write for TV and privately on some short movies. \n\nI‘d love to connect to other people in Zurich doing similar. I never studied film, which is how I heard fellow creatives connect so I‘m trying it on reddit. \n\nIf anybody around Zurich wants to grab a coffee and talk filmmaking, shoot me a DM. ",
    "score": 189,
    "url": "https://reddit.com/r/videography/comments/1iegnj1/connecting_with_other_video_creatives_near_zurich/",
    "created_at": "2025-01-31T14:59:52.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1k5j5uz",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I feel a lot of shame being a PA/failed my PA career, anyone else?",
    "text": "Graduated college a bit later at 28, was very lucky to get on an indie feature shooting in my college town. Moved to nyc from there, have survived 3 years freelancing as a PA.\n\nI understand it’s an entry level position- to a point. Beyond doing a street lock up, you’re also doing a ton of complicated work for minimum wage.\nFeels like every production tries to squeeze more blood from the stone. \n\n\nI don’t think being a PA is good for me spiritually and emotionally. I hate that you are not really seen as part of the crew, but in service to the crew. Your lunch breaks are seen as optional. You have to take everything. You are rewarded for having no boundaries.  If I feel taken advantage of, but if you try to advocate whatsoever then you’re not called back for the next one. Or I become irritated because of all the little things added up over a career, all the times productions nickels and dimes. You see productions drop hundreds of dollars, you throw your day rate down the drain in boxes of coffee. \n\nIt’s hard for me to run around for 12 hours a day, stress dreams, while people are making 3-4x what I make and watching movies on the truck. These are skilled people, but I feel kinda skilled too. You couldn’t get someone off the street when you’re getting into key PA kind of stuff imo. Obviously I’m starting to become a bitter and resentful person. \n\nMaybe I’m too old for this game- if I was 24 and on my parents health insurance it would be a different story, maybe this would be cute. What’s done me in, \nIs on a non union commercial shoot, you’ll be in line for lunch, and they call last man. WHY? Fucking why? There is no union rules here. It feels fucking disrespectful. \n\nI’ve also failed bc I had no specific goal. I wanted to work in the film industry. I find everything interesting- art, lighting, sound. Do I want to live the life of a grip or whatever? I dunno. Maybe this is the end of the road for me.\n\nWhen people ask me what I do in film, I feel ashamed to say I’m a PA. I’m a stupid worker. I can work very, very hard, like a dog, but I never seem to move up in pay scale. If I was making $400/12 or more I’d be happy to do it. And I’ve not even worked for that many assholes. I dunno man. I’m just starting to find what I like, but I feel beaten down, I’m on like a hair trigger for production bs.\n\nAnyway thanks for listening to my vent. I honestly feel all filmmaking is exploitative due to the current PA system. I know it’s all going down the toilet anyway in the US. ",
    "score": 162,
    "url": "https://reddit.com/r/Filmmakers/comments/1k5j5uz/i_feel_a_lot_of_shame_being_a_pafailed_my_pa/",
    "created_at": "2025-04-22T22:13:08.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1npu6l5",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "How do you let go of a creative career in film hitting your 40s and move on?",
    "text": "I’m in my early 40s, and filmmaking has been my life. I went to grad school for it, moved to the USA to pursue it. For years I followed what seemed like the straightforward path: go to school, do the work, build a career. But for me, it never quite worked out — mainly because I never built the kind of network the industry really depends on, and because I moved around a lot (San Francisco → Los Angeles → San Francisco → New York). The pandemic didn’t help either. I have had the opportunities of great roles and experiences, but couldn't parlay into more opportunities. \n\nLately, I’ve found myself in a tough spot: being an overqualified 40-something doing entry-level jobs like assistant editing or additional editing. In other industries, there’s at least the sense that if you put in the hours, there’s momentum — your experience translates into upward mobility. In film (and maybe the arts more broadly), it often feels like an endless loop of starting over. That’s been making me question whether I can realistically build stability here.\n\nNow I’m at a point where financial survival is more important than creative persistence. I’m seriously considering leaving film behind and shifting into another field. One option I’m exploring is doing an MBA here in New York City as a way to transition into a non-creative, more stable career.\n\nSo my real question is: for those of you who’ve made a major career change in your 40s (especially leaving a creative field like film), how did you navigate it?\n\nHow did you deal with the identity shift and the leftover “pull” of artistic ambitions?\n\nHow did you find stability in a new, non-creative career?\n\nIf you pursued something structured like an MBA, how did that affect your trajectory? (full disclosure I'm considering it now and the advisors of the college I reached out to say it's a great idea but sounds like \"pay that tuition and then you can figure it out\" which oddly reminds to of my MFA years... \n\nIf this resonates with you, I will so appreciate if you chine in with what helped you make peace with moving on?\n\nI’d appreciate any advice or stories. Thank you all so much. Carpe diem\n",
    "score": 134,
    "url": "https://reddit.com/r/Filmmakers/comments/1npu6l5/how_do_you_let_go_of_a_creative_career_in_film/",
    "created_at": "2025-09-25T01:39:19.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1m0uu75",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "There’s So Much Time Left",
    "text": "This may be kind of hippie-ish, but I just want to share a revelation I’ve had. Every day I look at this subreddit and there’s literal children acting like because they haven’t made their film by 18, or didn’t go to film school, or not instantly making their feature, that their filmmaking career is over. I also see a lot of folks more established in their lives losing sleep and more over not making enough, or being successful enough, or not getting into the right festivals.\n\nI’m 23, and I just finished my third festival short, and it just played at a block in my state. It’s only been in two festivals (the second it’s playing at is this Friday in Wisconsin, but I can’t afford the flight). I genuinely went into it thinking I would make something that would propel me into traveling the nation or preparing for my first feature by 25 by now. That didn’t happen. I’m sure that never really happens.\n\nI was in a panel with people in their sixties who grabbed a camera to make a short, some people younger than me who finished their college projects and submitted them, and then folks in their 30s making higher budgeted shorts. Regardless of the final film, I felt I have so much more in common with people making this for the joy than an Orson Welles type or A24’s steadily aging youngest filmmaker ever. This feeling is compounded by a panel I did earlier in the year, where I was asked to speak to the microbudget filmmaking experience. I’ve never made a short for over 7,000, and even then, I know that’s a lot of money to raise. But I know how to make it for less and less.\n\nI know this is a ramble, but I wanted to know what’s helped to keep y’all making films. Is it the dream of success, because right now the joy of filmmaking is keeping me going. My short is a thriller, and I got a huge gasp from the crowd near the climax. That helped me see how much I’ve grown as a director already, and if I’m doing that by 23, I’m excited for all the time I have ahead to get better and better.",
    "score": 117,
    "url": "https://reddit.com/r/Filmmakers/comments/1m0uu75/theres_so_much_time_left/",
    "created_at": "2025-07-15T21:46:49.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1kclcj7",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Filmmakers who left the industry: Where did you go next?",
    "text": "TL;DR - I'm tired of working in film but feel like I have nowhere else to go. Anyone have any experience/ideas?\n\nFull Story:\n\nI worked in the film industry (proper) for about a decade and I'm the type of crazy where I honestly loved every second of it - late nights, lack of sleep, dangerous levels of hubris - all of it. Then I had kids and decided I'd rather be around for them than have all that fun so I took a day job. I'm a \"creative director\" at a shitty little commercial agency (in quotes because in this role there is very little creativity and a lot of run and gun bullshit). On paper it's a pretty good gig. Pay is about half what it would be at a real agency, bosses are shit, work is unfulfilling but whatever, at least I know where my next check is coming from. I've looked at it as resume building if nothing else.\n\nI'm so tired of it though. Being a creative for a career is fucking exhausting. At this point in my life I'd so much rather do something that I don't care about but pays well so I can spend my time with my family and spend my creative energy on my own shit on my own time.\n\nBut where the fuck does someone like me go? I have no actionable skills outside of this work. I have a visual communication degree (lol). I don't have the time or money to go back to school. My only resume entries outside of the industry are service jobs. In some ways I know that I'm lucky but I feel miserable and incredibly stuck.\n\nIs there anyone out there that has successfully transitioned away from the industry smoothly and happily? If so, where did you go, what do you do?",
    "score": 105,
    "url": "https://reddit.com/r/Filmmakers/comments/1kclcj7/filmmakers_who_left_the_industry_where_did_you_go/",
    "created_at": "2025-05-01T22:20:01.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1l2ltht",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I PA’d for free to network, but now they’re asking for my photography work too—how should I handle this?",
    "text": "Hey everyone, looking for some honest feedback here from folks who’ve been around the indie film/photography world.\n\nI just moved to LA and worked as a free Camera PA for a 3-day short film shoot (Sat–Mon, 5/24–5/26) to start making connections. A friend introduced me to the DP and said this is how he got his start, so I went for it.\n\nThe shoot days were long (7:30am–8:30pm or later), and I worked hard—staying on top of gear, helping the DP, Director, 1st and 2nd ACs, doing everything I could to be helpful and positive. No pay, but I saw it as an investment.\n\nAt the end of Day 1, the director asked if I’d bring my stills camera to shoot a poster for the film. Sounded simple—I said sure. They’d already be lighting and directing the actors, so I just needed to shoot some frames and hand off the RAWs. He also asked me to get some BTS shots.\n\nSo Day 2 and 3, I showed up with my camera gear, continued Cam PAing, shot BTS in between tasks, and on Day 3 even started slating all day for the 2nd AC. It was a lot—I was juggling multiple roles.\n\nAfter wrap, I asked for a Google Drive link to upload the RAW poster shots and BTS. A few days later, the producer asked for the BTS by Monday (6/2). I replied that I could send the RAWs for the poster by then, but the BTS would take a little longer—I’d planned to edit them in Lightroom and had paying client work that weekend. They said no problem, totally understood.\n\nThen today, I got another text asking for a timeline on the BTS again, as they’re scheduling an IG post.\n\nHere’s where I’m conflicted:\n\n\t•\tI was the only crew member who wasn’t paid—everyone else was union.\n\n\t•\tI gave them 3 full days + overtime of labor for free (saving them ~$1,100).\n\n\t•\tI also shot BTS + poster stills on my own kit, Canon R6MKII, EF 24-70 2.8, EF 16-35 2.8, black pro mist filter (which I’d usually charge $450–$600 for).\n\n\t•\tNow they’re politely nudging for deliverables, but I am trying to politely explain that I’m doing this as a favor to them, and can’t prioritize them over my actual paying clients. \n\nI really liked the crew. They were all kind, and I want to stay on good terms. But I also don’t want to start my LA career by undervaluing my skills and setting the precedent that I’ll do pro work for free. Especially urgently, when I have an actual job. \n\nHow would you respond in this situation? Has anyone else been here? I just want to politely establish that I can’t rush their photos over my actual paying clients. \n\nEDIT: \n\nThank you so much, everyone, for your insights. \n\nMy conclusion is: the time to discuss money/licensing/usage was the moment the director asked me to bring my kit and shoot. I missed the boat, and it is my responsibility now to respect that. I am going to politely explain I am booked with clients now, and tell them I will have their deliverables in their Google drive by next Monday. \n\nLessons learned!",
    "score": 103,
    "url": "https://reddit.com/r/Filmmakers/comments/1l2ltht/i_pad_for_free_to_network_but_now_theyre_asking/",
    "created_at": "2025-06-03T20:04:01.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1ijsox1",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Just spent an hour filling out the My First Job in Film profile… I can’t apply for any jobs without paying??",
    "text": "Has anyone got anything worthwhile off My First Job in Film? Is it really worth spending £240 over a year to just apply to jobs?",
    "score": 99,
    "url": "https://reddit.com/r/Filmmakers/comments/1ijsox1/just_spent_an_hour_filling_out_the_my_first_job/",
    "created_at": "2025-02-07T11:14:50.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1lxprzn",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Is this what working in the film/TV industry is really like? Overworked and exploited?",
    "text": "Im 18 and i can confidently say for myself that i have a pretty good resume so far. For the past 3 weeks, I've started working in a TV channel, one of the biggest ones in Greece. And at first I considered myself very VERY lucky.\n\nHowever, (I'll get to the point tho right away) the working is HORRIBLE. I was suppose to start working at the start of the month, but they called me in a week before and told me to get some videos to edit just to start off and learn how they operate there. I was like \"sure\" and in my mind I thought it would be for this day only. But nope I worked the whole week. UNPAID WORK. Full hours AND EXTRA. But I was like \"you get something you lose something, its ok\".\n\nThen, I started working there. And I kid you not, from day one, I have worked 10 to 11 hours. PER DAY. 2-3 unpaid extra hours. And not only that, but they've given me work for the weekends AS FUCKING WELL. Not by choice, but because there was a schedule we had to commit to and finish specific amounts of videos a day.\n\nYesterday, I went there, did my work easily, and I had to leave at 6 specifically that day because we made plans with my friends, and I let my boss know from the beginning. At 5pm tho, i got assigned... 5 more videos... (in total one video takes me about 1 hour to make). I told them i dont have time today, and they told me that i could take them home and finish them, and also having told me that ill need to work on Sunday too from home.\n\nIm about to crush out. Im about to cry. And you wanna know the best part? FOR MINIMUM FUCKING WAGE. Nobody informed me about these work hours btw.\n\nHowever, having this TV channel in my biography, and in my career, could be a very good thing in the future. And I have to prove to my dad that I am worthy and will work hard in my life, so he could fund my studying abroad, so I could maybe find work in another country one day. But also having both my parents be proud of me and not having a failure on who quit after 2 weeks.\n\nIs the industry really like that? Is it always like that?",
    "score": 99,
    "url": "https://reddit.com/r/Filmmakers/comments/1lxprzn/is_this_what_working_in_the_filmtv_industry_is/",
    "created_at": "2025-07-12T02:51:13.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1il27kp",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Shot my first feature on an iPhone and now it's on streaming!",
    "text": "I grew up drag racing and in High School raced at Englishtown Raceway park in New Jersey. I was never into filmmaking, I was actually a musician my whole life but when I got my first iPhone I thought this could be a great tool to get this script off my chest. It's called ***Sunday Sunday Sunday*** and I wrote it because it came to me, not because I had any aspirations to be a filmmaker and had no clue what to do with it when I was done. The iPhone was a great learning experience for me, and it taught me a lot of the principles of photography and how to tell a story.\n\nWe had no car in the film after 1975 giving it a period feel without ever getting into when this takes place. With friends, family, a car and a few bucks I socked away we went off on a journey to make this movie. We did pretty well in the film festival circuit taking home 14 wins out of 24 nominations. I would have been happy just getting accepted to one. I wound up getting to go to London which was so incredible, having my film going up against companies like Porche, Lamborghini, and some other big money companies.We didn't win but what a way to really get started.\n\nI used filmic pro to capture everything. It was an amazing extension to what the camera was already capable of and I just started using the black magic version for the sequel we're doing now. Just this year I submitted to FilmHub for distribution and now it's on streaming which is a real trip. It's nice that people can find my work pretty easily and share all the hard work that went into it. It isn't a perfect representation of what I had in my head, but I wouldn't change anything because I walked away with a lot of experience and knowledge I bring with me to my professional career. If you'd like to check it out and shoot me some feedback I'm always open. If you had any questions about the process or anything I'm always happy to help filmmakers who are trying to get that first project off the ground. I know how hard it is, there are more opportunities to give up than there are to keep going usually, but friction starts fires. Thank you for having me in the group. I am already super inspired and learning a lot from all of you.\n\nCurious, I'm working on a sequel and was wondering if any of you have seen any other movies recently shot on an iPhone. I know the new 28 years later was and I'm super excited about that, but I love seeing who else is out there making features on their phones.\n\n[Sunday Sunday Sunday Trailer](https://reddit.com/link/1il27kp/video/z1gsqfb8h0ie1/player)\n\n[https://www.primevideo.com/detail/Sunday-Sunday-Sunday/0G09UHF7O8OGF5FR3KNFX8W5AH](https://www.primevideo.com/detail/Sunday-Sunday-Sunday/0G09UHF7O8OGF5FR3KNFX8W5AH)\n\n  \nWe also did a little Making of! [https://www.youtube.com/watch?v=fGDcM7Gktz8&amp;t=1s](https://www.youtube.com/watch?v=fGDcM7Gktz8&amp;t=1s)",
    "score": 96,
    "url": "https://reddit.com/r/Filmmakers/comments/1il27kp/shot_my_first_feature_on_an_iphone_and_now_its_on/",
    "created_at": "2025-02-09T00:33:58.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1mogbbo",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Rejected from all the major festivals but received a handful of smaller accolades with our Original TV Pilot",
    "text": "I’ve been trying to develop a TV series like this since 2019 \n\nTitle: The Podcast \n\nThe TV Show about two best friends with a terrible podcast. \n\nBrief:  In the aftermath of their first podcast recording - best friends, Nick &amp; Garrett, try to make the most out of getting canceled. While their relationships and careers are at stake, the Podcast could be their ticket to fame. \n\n  \nMe and my writing partner/co-star have been drawn to sitcoms our whole lives. I’ve been working on this Gen Z adulthood, internet satire type of sitcom for a number of years before I eventually got to this format. It’s a fun dynamic because their podcast is a really bad podcast, but it continues to gain popularity by people either loving or getting offended by their crude humor and hot takes. Despite its unhinged humor, The Podcast has a feel good message, emphasizing that being yourself is the best way to achieve success. We have 6 episodes written and ready to shoot for a full season.\n\nFull TV Pilot Link: [https://www.youtube.com/watch?v=qBzAaNQWBlI](https://www.youtube.com/watch?v=qBzAaNQWBlI) ",
    "score": 93,
    "url": "https://reddit.com/r/Filmmakers/comments/1mogbbo/rejected_from_all_the_major_festivals_but/",
    "created_at": "2025-08-12T18:12:46.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1m08314",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "For anyone who works full time as a videographer at an agency or corporate employer what is you annual salary from said employer? Not including freelance work or second jobs.",
    "text": "As a freelancer in the Midwest myself I've worked with a number of extremely talented videographers with 10+ years experience, who are paid anywhere between 45k-70k/yr and worked to the point of burnout. Working well over 45 hour weeks, and often traveling and working on weekends. Their boss puts up a huge fight anytime someone asks for a raise. I mentioned to their boss Google says the average is 73k and they said that is unrealistic. However this same company recently offered me 90k which I turned down because I prefer my independence as a freelancer. The contradictions are concerning and so I'm making this post to hopefully get better data, and help anyone else who is trying to advocate for their own position.",
    "score": 85,
    "url": "https://reddit.com/r/videography/comments/1m08314/for_anyone_who_works_full_time_as_a_videographer/",
    "created_at": "2025-07-15T04:11:29.000Z",
    "num_comments": 167
  },
  {
    "id": "reddit-1iegqr7",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Connecting with fellow video creatives in Zurich",
    "text": "I‘m Kaitek, a Zurich based videographer. \n\nMy career has too many ADHD detours to list, but I ended up in a place I really like: Working freelance on TV episodes, documentaries, corporate stuff and operating live cameras. My approach is multimedial, using different techniques like Macro, Timelapse, Claymation, 3D animation and tracking, 3D printing etc. I also write for TV and privately on some short movies. \n\nI‘d love to connect to other people in Zurich doing something similar. I never studied film (where people also connect) so I‘m trying it on reddit. \n\nIf anybody around Zurich wants to grab a coffee and talk filmmaking, shoot me a DM. ",
    "score": 84,
    "url": "https://reddit.com/r/Filmmakers/comments/1iegqr7/connecting_with_fellow_video_creatives_in_zurich/",
    "created_at": "2025-01-31T15:03:41.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1p8mwx0",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I've been working in the industry for five years, yet I still haven't had a single year where I've made more than $23K",
    "text": "Yep. Everyone talks about how all you need is to be patient, work your hardest anyway, keep moving forward, network at events, learn new skills possibly, so on and so forth. But from my experience as a 1st AC, 2nd AC, and data wrangler, nothing has ever truly lead to anything substantial and sustainable enough. Nearly every connection ends with me hearing, “I’ll keep you in mind,” (if I'm lucky enough to not be ghosted) only to never hear back.\n\n**October 2019** began with me freelancing for a Philly rental house, which lead to some local PA work. I never went to film school, but this felt like a good start.\n\n**2020** felt like a non-existent work year for obvious reasons; whatever I had going on came to a halt in March, then slightly picked up with some PA gigs from September to November.\n\n**2021** was an improvement in terms of getting more PA, and eventual AC work. Staff Me Up came in good use (I was never recommended via word-of-mouth, as it’s still mostly the same way today), but work was still too sporadic and piecemeal. \n\n**2022** was easily the most eventful and busy. Despite how I was still a sporadic day-player that pulled in less than $22K since my work nearly flatlined during some months, I gained a lot more experience as an AC and data wrangler. \n\n**2023** had me waiting until May for things to fully pick up. I was *extremely* fortunate to get recommended as a data wrangler on a reality show for about a month and a half (my first and only long-term gig), but afterwards, the second half of the year was mostly a drag. Of course, the whole industry sank quite a bit this year, so I didn't think my circumstance was that unique.\n\n**2024** was still too slow despite some really good months, as I eventually started full-timing at a rental house near DC to spare me from the under-employed stress that freelancing has been for me.\n\n**2025...** after almost a year of working at that rental house, they let me go in September due to financial cutbacks from a lack of revenue. Granted, regardless how it was only $20 an hour (I still picked up some gigs here and there on the side to help), this was the most economically stable year I've had in my whole career. The gigs I secured in October left me with about $1,500, and I'll likely be leaving this month with $600 from the only gig I could find.\n\nI don't want to be someone who just sits around and rants on Reddit, or to come off as someone who doesn’t like working in this business, but fuck... I'm 27 years old, I'm back to living with my family for support, the most stable work I've had so far in this industry still didn't even amount to $20K after tax by the time it was September, and despite gaining more connections and knowing so many people that work in the industry from this last job (and just from being on set so much before that), I'm still just as under-employed as I was before as a freelancer. By the time this year ends, I'd be surprised if I made more that $23K after tax (especially since my rental house hours were cut down for the first three months from a slow season). As much as I usually enjoy the work itself, financially speaking, my career has been a mess.\n\nIt's like these past five years haven't amounted to anything. \n\nI feel like I've done everything I'm supposed to do in terms of networking, yet it usually just doesn't work outside of maybe getting me some low-or-no-paying passion project gigs; I love being able to take them, but I can’t live off of those alone. Maybe I'm never truly at the right place at the right time I guess (not to mention how I almost never get the chance to work locally, or with local crews). For the record, I primarily work within unscripted tv.\n\nIs the industry still just in a bit of a lull right now, or do I just exhibit a case of some pretty bad luck?",
    "score": 80,
    "url": "https://reddit.com/r/Filmmakers/comments/1p8mwx0/ive_been_working_in_the_industry_for_five_years/",
    "created_at": "2025-11-28T05:34:19.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1o1hvay",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Can't think of anything witty, just tired of job listings like this",
    "text": "Photographer/Videographer &amp; Social Media Content Creator in the title and then bam, hope you can organize events with booze too for an insultingly low salary!",
    "score": 77,
    "url": "https://reddit.com/r/videography/comments/1o1hvay/cant_think_of_anything_witty_just_tired_of_job/",
    "created_at": "2025-10-08T18:00:39.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1hycp54",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Client asked for their footage six months after I sent a delivery link. Problem is I cleared out that Dropbox space four months after the shoot.",
    "text": "This gig came in super last minute - got the call the day of an event to film and deliver footage. No edit. No paperwork. We had a quick phone call and I went that evening to shoot the event. Sent a delivery link the next day, client was happy with it.\n\nFour months later, I'm clearing out Dropbox space and deleted that footage along with a few other old projects. I had assumed the client had taken possession of the footage.\n\nYesterday, six months after the shoot, I got a text from the client who was wondering where the footage was. Now I usually back stuff up on my server and hold it long term but this one went straight to dropbox for delivery because of how fast everything was moving. I think if I had realized that when I was clearing out dropbox space I would have held onto it.\n\nI just sent my reply a few minutes ago. Don't know now it'll play out but I wouldn't be surprised if it gets ugly. The lack of paperwork is my saving grace I think but I'm also disappointed in myself for not checking with them before clearing out that space, even though it was four months after delivery. I'm used to working with agencies who take possession right away. And I'm disappointed in myself for not backing that footage up on my server which has plenty of space. I was prepping for a large multi-day shoot happening the next morning so I loaded it to dropbox and that was it.\n\nAnyway, TBD how it shakes out but wanted to get that off my chest. I don't think I've lost client footage before in my 13 year career and it doesn't feel good.",
    "score": 72,
    "url": "https://reddit.com/r/videography/comments/1hycp54/client_asked_for_their_footage_six_months_after_i/",
    "created_at": "2025-01-10T19:30:26.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1p95y6i",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Production costs for big TV shows",
    "text": "I finally started watching Severence and stumbled across an article stating that the first season cost $20 million per episode.\n\n[https://www.hollywoodreporter.com/tv/tv-features/ben-stiller-severance-apple-filmmaking-parents-documentary-1236126909/](https://www.hollywoodreporter.com/tv/tv-features/ben-stiller-severance-apple-filmmaking-parents-documentary-1236126909/)\n\nHow?\n\nIt seems like fairly minimal sets.  I assume minimal VFX.  Is like 90% of the cost actor/writer/director salaries or what?\n\nEdit: Follow up question: is $20mil an episode high?  \n\nOr: Is it obvious to you where the money went?",
    "score": 69,
    "url": "https://reddit.com/r/Filmmakers/comments/1p95y6i/production_costs_for_big_tv_shows/",
    "created_at": "2025-11-28T20:59:01.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1nceax6",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Career Change",
    "text": "Hey guys,\n\n  \nI've been a videographer/video editor, jack of all trades (you know how it is) guy for the last 10 years. I studied film and media and have had a relatively successful career which has taken me to some amazing places and experienced some pretty cool things. \n\nOver the last few years I've been feeling really dissatisfied with my career, I'm not shooting the stuff I want to shoot anymore because the opportunities seem to have dried up, it feels like I'm only working on corporate videos and social first content which I hate. \n\nI'm really considering a career change, I'm in my early thirties but I figure if I'm ever going to do it, it has to be now. I've really explored a lot of avenues with videography but can't seem to find the work that makes me excited anymore, and when I think about the long term sustainability of a career in videography as a generalist, I worry about the job security and financial security with little to no career direction, or monetary benefits unless you're a freelance specialist. \n\nMy main question, is if you have swapped careers from video, what did you go into, and what were some of the interchangeable skills you brought over from your career? I would like all of my experience to not go to waste. \n\n  \nCheers!\n\n",
    "score": 62,
    "url": "https://reddit.com/r/videography/comments/1nceax6/career_change/",
    "created_at": "2025-09-09T09:31:46.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1phyel4",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Biggest client will create a in-house videographe and photographer position",
    "text": "My biggest client will soon create a in-house videographer and photographer position. It will likely be custom made for me and they will probably offer it to me on a silver plate.\n\nIt is a unionised place, so there is a rigid pascale. But because they have been my client for the past 12 years,  I would enter the position at the top salary (about 120k).\n\nConditions are good: insurance, pension plan, lots of vacations (5 weekd I think), and the possibility to cumulate 1,5x times if I work on weekends or evenings.\n\nIn the past year, I've billed this client around 100k. My gross income was about 300k (210k after expenses, but before taxes). So this client is around 45% of my  income.\n\nI love this client, the company,  the mission of the company, the team over there is great, I get along with them.\n\nIt would maybe be nice to just be an employee for once and not have the mental load of entrepreneurship.\n\nOn the other hand, it would mean a 45% pay decrease, since my salary is about 210k per year now (120k salary and 90k profit stating in the company).\n\nAlso, I don't know yet if they would like to lease my gear on tio of that. Because in order to have the same quality of videos,  the other solution would be for them to buy 90k worth of gear. Selling them my gear would be out of the question, since I want to keep it for personnal use , or occasional weekend contracts .\n\nNow thay i have kids i wanted to slow down anyway. But it seems like a big leep for me, because I've never have any boss since my student jobs, 15 years ago.\n\nAlso, if I refuse, it would make a big hole in my revenus. I would have to find new clients, but I doubt I would quickly find enough new clients to fill this 100k billable gap...\n\nAnyhow, I just wanted to hear you guys on the subject. Anybody got hired by their biggest client here? Did you regret it?\n\nAlso I'm in Canada.\n\nEdit : clarified income, gross and after expenses.",
    "score": 61,
    "url": "https://reddit.com/r/videography/comments/1phyel4/biggest_client_will_create_a_inhouse_videographe/",
    "created_at": "2025-12-09T04:30:49.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1l3s6cq",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "I cracked from a gig a few days ago and don't know if I suck or they do.",
    "text": "I just had what have felt like the roughest days of my career, and I'm questioning how much of it was that too much was demanded and how much of it is that I just suck. I basically worked most of 36 hours straight aside from short breaks and a 1.5 hour nap, had a day off, then worked 15 hours with short breaks. \n\n\nLong story short, I was given footage and audio tracks (plus disorganized and unlinked project files and assets) for a 1 hour vodcast to edit, with a deadline to publish 36 hours away. It took me the better part of the first 4 hours to acquire and link up the template's assets and manually sync up the new episode's tracks after Premiere kept refusing to synchronize several of them. Some of the cameras also stopped/started again mid-shoot. \n\n\nThen it took me about 10 hours to edit this thing down for cutting between speakers, trimming segments, removing filler words and flubs, pauses, disabling audio tracks when they're not talking, trying to clear up the audio and balance the levels... maybe this is a really long time to do that for a podcast - I think part of it was this being a new unfamiliar project, and toward the end realizing I could work a little faster just reading the transcript and looking at the waveforms to make my cuts. \n\n\nIt takes me 2.5 hours to export and upload to my producer a first cut, and an initial glance showed me I had an hour-long file and I played the vid for a few seconds - but there was an encoding hiccup and it was actually playing only about 20 minutes. 2.5 hours later, I deliver an uncorrupted first draft. \n\n\nBy this point I'd been awake for almost 24 hours working on this video, with about 4 hours of breaks in between. The video was due in 12 hours, and I let my producer know how long I had been working and and awake for, and that I was a little nervous how extensive notes might be with the deadline getting closer and me running on fumes. He told me if I wanted to nap then I should, but the deadline was firm. I said I'd rest for 90 minutes while he reviewed the first cut and left notes.\n\nNapped, woke up, got my notes, made my edits and I had a second draft to send after 2 hours. 2.5 more hours to export and upload. Producer says I made another mistake. In the first second of the video, a random one-word \"the\" subtitle flashes for a few frames on the bottom for the screen. I missed it before uploading because it was under my player head when I started the vid. He can't trim on his end because it will degrade the resolution, so I make the quick fix and spend another 2.5 hours uploading. Finally hand off a third draft without issues, after about 36 hours with several hours total of breaks and a nap.\n\nI worked on one more episode the next day which needed to be published in 14 hours, and while I worked faster this time now that it was more familiar to me, it took almost the whole 14 hours. I'd made a mistake in my second export again, this time repeating a 5-second clip mid-way in the episode (mistake I made while making a different fix), and had to reexport and re-upload. I'd watched through this podcast TWICE while it uploaded to try to spot a mistake, but I missed it because I'd been working with the video for so long. I was trying to spot audio hiccups and didn't notice a few sentences get repeated halfway through the video. \n\nI forgot to mention I also edited audio versions of the podcast, usually after getting a final cut of the video done, I'd export the audio, upload to a site using AI to remove more filler words, go through to make sure nothing sounds weird after doing that, and then export and deliver that.\n\n\nThe stress from this was so much that I cried both nights after finishing the projects before going to sleep - like, sleep deprivation and exhaustion crying. It didnt help that my producer called or texted me almost hourly wanting an update on how it was going. It's taken me days to unwind and release some of the adrenaline. I have been editing for 15 years, 8 professionally, and haven't had such an exhausting few days of work before. And given how tight the deadlines were and the producers expectations, I can't help but feel like maybe I just suck and this should've taken someone better a far more sustainable amount of time. \n\n\nIs 14 hours or even 36 hours plenty of time to turn around vodcasts from recording to publishing? Is it particularly tight? Are some small mistakes ever permissible if there's only so much time to edit and review before publishing? Do I suck?",
    "score": 51,
    "url": "https://reddit.com/r/videography/comments/1l3s6cq/i_cracked_from_a_gig_a_few_days_ago_and_dont_know/",
    "created_at": "2025-06-05T06:25:15.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1ocv63k",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "How do I actually make it as a videographer I’m trying my hardest but keep running into clients who don’t want to pay",
    "text": "Hey everyone,\nI’m really trying to figure out how to make it as a videographer. I put my work out consistently, I have a Sony FX6, and I’m giving this everything I have. I know I’m still a beginner, but I want to live off my work and build a real career creating social media marketing videos and ads for clients.\n\nMost of the clients I find just want meme style content, which is fine. I can take a concept that already exists and put my own spin on it to keep their pages active. I know how to make basic short ads. My audio still needs work, but I’m improving and I care about what I create.\n\nThe hardest part is finding clients who actually pay. I keep running into people who want free work or promise exposure instead of payment. I can’t eat exposure. I’m trying to survive off my craft and build something real.\n\nI’m based in the DMV area. If anyone knows of any internships, mentorships, or teams looking for a second camera or someone willing to learn, please let me know. I’m serious about learning and working. I just need an opportunity to grow under people who are already doing this full time.\n\nI have about two months left to figure things out before things get difficult. My support system is moving out of the country, and if I can’t make this work, my options are to move back to Michigan or live out of my car. I’m choosing the latter because I would rather chase this dream than quit on it.\n\nI know I’m not the best, but I’m not the worst either. I want to do this for the rest of my life. I want to film commercials, tell stories for brands, and build a real production company.\n\nI guess I’m asking for advice from people who have been here. Do most videographers film every day, even without clients? Should I be creating constantly? What do I need to do to get to the next level?\n\nAny advice or feedback is appreciated.\nThank you for reading.\n\n— Jaylem | A Dreamer Production",
    "score": 51,
    "url": "https://reddit.com/r/videography/comments/1ocv63k/how_do_i_actually_make_it_as_a_videographer_im/",
    "created_at": "2025-10-22T01:30:01.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1lvn6y8",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Just got fired from my job",
    "text": "Just got notice that my contract job is ending next week. I was doing social media/content work for an automotive group, and while it was short-term, it gave me solid experience and added some great stuff to my portfolio.\n\nI’m at a bit of a crossroads now. Part of me is tempted to find something similar right away—keep building on what I’ve done, especially since I already have a foundation and work I can show.\n\nBut another part of me wonders if I should take this chance to pivot and try something completely different—something more stable, or maybe even more creative. I’m still pretty early in my career and don’t want to get stuck chasing the same kind of roles just because it’s what I started with.\n\nAnyone else been in a similar spot? Did you stay in your lane or take the risk and go a different direction? Worth it either way?\n\nWould really appreciate any advice or perspective.",
    "score": 50,
    "url": "https://reddit.com/r/videography/comments/1lvn6y8/just_got_fired_from_my_job/",
    "created_at": "2025-07-09T16:26:27.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1nur0ir",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Lasers: A guide for photographers and videographers by a laser tech.",
    "text": "This is mostly focused on concerts, clubs, etc, as that's where you'll likely encounter lasers - anything \"EDM\" and you'll almost certainly encounter some.\n\nI'll start with some quick takeaway points for those in a hurry, but there's a lot of info here, so feel free to read at your own pace. If you get to the bottom of this without falling asleep, maybe consider a career in lasering :P\n\nAny questions on what I've said or omitted, feel free to leave them below and I'll answer best I can. Hope this helps :D\n\n----------\n\ntl;dr - if you take away anything please remember this:\n\n- **Lasers can and will fry your camera's sensors, as well as your eyes if they aren't treated with respect by everyone involved** - from the performers, to the laser tech, to you. However, with some preparation, communication, and common sense, they are perfectly safe to work around.\n\n- **Try to observe the lasers for a little before starting shooting if you can.** This might be during an opener, or ideally before doors open. As much as I wish every laser tech was competent and operated everything safely, some are not that smart. If you're there early, ask the tech if they're happy to turn the lasers on so you can have a look and ask yourself: \"Where in the room are the lasers coming from? Will they hit the audience areas? Will they hit where I might shoot from?\"\n\n- Talk to the laser tech if they've got a minute! Just ask \"Are you crowd scanning tonight? Is there anywhere I shouldn't go with my camera so it doesn't get hit?\", and \"anything else I should know?\". Thank them afterwards, too. Technicians never have enought time on their hands-\n\n- If it's a \"party\" laser with no dedicated operator (or a lighting technician as an operator rather than a trained laser technician) or that the promoter has installed themselves in a smaller venue, then err on the side of caution and assume it's dangerous. It might stray into audience areas, or places you don't expect it to. If you've watched it's behaviour for a while, and can see it's well above the audience when it's projecting, you should be fine, but just be ready to change that judgement on a moment's notice.\n\n- **An ND filter will not save your camera.** No filters will save your camera from direct hit from a class 4 laser.\n\n----------\n\nLet's start from first principles:\n*How does a laser damage things?*\n\n\nYou hopefully remember from high school physics that all light is a form of energy. The difference between lasers and regular lights are that lasers concentrate all of their light energy into a tiny area, whereas regular lights spread their light energy out over a much larger area. This is what makes them so dangerous.\n\nThe analogy I like to use to explain this is that lasers operate in the same way that pressure does. For example, hitting a plank of wood with a hammer might cause a small dent. Hitting a nail into the same plank will drive it through the wood. By concentrating the same force into a smaller area, more pressure is created.\n\nIn the same way, lasers concentrate light energy onto a small area and will only diffuse back out to a larger area over a very long distance. This is great, in that it lets us laserists shoot beams over the entire length of an arena and have them still look pencil thin, but it also means that there is potentially enough energy in that small area to burn things, such as surfaces, skin, eyes, or indeed camera sensors.\n\nAdditionaly, both our eyes and cameras have lenses that focus light onto a smaller area, which further increases the risk. Even though a laser hitting a surface may appear to not be causing any burns or damage, the focussing that a lens performs can concentrate the energy in that same beam enough to damage whatever is on the other side of the lens. In the case of the human eye, this can cause up to a 100,000 times increase in energy density.\n\nTo put this all into perspective, a standard laser pointer will operate at under 1mW (milliwatts, I'll explain in a moment!). A 100mW laser can cause damage to the human eye within an extremely short time frame... and most show lasers operate at anywhere from 1000mW to 100,000mW, depending on the size of the show. \n\n\n*Laser Classification (Classes)*\n\n\nLasers come in different \"classes\" that broadly define how dangerous they can be. These range from class 1, all the way up to class 4, where a higher class means a more hazardous laser exposure.\n\nProfessional show lasers are always class 4, but some smaller \"party\" units may come under other classes. Classification is based on a number of factors, but is primarily informed by the output power. This is usually measured in milliwatts (mW), but show lasers are often measured in whole watts (W) instead as they are able to output several thousand milliwatts.\n\nThe higher the class, the less time it will take for direct contact with a laser to cause damage, with class 1 lasers taking anywhere from a few minutes, to a class 4 laser taking microseconds of direct contact to cause damage.\n\nClass 2 lasers are 0-1mW present a risk of significant damaging a camera sensor. \nClass 3 lasers are 1-500mW present a risk of damaging your eyes or skin as well as a camera sensor. Class 3 is actually split into 3R and 3B, where 3R is 1-5mW and 3B is 5-500mW. Some smaller laser show projectors are class 3B, but these can still be dangerous\nClass 4 lasers are anything that outputs 500mW or above. These will, of course, fry camera sensors, or eyes, or quite frankly anything easily combustable they encounter!\n\n\n*What about different coloured lasers? Aren't different colours more powerful?*\n\n\nThere are a lot of interesting misconceptions about laser colours and how that affects safety.\n\nIn a typical diode laser projector, there are typically 3 smaller laser diodes fitted inside the projector housing: one for red, one for green, and one for blue.\nThis, as with pixel displays, allows for any colour to be mixed additively (in theory!).\nHowever, as our eyes are less sensitive to specific colours, the relationship between perceived brightness and energy output of the laser varies depending on the colour, among other factors.\n\nThis makes trying to guess whether a laser is hazardous based on the brightness of the beam extremely ineffective. For all intents and purposes, I would ignore colour and work off the class of the laser.\n\nUltimately, the sorts of wattages you'll encounter at concerts where there are dedicated laser operators will be high enough that the differences in wavelengths will be negligible - all of them can cause damage.\n\n\n*Should I never shoot around lasers then?*\n\n\nAll of that said, you can still shoot around lasers safely given a little forethought and communication. Because of all of the risks I have just mentioned (as well as other factors that are far too in-depth to talk about here), governements and health and safty regulators are (usually!) very strict about laser use. For example, in the USA laser show operation requires a type of license called a \"variance\", and in the UK there is an expectation of competence that is covered in legislation.\n\nOne key thing that qualified laser operators should be doing is ensuring that all laser beams are kept at least 3 meters above any ground the audience is stood on. If this is done, then you should be safe to shoot from pretty much any audience area. The rules on clearance over staff and performer areas are a little different however, so it's worth asking the laser technician where is safe to shoot from. If you're mounting any cameras above the audience in advance, try and talk to the laser tech before they start setting up and work with them to confirm that where you put them won't be in the way. They may be able to digitally mask a section out of the laser's projection area for you to put your camera safely.\n\nOne thing to be aware of is that there are ways for laser technicians to safely and legally fire beams into audience areas (called \"audience scanning\"). However, these require a lot of paperwork, pre-planning, and often a dedicated license, so if you're at a smaller show, you're almost certainly not going to get safe or legal crowd scanning occurring. If you do see beams hitting the audience at a small show, shut the cameras off, and go talk to the laser tech and ask if the audience scanning they're doing is safe for both your eyes and your cameras. If you're at all unsure that they're doing audience scanning safely, legally, and competently, pop the lens cap back on and get the hell out of there! Go talk to the promoter or whoever booked you and see if you can get the lasers looked into (the threat of bad crowd scanning blinding audience members will probably be enough to get them to go check with the laser tech!).\n\nIf you're at a bigger event or a festival, it's possible that there are lasers set up to safely crowd scan. It's worth checking with the stage manager about that if you've got time, the technician or on site safety inspector should be able to inform you about what is and isn't okay for that setup. \n\nAlso, as an aside, the laser technician should have an dedicated emergency stop at their operating position, as well as be able to see the surfaces the lasers hit. The technician should also not fall asleep or get blackout drunk on the job (I wish I wasn't speaking from experience dealing with another laser tech who did/did not do all of those 4!)\n\n\n*My videos of lasers don't look right! They're moving on the video when they look still in real life.*\n\n\nYou've just encountered laser banding (not to be confused with colour banding). If you've ever shot a video display and been able to see the display refreshing in the footage, it's basically the same principle. Laser projectors work by using a pair of mirrors to move (or \"scan\") the beam quickly enough to trick our eyes into seeing a shape, rather than a moving beam. However, the camera's shutter only expose light for a small segment of each frame's duration, so only a small number of the beam positions show up on the final frame. Try adjusting shutter speed and capture framerate until the banding clears up. If this comes at the cost of other aspects of the footage that are more important to you, feel free to scrap it though - most people don't pay much attention to the look of the lasers after the fact, just the general colour and the fact that they're there (though us laserists do appreciate good laser footage, so maybe get a couple of handheld clips of the lasers without the banding for our sake if you can ;) )\n\nOne nice upside laser banding is that it can look awesome if you're doing a dedicated shoot and working with a laser technician. Go see the video of Tom Scott stopping a laser beam midair or Childish Gambino's SNL performance of \"This is America\" for some examples of what I mean.\n\n*Further reading*\n\n- https://www.ilda.com/camera-sensor-damage.htm\n- https://en.wikipedia.org/wiki/Laser_safety\n- Anything from LVR optical, ILDA, or r/laserist",
    "score": 48,
    "url": "https://reddit.com/r/videography/comments/1nur0ir/lasers_a_guide_for_photographers_and/",
    "created_at": "2025-09-30T22:16:30.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1oy4uic",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Anyone else constantly have clients that think \"this job will be your big break\"?",
    "text": "Or anything along those lines. \n\nI have been doing video production for over 15 years. I have some internationally published work. I've worked with political leaders, CEOs, institutional presidents and so on. \n\nLike everyone working in solely media production, I am not rich. I mainly do documentary work as well, which doesn't necessarily mean material success at all. \n\nAnyway, I'm looking back at some of the conversations with some of the more interesting clients that I've had for documentary work, and it seems that one of the common themes is that they all think that they are giving me some big break. As if this career is an attempt at being a rockstar or millionaire or something.\n\n\"This will be really big for you\" or \"This will be a great opportunity for you\".\n\nIt was less annoying when I was 15-20 doing this, but in my 30s it's starting to piss me off lol. I have personally met some internationally famous, multi-decade-long-career, well renowned documentary filmmakers. None of them have anything more than middle class financial stability.\n\nAnyway; have any of you experienced this?",
    "score": 47,
    "url": "https://reddit.com/r/videography/comments/1oy4uic/anyone_else_constantly_have_clients_that_think/",
    "created_at": "2025-11-15T22:28:30.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1lvggl0",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "19 year old not in college, worried about videography not being a good career",
    "text": "I've been working on video projects here and there, I've made some music videos and weddings, but while I'm filming, I feel insanely stressed out. And I don't look forward to editing, but I really enjoy seeing a project come together. I love story telling and I'm working on a short film, but I feel burnt out on the videography side. I was planning on going to college for business and doing videography on the side, eventually hoping to make my own production company. But I feel like I have to sacrifice my enjoyment of filmmaking in order to make money off of it. I'd really appreciate some advice, thanks.",
    "score": 45,
    "url": "https://reddit.com/r/videography/comments/1lvggl0/19_year_old_not_in_college_worried_about/",
    "created_at": "2025-07-09T11:34:38.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1n862ta",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Anyone else get annoyed by people thinking career video is easy?",
    "text": "Cool video you shot, now do that same video but in a format that looks good on a screen bigger than your phone, edit it in less than a week and balance it with 10 other projects. Oh and let the final result be judged and adjusted by someone who isn’t you. Now do it again.\n\nIt’s like how people think they can do a better than a chef because they cook one meal in their home, while the chef is literally feeding people for several hours every day. \n\nEven films, we take a lot for granted but I’ve seen a lot of crappy budget films and a loooot of work goes into even the most popcorn films to be palatable. Yet you’ll get some tiktoker with a go mic in his hand bemoaning how bland cinematography is, but that same guy would probably blast a key light front on in a dark room and nothing else. \n\nAnyone that thinks this job is easy, hasn’t done it. It’s balance, it’s collaboration, it’s consistency. ",
    "score": 42,
    "url": "https://reddit.com/r/videography/comments/1n862ta/anyone_else_get_annoyed_by_people_thinking_career/",
    "created_at": "2025-09-04T10:05:18.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1icf56u",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "The industry is making me feel hopeless and depressed",
    "text": "I hope I'm not being inconvenient here with this venting, but after many years working in the industry (or trying to) I feel like there's little hope for a future.\n\nI started as a film critic in 2014 and in the next few years began to study filmmaking on my own while working for a YouTube Channel making video essays, writing and editing them. In the next years and ever since I've tried to break into the industry and failed to do so. My objective is to write and direct my own stories, but in the meantime, I've only managed to land shitty jobs: at advertising agencies as a videomaker, at production companies paying low wages and/or late wages, or in-office videomaker for companies. So far, the best job I had was working for Brazil's biggest TV network, though it paid the worst salary of my career and I got the boot three months later because of a layoff.\n\nI've written two feature-length screenplays, one of which only got into the top 10% of the Austin Film Festival but nothing more than that. Sometimes I feel like my work might be subpar but I never got honest portfolio feedback to know if I'm de facto a bad artist or if it's some imposter syndrome. After many years doing this routine, I moved from Brazil to Rome in search of better professional prospects because in my city there weren't a lot of things getting made and the ones that got were mostly by people with political connections who managed to get government money through shady means. I'm trying to get jobs as Video Maker or Video Editor on websites such as Glassdoor or LinkedIn but it's seemingly impossible. In less than a day there are over 100 candidates.\n\n  \ntl;dr: After almost ten years of investing in myself as a filmmaker, I've managed to get little results. I moved to another country in search of better prospects but I still feel my chances are slim despite loving what I do.",
    "score": 35,
    "url": "https://reddit.com/r/Filmmakers/comments/1icf56u/the_industry_is_making_me_feel_hopeless_and/",
    "created_at": "2025-01-28T23:05:13.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1ol2a4b",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "People who have made this their career, how often do you experience self-doubt?",
    "text": "It’s been on my mind a lot lately, I’m generally a pretty anxious person, but I’ve been lucky to work with bigger clients and get higher-quality jobs to the point where it’s my main source of income. I’ve worked hard, people seem to trust me and i’m pretty proud of myself, but I still get SO nervous when I deliver the first couple drafts. If the client takes a couple/few days to respond all I can think about is how much they hate it. (It rarely turns out this way)\n\nCan anyone else relate? ",
    "score": 29,
    "url": "https://reddit.com/r/videography/comments/1ol2a4b/people_who_have_made_this_their_career_how_often/",
    "created_at": "2025-10-31T18:24:42.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1pf38dd",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Should I quit videography?",
    "text": "Hi guys, title says it all, I‘m currently thinking about quitting videography and selling all my equipment, the reason being I can‘t make a living of it. I have done freelance since 2018 where I was in high school and started editing videos for E-sports players before going into full videography a few years later but it mostly was a side gig as I almost never made even a minimum wage type of salary neither with video editing nor videography despite my efforts…\n\nI recently thought about going all in on videography and made a portfolio with some of my work and started actively looking for salaried jobs as I’d prefer to work with a team I can grow with and having a fixed income while continuing to learn and gain experience. My dream is to work in sports, especially in F1 or combat sports, but I applied to every offers that were relevant to my skills (not only sports. Everything) and after a week, I still don‘t have any answer.\n\nWhile I know this is a short period of time, I think I‘m closing on 100 applications by now... I understand that this is a very competitive field but I am thinking that I actually suck ass and that it is the reason I don‘t succeed, especially when I compare myself with other videographers and look back on all those years strugling to make money.\n\nI would greatly appreciate it if you could review my portfolio and tell me what you think and how likely you think I could find a job. Please be as brutally honest as possible, I won‘t take it personnaly. I believe it’s not for everyone and I would accept it if that’s the case for me. I‘m still young and if I quit now, I‘m sure I‘ll find another area where I can be good at, but I have to take a decision.\n\nHere is my site: https://benbrechemier.com\n\nThank you so much for your help 🙏",
    "score": 27,
    "url": "https://reddit.com/r/videography/comments/1pf38dd/should_i_quit_videography/",
    "created_at": "2025-12-05T18:49:14.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1o5blft",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Can we have a thoughtful discussion about AI video and the future of our livelihoods?",
    "text": "For context I am 8 years deep in my video production career. I work full time + freelance on the weekends. I make a decent living. But now, I am rightfully terrified. \n\nSora 2 just came out and blew my mind. Google Veo 3 was kind of uncanny and meh, then Sora 2 started fooling people just about a week ago. I use these tools on a daily basis to make my own memes and funny BS, so I know it's limitations. But this is the worst it'll ever be. \n\nThe goal we have is to provide value with video. Selling a product, informing people, getting a message out. I feel like AI tools will get incredibly good at this with a couple of prompts.  \n\nCommon arguments for us being safe are:\n\n* *AI can't replicate a genuine story, there's documentaries and weddings that need to be filmed.*\n\nSo what will happen when everyone is forced to only do weddings and docs? The last bit of genuine, authentic content will be the scraps left over for us to compete over.\n\n* *Real people telling real stories need real videographers to document.*\n\nThese real people can upload their voice, their likeness, and a photo of themselves and instantly create a talking head video now. These tools will only evolve to get better.\n\n* *Product videos are safe. AI can't replicate a specific product and it's nuances yet.* \n\nYou say that now, but these AI tools are getting better by the day. Recall the immense jump from Veo 3 to Sora 2. Eventually we'll be able to upload a phone video of a product, showing what it does, then AI can make a polished product video good enough for Amazon.\n\n* *We have to adapt to survive. We have to use these AI tools for our advantage.*\n\nIt really, really, doesn't take a genius to write prompts. Maybe someone with years of video production experience can direct a AI tool a LITTLE bit better than the average joe, but that gap in knowledge can be filled fast.\n\n*   *X didn't take Y, so why should be afraid of AI?* \n\nThe classic argument. For ex: \"Cameras didn't make painting obselete, why would AI do that to video?\" Well when was the last time you heard of someone making a living from just painting? Like I said earlier, scraps to fight over like weddings and docs. \n\n* *People want to see genuine content. Not AI slop.*\n\nWe also have to remember that corporations DO NOT CARE if it means they save money. A video just has to be \"good enough\" to secure sales. AI video from Sora 2 is already good enough to fool even the chronically online folks. Imagine a couple of months from now when Sora 3 or Veo 4 comes out. \n\nI hope for thoughtful discussion. I admit that I am anxious, depressed, and sad that I worked my ass off to make it in this field of work, only for it to be devauled. I just want to be able to pay my bills. I feel like keeping up with all of this AI is the fastest I've ever had to move mentally, and it's getting draining. Why keep running like a headless chicken while trying to keep the same income? \n\nIs it time to find a new career? ",
    "score": 24,
    "url": "https://reddit.com/r/videography/comments/1o5blft/can_we_have_a_thoughtful_discussion_about_ai/",
    "created_at": "2025-10-13T05:49:21.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1motfc6",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "How can I improve the quality of my video marketing content without reshooting?",
    "text": "Hi all, so I run a small handmade jewelry business from the Oct. last year. and post videos on Instagram, TikTok, and occasionally YouTube.\n\nMy biggest struggle lately isn’t the ideas — I have plenty — but the fact that my videos sometimes look… dull? The lighting isn’t always perfect (I’m filming in my living room), and the colors just don’t pop the way I want them to, you know, those rocks are very beautiful actually.\n\nI know hiring a pro or renting a studio would help, but my budget’s tight right now. This is really the career I have always dreamed of, and I have been working so hard for it.\nAre there editing tricks or tools that can boost quality without having to reshoot everything? Ideally something I can do on my phone because I’m usually editing between orders.\n\nWould love to hear what’s been working for you!",
    "score": 18,
    "url": "https://reddit.com/r/videography/comments/1motfc6/how_can_i_improve_the_quality_of_my_video/",
    "created_at": "2025-08-13T03:13:19.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1k6s2q5",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Salary",
    "text": "Hi! \nso I'm getting into a pretty unusual job I guess but I'm working with a jewelry brand (20k) on ig, and they want me to become the creative lead of the brand and stay the main photographer/videographer, creative lead means that I plan the whole ig feed, the whole visual aspect the content ect ect. I bring the ideas and I shoot and edit them. It's a big job, the owner is pretty young she's like 27, what do you think is a respectable salary? How much should I make every month? \nConsidering there'll be let's say one whole shooting day every month (stills/vidoe/reels) not that precise about the quantity yet \nA creative strategy planning for the instagram feed and in general the whole visual aspect and language of the brand. \nSo to sum it up: 1. One whole shooting day every month\n2. Creative strategy for the brand on instagram and planning of shootings/ideas in general ect \n\nWould be really nice to get some tips and directions, this is like the worst part of being an adult for me lmao \n",
    "score": 17,
    "url": "https://reddit.com/r/videography/comments/1k6s2q5/salary/",
    "created_at": "2025-04-24T13:22:10.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1m8vdd5",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Competing against the in-housers &amp; entry levelers",
    "text": "Hi everyone. I’ve had two long term clients this month opt for in house video production rather than using me. For both I produced a range of stuff including social proof customer testimony videos for web and socials, other content for web and brand stories.\n\nThe quality was what you’d expect from someone in the game for around 15 years - for example for one of those clients some of it was used in a piece about them by a national broadcaster, so the quality is there.\n\nBut i kinda get their decision - they can have an in house person who they pay a salary too which is subsidised by grants here in the uk if done right, and they can be more reactive as on site. They flap a gimbal about and sure it’s not as good a quality but it’s fine - it gets the views and goes the way of most of the disposable media - goes down in the feed and is forgotten about.\n\nSure for a more important feature like a brand story the quality and strategy matters more, but they’re not as common projects.\n\nI can’t help but feel this is the way the industry is going - and if it’s not someone in house it’s someone offering to do it for cheap and will produce a ‘fine’ results.\n\nFor myself with the experience (and the gear), it feels either join them and go for quantity and not quality or expand to an agency chasing larger jobs which is a different ballgame altogether.\n\nDoes anyone feel themselves facing a similar conundrum and forming any gameplan?\nIt does seem to be there are big changes in the industry, are folks feeling this?\n\nThanks!\n",
    "score": 16,
    "url": "https://reddit.com/r/videography/comments/1m8vdd5/competing_against_the_inhousers_entry_levelers/",
    "created_at": "2025-07-25T10:14:28.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1jfp69c",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "What do Freelance Media Guys offer on Retainer over Full-Employment?",
    "text": "I've been asking this question for a long time, I even asked it here once, and no one answered me.\n\nI feel like businesses here in the UK are not looking for **video guys on retainers that much anymore**, at least for social content. They would rather spend that money on an **internal video guy** 5 days a week 11 months a year for £25k salary, and dump as much workload on them as possible to \"hypothetically get more out of them\".\n\nSmaller companies can't always afford an employee but they also probably can't afford much more than £300-£800 a month for a retainer. As soon as you start charging £1,200 a month you're basically optioning that business to look into part-time employment 2 days a week as an alternative option. (Employed PayE salary is not that much more expensive in the grand scheme of things for a business over a freelancer)\n\nUnless you are a large production company that offers more for the salary of £25k-£35k a year (more labor, equipment, liability, access to labour around the country, etc)\n\n**What do you as an individual offer to a business over the business just hiring someone full-time?**  \n",
    "score": 16,
    "url": "https://reddit.com/r/videography/comments/1jfp69c/what_do_freelance_media_guys_offer_on_retainer/",
    "created_at": "2025-03-20T13:41:40.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1ijv6ec",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Worklife after Film Production?",
    "text": "For those who have left the film industry what are you doing / how did you find a new passion?\n\n2019, 2021, and 2022 were the golden years for me. I made good money, was happy, and felt as if I was building a life that I loved. With the strike and slow down of work after, I'm not sure waiting around for gigs is very sustainable anymore, especially toying with the idea of starting a family.\n\nI have experience working on union shows in the camera department as well as a postproduction history in between my on set gigs. If I've learned anything the last two years it's that I do not like sitting behind a computer full time and I love being active and using my hands.\n\nI feel like I'm at a road block. After working on my resume, talking to a friend who is a vocational therapist, and applying for numerous salaried jobs around my city I have found myself with a part time gig making $15/hr with no benefits.\n\nWhere did you start to find what you're passionate about / how did you find your experience translated to other fields?",
    "score": 14,
    "url": "https://reddit.com/r/Filmmakers/comments/1ijv6ec/worklife_after_film_production/",
    "created_at": "2025-02-07T13:38:30.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1k7xk1i",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Intro to a documentary I’m working on as a high-schooler. Feedback?",
    "text": "The story is on a high school track coach who recently ran his 50,000th mile of his 40-year career. What do you feel when you see this? What can be improved?\nFilmed on Sony FX3, DJI Mini 4K, and Lumix GH6.",
    "score": 14,
    "url": "https://reddit.com/r/videography/comments/1k7xk1i/intro_to_a_documentary_im_working_on_as_a/",
    "created_at": "2025-04-25T22:19:34.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1pnd9rr",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Career Pivoting With a BA in Film?",
    "text": "I know it’s sad to see a “I’m selling out” post but shit is real. Life hits hard. \n\nI’ll keep it real - I graduated from Columbia College Chicago about 5 years ago with a BA in Film Production. After working on lots and lots of sets (big, small, union, indie) I realized it was NOT for me. \n\nSince then I’ve been coasting doing freelance and service industry by day but I’m at the point in my life where I’m running out of time to financially prepare for having a family/kids. \n\nHas anyone pivoted to different careers like Advertising or Marketing?\n\nI’m thinking of making a portfolio and applying to some internships to hopefully land a “stable” salaried job. ",
    "score": 13,
    "url": "https://reddit.com/r/Filmmakers/comments/1pnd9rr/career_pivoting_with_a_ba_in_film/",
    "created_at": "2025-12-15T17:24:22.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1pbqqs7",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Getting laid off",
    "text": "Hey everyone!\n\nI am getting laid off from my 9-5 job next month and would like some insight.\n\nI have been trying to figure out which path I want to go down now - I have always had a passion for videography and I've always been a creative thinker. I have about 12-15 months of savings that I can use as a runway to dive deep, learn and find clients. I already have a background in photography and have gained respect in that world but its only a hobby. I have some of the gear needed. I do want a new camera though and I want to get my part 107 for drone work as well. \n\nMy other option is going back to working a miserable 9-5 job that is stable but not what I want to do and not what I am passionate about.\n\nFor more background, i work in finance and im a mid level manager. I have always wanted to do my own thing. I know i dont want to be stuck in the 9-5 corporate rat race my entire life. I should have started this along time ago on the side but I got comfortable and here we are!\n\nI can also find a lower paying job or part time job and do videography on the side. The problem with this, is not being able to focus all my attention on my business.\n\nIm really just trying to figure out if I can actually turn my passion into a career within a small timeframe. Im not expecting much at first. Honestly not expecting much for a few months. I know it won't be easy. I know it's not stable. I know i will always be marketing myself. I know there are cons.. But I also know the cons of corporate life. \n\nAny insight, inspiration, thoughts would be greatly appreciated. Thank you! ",
    "score": 12,
    "url": "https://reddit.com/r/videography/comments/1pbqqs7/getting_laid_off/",
    "created_at": "2025-12-01T22:19:03.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1o6ua11",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "The state of jobs in the UK",
    "text": "This is from a major brand in the UK, with over 1000 employees. Offering less that minimum wage at the low end.  \n  \n**Key Responsibilities**\n\n* *To organise, direct, shoot, and edit high-quality photo and video content to support marketing activity.*\n* *Manage photography and videography projects from start to finish, creating storyboards, undertaking filming, and post-production editing.*\n* *Plan, create, and post content on YouTube, LinkedIn, Instagram, and Facebook, ensuring alignment with brand positioning and marketing strategy.*\n* *Create engaging digital content for websites and marketing campaign emails, helping to drive engagement and generate sales leads.*\n* *Meeting with internal stakeholders to discuss content requirements, then researching and creating suitable imagery and video collateral.*\n* *Collaborate with other departments and key business stakeholders to align content creation with strategic goals.*\n\n***Essential criteria***\n\n* *Demonstrable experience of undertaking photography and videography via a portfolio of previous work.*\n* *Experience of developing content for social media and managing social media accounts.*\n* *Can use a range of technical equipment, including cameras, lenses, lighting setups and editing software, including Adobe Photoshop and Premiere Pro.*\n* *Ability to shoot and edit high quality images and videos, with excellent attention to detail.*\n* *A confident communicator with good interpersonal skills who can organise and direct photoshoots.*\n* *Proactive with generating ideas and sourcing internal opportunities, with an interest in keeping up to date with industry trends.*\n* *Capable of planning, organising, and prioritising own workload.*\n* *Full drivers’ licence, and comfortable with independent travel.*\n\n***Desirable criteria***\n\n* *A relevant qualification.*\n* *Experience working in a marketing department.*\n* *Previous experience of using Social Media platforms, such as Hootsuite.*\n\n***In return for your commitment and expertise, in addition to the salary you will benefit from:***\n\n* *23 days annual leave plus Bank Holidays*\n* *Holiday buy &amp; sell scheme (following probation)*\n* *Annual salary of £23,500.00 - £28,000.00 depending on experience.*",
    "score": 11,
    "url": "https://reddit.com/r/videography/comments/1o6ua11/the_state_of_jobs_in_the_uk/",
    "created_at": "2025-10-14T22:45:34.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1ouedw5",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Setting up a NAS - Who to Hire?",
    "text": "I'd like to hire someone to set up a NAS! I am a one-man-band videography/photography business and just don't have the time or experience to set it up. I am located south of Minneapolis, MN. Would anyone have any recommendations of businesses or people who could handle all this for me? \n\nWants:\n\n* Purchase NAS equipment\n   * I was thinking of getting a 4-bay Synology NAS with 3-4 20 TB drives. \n* Wire into to permanent location in my house\n   * I don't currently have Ethernet wired across my house, so I'd need to find someone who can do that.\n* Set up &amp; configure NAS\n* Transfer everything from three 4TB HDDs I already have onto the new system\n* Bonus - if they can organize and transfer stuff from my 4 external SSDs, that would be awesome too\n\n  \nBackstory: \n\n* When getting into videography &amp; photography as a career, I started out just piling stuff onto Samsung SSDs. These eventually got full, so I saw somewhere that you can buy HDDs for cheaper for long-term storage, so I did that. I didn't realize how god awful slow it is to transfer anything on/off of these. It's painful. I ended up filling up one 4TB HDD and bought two more, tried to set up a system where I have copies mirrored on one of the drives for redundancy, but that just slowed everything down more. Final deliverables are backed up on the cloud as well - doing my best to enact the 3-2-1 methodology. \n* Fast forward to a few weeks ago - I just purchased another SSD because all my other ones are full and I haven't had time to transfer stuff onto HDDs and delete from SSDs. I want to create a system that is easy to execute, fast, cost-effective, and removes some clutter from my desk! Any and all recommendations are appreciated! \n\n  \nThis community has been so helpful for me along the way, from finding editors, to answering questions, it's been much appreciated! Thanks in advance! \n\n  \nWill ",
    "score": 11,
    "url": "https://reddit.com/r/videography/comments/1ouedw5/setting_up_a_nas_who_to_hire/",
    "created_at": "2025-11-11T16:44:10.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1od9ghb",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Hiring for a full time videographer (Cleveland, OH)",
    "text": "Hey all,\n\nMy in-house video team for a large company in the Cleveland area is hiring for a full time addition to the team. We’re currently interviewing but are still fielding good applicants. Ideally looking for someone with some experience in corporate, training, or narrative based videos. \n\nBase salary is $70k-85k plus a pretty good end of year bonus. Benefits as well. \n\nHybrid position but requires occasional travel to our Cleveland area studio.\n\nIf you’re interested to know more details DM me and also include some work samples. Thanks!",
    "score": 10,
    "url": "https://reddit.com/r/videography/comments/1od9ghb/hiring_for_a_full_time_videographer_cleveland_oh/",
    "created_at": "2025-10-22T14:14:56.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1im6lm2",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "3 Days in Cannes",
    "text": "Hey! Has anyone applied for 3 Days in Cannes? Did you get a response yet? I’m still waiting to hear if I’ll be accepted, but if I do, is it worth it? I live in Russia, where the euro exchange rate is really high (for context, the average salary here is around 800 euros), tickets are expensive, and the trip is long—around a day. But I’m willing to save up if it’s worth it. Can anyone who’s been there share their experience? Is it as amazing as it sounds?",
    "score": 9,
    "url": "https://reddit.com/r/Filmmakers/comments/1im6lm2/3_days_in_cannes/",
    "created_at": "2025-02-10T13:54:02.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1pofb8n",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "i love cinema but i’m afraid to start filmmaking — where do i begin?",
    "text": "Hello. I wanted to ask those of you who are knowledgeable in the field whether it is possible to film something —a short film, for instance— without any prior experience and without theoretical training.\n\nI’ll give you some context so you can better understand my situation. I’m 26 years old, and the vertigo of feeling that life is passing by without me taking a leap toward what I love most has left me anxious. I watch films constantly —I have since I was 14 or 15 years old. I watch one a day, sometimes two, sometimes three.\n\nI’m Argentine and I work as a teacher; my salary barely allows me to survive. I don’t own any equipment and I have no experience. I’ve never really taken photographs, except for the occasional ones anyone takes since the invention of the smartphone. If I were to buy a camera, it would probably be pointless: my PC isn’t powerful enough, and I know editing requires a computer I don’t have. I’ve even considered buying some kind of Apple device.\n\nBack to the main point: I watch cinema, yes. But I have no idea what an axis of symmetry is, what a dolly zoom is (more or less), or anything about color grading. I’ve never read film theory or studied audiovisual language. I occasionally read essays —mostly philosophy related to cinema— and literature, but not technical or theoretical film texts.\n\nGiven this situation of austerity and lack of formal training, is it reasonable to have ambitions to film something? What do I need? Where should I start? Please be sensible, even if the answer requires some blunt honesty.\n\nI’ve been discussing this issue in therapy for years: why I don’t dare to try. I’m demanding with the films I watch, and my fear is to run into a sad and crude reality where I don’t even know how to turn on a camera’s flash.\n\nI think all I really need is a push.\n\nGreetings from Argentina, and thank you.",
    "score": 9,
    "url": "https://reddit.com/r/Filmmakers/comments/1pofb8n/i_love_cinema_but_im_afraid_to_start_filmmaking/",
    "created_at": "2025-12-16T22:14:09.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1lactt8",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Rescinded Job Offer",
    "text": "Long story short, a local production company I interviewed with had offered me a full time position (salary + benefits) and sent over an offer letter outlining the specific job description, start date, and mentioned an NDA/Non-Compete. I had signed the letter hereby accepting the offer.\n\n2 weeks later, they contacted me to rescind the offer due to budget cuts but requested working on a 1099 basis on projects. Due to the nature of what was specified, I had begun turning down freelance dates post start date putting me in now a very awkward situation trying to reach out to contacts informing them I am freelancing again. Some of these contacts I’ve work with for years and have great relations with.\n\nDo I accept the 1099 work with this company or tell them I’m not interested after the way this all went down? Do I have any legal rights in this situation? Has anybody else experienced something like this recently? I have a lot of opinions on this situation but will keep that to myself for now.",
    "score": 9,
    "url": "https://reddit.com/r/videography/comments/1lactt8/rescinded_job_offer/",
    "created_at": "2025-06-13T10:49:03.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1m685q9",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Need help with Real Estate Videos",
    "text": "(I'm sorry if this isn't the correct sub to post/ask this.)\n\nSeeking Real Estate Video Editing footages &amp; opportunity for Portfolio Development\n\nHello,\n\nI am an early-career video editor with a foundation in motion graphics, faceless content, and short-form videos. Recently, I have developed a keen interest in the real estate sector and am actively exploring new niches to discover where my passion and skills best align.\n\nI have created my most recent video (the one I have attached) using available stock footage. While my access to structured, high-quality real estate footage is currently limited, I am eager to enhance my portfolio with more comprehensive and professionally structured projects.\n\nI am looking for opportunities to:\n\n1.Collaborate on real estate video projects—either assisting with editing or managing the project from start to finish.\n\n2.Work free of charge in exchange for permission to feature the completed project in my portfolio.\n\n3.Receive constructive feedback to refine my editing skills and project flow.\n\nIf you are a videographer or real estate professional in need of video editing assistance, or if you have any unused raw real estate footage, I would be grateful for the opportunity to collaborate. Your support will help me develop a more robust portfolio and gain valuable industry experience.\n\nReal Estate Video Techniques i know:\nBasic colour grading\n3D text and camera tracking\nLower thirds design\nCreative transitions (shake, teleportation, etc.)\nSpeed ramping\n\nSoftware:\nDaVinci Resolve (primary editing tool for recent projects)\nAdobe After Effects\nAdobe Premiere Pro\nAdobe Photoshop\n\n\nWhile I am particularly interested in real estate content, I am also open to editing advertisements or other commercial videos. If you’re seeking a reliable, motivated editor for your project, I am ready to contribute, learn, and help bring your vision to life.\n\nThank you for reading till the last. Please feel free to reach out if you have a project in mind or would like to discuss potential collaboration. \n\nBest regards",
    "score": 9,
    "url": "https://reddit.com/r/videography/comments/1m685q9/need_help_with_real_estate_videos/",
    "created_at": "2025-07-22T07:59:28.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1n4zuzo",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Freelancers: Short term high-earning work or long term medium-earning work?",
    "text": "This is purely based off of my observations and conversations with different freelancers. For reference I've been involved with productions of all kinds and sizes for around 15 years.\n\nI have noticed that a lot of people who have been producing videos for a long career - say 20 or more years - often seem to have a very steady stream of work and median pay for the kind of work they do. One guy I worked alongside had been doing commercial work and ads for 37 years and he said that in the last handful of years he keeps the gigs between $5-7k CAD. And gets about 2 jobs a week, with someone else managing clients and another editing and delivering.\n\nHowever, most of the younger people I know seem to chase the highest paying gigs they can, no matter what. And when one type of work dies down or dries up, they move on to finding something else that pays really well. \n\nA friend who I have known for around 13 years has surpassed $200k/yr CAD (or at least his business has), and of course that means spending more money to make that money. But it is far from consistent. One year he is doing mainly livestreams, the next he is shooting music videos, the next again he is on the other side of the country shooting ads. He is basically doing a series of different kinds of short term high-pay work, in his words.\n\nAnd then yet again, someone I know who is about 2 years into video work and has been getting $15-20k CAD jobs with little effort, but then will go about 6 months without work sometimes. \n\nPersonally, I see the value in the consistent yet medium paying work. But aside from money and diversity in work, what is the draw to going for the highest paying work possible if you will likely have to pivot again or may lose consistency?\n\n",
    "score": 9,
    "url": "https://reddit.com/r/videography/comments/1n4zuzo/freelancers_short_term_highearning_work_or_long/",
    "created_at": "2025-08-31T16:57:09.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1mz4tex",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "“How much do I charge?” Answered.",
    "text": "I see a lot of posts asking what to charge and how much a video is worth. It’s an impossible question to answer online because there a ton of factors to consider: what’s the expected cost of production where you live? Is this a one-off project or part of a retainer agreement? What are your expenses? Etc. \n\nSo instead of starting with a video and working out what it’s worth, you need to start with some questions to figure out your pricing. \n1. How much do you need to make monthly? \nInclude in this answer:\nA) how much do you want to make as a salary?\nB) what monthly expenses do you have?\nC) what annual expenses do you have? (Best guess and then divide by 12)\nD) what taxes will you have to pay? (Typically quarterly if you’re in the U.S.)\nE) what production expenses will you have? (Permits, gear, models, etc.)\nOnce you figure out all of these numbers, you’ll know how much you need to make monthly. \nF) what is the average cost of competitors services to my own?\n\n2. What can I sell to Clients?\nFrom there, you need to identify your client, and build packages that includes content that will solve their problems. For my clients, 99% of jobs are either A) client needs website videos or B) client needs social media content. This is because they need to get people to their page or site, and then sell them once they are there. \nSo to build packages, figure out the following:\nA) how many clients can you handle a month\nB) do you want to focus on retainer or one-off jobs?\nC) what is a new customer worth to your client?\nD) what can I make to solve their issue and how long will that take me?\nE) can I offer supplementary services as add-ons? (Social media posting, photography, etc)\nF) how much budget does my client realistically have?\n\nOnce you know all of this, you’ll know what you need to make and how many clients you need a month to make it there. \n\nThe sweet spot you are looking for is to get a package together that can bring the client in more money than what they spend on your content. If they make money with you, they will stick with you. I’m probably forgetting some things so let me know if you have questions and I’ll answer them the best that I can! \n\nFor context I’m 3 years into my production business that was originally just me and as of a few months ago my wife joined me full time.  It took a lot of trial and error to get to the point we are now since I had 0 sales or business experience when I started my business",
    "score": 8,
    "url": "https://reddit.com/r/videography/comments/1mz4tex/how_much_do_i_charge_answered/",
    "created_at": "2025-08-24T19:22:30.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1k1cumi",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Is Cold Applying Dead in Video? My Plan and Thoughts.",
    "text": "Obviously this goes for more than just video, but wondering about your experiences. 32M, video producer at a midwest university. Good benefits, but I’m on an island. No real peers to learn from. Video salaries in my city cap at around 70k, **so I’m aiming for Chicago**. My portfolio leans documentary style talking heads. Only have corporate and higher ed experience. I value stability, so TV/movies/freelance isn’t my goal. Looking at corporate, nonprofit, and agency work.\n\n**Cold applying feels pointless.** Using a Chicago friend’s address to bypass ATS. Not sure if that helps since all my job experience is from out of state. \n\n**A better plan:**\n\n* Preemptively send my work to employers I want to work for.\n* Focus on spec work/personal projects.\n* Message Chicago peers for real conversations (not strict “networking”).\n* Go to trade shows/conventions, meetups. \n* Don’t waste time on boards. Only apply if uniquely qualified. \n\n**I'm curious if any of you ever landed a job from boards?** Is trying to land something from out of state unrealistic? Tempted to just move and take any job to cover the bills while applying. ",
    "score": 8,
    "url": "https://reddit.com/r/videography/comments/1k1cumi/is_cold_applying_dead_in_video_my_plan_and/",
    "created_at": "2025-04-17T13:31:13.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1mk72u5",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "how to start working as a videographer?",
    "text": "I'm a 19yo student finishing a bachelors in film production, but I'm starting to lean towards a career in videography.\nI've found the film community in my city very intimidating and even though I'm actively getting a degree, I feel as though I'm falling way behind my peers who have already begun making money in this field.\nI have a Canon EOS Rebel T7, but I have enough money saved up to purchase a proper video camera, lenses, and equipment. I really just want to start being able to work, and I dont know where to start.",
    "score": 8,
    "url": "https://reddit.com/r/videography/comments/1mk72u5/how_to_start_working_as_a_videographer/",
    "created_at": "2025-08-07T17:55:51.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1mguvxz",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Does anybody regularly use light meters or color meters for digital videography?",
    "text": "I’m a colorblind videographer and have been able to skate by fairly unaffected (at least to my knowledge) over the last 12 years of my professional career. However, recently it seems like I keep running in issue after issue regarding color representation in my projects. Primarily when it comes to multiple light sources for run and gun scenarios, which fortunately aren’t the majority, but when they occur they diminish my confidence.  Basically, I’m struggling to accurately balance the lighting in these locations and when I bring in an additional light, it just seems to make things worse. So I’ve been considering investing in a color meter to help dial in the lightings, but also figured I’d get a light meter as well since I’ve always wanted to work with one of those too. Sorry for the long rant of a question. \n\nTL;DR What’s your experience using a color meter and would you recommend it for a color blind videographer? Bonus points for personal experience using light meters. ",
    "score": 8,
    "url": "https://reddit.com/r/videography/comments/1mguvxz/does_anybody_regularly_use_light_meters_or_color/",
    "created_at": "2025-08-03T21:18:19.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1o57y8x",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Stars compensation for significant time over schedule?",
    "text": "This question is inspired from the production problems of Jaws 51 years ago. That film had two mid-A level stars in Roy Scheider and Robert Shaw (Richard Dreyfuss had not yet reached full stride). They signed on for a two month production that lasted 4.5 months. What most likely happened then, and what would happen now? If you sign Chris Evans to $10MM for two months and take 4.5 months, do you have to pay him $20+MM at a straight pro rated salary? Or are stars in for for so much equity that they just suck it up to deliver the product and get to the back end? And back then, if you had two guys that agreed to work 2 months for $250k(?), would they just say, \"sure, I'll stick around another 2.5 months as long as you provide room and board.\" or would their agent say, \"f u, pay us $562k now?\"",
    "score": 7,
    "url": "https://reddit.com/r/Filmmakers/comments/1o57y8x/stars_compensation_for_significant_time_over/",
    "created_at": "2025-10-13T02:35:13.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1j4yycg",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "What role can you hire to take care of your finances?",
    "text": "I'm looking to create a short film but since I don't know the market I'm conscious that people from various roles e.g. cinematographer, actors etc. are going to ask for crazy amounts, especially if they sense ambitious beginners. I was thinking whether it's a good idea to hire a person of trust which is going to have a sole goal: make  sure that the salary negotiations are fair and actual complete them. Perhaps the closest role to this is the producer but I don't think I need the rest that comes with this role.",
    "score": 7,
    "url": "https://reddit.com/r/Filmmakers/comments/1j4yycg/what_role_can_you_hire_to_take_care_of_your/",
    "created_at": "2025-03-06T16:09:12.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1j4wr9m",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Inspiring filmmaker with an idea that may be too big to pull off for my first short film.",
    "text": "ASPIRING filmmaker I meant and now I can’t edit the title.\nI went to film school for a year than dropped out. While in school I had every opportunity to make a short film with free resources like studio space, equipment, and crew. But I didn’t make anything, which I regret. At the time I had no idea what to write, if I had an idea it was too big too pull off for a short film, and was too afraid of making something bad.\nNow I have a story that I’ve worked on for a year. I’m confident enough with it that it could be good, and at this point just being good enough is all I need.\nI wanna shoot a short film in the style of old silent films mostly inspired by George Méliès.\nStory takes place in early 1900s, has a three act structure, three locations, three actors, no dialogue, approximate timing 5-8 minutes.\nThe most important aspects when making would be Cinematography, location, and costume. I know this is gonna cost a lot to make, which I’m willing to pay. I would be willing to spend up to $7000 to make this. Most of the cost would go to location rental, costumes, crew salary, and post production. I wanna make this happen. I’ve worked on a lot of short films as crew, and know the logistics of making a short film. I may be way over my head but this is something that I want to create.\nWhat do you think? Am I crazy for wanting to make something this ambitious for my first film?",
    "score": 5,
    "url": "https://reddit.com/r/Filmmakers/comments/1j4wr9m/inspiring_filmmaker_with_an_idea_that_may_be_too/",
    "created_at": "2025-03-06T14:32:32.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1mdqgms",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Best type of freelance clients?",
    "text": "I was a full time corporate videographer the last 4.5 years. Past year my salary was $90k, essentially as media director.\nI lost my job last week. Talked to a client who was paying me $2500/month for a few small shoots per month. It’s a pest control company, so basically just shooting b roll of their services, filmed a couple training videos, etc… most of it’s pretty simple and quick stuff.\n\nAnyways he agreed to double my pay for the next couple months but said I’d need to travel a couple days at a time to different states and film sales teams there. I agreed, but did clarify that I don’t want to be constantly on the move. Now that I don’t have a full time job, I want to be home 90% of the time to look for more work while still keeping some health routines and a very mild social life together.\n\nI got home from Texas today. First thing he texts me is “what day works next week to go to Oklahoma?”\n\nI’ve relayed to him several times now at this point that I can’t travel weekly. Mind you these aren’t short quick flights. Usually a 2 hour flight, then an hour and a half layover, then another 2 hour flight. filming all day for 2 days, then same thing back home.\nIf I hadn’t previously told him exactly where my boundaries are at with that, I’d understand why this would just be a “deal with it, it’s your job” moment. The problem is he’s choosing not to listen to what I’m saying, and just take advantage of me since he knows I don’t have a full time office job anymore. \n\nAnyways, sorry I know that’s mostly a lot of bitching to get to a simple question.\n\nIn your experience based on those standards I kinda laid out - what industries/types of companies do you feel like are the easiest to work with/best paying to contract for?",
    "score": 5,
    "url": "https://reddit.com/r/videography/comments/1mdqgms/best_type_of_freelance_clients/",
    "created_at": "2025-07-31T03:00:23.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1kxexvb",
    "subreddit": "videography",
    "soc_codes": [
      "27-4031"
    ],
    "title": "Sony or Black Magic: Manual focus too risky/involved for wedding work?",
    "text": "I started my photography business back in 2011. I began on Nikon, moved to Canon, then Fuji, and finally landed on Sony in 2018. In 2019, we sold our house and hit the road full-time in an RV, taking a much-needed break from photography due to burnout. Around 2022, I got the urge to shoot video again and picked up an FX3 and A7S3. I shot a few weddings, enjoyed getting creative again, but eventually sold the gear and continued traveling.\n\nNow, after five and a half years on the road, we’ve sold the RV and semi, bought a home in our hometown, and I’m working a full-time salaried job for the first time in 15 years. While it’s stable, I miss creating, and honestly, I can’t stand that all the extra hours and effort I put in just make someone else more money. I’m rebuilding my business from scratch with a focus on creative freedom, aiming for about a 70/30 split between video and photo. I plan to take on documentary-style projects, weddings, and commercial content for local businesses.\n\nI currently own a Sony A7IV and six E-mount lenses. I was planning to build around this setup, but I’m open to switching systems if it makes more sense long term. I edit video entirely in DaVinci Resolve, so the BRAW workflow and color grading flexibility of Blackmagic are really appealing.\n\nI’m especially interested in the BMPCC 6K Pro (internal NDs) and the Pyxis 12K. What draws me in is the image quality, color science, and integration with Resolve. But my only concern is focus, especially for weddings. \n\nI’ve had Sony footage ruined by micro jitters, random focus shifts, and unnatural pulsing. That alone has me questioning autofocus for event work. But at the same time, weddings move fast, and I wonder if manual focusing would be too stressful or impractical in that environment. I’m comfortable pulling focus in slower, controlled shoots, but weddings are another beast entirely. I’m sure with some practice I could get very fast and efficient. \n\nHere’s what matters most to me:\n\t•\tHigh-quality image with strong dynamic range and natural color\n\t•\tDependable performance in fast-paced or unpredictable shoots\n\t•\tSeamless DaVinci Resolve workflow (BRAW is a huge plus)\n\t•\tSolid low-light performance\n\nHas anyone here made the switch from Sony to Blackmagic for weddings or commercial work? Is manual focus just too much of a hassle for wedding days, or is the image and workflow benefit worth it? I’d love to hear real-world experiences from anyone who’s been in this situation.",
    "score": 5,
    "url": "https://reddit.com/r/videography/comments/1kxexvb/sony_or_black_magic_manual_focus_too/",
    "created_at": "2025-05-28T11:43:59.000Z",
    "num_comments": 28
  }
]