[
  {
    "id": "reddit-1hq98pe",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "I built this!",
    "text": "I spent two years building my off grid house mostly with one helper except I had two for the stucco. (I did hire an electrician, plumber, and excavator) I cut every board in the entire house. Other than some work-benches over the years in my various art studios and a little prefab shed, it was my first build. ",
    "score": 7469,
    "url": "https://reddit.com/r/Carpentry/comments/1hq98pe/i_built_this/",
    "created_at": "2024-12-31T06:59:29.000Z",
    "num_comments": 237
  },
  {
    "id": "reddit-1lpi91p",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "My dad built an octagon",
    "text": "My dad built an octagon shaped structure about 13 years ago, that I stay in when visiting their summer home. I've just started my journey into amateur woodworking and carpentry and have a new respect for this structure. Just curious what people's thoughts are on his craftsmanship.",
    "score": 6373,
    "url": "https://reddit.com/r/Carpentry/comments/1lpi91p/my_dad_built_an_octagon/",
    "created_at": "2025-07-02T00:36:48.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1ng9fqk",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Some More Custom Carpentry",
    "text": "I posted a set of curved stairs yesterday that got a lot of love. Much appreciated! I figured I’d post some other pretty neat things I’ve framed in the past. I started framing at 18 years old (about 13 years ago) and since then have been basically obsessed with perfecting my craft and as a result have been blessed to have had the opportunity to frame some cool things in some pretty amazing houses! \nThese are some of my favorite features from some of the houses I’ve built over the years. \n",
    "score": 5309,
    "url": "https://reddit.com/r/Carpentry/comments/1ng9fqk/some_more_custom_carpentry/",
    "created_at": "2025-09-13T21:35:35.000Z",
    "num_comments": 240
  },
  {
    "id": "reddit-1ien7v9",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "A $20 3/16\" angle iron does wonders against breaking in",
    "text": "Last night 2 am I was woken up by some rando kicking down my door. Luckily homeboy worn himself out. Didn't succeed. When I installed my front door a few years back I fastened a 2x3x3/16\" angle iron by the latch. Fastened it with 3\" Simpson screws to the king/jack studs. Consider myself very fortunate. A $20 piece of steel saved my ass.",
    "score": 4174,
    "url": "https://reddit.com/r/Carpentry/comments/1ien7v9/a_20_316_angle_iron_does_wonders_against_breaking/",
    "created_at": "2025-01-31T19:36:30.000Z",
    "num_comments": 239
  },
  {
    "id": "reddit-1l3j8oz",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Hired a local guy to build a shed for us.... Wish I had done it myself...",
    "text": "We hired a local contractor to build us a shed and the entire experience has been bordering on traumatic at this point. This has been such a nightmare!.... I have attached images of the work... He made racist comments about a painter we hired.... He is refusing to refund at all...and we already gave him 12k... What you see is all the work he did...so I feel we are entitled to getting some money back.. I have to file a formal complaint with the CCB... \nHe tried to hire the same painter he made racist comments to... to do work for him instead of doing it himself... and he lied about what he charged us for some reason to said painter... he also kept increasing prices as the project went on... I am in tears over this... 12k down the drain. I took out a loan for this project because it has been a dream of mine for so long and now we will be forced to pay 400 a month here on out... for...nothing... 😔 I am kicking myself for not knowing more before hand...these were the first contractors we have ever hired... and we are the first people in our families to own a home so we have little to no guidence... probably exactly the kind of folks scammers would look for, truthfully... he has been so hostile and almost made our roommate cry when she was asking questions about the work...he is now trying to blackmail us... he and his brother came by screaming on our property. Just completely unethical behavior... any advice welcome...  \n\n\nP.S. I want to share the name of the company because I want to warn people but I dont know if thats allowed... \n",
    "score": 4100,
    "url": "https://reddit.com/r/Carpentry/comments/1l3j8oz/hired_a_local_guy_to_build_a_shed_for_us_wish_i/",
    "created_at": "2025-06-04T22:35:33.000Z",
    "num_comments": 664
  },
  {
    "id": "reddit-1nlm39h",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Came to my parents and had a heart attack",
    "text": "For context I live out of state and it’s about 4 hours to my parents.  I came to visit and saw this monstrosity that my parents are paying someone to build.  I’m a union commercial carpenter so I immediately told my dad to let them go and pay for their time spent and I will drive down a weekend and get this fixed right ",
    "score": 3784,
    "url": "https://reddit.com/r/Carpentry/comments/1nlm39h/came_to_my_parents_and_had_a_heart_attack/",
    "created_at": "2025-09-20T02:06:46.000Z",
    "num_comments": 408
  },
  {
    "id": "reddit-1hykrze",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "A few months ago I hired someone in their 40's with no carpentry experience. ",
    "text": "\n\nThis has proven to be an excellent decision. Because the type of carpentry I do is pretty far outside of general carpentry they don't have any established habits that conflict with my trade. They've been mostly stripping paint and assisting me when I have to be on site until today. \n\nOn the current project I was hoping to preserve and restore some of the carved elements on a portico. After they stripped the paint off a few of them I was able to assess the overall condition and came to the realization that these are too far gone to reuse. This means that I have to replicate 40 of these pieces. \n\nSo today I made a couple of templates and showed my helper how to mark and carve. We were able to discuss the approach together (I am not a woodcarver!), troubleshoot some potential problems, and determine that all we needed to use are pareing chisels, no gouges or carving knives necessary. \n\nThe first one I tried doing myself while they were cleaning up the paint removal area. I made enough mistakes to call it a wash, and to let them know how I did it wrong. \n\nI showed them how to use the template to determine the convex curve, handed them the pareing chisel, and said \"Have at it!\". \n\nIt took them about an hour to do one, with the occasional questions and bit of guidance, and it came out great! Not perfect, there are a few mistakes in the first one, but definitely good enough to install up high. \n\nIf they can get the time down to a half an hour each and stay relatively within the parameters I will call that a job well done. \n\n",
    "score": 3584,
    "url": "https://reddit.com/r/Carpentry/comments/1hykrze/a_few_months_ago_i_hired_someone_in_their_40s/",
    "created_at": "2025-01-11T01:33:32.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1lxytw4",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Got fired from a job for the first time today. Did I deserve it?",
    "text": "So, the customer said they'd pay hourly. We worked two days, two guys, putting Hardie siding on a 40-foot wall.\n\nThe customer framed the house himself and did poor work. The truss tails, outrigger and fascia were all messed up, so we spent a couple of hours fixing them, knowing it wouldn't look great.\n\nThe service panel was put in too early, and the conduit was sticking out of the top into the boxing. I tried to lower it for an hour, but no luck.\n\nWe worked Monday and Tuesday, 8 hours each day. The customer called Tuesday night and, basically, said he could've done it in one day and fired me.",
    "score": 3139,
    "url": "https://reddit.com/r/Carpentry/comments/1lxytw4/got_fired_from_a_job_for_the_first_time_today_did/",
    "created_at": "2025-07-12T12:05:31.000Z",
    "num_comments": 627
  },
  {
    "id": "reddit-1k383hs",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Pay your people a real fucking wage.",
    "text": "Came across a former employer offering a MAX pay less than I'd take as an apprentice.  High stress, had more people quit because of his temper than anyone, offering rock bottom rates.  \n\nThis drags ALL carpenters down.  How the fuck am I going to compete with someone who takes a rock bottom wage because they still think they're entry level.  \n\nEdit:  I kicked a hornets nest.  Good.  Pay your people a fucking living wage ",
    "score": 1524,
    "url": "https://reddit.com/r/Carpentry/comments/1k383hs/pay_your_people_a_real_fucking_wage/",
    "created_at": "2025-04-19T22:30:41.000Z",
    "num_comments": 482
  },
  {
    "id": "reddit-1jyi2k0",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Will this build hold 12 thousand pounds?",
    "text": "Hey y'all,\n\nMy wife is a literal orca with big bones and I need to know if my first stab at a custom airstream bedframe will hold all six tons of her.\n\nI used T-20 star bit construction screws and lots of wood glue in the hopes that this build would not implode and burst into a thousand toothpicks as soon as I rolled her up onto it. \n\nAny advice which helps me retain my novice carpenter manhood would be greatly appreciated.",
    "score": 1388,
    "url": "https://reddit.com/r/Carpentry/comments/1jyi2k0/will_this_build_hold_12_thousand_pounds/",
    "created_at": "2025-04-13T21:06:50.000Z",
    "num_comments": 506
  },
  {
    "id": "reddit-1j9zuhu",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "My tallest build yet, 19’",
    "text": "Got roasted over in r/fireplaces as expected for the TV height but if we take that out of it, I’d love to get some honest critique on the trim and moulding work from some experienced carpenters. I’m a business owner and always try to learn so I can offer more to my clients but am by no means an expert \n\nAnyway, ended up about 4 days over projected by underestimating the extra time framing and hanging Mdf and all the mouldings up 3 flights of scaffolding so lessons learned there\n\nHow do you guys and gals achieve the most invisible butt joints? We tried to get every cut as close to perfect as possible, sanded flush with orbital, bondo, sanded, but still not perfect, any pro tips? ",
    "score": 1274,
    "url": "https://reddit.com/r/Carpentry/comments/1j9zuhu/my_tallest_build_yet_19/",
    "created_at": "2025-03-13T00:50:43.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1mlzyhq",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Grandfather came home from WW2 and became an NYC carpenter and finished his career in Pennsylvania. One of his books from the 50’s.",
    "text": "",
    "score": 1131,
    "url": "https://reddit.com/r/Carpentry/comments/1mlzyhq/grandfather_came_home_from_ww2_and_became_an_nyc/",
    "created_at": "2025-08-09T20:52:11.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1ob1a1a",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "This job made me feel like a carpenter for once at least. Enjoy… or don’t 🤝",
    "text": "Big job for me. Mixed with fun hours. Hope some of you can appreciate. Forced me to dial in the craft and appreciate the work. ",
    "score": 1011,
    "url": "https://reddit.com/r/Carpentry/comments/1ob1a1a/this_job_made_me_feel_like_a_carpenter_for_once/",
    "created_at": "2025-10-19T21:11:06.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1nhmldb",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Some madlad carpenter in 1988 enclosed a tree inside the house. Next owners didn't maintain the enclosure and damage ensued ...",
    "text": "I thought the building envelope flair would be most appropriate since the tree penetrated the building envelope in two places!\n\nAnyways I'm just a decent DIY homeowner that bought a house with a tree growing through it. I know it was a carpenter from 1988 that did it; since I found date-stamped plywood underneath the gravel bed, and a smoked Marlboro Gold and spent match underneath that ply, ha! I've only seen super-skilled carpenters smoke Golds ...\n\nAnyways, I love following this sub in order to see the cool stuff you pros do; so I thought I'd just share this sort of outlandish thing now that I've completed the demo work and am gradually restoring the area. I know this isn't the sub for homeowner posts but I hope this is interesting enough for an exception!\n\nOriginally this was a tree penetrating a spruce sun deck that was then enclosed as a solarium (photo 5), with the tree remaining there. The existing deck knee wall was just used as the base for the solarium; and then Four Seasons replaced the whole original solarium in 2019. I tried to highlight the build details as well as the damage this whole thing caused over time in the captions to the photos, but happy to answer any questions if anyone has them. The damage was really two fold - 1) From the tree directly: water flowing down the tree penetrated the floor joists and subfloor and caused rot; and the tree growth and sway was really shaking things loose; 2) The 2019 solarium install was not the best, and has led to a lot of rot in the corners as water flows down the rafters and pools/drips in the corners.\n\nI suppose I would have kept it, but once I pulled off the decking underneath the house, I could see I only had about 3\" of space before the tree would hit my main beam given all the box joinery and such; so only about 5 years of tree growth before it would have to come out anyways.\n\nI'm almost to the stage where I can pull the ledgerboard back into the house and then start clamping and bringing the joists back in and putting hangers on them (lots of gradual floor jack twisting and stud levelling with wedges). Since the 'drift' of the ledgerboard has opened up some of the wall seams, I'd rather try to get everything back plumb and level vs just trying to secure it all in place. I put all that under-structure bracing in before the tree guys came in to remove it; since given the structural issues, I didn't want an errant sway of a multi-ton tree to send a chainsaw wielding arborist through my floor ... but it's also been super useful as I level and raise everything back to where it should be though!\n\nOf course, as a new homeowner, I'm kind of pissed to see all the hot-mud and poor paint patches the previous homeowner slapped in there to hide everything before I bought it ... I could see there were issues when I did my inspection (not that the inspector caught them), but didn't think it was this bad. Of course, you never know with water damage until you start demoing ...",
    "score": 776,
    "url": "https://reddit.com/r/Carpentry/comments/1nhmldb/some_madlad_carpenter_in_1988_enclosed_a_tree/",
    "created_at": "2025-09-15T13:58:13.000Z",
    "num_comments": 127
  },
  {
    "id": "reddit-1le1pct",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Concrete form work career advice",
    "text": "Hello carpenters. Sharing some photos of concrete form work and seeking advice on a career change, or what to expect. I love my job but it requires constant travel and I’m about ready to settle down somewhere. I’m curious about your thoughts on transitioning from form carpentry to a framing job. Form carpentry is my only experience and I have about 6 years doing it. Have built wooden ramps and bowls in the past, but mainly concrete forms. Any other job options you would recommend looking into? The ability to be creative at work is a big thing for me, and like the idea of building cool things. Appreciate any advice or thoughts in advance thank you. ",
    "score": 773,
    "url": "https://reddit.com/r/Carpentry/comments/1le1pct/concrete_form_work_career_advice/",
    "created_at": "2025-06-17T23:05:04.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1ixzi4v",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Trim carpentry is not easy and i feel like an ass",
    "text": "I always wondered \"why is trim 'carpentry' its own discipline, how hard is it to nail mouding to boards and cut miters sometimes\". Long story short, i do woodworking, and needed more space, so built myself a shed. Cut to 3 months later, im starting to do trim for my windows, door, etc, do my measurements, rough plan it, start cutting, ez pz and...wait a minute. Oh. Nothing is square. In any direction. Fuck. I made everything square to a 1/16\" tolerance when i built it, but i made a new discovery to share with the world: soil moves when you put heavy stuff on it. Followed by another discovery: woodworking when things are not square sucks. So, im sorry to all trim carpenters for thinking your job is easy, god bless you, im going back to my sandbox where everything is jointed on a flat surface.",
    "score": 677,
    "url": "https://reddit.com/r/Carpentry/comments/1ixzi4v/trim_carpentry_is_not_easy_and_i_feel_like_an_ass/",
    "created_at": "2025-02-25T16:47:22.000Z",
    "num_comments": 177
  },
  {
    "id": "reddit-1khrbrz",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "What is your favorite old guy saying you’ve heard on the job?",
    "text": "Working around seasoned pros, I hear so many great sayings that I try to memorize and keep like little golden nuggets to pass on. Some of my favorites I’ve learned from the older guys - \nA stitch in time saves nine\nDon’t put yer fingers where you wouldn’t put yer c*ck\nCaulk and paint make a carpenter what he ain’t \nIf ya don’t think a small change can make a big difference you’ve never been in bed with a mosquito \nSomething you can learn by watching the clock is that is passes time by keeping its hands busy\nNot my circus, not my monkey",
    "score": 572,
    "url": "https://reddit.com/r/Carpentry/comments/1khrbrz/what_is_your_favorite_old_guy_saying_youve_heard/",
    "created_at": "2025-05-08T14:21:24.000Z",
    "num_comments": 1345
  },
  {
    "id": "reddit-1pefj1v",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Anyone in Brooklyn, NY area looking for Carpenter",
    "text": "Looking for a new career path in the Brooklyn, NY area. Most of these are a collection of form work for concrete from the past few years. I’m hoping to get into the permanent side of carpentry instead of build to take apart. I have some good experience framing and doing some other carpentry as well and I’m willing to travel. Let me know your thoughts and feel free to reach out to me with any advice or opportunities! Thanks yall. ",
    "score": 529,
    "url": "https://reddit.com/r/Carpentry/comments/1pefj1v/anyone_in_brooklyn_ny_area_looking_for_carpenter/",
    "created_at": "2025-12-04T23:37:17.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1m7o1zx",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "How to learn complex framing (like the pic)",
    "text": "Hey everyone. I'm a mechanic by trade but I built my own mono pitch garage some years back (second pic. The siding was 17 cents a pound from the scrapyard). I consider myself somewhat handy. Ive researched eyebrow dormers and some various terms i've learned along the way but im not sure how to confidently tie all that stuff together. It seems there is a vast gap between my capabilities and the cool stuff I want to build. The way forward is murky for me. It seems alot of talented carpenters come from a boat building backround (atleast in the tiny sliver of the mobile dwellings that appeal to me). Do yall have any idea where to start picking up skills like this? Is there a sector of carpentry, or some terms I havent learned yet  architectually that defines this style im interested in? Is there some exercises or small scale birdhouses or something with instructions to learn these kinds of angles? Any input will be appreciated. I'm an extreme novice here. Thanks!",
    "score": 397,
    "url": "https://reddit.com/r/Carpentry/comments/1m7o1zx/how_to_learn_complex_framing_like_the_pic/",
    "created_at": "2025-07-23T22:59:41.000Z",
    "num_comments": 167
  },
  {
    "id": "reddit-1i9iwvi",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Note to self/PSA, don’t agree to do dark grout on white tiles, especially when they are the hex bullshit ones…",
    "text": "Aus chippy here. Worked side by side for my first two years as an apprentice with a carpenter who was a 10year experienced tiler, mostly doing kitchen and bathroom renos. Learnt a lot, despite his thick Irish accent. \nOne day we grouted a bathroom we had tiled with black grout (clients choice). Started at 11, finished about 7… cleaning the tiles just took sooo long, I was basically just refilling and running clean buckets of water in and out, as you only cut one swipe per side of the sponge to clean it… Anyway, together we vowed to never agree to to do dark grout on white tiles again. \n\nFast forward 6 years (now) and I stupidly agree to to redo my friends shower that has tiles falling off. White HEX tiles, charcoal grout.\n\nFuck me. Absolute cunt of a job. Turned out ok though. Kept her shitty base and shower screen door.\n\nDO NOT RECOMMEND ",
    "score": 367,
    "url": "https://reddit.com/r/Carpentry/comments/1i9iwvi/note_to_selfpsa_dont_agree_to_do_dark_grout_on/",
    "created_at": "2025-01-25T08:51:42.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1lw2b6n",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Carpenters: YOU are underpaid",
    "text": "Employees. Not contractors, union, etc., I'm talking\nabout employees. If you live in one of the high cost\nof living cities, YOU are more than likely underpaid.\nThese days, unless you're content with being a troglodyte with an hour+ commute, eating shit food,\nand saving a pitiful amount, you need to ask for\nmore. A lot more. Get out of the pre-COVID\nmentality, not that you were getting what you were worth then, either. Everything is so fucking expensive. Inflation happened and so did corporate greed. No\none is making enough to have children let alone give\nthem a good life. No one is making enough to own a\nhome. No one is making enough to even feel like the\nphysical and mental toll on yourselves is truly worth it. Meanwhile your boss is driving a new truck, shmoozing with clients, bought a boat, new SUV for wife, kids, house, organic food, vacations, everything - then has the audacity to complain that people are asking too much or he can’t find any good help. NO SHIT, it’s supply and demand! If your city is overrun with tech salaried people like SF, Seattle, Austin, or just HCOL like NYC, LA, San Diego everyone with skill has been priced out or is demanding to be paid more. $50/hr isn’t even enough to have a good life in some of these major HCOL cities, and that is what wages are mostly topping at across the board for LEAD carpenters. If you’re even “lucky” enough to be offered benefits: Fuck the benefits, we want enough money to pay for our own healthcare, our own time off, and our own investment choices. We don’t want to be owned by a company that is underpaying us but keeping us on a leash by controlling our health, our time off, and our retirement. Humans want freedom. Money is freedom in our society, and we all need more of it for what we’re doing. \n\nEdit:\nI hope this post inspires some of you to go in tomorrow and ask to speak to the boss, HR, whoever it may be about getting a raise. These companies need us and are hurting for labor. Talk to your coworkers, well, the ones you can stand and who aren’t mouth breathers. I’m not talking about unionization, I’m just talking about demanding more. There’s a reason we are employees and not union - we value our freedom. Money is freedom. Go and get yours. \n\nEdit 2:\nAs of now, 86,000 people have seen this post. Imagine the impact it could have if all of those people talked to their coworkers and all demanded a raise. ",
    "score": 310,
    "url": "https://reddit.com/r/Carpentry/comments/1lw2b6n/carpenters_you_are_underpaid/",
    "created_at": "2025-07-10T03:13:00.000Z",
    "num_comments": 189
  },
  {
    "id": "reddit-1m6roo5",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Is it normal to be slow as an apprentice?",
    "text": "I often get criticized for being to slow at doing things and I know part of it is just my coworkers busting my balls but I know it’s something I need to work on, I was just wondering if anyone can relate?",
    "score": 68,
    "url": "https://reddit.com/r/Carpentry/comments/1m6roo5/is_it_normal_to_be_slow_as_an_apprentice/",
    "created_at": "2025-07-22T22:06:35.000Z",
    "num_comments": 73
  },
  {
    "id": "reddit-1ls7rzy",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Just got let go on probation, completely unexpected.",
    "text": "Little bit of a vent here. I’m a 3rd year carpenter with 1.5 years of framing and 1.5 years of formwork. 2 months ago I applied to a custom structure installer (sheds, cabanas, gazebos etc.) with hopes of starting a career here. They were looking for a 3rd set of hands, they were having a hard time knocking out builds in a timely manner with only 2 guys. The owner was having to go on site to help.\n\nThey took me on, listened to all my needs in the interview (living wage, consistent work, room for growth) and ensured they’d be met. Told them I had a kid and that I was hoping to find somewhere long term to grow to continue to provide for him &amp; my family. They interviewed a couple other guys and chose me out of the bunch fully knowing my experience level.\n\nI show up every day, 10 minutes early and help the other installer clean out the truck from the day before and load it up. I always haul as much as I can possibly handle and push my limits to exceed expectations.\n\nI’m 2 months in and we’re already at a point where we’re capable of doing installs without the install supervisor (just 2 guys), something they were struggling to do in the first place. The 2 guys I work with (install super, other installer) regularly compliment my work/work ethic and give me pointers on how to improve and what the customer wants to see.\n\nWe had a good week, we’re ahead of schedule and we’re booked all the way into November. Friday (yesterday), they unexpectedly put me on a delivery with one of the guys at the shop while the other installer &amp; install supervisor finish off Fridays project. A little unusual but nothing indicating what’s to come. \n\nFriday, 4:00pm, 3 hours after I’ve gotten home I receive a call from the owner: “it’s not going to work out. You should’ve been more up front with me about your experience level. 28$/hour is too much money. I was hoping to find someone with more experience.” My resume was right in front of you during the interview…\n\nI asked if there was anything I could do, even take a pay cut because I absolutely love this job and everyone I work with has been amazing to me. He said no. He’d try and find me a spot in the shop but most likely no.\n\nWhat the hell? I’m with you for 2 months, you regularly tell me “good job today!” and never has he said anything that would’ve led me to believe I was under qualified or ‘not cut out’. They hired me to be a 3rd set of hands, that’s exactly what I made sure I was. What experience do you expect out of a 3rd year apprentice who’s 23 years old? The other installer is going on paternity leave in about a month. This just makes absolutely no sense to me.\n\n\nAnyone have any advice? Does this seem right to you? Or did I just get unfortunately f-cked? There’s no detail I’m leaving out, I’ve never made any catastrophic mistakes or incompetent decisions. I cannot figure out for the life of me why this would happen and why suddenly 2 months later I’m not experienced enough when everything was fine leading up to this point.\n",
    "score": 47,
    "url": "https://reddit.com/r/Carpentry/comments/1ls7rzy/just_got_let_go_on_probation_completely_unexpected/",
    "created_at": "2025-07-05T11:31:30.000Z",
    "num_comments": 98
  },
  {
    "id": "reddit-1hzrgkw",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "It's easy to take these things for granted in this line of work...",
    "text": "As I've been getting older and my priorities shift more towards being able to own a home and provide for a family, I'm often second guessing whether pursuing a career in carpentry was really a good idea or if I'm wasting my potential.\n\nI still don't know the answer to that, it's easy for me to be jealous of friends who seem to have found a cushy office job with a high salary with the option to WFH with nothing but a Bachelor's they've already paid off. At the same time, I know comparison is the thief of joy, and the grass isn't always greener.\n\nOne thing which I do love about this work is how often I am outside and getting exercise, even during the winter. Our species didn't evolve to be sitting at a desk staring at a computer screen. Exposure to sunlight, fresh air, and steady physical activity satisfies biological needs that are difficult to meet unless your profession involves getting those things.\n\nAdditionally, the shortage of people in the trades and getting into the trades in general really sets you apart as a young millenial / gen Z. I'm among the handful of people I personally know that can actually work on a house and fix things, or is just generally handy. The unique skillset makes you quite valuable as a guy to know.\n\nI've been lifting weights for years, was a wrestler for over 10, but I still think this line of work has hardened me in ways nothing else has. My pain tolerance is quite high; I hardly notice minor cuts and scrapes, I can endure hours of discomfort no problem, I essentially have no fear of heights anymore... roller coasters aren't exciting anymore but it's still pretty cool.\n\nI'm hoping the market changes and wages for carpenters increase relative to other careers. But even if it doesn't, it still provides an honest living and it's not too bad all things considered.\n\nWhat are some things you enjoy about the work?",
    "score": 39,
    "url": "https://reddit.com/r/Carpentry/comments/1hzrgkw/its_easy_to_take_these_things_for_granted_in_this/",
    "created_at": "2025-01-12T17:13:15.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1njw5a3",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Am I being paid accordingly",
    "text": "Hi, I live and work in Vancouver BC, which if you know is an extremely expensive city and I’m a apprentice carpenter working residential framing multi million dollar custom homes and architectural concrete.   I have two years of carpentry under my belt and another year of labour before that I can read blueprints and work on my own without much instruction and I have my own tools and truck. Making 29$ n hour and I’m not upset but also just want to see what the ballpark of other ppl my skill set and experience are getting. ",
    "score": 34,
    "url": "https://reddit.com/r/Carpentry/comments/1njw5a3/am_i_being_paid_accordingly/",
    "created_at": "2025-09-18T02:09:19.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1hpwyfn",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Fellow self-employed carpenters, how would you rate your income and overall happiness? ",
    "text": "I know this has likely been asked before but it's been on my mind a lot lately as the year comes to a close.\n\nA little background, used to work in various administrative positions, about seven years back I was deeply unhappy and quit. I took big a pay cut to work with some friends doing home remodeling, I was basically the gofer, sweeping floors etc.\n\nA few years ago said friends and myself left the company we were working for to go out on our own. At first I loved the flexibility/freedom and didn't care what we made money wise. But now going into our fourth year I'm finding myself at a critical juncture and trying to decide where to go from here.\n\nMy two partners at the company have very low financial needs and don't want to work a lot. For the past few years we've worked on average 30 hour weeks and made about $25-35k each per year (in a medium to low cost of living Midwestern city). I find myself constantly needing to supplement our schedule with additional work to make ends meet. Juggling my own \"side job\" schedule and the commitments of the company is incredibly stressful and I still struggle immensely financially.\n \nMy partners insist that to make roughly $60k a year (the minimum salary I've stated I desire) we would have to work 60-70 hour weeks year around with no time off and try to subcontract extensively. But I'm just not entirely sure I believe this to be true. I think that we work too many short days, and don't quote high enough. Part of me is convinced that on my own, and with advertising (something we currently don't do and only really work off word of mouth) I could stay booked year around and easily make $60k a year doing paint and drywall alone. I have no interest in being a general contractor or taking a \"manager\" role as that just sounds joyless and counterintuitive to everything I love about this career.\n\nSo basically I'm asking is it possible to work a reasonable schedule and make a decent living or is that a pipe dream? Should I give up my flexible lifestyle and go back to doing this work for someone else to have a more solid and reliable income? \n\nSincerely,\n\nA Stressed Out Carpenter",
    "score": 30,
    "url": "https://reddit.com/r/Carpentry/comments/1hpwyfn/fellow_selfemployed_carpenters_how_would_you_rate/",
    "created_at": "2024-12-30T20:42:50.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1iugbb2",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "is it normal for carpenters to be put on salary? pros and cons?",
    "text": "Hi fellow carpenters,\n\nI’ve been working as a carpenter for about 5 years now, and I was recently offered the option to switch to a salaried position. I wanted to get some input from others in the trade — is it normal for carpenters to be put on salary, or is hourly more common?\n\nTo give some context, I don’t usually work overtime at the company I’m with, and if I do, it’s only a few extra hours here and there. And i don’t really discuss wages with coworkers at the company.\n\nAlso, what are the pros and cons of being on salary in the carpentry field? I’m weighing the decision and would love to hear your thoughts and experiences.\n\nThanks in advance!\n\nEdit: I’ve been with the same company for my entire 5-year career, and the company has around 40 employees. It doesn’t seem like they’re out to take advantage of me, but I’m still trying to figure things out since someone new bought the company a few months ago.",
    "score": 24,
    "url": "https://reddit.com/r/Carpentry/comments/1iugbb2/is_it_normal_for_carpenters_to_be_put_on_salary/",
    "created_at": "2025-02-21T02:35:35.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1nn6032",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Cricket on an exterior handrail?",
    "text": "I've been an apprentice carpenter for three years, mostly doing wood framing, steel stud, and concrete work, with only a touch of exterior finish work. I recently redid my parents front hand rail that had rotted out, and my dad wants to put something in so that water doesn't get trapped at the end of the handrail where it meets the post. I know that doing this in a roofing context would be a cricket, but I haven't ever seen one that small, or in that context, so I figure I would ask her before cobbling something together (right now my dad wants to form a shape out of JB Weld, so trying to provide an alternative to that looking terrible is a motivating factor). They live in the PNW, so lots of moisture over a long period of time is to be expected.",
    "score": 23,
    "url": "https://reddit.com/r/Carpentry/comments/1nn6032/cricket_on_an_exterior_handrail/",
    "created_at": "2025-09-21T22:44:22.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1k201dj",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "How much can/do London carpenters make?",
    "text": "I’m thinking of a career change and weighing up the costs of retraining with eventual salary.\n\nAfter say, one or two years of being an apprentice, what kind of salary bracket is on offer for a carpenter in London after say two, five, and ten years on the job?\n\nAnd how could specialisation factor into things?",
    "score": 5,
    "url": "https://reddit.com/r/Carpentry/comments/1k201dj/how_much_cando_london_carpenters_make/",
    "created_at": "2025-04-18T08:33:36.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1m68qmq",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Career advice (australia)",
    "text": "Any australian carpenters here? Id love some help. I'm 19, live in melbourne, and im half way into my IT course at uni. I hate it. I only wanted to get into IT because my mums in the field and told me theres lots of opportunities and high salary stuff like that. I did it in high school and ended up liking it but obviously high school IT is piss easy compared to uni so when i started uni i got a rude awakening. I started cheating in most of my subjects because of how much i struggled to engage and learn and i find it so boring. Ive mentally checked out already and cant see myself doing an office job and something i have no interest in for the rest of my life. So im pretty much set on dropping out, ive done 3 semesters already and i just cant keep doing it.\n\nI've been looking into doing something hands on and outdoors as im not very academically inclined and am better engaged with hands on things. Im a hard worker when i put my mind to things, physically fit id say and im good with my hands. Ive always enjoyed woodwork and building things and a career im interested in is carpentry. Ive been doing lots of research about whether its a good career but ive heard many mixed opinions from people on reddit and other socials too. Just tell me everything about the job/career the goods and bads and what you think i should do..",
    "score": 4,
    "url": "https://reddit.com/r/Carpentry/comments/1m68qmq/career_advice_australia/",
    "created_at": "2025-07-22T08:37:17.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1lh4bp2",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Has anyone here completed a UK Gov Skills Bootcamp and was actually offered an interview and laded a job because of it?",
    "text": "# Edit:\n\nI am not interested in personal opinions, rants or being patronised. Please only reply if you have actual experience with these schemes or know of better alternatives. Thank you!\n\nI’m especially curious about whether the job offers came through the bootcamp’s “guaranteed interview” promise, or if you had to continue the job hunt separately after completing it. Also, were the salaries competitive for your field (e.g., tech, cyber, construction)?\n\nWould love to hear what worked, what didn’t, and whether you'd recommend it to someone trying to switch careers in the UK.",
    "score": 1,
    "url": "https://reddit.com/r/Carpentry/comments/1lh4bp2/has_anyone_here_completed_a_uk_gov_skills/",
    "created_at": "2025-06-21T19:11:37.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1jwhrfg",
    "subreddit": "Carpentry",
    "soc_codes": [
      "47-2031"
    ],
    "title": "Someone from Canada?",
    "text": "My fiancée and I are determined to move to Canada in about two years. She is a perfect immigrant for the country, but I still need to adapt to a few things. \n\nI found out that carpentry/woodworking services are in high demand and pay a good salary. I don't work in this field yet, but I plan to start a course and seek out some experience while still here in my country.\n\nSo, I would like to make contacts and look for people who understand about this area and can establish a channel of communication with me to help me with any questions I may have. Anyone? 😃",
    "score": 0,
    "url": "https://reddit.com/r/Carpentry/comments/1jwhrfg/someone_from_canada/",
    "created_at": "2025-04-11T04:41:42.000Z",
    "num_comments": 34
  }
]