[
  {
    "id": "reddit-1o9pziv",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I spent 1 month working as an unpaid apprentice after 20 years as a Chef.",
    "text": "I have been struggling with my career lately.  The spark had been flickering.  I’ve spent a lot  of my career in management positions at high end- large volume restaurants and kept running into the same problems.    \n\nI came to a breaking point and decided to start over again in the world of fine dining as a Stagiaire in a restaurant chasing its third Michelin star. \n\nIt was hard.  Taking orders from people half your age and humbly saying “Yes chef”- but honestly it’s the best thing I could have done and I feel inspired in my cooking again.  I plan to repeat the experience again somewhere else next year- and would recommend this to any chef who feels “stuck” in their career.\n\nI made this documentary if you’d  like to know more.\n\nhttps://youtu.be/Tr8KJ4EdN_g?si=DHnPW99Cey5ZNWKH\n",
    "score": 6216,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1o9pziv/i_spent_1_month_working_as_an_unpaid_apprentice/",
    "created_at": "2025-10-18T08:01:17.000Z",
    "num_comments": 760
  },
  {
    "id": "reddit-1jmfrdz",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Remembering the time that I walked from a restaurant and they closed.",
    "text": "I worked at this bistro for 3 years, I was the sous chef for the final year. Almost to the day. Like the title says, I walked and they closed.\n\nMother’s Day week, I worked 106 hours and slept there once. Only paid for 50, since I was on salary, which amounted to $404 in 2022. That in itself is some shit, but I wouldn’t have left over it. Day after Mother’s Day, the owner tells me I’m not doing enough for the company. I was flabbergasted and sat with it all day.\n\nThe next morning, like 7am, I was out back with the executive chef smoking a couple cigarettes before putting together a catering and it just hit me like a ton of bricks, I’m not doing this anymore.\n\nI looked at the executive chef and exact words said “it’s been real man, I’m going home”. He laughed and then looked at me all concerned like really? “Yeah dude I’m for real, I’m sorry, but I’m out. It’s been a long ass week, it’s been a long ass day (remember it was like 7am I just got there), it’s been real dawg, I’m leaving.”\n\nHe went upstairs without a word, I wrote burn baby burn on the dumpster, and then got 2 trash bags full of all of the equipment I brought in from home for them, I stuffed 2 beers in my pocket, nodded to the EC and drove off.\n\nYou bet your ass that wasn’t even close to the first straw. I talked to one of my old employees after they closed and he said after I left it was complete mayhem, they couldn’t keep staff, cleaning went undone, they couldn’t find another lunatic to fill the role of sous there obviously, the EC got burned to the ground (hate that for him), hard drugs spread like a wildfire, food quality dropped massively, they eventually stopped getting their biggest catering customers and that bitch closed. For reference, our local food magazine voted us best restaurant of the previous year (my town is only 40k population). Lo and behold, I leave and they’re wiped off the map. Smiling as I type this. I’m not saying I’m the reason they were open, I’m not that arrogant, but I was the glue that held that kitchen together. Who didn’t do enough for your company? You fucking cunt, eat shit.\n\nA short victory story for under appreciated chefs everywhere. ",
    "score": 5087,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1jmfrdz/remembering_the_time_that_i_walked_from_a/",
    "created_at": "2025-03-29T05:54:10.000Z",
    "num_comments": 125
  },
  {
    "id": "reddit-1mtvo2r",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Why was this actually my experience managing a kitchen?",
    "text": "I managed a theater that served food and I swear to god it made me legitimately swear off working anywhere that serves food. I literally had to stop the cooks from throwing a fit every time a ticket got printed, I occasionally just decided to fire them randomly if they caused too many issues and the replacements did the same stuff. SURELY you can’t all be like this. I have plenty of stories ask away. \n\nThis is the only place *and department* in my career I’ve ever gotten mad enough to legitimately yell at employees. ",
    "score": 5061,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1mtvo2r/why_was_this_actually_my_experience_managing_a/",
    "created_at": "2025-08-18T19:19:34.000Z",
    "num_comments": 180
  },
  {
    "id": "reddit-1jatixd",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "For all my kitchen homies struggling with sobriety",
    "text": "10 years clean and sober today. Shit was hard af to go cold turkey and give up powder and vodka but worth it and my career has only went up since I made this change. I also got my family and myself back which is the most important thing.\n\n\n\n",
    "score": 3636,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1jatixd/for_all_my_kitchen_homies_struggling_with_sobriety/",
    "created_at": "2025-03-14T02:23:00.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1n5e764",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Here I am",
    "text": "I am 53 years old. I have been cooking professionally since 1989. I graduated culinary school in 1993. I have cooked professionally in Japan for 2 years, Ireland for 4 years, Thailand 2 years, Hong Kong 2 years. I have worked in Michelin star kitchens. I have had to work longer, harder, and more dedicated than any man in my field throughout the 90’s-2010’s. \n\nI have a lot to share. I have a lot to teach other cooks. I am blessed with a position to do both. \n\nI am not here to brag. I am here to share. Because that’s what our industry is all about; the learned showing the new guys what’s it all about. \n\nI celebrate  my Executive Chef status every day by giving back to everyone and anyone who wants to learn.\n\nThat is what’s it’s all about. Giving away what we know to the new generation of cooks, so that they may become better than us, and then away what they so that their new generation can become better still!",
    "score": 3610,
    "url": "https://reddit.com/r/Chefit/comments/1n5e764/here_i_am/",
    "created_at": "2025-09-01T03:33:10.000Z",
    "num_comments": 149
  },
  {
    "id": "reddit-1j5wii2",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I’m convinced that servers in the US don’t actually want to be paid a livable wage.",
    "text": "So I remember being a sous chef, I worked infinitely harder and longer than every server in the building, but my take home pay was $404 a week (I was on salary, that’s my own fault and not entirely relevant to this argument). Meanwhile, every single night I heard servers complain when they “only made $150 today”. Compare my 14 hour work day to their 5 hour work day.\n\nMy wife was a server for 7 years. There were some jobs where she hardly made anything, there were some jobs where she made bank and didn’t even have to think before buying anything. Here’s the main thing, you hear servers say all of the time in America “well maybe if we got paid a livable wage instead of relying on tips it would be different, but until then tipping is a requirement and if you can’t afford to tip then don’t eat out!” but I’ve offered to pay my servers a livable wage and split tips with the whole restaurant, (AFTER hearing them say that for weeks!) they all said they would walk out that same day if it went into effect. My wife tends to agree as well, they don’t want to be paid well, they want to rely on tips, because the earning potential is FAR higher that way. Furthermore, a server can quit anywhere and start anywhere else almost in a heartbeat, they don’t have to be there, if the money really really sucks, they can and will leave.\n\nOn paper, they make $2 an hour plus tips. In reality, they often make more than anyone else in the building. They have the POTENTIAL of making $30-50 an hour. Hell I’ve seen bartenders make upwards of $100 an hour some days, so why the fuck would they accept a measly $20 an hour? I wouldn’t in their position and you wouldn’t either, it’s just basic math, so it’s all bullshit to get you to feel bad and tip more.",
    "score": 2351,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1j5wii2/im_convinced_that_servers_in_the_us_dont_actually/",
    "created_at": "2025-03-07T18:46:40.000Z",
    "num_comments": 708
  },
  {
    "id": "reddit-1nb8n68",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Anyone else restaurantify their home kitchen",
    "text": "What upgrades big or small have you done. I’m sure some out there have full professional kitchens at home for fun or business. I do not. I do have a serious monster butcher block and metro shelf kitchen table bakery table with black pipe pot and pan rack. Recently god rid of my home fridge and have a single door reach in and small chest freezer. Total life upgrade. Magnetic knife bar for my home knives. Plus a half tall sheet pan rack w sheetpans that is my catch all rack of shit. \nJust curious what else people have got for me. ",
    "score": 2076,
    "url": "https://reddit.com/r/Chefit/comments/1nb8n68/anyone_else_restaurantify_their_home_kitchen/",
    "created_at": "2025-09-07T23:47:57.000Z",
    "num_comments": 268
  },
  {
    "id": "reddit-1mmjodu",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "I like this a little too much",
    "text": "Usually most places Ive worked are thankfully a) not that hot and b) have a foh team that are really vigilant about the well-being of the kitchen",
    "score": 2000,
    "url": "https://reddit.com/r/Chefit/comments/1mmjodu/i_like_this_a_little_too_much/",
    "created_at": "2025-08-10T14:15:02.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1jrg8y7",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Don’t go to culinary school. Don’t do it.",
    "text": "This is not a message for everyone, this is a PSA for anyone who has never worked in a restaurant that’s about to go through or is considering going through culinary school, so they can be a chef. If you’ve been in the industry for a while, you enjoy it as a career and you feel like going to culinary school, this isn’t for you. \n\nThis question is asked all of the time, should I go to culinary school. My two cents, absolutely not. First things first, return on investment is very low. Secondly, it doesn’t matter if you’ve gone to the culinary institute of America, you’re not going to start out as a sous chef. You’ll be at the very bottom, same as the guy who didn’t go to culinary school and within 2 years you’ll both have the same knowledge database, assuming the other guy is passionate and asks questions, except he won’t be in debt. \n\nI’ve seen literally no exaggeration hundreds of culinary school graduates who start in a restaurant and nope the fuck out within a few months, then switch to a different career. See if it’s actually what you want to do first, at least. It’s not like what you’re probably imagining. The hours are grueling, the pay is shit unless you land a good corporate gig, rarely will you find benefits or paid time off, holidays are gone, your coworkers will know you better than your family. With that said, obviously people do this for a reason, including myself. That reason is passion. It’s easy to have passion for cooking when you aren’t a cook. You may love making a dish using chicken thighs, but stand in one spot for 3 hours cutting chicken thighs and tell me how you feel about chicken thighs. I promise the answer is fuck those chicken thighs lol. You love making cheesecake, so do I, I’m a slut for cheesecake, but I’ve made thousands of them and my view on the subject is probably less romanticized. \n\nBe a chef, by all means, we welcome you with open arms. I love this career, there’s almost nothing else I’d want to do, this is the life for me, it could be the life for you, but for the love of god, don’t go to culinary school. ",
    "score": 1668,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1jrg8y7/dont_go_to_culinary_school_dont_do_it/",
    "created_at": "2025-04-04T16:34:06.000Z",
    "num_comments": 250
  },
  {
    "id": "reddit-1osmc9c",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Feeding hungry parents and kids until this sub says SNAP is fully funded (day 6)",
    "text": "Well another slower Saturday then expected, which is a positive sign.  45 last night, 68 Friday, 132 Thursday, 156 Wednesday, 118 Tuesday, 400 last week.\n\nLooks like most of the SNAP benefits went out in Clark County, although we did hear from several folks that came in that their balance on the card still says \"pending,\" so we will continue to run the special into next week.\n\nAnd even after this cruelty to our own people is behind us, the Pay in Forward Board is now a permanent fixture in the restaurant, as a testament to the good and generous people of Clark County, and how easy it is to find yourself on the other side of hunger.\n\nSo if ends aren't meeting and you and your family needs a hot meal, simple pull down a ticket and we will feed you.  Those tickets don't belong to me, they belong to you, the people of our community.\n\nWith love-\nChef Steve",
    "score": 1516,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1osmc9c/feeding_hungry_parents_and_kids_until_this_sub/",
    "created_at": "2025-11-09T15:36:18.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1m7u09e",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Michelin Star \"chef\" can't pay his vendors PART 2: RENT IS DUE",
    "text": "Link to the original post if you didn't see it before ⬇️\n\nhttps://www.reddit.com/r/KitchenConfidential/s/3X5s1UgV30 the\n\n\nSo here's a fun little update. First of all, I already found a much better job so I'm jumping ship immediately like everyone commenting on the original post was saying. But today I found this notice just sitting right on top of the printer in the office. Given the balance due, I can only assume he hasn't been paying the lease at all since we opened. I don't care about professionalism anymore because this man who has the audacity to call himself a \"chef\" doesn't know the meaning of the word. People who fuck up this badly in this industry deserve to be outed for the sake of all the people whose livelihoods they disrupt. \n\nTo recap, the \"famous award-winning chef\" Matt Horn managed his multiple restaurants so badly that he couldn't pay his employees, his vendor, and now his rent on time. Barely 4 months after opening his Elk Grove location, we're already about to get shut down because his obsession with being a restauranteur has prevented him from paying for his existing locations. Instead of just being happy with having one or two popular, profitable, well-managed locations, he decided to open multiple locations at once in cities that are HOURS away from each other.\n\nHe's been dumping all our money (yes, our money, because we haven't been getting paid on time) into opening a location in Fresno because that's his hometown apparently. If you aren't familiar with Fresno California, it is a certified shit hole. And it's a 3-hour drive from the Elk Grove location. Fresno is hardly what one would consider to be a culinary tourism destination. But yeah, it makes perfect business sense to open an expensive BBQ restaurant in the crime-riddled, drug-infested armpit of California. I'm sure all those people doing the fent fold outside the front door of the new restaurant will draw huge crowds!\n\nIf Matt sees this, I want him to know he has no business being in our industry. You were a retail salesman who decided he wanted to cook, and you got lucky on social media where you can construct and influencer narrative to make yourself look good. Just because you can smoke some meat and post a cool video doesn't make you a Chef. Chef is a title you earn after years of hard work and experience in our industry. You never worked your way up like a real Chef. You never worked in any real restaurants at all. You never even bothered to learn the most basic business practices necessary for running a restaurant properly. You don't get to hurt your employees by making them late on their rent and car payments. You're a joke. You wear big your stupid cowboy hat and sit out there in the dining room doing social media interviews acting like you're some hot shot while your employees, vendors, and landlord are all asking where the hell their money is. Shame on you, Matt. Shame. Do our entire industry a favor and sell your locations, cut your losses, and get a job as a line cook in a real restaurant so so you can learn how restaurants are supposed to be run. \n\nAnyway, thanks for letting me rant. Hope you guys enjoyed it. I'm washing my hands of Horn BBQ and \"award-winning chef\"  Matt Horn. I'm not even going to bother following him to see his career crash because I can already see the trajectory. ",
    "score": 1421,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1m7u09e/michelin_star_chef_cant_pay_his_vendors_part_2/",
    "created_at": "2025-07-24T03:42:42.000Z",
    "num_comments": 254
  },
  {
    "id": "reddit-1i9qow8",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I love how genuinely merit based this industry is",
    "text": "~You're gay? Doesn't matter so long as you can cook\n\n~undocumented immigrant? Just keep flipping burgers man it doesn't matter\n\n~disenfranchised by society and generally looked down upon? Hey we've all been there before just keep firing all day\n\nAs a trans person I've gotten more love and support from kitchens and my fellow restaurant coworkers than I ever have from my own home or government. One of the very first conversations I had in a kitchen with a chef when I was 18 went something like this\nMe: \"Hey I use different pronouns than what's on my ID is that a problem?\"\nChef: \"huh? No Idc I need a cook and you can cook. I'll call you whatever you want just don't burn the bacon\"\nI love this industry and I wouldn't leave it for even the most cushy 9-5 120k+ salary job. \n\nStay strong out there chefs and remember no matter what your race, gender, sexuality, politics (unless it's just pure hatred) you're welcome in the kitchen to give us a hand\n",
    "score": 1005,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1i9qow8/i_love_how_genuinely_merit_based_this_industry_is/",
    "created_at": "2025-01-25T16:29:24.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1nsk48w",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I left commercial kitchens for something different and heres how it goes...",
    "text": "For the past 14 years I have been a salaried chef.  Constraints of labor statistics literally put me in a position of *needing* to work 60 to 80 hours a week.  I didn't have a choice.  It was my name on the menus and my pride wouldn't let my places of employment fail.  \n\nOver the years i experienced coming home to my wife crying because I had to shower, go to bed, and wake up st 5a to go back.  I missed my kids school plays and concerts.  The 1000s of times I came home to cold dinner in the fridge, I missed having dinner with my family again... But this was all I knew.  I was in my 40s, a career change now wouldn't keep the mortgage paid. \n\nI tried different things- healthcare, higher ed... nope..  no change.  Still the same grind but with even more toxicity in some cases.  So I stuck with higher ed, because at least there were some \"breaks\" where things slowed down for parts of the year.  \n\nI kept watching Indeed.  Will my perfect job show up?  The job market worsened and I felt a deep depression.  I felt stuck.  Burnt.  Aging and fucking *stuck.*\n\nA few months ago something popped up that really piqued my curiosity.  A union job managing a grocery deli (a 14k yearly pay cut, but hourly pay with insanely good benefits.)  Immediately I started researching.  Were my skills transferable?  \n\nI applied.  I had to lie about family emergencies to go interview.  I met the GM.  (Great dude, we hit it off immediately.)  We talked about a day in my life at my work.  A day in the life of a hypothetical deli manager.  And they lined up.  Big time.\n\nI accepted the position two days after interviewing.  Asked for a three week start date so I could enjoy a 1 week breather.   They obliged without hesitation.  \n\nThe job-  holy shit, folks.  I get to schmooze with the customers.  We talk about food.  There is a lot of surprise in customer's eyes as i suggest cheeses to go with their freshly sliced meats and give advice on recipes to take them over the top...\n\nI work 7 to 3.  I am *forced* to take the two 15 minute mandated breaks.  I had to get used to my staff not hustling 24-7, but shit, we get everything done, and our clientele genuinely seems thrilled with our foods.  I get to use my skills with our shrink (waste in the chef's world) and spread it into corporate recipes, helping the bottom line. Easy.  \n\nI will always miss the creativity, but that desire is fulfilled in a different outlet... cooking dinner for my family every night.",
    "score": 874,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1nsk48w/i_left_commercial_kitchens_for_something/",
    "created_at": "2025-09-28T09:35:51.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1m0db7s",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I just found out my girlfriend (admin officer who constantly complains about having nothing to do at work) earns the same salary as me (head chef who works 55+ hours a week)",
    "text": "this really is a chump's game isnt it?",
    "score": 797,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1m0db7s/i_just_found_out_my_girlfriend_admin_officer_who/",
    "created_at": "2025-07-15T09:33:58.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1mo009a",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "The salary is worth it but ooof.",
    "text": "Closer called out and nobody could cover. 20 person party ended up being a 60 person party and had two new people on tonight. Cheers and here’s to hoping it doesn’t happen again 😂👏",
    "score": 765,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1mo009a/the_salary_is_worth_it_but_ooof/",
    "created_at": "2025-08-12T05:14:56.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1l5lil8",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Dont let anyone dim your light‼️",
    "text": "One day when I first started at a previous job the Executive Chef told me \"I would never go anywhere in the culinary world\" because I wouldnt let me him berate me and yell in my face.\n  Today im an Executive Pastry Chef making 58k base salary (65k if you wanna include quarterly bonuses.)\nI held on to that memory to 1. Spite that guy and 2. So I can train future cooks better than I was, with compassion and hopefully inspiration.\n\nHolding grudges is healthy for you‼️",
    "score": 398,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1l5lil8/dont_let_anyone_dim_your_light/",
    "created_at": "2025-06-07T14:00:39.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1ltt8n9",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "The Best Cooking Job Ever",
    "text": "I worked as a chef for years. No weekends off. Every day all summer. No time with my kids. Fighting for overtime. Stressed. Eating Tums like M&amp;M's. I was burnt out. Tired. Done. And then I found this job. Working on research vessels all over the world. I cook breakfast, lunch and dinner for a crew and staff of 40ish people. I have 2 support people. I work from 5am until 7pm with a two hour break in between. I've been to 40 countries. Snorkeled in Guam. Climbed a glacier in Alaska. Hiked a mountain in Hawaii. I work for 60 days and then have 30 days off. PAID. This summer I'm taking my family to Europe for 3 weeks. Sounds amazing right? You should try it. I want you to.\n\nNOAA's hiring freeze should (fingers crossed) be lifted on July 15. If you are good chef, good at cooking, training and planning then I'd like you to consider coming to work for NOAA. There are some requirements. You need a Merchant Mariners Credential (possibly being waived, NOAA will help you get in first year), a TWIC, a passport, your vaccinations and a basic safety course. It all takes time and about a $2000 investment. But I am telling you that this is an amazing job with excellent benefits. Health, Dental, Vision. Thrift Savings Plan for retirement.\n\nYou do need to be THC free. The return is worth it.\n\nMust be US Citizen.\n\n4 months a year paid vacation. Real time with your family.\n\nI've attached a copy of my latest paycheck to verify what I am saying is reliable.  Sometimes you get laiud up at a dock or do repair yard work and then the pay isn't this good but it's still $3000 or so.\n\nMessage me if you are interested and we'll chat. If you are good at what you do then I'll help you with the process and introduce you to the hiring staff.\n\nLooking forward to hearing from you!",
    "score": 393,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1ltt8n9/the_best_cooking_job_ever/",
    "created_at": "2025-07-07T12:46:07.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1k7w0m8",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Day 3 at the Michelin-Star Restaurant",
    "text": "Third day.\n\nWhen I arrived today, I was mentally prepared for the tortellini, so I reported myself to the sous chef for assignments and asked if I should start with them—but he said not today. Apparently, I made enough for the week, so the tortellini will have to wait.\n\nI started with peeling some cucumbers, and then he showed me how to dice them into pretty fine cubes. I diced them all, and then he showed me how to marinate them. After that, we blanched some cherry tomatoes for tomato mayonnaise and marinated a few big ones for tomato vinaigrette.\n\nThen we had lunch, and service started.\n\nDuring service, I had a bit of autonomy. I was making amuse-bouche and desserts and helping the other two chefs with plating. When the service ended, me and the sous chef baked some biscuit cakes and made crème for them. After that, we had a short break.\n\nWhen we started working again in the evening, the chef taught me how to make “boats” out of potatoes. The inside had to be a perfect 8 cm, and the total weight had to be between 60–65 grams. I broke a few, but it was my first time. All the waste is going to be used to make potato purée, which is what fills the boats later. They took me a really long time, and I had to stop making them when the service started and go back to preparing amuse-bouche.\n\nThe service was once again great, and we had a new reinforcement from a mini-jobber who used to work in other Michelin restaurants.\n\nWhat struck me most today is when I was making amuse-bouche and couldn’t find the Parmigiano. I started to look for it, and one of the chefs came to me with it and told me:\n“You are not alone. We must work together and together we are strong.”\nThis really hit me, because I used to work in a really toxic environment where every man was for himself and everyone had an ego as big as the Empire State Building. So I was shocked—and I mean it in a good way.\n\nWhen there was just one table left, the sous chef asked me if I could decorate the cake and told me to use anything I find, but to remember that the star is in everybody’s hands, not just the chef’s. I made it—it’s not the best of the best, but I don’t think it’s super bad for the first time. The sous chef said it’s good and sent it out.\n\nAfter that, we cleaned and went home.\n\nNow I just want to say this:\n1. Sorry for not replying actively.\nI need to concentrate on the job, so I’ll usually reply later.\n\n2. Why I write all of this.\nI spent 5 years in a really toxic place. I love food, I love the process, but I said to myself: I will travel into the world for 2 months, and if I learn something, I’m going to stick to this job. But if I don’t—maybe it’s better to leave now.\nTo explain: I got abused by my coworkers and the chef. Once, after 25 straight days at work—doing breakfast every morning and finishing at 23:00—I was tired and burned my foot. The chef saw it and said I needed to finish the service or I wouldn’t get paid my monthly salary. I finally stood up to him and said, “Fine, we’ll see each other in court,” and he left the kitchen during a busy dinner service.\nIt was up to me to either go to the hospital or help my coworkers—so I stayed, like an idiot, jumping on one foot in constant pain, and managed sauté.\nAfter that crazy day, I went to the hospital. The burn was bad and they insisted on sick leave, but I went to work anyway. I had to go every two days to get the bandage changed so it wouldn’t get infected. The chef told me I had to do breakfast that day, and I said no, I need to care for my foot. He took me by the neck, bashed my back over the kitchen counter, and said, “You think you’re special that you don’t have to do breakfast?”\nAfter that, it all spiraled down.\nThe burn is still there. I still have problems with small movements in that foot, in case anyone thinks it was probably just a small burn.\n\n3. To all chefs out there:\nPlease treat your cooks with respect. We are trying. We are working just like you. We don’t deserve to be treated like trash from the streets.\n\nThe image is of the cake I made this evening.\n\nThank you for reading this and for all your support and tips—I really appreciate it.",
    "score": 347,
    "url": "https://reddit.com/r/Chefit/comments/1k7w0m8/day_3_at_the_michelinstar_restaurant/",
    "created_at": "2025-04-25T21:11:22.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1jl6zrw",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "I’m 23 and just got promoted to “executive chef.”",
    "text": "Just venting a moment.\n\nSo I work at a distillery and restaurant and just got promoted to be the executive chef. I worked my way up from part time fry cook, in an 8 or 9 person kitchen over the course of a little less than 2 years. I went to a community college 1 year culinary program while working at another place. In total I only have 2.5 years of industry experience. \n\nI’ve been salary at this place bustin my ass putting out specials, running events, do ordering prep work, all of it. I am talented in running a kitchen and making food. But I’m already feeling burnt the fuck out with the work that I’ve put in. Trying to make this a place I’m proud of, and keeping this place profitable. Now the only guidance I had in this, the previous exec, is leaving. And it’s my time to take the reins. It just feels so early in my career. I’m already starting to resent the place. \n\nI already accepted the position cuz the money is huge for me in this industry, and the experience is great for my career. but the only fuckin thing I want is to fuckin take a hike, go on a trip, spend the summer in the sunlight for once in my adult life. I have a girl and I want to be with her now, not in 120° heat of the kitchen all day.\n\nHypothetically this would be a great time for me to put together some awesome seasonal menus, really show people what can be done when I’m leading the kitchen, but I fucking am exhausted already, and I don’t think with all the work I’m doing, Ill be able to put out the creativity as when I was a salaried cook or sous with a little less responsibility.",
    "score": 276,
    "url": "https://reddit.com/r/Chefit/comments/1jl6zrw/im_23_and_just_got_promoted_to_executive_chef/",
    "created_at": "2025-03-27T15:45:36.000Z",
    "num_comments": 111
  },
  {
    "id": "reddit-1k02lv1",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "I am currently a chef at a 3 Michelin star restaurant in NYC but would like to start a family relatively soon. I want to transition to a career with reasonable hours and of course more money. What are some good choices for a career switch?",
    "text": "I am focusing on joining restaurant design firms but would appreciate any advice people could throw my way. Thank you!",
    "score": 276,
    "url": "https://reddit.com/r/Chefit/comments/1k02lv1/i_am_currently_a_chef_at_a_3_michelin_star/",
    "created_at": "2025-04-15T20:45:30.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1hv8dhq",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "We all know pay is usually shit for BOH. What do yall consider reasonable/average for a salaried chef?",
    "text": "*Mods I know surverys aren't allowed, and I'm not sure if this counts. Please delete if not appropriate*\n\nI have been in the industry for 9 years, going into my second year as an EC. I consider myself very lucky to be making 75k base salary with quarterly bonuses (HCOL area). I work 50-60 hours a week in a high volume restaurant. \n\nWhat do you guys make? What do you consider reasonable? I know BOH generally always makes less than they should given the skill and effort required for the job, but I have no idea how much other managers generally make. \n",
    "score": 243,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1hv8dhq/we_all_know_pay_is_usually_shit_for_boh_what_do/",
    "created_at": "2025-01-06T20:06:28.000Z",
    "num_comments": 164
  },
  {
    "id": "reddit-1iu85g7",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I know this is normal now but jeez (rant/vent)",
    "text": "For context minimum wage is $16.50 where I live- but $18/hr for a full time position at a MICHELIN STAR restaurant?? I know those benefits are good (especially for the industry) but the pay is just baffling to me. Is this a typical salary or am I just a spoiled millennial? ",
    "score": 177,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1iu85g7/i_know_this_is_normal_now_but_jeez_rantvent/",
    "created_at": "2025-02-20T20:15:01.000Z",
    "num_comments": 146
  },
  {
    "id": "reddit-1l4aq2m",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Random Job Offer I Received Last Year, Lol",
    "text": "Just asking for more than what I make now, ya know, to switch to such a lucrative job.🐭🧀💸",
    "score": 176,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1l4aq2m/random_job_offer_i_received_last_year_lol/",
    "created_at": "2025-06-05T21:09:52.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1k3d09b",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "This weekend nearly broke me.",
    "text": "So we have been open for about 3 years now. The first year our Good Friday was slow because we were still new and word hadn't gotten around. Last year on GF we did about $5000 in sales. This year we did nearly $7000 in sales. To put that in perspective, a really good Friday would be around $3500-$4000 in sales. \n\n  \nLast night our expo walked out middle of supper rush and just abandoned us. Needless to say by the time we were finally done everyone was exhausted, we were beat down and burned out. My boss said just do the -absolute- min we had to do to get out, as he didn't want to have to pay 1.5X pay just to do cleanup and dishes, and that he would come in early today and do them all. \n\nAfter working a 14 hour shift (Everyone else worked 6-8 hour shifts) I didn't say boo, I was completely and utterly exhausted as literally $5000 of that $7000 sales were fish and chips and I am on fryers. \n\n  \nSo today I woke up and was already tired and ready to be done but stuff had to be done, prepped, cleaned etc. for tonight so I was at work at 10:30 this morning. I was already pissed off at my boss for other BS stuff when he calls me at 11:00 wondering why I was at the restaurant already (I am kitchen manager and put in 2-3x as many hours as everyone else) and I told him I had a TON of stuff to get ready for tonight, etc. He tells me he needs to go to the bulk produce store to get a box of sweet potatoes and then he would be in to help with cleanup. AT THREE THIRTY HE WALKS IN AND ASKS WHY THE KITCHEN IS STILL A DISASTER!!!!!!!\n\n  \nOn top of that we had a PVC pipe break in the basement leading to a bunch of water pouring directly onto the hot water tank, shorting it out, so no hot water for the night...\n\n  \nI told my boss I am not working till Wednesday as I needed a few days off to rest after a brutal few weeks and I am VERY strongly looking in to a anonymous tip to the health inspector about the lack of hot water and putting out some resumes as, to be blunt, my boss cannot afford to pay me what I am worth. (I do all the scheduling, inventory, most of the ordering, deliveries, most of the prep, I open-close 6 days a week, average 55-65 hours per week and am paid 40 hours per week salary(I know)) ",
    "score": 174,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1k3d09b/this_weekend_nearly_broke_me/",
    "created_at": "2025-04-20T02:57:10.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1lh5lu6",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Kitchen nightmare",
    "text": "This is just a vent post cus idk what to do or feel at this point. I’ve been working at one of the last running Whiskey Creek steakhouses for the last three years. I am 21 years old and when I first started there where three other cooks all my age with one being the bosses son and kitchen manager. This year I am the last man standing and the only cook with any experience because the boss and his son and other cook left to start their own place. When the new management came in, she brought like 4 of her friends from her old restaurant to help. One of them was a kitchen manager. I was concerned because that was the position I wanted now that I was the only one with experience, so I talked to her about it and she told me that upper management was not allowing us to have a new kitchen manager now that the last one was gone because they don’t want any more the kitchen staff on salary, an that yes she had brought her in to be the kitchen manager but was not able to. \n\nAlarm bells ringing. How is a kitchen supposed to operate without a lead?! Well that’s what we have been doing for the last 6ish months and it’s been hell. Everyone needs my help or knowledge. I’m doing all the training, I have to cut my crew based on labor. consistency and quality are out the window, not to mention the kitchen schedule is always posted late and truck is ordered incorrectly leading to not enough inventory.\n\nNow let’s talk about wage like I said three years now and I just got my first raise with the management shift, and don’t get me wrong I will always be grateful for $18 an hour but when I have not broken 40 hours a week since I started working here it puts me on edge. And that is not an exaggeration. The amount of times I have been cut early because I am getting close to 40 hours is incalculable, it makes me feel like shit when I know the most I can ever make off a paycheck is 1100, and the fact that the servers can make that in two weeks (also not an exaggeration we are one of the busiest restaurants in our town they make bank).\n\nAll of the equipment is half broken it feels like, we haven filtered our fryers since I’ve been here because we don’t have a filter. we’ll boil out and scrub (which I do) weekly. \n\nIdk last night I didn’t start he smoker and wasted like 500 dollars worth of meat and no one was even upset with me. It sounds scuffed but I just want to take pride in my work.\n\nAlso it’s hot as dick, like over 100 air temp",
    "score": 173,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1lh5lu6/kitchen_nightmare/",
    "created_at": "2025-06-21T20:09:22.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1iudb1g",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "was let go today, lol.",
    "text": "whopping 3 week run as head chef. was told they couldn’t afford to keep me on salary, offered an hourly position but was too much of a pay cut to accept. took it as a sign and moving forward with my own business plans now of opening a ramen bar. cheers chefs🍻",
    "score": 151,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1iudb1g/was_let_go_today_lol/",
    "created_at": "2025-02-20T23:56:51.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1k9p45j",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "5 months later and this was a strange one.",
    "text": "Place had no CDC or sous. Me and another guy shared the responsibilities of both without titles or the salary that comes with them. We fixed a lot of problems there, but still there were a lot that were out of our power to change. Not shitting y'all, one guy straight up when fishing on the clock 4-5 times a week for 30 minutes - an hour and a half. Absolutely wild stuff. \n\n I'm leaving the place better than I found it though and moving to a proper exec gig after fucking off to Europe for a couple of weeks. What an insane line of work. ",
    "score": 149,
    "url": "https://reddit.com/r/Chefit/comments/1k9p45j/5_months_later_and_this_was_a_strange_one/",
    "created_at": "2025-04-28T06:39:10.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1n8qb5q",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Go down with the ship?",
    "text": "The Owner has started telling staff that he’s not able to renew his lease and will be closing in the spring. He’s told me that he will be planning extra events to get more income and work the salaried people harder, but has no plan to stay open regardless. I’ve just passed my anniversary with the restaurant as the CDC (no salary increase due to circumstances ) and can find work in the area well before this push comes.\n\n\nAITA for wanting to jump ship before all this starts up knowing it’ll be more work just to end up closing?",
    "score": 95,
    "url": "https://reddit.com/r/Chefit/comments/1n8qb5q/go_down_with_the_ship/",
    "created_at": "2025-09-04T23:59:33.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1i2yaqs",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Investors want me to run food truck ",
    "text": "For context, i’ve been running a food pop up for about a year and a half, wood fired pizzas, smash burgers, birria tacos mostly. I’ve built a really good clientele of at least 100 regulars who support me and i’m super grateful, i do private caterings and dinners on the side as well as a part time job in nice italian spot mon-thursday. The owners of the brewery I most frequently pop up to want to buy a food truck and have me run it. Im excited about the opportunity, but want to ask my favorite subreddit to weigh in. Essentially, they would buy it, get it licensed and do the marketing. I would just have to come up with menus, and run the operation. I’m just not sure what to negotiate pay wise, would it make more sense to negotiate for a salary, or a percentage of profits. One thing that kills me is i’ve been the sole owner of my food venture and it feels fucking amazing to make all the money, and i understand that won’t be the case if i go forward with this. Although I get the opportunity to build a brand and name as a local chef with no investment. Have any of you been in a similar position? If so any advice or guidance would be really helpful. Right now i’m making probably 75k with my part time job and weekend pop ups, but i’m working a ton and i’m all over the place these days, would like to just focus on one thing. ",
    "score": 87,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1i2yaqs/investors_want_me_to_run_food_truck/",
    "created_at": "2025-01-16T20:20:18.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1jb6vqu",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "How bad of an idea is it to walk out right now?",
    "text": "Fellas if you go through my post history you can see I've had this same issue several times. Well. Now the CEO wants salaried managers to work 60 hours a week, even working 6 days if needed. I make 63k salary plus bonuses that could bump up to atleast 80k. \n\nBut guys. I am so burnt out. I know my store is struggling. I am pretty much the only manager. I'm supposed to interview/hire/train, make the schedule, do truck orders, do inventory. Yeah. You get it. The workload of 3 managers is all being placed on me. \n\nAnd it's not just my store. A majority of locations are lacking managers. \n\nI can't do this anymore. My feet hurt. I'm exhausted. I don't have any energy. Physically, mentally, emotionally. I cry in my car sometimes before each shift. \n\nI have a bit of savings. Not a lot. I had a pet emergency 2 weeks ago and that almost wiped me clean. But I can do like 2 weeks without a job. I'm already looking. For anything. But I can't keep doing this. ",
    "score": 74,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1jb6vqu/how_bad_of_an_idea_is_it_to_walk_out_right_now/",
    "created_at": "2025-03-14T15:41:41.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1m8lz4n",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I had to cry in the walk in for the first time",
    "text": "I had to put down my cat last tuesday. I had that day off with my BF and we made the decision that it was time. The poor boy was just suffering. Massive dose of barbituates after he was under a general sedative and it was all over. Just peaceful. Poor boy was only 6 but cancer ate him down to the bone. It was one of the worst days of my life.\n\nI called my chef on monday to tell him that i could not come in on tuesday, my day off. Schedules are always subject to change in the industry. Sometimes you just get a shitload of reservations and need more people. I get it. So i called to say that Tuesday, i could not be on call for that reason. He was apologetic of course and said \"you're ok, we got other people. Sorry it came to this. My daughter went through that last year and was broken up about it for months. But are you good for wednesday? because we got a lot of people then and we need your help.\n\nSo i show up wednesday. I was off my game. I was just kind of out of it. Going through the motions, needing more direction as to what i should be doing next than normal. Of course i was, given the day i had yesterday. And then for service, I perform. The exec, who is a good boss but over the hill and just putting in time before he retires to the south, he's laughing it up with the sous who is working cold side. meanwhile me and this other guy - who is the real backbone of the kitchen who makes all the shit happen - are putting up the buffet taco menu we got for that night. He did the steak and beans and marked the tortillas on the grill, while i did the ground beef and chicken and rice. And it was upsetting. We're the two lowest paid guys in the kitchen and we're doing the important part while the highest paid salaried guys did the easy part. and we had 2 other cooks in the kitchen helping them and doing prep for saturday. The backbone guy and I wanted some help. And the foh manager noticed and asked us what was up. And the backbone guy just told her straight up how it was bullshit he gets all this responsibility and none of the pay, and i second it saying \"i don't like how they're running it compared to last year\" when we had a different sous who quit over conditions, and then said \"it's not right and unfair to both of us, but especially to (the backbone guy).\n\nThen it hits me that my cat won't be there to say welcome home and make biscuits against my chest and bicep while i play on my computer and pet him. And i'm also hot as fuck because it was a hot day and i'm in a kitchen, so i go to the freezer and just cry once the buffet is closed because i was at a breaking point. That was the best part of my day, when i came home to him. \n\nThe next day the exec and sous pull me aside and ask what happened and why backbone guy and I had bad attitudes that day. I tell them straight up that the backbone guy and i felt under the gun while you guys and the 2 other cooks were taking it easy on cold side prepping for saturday, and that it was also one of the worst days of my life and that i had to cry in the freezer because of how shitty everything was with me relating to my cat and that i'm sorry i let my personal life affect my work. They understood and things were fine. Backbone guy said to me that i was a better man than him because there was no way he'd be there after something like that. I told him i wouldn't put him in that position because then he'd have been even more in the shit and he's taught me too much for me to do him like that. \n\n  \nAnyway, i wanted to share about the first and only time i've ever had to cry in the walk in because of how shit the day was. Usually i just get mad and go outside and smoke a cig and curse people out in my head. ",
    "score": 66,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1m8lz4n/i_had_to_cry_in_the_walk_in_for_the_first_time/",
    "created_at": "2025-07-25T01:14:18.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1nnejgd",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Is this offer for General Manager worth it? $70K a year for 62 hours a week.",
    "text": "This is a salary position for GM.\n\nIt is All-You-Can-Eat Sushi restaurant in Southern California. It is located at an outdoor mall.  \n\nI don't have any manager experience. I just have sushi chef and cook experience. But he said he will train me thoroughly and teach me everything about management.\n\nHe said I will work minimum 5 days a week (12 hours x 3 days &amp; 13 hours x 2 days). So 62 hours total.\n\nBut he claims that I will only work 52 hours a week because I get 2 hour breaks.... I don't know if I agree with that. I would still count those 2 hour breaks as part of my working hours because I am still going to be at the restaurant. Also something could go wrong and my staff would need me to be on-site. So even during breaks I'm technically still working and on-call.\n\nAnd of course, he said I will have to cover shifts if someone doesn't show up. So sometimes I will work 6 days a week. Obviously I would have to cover for every and any shifts - server, host, cooks, sushi chefs, etc.\n\nWhen I calculate $70K a year for 62 hours a week, it only comes out to be $21.71 per hour.\n\nThoughts?",
    "score": 60,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1nnejgd/is_this_offer_for_general_manager_worth_it_70k_a/",
    "created_at": "2025-09-22T05:55:40.000Z",
    "num_comments": 148
  },
  {
    "id": "reddit-1kjlq5f",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Just got a job without necessary experience — now I’m overwhelmed and not sure this is what I want",
    "text": "So, I recently landed a job in a fine dining restaurant inside a private club — high-end place, members only, serious stuff, if you’re gonna ask, no, I didn’t lie about my experience I was 100% honest. I’m technically a Demi Chef de Partie, which sounds cool but in reality it’s basically one step above dishwasher since we don’t have commis. That said, the salary is surprisingly good.\n\nHere’s the thing: everyone in the kitchen has been to culinary school and has like 10+ years of experience. I’m the only one with no formal education and barely a year of experience. Despite that, they put me in charge of all the pasta dishes — and I’m working the station alone. No support. They trust me because I show up and get the job done, but honestly, the pressure is insane.\n\nI wish I had the chance to start from the very bottom, doing prep and learning slowly, building a proper foundation. Right now, I’m dealing with high responsibility without the skills to back it up. I still struggle with basic knife work. I make mistakes often and constantly have to ask if I’m doing things right. It’s frustrating and stressful and it makes me feel stupid.\n\nI’m also starting to question if this is even what I want long-term. I respect the hustle and the craft, but I’m not sure I see myself doing this forever. And with everyone around me being formally trained, I wonder if there’s even a real career path for someone like me in this environment.\n\nHas anyone been in a similar position? How and when did you realize this was (or wasn’t) your path? What should I do now?",
    "score": 56,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1kjlq5f/just_got_a_job_without_necessary_experience_now/",
    "created_at": "2025-05-10T22:09:24.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1kcxbg4",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "From Stagiaire to Chef de Partie in One Week – Grateful for the Opportunity",
    "text": "Hey everyone,\n\nI wanted to give you all a quick update on why I stopped posting daily updates from my stage at the Michelin-starred restaurant.\n\nIt wasn’t because of criticism or burnout — quite the opposite, actually. After just one week, the head chef and I worked an evening service together, and afterward he told me they wouldn’t be continuing the stage... because he wanted to offer me a position as a Chef de Partie!\n\nThe contract started immediately. On top of that, they’ve given me a free 3-room flat and a great salary of 3000 Euros. I’m honestly still processing how quickly things have moved, but I’m beyond grateful for the opportunity.\n\nThank you all for the support and encouragement throughout this journey. I’ll definitely keep updating you on how things go from here!",
    "score": 47,
    "url": "https://reddit.com/r/Chefit/comments/1kcxbg4/from_stagiaire_to_chef_de_partie_in_one_week/",
    "created_at": "2025-05-02T10:08:42.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1lteo54",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Thinking of working in a kitchen, how stupid am I?",
    "text": "I’m 28, riddled with ADHD, proud owner of a shitty Business degree (57% average) and I have this notion in my head that I’d like working in a kitchen.\nI currently work as a Scheduler for a Construction company. I work insane hours for 39 hours a week salary, lots of stress and that’s not even what I hate about it. I just hate sitting at a desk all day making up shit on Excel, fudging reports and graphs for someone else to present, week after week after week.\n\n\nPrior to that I worked Supply Chain, and Sales, and tried 4 different degrees on for size..\n\nI can cook. Wouldn’t even say I’m very good at it. \nMy mother was a chef, she changed careers years ago but still ran the kitchen at home and that meant kicking us out and just doing it herself.\nShe thinks it’s a terrible idea and not something she’d wish on me or anyone else.\n\nI just know I can’t stand an office job. I know I hated being an apprentice electrician. \nI think I’d thrive in the organised chaos of a kitchen. Strive for perfection, fast pace all of that. \nEven though I don’t like the idea of unsociable hours and poor pay. But I’m well paid at the moment and miserable. I also have nothing going on in my life to celebrate or anyone to celebrate it with so my weekends are wide open.\n\nI know it’s a stupid idea but I can’t help shake it.\nAm I insane? Can anyone else here relate?\nHas anyone here gone into a kitchen later in life? (And not just because they loved cooking at home so much)",
    "score": 41,
    "url": "https://reddit.com/r/Chefit/comments/1lteo54/thinking_of_working_in_a_kitchen_how_stupid_am_i/",
    "created_at": "2025-07-06T23:00:17.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1nbcrk9",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Should a Chef working line cooks job 90 percent of the day make overtime?",
    "text": "I am Currently Chef for a Community of about a 120 people. I lost approximately 5 cooks due to pay being low and upper management making me cut hours and having me fill those hours with my self.  Im salary but im pretty sure since Ive been working the line 530am to 7pm as a Line cook 7 days a week with absolutely no days off and doing 2 events ontop of that a week, and doing my manager duties I should be getting a incentive or overtime. Should i be getting OT in this scenario? Im fairly new at the Head Chef part. Im a really good Chef winning awards and everything. Recently Ive experience complete exhausting and burnout. Got sick 3 times had to work dizzy spells cant sleep well my body started crashing, went to the hospital,  luckily its just fatigue and not major but I feel like im dying. Its not anxiety at all its over worked and over tired. I dont drink I try to eat okay.",
    "score": 37,
    "url": "https://reddit.com/r/Chefit/comments/1nbcrk9/should_a_chef_working_line_cooks_job_90_percent/",
    "created_at": "2025-09-08T03:06:39.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1nnzrdq",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Sous Chef offer, worth negotiating?",
    "text": "Im a relatively young (24) chef. My last position was exec chef for bbq restaurant at 77k salary (not there anymore). I just received an offer for sous chef at a local yacht club, for 70k salary plus 'up to' 8% bonus based on performance, which would be $5,600, hypothetically. Would you risk the position to negotiate the salary? I do feel I'd learn a good amount working there but also I'm not entirely in the business of taking a pay cut. Just looking for second opinions, thanks!\n\nI would have asked the chef when I talked to him but I got the vibe that 'this is what we are offering, take it or leave it' (not his exact words). Also I realize there's not a huge difference in pay and no matter what, it is above average especially for my age, am I just being silly about this? Expected hours are 5 days per week 10-11 hour days according to the chef.",
    "score": 32,
    "url": "https://reddit.com/r/Chefit/comments/1nnzrdq/sous_chef_offer_worth_negotiating/",
    "created_at": "2025-09-22T21:53:08.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1nzoz65",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Are we lucky to be chefs?",
    "text": "So I've been seeing a lot of negativity in recent years towards the job market. So many people I know are struggling and applying for hundreds of jobs with no responses etc. This got me thinking. Are we as chefs, lucky to be in this profession currently? \nWith the rise of Ai it seems a lot of office based jobs are being forced to adapt massively or get left behind. Now obviously we also need to adapt to this but it's slightly less applicable to us currently. I am an exec chef and use Ai to help with recipe layouts. Food costs, stock take etc. But generally speaking I could do my job without it and no one would notice or expect differently. I feel like in a lot of other jobs they are expected now to use Ai and to be pioneering their fields using such technology. \nSo back to my original point. Are we lucky right now to be chefs in this climate? We are a high demand and now with recent changes a fairly well paid job. Certainly not a top bracket but we get paid a salary to be proud of (certainly in my country UK).\n\nAnyway I'd love to hear your thoughts on whether you count yourself lucky to be a chef right now. \n\nAs I certainly am very grateful that I can guarantee myself a decent wage and have no fears of ever being jobless ",
    "score": 31,
    "url": "https://reddit.com/r/Chefit/comments/1nzoz65/are_we_lucky_to_be_chefs/",
    "created_at": "2025-10-06T17:09:02.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1oigu7a",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Transition from Executive Chef to Private Chef",
    "text": "Just want to see what everyone's experience with this is. I have an offer to be a private chef and work maybe 5 hours a day tops. just making some juices, snacks, lunch and a packaged dinner for a client monday through Friday. its a huge change from what I do now. Im currently an executive chef for a very upscale restaurant making 140k a year. my salary will be the same.  is it too good to be true??",
    "score": 23,
    "url": "https://reddit.com/r/Chefit/comments/1oigu7a/transition_from_executive_chef_to_private_chef/",
    "created_at": "2025-10-28T18:10:10.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1kg8o6i",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "might be a stupid question but i cant stop wondering",
    "text": "hqs anyone wondered why people in this industry are paid shitty salary even though the work is so physically and emotionally demanding like i absolutely love my work and i’m glad to be at a place right now where my team is amazing even tho its a contract for 6 months but sometimes i wonder if i shouldve gone for those stupid IT degrees where people work for 4 hours a day and earn thousands idk this might just be a stupid rant…",
    "score": 21,
    "url": "https://reddit.com/r/Chefit/comments/1kg8o6i/might_be_a_stupid_question_but_i_cant_stop/",
    "created_at": "2025-05-06T16:20:49.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1nne44q",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Is this job offer for General Manager worth it? $70K a year for 62 hours a week.",
    "text": "This is a salary position for GM.\n\nIt is all-you-can-eat sushi restaurant. It is in a high traffic area where a lot of drunk people congregate. It can get very busy.\n\nI don't have any manager experience. I just have sushi chef experience. But he said he will train me thoroughly and teach me everything about management.\n\nHe said I will work minimum 5 days a week (12 hours x 3 days &amp; 13 hours x 2 days). So 62 hours total.\n\nBut he claims that I will only work 52 hours a week because I get 2 hour breaks.\n\nI don't know if I agree with that. I would still count those 2 hour breaks as part of my working hours because I am still going to be at the restaurant. Also something could go wrong and my staff would need me to be on-site. So even during breaks I'm technically still working and on-call.\n\nAnd of course, he said I will have to cover shifts if someone doesn't show up. So sometimes I will work 6 days a week. Obviously I would have to cover for every and any shifts - server, host, cooks, sushi chefs, etc.\n\nWhen I calculate $70K a year for 62 hours a week, it only comes out to be $22 per hour.\n\nIs this worth it? Thoughts?",
    "score": 18,
    "url": "https://reddit.com/r/Chefit/comments/1nne44q/is_this_job_offer_for_general_manager_worth_it/",
    "created_at": "2025-09-22T05:29:46.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1j1czpr",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "How does someone master classic French cooking techniques as well as someone like Paul Bocuse did?",
    "text": "In terms of the craft/ ‘the gesture’/classic French cooking techniques, what separates someone like Bocuse from the rest? \n\nI am willing to dedicate my entire life and the vast majority of my time into mastering the craft. I just don’t know how to go about it. I don’t know how to reach the same technical prowess as someone like Bocuse but it’s the only thing I want from my life. \n\nI currently work at a Michelin-starred restaurant but I don’t feel like I’m really doing ‘real’ cooking and certainly not enough. On my days off I work for free at a fish monger in an attempt to master filleting fish. My salary isn’t great but I try to cook as much as I can at home and I buy and read cookbooks to get as much information as I can. \n\nI’m 23 and I feel I don’t have much time left and I’m freaking out. I feel I should be much better than I am by now. I constantly feel like I’m playing catch-up. ",
    "score": 18,
    "url": "https://reddit.com/r/Chefit/comments/1j1czpr/how_does_someone_master_classic_french_cooking/",
    "created_at": "2025-03-01T23:32:34.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1o9hb2x",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Already feel lost.",
    "text": "Hey everyone,\n\nI’m 26, living in Turkey. A place that honestly feels suffocating in every possible way. I have zero family support, and my mental health has been terrible for years. I had to drop out of college, partly due to family issues and partly because I didn’t want to waste two more years chasing a useless degree.\n\nI’ve always been an idealistic person, and since childhood I’ve had a strong passion for the culinary arts. That’s why I decided to invest in myself and enrolled in a private culinary arts school, paying around $9,000. The program lasts 8 months. 4 months of classes and 4 months of mandatory internship at a 5-star hotel in Istanbul.\n\nThe first week was just orientation, but the instructors kept emphasizing how brutal this industry is. Long hours, extreme pressure, and a harsh hierarchy. The more I researched and listened, the more I started questioning if simply loving to cook is enough to survive in this line of work.\n\nI’ve been struggling with ulcerative colitis for 6 years and major depression for even longer. The idea of working in such an intense, high-stress environment terrifies me. I already regret stepping into this path. On top of that, I found out the salaries are extremely low not even enough to barely survive.\n\nSo yeah… I feel lost. Completely lost.\n",
    "score": 12,
    "url": "https://reddit.com/r/Chefit/comments/1o9hb2x/already_feel_lost/",
    "created_at": "2025-10-18T00:04:21.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1lwd3dc",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Have Senior level chef Salaries increased in last 5-10 years?",
    "text": "I am based in Australia and I am wondering if senior level chef salaries have increased much over the years. Here in Australia, the wages of Apprentices all the way to Chef de Parties have increased due to the minimum wage increasing. Sous Chefs and above are not governed by the same set of rules and from what I can tell, the salary of a Head Chef is pretty much the same as it was about 6 or 7 years ago, around $80k - 90k AUD. Sous Chefs have jumped up a little above CDP's but it is not unusual to see Sous Chef jobs advertise a salary lower than the minimum CDP salary which is about $75k AUD.\n\n  \nInterested to hear other peoples thoughts on this, not just from Australia but from all around the world.",
    "score": 12,
    "url": "https://reddit.com/r/Chefit/comments/1lwd3dc/have_senior_level_chef_salaries_increased_in_last/",
    "created_at": "2025-07-10T13:44:31.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1olp24g",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Incompetence",
    "text": "I work a salary position for a corporate chain of golf courses. Its complete nonsense. We're wrapping up the season now and I have 0 interest in doing another season. I know this company is in the habit of giving people a 6 months severance to get rid of them when they are incompetent. \n\nIm looking for ideas on how to get incompetent to the point they pay me to leave.",
    "score": 11,
    "url": "https://reddit.com/r/Chefit/comments/1olp24g/incompetence/",
    "created_at": "2025-11-01T14:21:56.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1irenul",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "I made it! Now any advice?",
    "text": " I worked part-time in various kitchens for four years while doing Quality Assurance in food manufacturing, until I was laid off last year. After that, I went full-time as a line cook in a fine dining establishment.\n\nNow, I’ve just been hired as a Kitchen Manager / Head Chef at a casual fine dining restaurant. The pay is great, and the stability (salary role plus only 4 days work week) is exactly what I was looking for.\n\nI know I’m still new to this role, and at 24, not young but I feel I have a lot to learn. I’m not the most hands-on when it comes to fixing things, but I communicate well and can work with others to get things done.\n\nWhat courses would you recommend to help me train for this job? I’d really appreciate any advice",
    "score": 10,
    "url": "https://reddit.com/r/Chefit/comments/1irenul/i_made_it_now_any_advice/",
    "created_at": "2025-02-17T07:46:18.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1mgmywb",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Best European (or not) country to work as a Chef a the moment?",
    "text": "Hi all! For reference: me and my wife we both are Italian Chef de partie/junior sous in London, UK. Don’t gonna lie we love it here and for the last 10 years has been quite good, especially compared working in Italy 6-7 no contract bad salary ecc ecc.. Now things are changing brexit made it impossible to find decent skilled staff and most kitchens are low in staff and most of it is people barely speaking english/don’t know how to handle a knife.. Many places used to schedule rota 1 or 2 double shifts only now 3 sometimes 4 because of this problem.. looking for a new job also is much harder and I think is not worth it anymore to work as a chef here compared to few years ago.. \nWe (obviously) speak good english. Any suggestion for a city/nation where to start again? We are 30 years old and just want to make sure we can also integrate a bit with the country if possible, or at least make a decent living/save some money. Thank you all! ",
    "score": 10,
    "url": "https://reddit.com/r/Chefit/comments/1mgmywb/best_european_or_not_country_to_work_as_a_chef_a/",
    "created_at": "2025-08-03T16:03:37.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1jui1wn",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "How long do you recommend staying in the same kitchen?",
    "text": "That is the doubt that has arisen in me, I don't know if it is better to stay for a while and then look for a salary increase or to stay in the same place for a long time. ",
    "score": 10,
    "url": "https://reddit.com/r/Chefit/comments/1jui1wn/how_long_do_you_recommend_staying_in_the_same/",
    "created_at": "2025-04-08T16:38:57.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1mj9vrm",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Split Between Two Amazing Jobs",
    "text": "Hey chefs, I’m 22 and I’m coming off my first sous chef job. I’ve been shopping around for positions around that level and I’ve interviewed for two jobs that both sound incredible in their own way. The problem is, they both seem to want me and I’m not too sure which one I should go with. \n\nThe first one is a hand roll sushi concept based in New York that’s opening up a new restaurant in my area. I’d be a counter chef making the hand rolls, talking to guests, and being part of the tip pool. Their flagship restaurant has a Michelin Guide Bib Gourmand award(!!), and this is ABSOLUTELY the style of food I dream of making. \n\nThe other option is a sous chef position at my local airport. I’d be working for HMSHost, which is a MASSIVE company, I’d be overseeing all the restaurants within the airport, I get my own office, a truly mind-blowing salary, and tons of other crazy benefits. Being with a company like that at the level they want me at would be an insane move for my career. The food, however, isn’t exactly Bib Gourmand-level and it doesn’t excite me the way option 1 does.\n\nChefs, what would you do if you were in my shoes? I’m torn between a dream job that keeps me stagnant (maybe even regressing) financially and a secure job that could potentially set me up for life. Any words of wisdom or advice are welcome.",
    "score": 9,
    "url": "https://reddit.com/r/Chefit/comments/1mj9vrm/split_between_two_amazing_jobs/",
    "created_at": "2025-08-06T16:48:10.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1i3f3jf",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Best countries to work in Europe ",
    "text": "Which European countries do you think are the best for working as a cook or chef, considering factors like reasonable working hours and good salaries? I'm looking to make a change and potentially move to another European country for a better quality of life. Do you have any suggestions?",
    "score": 9,
    "url": "https://reddit.com/r/Chefit/comments/1i3f3jf/best_countries_to_work_in_europe/",
    "created_at": "2025-01-17T12:18:49.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1ntja08",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Leave or restructure pay and bonus?",
    "text": "I want to keep this simple and short.  \n\nMy salary is 90k and we profited $800k last year.  We’re on track for about $750k this year due to our crappy event manager. My bonus system is $500 monthly if we best last years sales for that month.  \n\nIt’s two restaurants and events out of one shitty kitchen.  \n\nNo benefits either.  \n\nThe hiring pool is shit because we’re in the middle of nowhere.  ",
    "score": 9,
    "url": "https://reddit.com/r/Chefit/comments/1ntja08/leave_or_restructure_pay_and_bonus/",
    "created_at": "2025-09-29T14:19:43.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1hxrots",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Job switch ",
    "text": "I (29M) am a sous chef at a country club. I’ve been cooking for 14 odd years and have gone on to land salary executive Sous and sous chef jobs restaurants, country clubs and hotels. Enjoy my current job, but I was offered a sous chef job at another place. The job pays a little more, but I’d be working for a head chef who I’ve worked for before and didn’t have a good experience. So the question is, should I stay where I’m at, or take this new job? To help you guys, the job I’m at now has opportunities to make very high salary wages. But it’s not a guarantee. I’m a high hourly rate chef, but I’m a shoe in for a salary position, which is opening up in a few months. Know that I am the best and obvious choice. And it could be looking at pay of 60k-85k. This new job is offering 60k upfront. The place I’m at now, I can use my creativity and cook all cuisines, where as the new place is strictly Italian. I am learning more at the country club, and would definitely not learn more at the new place since the head chef there isn’t a good chef, but he is connected and he is very laid back so job security is 100%. What should I do? Wait it out? Or take the new job?",
    "score": 8,
    "url": "https://reddit.com/r/Chefit/comments/1hxrots/job_switch/",
    "created_at": "2025-01-10T00:24:20.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1nksq8o",
    "subreddit": "Chefit",
    "soc_codes": [
      "35-1011"
    ],
    "title": "Finding a Job",
    "text": "I’m currently working as a cook and I have around 3 years of professional kitchen experience. I’m really interested in working in the Caribbean islands (resorts, hotels).\n\nA few questions I have:\n\t•\tWhat’s the best way to find legitimate job postings for cooks/chefs in the Caribbean?\n\t•\tDo resorts usually sponsor work permits, or do I need to arrange my own visa?\n\t•\tIs it easier to apply directly to resorts/hotels (like Sandals, Marriott, Hilton), or should I go through recruitment agencies?\n\t•\tWhat’s the expected salary range for line cooks or junior chefs there, and are accommodations/food usually included?\n\nIf anyone here has worked in the Caribbean hospitality industry, I’d really appreciate your advice, tips, or even specific job boards/companies I should look at.\n\nThanks in advance!",
    "score": 5,
    "url": "https://reddit.com/r/Chefit/comments/1nksq8o/finding_a_job/",
    "created_at": "2025-09-19T03:21:39.000Z",
    "num_comments": 2
  }
]