[
  {
    "id": "reddit-1oms6z4",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "A lot of people here need a reality check",
    "text": "I’m tired of seeing all the doom and gloom about this career path. The truth is: A chemical engineering degree will lead you to some of the highest paying jobs you can get with just a bachelors degree. Just do a quick google search or check out the BLS website. \n\nSome background. I graduated in 2019 with just a bachelors degree in Chemical Engineering and now only 6 years later I am making just under 200k total comp. Yes there are jobs that will offer you only 50k. Yes, salaries haven’t kept up with inflation (as with EVERY career field). But if you aren’t happy with your pay, jump jobs until you are satisfied. My first job out of college, my boss would always complain about how he doesn’t get paid enough. So what did I do? I left! And found a better paying job! Because I didn’t want to be in his position in 20 years. \n\nI know people who graduated with finance degrees making crazy salaries on Wall Street and I also know others who worked as bank tellers making $20/hr. The same is true with engineering. There are high paying career paths and low paying ones. The high paying ones will be more stressful. Choose which one fits your lifestyle and stop whining that you made the wrong career choice. ",
    "score": 489,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1oms6z4/a_lot_of_people_here_need_a_reality_check/",
    "created_at": "2025-11-02T20:38:35.000Z",
    "num_comments": 136
  },
  {
    "id": "reddit-1n2y6kq",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "What they don’t tell you in school",
    "text": "You will meet people that have worked at the plant you work at that started off as operators 15+ years ago that are miles and miles ahead of you in experience. They will know the process and have a good understanding of what is happening. They will know their system and won’t need to (but can) trace lines. A degree does not make you smarter but it gives you a deep understanding of the physics and  science behind something explaining why. It will put you at about the same level as an operator who has worked there for 10-15 years in terms of pay, but learning never ever stops! In my opinion the experience is so much more valuable to the company, but experience and understanding why is gold! ",
    "score": 350,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1n2y6kq/what_they_dont_tell_you_in_school/",
    "created_at": "2025-08-29T04:42:08.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1jgcygy",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "As a operator to the engineers",
    "text": "Hello I am an unit operator at a oil refinery. Currently 5 years experience.\n\nSometimes I find it hard to manage contact with you guys due to the 24/7 shift system we are in and the 9 to 5 you guys have.\n\nSo this mainly to ask you guys, what’s important for you guys that I can do?\n\nI’ve worked for different companies and noticed that operations and engineering often have bad communication. \n\nPlease let me know things that frustrate you guys, and things I could do to make your lives easier. \n\nConstructive feedback, criticism is allowed.",
    "score": 256,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jgcygy/as_a_operator_to_the_engineers/",
    "created_at": "2025-03-21T09:37:04.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1j4vxu5",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Abusive third party recruiter reached out to me on LinkedIn and I regret picking up the call- I just want to warn everyone",
    "text": "So I’m a female in my late 20s for context. Had a recruiter named Dawn Denardo reach out to me on LinkedIn and say “Oh your profile stood out to our “owner” (a male named Joel Denardo in his 50s)- he will call you immediately. They were extremely pushy about setting up a call the same day and and me being a people pleaser agreed.  \n\nFor context I am passively looking.. mostly out of curiosity. The moment I picked up the phone I immediately got a vibe of aggression and not listening to what I want. \n\nHe immediately picked at me in a rude tone and said “Why did you leave this company?” (FIRST I did not leave right away, I stayed for 15 months). \n\n\nThe reason was wanted to try new role and company X was in an X metropolitan city w friends and relocation was offered by a top company)Then he saw the next company I left after 18 months (I’m on my third  why did you leave), and he aggressively saw it was a management track program and said “OH SO YOU DON’t want to Be a Manager?!” “Ive recruited for company like this before “ I was like no you haven’t first off a company this big doesn’t use out of house recruiters, they had talent acquisition reach out to me directly so of course he is lying, and why would I want to be a plant manager, management in a plant especially a pet food plant is not for everyone since its not as much reward for low pay and a non progressive culture. \n\n\nNow I’m at my breaking point w all the assumptions and he is like shouting to the phone “I’m different in my approach than other recruiters SO WHY ARE YOU LOOKING NOW. EVERY CANDIDATE I TALK TO WHO SAYS OPEN TO WORK ON THEIR PROFILE, AND YOUR PROFILE BLIPPED AT ME - THERE IS A REASON”. \n\nLike jesus christ, are people not allowed to be curious and want to look for jobs? you reached out to me, first off, you should be thanking my time? Why do I need to provide my reasoning to a total stranger? \n\nI immediately said “This is not going to work,” he desperately starting shouting again and I hung up and blocked his number. \n\nY’all avoid FPC Concord and Dawn and Joel DeNardo at all costs. They seem abusive, uneducated and frankly trashy. I’m still traumatized by this call and glad I stood up for myself. ",
    "score": 256,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1j4vxu5/abusive_third_party_recruiter_reached_out_to_me/",
    "created_at": "2025-03-06T13:53:34.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1nebnme",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Chem Eng degree does not mean you have to have a Chem Eng job",
    "text": "It has been a long time since I was at the university in the UK. Back then the B Eng course was 3 years not 4. They had a similar curriculum just got it done quicker.\n\nWhen I was studying for the degree it was almost vocational. You got the degree and went into the industry. Having read a lot of comments on here I think it may still be the same. Why would you not go into Chem Eng after completing one of the hardest course to gain entry?  \n  \nWell....\n\nThe most valuable thing you are learning/exercising is your ability to apply your thinking and logic to any problem. The Chemical Engineering degree is respected across all industries. It open most doors. When my degree comes up I often get the response \"That explains it\".\n\nYou took Chem Eng because you have a curiosity. You also have keen problem solving skills. These are in demand in industries like Finance, and technology. Having Chem Eng on your c.v. is picked up by recruiters.\n\nIf you find yourself in a rut during the course, if you are questioning your choice 2 years into working in industry, or even 20 years into a career...do not forget that your degree doesn't open one door. It opens them all.  ",
    "score": 232,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1nebnme/chem_eng_degree_does_not_mean_you_have_to_have_a/",
    "created_at": "2025-09-11T15:21:37.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1kivvga",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Did I screw my entire future",
    "text": "So basically I got an internship with a pharma company. The internship offer was dependent on passing a drug test. I originally took the test, but the results could not be read because the sample was too dilute. This led me to being having to retest. However after taking the first test I smoked once with my friends as I had already taken the test and thought I was in the clear. Days after smoking I found out I needed to retest, and the retest came back positive. This led to me getting called today and being told my offer is getting pulled. It is not the middle of may and I have no plan for the summer. This internship was also supposed to offer me a return offer for a post grad job as that is what their internship program is designed for. \n\nDid I just fuck up my entire future and am I completely screwed for the rest of my life. What am I supposed to tell recruiters in ten fall when I am looking for a full time job. ",
    "score": 229,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1kivvga/did_i_screw_my_entire_future/",
    "created_at": "2025-05-09T23:01:50.000Z",
    "num_comments": 118
  },
  {
    "id": "reddit-1i8mkcq",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "I genuinely believe you need to be highly intelligent to make it through an engineering degree and get a job",
    "text": "So many people on Reddit try to pretend being humble and say anyone can get an engineering degree if you work hard enough. Maybe you can graduate with high grades with enough work, but it won’t land you a job. \n\nI was literally a student who had average intelligence and had to put in insane hours studying. I didn’t have enough time for engineering clubs and internships, and employers can clearly tell I wasn’t smart. Employers don’t want to hire people who can’t solve problems quickly. You need to be pretty smart to make it through a degree AND get a job",
    "score": 219,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1i8mkcq/i_genuinely_believe_you_need_to_be_highly/",
    "created_at": "2025-01-24T03:47:45.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1jhkovm",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Will I ever stop feeling like an incompetent idiot?",
    "text": "I’m about 9 months into my first real process engineering job, and I was just dropped into the tail end of an R&amp;D carbon capture project. I’m now on site, and I have the commissioning team running up to me asking me, why is this pump not working? Why does level transmistter go so low and can we change it? Can we add a bypass here etc? And to be completely I have no idea? I didn’t sit in any of the Hazop or do any of the isometrics or simulation, I have only worked on some simple things like the Alarms and Trips, and some stuff for the SIL loops. \n\nBut every time I get asked a question I have to respond with IDK… and truthfully I just feel like the biggest dumb idiot loser on the site. When I am working on other docs. I feel like I’m annoying other people with my basic questions and looking like a Moron, but it’s my first time with this specific doc and I want to do it right…. Also I’m the only process engineer on site so “I’m the guy” as they tell me. anyway will I ever stop feeling useless and incompetent? Or should I start looking for another career or do you have any other advice? Thanks in advance! ",
    "score": 212,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jhkovm/will_i_ever_stop_feeling_like_an_incompetent_idiot/",
    "created_at": "2025-03-22T22:40:07.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1m96xsi",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "My Experience Working at TSMC Arizona For 4 Years",
    "text": "Hi Everyone,\n\nI comment quite often on posts related to TSMC Arizona and get quite a few messages related. I wanted to make a post about my experience there and if after reading you still feel you want to apply and work there, at least know you've been warned.\n\nA little background I was hired in 2021 and went to Taiwan that summer, being one of the original groups that went. I don't need to go into too much detail, but it was an absolute disaster. They changed our flight date multiple times, gave us laptops that didn't work, lied to us about the size/location of our living arrangements, etc. Anyways, I chalked this up to covid restrictions so whatever. Then we got to TSMC in Tainan and it continued to be a disaster. They didn't have a training plan ready, they barely had people that spoke English and for my group, they refused to help us because \"Americans make too much money for us to help them.\"\n\nAnyways, fast forward a few years of \"training\" in Taiwan with around 20% of the people quitting because the conditions and work style were already terrible, then we went back to Arizona. Obviously a new fab is going to have issues, but TSMC found a way to make everything terrible. Construction was behind because they literally didn't have any plans. They sent Taiwanese over to clean up because they just couldn't handle all the American blue-collar workers. They had engineers help out facilities that we weren't qualified or trained for. Putting us in extremely dangerous situations that we would have to refuse at the expense of \"possibly getting a bad review at the end of the year\" for sake of safety.\n\nSo, after all that I thought okay whatever that was the growing pains part of foreign company starting up a new fab in the US, it should get better, right?.. Wrong! It got worse and worse. By this time, around 70% of the people I started in Taiwan with had quit, so we we're constantly going through training of new employees. Also, all of those I still talked to that had quit said they were better off. Every project comes from the \"mother fab\" in Taiwan and needs to be followed no matter what, excluding logic or reason. So there was zero place for innovation or even basic brain use. The job became show up, see what you're being told to do that day, have the plans change, fix it, be super behind, rinse and repeat.\n\nI was a part of interviewing for interns/new employees in my group (my guess was because English is my first language and some of the interviews the Taiwanese would do were terrible). Anyways, the things I were told as prep before interviewing were very disturbing. I was given instruction to prioritize Taiwanese first, then anyone with a Visa after because \"people that have Visas are easier to control\". They don't want to hire an American that doesn't have immigration restrictions because they will quit once they find out how terrible it is there and they know it so they hold people captive, dangling the carrot green card in front of their face. I was also told to not hire people of Indian descent, and they even had a rude name for them calling them the \"PhD people\". 2 of the people that were hired that I interviewed, my boss told me they had the job before they even did a single interview and the interview itself was a formality. They all had some relation to people that had worked at TSMC. I understand the \"who you know, not what you know\" concept, but to have the nepotism be that strong was shocking. I was also told to emphasize on the \"Taiwanese work culture\" in the interviews, AKA you'll be yelled at daily and need to meet impossible deadlines, because the turnover for new employees was very very high.\n\nThe daily work was also a nightmare. They expect you to commit your life to the job. Hourly might be the way to go, but I was a salaried engineer and got paid the same amount no matter how much I worked. Some days working until 9-10pm. Other engineers in my group would work a normal 14-16 hour day.. normal.. Most people would be leaving around 8pm every day and that was on non-busy days. They intentionally would give projects at 4-5pm that were \"urgent\" and \"need to discuss tomorrow morning\", meaning you'd have to stay late to do it. The work culture itself is very toxic as well. The Taiwanese work on a basis that more than 50% of their income comes from their bonus. That bonus is not only performance based, but a popularity contest and most importantly how much you do or don't mess up. So, if you were in a situation where that much money was based on not messing something up, you'd probably hide in the shadows and not cause any disruptions, right? Well, that's exactly what most do. So, if you are trying to get help from someone, they will either ignore you or direct you to someone else, because if you mess something up that they told you, they would be to blame. It created a very toxic style of no teamwork, no one helping anyone, and overall delaying all projects.\n\nYou also have to remember TSMC is not only a Taiwanese company, but it's THE Taiwanese Company to most Taiwanese people. They are very honored to work there (and rightfully so), but as someone not Taiwanese I just didn't have the same investment into the company. I like to do a good job at work and learn new things, but I will not sell my soul to the company and most Taiwanese will. They treat work as the first and only option in life. Family comes second, which just wasn't for me. I work to live, they live to work.\n\nSpeaking of Taiwanese, they have a very different culture than America. They have very little exposure to other races and can end up being very racist towards non-Taiwanese. I've heard them make fun of people's accents, appearances, and disabilities. They will usually do this in secret or in Chinese, but I ended up learning quite a bit of Chinese while living in Taiwan, so I could understand what they were saying. Making fun of or talking shit right in front of someone. They end up treating work like high school. Everyone has their own little gossip groups, and they start dating each other at work because they have no outside life. They are also very sexist. There was a new girl starting while I was in Taiwan and before she was hired, the manager who just interviewed her, shared her Facebook/Instagram profiles with everyone so they could \"rate\" her, very disgusting. Anyways, she got hired and had gained some weight and didn't look exactly the same as the pictures. Her first day one of the Taiwanese guys went up to her and said \"Wow I didn't expect you to be so fat!\" and then ran off and giggled to his friends. She ended up crying the rest of the day and took the next two days off. These are adults that are 25-35 that were talking about.. Another quick story, one of the Taiwanese guys went up to a girl that was sitting, holding a banana below his waist. He put it right in front of her face and said \"Hey! Want a bite of my banana?\" So these are just a few of the fun things you can experience working there.\n\nYou might ask, well what are the good things about working there? There are two that I think most TSMC employees will always say and I have counter arguments for both. 1) They don't layoff. This is true, I've never heard anyone getting laid off and actually getting fired there is almost impossible as well (has to be some huge, I mean huge mistake). So, you might think that is great and you have a job set for life. While it's true you don't have to worry about getting laid off/fired, it creates a very low quality pool of people that work there. Imagine you work at a place that keeps all it's worst employees. All the good employees leave/get promoted out of the group and the worst ones have found a way to survive and put up with the bullshit. So you joining that group would make you do extra work to make up for all the mistakes they have made. But if you do find a decent group and can put up with it, you truly will have a job for as long as you can put up with it. A true quote from my boss while I worked there might help explain it best \"TSMC doesn't lay off anyone, they just force you to quit.\" 2) The Pay. Yes TSMC does pay very well. They will intentionally pay a little higher than your worth at first to draw you in. But after working for years the pay starts to level off and you'll soon be underpaid. This might apply to most jobs in this industry though and job hopping might always be the best move. As an example, when I left earlier this year, I got a 30% raise. So just know the pay may look great now, but it won't always be that way. Also, there is a reason they pay more, they expect more. It's a deal with the devil scenario and if you're paid 5-10% more than a competitor but working 50% are you actually making more?\n\nMy suggestion to anyone thinking of applying: I think their internship program is actually really well done. It pays well and you have an end date, which is the best part. They do trick the interns by intentionally being nice to them and not giving them anything too stressful (this was a direct order from my boss when I mentored an intern). So just know, if you do decide to go back for a full-time position, the stress/workload will increase drastically. I would say there are some situations that you can make TSMC work as a full time job. If you're desperate for a job because I know the job market isn't the hottest as of now. I also think if you are just out of college and looking for a first job, it can be a good place to start off if you are single, no family, no real commitments. You can make some good money, get some experience and then move on. I would avoid it if you have worked basically anywhere else before, because it will feel like a prison to you (can't use your personal phone, tracked 24/7, treated like your 12 years old with attendance in meetings, etc.). Also, if you are applying and see something along the lines of \"were hiring for the expansion!!\" it's actually very misleading. They will always be expanding and building more fabs, but probably 90% of the time if there is a job opening, it's because you are filling the position of someone that quit because the turnover is absolutely terrible.\n\nAs final disclosure, this was just my experience, so as with everything on the internet, take it with a grain of salt. I'm sure there are people that actually like working there (I never found anyone, but they have to exist, right?) and don't have the same experience that I had. It wasn't all bad and terrible, just a place that I saw wasn't going to progress my career or my mental health, so I got out of there.\n\nI could go on and on and write a novel about my experiences there, but if after reading you still feel like applying, you can feel free to message me. Open to answering any questions or going into more detail on anything TSMC related.",
    "score": 193,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1m96xsi/my_experience_working_at_tsmc_arizona_for_4_years/",
    "created_at": "2025-07-25T18:28:01.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1nurego",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Sometimes it feels like chemical engineering is 50% science, 50% tradition.",
    "text": "So much of chemical engineering still leans on:\n\n* Old software that barely changes\n* Trial-and-error as the main path to optimization\n* Approximations and rule-of-thumb factors\n* Experience and gut feeling outweighing data\n\nThese methods work, but it feels like we’re holding ourselves back. Why hasn’t the field moved further toward modern computational tools and data-driven approaches? Is it regulation, risk aversion, or just inertia?\n\nCurious what others think.",
    "score": 176,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1nurego/sometimes_it_feels_like_chemical_engineering_is/",
    "created_at": "2025-09-30T22:33:22.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1i7h79t",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "I got my first job as a process engineer and I have forgotten everything I learned in school",
    "text": "I have forgotten the most basic chemistry and most basic engineering knowledge after graduating. I spent 6 months traveling after graduation and now I have this job but I just feel stupid all the time",
    "score": 175,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1i7h79t/i_got_my_first_job_as_a_process_engineer_and_i/",
    "created_at": "2025-01-22T17:54:20.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1k60vib",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Serious job offer in Denmark – great salary but major life change. Would you take it?",
    "text": "Hi everyone,\n\nI’ve received a serious job offer from a petrochemical company to work as a **chemical engineer in Denmark**, with regular trips to an offshore platform in the North Sea.\n\nRight now, I’m working in **Madrid** at a French process engineering company. I’m **25 years old**, single, with **3 years of experience**, sharing an apartment, and living a pretty chill life with an active social circle. I currently make **€35k gross per year**.\n\nThe offer:\n\n* **€7,000 gross per month** (€84k/year)\n* **+20% bonus** based on performance\n* According to [salaryaftertax.com](http://salaryaftertax.com), that would leave me with **€4,332 net per month**\n\nI’ve checked rentals and a **1-bedroom apartment costs around €600/month**, which isn’t crazy, though other living costs are high.\n\n**Pros:** great salary",
    "score": 174,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1k60vib/serious_job_offer_in_denmark_great_salary_but/",
    "created_at": "2025-04-23T14:41:50.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1jf0wlc",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Passed the PE Chemical Exam! 1st attempt.",
    "text": "I’m 12 years post graduation. Passed the FE in 2012. I studied for two months, 2-3 hours a night usually around 8-11pm after my 2 year old went to bed, and then  8-10 hours a day on weekends when my wife was off work and able to watch him, with the exception of a couple of weekends where we took a trip, or had other plans, and some weeknights where I had to catch up on work when things got busy there. Life was mostly work, study, cook dinner, play with son, repeat for a couple of months. Panera was my go to, studied there all day on weekends, some people started recognizing me. Took three days PTO from work to study in the days before the exam.\n\nI used PPI2Pass online self-study materials. Started off doing all the readings but turns out they severely underestimate how long the readings take, so two weeks in I started just doing the practice problems in the readings and not actually reading the materials except for skimming a few sections that I’m weak in. I started slipping from the “schedule” they set but eventually caught back up and finished the week of the exam. Didn’t have a chance to do any of their Qbank problems just the reading practice problems, homework, diagnostic exams, and the practice exam.\n\nI took the NCEES practice exam twice, once as a diagnostic before starting studying and totally bombed it with like 21% score, then a second time about 4 weeks into studying and got a 47% (had only gotten through PPI’s material &amp; energy balances and heat transfer sections at this point), then I took the PPI online practice exam a week before the exam and got a 57%, and then the Vasquez and Zinn practice exam three days before the exam date and got a 59%. Reviewed all solutions every time. This takes just as long (sometimes longer) as taking the practice exam but totally necessary. The first time I took the NCEES practice exam it took me a few days, the second time 11-12 hours. The online PPI practice exam took me 8.5 hours (the timer messed up and gave me 8 hours and 50 mins instead of the 8 hours you get on the real exam), and then the Vasquez and Zinn practice exam I finished in 8 hours but I had zero time to spare. Whereas on the real exam I had about 30 mins to spare for review after finishing the first half of the exam and an hour to spare after finishing the second half. This was very helpful as I caught a few errors and had time to go back to some flagged questions that I was stumped on but with spare time was able to figure out.\n\nThe actual exam was much easier than the practice exams. The longest problem was probably half the length of the longest practice exam problems. Not nearly as complex and less steps than  the practice exams. \n\nMy main gripe with PPI is many of their solutions use equations that have a different format than the NCEES handbook, and sometimes equations that weren’t in the handbook at all, so I spent a lot of time trying to match up the PPI materials to the handbook, and understand if their equation is some derived form and if they didn’t match at all then I decided to move on as I don’t have the capacity to memorize a bunch of equations that won’t be available on exam day. Also their platform went down a couple times during the two months of study which was annoying but it was generally reliable.\n\nI would say two months studying is probably the bare minimum. I didn’t feel totally ready as I was pretty weak in chemical reaction engineering and mass transfer, another month and I probably would have felt more confident. I’m guessing I was closer to the pass/fail edge than someone who spent 6+ months studying, but here’s proof that it can be done!",
    "score": 169,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jf0wlc/passed_the_pe_chemical_exam_1st_attempt/",
    "created_at": "2025-03-19T16:21:32.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1iohm09",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "How to size your compressor - simple guide",
    "text": "Hi all,\n\nI am writing some simple guides on common topics in chemical engineering and I thought it was worth it to share it with you. The goals of these guide are:\n\n* Quick cover on the matter to solve common problems in the chemical industry\n* Help for people with a different background or with little experience to understand key concepts\n\nWhat are some other interesting topics I could cover?\n\nHere's the simple guide:\n\n# How to size your compressor\n\nThe two fundamental data points for correctly sizing a compressed air system are as follows: total air flow rate (usually measured in Nm³/h or scfm) and operating pressure (usually in bar, atm, or psi).\n\n# Difference Between Nm³/h and m³/h\n\nWhen estimating the total air flow rate for a compressed air system, it is important to remember the difference between Nm³/h and m³/h.\n\n**Nm³/h** (“normal cubic meters per hour”) does not represent the actual air flow rate but is a standardized flow rate under so-called Normal Conditions (0°C, 1 bar). A similar concept applies to the imperial unit scfm (standard cubic feet per minute). Typically, manufacturers will provide the estimated air consumption data in Nm³/h or scfm. If the data is provided in m³/h or other actual flow rate units, it must be converted to standard units. To convert m³/h to Nm³/h, knowing the actual pressure and temperature of the application, you can use the following formula:\n\n**Flow rate in Nm³/h = Actual flow rate in m³/h \\* (Pressure in bar) \\* (273.15 / (273.15 + Temperature in °C))**\n\nFor example, for a machine requiring an air flow rate of 1 l/s at 6 bar and room temperature:\n\nFlow rate in Nm³/h = 3.6 m³/h \\* (6 bar) \\* (273.15 / (273.15 + 25)) = 19.78 Nm³/h\n\nActual flow rate in m³/h = 1 l/s \\* 3600 / 1000 = 3.6 m³/h\n\n# How to Estimate the Total Air Flow Rate for the Compressor\n\nTo estimate the total air flow rate for sizing the compressor, you need to create a list of all the equipment that requires compressed air and determine the required flow rate for each. Typically, manufacturers will provide this data in the technical specifications. If the data is unavailable, you will need to make an estimate. For example, for pneumatic valves, a safe estimate is typically 1 scfm (1.61 Nm³/h) per valve.\n\nTo estimate the total compressed air flow rate, you need to sum the flow rates required by all the equipment. To avoid oversizing the system, consider the following:\n\n1. **Continuous-use equipment**: For these, you can simply add the manufacturer’s data.\n2. **Intermittent-use equipment**: For these, you need to estimate the degree of contemporaneity, as not all equipment will require compressed air at the same time. Examples include spray guns, screwdrivers, pumps, and valves. The degree of contemporaneity depends on the production process, but for standard applications, a 20-30% contemporaneity factor is typically considered.\n3. **Safety factor**: Finally, add a safety factor to account for potential peaks, future expansions, or network losses. Typically, a 25-50% safety factor is added to the calculated value.\n\nIn conclusion, the total compressed air flow rate can be calculated as follows:\n\n**Total flow rate (in Nm³/h or scfm) = (Sum of all continuous-use equipment + Sum of all intermittent-use equipment \\* Degree of contemporaneity) \\* (1 + Safety factor)**\n\nFor example, for a new production facility, we estimated:\n\n* The flow rate required for continuous-use equipment is 200 Nm³/h.\n* The flow rate required for all intermittent-use equipment is 4000 Nm³/h.\n* A contemporaneity factor of 20% is considered.\n* A safety factor of 25% is added.\n\nThe total required flow rate will be:\n\n**Total flow rate = (200 + 4000 \\* 0.20) \\* (1 + 0.25) = 1250 Nm³/h**\n\n# How to Determine the Operating Pressure of the Compressed Air System\n\nIn general, you need to determine the maximum pressure required for the operation of the equipment. Typically, a value of 7 bar is sufficient for most standard applications.\n\nThis pressure is required at the end-use point, but you must account for pressure losses along the network, which are influenced by the system design. Pipes and accessories must be sized to minimize pressure losses. A 2-3% pressure loss is typically considered a good balance between investment costs (pipe diameter) and operating costs.\n\n# How to Determine the Compressor Size in kW of Electric Power\n\nCompressor manufacturers can recommend the appropriate compressor size based on air consumption data, required pressure, and application type.\n\nFor a quick sizing reference for most applications, you can refer to the following table:\n\nhttps://preview.redd.it/g95dlbbddwie1.png?width=963&amp;format=png&amp;auto=webp&amp;s=2e4858da7b76356dff7d0b766f6f20f14d7184f0\n\n# Energy Costs of a Compressed Air System\n\nRegarding operating costs, it is important to consider that compressed air represents a significant portion of total energy costs. Roughly, every 1 kW of energy produced requires 8 kW of electrical energy.\n\nAdditionally, considering the lifecycle of a compressed air system (about 10-15 years), the total costs can be broken down as follows:\n\n* **70-75%**: Energy costs\n* **15-20%**: Compressor, accessories, piping, and installation costs\n* **10%**: Maintenance costs\n\nThe two fundamental principles for cost reduction are:\n\n1. **Minimize leaks**: A single small leak at 7 bar can cost up to €1000 per year. Older facilities may have up to 20% of compressed air production costs due to system leaks.\n2. **Reduce system pressure**: Every 140 mbar reduction can save 1% of energy costs. Therefore, it is crucial to size and install the system correctly to minimize pressure losses. Another important question to ask is: What pressure do we actually need?\n\nOther useful considerations for reducing energy costs:\n\n* Use variable speed compressors with inverters.\n* Select the best compression technology based on system characteristics (reciprocating, scroll, screw compressors, etc.).\n* Recover heat for other production processes or simply for heating.\n\n# How to Size the Piping for a Compressed Air System\n\nWhen sizing the piping for a compressed air system, the main goal is to keep pressure losses low (&lt;2-3%). Pressure losses are influenced by:\n\n* **System type** (loop or single-branch)\n* **Pipe length** (distributed pressure losses) and system details (number of bends, elbows, valves, restrictions, couplings, etc.)\n* **Pipe material** and surface roughness\n* **Pipe diameter**\n\n# System Type\n\nLoop systems are preferred over single-branch systems because they reduce pressure losses, pressure fluctuations, and facilitate maintenance at individual points.\n\n# Pipe Length\n\nThe total pipe length depends on the application layout. It is always advisable to minimize the number of bends or other elements that can add pressure losses to the circuit. For very long straight pipes, thermal expansion must be considered, as it can create overpressures and lead to pipe failure. It is recommended to insert a U-bend every 50 meters to act as an elastic joint that absorbs thermal expansion.\n\nThe simplest method to account for pressure losses due to accessories is to convert them into equivalent meters of linear pipe. For example, a 90° bend can be converted into a certain number of equivalent linear meters.\n\nFor a quick estimate, refer to the following table:\n\nhttps://preview.redd.it/o54pkibfdwie1.png?width=1121&amp;format=png&amp;auto=webp&amp;s=d037eb2788c144b92ba7f31de6a474c84c59fc58\n\nFor example, four 90° bends for a 50 mm pipe are equivalent to 3.5 \\* 4 = 14 meters of linear pipe.\n\nTherefore, the total pipe length will be equal to the linear pipe length plus the equivalent linear meters for all points that introduce additional pressure losses.\n\n# Pipe Material\n\nThe material depends on technical applications, but typically the following materials are used:\n\n* **Galvanized Steel**: Low cost and suitable for most cases. Susceptible to corrosion.\n* **Stainless Steel**: Expensive but corrosion-resistant.\n* **PVC**: Economical but less durable.\n* **Aluminum**: Expensive but can achieve low roughness levels, reducing pressure losses.\n\n# Pipe Diameter\n\nThe pipe diameter must be properly sized to reduce pressure losses. The simplest method is to refer to sizing tables. For example, for a 7 bar circuit, you can refer to the following table, which sizes the diameter to keep pressure losses below 4% (0.30 bar). Choose the diameter based on the total pipe length (including equivalent lengths for pressure drop points) and the total required flow rate.\n\nFor example, for a circuit of about 500 meters and a required flow rate of 150 m³/h, a 40 mm diameter would be appropriate.\n\nhttps://preview.redd.it/p43w4tw1cwie1.png?width=1024&amp;format=png&amp;auto=webp&amp;s=c733bc593210ebf5cd3f6bc1253ae7563de8cc49",
    "score": 168,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1iohm09/how_to_size_your_compressor_simple_guide/",
    "created_at": "2025-02-13T12:07:04.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1jacl3x",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "How do y’all deal with being on call",
    "text": "Man being on call is a scam on salary. I’ll work the same hours as my techs and they’ll be making 20-40K more than me. The longer I work the less I earn. In a few instances I’ve had to pay extra for daycare on the weekends because I was called in. I paid 300$ for the privilege of working a Sunday lol my partner works weekends night shift. So I’m the main caretaker then. \n\nWe were having issues at the plant one weekend, and I was taking my kids to the doctor so I let the plant know I won’t be home and will be hours before I could respond. And I seem like the bad guy because I’m not a team player…. \n\nDo yall get paid for being on call? Do you push back? ",
    "score": 166,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jacl3x/how_do_yall_deal_with_being_on_call/",
    "created_at": "2025-03-13T13:58:45.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1jk9ree",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "FE Fail",
    "text": "Feeling demoralized. I studied a lot and looking at this you never would have known. I’m probably never going to take this again unless I absolutely have to. Which again, looking at these score, no one would actually want me to stamp anything. I hate how easy tests come to people. Hate it hate it hate it. I’ve never been intuitive to exams. All my friends can just look at some material and boom they know it. Me I can but long hard hours in and have nothing to show for it. I’m not blaming anyone but myself here, but damn does this suck. One of my friends sat this exam the same day I did. If he passes I will be the only one who failed and I probably studied the longest. ",
    "score": 164,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jk9ree/fe_fail/",
    "created_at": "2025-03-26T11:43:00.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1pbg7w6",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "2026 ChemE Compensation Report - Data Gathering Phase Open",
    "text": "Hi everyone - the data gathering phase for my annual report is open now (until December 31st) and if you are a US-based, degreed chemical engineer you can participate by following the link below. If you're unfamiliar with my past work, here is [a link to last year's report](https://www.sunrecruiting.com/2025compreport/). I incorporated a number of suggestions that were made from members of this subreddit into the survey for this year and grateful for the support of many of you out there. Feel free to ask questions here if you have them.\n\n  \nLink to the survey: [https://www.sunrecruiting.com/survey2026/](https://www.sunrecruiting.com/survey2026/)",
    "score": 163,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1pbg7w6/2026_cheme_compensation_report_data_gathering/",
    "created_at": "2025-12-01T15:48:37.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1i6t3s5",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Are people with chemical engineering degrees considered very smart?",
    "text": "My friend is taking chemical engineering for his undergrad and we were at a place talking to some people in their 30-40s. When he brought up that he is studying chemical engineering they all started to praise about how smart he is.  ",
    "score": 158,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1i6t3s5/are_people_with_chemical_engineering_degrees/",
    "created_at": "2025-01-21T20:57:52.000Z",
    "num_comments": 177
  },
  {
    "id": "reddit-1n5w1ku",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "What happened to the chemical industry ?",
    "text": "I have a ton of friends at various small and even larger chemical facilities and there seems to be a common theme according to them:\n\n-overworked \n-Budget cuts \n- stagnant wages\n- Penny pinching \n- Not as much of a focus on growing their younger workforce \n\nI get that no every company is like this but many of my friends are telling me these stories \n\nWhat’s the deal ?",
    "score": 142,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1n5w1ku/what_happened_to_the_chemical_industry/",
    "created_at": "2025-09-01T18:07:10.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1jwchf1",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Books every chemical engineer should know by heart?",
    "text": "Im a 4th year chem eng major (engineering degrees are 5 years long in my country) and ive been thinking what other books aside from Perry's, Fogler and Incropera were important for us to have a good grasp on (also which ones are good to own for consulting and studying after you graduate)",
    "score": 134,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jwchf1/books_every_chemical_engineer_should_know_by_heart/",
    "created_at": "2025-04-10T23:55:11.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1jt1wer",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Salaries in ChemE seem to be pretty stagnant, check out these numbers from 1996 vs 2025.",
    "text": "Hey everyone,\n\nI was doing a bit of digging and found something pretty interesting—and honestly, a bit discouraging.\n\nAccording to this [1996 ACS salary report](https://pubsapp.acs.org/cen/hotarticles/cenear/961028/empsalaries.html?utm_source=chatgpt.com), the median starting salary for a chemical engineer with a bachelor’s degree back then was **$42,000/year**.\n\nAdjusting for inflation, that’s equivalent to around **$86,100/year** in 2025 dollars.\n\nNow, if you look at current estimates (ZipRecruiter, Glassdoor, etc.), the average salary for an entry-level ChemE in 2025 is sitting at around **$87,487/year**.\n\nThat’s... basically flat.\n\nIt means that in **29 years**, the real wage growth for new grads in our field has been almost **zero**. Which is wild, considering the technological advances, the rising cost of education, and everything else that’s changed in that time.\n\nCurious to hear your thoughts—\n\n* Is this stagnation something you've felt personally?\n* Do you think it’s tied to the industry itself, or broader economic trends?\n* Is it different in other countries?\n\nWould love to hear what other ChemEs think about this.",
    "score": 131,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jt1wer/salaries_in_cheme_seem_to_be_pretty_stagnant/",
    "created_at": "2025-04-06T19:11:47.000Z",
    "num_comments": 105
  },
  {
    "id": "reddit-1kghhe5",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "I am so tired and burnt out",
    "text": "I graduate with a bachelors of science in chemical engineering on Friday. I basically have everything finished. I am graduating from an east coast Big 10 school. \n\nI just want to know if anyone can relate to being so incredibly burnt out. Like I don’t even wanna get out of bed or talk to anyone. I also do a lot of other things volunteer, work, job apps…\n\nI am just so tired. Any tips for getting energized for this next chapter in my life? \n\n(I also studied abroad, so I don’t want to travel. It’s exhausting.)",
    "score": 130,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1kghhe5/i_am_so_tired_and_burnt_out/",
    "created_at": "2025-05-06T22:19:27.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1kjn1ov",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "PhD in ChemE 5+ years out, but still haven't broken $100k compensation (despite HCOL area). What am I doing wrong?",
    "text": "Without going too much into detail of my background, I did my undergrad at a very reputable state school in the midwest.  I had to study hard, but I got very good grades throughout, graduating undergrad with magna cum laude (which would have been summa cum laude had I not gotten my only C in an unrelated elective I took freshman year when pursuing a minor program, but I digress!).  Immediately after graduating with my BS, I enrolled in a PhD program at a private school, also very reputable.\n\nUpon entering my PhD at 22 years of age, I went in with the mindset that I will study something pertaining either to space exploration or to clean/sustainable energy.  Well, the advisor I went with, also new at the time, did have a project related to clean energy via electrochemistry, with a particular focus on a biomarker catalyst, the latter of which was her specialty.  Unfortunately, as my degree progressed, the clean energy &amp; electrochemistry project didn't work out, and I instead had to focus *only* on the biomarker study itself, which by itself wasn't really my interest.  Nonetheless, I pursued the degree, published some very irrelevant papers, and graduated after a few years.  \n\nI knew I wanted to go into industry because academia had left me with a dishonest 'taste'.  I wish to this day I had gone with a more experienced advisor, but I was only 22 at the time, so I try and forgive myself for the decision.  Anyway, I figured that since I enjoy electrochemistry, I would get back in to that.  Therefore, in 2020 I found an opportunity to join a small company in the northeast (i.e. HCOL) as an ECD Process Engineer III.  Unfortunately, it quickly turned into a nightmare scenario-- After just one week of working there, my manager became abusive and would scream at me in private (her closed office door).  For example, in one instance I was told by her I should have never gotten a PhD.  I was also never given any guidance nor projects to work on.  After just 6 weeks, I was put on a PIP and then terminated within 3-4 months of starting the job.\n\nI found a new job shortly after (still 2020) as an electrochemistry (plating) engineer, Process Engineer II.  It was a step down from level III, but I figure that given the circumstances, I would take this new position, learn &amp; grow from it, and move forward that way.\n\n...Except that hasn't been the case.  I am now nearly 5 years out, I am still a level II process engineer and haven't even broken the 100k threshold.  My first couple of years there were interesting, and I had a very knowledgeable mentor (since retired), but the organization as a whole has been increasingly led by poor and uncommunicative management.  Worse still, I have recently been placed on a PIP for reasons I believe are purely office politics-- I lead one of the best processes in the organization (more details below), but my manager is incompetent and leadership has recently been pushing people they deem redundant to leave. \n\n(Mini-rant time) It is bewildering to me that I have been struggling securing good pay and career advancement for so long.  I am fairly easygoing to work, I consider my curiosity to be my best trait, and I get along with *almost* everybody.  Yet I feel like when I do stand up for myself, there is such strong retaliation to the point where it feels like career crucifixion and, in the case for my current job, may indeed have been the case.  For example, my particular process is held up to an incredibly asymmetric standard when compared with other processes.  Just this week, for instance, an engineer who sits near me and is the SME for a particular process had \\*100%\\* (yes, all parts) of a high-priority project sent back from the customer because this SME's parts, which had passed his internal requirements, did not pass the those from the customer!  Yet I could hear my manager, also his manager, who were laughing/joking about the matter.\n\nMeanwhile, I work quietly and achieve near 100% yields.  If one of my cpk values begins to trend on the lower end for a given process, I address it, and it is usually just a measurement error &amp; involves operator retraining and/or poke-yoke prevention controls, and is not due to a bad part itself-- yet management will lose its mind and act as if I committed a terrible mistake!  In reality, the managers just don't understand the plating process nor care to understand it.  Anyway, my point here is to show that I am held to very high standards when other *senior* engineers don't get the same level of scrutiny.\n\nSo now the end result is that I am in my early 30s who was once a good student and had worked hard back in my college and grad school days, but with nothing really to show for it.  People who only have recently graduated with only a bachelor's and are younger than me have been advancing further than where I currently am.  In addition, my peers from school are now senior engineers, managers, and in some cases senior managers at large companies, working in very exciting and lucrative programs.  My peers have also been able to buy houses, start families, etc., whereas I still rent.\n\nI have been applying to other positions for the past several years, and I have gotten to the final rounds of a few places, but I just haven't quite made the cut.  Now I am pushing my application process into overdrive because I definitely will need a new job soon. \n\nAll of this lack of progress has slowly taken quite a mental toll on me.  Fortunately, I have a very supporting partner who assures me I am not a failure.  I've just never seen such a large disconnect between quantifiable results and what I get out of my efforts for these results.\n\nAnyway, I wanted to write this to help me get my thoughts out there and see if anyone else has gone through a similar situation, has any advice, etc.\n\n",
    "score": 123,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1kjn1ov/phd_in_cheme_5_years_out_but_still_havent_broken/",
    "created_at": "2025-05-10T23:14:41.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1myfrcy",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "For those earning $250k+ — what do you do, and how did you get there?",
    "text": "I’m really curious to hear from people who are making $250k or more annually.  \n• What field or industry are you in?  \n• What’s your role or title?  \n• What steps (education, career moves, risks, etc.) helped you get there?\n\nI think it would be super valuable to hear the different paths people took, especially for those of us trying to plan our own careers.",
    "score": 121,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1myfrcy/for_those_earning_250k_what_do_you_do_and_how_did/",
    "created_at": "2025-08-23T23:00:47.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1lda7t8",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Out of work all year",
    "text": "I'm posting this to help a family member who's been searching for work as a process engineer/manufacturing specialist etc in the biopharma field.  Please give honest (but kind) feedback and tips.  Thanks!",
    "score": 116,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1lda7t8/out_of_work_all_year/",
    "created_at": "2025-06-17T01:08:38.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1llvt5p",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Realizing I hate Operations and want to do Design Work",
    "text": "I am currently an assistant superintendent for a paper mill and realize today I hate operations. I worked as a process engineer for a while and got to enjoy that for a bit, but am really dislike trying to keep things running and pleasing people enough. \n\nMy biggest gripe is there is only issues, never really anything that is great news and don’t get a lot of wins. Feels like I whack a mole of issues and 3 more pop up. \n\nI really enjoyed creating P&amp;IDs and doing sort of design work when I was in school. I enjoy doing projects I actually had a lot of great ideas and came up with a few projects that payed my salary 3X over in my first few months of working (currently going through capital).\n\nWhat career path can I take? What job title can make this work for me? I am thinking it would be consulting and if so I will begin trying to get my FE. Feel free to comment your thoughts, opinions, questions, or suggestions.",
    "score": 112,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1llvt5p/realizing_i_hate_operations_and_want_to_do_design/",
    "created_at": "2025-06-27T14:49:50.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1jupbks",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "is there a mismatch between academia and industry?",
    "text": "i notice they put motivation slides, and saying you can work in fuel cell, solar cells, semiconductor electronics. but the actual job is being in a chemical plant, turning knobs and seeing what happens lol, or electronic manufacturing doesnt even use much of chem eng, its mostly statistical process control. or the fact that they teach you mathematical control theory but not the electrical part (super important). all the things they teach us seem more graduate studies. \n\nBut ive seen like mechanical engineers or electrical actually use more of what they learned in school. ",
    "score": 111,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jupbks/is_there_a_mismatch_between_academia_and_industry/",
    "created_at": "2025-04-08T21:37:30.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1mvf7eq",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "First TA Ever at A Gas Plant...Holy Fuck",
    "text": "I'm 2.5 years into my career and am involved with a record turnaround. It was scheduled to be a 45 day outage, which is already a long time by most standards, but we're at day 82 now and likely to go into day 90.\n\nThe amount of things that could have gone wrong, went wrong. We have a SRU converter that has 4 beds all in 1 vessel and has been in service for 45+ years, we found out in the middle of TA that there's been massive sulfidation damage on all the structural beams etc. The plant was just bought out by a company that has a really high bar of standards and realized that what they bought, was in way worse shape they could have imagined.\n\nI lost my entire summer and have worked 70+ hour weeks (absolute minimum if you take a few days off) for the past 2.5+ months. I think I'm starting to develop some sort of depression that's likely temporary since obviously everyone has stuff happening personally too. Broke up with girlfriend of 4 years in the middle of of TA and looking to move etc.\n\nPretty cool to experience this just 2.5 years into my career but the amount of strain and stress for what will be 90 days is incredible. Career changing experience and got to work on some cool stuff, but at a certain point, it's not worth it anymore, my record so far this TA is working 24 days straight, the plant is also in the middle of nowhere so I have barely been home the entire summer and when I am home, I just sleep and clean my place...just wanted to share....time to get up now and go back to site for day 83",
    "score": 109,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1mvf7eq/first_ta_ever_at_a_gas_plantholy_fuck/",
    "created_at": "2025-08-20T13:44:14.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1o1p0bc",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Received offer! 2026 Application Stats",
    "text": "I'm class of 2026 and just received my first full-time job offer with a F500 manufacturing company. I was applying for rotational and early career programs and began applying at the end of August. Very glad to be finished. Here are my application stats:\n\nApplications: 146\n\nInterviews: 8\n\nOffers: 1\n\n",
    "score": 100,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1o1p0bc/received_offer_2026_application_stats/",
    "created_at": "2025-10-08T22:13:34.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1l7091b",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Genuinely lost with my career",
    "text": "Quick background. I have a BS in ChemE and a PhD in Chemistry. I've worked as a Process Engineer in renewable fuels for a few years and moved into R&amp;D and then manufacturing. In total I've got 4 years of process engineering experience and 4 years of production management (mid-senior level). Currently working for a large chemical company (top 3 globally). While I enjoy the chaotic nature of operations and running large-scale chemical plants, I'm starting to develop doubts about this career path. Due to my experience I'm a bit scattered as I can go into R&amp;D, academia, or remain in operations. Really though, what I'd love to do is move into consulting (either management or process engineering). I was hoping to get some feedback about this. I feel like it is very difficult to get into consulting at this stage in my career, not sure how to get into it.",
    "score": 94,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1l7091b/genuinely_lost_with_my_career/",
    "created_at": "2025-06-09T09:21:21.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1jigisk",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Do chemical engineers enjoy chemE classes?",
    "text": "I’m a second year chemE student, and I’m taking fluid mechanics and thermodynamics currently and am realizing I have absolutely zero interest in these subjects. Is it possible that I can be so disinterested in these subjects and still find a chemE career interesting? Or is disliking my classes a sign that I should change my major. Do any current chemical engineers remember disliking chemE classes but now enjoy their chemical engineering jobs?",
    "score": 86,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jigisk/do_chemical_engineers_enjoy_cheme_classes/",
    "created_at": "2025-03-24T02:26:41.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1m2rmjm",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "How much do you guys earn per month?",
    "text": "I am a process engineer in oil and gas sector. Im trying to build my career around this and im making too less money. I just want to know how much i can expect as i get more experience.You dont even have say the exact figure you make, just tell me how much i can expect with relevant experience.",
    "score": 80,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1m2rmjm/how_much_do_you_guys_earn_per_month/",
    "created_at": "2025-07-18T03:20:21.000Z",
    "num_comments": 127
  },
  {
    "id": "reddit-1mu2pk5",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Recent graduate feeling hopeless",
    "text": "I know you guys probably see about a hundred of these a day but I really just need some advice or hopeful words or something to keep me going. I have done everything throughout my school and career to try and set me up to be successful I did a co-op at a big company and also a more technical hands on one at a small company. I worked hard through school and even transferred from my small school to a bigger one for a better education. I have been applying since February and I’ve been denied from even the jobs that I have connections either where my brother works at. Made it to two final round interviews this summer just to be ghosted at the end and it’s honestly just made me feel like I might not ever land something. For context I am located near Boston which I know isn’t the biggest hub but most of my applications have been around this area, but I am open to relocating and have been applying to Texas California Arizona Florida etc.\n\n\nI posted on the engineeringresumes subreddit and I didn’t get any responses so I figured I’d ask for advice here. Does anyone have any ideas that could help me become a more attractive candidate? I have good knowledge but get nervous in interviews but I still think they have gone well. Anyone have any ideas how to advance my career. I am not picky about pay or location I just want to get my foot in the door and learn as much as I can and get experience.",
    "score": 77,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1mu2pk5/recent_graduate_feeling_hopeless/",
    "created_at": "2025-08-18T23:52:38.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1hv7rgp",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Python for Engineers",
    "text": "Hi folks,\n\nSome of you may remember I made a little course on Python aimed at engineers after [56% of a sample of people from the MechE community said they were either a beginner or they wanted to learn](https://www.reddit.com/r/MechanicalEngineering/comments/1fk011z/how_many_of_you_can_code_in_python/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button).\n\nI have used Python personally in my own career for over a decade, migrating from a more traditional MechE career path to being a systems simulation engineer. It helped me build a [pretty interesting and rewarding engineering career](https://www.reddit.com/r/MechanicalEngineering/comments/1gh8at0/my_13_year_nontraditional_meche_career_journey/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button).\n\nMy latest venture is teaching others all about simulation and Python. I'm fully focussed on my simulation course now, so I'm just interested in getting as many relevant people onto the Python course. I hope if you like this course you might be inclined to check out my simulation offerings at a later date, but of course you're completely free not to.\n\nSo I'm offering spots on [the course](https://www.udemy.com/course/python-for-engineers-scientists-and-analysts/?couponCode=2025JANUARYFREEBIE) for free over the next few days - all I ask in return is that you please give me a review if you find it helpful.\n\nAnd if you have any really scathing feedback I'd be grateful for a DM so I can try to fix it quickly and quietly!",
    "score": 70,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1hv7rgp/python_for_engineers/",
    "created_at": "2025-01-06T19:42:30.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1jiw0d8",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Is chemical engineering in the uk even worth it anymore",
    "text": "I have an offer to study chemE at one of Oxbridge but I’m wondering if it is even worth it as a career path financially. I’ve heard people say that a senior process engineer would make around 70k which is good but small compared to those people in finance who can make similar numbers out of uni. I have the chance to switch my degree to a more numerate one in order to maximise chances in quantitative finance but am hesitant as I really do like the topics studied in chem eng",
    "score": 66,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jiw0d8/is_chemical_engineering_in_the_uk_even_worth_it/",
    "created_at": "2025-03-24T17:13:20.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1ki288r",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "So only the most brilliant get to have jobs?",
    "text": "4 months out of uni with a 3.4 very average student but i sure do work hard. I keep applying everywhere. The best i can get is an interview IF I pass an assessment and no response from employers. Give me hard truths. Does this career only take the cream of the crop or is it just a time thing cause im just lost ",
    "score": 64,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1ki288r/so_only_the_most_brilliant_get_to_have_jobs/",
    "created_at": "2025-05-08T21:47:37.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1jq2sgi",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Accepted a Summer Internship Offer but Just Got an Offer from NASA — Need Advice on Backing Out",
    "text": "I accepted a summer internship offer with a company. However, I recently received an offer from NASA — something I’ve dreamed about for years.\n\nAfter discussing it with my parents and research mentor, they all strongly believe I should go with NASA. I agree — it’s a once-in-a-lifetime opportunity that aligns perfectly with my goals, and I’m prepared to professionally withdraw from the original internship.\n\nHere’s my dilemma: even though I didn’t find the original internship through my school’s career center, I’m still worried that backing out could somehow get me in trouble with my university — maybe affecting my standing or future opportunities. Has anyone dealt with something similar?",
    "score": 62,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1jq2sgi/accepted_a_summer_internship_offer_but_just_got/",
    "created_at": "2025-04-02T23:10:27.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1lxl9uw",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Tips for staying sharp in ChemE",
    "text": "I graduated 2 years ago. Since then I’ve worked as a Process Engineer in Food. In terms of work, obviously there’s stuff I do that’s engineering related but there definitely seems a lack of use for hardcore ChemE skills I learned at University. I passed my FE exam like a year ago just so I would keep fresh but honestly if you asked me core ChemE questions I would need to google. I want to go more technical later in my career but right now I almost feel like a fake ChemE. I am applying for new jobs as I want to potentially move/find a different industry. \n\nNot sure if anyone’s experience/d anything similar but any advice for trying to keep my skills honed? Is this normal? ",
    "score": 60,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1lxl9uw/tips_for_staying_sharp_in_cheme/",
    "created_at": "2025-07-11T23:09:58.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1nx8l9b",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Relocating to Houston for Exxon?",
    "text": "I recently received a job offer to work for Exxon Mobil in Houston. It’s a great job opportunity, with a $35K salary increase to what I’m making now. I live in the Northeast and my biggest concern is relocating my life to Houston where I don’t know anyone. I’m single, in my late 20s, and have a dog but nothing is really anchoring me down in the northeast besides friends.\n\nI feel like having Exxon experience can set me up for life regarding career growth and the name recognition will be great. But part of me is extremely nervous about starting over in the south where I could be lonely and hate my life. I live in Philly now with a handful of friends in the city, but a lot are married / doing their own thing on weekends \n\nAnyone make a similar move, or know how much community there is for younger employees?\n\nBy the way, this is technology role - not manufacturing. I’ve also been set on leaving my current company, but haven’t had any luck finding a new job in the area (Philly area).",
    "score": 60,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1nx8l9b/relocating_to_houston_for_exxon/",
    "created_at": "2025-10-03T19:24:07.000Z",
    "num_comments": 91
  },
  {
    "id": "reddit-1nrtqqv",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "What jobs can I pursue if I don't want to be a process engineer? (like being present on-site at the plant)",
    "text": "Hello, hope you all are having a good day. I would like to ask about jobs as a chemical engineering student. Recently we had an industrial visit to a petrochemical industry and uhh i would not want to work as a process engineer, is what I have realised. But I am interested in the processes, etc. But I just don't want to work on-site(?). What are some other careers I can pursue? I have gone through various job-related posts on this subreddit and i do know on site experience is needed, but I would like to pivot to a more niche career afterwards. \n\nThank you for any help that comes this way.",
    "score": 60,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1nrtqqv/what_jobs_can_i_pursue_if_i_dont_want_to_be_a/",
    "created_at": "2025-09-27T12:16:52.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1mfwie8",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "I passed the PE Chemical exam on the first trial after 3 weeks of studying",
    "text": "Hi everyone! I just passed the PE Chemical exam and wanted to share my experience, hopefully this helps those of you preparing.\n\n\n🎓 My background:\n- I graduated just a year ago, so most of the core chemical engineering material was still relatively fresh.\n- I was lucky to have interned at a process safety consulting firm, which really helped with safety-related questions.\n\n📚 Study strategy (3 weeks, full-time job):\nI didn’t follow a big review plan or dive into textbooks. Instead, I focused entirely on practice problems, which I think was the most efficient approach.\n\nHere’s what I did:\n- Start with a full practice exam (I used NCEES 2020) to benchmark myself: Identify strong/weak areas and get familiar with timing and question style\n - Thoroughly review all solutions, not just checking the answer, but making sure I could solve it myself from scratch.\n- After that, I re-took the same exam under timed conditions. If I scored 95% or higher, I moved on.\n\nI went through:\n- NCEES PE Chemical 2004 &amp; 2020 (very close to actual exam difficulty, 2004 doesn’t have official solution but I made 1 in another post)\n- Perry’s PE Practice Exam: a bit easier, had some typos, but still helpful\n- I skipped Matthew’s exam. I felt it didn’t reflect the actual exam’s difficulty or structure as well.\n\n⏱ Exam-day tips:\n- The PE Chemical exam has 2 sessions of 40 questions each:\n\t•\tAM session: Mostly short and straightforward calculations.\n\t•\tPM session: More complex problems and theory-based questions that require reasoning.\n- You get a total of 8 hours, shared between both sessions. If you finish the first session early, you can submit it and use the extra time for session 2. I highly recommend doing this!\n- Average time per question is ~6 minutes, but you don’t need to rush. Some theory questions take less than a minute. I finished comfortably, and it seemed like most people did too.\n\n💡 Final advice:\n- Take the PE exam early if you’re eligible. It gets harder to study as time passes and responsibilities grow.\n- Expect challenges in Plant Design if you’re early in your career, it’s more experience-driven.\n- Focus on practice, learn from mistakes, and don’t get discouraged if your first score is low. You’ll improve quickly with review and repetition.\n\n🙋‍♀️ Question for the community:\nI’m currently working at an EPC company, but it’s a bit of a slow period right now, so I have some extra free time during work hours. I want to make the most of it and learn new skills that could help me become more valuable or at least reduce my layoff risk if the market gets worse.\n\nWhat skills or certifications would you recommend picking up during downturn in an EPC role (process engineer background)?\n\nThanks in advance and good luck to everyone studying!",
    "score": 59,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1mfwie8/i_passed_the_pe_chemical_exam_on_the_first_trial/",
    "created_at": "2025-08-02T17:41:32.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1nnvjsf",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Career advice",
    "text": "Hi everyone, \nI have posted on here before just asking for advice on trying to get my first full time job out of college. I graduated in May 2024 and have been struggling in getting a role. I have attempted to fix my documents and taken feedback from many people. Just want to get additional feedback and see what I can do to improve my odds. Currently I am working as a pharm tech just to pass time while I look for something. \n\nThank you \n",
    "score": 55,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1nnvjsf/career_advice/",
    "created_at": "2025-09-22T19:08:59.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1m67fc2",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Red flags of Chemical Engineering as a career",
    "text": "As a student heading into my final year of high school and also as a student looking to apply to colleges I’ve been interested in ChemE for a little over a year. I’ve done research in the field and I am definitely interested in the manufacturing part of ChemE. But I was wondering if there were any parts of the field as a career that are bad as those are not commonly found online?\n\nThank you for your responses",
    "score": 54,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1m67fc2/red_flags_of_chemical_engineering_as_a_career/",
    "created_at": "2025-07-22T07:11:57.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1irkqs8",
    "subreddit": "ChemicalEngineering",
    "soc_codes": [
      "17-2041"
    ],
    "title": "Regret doing Chemical Engineering?",
    "text": "I've been thinking lately about why I chose chemical engineering. It was partly because of the prestigious title and the challenging nature of the degree, compared to other engineering disciplines (and money). I believed that graduating with this degree would make me a highly sought-after candidate in the job market. However, I’ve come to realize that Chem E jobs are few and far between. For example, there were only 15 entry-level positions on LinkedIn, while civil, mechanical, and electrical engineering each had over 200.\n\nHow can graduates compete with only 15 entry positions? If I could do it all over again, I would definitely choose civil engineering. It may be considered easier, and the median later-career pay might be lower, but I wouldn't have to stress about unemployment. Instead, I’d have a steady job.\n\nDo other recent graduates feel the same way?",
    "score": 53,
    "url": "https://reddit.com/r/ChemicalEngineering/comments/1irkqs8/regret_doing_chemical_engineering/",
    "created_at": "2025-02-17T14:13:40.000Z",
    "num_comments": 69
  }
]