[
  {
    "id": "reddit-1idcxsw",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I am a federal social worker and I am not okay.",
    "text": "My mental health is tanking. I'm withdrawing from my family. I'm feeling so bad for my boss who is being put through the ringer too. Everything is a crisis. Everything must be done immediately. It's creating so much chaos and trauma and nervous system activation. \n\nI was reading about this sociological theory called disaster capitalism and then found out about an airline disaster that just happened in DC and I'm just so overwhelmed and numb. I can't fathom how anyone identifying as Christian would truly want this grotesque monstrosity of a country that is being created right now. \n\nI'm scared. I want to hold strong and weather the storm, but I'm worried I'm not strong enough and will develop PTSD from the abusive behavior being dumped on all the federal workers right now. \n\nThe Constitution matters. The oath I took matters. \n\nBut there's got to be some real movement and visible opposition for me to hang on in this role. I've got to start seeing people that likely voted for him communicate their doubts or fears. I've got to see evidence that some of them realize the horror they are cheering for. I've got to see evidence that people see the sky is fucking falling. Guys. Please. Help. It's not even been two weeks and I'm drowning in executive orders, shock, overwhelm, it's all standard tactics to destroy an organized system. He's really good at ripping things apart. \n\nYour federal level peers in American government are not okay. Send help. ",
    "score": 1423,
    "url": "https://reddit.com/r/socialwork/comments/1idcxsw/i_am_a_federal_social_worker_and_i_am_not_okay/",
    "created_at": "2025-01-30T03:17:41.000Z",
    "num_comments": 137
  },
  {
    "id": "reddit-1keg9dr",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "MSW!!",
    "text": "Just wanted to share I graduated with my MSW  and luckily got to get a picture with my soon to be earth bound daughter! Was able to obtain EMDR certification and now looking to become an National Emergency Responder and Public Safety Certified Clinician ",
    "score": 1317,
    "url": "https://reddit.com/r/socialwork/comments/1keg9dr/msw/",
    "created_at": "2025-05-04T09:58:57.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1jeg9p4",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I’m satisfied",
    "text": "I like my job. My degree has been useful. There are some shitty social workers and shitty placements and shitty things in general. There are also plenty of us who love what we do.\n\nI balance CMH as a mobile clinician and private practice - and take home over $10,000 a month. My wife is happy. I can’t change the world, nor do I convince myself I can. There will always be others willing to do the roles you don’t want to. \n\nGrad school is full of baby social workers. Of course, they are incompetent and selfish. Give them time too. \n\nYou will be ineffective the more you stress. Life will be ok. You will succeed. We need more positive stories. Social work is not some dying field with no purpose to get into. \n\nWe will be ok. ",
    "score": 883,
    "url": "https://reddit.com/r/socialwork/comments/1jeg9p4/im_satisfied/",
    "created_at": "2025-03-18T21:19:39.000Z",
    "num_comments": 136
  },
  {
    "id": "reddit-1of7co1",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Anyone have clients who voted for trump who are now losing their benefits?",
    "text": "Curious if any of you out there have clients who were MAGA supports and are now being stripped of their benefits. I had a few but now I’m furloughed so I can’t check in on them to see how they are doing. ",
    "score": 866,
    "url": "https://reddit.com/r/socialwork/comments/1of7co1/anyone_have_clients_who_voted_for_trump_who_are/",
    "created_at": "2025-10-24T19:41:15.000Z",
    "num_comments": 268
  },
  {
    "id": "reddit-1pq1jn6",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I’m really concerned by some of the comments on here.",
    "text": "Some of the responses to people’s questions and experiences on here are so incredibly cruel. This is obviously in response to the post about being fired for sexual harassment. If I read some of the things you all said, I’d leave the field. \n\nEvery single one of us has made a mistake. Just because you’re a social worker doesn’t mean you suddenly are incapable of wrongdoing, and I don’t think that is a healthy or realistic expectation to have for ourselves or others.\n\nIt is to the point that I wonder why anyone asks for support on here at all, as they are likely to be told they’re the stupidest person and how no one would EVER have done that.\n\nValuing the dignity and worth of the person is NOT limited to just the people we serve. All of us are constantly learning, as is required of us, and we should be encouraging these discussions and providing feedback instead of isolating people.\n\nAll of our lives are easier when we grow and learn, individually and together. ",
    "score": 860,
    "url": "https://reddit.com/r/socialwork/comments/1pq1jn6/im_really_concerned_by_some_of_the_comments_on/",
    "created_at": "2025-12-18T20:38:50.000Z",
    "num_comments": 242
  },
  {
    "id": "reddit-1jlk2nz",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Nurse here",
    "text": "Hi there, I’m a nurse that works in the ER and I’ve worked with many social workers. I love you all but today, while watching today’s episode The Pitt, it really highlighted the strength required to be a social worker. We couldn’t do what we do without you. Thank you for all you do. ",
    "score": 757,
    "url": "https://reddit.com/r/socialwork/comments/1jlk2nz/nurse_here/",
    "created_at": "2025-03-28T01:52:09.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1p3wi8q",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "My client called me special",
    "text": "I work in crisis and had a very suicidal man come in today, I considered him to be extremely high risk and was really worried about him. \n\nI sat with him for three hours and listened, and while we stood in the parking lot of the hospital preparing to go in, he pointed his finger at my chest and almost aggressively said “you make a difference. Don’t ever forget that. You are special, so special.” And with tears in both of our eyes, I said “you’re special too.” And then he gave me a big hug. \n\nI genuinely believe I saved this man’s life today. I really, really, really hope he makes it through this rough patch. \n\nToday I was reminded why I do my job for little money, I was reminded why I care even when I’m losing hope in humanity. I was reminded why I worked so hard to get here. This client has no idea the impact he had on me today, it will leaving a lasting impression. ",
    "score": 737,
    "url": "https://reddit.com/r/socialwork/comments/1p3wi8q/my_client_called_me_special/",
    "created_at": "2025-11-22T15:51:10.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1nwq6j9",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Sending love to the US social workers in this sub!",
    "text": "Canadian social worker here who follows U.S. news and current events. I can imagine you’re struggling right now with endless challenges, and now you have a gov shutdown to contend with. You’re doing really important work for vulnerable, marginalized people and my heart goes out to you for having to work under those conditions. \n\nIf there is anything we Canadian SWs can do to support you, please let us know. Lots of Canadians have a negative view of the U.S. government but not the people like you who are working to help people and enact change❤️\n\n*edited to add more\n\nI wasn’t expecting the reaction I got - I didn’t realize quite how worrying it was for you all! Myself and other Canadian social workers, I’m sure, are open to reading your vents if you want to share. We desperately need more social workers across my country, but I bet many of you want to stay no matter what happens to support other Americans going through challenges. \n\nI am really heartened to see the passion and kindness you all have for the communities you work with. I don’t know many Americans personally, but I have liked the outspokenness and vivacity of those I have met. Sending lots of love and strength across the border and I know you all will support each other through this administration and whatever happens because of it❤️",
    "score": 733,
    "url": "https://reddit.com/r/socialwork/comments/1nwq6j9/sending_love_to_the_us_social_workers_in_this_sub/",
    "created_at": "2025-10-03T05:01:01.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1j4dnqv",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "21,000 VA Social Workers told to stop with the “compassion+action” talk",
    "text": "The VA has traditionally joined with NASW to celebrate National Social Work Month. This year is no exception, with many activities and celebrations planned to honor the 21,000 social workers at the VA — the largest employer of social workers in the country.\n\nToday VA staff were told to immediately discontinue use of the “Compassion + Action” theme because it’s “not approved by VA Communications.” This includes all materials with the compassion logo, any merchandise, all mentions in the signature lines of emails, TEAMS messages, etc.. The VA has apparently “reworked” all such materials to say, simply, “2025 National Social Work Month.” \n\nKeep in mind that VA social workers are (for the most part) liberal leaning and are among the most fierce advocates for LGTBQ issues and what has become known as DEI efforts. They are also among the strongest advocates any veteran can have. \n\nNo one has officially commented as to “why” the VA reversed course and is cleansing the “compassion” rhetoric, but the action likely speaks for itself. ",
    "score": 667,
    "url": "https://reddit.com/r/socialwork/comments/1j4dnqv/21000_va_social_workers_told_to_stop_with_the/",
    "created_at": "2025-03-05T20:53:45.000Z",
    "num_comments": 125
  },
  {
    "id": "reddit-1jqp9p4",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "It’s happening. People at work are starting to get fired.",
    "text": "Everyone in the donations center was let go and locked out today. \n\n\nOur therapist was fired yesterday and they hired an outside consultant. \n\n\n\nI am worried. \n\nI am a case worker. They don’t need me. \nThe nonprofit is funded by the government. \n\n\n\nI’m so scared ",
    "score": 634,
    "url": "https://reddit.com/r/socialwork/comments/1jqp9p4/its_happening_people_at_work_are_starting_to_get/",
    "created_at": "2025-04-03T17:55:36.000Z",
    "num_comments": 173
  },
  {
    "id": "reddit-1jqfvxs",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "This field says they want more BIPOC and LGBTQ+ social workers—but the path isn’t built for us.",
    "text": "Yesterday in class, we played the “privilege game,” based on ACEs scores. Everyone started at the back of the room and took a step forward when a statement applied to them. By the end of the activity, I was the only student standing at the front of the classroom.\n\nOur professor—who identifies as BIPOC and LGBTQ+—shared that she would’ve been standing up front with me. She tried to start a conversation about privilege: what it means to be a white social worker or therapist, how privilege shapes our lens, and how it impacts the power dynamics we carry into clinical spaces.\n\nBut the room fell quiet. Only a couple of us engaged.\n\nFor the record, I hate that game. It’s vulnerable and uncomfortable. But I didn’t want to opt out. I already knew I’d be the outlier—and still, I chose to take up space, to stand in the truth of my experience instead of carrying shame.\n\nAt one point, the professor asked the class what she and I had in common. No one responded. She turned to me, and I said, “We’re both women from marginalized communities.” I shared that I identify as mixed—Mestiza—and that we both come from backgrounds where resources are limited and systems aren’t built for us.\n\nBut what stayed with me most wasn’t the exercise. It was the silence that followed.\n\nAs a white-passing, mixed-race MSW student in a prestigious, predominantly white institution, I sit in a complicated place. I recognize the privilege I hold by simply being in this program. But getting here has taken more effort, time, and energy than most of my peers will ever understand.\n\nI’m tired of being the one who always has to speak up. Tired of having to educate. Tired of white students and colleagues who claim to care about justice, but won’t actually engage when it matters.\n\nWhite social workers and therapists: it’s time to step up. If you’re committed to anti-oppressive practice, prove it. Use your voice and your privilege to call out outdated, racist, or exclusionary policies at work. Speak up when your peers say something harmful. Challenge your families when they perpetuate hate or uphold white supremacy—even when it’s uncomfortable.\n\nBecause what I see all too often is white folks picking and choosing when to show up. They’ll go to a protest, post on social media, but stay silent when their own families or coworkers express bigotry. That’s not allyship—that’s convenience.\n\nOur field constantly talks about the need for more BIPOC and LGBTQ+ representation in social work and therapy—and that’s true. But institutions have to make that access real. Not just in words, but in action. Lower the barriers. Fund us. Make the path more accessible to those of us who are underrepresented and underserved.\n\nSocial work is about showing up, not just when it’s easy, but especially when it’s hard.\n\nIf we’re serious about equity and inclusion, it’s time to stop talking the talk and start walking the walk.\n\n",
    "score": 633,
    "url": "https://reddit.com/r/socialwork/comments/1jqfvxs/this_field_says_they_want_more_bipoc_and_lgbtq/",
    "created_at": "2025-04-03T11:26:21.000Z",
    "num_comments": 138
  },
  {
    "id": "reddit-1hwax2u",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Passed the Licensing Exam 😄",
    "text": "I’m really happy to share that I can soon formally add an ‘L’ to my MSW credentials! I’ve looked to this subreddit for insight on the exam as well as to see what’s happening with other social workers, wherever they may be, for the last few years. The posts discussing people’s experience with preparing for and passing the exam were motivators and I wanted to share a bit about my experience now that I, too, have passed. \n\nThe recommendation in some posts to take the official ASWB practice exam and use it as a study tool was so helpful. I was a bit overwhelmed with where to start studying, while I had great resources at hand, and taking the practice exam helped me gauge where I was at as well as areas I needed to focus on. It also helped to get a feel for the exam as it is timed and uses similar software, so it wasn’t such a foreign experience on exam day. Based on the results of the practice exam, I narrowed down the content areas and types of questions (first/best/next/most) that I answered incorrectly and used that as a springboard. I haven’t been working in the field for a couple of years since completing my MSW, but I’ve been in the field for close to 10 years as a BSW and have worked in various settings; that background knowledge plus recent MSW helped. In addition to that, my Alma mater offered a prep course that I used and it was a great tool. Personally, I found that it was a bit much to get info from multiple sources, i.e. various YouTubers (though helpful), vs sticking with the one course and looking to other resources to fill in any gaps as needed. The creator of the course broke it down into the major content areas you see on the exam and included questions in each section.\n\nIn addition to the practice exam and creating a study plan, as others have noted, the next best thing is answering as many practice questions as possible to help you understand how to navigate the questions. The exam was not particularly easy and I found myself taking more time than I expected on the questions, especially in the beginning, but I tried not to let that psych me out and reminded myself that I knew much of the content and just had to figure out what was being asked. So much of the exam is about figuring what you’re being asked and what answer fits that particular question/scenario posed; at times it doesn’t translate to what we would do in practice.\n\nIf you’ve read this far, thanks for reading! If you’re looking to take the exam soon, you’ve got this!",
    "score": 610,
    "url": "https://reddit.com/r/socialwork/comments/1hwax2u/passed_the_licensing_exam/",
    "created_at": "2025-01-08T04:01:09.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1oipy5v",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Anyone else preparing for hell at work next week?",
    "text": "I work at a homeless shelter, and we finally have it confirmed that our state is not issuing SNAP benefits starting November 1 (including any back pay). I’m feeling so helpless for my clients and their children who are already struggling. I don’t know how we’re going to supplement this because we’re barely getting food donations as it is. I know my clients are going to shoot the messenger aka me. ",
    "score": 593,
    "url": "https://reddit.com/r/socialwork/comments/1oipy5v/anyone_else_preparing_for_hell_at_work_next_week/",
    "created_at": "2025-10-29T00:08:26.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1itgqpd",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Do not be complicit in facilitating \"adoptions\" resulting from forced births.",
    "text": "States like Missouri want to compile registries of pregnant people who visit crisis pregnancy centers.\n\nhttps://www.google.com/amp/s/thehill.com/homenews/state-watch/5151439-missouri-bill-registry-pregnant-women-abortion/amp/\n\nThey want to end abortion access, force births and smoothly facilitate adoptions.\n\nSome of the \"contractors\" who will be soothing and smoothing the transfer of forced birth babies into yte Christian families will be social workers.\n\nYou might think the work is noble. It's not. It's anti woman, anti choice, and anti human.\n\nEdit to add:\n\nThese are the new jobs coming after Medicaid is gutted.\n\nForced birth means that consent for adoption is meaningless.\n\nDo not be complicit.",
    "score": 569,
    "url": "https://reddit.com/r/socialwork/comments/1itgqpd/do_not_be_complicit_in_facilitating_adoptions/",
    "created_at": "2025-02-19T21:11:37.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1nkpbz3",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Hot take",
    "text": "I need to say this clearly. If your job in managed care operations is to deny care to people who need it, and you are making those decisions about clients you have never even seen, you are not practicing social work or therapy.\n\nThat kind of work is not advocacy and it is not client-centered practice. It is serving the bottom line of insurance and managed care organizations. It is selling out and doing their dirty work while people in need are left without essential services.\n\nI know the system is complicated and people need jobs, but how do we as a profession reconcile our ethical duty with roles that exist to cut costs instead of helping clients?\n\nAm I being too harsh, or is this something we need to say out loud?",
    "score": 552,
    "url": "https://reddit.com/r/socialwork/comments/1nkpbz3/hot_take/",
    "created_at": "2025-09-19T00:39:59.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1kw76as",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "My company is taking away my work cell phone and I am enraged",
    "text": "I literally just got back from vacation, and out of a bad habit I just checked my work email(on my work cell) and got a message from my boss and the company that my work cell is being removed and they are willing to pay me $15 a month to add an extra line to have a separate work number. I’m irate. I don’t want PHI and sensitive information on my personal cell. I don’t want our tigertext messages. I don’t want to get calls from residents or their families after hours. I want to put my cell down after work and walk away from it when I’m done working. Maybe I’ve been spoiled this whole time and I’m throwing a tantrum right now but I don’t care. I feel like this company has joyfully been eroding my boundaries since I started working here and I’m seriously considering leaving over this.my business cards will now be defunct, I’ll have to let all the resident’s families, the vendors I work with, and the agencies I partner with to provide services. I don’t understand what the benefit of this is. It makes absolutely no sense to me. As a social worker in a retirement community, I’m already completely overwhelmed, and this is sending me over the edge. Thanks for listening, rant over. \n\nUpdate: I lost the phone war. The VP never even replied to me, she just went through my boss. I want to look elsewhere, but I genuinely don’t know what else to do with my career. I don’t love being a social worker so at the moment so I’m kind of at a loss here. ",
    "score": 545,
    "url": "https://reddit.com/r/socialwork/comments/1kw76as/my_company_is_taking_away_my_work_cell_phone_and/",
    "created_at": "2025-05-26T22:15:29.000Z",
    "num_comments": 151
  },
  {
    "id": "reddit-1k3diaq",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I’ve been an investigator for 9 months, and this job is THE most thankless.",
    "text": "I feel like I’m damned if I do, and damned if I don’t; It’s a never ending cycle. I’m a DCFS investigator in the southern U.S. I’ve watched a drugged out teen couple try to sell their 3-month-old daughter in a police stint. I’ve had threats to my me or my family because i HAVE to wear a badge with my first and last name, and my last name ain’t common. I’ve been asked how much I make per child I snatch and understandably, everyone hates you. I make around $18 dollars an hour to do this. I genuinely wonder why DCFS doesn’t unionize nationally tbh. Folks think we’re the police, but the only power we have is one of the only powers the police or Feds DON’T: confiscating children in dangerous situations. We don’t get the same pay as police or most government officials, and we don’t get the same praise, because everyone on all political aspects, or even those that don’t associate with political sides in general, hate us for the most part. As a male I get the more dangerous cases understandably, and I fear someone will be crazy enough to look up my own children if I have to find true on maltreatment. I want to help make a difference, but it’s understandable why DCFS has such a difficult time maintaining employee retention; you have to have either a Bachelor’s degree, OR 5 years experience in social work. How can a job requiring such high standards, high expectations and high working hours pay so low, yet arbitrarily question why they have such employee turnover? It makes negative Zero sense.",
    "score": 528,
    "url": "https://reddit.com/r/socialwork/comments/1k3diaq/ive_been_an_investigator_for_9_months_and_this/",
    "created_at": "2025-04-20T03:26:44.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1oihulo",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "My boss didn’t want people to see me leaving her office after crying",
    "text": "I work in a luxury retirement community as the sole social worker and my boss scheduled a 1:1 with me today. The 1:1 was basically her telling me that I’m not doing as well as I thought I was, and that the company expects us to do a great job, not just a good job. I ended up breaking down in tears because I felt like I was blindsided by this and I thought I had been doing much better. When the meeting ended I started getting ready to leave but my boss asked me to stay in her office for a few minutes to collect myself, I said no thank you, and then she said she didn’t want people to see me coming out of her office in tears. I said oh I don’t really care if people see me and she said she felt it would make her look bad if people saw that I had been crying. I kind of just stared at her after that, and then I just picked up my stuff and left. I’m just tired at this point, maybe I’d do a “great” job if this company actually backed me up.",
    "score": 483,
    "url": "https://reddit.com/r/socialwork/comments/1oihulo/my_boss_didnt_want_people_to_see_me_leaving_her/",
    "created_at": "2025-10-28T18:48:14.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1iz6hfo",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I broke one of my personal rules today",
    "text": "So I am a hospice social worker. I had a patients wife call me this morning saying their power was shut off. I called the local capca, the LiHeap, area churches to help get payment for it to be turned back on. I called the electrity company to see what I needed to do and had a letter from our doctor stating that this patient needed power for oxygen and their hospital bed. The electric company still would not turn it on without payment. The payment was only $100, but I’ve made it a personal rule to never spend my personal money with my profession but I was so tired at this point because it had been an all day thing. I offered to pay to get it turned back on as a one time thing if they promise to pay the rest when they are paid at the first of the month. I did it securely so they could not see my card information. I know I did a good deed but I feel upset with myself if that makes sense.",
    "score": 465,
    "url": "https://reddit.com/r/socialwork/comments/1iz6hfo/i_broke_one_of_my_personal_rules_today/",
    "created_at": "2025-02-27T03:31:01.000Z",
    "num_comments": 137
  },
  {
    "id": "reddit-1j5em4t",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Is anyone else aghast that the CSWE gave Liberty University accreditation??",
    "text": "This profession is a fucking joke, I swear. Please discuss.\n\n^^^^^^I am writing the rest of this text to comply with the subreddit’s rule of at least 150 characters. I love you and I hope you’re having a great day! Stay frosty, my friends. Also remember, Martin Luther King, Jr. was a real Christian who taught the idea of agape love and was instrumental in the civil rights movement.",
    "score": 457,
    "url": "https://reddit.com/r/socialwork/comments/1j5em4t/is_anyone_else_aghast_that_the_cswe_gave_liberty/",
    "created_at": "2025-03-07T03:51:08.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1ko5c54",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I want to hear your unethical social worker stories",
    "text": "Hopefully these aren’t personal stories, but I want to hear stories of unethical social workers you’ve run into throughout your career. I’ll start! \n\nThis story is more alarming than anything but I knew a rcswi who worked with children but was transitioning to a position where she would be working with adults. She disclosed that she never had to worry about / think about the fact that she couldn’t sleep with clients because in her words, “You know, duh, they’re children”, BUT she realized that she would actively need to remember and be aware of the fact she couldn’t sleep with her adult clients. BECAUSE THATS SOMETHING THE ETHICAL SOCIAL WORKER HAS TO REMIND THEMSELVES??? Anyway. Your turn! ",
    "score": 406,
    "url": "https://reddit.com/r/socialwork/comments/1ko5c54/i_want_to_hear_your_unethical_social_worker/",
    "created_at": "2025-05-16T16:34:48.000Z",
    "num_comments": 374
  },
  {
    "id": "reddit-1jey1ba",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "NASW Conference price has me shocked",
    "text": "I live in the Chicago suburbs and was excited to see the NASW National Conference will be held in Chicago. \n\nHowever, the prices to attend are OUTRAGEOUS. \n\nEarly bird pricing for NASW members is $499 and non members is $725. I understand this is for a 4 day event but that is insane.\n\nDisappointed I won't be able to afford to go as I don't make enough money AS A SOCIAL WORKER to attend my own career's event. \n\nAlso, no option to attend for just a single day 🤷‍♀️. ",
    "score": 320,
    "url": "https://reddit.com/r/socialwork/comments/1jey1ba/nasw_conference_price_has_me_shocked/",
    "created_at": "2025-03-19T14:17:45.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1nef0pn",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "My co-therapist/manager of my private practice is posting conservative views on her official social media account.",
    "text": "In the wake of the Charlie Kirk situation, my co-therapist at my private practice started posting openly conservative views on her official therapist social media account, which is attached to our official practice account. I was not aware of her views before this point, but now that I am, I am extremely conflicted about staying in this practice. I am not at all aligned with what she is posting and I do not want my name attached to it. I am afraid that my clients or future clients will see it and think it is what I represent, when in reality I practice from such an opposite lens and try to make that very clear in the work I do. I have worked so hard this year trying to build my career and establish a caseload at this practice, and I finally felt like I was getting somewhere, and now I feel like I have to leave and start fresh. I cannot start my own practice yet because I am not fully licensed, and it is really hard to find another job right now according to many of my friends. I feel so angry and betrayed and disgusted. I think I know what I have to do but it just sucks. Social work IS political and I don’t think I can be complicit in this just for the sake of making money. \n\nAny advice or suggestions would still be appreciated. ",
    "score": 301,
    "url": "https://reddit.com/r/socialwork/comments/1nef0pn/my_cotherapistmanager_of_my_private_practice_is/",
    "created_at": "2025-09-11T17:30:32.000Z",
    "num_comments": 235
  },
  {
    "id": "reddit-1j1325s",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Thank you for all YOU do!!!",
    "text": "I am not an official Social Worker but I do social work. I am thankful for the field and for many of you in this community who give me insight &amp; empowerment often. Celebrate your efforts, your career extra this month. ",
    "score": 289,
    "url": "https://reddit.com/r/socialwork/comments/1j1325s/thank_you_for_all_you_do/",
    "created_at": "2025-03-01T16:16:58.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1mo8h29",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Love being told my nearly years in clinical social work ‘don’t count’ because they weren’t in a beige office. (rant about non social work clinicians....sorry)",
    "text": "What *is* clinical social work?\n\nI recently interviewed for a position at a private practice. The interviewer (an LPC) asked me about my “lack of clinical experience.” This is the second time I've interviewed for one of these practices where a non-social worker has challenged the idea of 'clinical'. The last time it happened was with an MFT\n\nI’m a clinical social worker. My career has spanned residential treatment settings, a suicide hotline, hospitals, care management, and now in an academic consulting role where my position blends clinical and administrative responsibilities.\n\nSure, my current role isn’t traditional therapy, but my work has always been clinical in nature with assessment, intervention, crisis response, case planning, and direct client work in high-stakes situations.\n\nI’m honestly floored whenever this happens. It feels like it discounts an entire career’s worth of mental health and medical social work just because it doesn’t fit some narrow (and wildly inaccurate?) definition of “clinical” (i.e., 50-minute sessions in an outpatient office).\n\nI always try to explain how my experience *is* clinical, even if not in the form people are used to, but I still walk away feeling annoyed. In this case, I actually accepted the position and then ended up rescinding my acceptance because I kept getting bad vibes from the woman at the practice, lol.\n\nAlso adding that the she wanted me to use my personal cell phone as my business phone for clients to reach me!!\n\nHas anyone else had their background dismissed like this because it wasn’t traditional outpatient therapy? Is this just private practice culture? Or am I right to feel a little offended?",
    "score": 272,
    "url": "https://reddit.com/r/socialwork/comments/1mo8h29/love_being_told_my_nearly_years_in_clinical/",
    "created_at": "2025-08-12T13:16:58.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1knasnn",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Hospital SW",
    "text": "Started working at a top hospital in my state 7 months ago making $41 an hour which I think is great. Recently got notified that my hourly is going up to $46 an hour after 7 months!!!!! That's a $10K salary increase and almost a 6 figure salary. I truly wasn't expecting the raise and feel so happy &amp; a new motivation to continue the work I do. Just sharing as a \"proud for myself\" moment. There are industries that pay in this field!!!",
    "score": 257,
    "url": "https://reddit.com/r/socialwork/comments/1knasnn/hospital_sw/",
    "created_at": "2025-05-15T15:17:07.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1miy0mk",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Social workers as “team players” that end up in the closet office",
    "text": "A joke I heard early in my career- but it is no joke! Just something I have noticed throughout my time in my practicums under supervisors and my career in schools and hospitals. Seems that social workers are always expected to let people “borrow” their office for various needs here and there… but somehow eventually get reassigned to the “closet office”- which is sometimes is a legit closet with items still being stored in there lol.\n\nAnd if it’s not the closet office- it’s no office, surprise, you’re mobile! \n\nDespite the advocacy for the NEED a private, predictable, and designated space for our clients and us- it’s in one ear, out the other. Meanwhile, all the other “team” members still get to keep their work spaces. \n\nJust thoughts!\n",
    "score": 253,
    "url": "https://reddit.com/r/socialwork/comments/1miy0mk/social_workers_as_team_players_that_end_up_in_the/",
    "created_at": "2025-08-06T07:16:49.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1pd39hj",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Single social workers",
    "text": "I am a single social worker. Inflation is hurting me so bad right now. At beginning of year job got cut due to administration not believing in our grant. It truly was my favorite job ever. Everything is going up. I am looking at taking a second job to make ends meet. I feel depressed that my salary which once would be a comfortable living is not. I feel bad for complaining as so many have it worse. I do like the field but sometimes I regret getting my MSW and now having loans. I pictured my loans going differently with SAVE. I can’t afford to get my I right now as I don’t have the money for supervision. I’m struggling to find the passion amidst the chaos right now. \n\nPlease tell me this will get better. ",
    "score": 248,
    "url": "https://reddit.com/r/socialwork/comments/1pd39hj/single_social_workers/",
    "created_at": "2025-12-03T12:49:11.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1il6psk",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Career disappearing?",
    "text": "\nIs anyone else afraid that this career path is disappearing? As people get laid off, as DEI efforts become illegal, as helping the disenfranchised becomes \"unnecessary\" according to the governments direction, does anyone else fear agency work will be gone and  private practice won't be sustainable? ",
    "score": 240,
    "url": "https://reddit.com/r/socialwork/comments/1il6psk/career_disappearing/",
    "created_at": "2025-02-09T04:33:05.000Z",
    "num_comments": 175
  },
  {
    "id": "reddit-1o4uyhq",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Federal Career Dream.... 🚫",
    "text": "Having a federal SW job was a dream for me for the longest time. The security, benefits, and pay have typically been superior to private positions. Seeing the mass layoffs and instability brought up by the current administration is disheartening. Im sorry to anyone that has loss their job, at risk to loose it, or worrying about the possibility. ",
    "score": 236,
    "url": "https://reddit.com/r/socialwork/comments/1o4uyhq/federal_career_dream/",
    "created_at": "2025-10-12T17:22:08.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1kary1r",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I got fired. How do I move on from here?",
    "text": "I got fired yesterday for a mistake I made. I really did do it, there's no excuse for it, other than my pride trying to cover up a bigger mistake that I made. I'd rather not talk about the specifics, but rest assured that no one was hurt by my actions. \n\nI've been applying for jobs like mad, but with a pending LCSW my pickings are slim. I don't know how to talk about the firing if I were to get an interview, and I'm genuinely so ashamed of my actions that I don't know how to continue. My therapist, an LCSW himself, reassures me that people do a lot worse and not only keep their licenses but continue with thriving careers, but it's hard for me to see the light at the end of the tunnel. \n\nI also don't know if I'm getting reported to the board. During the conversation yesterday, it just sounded like my supervisor was really disappointed in me for what I chose to do, and didn't mention reporting me to the board. \n\nCan anyone share their experiences getting fired and overcoming it? Please no judgements, I'm already beating myself up enough for the both of us, I assure you. ",
    "score": 226,
    "url": "https://reddit.com/r/socialwork/comments/1kary1r/i_got_fired_how_do_i_move_on_from_here/",
    "created_at": "2025-04-29T16:17:50.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1l7i23e",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "LA Protests",
    "text": "I have been in the social work filed for over 20 years and have worked with children for all of that time. I have been to so many protests in the past and have been going to several recently. The Protests in LA have made me want to do more and be more involved, especially after seeing SEIU's president get arrested. The Code of Ethics is whispering to me to be present and stand against injustice. I need to be on the right side of history, but I don't want to lose my career. I cannot afford to not have a job and I have been at my job for 18 years. Any thoughts on what we, as social workers, can do to be more involved, but not lose our jobs? ",
    "score": 224,
    "url": "https://reddit.com/r/socialwork/comments/1l7i23e/la_protests/",
    "created_at": "2025-06-09T22:08:29.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1kzerem",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I passed the ASWB LCSW exam without paying for ANY study materials",
    "text": "I grew up lower economic status and have a minority identity as a trans individual. And I’ve been goddamn determined to not pay for anything that I don’t have to for my social work career— the ASWB tests themselves are already hundreds of dollars, I was DETERMINED not to pay for that $85 practice test or any practice materials. \n\nAs of this morning, May 30th, 2025, I’ve proven it’s possible! I passed the LCSW/Clinical ASWB exam on my first try. When I took the LMSW/Master’s ASWB exam, I didn’t pay for any study materials and passed it on the first try as well. \n\nFor both exams, I only studied for 2-3 weeks leading up to the exam. \n\nHere’s what I used:\n- ASWB Examination Guidebook (I found this oddly the most helpful thing I studied… https://www.aswb.org/exam/getting-ready-for-the-exam/aswb-examination-guidebook/)\n\n- Reddit! (That’s why I’m posting, I benefited from seeing what others focused on) \n\n- Pocket Prep (ONLY the free version, I did as many practices quizzes as they allowed for free and the daily question). \n\n- Agents of Change YouTube channel (I watched a few different YouTube channels/videos for studying, but I found the practice questions and process offered by this channel to be the most efficient and helpful!) \n\nAnyone else pass the test in 2025? :) Feel free share free resources you found helpful!",
    "score": 184,
    "url": "https://reddit.com/r/socialwork/comments/1kzerem/i_passed_the_aswb_lcsw_exam_without_paying_for/",
    "created_at": "2025-05-30T20:35:59.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1khc9na",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "A coworker pointed out \"you know the pay is bad when they take a whole week to celebrate you\" talking about nurse appreciation week. Makes sense they give us a whole month now.",
    "text": "The pay is in the emotional reward but man some of the salaries out there are low! \nI'm moving soon and was looking for jobs in the Social Work field, one listing required a PhD but the max pay for full time was $22 an hour... absolutely wild",
    "score": 178,
    "url": "https://reddit.com/r/socialwork/comments/1khc9na/a_coworker_pointed_out_you_know_the_pay_is_bad/",
    "created_at": "2025-05-07T23:49:55.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1kilgf8",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Empathy towards non-social worker partner’s work stress",
    "text": "Something I’ve been struggling with lately and would love to hear if anyone has advice/can relate is when my partner vents about having a hard day at work. For reference, he works in IT/systems management and has a remote/travel job. He works from home most of the time and then sometimes travels to various places to set stuff up. He makes 3x my salary. His days usually consist of sitting at his desk watching TV etc and sometimes he has to work on excel spreadsheets or planning out network stuff. \n\nOftentimes he vents to me about how he had such a hard day at work/he’s so stressed because he was working on stuff all day, had to go to multiple meetings etc and every time I have to hold my tongue and use my best social work skills to practice feeling empathy for him even though I find his complaints a little ridiculous. I’ll come home from working 11hrs after getting screamed at by a client and then witnessing a child disclose traumatic events and he tells me that his day was so rough because he had so many spreadsheets to work on- and I just want to scream.\n\nI know that I don’t understand his job very well and I’m sure that it IS stressful and difficult sometimes. And if I’m honest I’m definitely jealous and frustrated at how he earns so much more than me while doing so much less. So of course these factors play into how I’m feeling quite a bit, but I can’t quite get over the hump into feeling real empathy for the stress that he’s experiencing.. \n\nI’ll also note that he is definitely as supportive as he can be towards me when I’m having a rough day but oftentimes there’s not much I can share with him about why my day was so hard, or he just doesn’t totally get it, because he’s never experienced working in this field.\n\nHas anyone experienced this/have any advice on how I can reflect and better support him? \n\n",
    "score": 169,
    "url": "https://reddit.com/r/socialwork/comments/1kilgf8/empathy_towards_nonsocial_worker_partners_work/",
    "created_at": "2025-05-09T15:35:05.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1ir6dzm",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "U.S. Job Hunting Struggles",
    "text": "Hey y'all. Is anyone else in the US having a crazy difficult time getting hired, or even getting an interview? I've been applying for five months with an LMSW and some well-rounded experience and I'm getting absolutely nothing. I'm targeting minimum $60k salaries. I've never had this issue before and I'm concerned this will only get worse in the coming months and years as social services continue to be targeted. Any insight is appreciated.",
    "score": 151,
    "url": "https://reddit.com/r/socialwork/comments/1ir6dzm/us_job_hunting_struggles/",
    "created_at": "2025-02-16T23:56:20.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1njeu45",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Productivity requirements are killing my motivation.",
    "text": "What the title says. I need 5+ hours (65%) of billable time per day and I have hours of mandatory meetings every week. I've only been on the job a few months so have some time to get my numbers up, but I'm finding it extremely difficult (I'm landing in the 50-55% range). There are days when I'll have hours of appointments booked but because we're working with a vulnerable population, there are tons of last-minute cancellations and no-shows. When that happens, you essentially have to scramble to try to find clients who are available to meet that day regardless of whether they actually need your help or not, because YOU need the hours.\n\nI'm okay with being a hustler for my clients, but not for Medicaid. It sucks because I actually really enjoy my work, receive a good salary, and have a wonderful team. It makes sense that there are parameters in place for how often clients need to be seen, and I'm pretty used to that. But this productivity shit is the single most stressful thing about this job to me. \n\nPlease let me know if you have suggestions/tricks for improving in this area. Also feel free to validate my feelings and commiserate with me if you feel so inclined &lt;3 ",
    "score": 120,
    "url": "https://reddit.com/r/socialwork/comments/1njeu45/productivity_requirements_are_killing_my/",
    "created_at": "2025-09-17T14:34:39.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1hnwisi",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "What if your child wanted to become a social worker ?",
    "text": "My social workers. What would you tell your kid if they told you they wanted to become a social worker? &amp; would you do it all again, if given the chance? Your career choice that is. I’m a social worker who is 4 years post grad. Just curious peoples perspectives. Please state your role, years In social work, where you live, salary range and reason for entering social work. What’s the hardest thing you’ve learned in the field? ",
    "score": 119,
    "url": "https://reddit.com/r/socialwork/comments/1hnwisi/what_if_your_child_wanted_to_become_a_social/",
    "created_at": "2024-12-28T03:14:31.000Z",
    "num_comments": 137
  },
  {
    "id": "reddit-1pcvzpw",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "NASW lays off 14 State Directors and Advertises for a new $185,000 Position",
    "text": "NASW recently laid of 14 state chapter directors right before Thanksgiving holiday with two weeks notice citing financial constraints. On November 30th NASW posted a Deputy Chief Operating Officer for $185-195K position which is equal to three Chapter Director salaries.  NASW in their restructuring plan that has stunned Chapters across the nation has meant 23 Chapter Directors are managing multiple states and many states are left with no state based director. NASW's management decisions has brought outcries from NASW Chapter Boards across the country due to lack of transparency, no input gathered with members, Boards and Executive Directors before the proposed plan was implemented to lay of state directors and combine states into regions. A number of Chapter Boards have sent letters to NASW Board asking for a vote of no confidence for the current CEO. ",
    "score": 111,
    "url": "https://reddit.com/r/socialwork/comments/1pcvzpw/nasw_lays_off_14_state_directors_and_advertises/",
    "created_at": "2025-12-03T05:36:56.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1lxjzq4",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Burnout and a break",
    "text": "Has anyone taken a break from social work?\n\nI feel embarrassed but I quit my job this past week after feeling like it wasn’t for me. I was crying every week and felt so exhausted and I’ve gained so much weight and am constantly stressed and tired. I felt so good quitting, but I have no other social work job lined up. I’ve been applying to jobs left and right and my therapist has been encouraging me to look at my time off as an intentional rest period. \n\nI accept a part time job today in retail. It’s a company that I love but of course I feel so little and feel a bit embarrassed going to work in retail when I have a masters degree. \n\nI have the privilege to take a short break since I am married and me and my husband will survive a few months without a full time salary. But I feel so shameful that I’ve done this. I hated my job and needed to leave, so I know that was the right move.\n\nHas anyone else done something similar? ",
    "score": 93,
    "url": "https://reddit.com/r/socialwork/comments/1lxjzq4/burnout_and_a_break/",
    "created_at": "2025-07-11T22:13:01.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1o0mldj",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I’m an LMSW and make a case manager salary ($48-58k). How do I advance my career and income?",
    "text": "For some context, I’m 5 years post-grad, 3 years licensed. I went straight into the workforce after my undergraduate. I’ve worked in local mental health and nonprofit. Im just now gaining supervising experience by being a field instructor.   \n\nI see posts all the time encouraging social workers by showing it’s possible to make 6 figures, but no one is talking about the “how.” So, calling all social workers (specifically MSW or LMSW) making over $70k/year, I could really use the advice on the how! Feel free to answer any way you want, but the meat of this matter is HOW. School didn’t prepare me enough on how ti actually apply myself. Being a first-gen, with income progression only coming from internal promotions being my example, it’s extremely frustrating not understanding how my education, license, and experience don’t buy me some notoriety. Literally any tips are helpful because applying for jobs based on the qualifications just doesn’t get you too far anymore it seems. Here’s a few questions roaming my brain. \n\nWhat has your working experience been? Promotions every couple of years? Mentorship or Fellowship?\n\nHow impactful would you say networking has been on your career advancement?\n\nAre you private or public sector employee or employer? \n\nHow much extracurriculars do you participate in (i.e. city council meetings, volunteer work, etc.)? Do you feel that’s helped you in anyway? \n\nIf you have advanced in title over time, how much time did that take? Do you feel like it was right place right time or work ethic? \n\nWhat type of social work do you do? How did you know how to find jobs in that particular area? \n\nIf you’re making over $70k straight out of school with only internship experience and that is an above average starting salary, what do you do? And how do you think you were able to attain that? \n\nTL;DR HOW did you become a social worker making $70-100k+? Not just what you do, but how you got there. \n\nThank you!",
    "score": 79,
    "url": "https://reddit.com/r/socialwork/comments/1o0mldj/im_an_lmsw_and_make_a_case_manager_salary_4858k/",
    "created_at": "2025-10-07T18:15:24.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1j2o9lu",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Tone Policing",
    "text": "What are your experiences with supervisors mischaracterizing your complaints as aggressive, or unreasonable? I’ve seen a common theme in social work is seeing social workers, who are themselves excellent communicators, manipulate narratives when they feel they’re being scrutinized. This is typically done with a great deal of success. The irony is we have a building full of people avoiding accountability while preaching to their clients “have tough conversations, and don’t avoid accountability. After all, it’s just feedback.” \n\nWhat do you do if your concerns are constantly disregarded and you’re being villainized for whistleblowing? \n\nEDIT; wow I didn’t expect this resounding feedback. Thank you. Also, we should def keep our eye on this issue as each of us come into positions of leadership. Social workers are given an uncommon amount of influence for the meager salary they command, and the low barrier of entry (BSW/Case worker) means a lot of “bad actors” can enter our arena, bringing their biases and prejudices with them. Be strong, keep your whistle nearby, and keep blowing—cuz who gaf?! What can they do? Fire us? Where will we replace these incredible salaries and benefits? #StaySalty",
    "score": 76,
    "url": "https://reddit.com/r/socialwork/comments/1j2o9lu/tone_policing/",
    "created_at": "2025-03-03T17:35:17.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1kh3v5q",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "My supervisor said I’m only doing a part time case load with full time pay but still feeling unbearable",
    "text": "I felt really upset yesterday after my supervisor asked to speak with me about some mistakes in my case management. During the conversation, my manager pointed out that I’m essentially doing a part-time workload but getting full-time hours (40 hours a week for a $50k salary in Los Angeles as an FFA social worker). She implied that if I’m struggling with this level of work, things will only get harder—especially since others are managing over 10 cases along with therapy clients.\n\nI left that conversation feeling angry, discouraged, and deeply incapable. I genuinely hate being a social worker. The emotional weight of caring for these cases—many involving trauma—is draining me every day. It’s not just the tasks, it’s the emotional toll that makes it unbearable. I don’t feel hopeful about my future in this field anymore.\n\nI’m starting to seriously question whether I should stay in social work at all—or just leave.",
    "score": 73,
    "url": "https://reddit.com/r/socialwork/comments/1kh3v5q/my_supervisor_said_im_only_doing_a_part_time_case/",
    "created_at": "2025-05-07T17:55:03.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1oj5roo",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Telehealth therapy platforms and salary transparency",
    "text": "Hi everyone,\n\n\n\nI am hoping to start a thread for REAL salary transparency for telehealth therapists. Please comment with:\n\n1. Your platform (Alma, SonderMind, Grow, Talkspace, private practice with telehealth, etc.)\n2. Your state\n3. CPT code (90834, 90837, 90791, etc.)\n4. Your actual reimbursement rate per session\n5. Whether it's commercial or Medicaid\n\n\n\nWhy I'm asking:  \nA lot of us are trying to choose platforms, panels, and states to expand into... and the numbers are super opaque unless we talk to each other.\n\n\n\nI'll go first so we're not doing the \"DM me\" thing:\n\n\n\nLicensure:  \nI'm licensed in Colorado, Iowa, Massachusetts, New York, and Florida.\n\n\n\nPlatforms:  \nSonderMind + Alma (all telehealth).\n\n\n\nSonderMind (CPT 90837):\n\n* Colorado: \\~$92/session\n* Florida: \\~$97/session\n* Massachusetts: \\~$111/session (Iowa is consistently lower than these rates.)\n\n\n\nAlma (CPT 90837):  \nThis varies by insurance panel, but generally:\n\n* Colorado: about $97–$120/session\n* Massachusetts: about $105–$145/session\n* Florida / New York: about $105–$130/session (Iowa again tends to come in lower across the board.)\n\n\n\nWhat I'm specifically looking for:  \n➡ Medicaid reimbursement rates for telehealth therapy (especially 90837 and 90834) by state and platform. If you're willing to share what you're getting paid for Medicaid, PLEASE do. This information is almost impossible to find publicly.\n\n\n\nBonus points if you include:\n\n* Are you W2 or 1099?\n* Do you get no-shows paid?\n* Any weird clawbacks / recoupment issues?\n\n\n\nThank you all in advance. This is how we stop accepting \"that's just the rate\" without data.",
    "score": 70,
    "url": "https://reddit.com/r/socialwork/comments/1oj5roo/telehealth_therapy_platforms_and_salary/",
    "created_at": "2025-10-29T14:18:06.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1kbqw9z",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "How much PTO/vacation/holidays/sick time do you get?",
    "text": "I've seen a lot of threads about salaries but not a ton of info on PTO. My current job has a \"generous' PTO package of 7.7hrs per pay period. But we are required to take 10 holidays out of that pool and sick days. We also have to take 3 days of PTO before we can use ESL. \n\nI interviewed for other jobs that had a better package but I'm not sure if this is typical. Accounting for holidays and sick days, my package seems pretty standard and not very generous. What role do you have and what does your PTO package look like?\n\nEDIT: Currently laughing because I JUST had another manager here tell me how we have such a great PTO package. I wanna cry looking at the responses here. 😭",
    "score": 67,
    "url": "https://reddit.com/r/socialwork/comments/1kbqw9z/how_much_ptovacationholidayssick_time_do_you_get/",
    "created_at": "2025-04-30T20:44:48.000Z",
    "num_comments": 163
  },
  {
    "id": "reddit-1n6hvqs",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "New! Salary Megathread (Sept-Dec 2025)",
    "text": "This megathread is in response to the multitude of posts that we have on this topic. A new megathread on this topic will be reposted every 4 months.\n\nPlease remember to be respectful. This is not a place to complain or harass others. No harassing, racist, stigma-enforcing, or unrelated comments or posts. Discuss the topic, not the person - ad hominem attacks will likely get you banned.\n\nUse the report function to flag questionable comments so mods can review and deal with as appropriate rather than arguing with someone in the thread.\n\nTo help others get an accurate idea about pay, please be sure to include your state, if you are in a metro area, job role/title, years of experience, if you are a manager/lead, etc.\n\n**Some ideas on what are appropriate topics for this post:**\n\n* Strategies for contract negotiation\n* Specific salaries for your location and market\n* Advice for advocating for higher wages -- both on micro and macro levels\n* Venting about pay\n* Strategies to have the lifestyle you want on your current income\n* General advice, warnings, or reassurance to new grads or those interested in the field\n\n**Previous Threads:**\n\n**2021**\n\n[Jan-April 2021](https://www.reddit.com/r/socialwork/comments/koscqj/salary_megathread/); [Jun-Aug 2021](https://www.reddit.com/r/socialwork/comments/n3b05x/salary_megathread_may_aug_2021/); [Sept-Dec 2021](https://www.reddit.com/r/socialwork/comments/pua7t3/salary_megathread_sept_dec_2021/)\n\n**2022**\n\n[Jan-April 2022](https://www.reddit.com/r/socialwork/comments/s4cei8/salary_megathread_janapril_2022/); [May-Aug 2022](https://www.reddit.com/r/socialwork/comments/umnq7u/new_salary_megathread_may_aug_2022/); [Sept-Dec 2022](https://www.reddit.com/r/socialwork/comments/x372p7/new_salary_megathread_for_sept_dec_2022/)\n\n**2023**\n\n[Jan-April 2023](https://www.reddit.com/r/socialwork/comments/102cxis/new_salary_megathread_jan_april_2023/); [May-Aug 2023](https://www.reddit.com/r/socialwork/comments/135i3uu/new_salary_megathread_may_aug_2023/); [Sept-Dec 2023](https://www.reddit.com/r/socialwork/comments/16al63x/new_salary_megathread_sept_dec_2023/)\n\n**2024**\n\n[Jan-April 2024](https://www.reddit.com/r/socialwork/comments/18wpkjl/new_salary_megathread_jan_april_2024/); [May-Aug 2024](https://www.reddit.com/r/socialwork/comments/1cm9ril/new_salary_megathread_may_aug_2024/); [Sept-Dec 2024](https://www.reddit.com/r/socialwork/comments/1f7zgqo/new_salary_megathread_sept_dec_2024/)\n\n**2025**\n\n[Jan-April 2025](https://www.reddit.com/r/socialwork/comments/1hvqvnc/new_salary_megathread_jan_april_2025/); [May-Aug 2025](https://www.reddit.com/r/socialwork/comments/1kg44ts/new_salary_megathread_may_aug_2025/)\n\n***After the first week a link to this thread will be reposted until it's reset in 4 months.***",
    "score": 64,
    "url": "https://reddit.com/r/socialwork/comments/1n6hvqs/new_salary_megathread_septdec_2025/",
    "created_at": "2025-09-02T12:16:59.000Z",
    "num_comments": 298
  },
  {
    "id": "reddit-1p5xttm",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Salary in Private Practice",
    "text": "OK, so I always hear about how it is difficult to make above 100k in private practice. However, if you own your own practice, do you not make BANK?\n\nLike if you see 20 couples a week (I am interested in family therapy) a week at $200/session (considering that this is average in a HCOL area) and have 4 people who work within your practice, let's say charging $150/session. If the others working at your practice take home $75 of that $150, then revenue would be:\n\n($200\\*20)+($50\\*20\\*4)\n\n= $4000+$4000\n\n= $8,000/week\n\nNow, lets say that half goes to expenses of an office etc, etc.\n\nThen that's $4,000/week\n\n= $4000\\*4 \n\n= $16,000/month\n\n= $192,000/ year, if you work 12 months of the year\n\n  \nThe individuals in your practice would make:\n\n$100\\*20\n\n= 2000/week\n\n= $96000/ year\n\n\n\n",
    "score": 60,
    "url": "https://reddit.com/r/socialwork/comments/1p5xttm/salary_in_private_practice/",
    "created_at": "2025-11-25T00:14:07.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1hxlnnf",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Hospital social workers… ",
    "text": "For those of you in hospital social work, what kind of work do you do and do you actually enjoy it? Do you recommend it? What is your salary?\n\nI am in a clinical, 1:1 therapy role right now and looking to make a change in the future. I’m tired of the non profit world. \n\nMy speciality is in ID/DD, which I enjoy. However, I do not want to do long term therapy anymore. Would love to get involved in a more macro level. I like a fast paced environment. I like my job to be different everyday. I enjoy management, but I don’t have to be in it. \n\nIs there a specific social work job you would recommend for me? I’m currently only part time (SAHM) but would be looking to go into more full time in the future. What hospital job should I look into now?",
    "score": 57,
    "url": "https://reddit.com/r/socialwork/comments/1hxlnnf/hospital_social_workers/",
    "created_at": "2025-01-09T19:58:01.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1p0sdxt",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Struggling to find a job as an LMSW",
    "text": "Has anyone else dealt with challenges finding their first post grad position? I got my MSW this past spring and my LMSW in the summer. Ever since then I have been applying to jobs and going on interviews and I still have not been able to land a job. Admittedly I feel envious of my peers from my cohort, as almost all of the ones I keep in touch with have gone on to immediately get job offers (and for good salaries!). Even peers who were at the same internship placements and classes as me have gone on to get high paying jobs with (seemingly) no issue. I have clinical and macro internship experience, and an undergrad degree in psychology, but all of the recruiters and employers I have talked and interviewed with say my lack of professional experience is what’s holding me back. I understand that, which is why I am trying to get a job so I can start getting experience! At this point I’m wondering if I should stop trying to get a social work job and just try to get an entry level job as something like an activities aid or something in a helping role just to make some money while I’m continuing to search for a job. But it feels frustrating because I thought that now that I have my MSW and LMSW, I should be able to land an entry level social work job like my peers. I would love to start working and getting supervision time to eventually sit for my LCSW, which is another reason why I don’t want to give up on getting a social worker role. Is it truly just due to my lack of professional social work experience? ",
    "score": 48,
    "url": "https://reddit.com/r/socialwork/comments/1p0sdxt/struggling_to_find_a_job_as_an_lmsw/",
    "created_at": "2025-11-19T00:03:43.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1o0jdf1",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "What exactly is medical social work?",
    "text": "Hi all! I’m a 29F LCSW working as a mental health therapist at a nonprofit community agency. I’ve been here for 4 years now (first job out of grad school), and have been really interested in transitioning into medical social work. But I have so many questions! : \n\n1. What types of jobs are related to medical social work? \n2. Are they typically only/majority in hospitals? If so, What types of roles would the social worker have? \n3. If you’re currently a medical social worker, if you don’t mind me asking, How much do you make? Salary wise? (I’m currently at/capped at $63k.)  \n4. Would I still be able to keep the therapy component somehow? (Within the job) Or is there no clinical at all? \n5. Is a black woman. Is there a diversity component to the job at helps or negatively effects the hiring process? (Sorry if that was a weird question, but I do have to ask) \n\n\nAny insight would be heavily appreciated! ",
    "score": 39,
    "url": "https://reddit.com/r/socialwork/comments/1o0jdf1/what_exactly_is_medical_social_work/",
    "created_at": "2025-10-07T16:20:29.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1mfdtko",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "What can you do with a LCSW except therapy?",
    "text": "Currently work as a Skilled nursing facility social worker and going to take my test soon (LCSW). For those who don't do therapy what do you do? Do you like it? Years of experience? And mind sharing your salary? I think it would be a good open conversation to have. ",
    "score": 38,
    "url": "https://reddit.com/r/socialwork/comments/1mfdtko/what_can_you_do_with_a_lcsw_except_therapy/",
    "created_at": "2025-08-02T01:16:47.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1kg44ts",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "New! Salary Megathread (May - Aug 2025)",
    "text": "This megathread is in response to the multitude of posts that we have on this topic. A new megathread on this topic will be reposted every 4 months.\n\nPlease remember to be respectful. This is not a place to complain or harass others. No harassing, racist, stigma-enforcing, or unrelated comments or posts. Discuss the topic, not the person - ad hominem attacks will likely get you banned.\n\nUse the report function to flag questionable comments so mods can review and deal with as appropriate rather than arguing with someone in the thread.\n\nTo help others get an accurate idea about pay, please be sure to include your state, if you are in a metro area, job role/title, years of experience, if you are a manager/lead, etc.\n\n**Some ideas on what are appropriate topics for this post:**\n\n* Strategies for contract negotiation\n* Specific salaries for your location and market\n* Advice for advocating for higher wages -- both on micro and macro levels\n* Venting about pay\n* Strategies to have the lifestyle you want on your current income\n* General advice, warnings, or reassurance to new grads or those interested in the field\n\n**Previous Threads:**\n\n**2021**\n\n[Jan-April 2021](https://www.reddit.com/r/socialwork/comments/koscqj/salary_megathread/); [Jun-Aug 2021](https://www.reddit.com/r/socialwork/comments/n3b05x/salary_megathread_may_aug_2021/); [Sept-Dec 2021](https://www.reddit.com/r/socialwork/comments/pua7t3/salary_megathread_sept_dec_2021/)\n\n**2022**\n\n[Jan-April 2022](https://www.reddit.com/r/socialwork/comments/s4cei8/salary_megathread_janapril_2022/); [May-Aug 2022](https://www.reddit.com/r/socialwork/comments/umnq7u/new_salary_megathread_may_aug_2022/); [Sept-Dec 2022](https://www.reddit.com/r/socialwork/comments/x372p7/new_salary_megathread_for_sept_dec_2022/)\n\n**2023**\n\n[Jan-April 2023](https://www.reddit.com/r/socialwork/comments/102cxis/new_salary_megathread_jan_april_2023/); [May-Aug 2023](https://www.reddit.com/r/socialwork/comments/135i3uu/new_salary_megathread_may_aug_2023/); [Sept-Dec 2023](https://www.reddit.com/r/socialwork/comments/16al63x/new_salary_megathread_sept_dec_2023/)\n\n**2024**\n\n[Jan-April 2024](https://www.reddit.com/r/socialwork/comments/18wpkjl/new_salary_megathread_jan_april_2024/); [May-Aug 2024](https://www.reddit.com/r/socialwork/comments/1cm9ril/new_salary_megathread_may_aug_2024/); [Sept-Dec 2024](https://www.reddit.com/r/socialwork/comments/1f7zgqo/new_salary_megathread_sept_dec_2024/)\n\n**2025**\n\n[Jan-April 2025](https://www.reddit.com/r/socialwork/comments/1hvqvnc/new_salary_megathread_jan_april_2025/)",
    "score": 33,
    "url": "https://reddit.com/r/socialwork/comments/1kg44ts/new_salary_megathread_may_aug_2025/",
    "created_at": "2025-05-06T13:12:49.000Z",
    "num_comments": 133
  },
  {
    "id": "reddit-1hvqvnc",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "New! Salary Megathread (Jan - April 2025)",
    "text": "This megathread is in response to the multitude of posts that we have on this topic. A new megathread on this topic will be reposted every 4 months.\n\nPlease remember to be respectful. This is not a place to complain or harass others. No harassing, racist, stigma-enforcing, or unrelated comments or posts. Discuss the topic, not the person - ad hominem attacks will likely get you banned.\n\nUse the report function to flag questionable comments so mods can review and deal with as appropriate rather than arguing with someone in the thread.\n\nTo help others get an accurate idea about pay, please be sure to include your state, if you are in a metro area, job role/title, years of experience, if you are a manager/lead, etc.\n\n**Some ideas on what are appropriate topics for this post:**\n\n* Strategies for contract negotiation\n* Specific salaries for your location and market\n* Advice for advocating for higher wages -- both on micro and macro levels\n* Venting about pay\n* Strategies to have the lifestyle you want on your current income\n* General advice, warnings, or reassurance to new grads or those interested in the field\n\n**Previous Threads:**\n\n**2021**\n\n[Jan-April 2021](https://www.reddit.com/r/socialwork/comments/koscqj/salary_megathread/); [Jun-Aug 2021](https://www.reddit.com/r/socialwork/comments/n3b05x/salary_megathread_may_aug_2021/); [Sept-Dec 2021](https://www.reddit.com/r/socialwork/comments/pua7t3/salary_megathread_sept_dec_2021/)\n\n**2022**\n\n[Jan-April 2022](https://www.reddit.com/r/socialwork/comments/s4cei8/salary_megathread_janapril_2022/); [May-Aug 2022](https://www.reddit.com/r/socialwork/comments/umnq7u/new_salary_megathread_may_aug_2022/); [Sept-Dec 2022](https://www.reddit.com/r/socialwork/comments/x372p7/new_salary_megathread_for_sept_dec_2022/)\n\n**2023**\n\n[Jan-April 2023](https://www.reddit.com/r/socialwork/comments/102cxis/new_salary_megathread_jan_april_2023/); [May-Aug 2023](https://www.reddit.com/r/socialwork/comments/135i3uu/new_salary_megathread_may_aug_2023/); [Sept-Dec 2023](https://www.reddit.com/r/socialwork/comments/16al63x/new_salary_megathread_sept_dec_2023/)\n\n**2024**\n\n[Jan-April 2024](https://www.reddit.com/r/socialwork/comments/18wpkjl/new_salary_megathread_jan_april_2024/); [May-Aug 2024](https://www.reddit.com/r/socialwork/comments/1cm9ril/new_salary_megathread_may_aug_2024/); [Sept-Dec 2024](https://www.reddit.com/r/socialwork/comments/1f7zgqo/new_salary_megathread_sept_dec_2024/)",
    "score": 28,
    "url": "https://reddit.com/r/socialwork/comments/1hvqvnc/new_salary_megathread_jan_april_2025/",
    "created_at": "2025-01-07T12:59:24.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1mzzbub",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Care management salary HELP",
    "text": "Hi everyone,\nI was recently offered a care management role in Atlanta at $60/hour. I have a background as a licensed social worker with over a decade of experience in home health and hospice. I shared a range during my interview without asking theirs first, and they immediately confirmed the top of my range — which now has me second-guessing whether I undersold myself.\n\nBefore I go into final negotiations, I’d love to get a sense of what others in Atlanta (or the Southeast) are making in similar roles, would you be willing to share your hourly rate or salary range?\n\nPer my conversations this is a part time position with maybe three clients on a caseload. This is CARE management for the elderly (going to doctors appointments, communicating with nursing home staff, assisting with nursing home transfers)\n",
    "score": 27,
    "url": "https://reddit.com/r/socialwork/comments/1mzzbub/care_management_salary_help/",
    "created_at": "2025-08-25T18:58:54.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1pdr4ta",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "Offered job at internship, should I delay MSW?",
    "text": "I’ve been at this amazing remote case management internship for my BSW. \nI’ve helped develop a new role as a substance use case manager. It’s been super manageable as I live with a mental illness. \n\nThey offered me a full time role when I graduate in August. I’m so lost bc I planned on doing the advanced standing MSW right when I graduate just to get it over with, and eventually be a therapist. \nBut I’m on Medicaid and disability and so broke. The thought of having a salary and good insurance is nice. \n\nBut then again I’d be making 45k and a case manager. What should I do? Take the job or get my MSW?",
    "score": 27,
    "url": "https://reddit.com/r/socialwork/comments/1pdr4ta/offered_job_at_internship_should_i_delay_msw/",
    "created_at": "2025-12-04T04:54:27.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1lklzqz",
    "subreddit": "socialwork",
    "soc_codes": [
      "21-1021",
      "21-1022",
      "21-1029"
    ],
    "title": "I was offered a job with no interview. Is this normal or should I be cautious?",
    "text": "Hi everyone I graduated with my MSW in mid May. It’s been rough looking for a job and I have had plenty of rejections. \n\nBut just a few hours ago I got a call from a hospice agency I applied to. The director of nursing basically gave me the run down of the position and what a typical day would look like. After we talked, she told me should would forward my resume to HR and to expect a call from them in the next few days to discuss salary, etc. \n\nI’m pretty happy because hospice is my dream social work job. But she was transparent and told me the agency is in a rough spot right now and she’s looking to hire more MSWs. She assured me I won’t be thrown into the job and will receive adequate training from a social worker. \n\nI’m having a lot of emotions. I’m excited, but also overwhelmed. I took the call right before going into a movie so I don’t think I asked her all the questions I meant to ask. I also didn’t retain much of what she told me because it was soooo much info thrown at me. \n\nIs it normal to be offered a job like this with no formal interview? \n\nThanks! \n\n\nEDIT: I took the job. I got a formal offer today. I’m a little nervous. I will be the only social worker for the agency. BUT the census for the whole agency is 40 and some patients deny social worker services. I made sure to ask that I would receive training and they assured me. We shall see how it goes. I will view it as a stepping stone job if it turns out to be a dumpster fire. ",
    "score": 27,
    "url": "https://reddit.com/r/socialwork/comments/1lklzqz/i_was_offered_a_job_with_no_interview_is_this/",
    "created_at": "2025-06-26T00:16:27.000Z",
    "num_comments": 36
  }
]