[
  {
    "id": "reddit-1i1z8pe",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "The public response to these California fires has completely changed my understanding of hydraulics. ",
    "text": "In my naivety, I had previously understood pressure losses in a pipe network to be a function of flow, pipe diameter, pipe roughness, etc. \n\nTurns out, the amount of pressure losses in a pipe network is actually a function of the gender/sexuality of the people who pull water from the pipe network, the political party of the governor of the state in which the pipe network resides, and the “wokeness” of the communities served by the pipe network. \n",
    "score": 3456,
    "url": "https://reddit.com/r/civilengineering/comments/1i1z8pe/the_public_response_to_these_california_fires_has/",
    "created_at": "2025-01-15T15:00:01.000Z",
    "num_comments": 232
  },
  {
    "id": "reddit-1jifi9e",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "We’re pretty much closing the gap with fast food workers",
    "text": "LCOL location in California. We are closer to fast food workers than we are to software engineers, nurses etc. ",
    "score": 1309,
    "url": "https://reddit.com/r/civilengineering/comments/1jifi9e/were_pretty_much_closing_the_gap_with_fast_food/",
    "created_at": "2025-03-24T01:33:41.000Z",
    "num_comments": 293
  },
  {
    "id": "reddit-1l0bjg9",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Worst case of overkill design you've come across? (or were responsible for)",
    "text": "Recently I've come across this monstrosity on a new social housing project where we're doing the sewer and roadworks.\n\nThe entire thing was designed with pavers on a 200mm lean concrete base on top of a 250mm recycled aggregate sub base, already overkill but then came this work of art.\n\nIn order to \"protect\" the existing Oak, instead of pavers they wanted a monolithic reinforced concrete slab to minimize ground pressure. Specs called for a 180mm slab with 2 layers or 16mm rebar \"nets\" with 100mm spacing. (in freedom units: 7in slab, 5/8in rebar 4in spacing)\n\nI had already seen some silly specs and overkill design in my public works career but this one took it to a whole new lever.\n\nWhat's the worst case of overkill you've come across or have been responsible for designing.",
    "score": 791,
    "url": "https://reddit.com/r/civilengineering/comments/1l0bjg9/worst_case_of_overkill_design_youve_come_across/",
    "created_at": "2025-06-01T00:09:50.000Z",
    "num_comments": 147
  },
  {
    "id": "reddit-1jm4n83",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "A Trip Through the Career of a Civil Engineer",
    "text": "These are my observations from working in this industry over 20 years.\n\n1. You graduate school, you survived the gauntlet thrown at you and the world is your oyster.  You know nothing can ever be that difficult again.\n2. Day 1, you quickly realize you learned nothing in school that has prepared you for what you are expected to do.  You have no clue what you are doing, and you feel like a lost puppy dog.\n3. After about 2-3 years stumbling along not trying to look like a deer in headlights, you learn how to do a few things.   You think you are finally turning the corner and getting the hang of engineering.\n4. Years 5 -7, you passed your PE, standard designs are simple.  You think you know everything and nothing can stump you.\n5. Around year 8 or 9, you start running into issues that you were insulated from by senior engineers and project managers.  You quickly realize you know nothing again, you feel like you are back at Day 1.\n6. Year 15, young engineers are looking to you to be the mentor and the senior level engineer that can fix anything.  However, you come to the realization with every project that goes through construction, you know even less than you thought you did the year before.\n7. Years 25+, You are now the gray-haired (or bald) master, everyone comes to you for the answers on the most difficult projects.  The only problem is now you have started forgetting what little you thought you knew because you are getting older, and your memory is just not there anymore.",
    "score": 749,
    "url": "https://reddit.com/r/civilengineering/comments/1jm4n83/a_trip_through_the_career_of_a_civil_engineer/",
    "created_at": "2025-03-28T20:22:29.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1k7zh4g",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Salary Progression",
    "text": "Posting my salary because I constantly hear of other engineers complaining on this thread. I’m a PE in Southern California and I’ve only been with one employer.  \n\nEveryone please evaluate the market value for your position at least every 2 years and push your supervisor/manager for a raise. Too many of us are underpaid because we simply take what we are given. If we want to see pay raises across our field we have to advocate for ourselves and push for raises. ",
    "score": 613,
    "url": "https://reddit.com/r/civilengineering/comments/1k7zh4g/salary_progression/",
    "created_at": "2025-04-25T23:50:56.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1o8iej5",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Civil engineers are underpaid for the pressure we deal with",
    "text": "Honestly, I don’t think people outside civil engineering realize how demanding and difficult our work really is. We use physics, geometry, and 3D modeling daily. We design real things that people drive, walk, and live on.\n\nMeanwhile, you’ve got folks in consulting or finance making double our salaries by moving numbers around on spreadsheets and PowerPoints. I get it, they move money, we move dirt, but still.\n\nWe deal with construction, field issues, design constraints, and deadlines that make your brain melt. And if we mess up, it’s not just money that’s lost, it could cost lives if you do a design error. That kind of pressure, for the paychecks most engineers get, feels insane sometimes.\n\nAnyone else ever feel like the value of what we do doesn’t quite match what we earn?",
    "score": 604,
    "url": "https://reddit.com/r/civilengineering/comments/1o8iej5/civil_engineers_are_underpaid_for_the_pressure_we/",
    "created_at": "2025-10-16T21:10:50.000Z",
    "num_comments": 276
  },
  {
    "id": "reddit-1idtfre",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "What Makes a Great Civil Engineering Recruiter? (Final Interview Tomorrow!)",
    "text": "Hey everyone,\n\nI’ve got my final interview tomorrow for a role in civil engineering recruitment, and I want to make sure I do it right. I know that recruiters can make or break the job search experience, so I’d love to hear from you:\n\nWhat are the best experiences you’ve had with recruiters? What made them stand out?\n\nWhat are the worst experiences you’ve had? What should I absolutely avoid?\n\nIf you could design the ideal recruiter for civil engineers, what would they do differently?\n\n\nYour insights could genuinely help me start this career on the right foot and make a real impact for engineers like you. Looking forward to hearing your thoughts—thanks in advance!",
    "score": 502,
    "url": "https://reddit.com/r/civilengineering/comments/1idtfre/what_makes_a_great_civil_engineering_recruiter/",
    "created_at": "2025-01-30T18:15:25.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1o35p62",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "The Importance of Salary Transparency",
    "text": "The other day I was talking to a senior project manager at my consulting firm. I have about 6 years of experience and am about to get my PE. I was telling him that I was planning to negotiate for a 100k base salary, based on data from this sub, salary transparency websites, and other coworkers who are similar to me career-wise. \n\nHe tells me that he doesn't even make 100k. I was shocked. He is a licensed PE in at least two states, has *40 years* of experience, and has much more responsibility than I do. \n\nIf you don't know your worth, it's very easy to get taken advantage of, especially when you have the old-school mindset of \"it's unprofessional to talk about salary.\" Your boss will not reward you with appropriate raises unless you advocate for yourself and/or are not afraid to jump ship. ",
    "score": 493,
    "url": "https://reddit.com/r/civilengineering/comments/1o35p62/the_importance_of_salary_transparency/",
    "created_at": "2025-10-10T16:28:55.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1lb1jvf",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Anyone else feel really bad for the Comp. Sci. Folks",
    "text": "The last few career fairs I went to a lot of sad \"data analysist\", computer science majors came to our booth asking for jobs. I told them they could apply for a PM position but we're not looking for them in engineering roles \n\nWhile I understand they were told they'd get a high paying job out of college I'm not sure why they see civil as a back up \n\nEdit: PMs at my company are essentially P6 inputters and accountants, project engineers run the projects and need PEs\n\nEdit 2: these are kids who were lied to",
    "score": 395,
    "url": "https://reddit.com/r/civilengineering/comments/1lb1jvf/anyone_else_feel_really_bad_for_the_comp_sci_folks/",
    "created_at": "2025-06-14T06:01:24.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1m6155e",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "US Fish and Wildlife is Rejecting Renewable Projects formally via their website",
    "text": "First in my career. My wife is in the energy sector with no affiliation. She’s sent me this. She’s been in oil and gas since back in 2010 and renewables since 2019. This is the first I’ve seen a federal regulatory agency take this route. They had a project straight rejected bc it was solar and nothing to do with endangered species. I’m sure there will be lawsuits and back and forth but this is immediate loss of energy jobs. Developers can’t proceed. \n",
    "score": 391,
    "url": "https://reddit.com/r/civilengineering/comments/1m6155e/us_fish_and_wildlife_is_rejecting_renewable/",
    "created_at": "2025-07-22T01:30:46.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1lijiqf",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "What even is the point of Salaried positions these days?",
    "text": "I mean I’m pretty much expected to hit 40 hours every week with my 8-5 schedule. If I have to take a half day or some time off, I’m expected to use PTO. Emergency time off is just that, an emergency and probably happens once a year if that. \n\nBut as far as working over 40 hours? It’s pretty much a guarantee most weeks, even if it’s only one or two hours. So it just seems to me salary IS NOT a benefit to employees but mainly to employers. It almost seems like an excuse to not pay you over 40 hours of work. Just curious if others feel the same  \n\n",
    "score": 326,
    "url": "https://reddit.com/r/civilengineering/comments/1lijiqf/what_even_is_the_point_of_salaried_positions/",
    "created_at": "2025-06-23T15:26:03.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1o3gb6j",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "The CYA approach to everything in design consulting is killing me.",
    "text": "I’m ten years into this career. Been a PE for five. Specializing in water and sewer infrastructure. I’ve worked my ass off to develop solid judgment and technical skills. But lately it feels like the more competent I get the less I’m actually *allowed* to use my brain.\n\nEvery time I hand off a draft of drawings and specs to the lead engineer at my company, the markups come back looking like a crime scene. Every comment reads like it’s written by a man haunted by ghosts of hypothetical lawsuits. The dude will cross-examine me over any random field condition that *no one* could possibly know at that stage of design.  \n\nThis profession is so obsessed with not getting sued that it’s completely strangles progress.  I get that liability is part of the gig, but holy hell. I thought I was going to work in a culture of \"Let's design something that works\", but instead it's \"Cover your ass at all costs\". \n\n",
    "score": 313,
    "url": "https://reddit.com/r/civilengineering/comments/1o3gb6j/the_cya_approach_to_everything_in_design/",
    "created_at": "2025-10-10T23:23:40.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1o7lpxc",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Well, it's official. Being a firefighter now pays better than being a Civil Engineer in my city",
    "text": "My city is in the midst of union contract negotiations (never mind the contracts expired March 31st).  We are a major city and have a large in-house capital team at city hall, and we have an even larger regional water department that has runs for 100mgd+ plants with over 5,000 miles of water main.  We have many in-house engineers.  \n\nKeep in mind the city has given out raises of 0%-3% only the 2 decades I have been there (3% only coming after a 0% year).\n\nPolice was struggling to recruit and retain, so they got 14% raises a few years ago, and 11%+3% this year.  All and all, 30%\n\nFire was struggling to recruit, albeit less so than police, and they raised their salary just over 15% (12%+3%), which pretty well catches up with 2020 pay with respect to inflation.  \n\nWell, the rest us us (non union) just got our raises.  We get  ...  just the 3%.  And heck, we don't even get back pay to April when we normally got raises.  \n\nLooking at the pay rates, a first year firefighter now makes over $77,000 a year. We have several engineers that have worked a few years now that only make $72k.  $5,000 more to a first year firefighter (who also gets better pension system).  And of ton of them spend 1/3rd their shift sleeping (it is a 24-hr shift), and they get to trade shifts so as to get 3-5 days off in a row.  Many have side hustles in their long time off.  \n\nAnd we are also horribly understaffed.  Over a dozen left since the pandemic.  The city is now hiring consultants like crazy (with billable rates 4-5 times what we are paid) to make up.  City Hall does not care.  Our council and mayor are all up for election and happily cash donation checks from consultants looking for more city business.  \n\nIt sucks working for a city.  Good news is I have my first interview for a different job (with a 30% raise at least) Monday.  Applying more places, too.",
    "score": 296,
    "url": "https://reddit.com/r/civilengineering/comments/1o7lpxc/well_its_official_being_a_firefighter_now_pays/",
    "created_at": "2025-10-15T20:09:18.000Z",
    "num_comments": 309
  },
  {
    "id": "reddit-1ittjlr",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "2024 Civil Engineering Survey Report",
    "text": "I know I'm late this year, but here's my 2024 report based on the annual survey. This year there were 1,679 responses after data cleaning. Compensation was adjusted for location at the county level based on the Economic Policy Institute's cost of living [dataset](https://www.epi.org/resources/budget/budget-map/).\n\nhttps://preview.redd.it/2pinnoar28ke1.png?width=3185&amp;format=png&amp;auto=webp&amp;s=d990361b450d8ca76cdb76b9411c6541efc4cb05\n\n# Key Findings\n\n1. Compensation \n\n* analyzed using a linear model with 20 predictors from survey\n\nTotal Compensation = 65,000 +3200\\*Experience +11,000\\*PE \n\n* ± 23,000 for 80% confidence interval\n* *R**^(2)* = 0.67\n* Only 3 factors out of the 20 investigated were found to have statistically significant correlations with total compensation:\n   * Experience\n   * PE\n   * Structural/Geotech\n* Sub-discipline breakdowns are mostly useless\n* Structural and geotech correlated with decreased total compensation relative to the reference class, transportation\n* Every 2 months reported salaries increase by around 1,000. This was controlled for in the model and can be used to predict salaries into 2025. Add 1,000 to the predicted value for every 2 months since January\n* see table at end for full model results\n\n2. Job satisfaction\n\n* Analyzed using same approach with a linear model \n* Only compensation had a statistically significant correlation with job satisfaction, while overtime and structural were negatively correlated with job satisfaction\n* Much harder to predict than compensation\n\n3. Remote work\n\n* Fully remote work has roughly halved since 2021 and is declining\n* Fully in person jobs have remained steady between 25-30%\n* Increase in part time remote, except 4 days/week\n\nhttps://preview.redd.it/rrl4fcdu49ke1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=9b6742c9213d125d77a8ad73874d1af7d04bfeb1\n\nhttps://preview.redd.it/9lh69jur28ke1.png?width=3490&amp;format=png&amp;auto=webp&amp;s=39169f55fa25dbb4f547a13dcc30a07eff338b6b\n\n* In 2024, the median starting salary jumped above the median 1 YOE salary!\n\nhttps://preview.redd.it/t49xipny09ke1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=5ce93bca04333d717f30c7b2bfecb5efe0014406\n\nhttps://preview.redd.it/6jmqnp0219ke1.png?width=1000&amp;format=png&amp;auto=webp&amp;s=69ee4280f32e0825fe0369b84c3682fc361a708d\n\n* It'd be interesting to know how many jobs respondents have had since graduation but that wasn't on the survey\n* For those with less than 10 years of experience:\n   * Around 1/4 work for the same company their first 10 years\n   * Around 1/4 have only worked at their present company 1-2 years\n   * Median is around 3 years\n* That should give some insight into job hopping\n\n\n\nhttps://preview.redd.it/jb2z5ijtw8ke1.png?width=2000&amp;format=png&amp;auto=webp&amp;s=03f1efb1758e7a65dda69011f74dd889a34dff7f\n\n# Total Compensation Linear Model\n\n|\\-|Coef.|Std.Err.|z|P&gt;|z||\\[0.025|0.975\\]|\n|:-|:-|:-|:-|:-|:-|:-|\n|const|59286.00|3159.26|18.77|0.00|53093.90|65478.00|\n|Experience|3189.50|143.24|22.27|0.00|2908.75|3470.25|\n|HS|\\-3661.40|5627.06|\\-0.65|0.52|\\-14690.20|7367.43|\n|Masters|537.31|1131.18|0.48|0.63|\\-1679.76|2754.39|\n|PhD|7500.00|4759.29|1.58|0.12|\\-1828.04|16828.00|\n|EIT|\\-181.07|1529.28|\\-0.12|0.91|\\-3178.40|2816.27|\n|PE|11131.60|1830.01|6.08|0.00|7544.87|14718.40|\n|Bridges|1575.90|2209.89|0.71|0.48|\\-2755.40|5907.20|\n|Environmental|\\-2027.40|2809.30|\\-0.72|0.47|\\-7533.52|3478.72|\n|Construction/Field|2078.22|2022.39|1.03|0.30|\\-1885.59|6042.04|\n|Geotechnical|\\-4807.50|2174.51|\\-2.21|0.03|\\-9069.46|\\-545.53|\n|Government/Municipal|1135.28|1975.56|0.57|0.57|\\-2736.76|5007.31|\n|Power/Electrical|5324.88|3103.94|1.72|0.09|\\-758.72|11408.50|\n|Structural|\\-3540.17|1468.65|\\-2.41|0.02|\\-6418.67|\\-661.67|\n|Land Development|1550.45|1342.37|1.16|0.25|\\-1080.54|4181.45|\n|Water Resources|1100.00|1450.62|0.76|0.45|\\-1743.16|3943.16|\n|Male|736.81|2642.74|0.28|0.78|\\-4442.86|5916.49|\n|Female|\\-1772.89|2835.07|\\-0.63|0.53|\\-7329.52|3783.75|\n|day|16.91|4.67|3.62|0.00|7.77|26.06|\n|OT hours|767.95|115.15|6.67|0.00|542.27|993.64|",
    "score": 289,
    "url": "https://reddit.com/r/civilengineering/comments/1ittjlr/2024_civil_engineering_survey_report/",
    "created_at": "2025-02-20T08:08:55.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1ltskwu",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Salary Progression 26M Civil/Structural Engineer",
    "text": "Hey guys! Working for the same company that hired me after graduation! I am grateful to them for taking a chance on me during covid when it was hard to find a job, but I feel a little underpaid… what do you all think? PTO is great; benefits are average. I also have my PE License.",
    "score": 249,
    "url": "https://reddit.com/r/civilengineering/comments/1ltskwu/salary_progression_26m_civilstructural_engineer/",
    "created_at": "2025-07-07T12:14:34.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1mcurqx",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Got an offer &amp; the world is a little less doom",
    "text": "Hey guys,   \n  \nI have been posting for advice and guidance in this subreddit. I have gotten many thoughtful replies.  I just wanted to be able to share some good news here and show some appreciation for this community. \n\nI was really starting to feel hopeless, and I can't lie I spent too much of my time doom scrolling this site about how the economy is collapsing. I know; it's not helpful, but it's like an itch I had to scratch. It's been months of applying and I have had several interviews. \n\nBut this was finally the one! I had the interview yesterday and they said they would get back with me by end of week. I got the email today. They made me an offer over what I had asked for and they even offered to help with moving costs that will be forgiven if I stay with them for a period of time. I'll get healthcare (thank fuck, I've been uninsured since the beginning of the year), three weeks vacation, and 3% matched IRA. \n\nMaybe the job isn't in my ideal field. It might not have the best pay or the best benefits out there, but this is LIFE CHANGING for me. I grew up in poverty and have only had shitty retail jobs to put me through university while I was a caregiver to my grandparents; I've been barely making it by for so long. Neither of my parents even graduated high school.  It doesn't even feel completely real yet. \n\nI cannot wait to begin work with the team. I know it will be hard work, and I have a lot to learn. But I am genuinely excited to be here at this milestone. I met with the two engineers, and they seem like very sweet people who are eager to teach. \n\n**TL;DR - I got an offer! This queer is escaping the South to start their career. Thanks you r/civilengineering** **for the support.** \n\n**Update:** It's like word I got out that I received an offer because the next day I get an email for a government position saying they're advancing my application to the next stage. The timing though 🤣",
    "score": 240,
    "url": "https://reddit.com/r/civilengineering/comments/1mcurqx/got_an_offer_the_world_is_a_little_less_doom/",
    "created_at": "2025-07-30T02:24:28.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1ifzfr0",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Billing rates have gone bonkers over the past 3 years (but fees and compensation have not)",
    "text": "Just curious what everyone else is seeing for billing rates changing over the course of the last 3-4 years.\n\nI joined my current firm in land development as a PM a little over 3 years ago.  In that time, hourly billing rates have gone up over 30%.  The fees that we are commanding on projects, however, have not gone up 30%, which puts the screws to the PMs, having to do the same or more work with effectively shrinking budgets.\n\n  \nAlso, salaries have barely increased by 30%, so the shareholders are essentially pocketing money by squeezing PMs just a little harder every year, but that's a discussion for another thread.",
    "score": 239,
    "url": "https://reddit.com/r/civilengineering/comments/1ifzfr0/billing_rates_have_gone_bonkers_over_the_past_3/",
    "created_at": "2025-02-02T15:19:51.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1jz3jgw",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "An Ode to Recruiters",
    "text": "I fucking hate lazy-ass recruiters. They're freaking everwhere, like ants at a picnic. And dealing with them is like talking to the dumbest storm-chasing contractor, door-to-door vacuum salesman, or time-share pitchman. Case in point, a typical exchange with LVI/GPAC/miscellaneous offshore recruiters:\n\nNo, I am not interested in a new opportunity or relocating at this time.\n\nNo, I am not interested in what you \"can do\" for me.\n\nNo, you called me, I'm not providing you with my resume or any additional information until you tell me the company, title, and salary range of the specific position you are recruiting for.\n\nYes, I have heard of ABC Company and was already aware that they are hiring. \n\nNo, software engineering is not the same as civil engineering.\n\nYes, I do currently make that much money. I fucking earned it by getting educated, passing multiple exams, becoming certified, working in the field for 20+ years, and being held to ethics standards. \n\nNo, I'm not going to consider taking less \"to be part of this exciting opportunity.\" After all and as you said, as the Executive Vice President of Client Management and Global Thought Bro on Infrastructure at the prodigal age of 18 years old, you \"have the pulse of the engineering industry and trends.\" You should fucking understand your client underpays and overworks their staff, hence the high turnover. Furthermore, you should also understand that I already had this conversation several times with your colleagues, but I understand with a commission-based model, everyone is going to horde their \"accounts.\" Even so, riddle me this, why would I agree to gifting you a portion of my salary for your \"relationship\" with ABC Company when you were the last one to call me about this \"exciting opportunity\" of which I was already aware? \n\nAnd yeah no, I will not do your job for you and tell you \"who else in my network might be interested in this position.\"\n\nSeriously dude, recruiting seems too hard for you, maybe you should go back to selling Cutco knives?",
    "score": 231,
    "url": "https://reddit.com/r/civilengineering/comments/1jz3jgw/an_ode_to_recruiters/",
    "created_at": "2025-04-14T16:44:40.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1nr1wun",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Ashamed of the Engineering Profession",
    "text": "As a bit of background since I feel it probably will help understand my profession, I am a RPE in multiple states in the US and spent the first 25 years of my career in private industry. I've held numerous positions in both Engineering &amp; Operations on the private side including Engineering Manager and VP of Technical Services. These roles have resulted in my being the EOR for many sites and projects during that time. Within the last year, I have joined a firm that serves public clients including many in the water and wastewater sectors.\n\nNow that that's out of the way, I just want to vent about how fall I feel the standard for engineering has fallen. I'm constantly looking at plans for public works projects and rarely do I come across anything that is actually quality work. Plans are horrible for a myriad reasons ranging from they were done in color and then printed in B/W so the legend is no longer discernable, 5 mile long pipelines with zero borings, hydrology or any semblance of geotech being performed, absurd line item breakouts for bidding and most annoying, 1,000 pages of EJCDC bullshit of which 975 pages don't even apply to the job at hand. \n\nWhat happened to simply providing a basic table of parts? Is it too much to ask that a short narrative be written to describe the job and end goal of the project? Nope, can't do that. I'm going to put the parts on a plan in 0.5 font and further obscure them with overlapping text and profile lines. As for what the project entails, we're just going to give you the plans and have you deduce what needs done. As for an engineered estimate, I've got one but I'm not going to tell you what it is even though it's public record. I'll make you FOIA the estimate which you won't receive until 6 months after the bid is due. \n\nRant over. ",
    "score": 219,
    "url": "https://reddit.com/r/civilengineering/comments/1nr1wun/ashamed_of_the_engineering_profession/",
    "created_at": "2025-09-26T13:51:35.000Z",
    "num_comments": 220
  },
  {
    "id": "reddit-1jp0gse",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "UPDATE: entry level listing for my same position has a higher minimum salary than mine",
    "text": "\nI posed about this about a month ago, and here is the update. (Link to original post: https://www.reddit.com/r/civilengineering/s/UokLbiECJU )\n\nI originally posted about realizing that I was getting paid $4,000 less per year than the starting salary advertised for my same position, after I had accumulated 2 years of experience. I promptly asked for a $14k raise only a day after posting, which would have put me what I thought to be a reasonable amount above the listed starting salary. My manager informed me that he has already put in a recommendation for a 9k raise, and I accepted that. He also told me that the listing was incorrect, and that the minimum salary should have been lower, which I can’t say I fully believe but I was willing to let it go.\n\nSkip to today, and I have found out only $4.5k of a raise was approved. At about 6% of a raise, this is a basically just an adjustment for inflation. It’s also only $500 more than what was listed as the starting salary. This was just posted, I didn’t get notified of it and I’m wondering if my manager is intending to let me know. \n\nRegardless, I’m feeling extremely betrayed and undervalued. I just want to get paid what I feel like I’m worth, and I know I’m a critical component of my department right now. I love my job and coworkers, I don’t want to leave. Despite this, I guess it’s time to go looking for offers.  They have shown me what I mean to them. \n\nThank you all for your advice on my original post as well. \n\n*Edited bc i had the percentage wrong",
    "score": 217,
    "url": "https://reddit.com/r/civilengineering/comments/1jp0gse/update_entry_level_listing_for_my_same_position/",
    "created_at": "2025-04-01T16:50:48.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1lp6mg5",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "I may be permanently burnt out and I dont know what to do anymore - what else is there?",
    "text": "I am 12 years into my career. Ive worked in transportation, civil site, energy, have a PE and I feel...defeated. I dont even work as much as I used to or as much as some of the poor mfs do at places like Kimley or Terracon but I just feel like giving up. I make stupid good money for my field too. I just...cant anymore.\n\nMy question for you, what else can a civil engineer do? I have pedigree with several good firms on my resume and my PE and all that but I dont know what else Id enjoy. I miss and loved roadway but...also hated the budgets and timelines and stress. The last 7 years have been a blur of hating my job, moving on, becoming apathetic, hating my job, and moving on just to have the cycle repeat. I need to break it. Stop it all. Feel like doing my job again.\n\nEdit: I feel like a loser admitting it but my apathy and burn out is showing in performance now...",
    "score": 191,
    "url": "https://reddit.com/r/civilengineering/comments/1lp6mg5/i_may_be_permanently_burnt_out_and_i_dont_know/",
    "created_at": "2025-07-01T16:44:12.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1md1dfl",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Is being visibly stressed the new way to ‘look productive’?",
    "text": "Okay, mini rant here. From what I’ve seen so far in this industry, it honestly feels like companies reward the people who are constantly stressed out and scrambling. You know the type—they don’t plan ahead, they’re always “so busy,” working during meetings, loudly complaining about their workload, and somehow that chaos gets seen as dedication.\n\nMeanwhile, the people who actually plan their work, stay focused for 8 hours, hit their deadlines, and don’t make a big scene? Totally overlooked. Like… sorry for not having a meltdown every day?\n\nSure, we all have stressful days, but some of us deal with it quietly and keep things moving. Does anyone else see this happening, or is this just my early-career frustration talking?",
    "score": 182,
    "url": "https://reddit.com/r/civilengineering/comments/1md1dfl/is_being_visibly_stressed_the_new_way_to_look/",
    "created_at": "2025-07-30T08:47:34.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1idzxga",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Am I the only civil engineer here who increasingly contemplates work/living outside the US?",
    "text": "Transportation engineer on the east coast. Within the first 10 years of career.\n\nLove my life where it is, but feeling like design for anything but a car will be considered illegal/DEI activity in a few years.\n\nJust want to gauge where the folks on here are feeling.",
    "score": 176,
    "url": "https://reddit.com/r/civilengineering/comments/1idzxga/am_i_the_only_civil_engineer_here_who/",
    "created_at": "2025-01-30T22:48:27.000Z",
    "num_comments": 148
  },
  {
    "id": "reddit-1hxu1tm",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "2024 CIVIL ENGINEERING SALARY SURVEY TOOL AND BREAKDOWN",
    "text": "Hey guys! I've received many requests to recreate my salary calculator from 2022 with updated data. I've finally gotten around to it and wanted to share it with the community! The calculator/data below is based on the 2024 survey from this subreddit. Many responses are filtered out if the data doesn't make sense. It is US only. \n\nThe file can be downloaded at the below link. Please note this needs to be downloaded to a version of Microsoft Excel. It is not functional in Google Sheets.\n\n[https://docs.google.com/spreadsheets/d/1-XCn6TGQUo74dYiFFhwNy-p64Wp6RA8i/edit?usp=drive\\_link&amp;ouid=113941340613650770172&amp;rtpof=true&amp;sd=true](https://docs.google.com/spreadsheets/d/1-XCn6TGQUo74dYiFFhwNy-p64Wp6RA8i/edit?usp=drive_link&amp;ouid=113941340613650770172&amp;rtpof=true&amp;sd=true)\n\nSimilar to last time, here are a few snippets of interesting data. I didn't have time to do a more robust write-up but I may edit/add to this as I have more time or if people request different things!\n\n[Cost of Living Reference](https://preview.redd.it/1vto3bx0u2ce1.jpg?width=313&amp;format=pjpg&amp;auto=webp&amp;s=a23bdea60713c8d1bb60d69f40ebab637579b19c)\n\n[Year over Year Results](https://preview.redd.it/0m31vec7t2ce1.jpg?width=1171&amp;format=pjpg&amp;auto=webp&amp;s=85d522ece3f41943e992c73d1be7baa17a9f4d34)\n\n[Industry](https://preview.redd.it/z8o4rs39t2ce1.jpg?width=523&amp;format=pjpg&amp;auto=webp&amp;s=e6d725ad78978828358204aa0de439d1599f6cef)\n\n[Education](https://preview.redd.it/bkkyp4nat2ce1.jpg?width=457&amp;format=pjpg&amp;auto=webp&amp;s=b1708a8992b027c4328006201a1dac4072a33cfd)\n\n[Years of Experience](https://preview.redd.it/6yfuxqbct2ce1.jpg?width=528&amp;format=pjpg&amp;auto=webp&amp;s=10f7bf51c79c5a0fffc8c7a1d82c12092ec73be4)\n\n[Region](https://preview.redd.it/jwr778ydt2ce1.jpg?width=635&amp;format=pjpg&amp;auto=webp&amp;s=106565345341ae8c9e30000a25c2499828bc710d)\n\n[Licensure](https://preview.redd.it/ot5zg5zft2ce1.jpg?width=499&amp;format=pjpg&amp;auto=webp&amp;s=7031ec0d0b898a2b09eb5a925a6172ce5c5cb592)\n\n[Gender](https://preview.redd.it/rw6jdqcht2ce1.jpg?width=521&amp;format=pjpg&amp;auto=webp&amp;s=0d8576131e46d6a6bed8d0f347c0341a7687c9ec)\n\n[Work Hours Per Week](https://preview.redd.it/miovk40kt2ce1.jpg?width=637&amp;format=pjpg&amp;auto=webp&amp;s=4d05d9d2947c3933905991bf6caeedc20afcb488)\n\n",
    "score": 174,
    "url": "https://reddit.com/r/civilengineering/comments/1hxu1tm/2024_civil_engineering_salary_survey_tool_and/",
    "created_at": "2025-01-10T02:23:13.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1oeb6i4",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Has anyone ever declined to work on a project due to ethical or moral concerns, particularly in light of a recent high-profile project being prominent in the news?",
    "text": "In my early career I turned down a couple of projects in Qatar due to my concerns about them utilising slave labour. Projects obviously continued but haven’t had a similar decision point in a while. \n\nWould be interested to hear of other examples and what the outcome was personally and on a project level?",
    "score": 174,
    "url": "https://reddit.com/r/civilengineering/comments/1oeb6i4/has_anyone_ever_declined_to_work_on_a_project_due/",
    "created_at": "2025-10-23T18:31:39.000Z",
    "num_comments": 105
  },
  {
    "id": "reddit-1k1hxvs",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Is it a requirement to show your framed PE certificate at your desk?",
    "text": "I choose not to show it because I got screwed and after getting “promoted” in my company when I got certified a couple years ago. I got paid less than what I made as an EIT. (This wasn’t direct, the salary went up but since they took away my all hours paid I literally make thousands of dollars less in a year than I did before). The COO visited our office and had the gall to tell me I need to frame it in case clients come by and visit which I completely intend on not doing. Does anyone else know anything on this situation?",
    "score": 169,
    "url": "https://reddit.com/r/civilengineering/comments/1k1hxvs/is_it_a_requirement_to_show_your_framed_pe/",
    "created_at": "2025-04-17T17:04:26.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1myywf9",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Salary Progression (Roadway Hydraulics)",
    "text": "Saw someone do this a while back for CA. But I live in a smaller metro area in NC. I am licensed and have been with the same employer since graduating. I have a masters degree though I'm not sure it has actually helped me in any way.\n\n  \nThere has been difficulty hiring in my state so I suppose employers are finally starting to pay our worth (I hope?). There were some bumps on the road to negotiate to this point.\n\n  \nSome quick information: This is without including any end of year bonus/additional comps. This is strictly base salary. The 2026 is what I am expected to see next year based on our annual raises (I had this talk with my manager a month ago on what I should be expecting). I average around 40-42 hours a week with opportunities for approved STOT although it doesn't happen often (probably 6 times since I started).\n\n  \nMy work is in roadway hydraulics which includes roadway drainage, bridge/culvert modeling (1D), erosion and sediment control design, permit drawings, and occasionally wet utility design.\n\n  \nFeel free to ask any questions.",
    "score": 168,
    "url": "https://reddit.com/r/civilengineering/comments/1myywf9/salary_progression_roadway_hydraulics/",
    "created_at": "2025-08-24T15:40:36.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1jqoi1m",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "I'm 28 with a Master's in Coastal Engineering, Bachelor in Civil Engineering. I just got my P.Eng. My salary is now 85K at a consulting firm as a coastal engineer as I only got a 2K raise for my P.Eng. Is this not low? Should I look for new jobs?",
    "text": "So I get paid basically just as much as a person who doesn't have a P.Eng at my company? That is WILD. The person I am training, makes the same as me? (I’m in Canada)",
    "score": 163,
    "url": "https://reddit.com/r/civilengineering/comments/1jqoi1m/im_28_with_a_masters_in_coastal_engineering/",
    "created_at": "2025-04-03T17:26:33.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1ovgwrv",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Civil engineers, why is it so hard to get people to consider new roles?",
    "text": "Hi everyone, I run a recruiting business focused on civil engineering across the Midwest and East Coast in the United States. I work mainly with PE-licensed engineers in transportation, infrastructure, and buildings, and also with roles in construction inspection.\n\nI want to be clear upfront that I’m not some sleazy salesperson. I take the time to understand the market, the projects, the specific roles, and the work that engineers actually do. I have a genuine interest in civil engineering and I try to make sure that every conversation I have is thoughtful, informed, and respectful. When I reach out, I include salary, responsibilities, location, and project details. I answer questions and explain the roles fully so that anyone considering a change has all the information they need. I am not pushing anyone, I am not cold-selling, and I am not trying to force people into a decision.\n\nEven with that approach, I am running into almost constant silence. For most roles, I will send 30 or more messages and maybe one engineer responds. When someone does respond, we talk about the role in detail, they express interest, and then nothing happens. No resumes get sent, follow-ups do not occur, and it feels like I am talking to ghosts. I have made a couple of placements here and there, but they are rare and nothing like what I would need to sustain the effort I put in.\n\nI am trying to understand what is happening from the perspective of the engineers themselves. Why is it that so many PE-licensed civil engineers in transportation, infrastructure, and building roles seem so static? Is it the projects they are on, the clients they work for, the stability of their current positions, or something else that makes people reluctant to move even when opportunities are transparent, well-compensated, and clear?\n\nI would also like to understand what would actually make someone realistically consider a new role. Is it project ownership, leadership responsibility, better work-life balance, or something I may not even be seeing from the outside? I am not here to recruit anyone right now. I am genuinely trying to understand what drives decisions in your field, what motivates movement, and why the candidate market feels so frozen from the outside.\n\nIf you are a civil engineer and have insight, even brief, I would truly appreciate hearing it. I value the work that you do, I respect the effort that goes into these roles, and I want to understand the market from the people who live it every day.\n\nThank you in advance for any perspective you are willing to share.",
    "score": 158,
    "url": "https://reddit.com/r/civilengineering/comments/1ovgwrv/civil_engineers_why_is_it_so_hard_to_get_people/",
    "created_at": "2025-11-12T20:44:42.000Z",
    "num_comments": 236
  },
  {
    "id": "reddit-1mgamux",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "It's been 4 years since I graduated as a Civil Engineer, and I feel like I'm still at zero. I need advice.",
    "text": "I graduated almost four years ago as a Civil Engineer with a CGPA of 3.85. I’ve always been good at studies. I genuinely love calculations, math, and tech stuff — so I thought I’d do well in this field.\n\nA few months after graduating, I got a decent-paying job as a Trainee Engineer. I was excited, but honestly, the excitement died on day one.\n\nI was thrown straight onto a site (an infrastructure project), in peak summer heat, with zero training. No guidance. No one told me what to do. I had to literally chase my seniors just to remind them I existed. My immediate senior — a Site Engineer — wasn’t helpful at all. We had the same salary even though he had been working for 3–4 years, and he clearly didn’t like that. So he avoided teaching me anything.\n\nI spent months roaming around with no proper tasks. I tried asking senior managers for work, but they didn’t care. Being an introvert didn’t help either. Everyone seemed annoyed that I was “doing nothing,” but no one gave me anything to do. The deputy project manager would ask me why I was standing idle — and when I told him I wasn’t assigned anything, he’d just say “go observe work at other sites.” That became my daily routine. Just showing up, pretending to stay busy, while learning absolutely nothing.\n\nNine months passed like this. It was mentally exhausting and incredibly demotivating.\n\nThen the company got a new project — a huge drainage system in a residential area. I literally fought with my manager to get transferred there, hoping I’d finally get to learn something.\n\nAnd yes, I did pick up some basics — how concreting is done, how labor is managed, how things flow on a site. But it came at a cost. It was far from home, with no proper work hours. I was sometimes doing 18-hour shifts. I had night duties. My social life completely disappeared.\n\nEven worse, the learning wasn’t structured. I spent most of my time riding around on my bike under the sun and dust, managing multiple sites alone. It was all about just getting things done. No proper engineering practices. Just rushed, often corrupt execution. No time or energy left to actually sit and understand what was happening.\n\nI stayed there for 1.5 years. Eventually, the company downsized — and honestly, I was relieved.\n\nWhile all this was going on, I was also working with a friend on a small clothing manufacturing business. Once my job ended, I didn’t apply for anything else. I didn’t feel confident. I felt like I hadn’t learned enough to prove myself in interviews. So I gave my full time to the business.\n\nNow the business is running okay. I’ve set up a small unit, we get orders and fulfill them. But the income isn’t fixed, and honestly, it’s not a lot.\n\nNow, four years after graduation, I feel stuck.\n\nI keep thinking about how I worked hard, scored high, had the potential — but I’m not doing anything related to Civil Engineering anymore. I don’t want to go back to site work. I don’t want to end up in management either.\n\nWhat I do want is to rebuild my career through a more technical route — something like Planning, BIM, or Structures. These areas actually align with what I enjoy: tech, numbers, engineering logic.\n\nBut I don’t know where to start. I feel like I’m at zero again.\n\nIf there’s anyone here who’s been through something similar — or if you’re in Planning/BIM/Structures — please guide me. How do I restart after a four-year gap? What steps should I take now? Courses? Internships? Remote roles? Freelancing? I just need some direction.\n\nI sometimes spiral into overthinking and depression about this. I really want to fix it. I just don’t know how.\n\nAny advice is appreciated.\n\nTL;DR (My Situation):\n\nGraduated 4 years ago in Civil Engineering (CGPA 3.85)\n\nGot stuck in a toxic site job — no training, no learning\n\nSwitched to a clothing startup — it's running, but income is low\n\nRegret wasting my degree; feel stuck and lost\n\nDon’t want site or management roles\n\nWant to restart in a technical field: BIM, Planning, or Structures\n\nFeel like I’m back at zero and need guidance\n",
    "score": 151,
    "url": "https://reddit.com/r/civilengineering/comments/1mgamux/its_been_4_years_since_i_graduated_as_a_civil/",
    "created_at": "2025-08-03T04:49:47.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1jdr2nl",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Female Civil Engineers: Impacts of pregnancy on your career?",
    "text": "I’m looking for some brutally honest insight on this one. \n\nI’ll be graduating this June and have a job lined up. I’ve been getting very excited for life after college, so I’ve been having some deep conversations with my mom, and it turns out when she graduated college, unbeknownst to her, she was pregnant. \n\nI’m lesbian, this isn’t something that’ll accidentally happen to me, but I do plan to have children some day and likely sooner rather than later. But I keep thinking “what if I were in that position?”\n\nSo I wanted to get some insight from you all. How has having children affected your career trajectory? How have you seen it affect others? Does it affect how others view you? Particularly if you had children pre-PE.",
    "score": 150,
    "url": "https://reddit.com/r/civilengineering/comments/1jdr2nl/female_civil_engineers_impacts_of_pregnancy_on/",
    "created_at": "2025-03-17T23:25:48.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1nu3hqj",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Unchallenged at work",
    "text": "I’m a PE working in the public sector with 20 years experience. I make a good salary, one of the highest in my state for public sector civils. Work life balance is great, but I haven’t been challenged in this role for years. Small projects, lots of drama in my place of employment, co-workers who are impressed with the simplest of ideas, etc. No one cares if deadlines are missed or quality suffers, because no one even thinks to ask about it. I’m not burned-out, I’m bored-out. I’m worried that if I stay on this path for the rest of my career that my skills will get so dull, I will have no choice but to stay in this public sector role.\n\nAm I crazy to think about pivoting into the private sector?",
    "score": 147,
    "url": "https://reddit.com/r/civilengineering/comments/1nu3hqj/unchallenged_at_work/",
    "created_at": "2025-09-30T04:10:41.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1l78bi2",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Digital drafting revolution: Are junior engineers doing more for less?",
    "text": "Hey all — I’ve been reflecting on something that I think a lot of us are experiencing but maybe not fully acknowledging.\n\nA senior PM I work with recently mentioned how, back when he was an EIT, there were way more engineers and drafters on each project. Teams were larger, and the work was more distributed. Fast forward to today, and thanks to CAD and other digital tools, it’s often just one PE and maybe one or two EITs producing an entire set of plans (depending on the scale).\n\nThis got me thinking: junior engineers today are exposed to way more of the project lifecycle earlier in their careers — from design to production. That sounds like a good thing at first... but there’s another layer to this.\n\nWe’re doing more, earlier, and faster — yet we may actually be making less (when adjusted for inflation) than our predecessors did at the same point in their careers. From what I’ve seen and what others have told me, starting salaries in civil engineering haven’t exactly scaled with inflation or productivity gains.\n\nIt feels like automation — especially CAD — has quietly shifted firm behavior. Instead of hiring larger teams, firms now expect fewer people to handle more work across multiple disciplines and phases of a project. The tools make us more efficient, but that efficiency often translates into higher expectations without proportional compensation or support.\n\nI want to open the floor here:\n\n1. Are younger engineers today being asked to do more with less support than previous generations?\n2. Have you noticed this shift in your firm — fewer hires, more multitasking, greater expectations?\n3. Should the productivity gains from CAD be something we leverage in pay negotiations, or at least acknowledge as part of our evolving roles?\n\nWould love to hear your experiences. Let me know what you've seen, whether you’re a junior engineer just starting out, or a senior engineer who’s watched this shift happen.\n\nEdit:  \nExperience is valuable, and I like the responsibility, but I wish the pace of compensation matched the pace of upskilling, rather than how many years of experience you have like it has always been. That way just seems too outdated and needs to be revisited...",
    "score": 147,
    "url": "https://reddit.com/r/civilengineering/comments/1l78bi2/digital_drafting_revolution_are_junior_engineers/",
    "created_at": "2025-06-09T15:50:31.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1jad945",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Do we think US civil engineers will be experiencing 2008 level layoffs in 2025?",
    "text": "So I’m one month into my job post grad so I’ve been worrying about this considering how much being laid off can screw up a career. I heard how horrible the 2008 time was and there was nowhere to get a job. So, does it seem like we are in for something similar in 2025. I know federal funds keep freezing and the stock market seems to be crashing so I wanted to hear your opinions.",
    "score": 145,
    "url": "https://reddit.com/r/civilengineering/comments/1jad945/do_we_think_us_civil_engineers_will_be/",
    "created_at": "2025-03-13T14:28:40.000Z",
    "num_comments": 145
  },
  {
    "id": "reddit-1pm3ro5",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Actual Kimley Horn Total Compensation",
    "text": "The recent KH bonus post has had me wondering what the actual KH total comp is. I feel like there are always vague details of either their 401k match, bonus, or base pay but never the full picture. This has has left me doubting if KH really does pay more than the rest of the industry or if they are just compensated for putting in crazy hours. My question for any current or former KH employees is this.\n\n1) Where are you located? (Region, COL)\n\n2) How many YOE do you have in your career and at KH?\n\n3) What level are you at KH? (P1, P2, P3…)\n\n3) What is the actual breakdown of your TC by base salary, bonus, and 401k contributions.\n\n4) What are your average hours worked per week?\n\n5) For those that left, why did you leave and have you found comparable compensation at other firms?\n\nI hope this is not redundant for the sub, but through a ton of digging I could never really find a clear cut picture of what the compensation at KH looks like.",
    "score": 144,
    "url": "https://reddit.com/r/civilengineering/comments/1pm3ro5/actual_kimley_horn_total_compensation/",
    "created_at": "2025-12-14T03:13:26.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1hrfa4o",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "‘I Regret Hiring You’ 1YOE EIT seeking thoughts on Career Growth and Advancement",
    "text": "UPDATE: I've accepted the municipal job offer and submitted my two weeks' notice to my current boss. He requested at least three weeks for a transition, but I explained I can't do that. Thank you to everyone who helped me make this decision. Your advice showed me the importance of putting myself first, and I'm grateful to learn this early in my career.\n\n\nORIGINAL: I’m currently one year into my civil engineering career, working as a junior designer/project coordinator at a small consulting firm in Ontario. I was hired in 2023 for a project that involved the rehabilitation and repair of small buildings. At the time, I accepted a lower salary since I was financially stable and just out of university. My role initially involved a mix of civil engineering work, but there was no senior engineer at the firm to mentor me through design tasks. I was promised that a senior position would be filled soon, but recently I learned the firm has decided not to hire anyone for that role, likely due to financial challenges. \n\nI started looking for other opportunities, and a couple of weeks ago, I received an offer for a project coordinator position with a local municipal corporation. The new role involves reviewing designs (rather than creating them) and offers a 25% pay increase. Given my current financial situation, I considered this as a serious option.\n\nI informed my boss about the offer, explaining my reasons for considering the move, but the conversation did not go well. I was shouted at, dismissed as inexperienced, and told that my boss regretted hiring me. This experience has deeply impacted my mental health. Despite always giving 100% at work, including doing overtime without compensation and putting work first, I’m now questioning whether my dedication has been truly valued.\n\nNow I’m at a crossroads. My main career goal is to obtain my PEng, which seems unlikely in the new role, as it’s more focused on project management than design. On the other hand, staying at my current job might lead to stagnation without proper mentorship or growth opportunities. \n\nGiven the situation, I’m seeking advice on whether I should stay in my current role and keep pushing for the mentorship I need, or take the new offer in the public sector and pursue a path that’s more aligned with my financial needs. Would it be wise to prioritize the potential for career advancement in a different environment, even if it may not be ideal for obtaining my PEng?",
    "score": 143,
    "url": "https://reddit.com/r/civilengineering/comments/1hrfa4o/i_regret_hiring_you_1yoe_eit_seeking_thoughts_on/",
    "created_at": "2025-01-01T23:09:51.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1kp7sey",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "75k to 90k?",
    "text": "Got an offer for 90k salary + 4% match + benefits. \n\nCurrently have 75k salary + ~5% bonus (before tax) + 5% match + benefits.\n\nCurrent job is residential/commercial/industrial land dev, great for learning.  However, there’s been countless times where I’ve worked late nights, worked early mornings, etc. There is rarely a time where I’m only working hours per my contract. Coworkers are great and hybrid work. Commute is about 1h one way during rush hour, up to 1h30 some times.\n\nNew job is land dev but in the energy sector (renewables, power, etc). Don’t know much about the company other than it’s a lot larger in size and global. Commute would be 30 mins one way. Don’t know how learning opportunities will be. \n\nPrioritize learning and grind for 15k less in salary? 2 YOE btw ",
    "score": 142,
    "url": "https://reddit.com/r/civilengineering/comments/1kp7sey/75k_to_90k/",
    "created_at": "2025-05-18T00:47:21.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1l8esbo",
    "subreddit": "civilengineering",
    "soc_codes": [
      "17-2051"
    ],
    "title": "Do you still love your job? I do.",
    "text": "I see lots of people in this sub that are burned out or not enjoying their career. I still really enjoy mine. I get to work with great colleagues, consultants, and contractors. \n\nFor those of you that still enjoy your career, what makes it good? Let’s give some hope and any tips. 🥂 ",
    "score": 126,
    "url": "https://reddit.com/r/civilengineering/comments/1l8esbo/do_you_still_love_your_job_i_do/",
    "created_at": "2025-06-11T00:16:10.000Z",
    "num_comments": 56
  }
]