[
  {
    "id": "reddit-1kre908",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Finch Care, can you stop using the hiring process to collect free design work and ideas?",
    "text": "# For details about my interview experience and community discussions, 👉 [check out this post](https://www.reddit.com/r/UXDesign/comments/1kpmvgj/fake_hiring_idea_mining_my_experience_with_finchs/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) 👈\n\n\n\n🔴 Finch product is about daily journaling and habit tracking. The design challenge? Create a habit tracker app, specifically something creative, not generic. That’s already a RED FLAG, since it directly overlaps with Finch actual product.\n\n🔴 The challenge required high-fidelity designs with full user flow, all within 7 days. That’s way beyond what’s reasonable for a “test”, and candidates aren’t even paid for it. That’s unfair, and honestly, possibly illegal.\n\n🔴 After submitting, there’s a 1-hour deep dive interview just to go over the design challenge. But I was asked a bunch of weird, very specific questions, the kind you’d only ask if you already had a live product for a long time and wanted to optimize it to fit some market changes. Not something you’d ask about a design exercise.\n\n# Here’s some additional context I gathered from the comments on my previous post:\n\n\n\n🔴 Another designer shared: “I was rejected after the onsite where they absolutely mined me for ideas. The CEO stayed on a call with me for like 45 minutes and I thought we were vibing — guess not.”\n\nThey felt the team seems unsure about their next direction. Even though Finch benefited from a wave of early success, it’s now facing the growing pains of shifting market demands.\n\n🔴 An applicant for the Art Director position reached out to me, saying they felt there were too many unreasonable tests and discussions during the interview. Even big-name companies don’t have this many steps. Especially all the deep dives. It really felt like they were fishing for ideas. The entire interview loop was basically a UX interview, just with a few things reworded to sound art-related.\n\nAlso, the HR claimed upfront that the position offers a six-figure salary, which struck them as odd: How could a small company afford that? Coincidentally, when I talked to HR, they also mentioned a salary range that was even higher than what I got at my previous company, Cisco. I thought that was unbelievable too, or maybe it’s just a hook.\n\n🔴 Another designer told me they interviewed last year. After completing the design challenge, they moved on to a 1-hour deep dive, then got rejected. Back then, finch interview process was different: Design Challenge → 1-hour deep dive → Portfolio review (which they never got to because of the rejection).\n\nMy experience was: Portfolio review → Design Challenge → 1-hour deep dive (then rejection). It looks like finch has changed the order. My guess is: if they ask candidates to do a tough design challenge right after talking with HR, most would say no or raise concerns (and many actually did). The conversion rate would be too low. So they moved the portfolio review before the design challenge, creating a false sense of approval to increase the chances that candidates accept the design challenge.\n\n🔴 A Finch user told me that Finch game-like changes to the product once caused huge controversy, but all those discussions were deleted from major social media platforms. Even posts pointing out small bugs got removed. Also, they noticed a lot of weird flows in the product and suspect it might be because Finch referenced or borrowed some free UX work from the hiring process.\n\n🔴 My cousin used to handle TikTok’s overseas ads, and she was really impressed by Finch because Finch spent a ton on marketing there and loved working with influencers for videos. She said Finch must be rolling in cash to support such big expenses.\n\nBut judging by all the weird stuff happening in Finch hiring process, maybe Finch’s finances aren’t as great as they seem, who knows? Still, if Finch do have the money, why not pay the candidates who do their design challenges? Especially since your challenges are so demanding, interviewees have every right to ask for compensation! \n\n🔴 A designer told me they applied to a role at Finch back in Feb 2024, and were surprised it’s still open over a year later. Based on LinkedIn, the latest design hires joined in April, May, and October 2024. So far in 2025, no new design hires. Everyone may interpret this differently, so I’ll leave it at that.  \n  \nand more.\n\nIf you're job hunting and considering applying to Finch, or if you're already in their interview process, I hope this post helps you out.",
    "score": 1054,
    "url": "https://reddit.com/r/UXDesign/comments/1kre908/finch_care_can_you_stop_using_the_hiring_process/",
    "created_at": "2025-05-20T19:45:52.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1ncb5ys",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "can’t be just me lol",
    "text": "Every time when we start a project, I spend hours scrolling through fontshare, google fonts, pangram pangram, bla bla, and somehow end up back on Inter every single time. like its clean, readable, no nonsense. dashboards? inter. apps? inter. portfolio site? inter.\n\nShoutout tho to Plus Jakarta Sans (so good when u want that cool vibe) and some other cool free ones from fontshare too. but idk, inter just feels like the default cheat code for UI. Also accessibility wise, it just works, super legible on all screens.\n\nIs it just me? what’s your go-to font and why is it inter? or are you secretly using comic sans ?",
    "score": 1040,
    "url": "https://reddit.com/r/UXDesign/comments/1ncb5ys/cant_be_just_me_lol/",
    "created_at": "2025-09-09T06:03:30.000Z",
    "num_comments": 104
  },
  {
    "id": "reddit-1jjnvqe",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I GOT THE JOB!",
    "text": "Hey everyone,\n\nI recently posted on the ‘Breaking into UX’ thread asking for advice on a final round, in-person UX interview! I wanted to share an exciting update—I got the job!\n\nI applied to over 66 jobs. I received 42 rejections, 20 companies never got back to me, and only had 4 first-stage interviews, only 2 of which being UX roles. Eventually, I had two hiring manager interviews, both followed by design tasks, which led to final round interviews.\n\nYesterday, I had my very first final round interview for a Product Design role. It went so well that I received an offer by the end of the day!!! \n\nIt was an offer that exceeded my expectations as a first job, I accepted the offer and withdrew from the other interview! \n\nAfter 4 months of searching and nearly 14 months since I decided to transition into Product Design, with endless applications, ghosting, rejection emails, and more iterations on my CV and portfolio than I can count, I finally landed my dream job. \n\nThe journey was an emotional roller coaster with plenty of self-doubt, but it was all worth it in the end.\n\nI really don’t want this to sound braggy, I just to remind everyone that even when things feel impossible, there’s a company and a role out there meant for you. \n\nKeep pushing, keep learning, look after yourself and your health, seek calm in your friends and family, and honestly - feedback is your best friend. If you’re not sure what’s going wrong, ask questions, listen, and iterate.\n\nYou can do it! And if anyone needs someone to talk to or just rant to! DM me hehe 🤭",
    "score": 1024,
    "url": "https://reddit.com/r/UXDesign/comments/1jjnvqe/i_got_the_job/",
    "created_at": "2025-03-25T16:44:43.000Z",
    "num_comments": 190
  },
  {
    "id": "reddit-1meqjua",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I designed an F1 strategy display in 2001. They're still using it today.",
    "text": "Back in 2001, while working as Race Strategy Analyst with McLaren F1, I designed a tool we called McLaren Track Viewer — a circular display showing where all the cars were on track in terms of time gaps, not spatial layout.\n\nNo one asked for it. The engineers were using tables of lap times to 3 decimal places. But I was a psychologist doing mathematical modelling, and I wanted something cognitively ergonomic: a display that supported decision-making and ease of comprehension rather than precision.\n\nSo I prototyped it, people liked it, then refined it to a polish. \n\nIt stuck. I remember the UK TV coverage did a little 3 minute spot about it when it was first noticed in the following year. And to my surprise, watching the Belgian Grand Prix last week, I saw what looks like almost exactly the same design still in use today on Oscar Piastri’s race engineer’s screen — 24 years later!\n\nSame black background, circular format, colour-coded drivers, pit exit projections… It’s all still there, in the same colours too.\n\nIn a comment I'll add a link to my LinkedIn post, which includes more detail and has several interesting comments from others in the F1 industry...  \n",
    "score": 927,
    "url": "https://reddit.com/r/UXDesign/comments/1meqjua/i_designed_an_f1_strategy_display_in_2001_theyre/",
    "created_at": "2025-08-01T08:00:59.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1jgia0d",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Why do people act like UX Design is some type of sacred career?",
    "text": "A lot of times I get a holier than thou vibe from this forum. \n\nPeople are acting like ux design is some type of sacred ritual that must be revered. \n\nLike calm down Janice, you change the color of buttons on an e-commerce website that sells made in China E-Waste.\n\nI just get the vibe that some people view themselves as having jobs that are on par with doctors in terms of importance. \n\nI get the feeling that some ux designers make this job 10 times more complicated than it really needs to be.\n\nIdk this is just my shitpost for the day.\n\nWhat are your thoughts? Do people take this career a bit too seriously?",
    "score": 700,
    "url": "https://reddit.com/r/UXDesign/comments/1jgia0d/why_do_people_act_like_ux_design_is_some_type_of/",
    "created_at": "2025-03-21T14:35:33.000Z",
    "num_comments": 201
  },
  {
    "id": "reddit-1o6f6tg",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "14 months, 421 applications, 1 offer",
    "text": "So, I finally landed a new role after 14 months of research.\n\nI made this chart to visualize what that actually looked like and honestly it blew my mind... Made me both sad for myself but also for the industry. \n\n* 421 applications and many many cover letters. \n* 103 rejections, often a generic email written by AI. \n* 299 companies never came back to me at all.\n\nAnd from that, a handful of interviews, some case studies, design challenges or whiteboard sessions. **One single offer at the end** (could have potentially be a couple more but was happy with the first offer).  \n,  \nSometimes I dropped out because the red flags were very clear (or the “design challenge” was obvious free work). Sometimes I just couldn’t see myself in the culture. But most of the time, I just didn’t hear back...\n\nIf you’ve been job hunting lately, you know how weirdly personal this can feel. You start questioning everything, your portfolio (oh boy I redesigned the sh\\*\\* of my portfolio several times), your skills, your personality, etc.   \nThen you remember this isn’t about you being \"bad\" but how bad and broken the market is right now.\n\nFor context: I’m a lead product designer with 12 years of experience in SaaS and startups. Design strategy, craft, mentoring, design systems, all the good stuff. And it still took me over a year to get a solid “yes.”\n\nSo if you’re in that same spot, burnt out, ghosted, doubting yourself, please remember: it's not just you. The pipeline is rough right now, even for strong designers. The best thing you can do is protect your energy, take breaks, refine your story, and drop out when something feels off.",
    "score": 699,
    "url": "https://reddit.com/r/UXDesign/comments/1o6f6tg/14_months_421_applications_1_offer/",
    "created_at": "2025-10-14T13:14:33.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1hnzcqq",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Just finished reviewing new grad portfolios and have advice",
    "text": "I work in big tech and recently finished reviewing portfolios for early career new college grads! I wanted to share some general tips from my experience. Please note that all companies are different and hiring might differ wildly so this is just one person’s advice from one company. \n\n* I passed 60% of portfolios\n* We are required to fill out a rubric that grades a candidate on several criteria. \n* I did not source candidates, only portfolio review. \n\nBig takeaways:\n* I always review the first case study in your portfolio thoroughly. Put the one you want me to review first. \n* One great case study is better than 4 half-complete ones! Only if your first case study does not demonstrate all the competencies I am looking for, then I will continue reviewing the rest of your portfolio’s case studies. That means a really strong first case study is more important than all of them being complete. \n* Demonstrating feedback collection and iteration in your case study are extremely important, and often missing from case studies. It’s rare that your first solution is perfect, and we really do need to see how you incorporate feedback in your process.\n* Basic visual design skills are table stakes. Consistent padding, color contrast, correct semantic color usage, consistent visual treatment of elements, passable copy. Not looking for perfection, but basic visual eye and UX understanding are really hard and time consuming to train for and so your work needs to pass a basic usability bar in today’s market. \n* Our criteria specifically specified very little to no typos. Personally I wouldn’t have docked off points for that, but it was part of our standardized criteria. Please double check your work. \n\nCandidates that got a strong recommendation:\n* Clearly iterated meaningfully from feedback. I can tell it wasn’t artificial iteration or feedback. \n* Identified a believable user problem and solved it. \n* Showed prototyping ability. \n* Demonstrated familiarity with our design stack (eg Figma or FigJam). \n* Shipped work in a multidisciplinary team environment (could be a school club too) but you definitely get bonus points if you show that you can work well with non-designers and incorporate their feedback into your design process. \n* It’s better if your portfolio is clearly curated for product design. It’s harder to give a strong recommendation for a candidate that is trying to do it all: branding, graphic design, packaging design, etc in their portfolio alongside product design case studies is not recommended. \n* Effort. In today’s market, I do reward effort put into portfolios. I will pass “bare bones” if the case studies are solid, but portfolios that have a little flair, attention to detail, or are well designed in themselves shows a level of craft and hard work on top of already solid case studies, that really compels me to give a strong recommendation. It will not turn a fail into a pass, but it will turn a pass into a strong yes. \n\nOther callouts:\n* Prior experience doesn’t matter to me. I failed someone that interned at FAANG and passed someone that didn’t have any internship experience due to the quality of their portfolios. \n* Name of school doesn’t matter to me. Likewise, I passed new grads from more standard schools and failed some Ivy League grads or top tier art schools based on the quality of the portfolios.\n* These candidates tend to be impressive, but I just want to callout that it’s not the end of the world to not have these credentials on your resume. The quality of your work is what really matters. \n* I believe these tips to apply to most big tech companies with new grad programs. However, smaller companies, different industries or startups may look for very different qualities. Something to keep in mind as you are crafting your portfolio. \n\nI can’t share too much details for obvious reasons, but I hope this helps any new grads navigate some of the expectations out of your portfolio. I remember feeling pretty confused and lost as well, I didn’t have any mentorship and these are all things I wish someone told me back then. The market is also extremely tough right now, but getting better. Please be kind and gentle to yourselves esp after the holidays where I’m sure some of you are feeling the pressure from family to start your first big job! You are doing great. \n\nGood luck everyone 🍀❤️",
    "score": 650,
    "url": "https://reddit.com/r/UXDesign/comments/1hnzcqq/just_finished_reviewing_new_grad_portfolios_and/",
    "created_at": "2024-12-28T05:58:56.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1p5frhw",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "After 7+ Years in UX, Here Are the Things I Wish Someone Told Me Earlier",
    "text": "Hey Guys,\n\nI’ve been in UX for a little over 7 years now across startups, agencies, and one massive enterprise that moved slower than my Figma cursor on a bad Wi-Fi day. Thought I’d share some things I wish someone had told me when I started. Maybe it’ll help someone here who's figuring their path out.\n\n\n\n**1. UX Is 80% Communication, 20% Figma**\n\nNobody warns you about this.\n\nYour wireframes matter, yes, but how you explain your decisions matters more.\n\nI’ve seen mediocre designers survive because they can talk, and great designers struggle because they don’t speak up.\n\n\n\n**Learn to:**\n\n* Frame your work with intent\n* Present without apologizing\n* Push back without being confrontational\n* Write concise, user-friendly documentation\n\n\n\nHonestly, communication is the real senior-level skill.\n\n\n\n**2. Research Isn’t Always “By the Book”**\n\n**In real life:**\n\nYou rarely get a 3-week research sprint.\n\nSometimes you get… 3 hours.\n\nAnd you still have to deliver something meaningful.\n\n**Scrappy research methods that saved me:**\n\n* 5 user calls &gt; 50 survey responses\n* Customer support transcripts = gold\n* Usability testing with coworkers &gt; no testing\n* Analytics + heatmaps fill research gaps\n\nStop waiting for the “perfect” process.\n\n\n\n**3. Stakeholders Don’t Hate UX They Hate Uncertainty**\n\nYou’ll meet stakeholders who:\n\n* Override designs\n* Add random features\n* Question every decision\n\nMost of the time, it’s not ego it’s fear of risk.\n\nWhat helps:\n\n* Bring data\n* Show alternatives\n* Explain trade-offs like you’re teaching, not defending\n* Share early and often (don’t surprise them)\n\nOnce they trust you, decision-making becomes way smoother.\n\n**4. Your First Version Will Never Be the Final One**\n\nDon’t get emotionally attached.\n\nYour design will get changed.\n\nSometimes in ways that hurt your soul.\n\n\n\nTake the feedback.\n\nKeep the core intact.\n\nIterate.\n\nThe real win is improving the user experience, not your personal aesthetic.\n\n\n\n**5. Learn Basic Business &amp; Tech It’s a Cheat Code**\n\nThe moment I understood:\n\n* how product managers think\n* how developers estimate effort\n* how business KPIs connect to UX metrics\n\n…I stopped having design meetings that felt like fights.\n\nYou become a partner, not a decorator.\n\n\n\n**6. Your Portfolio Matters More Than Your Certifications**\n\nHot take, but true.\n\nHiring managers barely care about your certificate list.\n\n**Show them:**\n\n* how you think\n* how you solve problems\n* how you measure results\n* how you work with constraints\n\nA clean, well-told case study beats 10 courses.\n\n\n\n**7. Burnout in UX Is Real Protect Your Energy**\n\nIf you don’t set boundaries, every product team will happily eat your entire week.\n\n\n\nYou don’t need to join every meeting.\n\nYou don’t need to create pixel-perfect mockups for throwaway concepts.\n\nYou don’t need to respond to Slack pings instantly.\n\n\n\nProtect your focus time like it’s sacred.\n\n\n\n**Final Thought**\n\nUX isn’t just a career it’s a craft that keeps evolving.\n\nYou never “finish” learning.\n\nAnd honestly, that’s what keeps it interesting.\n\n\n\nHappy designing and good luck to everyone navigating their UX journey.\n\nIf anyone wants me to share templates, portfolio tips, or realistic research frameworks, just tell me.",
    "score": 636,
    "url": "https://reddit.com/r/UXDesign/comments/1p5frhw/after_7_years_in_ux_here_are_the_things_i_wish/",
    "created_at": "2025-11-24T12:28:28.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1mhsryr",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "My traumatic experience as a Design Lead at J&amp;J",
    "text": "\nI want to share a painful chapter of my career that still affects me deeply. I worked as a Design lead at Johnson &amp; Johnson through a third-party contract. What seemed like a prestigious opportunity quickly turned into a toxic and emotionally draining experience.\n\nThe company was aggressively outsourcing both design and development to offshore teams (mostly in India), with the clear goal of cutting costs. My role was essentially reduced to being a “trainer” for Skill transfer, not in a collaborative sense, but in a way that made it obvious I was helping to replace myself and my colleagues with cheaper labor.\n\nBut the worst part was the deliberate emotional manipulation:\n\t•\tI was insulted, undermined, and disrespected on a daily basis.\n\t•\tEvery time I delivered strong design work, my manager would call a 1:1 — not to recognize the work, but to scold me in an upset, accusatory tone for not “teaching” offshore colleagues well enough.\n\n\t•\tAt some point It became clear they were trying to provoke an emotional reaction — pushing me toward frustration, anger, or burnout, just so they could fire me “with cause” instead of acknowledging their unethical practices.\n\t\n•\tMost of the European and U.S.-based designers were let go. We were treated as temporary obstacles to their cost-cutting roadmap.\n\n\t•\tI was constantly monitored — my emails, chats, and even calls were tracked. I even kept the laptop microphone off, but still felt watched. Casual comments were thrown back at me in twisted ways, weaponized to create more pressure.\n\n\t•\tThe environment was hostile and controlling, and I was left feeling anxious, paranoid, and disposable.\n\nI’m sharing this because I know many people believe that working for a massive, well-known brand is a career milestone. Sometimes it is. But other times, it’s a façade hiding a machine that chews through talent to optimize spreadsheets without any regard for the human cost.\n\nIf you’re going through something similar, you’re not alone. These environments are real, and they are harmful. Don’t let anyone make you believe it’s your fault.",
    "score": 589,
    "url": "https://reddit.com/r/UXDesign/comments/1mhsryr/my_traumatic_experience_as_a_design_lead_at_jj/",
    "created_at": "2025-08-04T23:05:42.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1ltjilp",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "You are not your job",
    "text": "Hey, it’s really tough out there right now. Lots of us are not working, even staff levels and higher. It’s totally reasonable to be asking if you’re in the right field, the right job, etc. \n\nAnd also, you are not your job. You are a smart, hard-working, awesome, loved individual who happens to work in a high-stress, high-ego, high-turnover industry that pulled random bullshit out of the woodwork every five years or so. \n\nI’m not saying you should stay. That’s for you to decide. \n\nI am saying that you are not amazing because you’re in UX. You’re amazing because you’re you. If you happen to work in UX we—your coworkers and teammates—are the ones who benefit. \n\nIt’s almost Monday. (For some of you it is already Monday.) You’ve got this. ",
    "score": 574,
    "url": "https://reddit.com/r/UXDesign/comments/1ltjilp/you_are_not_your_job/",
    "created_at": "2025-07-07T03:05:24.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1io7xd0",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Most valuable career tip: Be likeable. Don’t be c*cky.",
    "text": "Well, maybe not the most valuable, that depends on the person. But I can’t say this enough:\n\nBeing likeable is a skill. No matter how much you want to deny it.\n\nThis field can seem easy for you when you start out. Just do some interviews, catch some aha moments, and design some screens that look like any other SaaS product. So it’s easy to become really really cocky. I’ve seen it so many times. Folks fresh out of college being really hard to work with because they communicate with zero humility. Be confident but also humble. Have a life outside of work so the work doesn’t become your life. \n\nDon’t be the diva that treats design like a holy talent that only YOU can touch either. Get your teammates to work with you. This is fundamentally not a super creative career path. It’s a little creative, but more importantly it’s shockingly corporate - getting things done, aligning people, pushing things out, tracking them. \n\nYou don’t need to be a pushover, but you surely don’t want to be someone vaguely unpleasant that makes high performing team members leave the company. ",
    "score": 446,
    "url": "https://reddit.com/r/UXDesign/comments/1io7xd0/most_valuable_career_tip_be_likeable_dont_be_ccky/",
    "created_at": "2025-02-13T01:43:46.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1kip7r1",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I transitioned out of UX and I feel so much better mentally.",
    "text": "After 10 months of looking for a UX position after I was bullied into leaving my previous job and also 6 final interviews in which all of them required a design challenge, portfolio presentation, panel, and was all 5~6 rounds each, I officially left the industry and got a new job. I was lucky enough to get a referral for a public sector position. \n\nAnd honestly, I’ve never felt so stress free. I have a dual degree in business and UX at my post secondary school that I spent 8 years on and I’m so glad I finished my business degree because that helped me secure a stable government job. Sure, it’s a 30% pay cut but there’s no leadership barking in my ear all the time and I don’t have to take work home after I clock out. Also, I only had to do one interview for this job (got to skip screening because of that referral) in comparison to 6 I was doing before. \n\nFrom time to time, I’m not going to lie, it feels pretty shitty when I think about how my education investment didn’t come into full fruition and that the salary I was once making isn’t something I will be able to achieve anymore. But at the end of the day, i tell myself that now I have steady income flowing in and job security.\n\nI guess I just wanted to put it out there that if you’re thinking of transitioning because you feel stuck, that’s okay. Sometimes saving your mental health and cutting your salary significantly and living within your new means for stability is better in the long run. ",
    "score": 380,
    "url": "https://reddit.com/r/UXDesign/comments/1kip7r1/i_transitioned_out_of_ux_and_i_feel_so_much/",
    "created_at": "2025-05-09T18:10:05.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1krjq1d",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Got the job!!",
    "text": "I was laid off about 2 months ago and have finally signed an offer! I just wanted to come on here to add to the bucket of hope (I saw some other similar posts so wanted to add to it). I have 5 yrs of experience and was ideally aiming for 145-150k in salary but I settled for 135k. Not complaining at all.\n\nIt’s not a huge FAANG role but I’m so happy to be able to breathe knowing I don’t have to keep applying. I was starting to feel really down and demotivated but kept pushing through regardless and I’m happy I did. Those of you who are still looking, if you haven’t been doing this; plz practice your answers to behavioral questions. For me I think this is when I started actually moving through to the final rounds. I practiced and refined my story so much that I could answer in my sleep and sound succinct and compelling. Of course that could be my weak area that I needed to work on so figure out where your weak spot is and really work on it. Designers are very much in need; we just need to tell our stories sharply! Keep going!",
    "score": 344,
    "url": "https://reddit.com/r/UXDesign/comments/1krjq1d/got_the_job/",
    "created_at": "2025-05-20T23:42:09.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1nyfvg4",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "A little bit of advice on portfolios especially early in career and early stage",
    "text": "I am a senior designer in a fortune 500 company and we recently were looking for a relatively entry level designer (0-3 years of experience) and we had about 800 applications (we stopped accepting after that). My manager shortlisted about 100, sent them to people in the hiring loop (I was on the loop) and asked us if we could help shortlist 5 from there). The reason I bring this up is to give you an idea of the competition out there (sorry). That said, I am hoping some of these notes and observations from him and the hiring loop shortlist can help people land their next role or first role in this crazy market\n\n  \n1. **Tell me what you bring to the table in your tagline in the home page** : Almost 80% of the home page taglines were some generic stuff about a mission driven designer who uses AI and wants to change the world. After a while that becomes repetitive. Ensure your tagline talks about what the experience and background you bring to the table. E.g. *Designer with three years of experience in the space* &lt;insert what you want here&gt; space or *Designer with a background in architecture* or  *Former D1 athlete now pushing pixels with a focus on Human computer interaction .* While this is not the key thing , remember this is the first thing people see when they land on your home page, so you want to drive home who you are. \n\n2. **Make it easy for me to know what your projects are about  in the home page** : Most often, we found a lot of projects had rather abstract images with an even more abstract title and we had to click into them to find what they were about. Ensure your home page screenshots reflect the work/focus of your project and if possible have a short blurb so that I know what I am looking at. Just showing the name alone doesnt tell me much unless the name is itself descriptive  \n3. **Case study structure** : Most case studies especially entry level ones read like blog posts. Remember people skim portfolios, they dont read them. The structure that generally worked was as following\n\n* Tell me the problem you are trying to solve \n* How did you solve it (research, ideation, design iterations etc)\n* What was the end result (final design screenshots) and a link to the final product if its live\n\n  \nThis said, since most of the time since we are skimming portfolios due to the time constraints, **the ones that got attention or a second look were the ones who**\n\n1. Drew my attention to the key sections by the imaginative use of large typography or text so I was forced to stop and see them  \n2. Gave me a preview of the final output early on so that I was excited about the result (or atleast enthused)  \n2. Highlighted key learnings/ aspects in a way that forced my eye to notice them  \n3. Use images well to bring contrast between the blocks of text \n\nHere is an example of a case study structure which does that well :  [https://mayukalokre.com/bundles\\_accessdev](https://mayukalokre.com/bundles_accessdev) and this one : [https://abdussalam.pk/project/tv-guide-app](https://abdussalam.pk/project/tv-guide-app)  (he is not entry level but its one of the best well designed case study structures I have seen)\n\n\n\nLastly, please make it easy for people to contact you. If I have to go search for your email address in your portfolio or your contact form doesnt work, you already lost out out on a potential role.\n\n\n\nHope this long winded post helps. I might rewrite some of it later but happy to answer any questions you might have.\n\n\n\n",
    "score": 332,
    "url": "https://reddit.com/r/UXDesign/comments/1nyfvg4/a_little_bit_of_advice_on_portfolios_especially/",
    "created_at": "2025-10-05T05:30:35.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1jf183o",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Got an offer yesterday with almost 50% pay bump.",
    "text": "Hello fellow designers,\n\nthis post is by no means trying to boast or show off, just wanted to shed some positivity as I know how hard and tough the current job market is.  \nI won't go too much into details as I have a longer post about it in the /interviews subreddit, and I will share the link at the end if interested.  \nI have been looking for a new opportunity since last November, went through 300+ applications, countless rejections, ghosting, job scams, multiple 2nd 3rd round interviews led by rejections or ghosting, asking for free work. But finally secured a new job within the last month with a 50% salary bump from my current job.\n\nAlthough my dream is to work towards BIG tech companies like Apple and Google, the truth is, I'm probably not good enough. I did go through an Apple contractor interview but didn't work out in the end.\n\nMy main advice is to stay resilient, positive and keep pushing. You only really fail when you quit.\n\nEDIT: Appreciate all the comments and if my story can at least help 1 person out there, then I feel worth it.  \nFeel free to dm me any questions and I will try to answer to the best I can, just remember, I am nobody special, I am just a hard working and resilient person like many of you. Keep your head up and dont give up.\n\nOriginal posts:\n\n[https://www.reddit.com/r/interviews/comments/1jebvks/i\\_got\\_the\\_offer/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/interviews/comments/1jebvks/i_got_the_offer/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)\n\n[https://www.reddit.com/r/interviews/comments/1jf0x6a/how\\_i\\_got\\_my\\_offer\\_job\\_search\\_experience\\_and\\_tips/?utm\\_source=share&amp;utm\\_medium=web3x&amp;utm\\_name=web3xcss&amp;utm\\_term=1&amp;utm\\_content=share\\_button](https://www.reddit.com/r/interviews/comments/1jf0x6a/how_i_got_my_offer_job_search_experience_and_tips/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)",
    "score": 296,
    "url": "https://reddit.com/r/UXDesign/comments/1jf183o/got_an_offer_yesterday_with_almost_50_pay_bump/",
    "created_at": "2025-03-19T16:35:00.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1jh9oxm",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I got the job!",
    "text": "A few days I posted about what to wear to an interview. The interview went really well. So well that I got an email for the next round even before I reached my home after the presentation round. At the office they said they’ll get back to me by next week. They moved so fast!! \n\nUnfortunately, I was interviewing for the senior role (4+ yoe) and I have around 4. Recruiter called me told that they want to hire me but not for senior since other candidates were like 8-10 yoe people. I understand, that’s fair. \n\nSo they offered me a junior position for $100k. It was a significant decrease in comp from the senior but I took it. Been searching for a job since a year and this is the only offer I have. \n\nA little bummed about the salary but super happy to at least have a job now!! \n\nJust wanted to share the news with people. Ik it’s brutal out there and I hope this news motivates some people to persevere!",
    "score": 289,
    "url": "https://reddit.com/r/UXDesign/comments/1jh9oxm/i_got_the_job/",
    "created_at": "2025-03-22T14:30:03.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1np28kl",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I Feel Like I Wasted 2 Years Trying to Break Into UX",
    "text": "I graduated college in 2022 during the \"UX boom\" with the courtesy of social media selling the dream of working remotely with a good salary. I personally went into this with actual interest in design when I discovered it my senior year. I knew the market was rough but I wanted to take a leap of faith and pursue something I was actually interested for the first time. It's the biggest risk I've taken in my life so far financially and emotionally.\n\nAfter graduating, I dropped 6k on a bootcamp because I came from an unrelated background (business major) and I felt I needed some structure instead of self-learning. I was then lucky enough to land a 3-month internship with a local design studio designing for a startup client.\n\nFollowing the internship, I was kind of in a state of limbo where I didn't have enough experience for a job, so I networked as much as I could by going to tech events and eventually got a small paid gig where I designed a website for a startup. After that it was crickets for months where I applied to jobs, internships, anything to get me experience. I even did unpaid internships just so I didn't have a gap in my experience (1 one of the startups locked me out of their Figma so I lost my work).\n\nAfter 100 applications, I got an interview and portfolio presentation for an internship with a well-known organization, and it felt like this was going to be the beginning of my \"big-break,\" especially having that name on my resume. As luck would have it, I didn't pass the 2nd round. After my rejection, I kind fell into a deeper depression and I practically gave up.\n\nFoolishly, I thought everything would be okay if I just grinded it out I'd make it as a designer because my mentor said I had talent and an eye for design. I had tunnel vision and didn't think that my goal was like trying to swim against the current. For one, my state's tech scene is very immature, it's a logistical nightmare, and most companies won't hire me even if I'm willing to relocate. And also the current state of the market.\n\nI don't even know why I'm posting this here, but I wanted to reflect on my failure. I feel like I've wasted time, money, and my mental health trying to pursue something that felt like just a cruel trick. If anyone can convince me that I didn't waste my time or what my next steps should be, I'd love to hear it.\n\nI guess I never had the chops to be a designer. ",
    "score": 277,
    "url": "https://reddit.com/r/UXDesign/comments/1np28kl/i_feel_like_i_wasted_2_years_trying_to_break_into/",
    "created_at": "2025-09-24T03:50:06.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1mzyu7g",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Laid off while on mat leave. The \"evil American company\" trope is real.",
    "text": "Hey everyone, long-time lurker, first-time poster. I just need to vent and maybe get some reassurance because I'm feeling completely heartbroken and adrift.\n\nAfter almost 4 years as a Sr. UX/UI designer in my current company, my number finally came up. I'd been spared through three previous rounds of layoffs, but the axe fell last week. And it fell while I'm on maternity leave.\n\nI joined this company when my husband and I first moved to Toronto from Colombia. It was a dream: a well-paying job, full remote, and truly amazing colleagues. When they shifted to a 4-day work week (4dww), I thought I'd won the lottery. The work-life balance was incredible.\n\nThen, the company was acquired. Let's call them the **Evil American Corporation (EAC)**. And that's when the soul of the company began to die.\n\n* **Round 1:** Layoffs that took everyone, including leadership, completely off guard. I lost a very good friend that day.\n* **Round 2:** After a year, after they'd *re-hired* for roles, another round of cuts. I was still safe.\n* **The Move:** Feeling secure(ish), my husband and I made the decision to move back to Colombia. The company agreed to keep me on as a contractor. I was so grateful to be home with family and keep my great job.\n* **Round 3:** More layoffs. Then, the \"integration\" began. They ripped out our Google tools and Slack and forced us onto Microsoft Teams. We were subjected to the most patronizing, checkbox-training BS you can imagine (\"How to not bully a coworker,\" \"How to report a theft\").\n* **The Final Straw:** The EAC killed the 4-day work week. Despite three years of data proving its success for productivity and morale, we got a cold, corporate email. Paraphrasing: *\"We're sorry to see some of our colleagues go... and also, we're ending the 4dww to 'align' with EAC.\"* The lack of empathy was staggering. Alignment was more important than people.\n\nI got pregnant last year, and my entire leave was filled with dread. I had a gut feeling this would happen.\n\nMy mat leave started in July. I was still lurking on Teams a couple of weeks ago and saw the signs: huge, knowledgeable pillars of the team were being quietly transferred to another EAC subsidiary. More people were being \"managed out\" and forced to quit.\n\nThen, last week, my boss (who literally had her baby just one week before me) DMed me on Instagram asking for a 15-minute chat.\n\nI knew. My time was up.\n\nWe hopped on a call, and she gave me the news. She actually broke protocol to tell me early—I was supposed to be notified two weeks before my contract is up for renewal in **October**. So I have until then. I'm genuinely thankful to her for that heads-up; it's a small mercy.\n\nI'm trying to be grateful for the notice, but today I had to log back into work, knowing it's all temporary. I cried during my stand-up. I'm going to miss my team so much. I'm heartbroken that I won't get to continue the impactful work I loved.\n\nI'm scared. The market is brutal right now. It will be incredibly hard to find a job that pays a Canadian-level salary while I'm living in Colombia. My husband can support us, but I loved providing for my little one. I loved my career.\n\n**TL;DR:** Got laid off while on maternity leave by a soulless mega-corp that acquired my amazing company and systematically destroyed its culture. I have until October on my contract. Feeling sad, scared, and angry.\n\nHas anyone else been through this? Any remote-friendly Sr. UX designers have tips for the job hunt in this market? Or just words of encouragement? Thanks for listening.",
    "score": 269,
    "url": "https://reddit.com/r/UXDesign/comments/1mzyu7g/laid_off_while_on_mat_leave_the_evil_american/",
    "created_at": "2025-08-25T18:40:22.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1il0sp2",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Well, I give up",
    "text": "I have been working as a designer for 13 years (first as a Graphic Designer after earning my bachelor's degree, and then briefly as a Product Designer after completing a bootcamp). Throughout my entire career, I’ve worked under constant stress due to the fast pace that design projects always demand. I thought that working in tech as a Product Designer would be different, but I soon discovered that it’s the same: unrealistic deadlines, last-minute changes, and modifications without good reason.\n\nOn top of this, I was laid off last April. I had a long trip planned as well as surgery scheduled, so I decided to take that time to improve my portfolio and try to enjoy life a bit. After that, I planned to start looking for a new job. It wouldn’t be that hard, right? How naive I was... It’s been almost a year, and I’m still unemployed. I’ve had some interviews and even reached the technical test stage for a few job offers. But in the end, it was always, \"Unfortunately, we’ve decided not to move forward with your application.\" I receive these emails every day in large numbers, and I see that all the jobs I apply for already have over 100 applicants within the first few hours of being posted. It feels like throwing a banana into a cage full of monkeys and desiring to be the one that grabs it first.\n\nAnd then there’s the topic of AI. I know there are a lot of opinions on this, but here’s mine: Initially, it will help designers work better and faster, and we’ll have to adapt, sure. But the day will come (sooner than we think) when the work that previously required 10 designers can be done by just 2. It’s normal and natural. Why pay 10 salaries when you can pay only 2?\n\nFor all these reasons, I’ve decided that after all these years, although I love design, I’ve reached one of those moments where change is necessary. So, I’m switching careers. My father has a small company, and I’ll be working with him. It’s nowhere near as interesting as working as a designer, but at least I’ll have a clear goal and a job lined up. And who knows, maybe I'll discover a new passion.\n\nSorry if this sounds discouraging to some of you, but I wanted to share my story in this subreddit.\n\nThank you for reading, and I wish the very best to everyone in the same situation as me, still fighting the good fight.",
    "score": 258,
    "url": "https://reddit.com/r/UXDesign/comments/1il0sp2/well_i_give_up/",
    "created_at": "2025-02-08T23:25:43.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1knl6hq",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Got the job + tips from my hunt",
    "text": "**For context:**\n\n* 2 YOE with no recognizable names on my resume. Was a career changer, so no relevant degree.\n* Based in SoCal looking for hybrid and remote roles.\n* Applied to \\~50 roles over 2 months, got 3 first round interviews, landed 1 FT offer with a substantial pay bump that I accepted. Still in the process for the other 2 roles but will likely drop them.\n\n**The things that worked:**\n\n* Cold messaging the hiring manager for the role I applied to. Only did this for things I considered a great match. You'd be surprised how easy people are to find; if the job description states the team you'd be working on, odds are high you can find the right person. Paying for Premium so you can InMail them sucks, but I view it the same as needing to pay for a domain + portfolio builder. It's worth it if it lands you the job in the end. I kept messages short: context for why I was reaching out, highest impact achievement in past roles OR relevant experience that aligns with that role, portfolio link, and a thanks for their time.\n* Applying daily -- the earlier, the better. I looked on Linkedin and TrueUp.\n* Getting feedback on my portfolio. ADPList is still a good source if you aren't connected with more senior folks who can give you advice. I think this step made the biggest difference -- a couple of changes I made included rewriting my case study titles, reworking my hero section entirely, and adjusting my storytelling/pacing.\n* Really locking in for interview prep. I firmly believe that if you can land the first interview, you can make it to the final round. IMO, all the above is a waste if you're not willing to invest a ton of time here. All roles will ask for some form of case study presentation, so prep your slides and practice 10+ times before you get to the interview. Similarly, write out your STAR responses to common behavioral qs and practice saying them out loud. Be nosy about your interviewers and come ready with questions specific to the things they've worked on. Don't memorize a script, focus on key points and be able to casually talk through them.\n\n**General takeaway:**\n\nI was fully prepared for the job search to take much longer than it did. I think a fair amount of luck (paired with a lot of work) plays into the process, so don't be hard on yourself if you're not gaining much progress. Simultaneously, it's good to be critical about how you can improve and optimize what you can while recognizing that a lot is out of your control. Good luck to everyone out there!",
    "score": 248,
    "url": "https://reddit.com/r/UXDesign/comments/1knl6hq/got_the_job_tips_from_my_hunt/",
    "created_at": "2025-05-15T22:22:29.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1jmi8zx",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I used to be scared of Iterations. Now I love them. Just sharing",
    "text": "For a long time, okay, not a long time, but in my early days as a designer, I was terrified of iteration.\n\nI used to believe that my first design had to be it. The final design. The final solution. And if I had to change anything, that meant my first attempt was trash. It meant I wasn’t good enough.\n\nSo I avoided iterating. I held on tight to my first ideas. I thought tweaking or improving something meant I failed horribly \n\nBut as I grew in my career, I started opening myself up to the process. And you know what I realized? Iteration isn’t a sign that your first idea was bad; it’s proof that your ideas can get even better.\n\nWhen I was designing the new image picker for my product, I started with something super basic. But then I asked:\n\nWhat if this layout were different?\nWhat if I moved this?\nWhat if I played with colors or structure?\n\nAnd with every iteration, the design became something more refined, more creative, and something both my co-creator and I actually loved.\n\nThat’s what iteration does. It pushes you beyond your first idea and into possibilities you didn’t even see at first. It expands your creativity.\n\nSo if you’re designing something today, I challenge you:\nAsk “what if?” at least once.\nTry a different color, a different position, a different layout.\nLook at other designs—steal (ethically) from the best.\n\nYou never know what you’ll unlock when you let yourself explore.\n",
    "score": 248,
    "url": "https://reddit.com/r/UXDesign/comments/1jmi8zx/i_used_to_be_scared_of_iterations_now_i_love_them/",
    "created_at": "2025-03-29T09:02:22.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1kgj2qx",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Duolingo leader throws shade at r/UXDesign",
    "text": "You all might remember this thread a few months ago, [debating Duolingo renaming UX to “Product Experience.”](https://www.reddit.com/r/UXDesign/comments/1j3hvkw/duolingo_renames_ux/) The VP Mig announced this with fanfare on LinkedIn.\n\nOn the most recent [Dive Club podcast](https://www.youtube.com/watch?v=BVJUmJKrZKA&amp;t=355s), Mig and the host Ridd have some pointed words towards r/UXDesign  Here’s the relevant part of the transcript:\n\n&gt;Host: ...I was on an episode, and I said, effectively, I would not apply for a job that was UX designer, because that immediately communicates an old world way of thinking, and maybe at its core, the definition is correct, but it doesn't really matter because the perception has changed around those two letters, I think. \n\n&gt;Mig (Duolingo): I agree with you, and I think this is almost an uncomfortable thing to say in the industry, but I do think UX design is somewhat of an archaic term, and I think, I think it was Jakob Nielsen who went on my LinkedIn and said, you're wrong, and we should fight for you. \n\n&gt;Host: You got a Jakob Nielsen comment saying you're wrong. That's the gold standard. That's like, it doesn't get it at higher praise than that. \n\n&gt;Mig: And it's like, hey, thank you, I read your books, but also, I've also built product here with other people, and none of us resonate with the title UX Designer. \n\n&gt;Okay, so at Duolingo, we've never had the title UX designer, we've always been product designer. At Instagram, where I worked for three and a half years prior to Duolingo, it was never UX designer. It was always product designer. And the thing I, I'll like peel a curtains back on and hiring for consumer- facing companies, whether it's Instagram, Duolingo, Airbnb Coinbase, all my friends at other consumer companies, we almost get nervous when we have designers with UX designer titles come to interview because you're going to think about a few things, but not all the things, which as visual design, business metrics, building things with engineers. A lot of what UX design symbolizes or communicates to a lot of hiring managers is I'm pretty far from the work and I just want to do my end to end flow. You will never see a UX designer job opening at an Airbnb, a meta, etcera, because the product matters, and the title has been product designer for more than a decade, some of the most reputable consumer companies in the world at Duolingo expects to be one of those companies. \n\n&gt;Host: I appreciate you coming on and being willing to even talk about it, because it is something that I've been feeling, and it feels weird to say, you know, like It feels super weird. put it, yeah, putting it on the internet, you know, you're just invite Backlash, you know, my God, you post us on LinkedIn. Like, they'll headhunt you, you know? I hang out on the **UX design subreddit** from time to time, almost just because it's like a **window into the complete opposite world of Twitter,** really. Like, it's like, actually helpful to see that. **Okay, there's like this real bubble that's happening here and I don't know, just the other day, I felt bad.** Like somebody was coming on like 20 years experience and we shared a portfolio and basically was like, I cannot get a job. Why can I not get a job? I looked at the portfolio and, you know, there was a visual design bar that wasn't being hit, but it was the title was like, UI/UX accessibility. And I was like, you know, you're not going to want to hear this, but I think a large percentage of the industry is writing you off just from that way of defining yourself. \n\n&gt;Mig: I would double down and underscore what you said. I think having been a hiring manager for more than a decade of consumer companies, when we see job titles that say UI/UX, I go, do you know what you're doing? Yeah. Which is it? It is funny. The **UX design subreddit is maybe not the place you want to grow your career or learn**. In a lot of my peer groups and even on my team, at Duolingo, friends from Instagram, other companies, we also will kind of scrub through UX design **subreddit** or blind or other anonymous forums where, you know, you want to confide in your peer group, I **think where I have in all the wrong conversations in those places,** I think, you know, it's 2025 and people are still debating is it UI/UX? UX vs. UI? And it's like we’re all building products so. So when you're ready to talk about excellent prototyping, high visual design, really thoughtful design details, and then really understanding revenue, daily active users, all in the same conversation, come on over, you'll up your chances on getting a job at a big publicly traded tech company, if that is your goal. But there's still merit to that in startups where we care about revenue, metrics, but also craft. And so there's two worlds in the industry, the people that have the jobs that are doing the work and they're oriented around building products businesses and doing great things for users. And then there's the people that are on these **Reddits** going, what's our title or Here we go, another person changing the title. And it's like,Is this really how we want to spend our time moving our industry forward? And so I do encourage a lot of people to go there for entertainment value, but it's not learning value. \n\n  \n",
    "score": 242,
    "url": "https://reddit.com/r/UXDesign/comments/1kgj2qx/duolingo_leader_throws_shade_at_ruxdesign/",
    "created_at": "2025-05-06T23:31:29.000Z",
    "num_comments": 250
  },
  {
    "id": "reddit-1ll3pbv",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Just landed a full-time role after 1.5 years of job searching. AMA",
    "text": "I know how tough it is out there: crashing out daily, feeling not good enough, losing confidence with each failed interview, getting to final rounds multiple times and failing, thinking about quitting, finding second jobs, not knowing if I’m going to be able to pay rent in a few months…I could go on and on. After going through this long and seemingly endless journey, I want to use my energy to help others. So ask me anything! \n\nAdditional info:\n\n4 yrs experience, Fortune 500 company, Had 1 fulltime Product Design job before in Web3, Career switcher\n",
    "score": 242,
    "url": "https://reddit.com/r/UXDesign/comments/1ll3pbv/just_landed_a_fulltime_role_after_15_years_of_job/",
    "created_at": "2025-06-26T15:53:28.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1jz3yhv",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "¿Where do old UX designers go?",
    "text": "I am 48 years old. I spent the first 2 years of my career in graphic and web design, and the following 22 years up to now in UX, UI, and accessibility product design. Until 2023, I used to find work relatively easily, but with the crisis in the tech sector and the mass layoffs, I've been unemployed for 16 months. Although I've come close, I'm ultimately losing out to someone with less experience and who is younger.\n\nPerhaps it's time to pivot to less crowded areas like accessibility or creative front-end development using JavaScript or libraries like Three.js or GSAP, or perhaps it's time to teach, create courses, or maybe it's time for a complete change of direction.\n\nIt's ridiculous to think about studying for a new degree at my age; I'd graduate as a 50-year-old junior. The options I'm considering if I change careers would be: to start a company or work freelance offering design services doing digital marketing, web design, system design, and app design (although I know it's a saturated market), or to venture into unknown territory and explore how I could monetize my existing skills and experience.\n\nAny ideas, advice, or opinions you could give me?",
    "score": 219,
    "url": "https://reddit.com/r/UXDesign/comments/1jz3yhv/where_do_old_ux_designers_go/",
    "created_at": "2025-04-14T17:01:39.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1izt9ec",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I made it to final rounds with Shopify and they went with another candidate, here’s where I think I went wrong.",
    "text": "EDIT: Thank you all for your lovely, funny, and helpful responses. Greatly appreciated :)\n\nUPDATE: I reached out to the recruiter afterwards thanking her and asking for any feedback they might have to help me grow and she said you’re welcome! And declined to answer my question— oh well lol\n\n—-\n\nI made it through 5 weeks of interviewing with Shopify (a recruiter reached out to me on LinkedIn) and I just found out today they went with another candidate. It was a massive bummer. I did a recruiter screen, life story interview, portfolio presentation, and an app critique/ live designing session. \n\nIt was my first intensive interviewing process in 6 years (quit my job in 2021 to travel and work freelance and ended up signing on full time with one of my clients) so I was very rusty and had to go 0-1 with all of my materials and presentations. I spent an ungodly amount of time crafting my portfolio presentation and running through it but revisions done over time will make it better. It was good don’t get me wrong, but ultimately still a first draft. \n\nA little context: I’m a product designer with almost 8 years of experience. Ive worked as a visual designer, contributed to web, mobile, UI enabled hardware, and design system projects. I’ve worked as a freelancer and have managed simultaneous projects with different clients.\n\nHere’s where I think I went wrong: \n\n1. I was really nervous. Naturally. But I think it made me come across as more junior or less confident than I am in my skills. Only way past that is more experience interviewing and working on my confidence. I’m a strong verbal and written communicator but can tend to talk fast when flustered. I think a mistake I make is that in my insecurity I try to show a ton of detail and give really deep explanations. I imagine that the interview process is actually better served with more focused and impactful narrative rather that broad, sweeping stories. I also focused too much on personal experiences and not enough career experiences in the life story interview, I genuinely just misunderstood the prompt. \n\n2. I didn’t balance business impact with craft impact (driving framework level decisions, global design patterns, etc). I focused a lot on how my work drove business goals but I think I may have focused too much on this. In my next interview process I’ll be more balanced in my approach. \n\n3. I didn’t show a wide range of work. My portfolio presentation focused on two project from a job I had in 2021. Arguably some of my stronger work and my goal was to paint a detailed picture of my time at that company but I didn’t show a breadth of work from multiple points in my career. I have a wide range of experience but I didn’t illustrate that. \n\n4. I bit off more than I could chew with my app critique/ live designing session. I chose to critique a very complex mobile settings experience and did analysis of patterns at a global level, but as the majority of the session was focused on redesigning a specific flow I should have narrowed my focus and dug into the weeds a bit more with a narrower scope. \n\n—- \n\nOverall there probably other things I did “wrong” and at the end of the day the other person seemed to be a better fit for the team which I can’t argue with. Trying now to keep my chin up and start applying! I see that market is crazy right now so that makes me anxious but with each attempt I’ll get better, and eventually land something I love. ",
    "score": 214,
    "url": "https://reddit.com/r/UXDesign/comments/1izt9ec/i_made_it_to_final_rounds_with_shopify_and_they/",
    "created_at": "2025-02-27T23:07:33.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1nzed6p",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "What happened the last 12 month to Product Design?",
    "text": "I am ages in the market, in my job. I built teams, companies, were part of corporate and mid-sized companies. I drove Design Systems, I mentored and taught designers, I lead designers. I influenced products and created strategies. I measured, learned tooling and held big presentation. I spoke at conferences and universities. I worked in growth, in r&amp;d. B2B, B2C, B2B2C and so on. I am a hands-on product design lead and product strategist by heart. Not FAANG but good enough.\n\nBut what is happening right now? Am I getting old and slow or is the current time really weird? I cannot describe it the best but I have a feeling we become irrelevant and yes, for sure, we are moving with lightspeed into ai+prompt+designers. Still, the goals, the tasks and the challenges disappeared and everything feels bland and boring. Its not only that, its also the once the quality we wanted to deliver is not there anymore. Nobody is giving a damn anymore. Everything needs to be there even faster and everything I learned and taught about scaleable product development and design isn't a thing anymore, its like the past is repeating itselves and nobody learned from that. My motivation vanishes and a strange feeling of comfort and settlement started. Also complex tasks are easily solvable (i don't even know if they are complex anymore).\n\nI feel I am hitting rock bottom but I am trying to follow the Ai theme and still this theme is obvious to me. Figure Design Systems, figure how to connect it to all Ai tools, maintain the system, setup agents and rulings - figure culture around it, give these tools into the right hands an guide them to build solutions. Which let me lean back and see the world burn and thats where my mind figures, that we are becoming irrelevant and we are just trying (again) to keep our seat at the table(s).\n\nI feel I am about to switch careers and move into product fully, extend my frontend dev knowledge or really focus completely on Ai.\n\nThats not a rant, thats the very first time I am feeling lost.  \n  \nAnyone else feel that?",
    "score": 211,
    "url": "https://reddit.com/r/UXDesign/comments/1nzed6p/what_happened_the_last_12_month_to_product_design/",
    "created_at": "2025-10-06T09:26:53.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1kyc2s7",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Stating the obvious- the market is tough",
    "text": "I'm an experienced UXer with over a decade of experience, academic qualifications, etc... I've never worked for Google or the like, I wouldn't say I'm an absolute top person, but certainly on paper a few cuts above those who did a 2 week boot camp.\n\nI lost my job earlier in the year and had to find something new and...yep. What everyone says is right. Its not easy.\n\nI was in a similar position a few years ago of needing to find a new job and it was an absolute joke to find something then. I had recruiters knocking down my door, multiple interviews, I found something within a few weeks.\n\nThis time around it has taken me 3 months, and the job I've ended up with...it seems super interesting, so I'm happy with it, but its a huge drop in salary.\n\nThe whole application experience has been quite painful. So many automatic robot rejections for jobs I could do in my sleep. The most annoying thing were the two cases where I was offered an interview and then ghosted about arranging a slot.\n\nAnother annoying thing are the amount of jobs where they insist on someone local even if they're highly hybrid- I'm willing to travel 2 hours twice a week, the trains are reliable and frequent, why is this an issue on your side? The journey will be quicker for me than for many living on the other side of the city.\n\nIt seems very much like when I was job hunting a decade ago, back when UX jobs were few on the ground. Really hoping this is just a blip whilst they take time to realise AI looks good but scratch beneath the surface but really its just stylish guessing.\n\nAnyway. Here's one of those stereotypical s{w}ankey diagrams (I know, not the prettiest example) showing my journey.\n\nChin up to those facing the same. Anyone else had this ghosting before the interview is even arranged? 'tis bizzare. \n\nAt least this time around no post-interview ghosting, which is a pleasant surprise.",
    "score": 158,
    "url": "https://reddit.com/r/UXDesign/comments/1kyc2s7/stating_the_obvious_the_market_is_tough/",
    "created_at": "2025-05-29T14:23:05.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1kwhy6q",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I fold. Ignore user testing results and followed the CEO’s suggestion.",
    "text": "Designing on a feature, designed A and B study. One is designed based on research, Study B is by the CEO’s suggestion.\n\nPrototyped. Made a user testing feedback sheet. Got results from users.\n\nBoss wants to still go for his suggestion. Kept advocating the other. For a while, design team is just sitting on it cause we cant hand ir off to development without final approval. \n\nHanded off the V1 to developement today. Guess which design we handed off? Yup the boss’s suggestion. 🤦🏻‍♂️\n\nEdit: Yes I know he pays my salary, thats why I folded. Im aware that part of the job is to make stakeholders happy. Ego scratched nah, but a bit frustrated cause even if there’s data to validate a product decision… at the end it doesnt really matter. ",
    "score": 146,
    "url": "https://reddit.com/r/UXDesign/comments/1kwhy6q/i_fold_ignore_user_testing_results_and_followed/",
    "created_at": "2025-05-27T08:18:05.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1jw1sxi",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "How a rejection turned into a job offer",
    "text": "I know that I was luckier in my job search than what most of you experience in the current market, just wanted to share some positivity.  \nToday I got the offer and the contract plan with a 40% salary increase in a seemingly much better environment than I'm working in right now. \n\nHow I got here in 2 months:  \n  \n\\- the market here is slightly better than I see anywhere else, not a lot of senior designers are free, or looking for new opportunities  \n\\- I invested in my job search right away by getting feedback while building my portfolio through consultation. I always struggled to create anything for myself I needed an experienced outside eye.  \n\\- As I had a job still I only applied to roles that I thought would be an improvement not only salary-wise but in the environment, work-life balance, and growth path as well. I'm confident in my knowledge and the value I can provide in these roles so I knew what I was looking for.  \n\\- I used AI heavily to help me write cover letters, emails, optimize presentations by company and by role. Can I do these in a good quality by myself? Yes. Do I have the time or energy to anxiously draft a customized cover letter for an hour for every application? No.   \n\\- On this particular role that I really wanted and liked, I got rejected the day after I applied. I reached out to their HR saying that I understand but if they can provide me some feedback I would really appreciate it. After a week it turns out that some of my screening answers didn't go through their system and I automatically got rejected. They called me back saying they looked into it and seeing my CV they wanted to invite me for an interview. This company had the most transparent communication throughout the process, their expectations were well defined and clear, and they always kept the timelines they explained ahead. This is the proof that there are companies like this out there.  \n  \nI don't know how you can do this for 6-12 months or more. My hats off to you, truly.   \nEven after crafting my portfolio and CV for weeks, spending days preparing for technical interviews and presentations my batteries are drained next to my day-to-day work where I'm heavily burnt out. My mental and physical health will appreciate this change.\n\nGood luck to everyone, and just hang in there!",
    "score": 141,
    "url": "https://reddit.com/r/UXDesign/comments/1jw1sxi/how_a_rejection_turned_into_a_job_offer/",
    "created_at": "2025-04-10T16:15:38.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1nmjqiy",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "New company",
    "text": "After about a year and 3 months I’ve finally landed a new job with a new company and a $40k salary increase, I also get to stay remote with awesome benefits. I almost cried when I got the unofficial call from HR to offer me the position. I’ve really wanted to celebrate but I feel shitty because I have several friends looking for jobs at this time with no luck and I just don’t want them to feel like I’m rubbing it in. Also here to say, it’ll come eventually-I about fell into a depression at one point during my search and I’m so happy it’s over. I’ve been underpaid, over worked, and treated terribly with my old company that I was with for about 3 years, it got to a point where I was trying to figure out if I could pay my bills and survive with a side job if I decided to quit but I’m just thankful and ready for my new start. ",
    "score": 131,
    "url": "https://reddit.com/r/UXDesign/comments/1nmjqiy/new_company/",
    "created_at": "2025-09-21T05:32:33.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1ipepoz",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "\"Your Master's Degree Doesn’t Count\" – A Job Interview Reality Check",
    "text": "During my interview last week, my Master’s degree in UX Design from Rutgers University was essentially dismissed because it didn’t align with my Bachelor’s degree in Biology and Psychology. I had initially pursued dentistry but later switched careers, earning a Master’s in Business &amp; Science in UX Design.\n\nThe interviewer claimed my Master’s wasn’t “real” because it didn’t follow the traditional six-year academic path (four years for a Bachelor's + two years in the same field). As a result, they said they wouldn’t consider me a Master’s graduate or offer the corresponding salary, instead pushing the lowest possible payment. They also took issue with the fact that I graduated in December 2024 instead of the summer when students usually graduate. Is this a common red flag during interviews? I didn't think the semester I graduated in would be a red-flag but I'm starting to feel very insecure about that.\n\nAs the interview went on, I realized these were just tactics to undermine my credentials so they could low-ball the salary. But now, I can’t shake the paranoia—will all companies invalidate my Master’s degree? If I studied UX for only two years, does that mean employers will just see it as an Associate’s degree and not as a Master's? And why did they scoff when I mentioned my Psychology background from my Bachelor's, as if it held no value in UX?\n\nI was applying for an entry-level position, yet they treated my degree as a joke and questioned the UX experience I've had from my internships and part-time. I know my experience is limited and I have no full-time experience, but I’ve still interned and worked as a contractor across multiple companies as a UX designer—from a construction solutions company to a non-profit, a startup, and now an AR/VR lab.\n\nEven more frustratingly, they refused to believe I worked with developers, data analysts, and project managers at the Crohn’s &amp; Colitis Foundation, a non-profit. They claimed non-profits don’t have developers or CTOs (???), forcing me to defend my own lived experience. I even mentioned that some developers were outsourced, yet they kept trying to discredit me. Why? What was I even trying to prove at that point?\n\nThey spent so much time invalidating my education and experience that they never asked me a single UX-related question—and I spent so much time preparing and brushing up all my UX concepts prior to the interview. It felt like a slap in the face. What’s worse, this company has won multiple awards for being a “Best Place to Work” and a “Fastest Growing Company.” If an “accredited” company treated me like this, will others be the same too?\n\nI know I don’t have years of experience, but again, I was only applying for an entry-level role. This experience has left me feeling insecure, upset, and genuinely worried about my future in UX. Is this what it will always be like?",
    "score": 128,
    "url": "https://reddit.com/r/UXDesign/comments/1ipepoz/your_masters_degree_doesnt_count_a_job_interview/",
    "created_at": "2025-02-14T16:39:15.000Z",
    "num_comments": 196
  },
  {
    "id": "reddit-1kbgyke",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "The market is bad but employers really shouldn't do this",
    "text": "Within 6 months of time frame I've experienced:\n\n- An employer who preferred to go for an offshore option for cheaper salary after showering me with compliments.\n\n- An employer that had 6 stage interviews, took me 1.5 months of presentations, research into their teams, and after the great final interview, completely ghosted me.\n\n- An employer who gave me a job offer(this was one of the major corporates in my area), and while I was waiting to sign the paper, the team was told that the position is no longer available since they were told to wait indefinitely. (If the budget wasn't approved, why did they do the interviews?)\n\n- And 3-4 more employers that ate up 1 month of my time, each time, and basically ghosted me with 0 feedback even when I politely asked for it.\n\n\nI'm so done. I don't know what I've been doing for the past 10 years in this field... Yes I'm keep getting to the final stage but it's so exhausting to fail over and over at the last stage. I don't know how everyone else is able to do this..\n",
    "score": 125,
    "url": "https://reddit.com/r/UXDesign/comments/1kbgyke/the_market_is_bad_but_employers_really_shouldnt/",
    "created_at": "2025-04-30T13:47:55.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1nl6qx8",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Laid off on mat leave... plot twist! Got renewed AND promoted!!",
    "text": "Original Post: \n\nHi everyone, [I posted here a little while ago](https://www.reddit.com/r/UXDesign/comments/1mzyu7g/laid_off_while_on_mat_leave_the_evil_american/) feeling completely heartbroken after being laid off while on maternity leave by the \"Evil American Corp\" that acquired my company.\n\nWell, I have a wild update that I couldn't have seen coming.\n\n**The TL;DR of my last post:** Was on mat leave, got the axe from EAC because my contract was ending in October. They destroyed our amazing 4-day work week culture and I was devastated to lose my dream team.\n\n**The TL;DR of this post:** MY CONTRACT WAS RENEWED FOR A YEAR AND I WAS PROMOTED TO UX/DESIGN LEAD. I am in shock.\n\nHere’s what happened:\n\nAfter I got the BAD news, I started to come to terms with it. I downloaded all my work, started writing my farewells, and began the brutal job hunt. I was set to finish in October.\n\nThen, two weeks ago, my (soon-to-be-former) Team Lead messaged me. He found another job and was leaving! He told me a Friday.\n\nThe *very next day (*Saturday), my boss DMed me on Instagram (again!) saying she needed to talk. My heart sank. I thought it was more bad news, maybe they were terminating my contract early.\n\nI was completely wrong.\n\nShe asked me, point blank, if I would even *want* to stay if they renewed my contract. I was so shocked! I immediately said YES!\n\nThe formal offer came through last week. Not only did they renew my contract for another full year, but they promoted me to **UX/UI Design Lead**.\n\nThe reaction from my  team and some higher-ups has been incredibly warm. A lot of people knew about the non-renewal and were apparently upset about it. I've gotten so many \"Congratulations!\" and \"This is so well-deserved!\" messages.\n\nBut I have to be honest, and I know you all will get it... my feelings are so mixed.\n\n**The Relief I feel** **is Immense.** The pressure of job hunting in this market with a new baby is gone. \n\nSo thankful to my boss for fighting for this and for the heads-up initially.\n\n**Imposter Syndrome is hitting hard**. This feels less like a \"merit-based promotion\" and more like a \"right place, right time, please don't leave us with no one\" scenario. The role was empty, and I was a known quantity.\n\n**The Whiplash I'm feeling** going from mourning a job to leading the team in a matter of weeks is a lot to process.\n\nThe cynical part of me knows EAC just needed to fill a critical role fast and cheaply (I'm sure I'm cheaper than hiring externally). **And it definitely feels cheap. This promotion came with more responsibility but not a raise. I haven't had a salary increase in two years.** But the optimistic part of me is choosing to see it as them finally recognizing my value, even if it took a crisis for them to see it.\n\nI'm still going to keep my LinkedIn updated and my eyes open, but now from a position of strength instead of desperation. I have a year, a new title, and a chance to prove to myself that I *do* deserve this.\n\nThank you to everyone who offered such kind words and support on my last post. It meant the world to me when I was at a real low point. This community is amazing.\n\n**New TL;DR:** The Design Lead quit unexpectedly. The company panicked and not only renewed my contract but promoted me to his job. I'm grateful for the security but dealing with major imposter syndrome after such a rollercoaster.",
    "score": 121,
    "url": "https://reddit.com/r/UXDesign/comments/1nl6qx8/laid_off_on_mat_leave_plot_twist_got_renewed_and/",
    "created_at": "2025-09-19T15:31:37.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1miqp3r",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "How UX Engineering changed the way we deliver",
    "text": "# Introduction\n\nI'm a UX Engineering manager at a mid-large sized SaaS company. While we have a high turnover &amp; have always been profitable, we're lean in terms of employee count (for a business this size), and this includes my team that handles the product user experience.\n\nBesides this role, I'm also the CTO of a small venture (\\~15 employees).\n\nAfter some of my recent comments, I have received many DMs, direct responses, (and some hostility) related to UX Engineering, and I thought of writing this post to touch upon some frequently asked questions.\n\n# Who is a UX Engineer (for us)?\n\nI believe this is the one that needs clarification first, because this term is misused quite often. I'd like to double down on what a UX Engineer working in my team is like - they're not someone with mediocre product design skills, or mediocre frontend skills. **Each one of the UX Engineers in my team equals or surpasses the skills of a senior product designer AND the ones of a senior frontend developer.** Our salaries and benefits reflect this insurmountable ask. This team helps us do what would normally take 3x-4x the team size in a traditional setup. The addition of generative AI when relevant and with a clear benefit, facilities our workflows even further.\n\nUX Engineers in my team can:\n\n* Collaborate directly with product managers, C-suite and directors on product direction.\n* Prototype complex, high-fidelity interactions and workflows directly in code, that traditional design tools cannot adequately express.\n* Build for performance, scalability, and accessibility from day one.\n* Possess deep expertise in accessibility standards, technical limitations, and usability.\n\n# Our Tooling\n\n**Figma plays a very minimal role in our workflow**. There are days when we don't even touch it. We are actively looking towards transitioning to [Penpot](https://penpot.app/) for the few times we need a design tool, because an open-source, open-standard tool with no lock-in aligns better with our values.\n\nAt the core of our workflow is our comprehensive design system, characterized by:\n\n* Fully accessible (WCAG-compliant), a core business requirement.\n* Dynamic theming, also a business requirement. Our solution needs to be deployed for our clients with their respective branding.\n* Built to prototype fast, with real data, and real constraints.\n\nWe haven't updated our Figma component library in ages. Ours is a living &amp; breathing system that’s designed to run in the environment that our users actually interact with, as opposed to being a static design library. What matters to us is how the user experiences the end-product, and not to improve the quality of our mockup files.\n\n[Here](https://www.meshdesignsystem.com/playroom/#?code=N4Igxg9gJgpiBcJgHoBUACAIjANjALjOgIY47r4AWAlgM4UToDmB6t%2BxAToVOoLwbgWR30qZAF8AOgDspAHgDKMMPmoRpkgLbQYAXnEhS%2BPVIBGxMAGsmnCAFdJUXSFgAzYjZyGQU5xE4wrtvaOLm4eRpKQkhzUkjCcAOrUUFSOklzWAO7hAHyychwWbAAOZjrAwOgAHrTw6AAsADTo6lC1AGzooqK5kujoMgBCEJVSfX2mFgF2Dnq0NpyuYDAACtbqMTBR4WPoPn5TQXoh7p6jYyVQUDFM2sBtEr1jxr6wnPkAnniOtBA4SdtPF5xADCv18jhYUTwAPGQISSRSemcGxh6GenFeACViFcbLRvhx7FwoKjnpU5JQcRAMgTiESMQCejt5AVzMVSrc6t0zsyhpUKDBKvgAIJ-JiSW4Vaq1PRLKJxPRNFoykB4ZyeTrcx47PoyAASxCKRXeoPURRshE4AHFOIaaGAAJKRdDIJk6mTIPlu5l6mA465sagALzKUpq6AAzErWugAEya9CQM2qTb4RyUACMem9OviuCTRHwjGWOGI72sEHUPLGHt9-skTB61d1oONgZDjlLnBY2ebY1WECL%2BHeRSIST99DxAaoRGc7nIAFkYLRKInK0UU1F0H9jLbOO8SPZ0DF2HT8Dh3n2%2BiuuER3rZOOgMr42RlqFR0Pf5gLiOoAHR9h6rbvE22o1sBOY7AAopURQ4L4RB%2BLQG6SLQ1AAG5EMYMCUuhKiPnSvC0DARCUNSn4PugACqDokFAhr4PQZjWLQtBXs0JzUHBWG2vYtAAWBurIBBUiAas1DqFw7wDBaRaSNkVqsKe3AwFAHriZJ%2B4yfgck5h6%2BRmOYboel6omPIMwzVhMljWNM3zzIsMCohcVwNrc9xWXCHxfLMvz-F4YHoq8oLwZwEKptCAU7EFcSJMklCOMisSknC2K4visyEvRDJRYC5KUlA1K0vSJK5XpBmFMhHLAFykH9HWrlMO2ZS1QAijY1CFMoRS0LWfqNaBOr9CFNjqKh7JLLcACsojoJh3CdaQorUOKjhypavaCeBvyjb0b7xWtqiEFsIB1cywqXHI7zsDA6hOqoLpnf0wk7WNT0yCNb3sS2EDGk9OxUcR-TmMYUDZIAGMQeiDYMANQyND2QANJQ6D2QMOgv2bBQlBEBZOBg3IkhcaOjEmb8YPAHo6B6A8Q1DSUsTkIR6BQNYRTHr0RR%2BMYHUeGi8EWPQEDOGusACXTNYvX97FAa98mAS9OC7bQg3upgGHjo%2BrpmUNH1y-QVWTcAM1zXEyhgEtYoSrKqYKqdMufXtCIJbKR2pptEu6goOnXLQV03Xdzra1tQmO%2B9YffcNv0gZHfTLNScToHicQAPzoDBcEIc0WeUvYB7mDA7zPMSbBkdwYAWvQMSUyA1MgLTnu6kM%2BPZN7ygNr1nrk9k4ue7L0sh89EdbbLStjSrOtqxrryPZPzKOwbJRGyb83m5bK3W%2BAtucB7dN62PTsHa78onf9-QUre-uEIHD3BxLo%2B7eHctnyyhkTWUsZao3P0D9-YwAJqUQAFJyAABqixgE0SIyImDzFUmiXiUBaBNGZrQMAfgsZoRDExPwJAyCxyeMQAuvAYhFmxkQKimIAAy6BAAoBM0IhAZ3zoAnAeMhN5cFfkfIKMwhhB702sEOEcMBe6N37jHfh21f5-3QMKSQB5VLvnoOgv0hASDoFiBkbcMRzBNB%2BCw%2Ba95YiJjpCw2CoUiCEQIX0d8cRiBqJiLAUc9gIrvFEX3KWEixHIAqkZGWitH4KwXnpHxrJjJd0qKrCy-IXLXD1L4YMR1SDuS-lIg8WCdCzEkvg%2B2W1hRMRwBkMsyD0B%2BDMKuWw%2BAObkJrnXBuzIqE6PQJQPwzh0w6R6vAZAyAibGHfH%2BWgpYLB-iTMgMAudGa0GQOoZclBswAGIZkrg9I0yQRlak0z7OMukjNjwiy-BokivA6QHhxjgIo7jxHhNMpIfSYTZA%2BMUMoVQ2QQANBADOJZCAADa%2BhfzUDeX8yQQZAWGmoMQUFeJ8C2j%2BHSBQRNfC0EBZADggLFGAp8NMexKhJCAtgYCiSdICUNkBb00laFAW%2BD6fgAchAlCAq5p1XAGxAUAEczzECRe8spOBAVzAiL4IogLlBQEBc%2BTg%2BMABylYcRIoALrvP2lQJF8BvkRljAABjlaIIAA) is an example of what my team members and product managers have access to. This was our inspiration and starting point, but we have now evolved our internal environment to make it easier for our product team to use, like integration with on-premise LLMs.\n\n# Code as the Single Source of Truth\n\nBecause our design system lives in code, we skip a ton of noise. There is no:\n\n* \"Can you check with the dev team about this UI?\"\n* \"It looks different in Figma\"\n* \"The feature looked good in concept, but poor after implementation\"\n\nEven user testing improves: our test subjects see real UIs, not idealized prototypes. With a data-heavy product, this realism matters. Our customers evaluate the value of our product based on how it represents their data.\n\nWith a team like ours, we can eliminate handoff conversations, avoid miscommunication and technical misinterpretations, and identify feasibility and edge cases early in the cycle\n\nThe result: tighter feedback loops and faster, more reliable releases.\n\n\\------\n\n⚠️ Parts of this post were written with the help of generative AI\n\n----\n\nEDIT:\nWhile I'm not going to respond to every bad faith argument in this thread, I'll bring in some clarifications:\n\n1. \"You're skipping Figma, which means you're skipping the design process\": Clearly missed the point. Using Figma isn't the equivalent of having a design process. Our canvas is in the final medium itself. We do have saved files, versioning, documented projects, etc. like a \"Figma\" designer would.\n\n2. On what our UX Engineers are capable of: when I mention they can equal or surpass FE devs and product designers in senior roles - they're not someone with surface level understandings of these topics. I can trust them for advice on FE and product design. \n\nIf this fact and this post offended you to a point where you chose to be hostile, I'm glad it did. People with better skills are paid better, especially in a tough job market. Deal with it.",
    "score": 121,
    "url": "https://reddit.com/r/UXDesign/comments/1miqp3r/how_ux_engineering_changed_the_way_we_deliver/",
    "created_at": "2025-08-06T00:48:34.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1l4zx1g",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "My Former Fintech Laid Off Its Entire Design Team, Now 'AI Interns' Are Handling Many Roles – Is This the Future of UX",
    "text": "This post is a little bit of me venting, but also sharing a stark realization. We all know AI is changing everything. However, the speed at which businesses are cutting UX/UI roles and slashing salaries is shocking. This morning, I learned, via LinkedIn, that my former fintech company—after laying off their ***entire*** design team and half their developers—hired '*AI interns*' months later. It feels like a massive pivot.\n\nIs this what companies truly see as the future, or a worth-a-try gamble? How much can we in UX survive this chaotic wave until companies figure it out?\n\nAt our core, we're human-centered designers. We empathize, predict human behavior, and drive business goals. I don't think AI will replace us completely, but our numbers are changing exponentially. Instead of full teams, companies might want just one researcher or product designer skilled in AI tools.\n\nWith over 10 years of experience, including recent AI courses, I've been laid off twice in the last two years—both times due to huge design department cuts or outsourcing overseas. This is the worst job market I've seen in years, and I'm finding even contract wages are down 20-30% from what was posted a year ago. I feel like I’m in a vast ocean with lots of us stranded on makeshift rafts.  \n\nMaybe it's time to pivot. Should I swim to a different shore, and if so, where?",
    "score": 111,
    "url": "https://reddit.com/r/UXDesign/comments/1l4zx1g/my_former_fintech_laid_off_its_entire_design_team/",
    "created_at": "2025-06-06T18:36:04.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1nv1drx",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "[OFFICIAL] Salary Sharing thread for UX Professionals — October 2025",
    "text": "**Credit goes to the mods of** [**r/cscareerquestions**](https://www.reddit.com/r/cscareerquestions) **for the inspiration for this thread.**\n\n**Mod note:** This thread is for sharing recent offers/current salaries for experienced UX professionals, new grads, and interns.\n\nPlease only post an offer if you're including hard numbers, but feel free to use a throwaway account if you're concerned about anonymity. You can also genericize some of your answers (e.g. \"Biotech company\" or \"Major city in a New England state\"), or add fields if you feel something is particularly relevant.\n\n**How to share your offer or salary:**\n\n1. Locate the top level comment of the region that you currently live in: North America, Western Europe, Eastern Europe, Latin America, Australia/NZ, East Asia, Southeast Asia, Africa/Middle East, Other.\n2. Post your offer or salary info using the following format:\n\n* Education:\n* Prior Experience:\n   * $Internship\n   * $RealJob\n* Company/Industry:\n* Title:\n* Tenure (length of time at company):\n* Location:\n* Remote work policy:\n* Base salary:\n* Relocation/Signing Bonus:\n* Stock and/or recurring bonuses:\n* Total comp:\n\nNote that you only need to include the relocation/signing bonus into the total comp if it was a recent thing. For example, if you’ve been employed by a company for 5 years and you earned a first year signing bonus of $10k, do not include it in your current total comp.\n\n**This thread is not a job board.** While the primary purpose of these threads is obviously to share compensation info, and discussion is also encouraged, this is not the place to ask for a job or request referrals. Failure to adhere to sub rules may result in a ban.",
    "score": 106,
    "url": "https://reddit.com/r/UXDesign/comments/1nv1drx/official_salary_sharing_thread_for_ux/",
    "created_at": "2025-10-01T07:01:03.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1iya277",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Contemplating career pivot. Anyone make the leap away from UX?",
    "text": "**Considering a career change. You? What have you moved into?**\n\n\\---\n\nAfter 15 years in design, and 10 years in SaaS I've been an IC, a manager and a volunteer mentor. I've worked on 0-1 products/platforms as a sole IC, and have managed 300-person x-functional programs to build and launch new products and design systems. \n\nLast year I stepped away from my well-paying job, to take a sabbatical. On top of working long hours and being on Zooms to accommodate a global team, I had three major surgeries and a lot of PT as a result of some sports injuries.\n\nI was tired. I was burned out, but I was confident I'd have no problem finding a job when I was ready to return to work. I've got a good portfolio, a track record of success everywhere I go, and long list of testimonials from direct reports, peers, and C-Suites.\n\nBut alas… here I am 9 months later and my savings account runway is dwindling. \n\nIn today's world, there's an extreme apathetic ownership/management mindset towards employees, a focus on building/shipping fast over quality, and advancements in AI that are replacing many of our jobs. Not to mention, companies are still finding ways to layoff people in droves. \n\nHell, just a few weeks ago [Meta did another lay off, then decided to approve salary increases for executives](https://www.cnbc.com/2025/02/20/meta-approves-plan-for-bigger-executives-bonuses-following-5percent-layoffs.html). WTF?\n\nI really love product design and working in tech (most of the time), but I feel like the writing is on the wall given the state of the industry that UX jobs are not going to bounce back. The rise of AI, and the overall macro economics of our world with rising costs and stagnate wages would suggest as much. \n\nHas anyone pivoted career paths or is considering it? I'd love to hear from you!",
    "score": 91,
    "url": "https://reddit.com/r/UXDesign/comments/1iya277/contemplating_career_pivot_anyone_make_the_leap/",
    "created_at": "2025-02-26T00:07:53.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1ni9qu9",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "I don't think I'm cut out to be a leader",
    "text": "Hi everyone, this is all very fresh so pls excuse me for sounding so panicked.\n\nI've been working at a large video game company for about 4 years as a mid-level UX Designer. A few months ago during our quarterly reviews I got feedback basically saying I'm not doing the level of leadership expected of me and I've got to show change immediately. They summed up their expectations in an email afterwards.\n\nFor context, our former design lead was promoted to a managerial position, leaving the spot open. As the next designer in line in terms of seniority, I was pushed into the design lead role for our team. Slight salary increase, no title change.\n\nAfter getting that initial feedback, I locked in. Followed the list of expectations, did more presentations, posted more in Slack, spoke up more in meetings, etc etc. Other leads said I was doing good and to keep it up! I was feeling so confident. \n\nFast forward to my performance review today. My manager told me that while they were seeing bits of improvement, it wasn't quite there yet. Now I had to \"rapidly change\" by November or else be put on a PIP (which from my understanding is basically on the path to being fired).\n\nGetting that feedback was so discouraging. I felt like such a failure and just cried and cried after the google meet call. Then the panic set in. Before getting this job 4 years ago, I had been unemployed for about 6ish months. Back then I was literally a day away from using up all my savings. I wouldn't have been able to pay rent if not for the job offer I got the next day. The thought of going through all that again made me dry heave. \n\nI know I'm very lucky to be in the role that I'm in at the company that I'm at. Getting this job was truly a gift. It helped me rebuild my savings (even in my HCOL city), gave me the flexibility to work from home and overall changed my life for the better. I just don't think I have the personality to be a proactive leader. At least not the kind they want me to be.\n\nI know the job market is shit right now so I'm gonna do everything I can stay here, I'm not giving up yet! I guess this post is part rant, part cry for help 🥲\n\nI'd appreciate any insight, advice, anything! Thanks for taking the time to read all this. \n\n\n",
    "score": 71,
    "url": "https://reddit.com/r/UXDesign/comments/1ni9qu9/i_dont_think_im_cut_out_to_be_a_leader/",
    "created_at": "2025-09-16T06:13:55.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1k3m5fe",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Been in product design 9 years (5 remote). What do you want to know?",
    "text": "Hey everyone — I’ve been working as a product designer for 9 years, and for the past 5 I’ve been fully remote at a bootstrapped company.\n\nI’m thinking of starting a YouTube channel to talk more openly about this stuff — like what the day-to-day actually looks like, what it’s like working remote as a designer, how to break into the field, job hunting, negotiating salary, etc.\n\nCurious: what’s the stuff no one tells you about product design that you wish you knew? What would you like me to cover?\n\n",
    "score": 70,
    "url": "https://reddit.com/r/UXDesign/comments/1k3m5fe/been_in_product_design_9_years_5_remote_what_do/",
    "created_at": "2025-04-20T13:07:05.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1hqykdx",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "[OFFICIAL] Salary Sharing thread for UX Professionals :: January 2025",
    "text": "**Credit goes to the mods of** [**r/cscareerquestions**](https://www.reddit.com/r/cscareerquestions) **for the inspiration for this thread.**\n\n**Mod note:** This thread is for sharing recent offers/current salaries for experienced UX professionals, new grads, and interns.\n\nPlease only post an offer if you're including hard numbers, but feel free to use a throwaway account if you're concerned about anonymity. You can also genericize some of your answers (e.g. \"Biotech company\" or \"Major city in a New England state\"), or add fields if you feel something is particularly relevant.\n\n**How to share your offer or salary:**\n\n1. Locate the top level comment of the region that you currently live in: North America, Western Europe, Eastern Europe, Latin America, Australia/NZ, East Asia, Southeast Asia, Africa/Middle East, Other.\n2. Post your offer or salary info using the following format:\n\n* Education:\n* Prior Experience:\n   * $Internship\n   * $RealJob\n* Company/Industry:\n* Title:\n* Tenure (length of time at company):\n* Location:\n* Remote work policy:\n* Base salary:\n* Relocation/Signing Bonus:\n* Stock and/or recurring bonuses:\n* Total comp:\n\nNote that you only need to include the relocation/signing bonus into the total comp if it was a recent thing. For example, if you’ve been employed by a company for 5 years and you earned a first year signing bonus of $10k, do not include it in your current total comp.\n\n**This thread is not a job board.** While the primary purpose of these threads is obviously to share compensation info, and discussion is also encouraged, this is not the place to ask for a job or request referrals. Failure to adhere to sub rules may result in a ban.",
    "score": 68,
    "url": "https://reddit.com/r/UXDesign/comments/1hqykdx/official_salary_sharing_thread_for_ux/",
    "created_at": "2025-01-01T08:01:27.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1hqp32k",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "How I took charge of my own career in 2024",
    "text": "Hey everyone. As 2024 comes to a close I’m looking back on how it went for me. What a year!\n\n* I quit my management job but stayed with the company\n* I chose to become more specialized (in information architecture) and carved out a role that is way better suited to my strengths and the work I love to do\n* I helped to hire my own boss\n* I finally (finally!) decided to stop trying to resist or escape the things I *don’t* want, and pursue the things I *do* want in my career\n* I also recognized the toll that stress was taking on me, my health, my family, and the life I want to live\n\nThose are the positive, happy things. It’s easy for me to talk about what went well, but I’m going to get out of my comfort zone and share more of my story in case any of you find it helpful, encouraging, or - I suppose - just entertaining.\n\n# Behind the curtain\n\nOne year ago…\n\n* I was completely stressed out in my job (and life, for that matter)\n* I felt stuck in a (management) role that increasingly seemed like the wrong fit for me\n* I blamed myself for accepting that role and being overly optimistic about my ability to thrive in it\n* I thought I might have to quit my job to figure it out and get some relief\n* I was just coming back to work after taking a leave for the birth of our third boy, and found myself dreading the prospect of returning to my job\n* The pressures of providing for a growing family while working from a home office that seemed to just barely keep the noise and chaos at bay long enough for me to get settled into my desk for a few precious moments of focus… only to be distracted by another PTO request, manager training session, software license issue, random Slack thread, and then OMG it’s 15 minutes into my lunch break!… you get the idea\n\nLast December and January were perhaps the lowest point in my career.\n\nSometimes I wonder if I would have been better off skipping everything between late 2022 and early 2024… Maybe I could just fast-forward through that part? But, honestly, I wouldn’t trade that experience for something easier even if I could.\n\nIt shaped me in ways I couldn’t have predicted.\n\n# The early years\n\nTo give a bit of background, I’ve been a professional designer for 16 years. My parents encouraged my artistic talents from an early age and for a while I planned to be a full-time artist. That dream fell apart around the time I turned 18, but my dad encouraged me in a new direction — design. From there, I spent a few years doing graphic design, then web and software design, dabbling in code but keep my sights on a long-term career as a designer.\n\nFull disclosure: I never got a college degree of any kind, I just went into the workforce and began learning on the job.\n\nI consider 2011 to be the year I officially became a UX Designer; not because I got a certificate or any kind of special training, but rather because I began doing user research and thinking about my work in a much more user-centered way.\n\nMy UX sensibilities developed a lot over the next decade. I spent 7.5 years working for a major home improvement retailer, led a number of projects and internal initiatives, and was promoted, demoted (for reasons I agreed with), helped to hire my own boss, held informal leadership roles (i.e. without a title to designate me as an official “leader” or “manager”), and developed a lot as a professional and as a person.\n\nI had gone from being an aspiring artist to becoming a UX designer, drifting along in the career equivalent of a “lazy river”, with no particular plan for where I was going or how to get there. I’m not complaining! I was blessed with a number of remarkable opportunities and I’m thankful for all of them.\n\nHowever, I can’t deny that I had shifted from pursuing my career on my terms — chasing my dreams, and cultivating personal ambition for how I wanted to work and live — to passively accepting what others offered me.\n\n# Management\n\nFast-forward to the end of 2022.\n\nMy boss quit, unexpectedly. I had recently been installed in a “team lead” role so I was a natural candidate to step into management. The UX team needed stability and I felt a strong sense of obligation toward them.\n\nThe problem was, I had said for years that I *didn’t* want to do this. I didn’t want to be a manager. It wasn’t just a lack of interest, it was a strong *disinterest*.\n\nIn spite of my misgivings, I sought advice from others and became convinced that I should give it a try.\n\n“After all,” I thought, “what’s the worst that could happen? If it doesn’t work out I can just go back to what I was doing before.”\n\n# The “gap”\n\nEarly 2023 is when the stress began.\n\nI asked myself this question: can I do this role right now? Then I broke it down into three parts:\n\n1. I - My personal ability to meet the demands of the role\n2. This role - The actual demands of the role\n3. Right now - Is now the right time for this — given my stage of life, my family's stage of life, and the slow-and-steady career growth trajectory I feel I need to be on right now\n\nWhen I shared this with my boss (yes, we began discussing it shortly after I took the management role) I laid out a timeframe for me to arrive at an answer to that question: can I do this right now?\n\nI asked for her help to clarify the *actual* expectations of the role, knowing that my expectations were probably off. The idea was not to make the role easy, but to make it clear. Maybe I was overcomplicating it? Maybe I had made it harder than it actually was?\n\nMeanwhile, I said I would work on myself to improve my personal ability to do the job.\n\nhttps://preview.redd.it/tng33ivb99ae1.png?width=1806&amp;format=png&amp;auto=webp&amp;s=bf6fc4e9a18d719c89c8613d07930b8b023fb550\n\nIf those two (conceptual) lines converged by May, 2023 — and the “gap” could be closed in a sustainable way — I could probably stick with it.\n\nhttps://preview.redd.it/dkvymdze99ae1.png?width=2276&amp;format=png&amp;auto=webp&amp;s=b60df4db1ae60fb806b5a461478930e3be4baa1a\n\nIf they did not, however, I would need to figure out an alternative. Here’s what I wrote at the time:\n\n&gt;If this particular role isn’t working for me by May 31, I would like to figure out an alternative role that would be a better fit. If such a role exists already, great. If we need to carve out a new role, maybe we can do that.\n\nhttps://preview.redd.it/f00ue0lo99ae1.png?width=2094&amp;format=png&amp;auto=webp&amp;s=a07265bc260020fa39dd251b0724f46bb7f7c000\n\n# What about me?\n\nMay soon came and I felt like the situation had improved enough for me to continue in management.\n\nWas it my “dream job”? No. It involved plenty of things I didn’t care for, and required me to grow in areas that had never felt important. I loved the opportunity to work on optimizing processes. Being in conversations about the future of the UX team was new and interesting too.\n\nMy favorite part was working closely with my direct reports to evaluate their skills, achievements, earn promotions, and advance their careers.\n\nOne day I realized that I was spending every ounce of my energy at work helping other people advance their careers and I had completely neglected mine. In fact, I had adopted some very limiting beliefs:\n\n1. Now that I’m a manager, this is my career path now; I can’t go back\n2. I see all these complex, gnarly problems that I desperately want to solve, but I will never be able to because I’m too busy being a manager… and I’m stuck being one (see #1)\n3. How come other people get promotions — something I never received at this company until my boss left and I was asked to fill a role — and I’m on my way toward being a better manager, which is something I don’t really want and never have?\n4. My career has officially gone off the rails and all I can do is damage control at this point\n\nI’m not sharing this because these feelings were right or correct. I had a good job. Heck, I had a *job*, which is more than many people could say at the time! I made good money, nothing crazy, but a pretty healthy wage nonetheless.\n\nIt’s true, I felt sorry for myself and a bit resentful. That decision to take a management role felt less like a two-way door and more like a self-imposed, permanent sentence.\n\n# Turning point\n\nEarlier this year, my co-manager (we were leading the UX team together, with a few direct reports each) let me know about his plans to transition out of the company — which would leave me in an even more demanding version of this role with twice the number of direct reports.\n\nI knew I couldn’t wait any longer. It was time.\n\nI considered quitting my job and the company, but there were some problems with that plan. For one, I hadn’t done any practitioner work for over a year, nor did I have a portfolio. Another factor was that I genuinely *liked* the company and my team.\n\nMaybe that “alternative role” I’d written about in early 2023 could work?\n\nI spoke with my boss. She was very understanding and agreed that we could figure out a role that would be a better fit for me. Talk about relief!\n\n# What do I want?\n\nAs I mentioned earlier, I had long ago shifted from pursuing my career on *my terms* to passively accepting what others offered me.\n\nThis was the first time in a LONG time I had voluntarily decided to chart my own path in the direction of what *I* wanted.\n\nI did a number of things to figure it out:\n\n* After reading *Nine Lies About Work* I tried a “red threads” audit, paying close attention to my daily work activities to discern the specific things that really light me up (my “red threads”)\n* As part of my transition back to an IC role, I completed a thorough self-review of my own skills and achievements for my boss to evaluate and determine whether I’d revert back to a “senior” role (what I was before) or “lead”. This review helped me clarify the kind of work I was best at and loved to do.\n\n# Where things landed\n\nIn collaboration with my former boss — and my new boss, who was formerly co-manager with me — we arrived at a working definition of my role. I would rejoin the team with the title “Product Designer”, however, I would put a strong emphasis on information architecture. In retrospect, maybe I should have lobbied for a title that reflected my emphasis on IA but it was a pragmatic decision to avoid a bunch of HR-related hoops (e.g. salary benchmarking, job description, etc.).\n\n# Now\n\nThe stress hasn’t magically disappeared. Some of it has, only to be replaced by new sources of stress.\n\nWhat has changed is that I’ve figured out how to proactively design a more rewarding, sustainable career that’s optimized for the things I \\*\\*want. I believe my ability to thrive doesn’t depend on my circumstances, I’m finding deeper satisfaction in my work, and I’m finally leveraging my career to become the healthiest, fullest version of myself.\n\nI'm 100% a work in progress, but 2024 was the year where I stopped just working *in* my career and started working *on* it.\n\nHere’s to 2025!\n\n\\----\n\nIf you can relate to any of this, I’d love to hear from you in the comments or DM.",
    "score": 68,
    "url": "https://reddit.com/r/UXDesign/comments/1hqp32k/how_i_took_charge_of_my_own_career_in_2024/",
    "created_at": "2024-12-31T22:00:32.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1iri7bq",
    "subreddit": "UXDesign",
    "soc_codes": [
      "27-1021"
    ],
    "title": "Got an Offer, Then Lowballed Below My Current CTC – What a Mess!",
    "text": "So, here’s a wild hiring experience that left me frustrated and honestly questioning how some companies operate. Thought I’d share it here to see if anyone else has been through something similar.\n\nI interviewed for a **Senior UX Design role**. After multiple rounds of interviews, I got a **rejection email**. No big deal, I moved on.\n\nThen, a few days later, HR calls me saying,  \n*\"Oops, that rejection email was a mistake and you’re actually selected!\"*  \nOkay, weird, but I was still considering the role.\n\nWe discussed **compensation**, and after some back and forth, we **mutually agreed on a budget**. Since the offer process was moving ahead, I asked for the weekend to finalize my decision. **On Monday(Today), I called back and confirmed that I wanted to proceed.**\n\nHR asked me to submit documents for final approvals (I did not send them yet), which seemed like a standard step. But then...\n\nA few hours later, HR calls again and says:  \n*\"Actually, we can’t go ahead with the budget we agreed on. We need to go even lower - below your current CTC.\"* 🤯\n\nAt this point, I was just **stunned**. I didn’t even argue, I just said, *“That’s not going to happen.”* But damn, they wasted **so much of my time** with their **confused decision-making**.\n\nLike, how do you:  \n❌ Send a **rejection email**, then **reverse it**?  \n❌ Agree on a **salary**, then **change it after I confirm**?  \n❌ Expect a **senior hire to take a pay cut** instead of a reasonable raise?\n\nHonestly, I dodged a bullet. If this is how they handle **hiring decisions**, I can’t imagine how they run actual projects.\n\nHas anyone else been through something this unprofessional? Would love to hear how you handled it!\n\n...\n\n# TL;DR\n\nCompany rejected me → Called back saying \"Oops, you're selected\" → Agreed on a salary → Asked for documents (Did not send them yet) → Then lowballed me **below my current pay** at the last minute. 🚩🚩🚩",
    "score": 61,
    "url": "https://reddit.com/r/UXDesign/comments/1iri7bq/got_an_offer_then_lowballed_below_my_current_ctc/",
    "created_at": "2025-02-17T11:56:41.000Z",
    "num_comments": 54
  }
]