[
  {
    "id": "reddit-1hpynb0",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I GOT THE JOB!!! 60K A YEAR",
    "text": "After years of being adrift and working every odd job under the sun. I finally got a job as an IT technician! No certs no degree (in school now). Mostly remote too. I’ve never been salaried before so this is all new. It’s a growing company so I’m getting in on the ground floor. Plenty of room for growth. I’m honestly still in shock. I will admit I feel under qualified and like I have a lot more need to learn. I’m going to brush up on my A+ tho! Anything I should know? Tips? From corporate culture to just what to expect from my first tech job? Any and all advice is welcome!",
    "score": 1833,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1hpynb0/i_got_the_job_60k_a_year/",
    "created_at": "2024-12-30T21:56:11.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1jb5psx",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Rant: Just found out a good friend who's hiring is \"that guy\".",
    "text": "A friend of mine is the IT manager of a medium sized company. Yesterday I was sitting in his office, and he was talking about how he's not getting any \"qualified\" applicants for a couple of entry level positions he has open. These are positions that mostly involve imaging new builds, replacing broken keyboards, changing out toner cartridges, occasionally patching in a network drop, etc. The positions pay $36.5k / year. Granted it's in a LCOL area in the Midwest, but still.\n\nSo I'm flipping through this stack of 20+ resumes on his desk, and it's all recent college grads, or post high school with A+ - basically, exactly the resumes you would expect for a position that *you, yourself,* are calling \"entry level\".\n\nNope! He want's someone with *at least* six years of experience and a four year degree or multiple progressive certs. For $36k a year. To change out toner cartridges and plug in keyboards. We've all heard of companies like that, but I guess I'd just never come face-to-face with that line of thinking.... Honestly didn't even know what to say.\n\nEDIT: For everyone asking: The next time we're sitting around drinking beers on his porch, I'll have no problem tell him he's a fucking idiot. But I wasn't going to call him out in his office, at his job, with other employees around. I also don't know what his budget looks like. This could be beyond his control.",
    "score": 1695,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jb5psx/rant_just_found_out_a_good_friend_whos_hiring_is/",
    "created_at": "2025-03-14T14:51:47.000Z",
    "num_comments": 216
  },
  {
    "id": "reddit-1kmosh9",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "JUST RECEIVED A JOB OFFER!",
    "text": "**HEY GUYS!** I just landed a job offer for $60,000 a year and I’m absolutely thrilled! It’s been a wild ride job hunting since March—hundreds of applications, 20 interviews, 18 rejections, 2 companies moved forward with second-round interviews (I failed both), and then this one came through after just a single interview stage. 🙌\n\nI’ve only got 9 months of IT experience, and now I’m officially a **Network Technician**! 🤯\n\nWent from making $18/hr at a help desk position to locking in a full-time **salary** role—$60K, baby!! Let’s goooo!!\n\nI have a BS degree in IT from WGU, as well as the CompTIA A+, Network+, and Security+ certifications, along with the AWS Certified Cloud Practitioner, ITIL 4, and Linux Essentials.  \n  \nTo be honest, I don’t even know how I got the job. Most of the interview questions they asked, I didn’t know the answers to. I just told them that I don’t know much, but I’m willing to learn.",
    "score": 1668,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kmosh9/just_received_a_job_offer/",
    "created_at": "2025-05-14T19:55:05.000Z",
    "num_comments": 282
  },
  {
    "id": "reddit-1kwswnn",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Quit looking to do IT; it’s not worth it.",
    "text": "Honestly, this job feels like a joke sometimes. If you’re cool with being a glorified nerd and under appreciated, then maybe it’s for you. But don’t buy into the hype — the pay isn’t nearly as great as people make it out to be. I’ve got 6+ years of experience, and my friends in the trades are clearing way more than I am, with half the stress and none of the corporate nonsense.\n\nMost companies expect you to be an entire IT department in one body — sysadmin, help desk, cybersecurity, project manager, cable runner, and unofficial therapist — all rolled into one. And they want to pay you like you just learned how to reset a router.\n\nIt’s a never-ending grind of certs, degrees, and “keeping your skills sharp” just to stay in the same place. Half the stuff you’re pressured to learn? You’ll never even touch it in the real world. Just fluff to tick a box on a job listing.\n\nRespect? Forget it. You’re invisible when things work and public enemy #1 when Karen’s printer won’t connect. Everyone’s got jokes until the network goes down — then suddenly you’re supposed to be a magician. People laugh when I say I work in IT.\n\nAnd moving up? Good luck. It’s less about skill and more about kissing the right ass. Office politics and fake enthusiasm get you further than real knowledge. You could be carrying the whole team, and still get passed over.\n\nI hope this offends a few nerds who think they’ve “made it” — maybe you need a wake-up call too. IT can be useful, sure, but don’t act like it’s the golden path. If you don’t absolutely love this field or have a clear exit plan, you’re probably wasting your time.\n",
    "score": 1655,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kwswnn/quit_looking_to_do_it_its_not_worth_it/",
    "created_at": "2025-05-27T17:14:28.000Z",
    "num_comments": 674
  },
  {
    "id": "reddit-1ks0nym",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "CEO leaked I'm getting laid off",
    "text": "Hello,\n\nThe CEO at my job replied to an email with me accidentally cc'd to the company lawyer this morning with a list of folks for separation agreements. They will begin preparing the drafts today and meet tomorrow. I assume I'm getting laid off Friday. \n\nI plan on taking PTO tomorrow but how should I address this if I bump into the CEO today? I've never been in this situation before. I'm currently sending out applications on indeed and trying to stay positive. I could use some professional help if anyone wants to review my resume. Thanks everyone!",
    "score": 1624,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ks0nym/ceo_leaked_im_getting_laid_off/",
    "created_at": "2025-05-21T15:26:55.000Z",
    "num_comments": 320
  },
  {
    "id": "reddit-1jj1ilw",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Stop Applying to IT Help Desk Jobs If You Can't Even Google a Problem",
    "text": "Look, I get it. Everyone wants to break into IT. The help desk is a common entry point, and I respect people trying to start their careers. But for the love of all that is holy, if you don’t know basic troubleshooting, you have no business applying.\n\nI’m talking about people who:\n\nDon’t know how to ping an IP address.\nHave never used the command line.\nThink turning it off and on again is some kind of joke instead of the golden rule.\nCan’t even explain what DNS does.\nHave never, in their lives, Googled an error message before asking for help.\nI sit in interviews with people who claim to be “passionate about IT” and then blank out when I ask them how they’d troubleshoot a printer not working. A PRINTER. If you can’t handle a basic, day-one issue, why are you applying to a role where 90% of your job is literally fixing basic issues?\n\nI’m not saying you need a CompTIA cert or years of experience, but at least show that you’ve tried to learn something. Set up a home lab. Watch YouTube tutorials. Get familiar with basic networking. Hell, just tinker with your own computer a little!\n\nI’d rather hire someone with zero formal experience but a clear eagerness to learn than someone who just wants an easy job in tech and expects to be spoon-fed solutions.\n\nAnyone else dealing with this flood of unqualified applicants? It’s exhausting.\n\n\nEdit: I guess this post triggered the incompetent mods and they banned me.",
    "score": 1391,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jj1ilw/stop_applying_to_it_help_desk_jobs_if_you_cant/",
    "created_at": "2025-03-24T20:48:47.000Z",
    "num_comments": 308
  },
  {
    "id": "reddit-1ir46b3",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Didn’t realize it was this bad",
    "text": "Recently my job opened up a new position on my team that I’m going to be conducting interviews for.\n\nWithin 24 hours we had over 3k applications. Thats 3k for a general senior position.\n\nA little over 600 were from people without the proper background and were thrown out, and around 1300 were entry level (2 years or less of experience) and were thrown out. So we had around 1200 left of people qualified for the actual role.\n\nIts insane, the first guy we’re interviewing was a senior engineer back in 2004, and has since went on to become a principal engineer for a big name company.\n\nIm honestly a little shocked that the market is THIS bad where someone like this would even apply to this position thats so many levels below what he currently has. Also, how are actual regular mid career folks supposed to compete against these behemoths? ",
    "score": 1186,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ir46b3/didnt_realize_it_was_this_bad/",
    "created_at": "2025-02-16T22:14:03.000Z",
    "num_comments": 386
  },
  {
    "id": "reddit-1ma04es",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "To those who want to get into IT, full remote, six figures , with no experience",
    "text": " I work at AWS as a sys engineer making 125k (L4 pay) People don’t get how fucking hard it took here, 3 rounds of interview, 2 technical ones. I’m not a SDE but still grinded leetcode and got my certs in SAA and Cloud+. \n\nOn top of that I had to mass apply like a maniac since my freshman year as in 30 apps a week, to get a couple of internships to set the best outcome for me possible out of college. My GPA never went under a 3.8 and I made sure to TA and volunteer early on. \n\nLike the point is, it makes me sick people think they can skip all of this and get to that salary, it just sounds so entitled hearing “can I get into tech with just my A+, full remote, and pays at least 100k.” The amount of post I see per day asking this is just disgusting, yes it sounds like I’m gatekeeping from the field, but tbh I would not really have an issue with people who wanted to get into this field, did their research that market is rough, and have realistic expectations on what they need to get their first helpdesk job.\n\nWhy does everyone keep looking at the one guy who made six figures, no experience. It’s a one off situation, why does everyone keep people suddenly think they’re built different than others after seeing one YouTube video? \n\nAlso spoiler alert, majority of people in IT don’t make six figures, there’s a reason why six figures is the top 15% in the US. within that 15% there are doctors, lawyers, politicians, other engineers unrelated to tech. So how many tech people do you really think make six figures? Be real people, and if you’re in IT or getting into IT, you should have the logical comprehension to figuring that shit out. ",
    "score": 1037,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ma04es/to_those_who_want_to_get_into_it_full_remote_six/",
    "created_at": "2025-07-26T18:09:38.000Z",
    "num_comments": 490
  },
  {
    "id": "reddit-1lm7g0n",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I’ve hired over 30 IT pros in the last few years and here’s what I’ve learned that surprised me.",
    "text": "Not all of our best hires had degrees from big-name schools or the most impressive resumes. A few didn’t even do great on the technical test. But they stood out in other ways and ended up being some of our strongest team members.\n\nHeres what they did have:\n\n* They communicated clearly and confidently\n* They were resourceful and didn’t wait to be told what to do\n* They were genuinely curious and always looking to learn\n\nI’m still figuring things out as I go, but thought I’d share in case it helps someone else who’s hiring (or job hunting).\n\nWhat have you noticed when it comes to spotting great people in tech, either as a manager or as someone who's been on the other side of the table?",
    "score": 986,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lm7g0n/ive_hired_over_30_it_pros_in_the_last_few_years/",
    "created_at": "2025-06-27T22:46:14.000Z",
    "num_comments": 181
  },
  {
    "id": "reddit-1k5jusg",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Just got cussed out by a doctor",
    "text": "I (24M) have been doing IT for a chain of clinics for over a year with no issues—until today. I was on a call helping a doctor with some software. About 10 minutes in (only 4 of which I was actually on his laptop), he snapped and said, “I have shit to do and you’re just fucking around. Can you get someone who knows what the fuck they’re doing?”\n\nI had just uninstalled the app and was about to reinstall it. I told him, “You don’t have to talk to me like that,” and he kept cussing me out. My team lead overheard and took over the call. I was heated, so I stepped out and took a walk to calm down.\n\nLater, I told my manager I needed the rest of the day off, and he was understanding. He also said he heard the call, confirmed I did everything right, and that they’re reporting it to HR and the CEO. Still, I doubt anything will happen—he’s a doctor and brings in money.  \n\nNot looking for advice or anything just ranting maybe I am in the wrong but idk. My parents and manager says I shouldn’t let stuff like that get under my skin but I’m not used to be talking to like that especially when I’m helping someone. I need to get out of help desk. \n\nUpdate: I want to clear up a few things. I do not work for an MSP — I’m directly employed by the clinic. That means the doctor involved isn’t just some external client; he was my coworker.\n\nAlso, I did not take the entire day off. I only left one hour early.\n\nAfter speaking with management, I learned this isn’t the first time this doctor has acted this way. Management is fully on my side. They’ve already spoken with HR and the Chief Regional Officer (CRO) about the situation.\n\nThey made it clear this incident does not affect my standing with the company in any way. They told me they know my character and how I treat our users. They specifically mentioned I’m typically very calm and professional, and that it takes a lot to get a reaction out of me — so they understood that the doctor must have said something inappropriate.\n\nFor context, the first six minutes of the call were me trying to connect to his laptop using LogMeIn123, which anyone familiar with the tool knows is a standard part of our process.\n\nManagement also let me know the doctor has since apologized.",
    "score": 966,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1k5jusg/just_got_cussed_out_by_a_doctor/",
    "created_at": "2025-04-22T22:44:12.000Z",
    "num_comments": 345
  },
  {
    "id": "reddit-1itjm3h",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "From $19/hour to $31/hour, I am so scared, what to do?",
    "text": "I've been at a copier company installing copiers on local businesses network. I set up scan to email and smb and troubleshoot printing issues and those above.\n\nI interviewed for another job for on-site support tier 1. They asked a lot of questions about azure and cloud usage, and Active Directory. I have no experience in either. I was honest about that too.\n\n3 weeks later after the interview they called and offered the job at $31 and hour! I nearly gasped. That's such a jump from $19.\n\nI'm so scared. Like imposter syndrome that I shouldn't be getting this money or position. What to do?\n\nEdit: thank you all for the kind words and encouragement. I'm very nervous but I will give it 100% effort to learn as much as possible",
    "score": 960,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1itjm3h/from_19hour_to_31hour_i_am_so_scared_what_to_do/",
    "created_at": "2025-02-19T23:11:09.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1kxtcr3",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Just want to offer a cheat code",
    "text": "I say this every now and again. If you want an unlimited money and job glitch when it comes to IT/tech.  Go cyber guard/reserve Air Force, get the free training, grab the top secret clearance, and then just profit from there.  \n\nEDIT: this post pissed some people off somehow lol.  Just wanted to show lost people an option. If it’s not for you then hold back the tears and keep it moving.  Also, I am not a recruiter and can’t help you in the process of joining. Just wanted to possible open a path\n\nEDIT2: thanks for all the interaction folks :] I feel like I genuinely helped some folks!! I don’t feel like my calling is IT or tech. I enjoy helping people the most but there isn’t much room to raise a family for helping people for free so I’m gonna stick to my career in the meantime. \n\nEDIT3: like I’ve said though, I will not be helping any of you through the process of actually getting started because there are way to many of you asking for it.  I just wanted to open the door, now you have to do the research and see if it’s right for you",
    "score": 866,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kxtcr3/just_want_to_offer_a_cheat_code/",
    "created_at": "2025-05-28T21:37:50.000Z",
    "num_comments": 547
  },
  {
    "id": "reddit-1i1nwy3",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "From Unemployed to a $58k IT Job in a Year: My Journey",
    "text": "I wanted to share my story to inspire those of you who feel stuck or are starting from the bottom. A year ago, I was completely unemployed, three months behind on rent, and facing a court order to either pay up or leave my apartment. My life was the very opposite of stable. \n\nI scraped together what I needed to stay in the apartment, and I took a dishwashing job to stabilize myself. It wasn’t glamorous, but it was exactly what I needed to keep going. Around the same time, I heard about the Google IT Support Professional Certificate. I decided to use what little stability I had from dishwashing to focus on earning that certification.\n\nWhen I finished, I started posting about it routinely on LinkedIn. That decision changed everything. A recruiter from Robert Half saw my posts and reached out with an opportunity: a four-month temp contract hanging wireless access points (WAPs) for schools in northeast Ohio—1300 of those. I took the job, did my best, and made sure to keep my resume updated with everything I learned.\n\nBefore that, my only real IT experience was a tech sales job with an ISP a few years back, where I occasionally reset passwords or rebooted modems. Still, I kept networking and applying. Posting updates on LinkedIn led to more opportunities, including one from Randstad. I accepted their offer, but just three days before my start date, it was rescinded because the organization froze all contracting services after their CEO was fired.\n\nThat could’ve crushed me, but I didn’t give up. I kept my resume sharp and continued posting. Eventually, a recruiter from my current organization found me on LinkedIn. They helped me prep for an interview, and I made the most of it. The result? A $58k job with a $3k relocation bonus that I started last month.\n\nThe funny thing is, my experience was minimal—just the Google cert and some AP installations. What got me here was mastering soft skills, learning to interview, and refusing to give up, even when things went sideways.\n\nHere’s what worked for me and might work for you:\n\n1.\tTake the first step, no matter how small – For me, that was a dishwashing job to stabilize my life and the Google cert to build momentum. Do NOT go into the grind saying what you aren’t gonna do. If you wanna bend the situation to your will, you have to be willing to do whatever it takes.\n\t\n2.\tLeverage LinkedIn – Share your journey, post your progress, and connect with recruiters. It works.\n\t\n3.\tStay resilient – Losing that first job offer hurt, but I kept going. Persistence really is key in this field.\n\t\n4.\tFocus on soft skills – You don’t need to know everything about IT right away. Being able to communicate, adapt, and think critically will set you apart.\n\nA year ago, I felt hopeless. Today, I’m in a role with more upward mobility than I ever thought possible, with a stable income and a clear path forward. If you’re struggling, I hope my story shows you that you can fucking do it. It won’t be easy, but if you keep at it, an opportunity WILL break. Good luck. ",
    "score": 843,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1i1nwy3/from_unemployed_to_a_58k_it_job_in_a_year_my/",
    "created_at": "2025-01-15T02:57:51.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1l29wnc",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Am I a jerk for making my boss think I'm going to accept a promotion when I'm in the process of quitting?",
    "text": "For the record, they offered me a \"promotion\" with no salary increase. It came with increased responsibilities, a heavier workload, and restrictive working hours. After interviewing me, they put me through my paces for two months while deciding between several candidates.\n\nIn the meantime, I prepared an exit strategy in case I was rejected and started looking elsewhere. I was offered a much better position. Like, a lot more. However, I won't be able to start at the new company for a few months. My current company decided to promote me. I just said, \"Cool, I'm happy. Let's do it.\"\n\nThe truth is, I'm going to quit in a few weeks. They don't expect it at all. They're starting to organize for my new position, and I must admit that I'm starting to feel guilty about it. Today, I tried negotiating my salary again, but they refused. I'm waiting for a precise start date from the other company before submitting my resignation.\n\nDo you think I should tell my current employer?",
    "score": 797,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1l29wnc/am_i_a_jerk_for_making_my_boss_think_im_going_to/",
    "created_at": "2025-06-03T11:53:09.000Z",
    "num_comments": 308
  },
  {
    "id": "reddit-1hyiz2m",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I landed my first IT job at $25 an hour!",
    "text": "So I work in manufacturing  and I've been working on my IT certifications. In the last few months I've earned my A+ and Net + and next week I take the test for my Security +.\n\nI was pretty dismayed, because when I started looking around at IT jobs in the area that I might qualify for I realized I'd have to take a major pay cut. I have bills and a family so it didn't feel like an option. \n\nFortunately, my company had decided to bring me into their IT department.   \nAt our branch we have one IT guy that does both System Admin and Net Admin stuff and I'll be working with him every day and he's going to show me the ropes. \n\nI'm super excited because I didn't expect to be able to start in IT with the same pay I was making. \n\nHopefully, in a year or two I can move on up, I'm working on my CCNA next!\n\n",
    "score": 793,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1hyiz2m/i_landed_my_first_it_job_at_25_an_hour/",
    "created_at": "2025-01-11T00:05:05.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1klwmua",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Leaving the IT industry for good, and I won't be coming back.",
    "text": "Good afternoon fellow or should I say former IT folks. Its been a good run just under 4 years in the field and im here to say that I will be leaving IT. Im a network administrator and just realized that it isn't for me. The office/office politics are not for me. The people playing the blame game, the constant stress of not knowing if your network is going to go down overnight, and the pressure from others to excel when you just cant anymore. I wish whoever enters the field to keep an open mind and always be willing to learn that's how you make the big bucks out here. Bust your butt, and always look for a better opportunity no matter how good your current job is be disciplined because I wasn't. Also don't be arrogant try to bring the people around you up and don't put people down because that brings tons of negative energy and people can feel it. \n\n\nTLDR: im leaving because I cant keep up with people around me. I hope you do well. Always keep your head up and always learn and try to do more no matter how good you are at what you do. ",
    "score": 773,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1klwmua/leaving_the_it_industry_for_good_and_i_wont_be/",
    "created_at": "2025-05-13T20:34:22.000Z",
    "num_comments": 353
  },
  {
    "id": "reddit-1lmsg0t",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "VP of Tech with 20 Yrs experience, i wanted to offer some advise to those new or looking to get into IT.",
    "text": "I've been browsing through this sub all morning and I've seen a ton of negative posts from burnt-out individuals. This can seem very discouraging to anyone looking to get into IT or new in the industry. This advice is only for those brand new or looking to get into IT.\n\nA single cert (such as A+) unfortunately isn't enough to be put on top of the list of candidates for a position. This is interesting and a bit unfair since, on paper, an A+ is technically more than enough for a level-1 helpdesk position (I personally still have and update my A+).\n\nIf you're looking to appear more well-rounded, skip the A+ and focus on the following:\n\n* **Microsoft 365 Fundamentals**, followed by **AZ900**\n* **Microsoft Office Specialist (MOS)** — focus on **Outlook** first, because it causes the most \"noise\" in a normal office.\n* Maybe add **Azure Fundamentals** or **AWS Cloud Practitioner**.\n\nIf I'm looking to hire an on-site level-1 technician, here’s what I’m looking for (and so are most IT Managers/Directors):\n\n**Appearance:**  \nHow are you dressed? Personally, I'm a metalhead with tattoos and a sleeve — but you'd never tell by looking at me because I cover it. Work isn’t the place to express yourself; it's where you go to make money. At minimum, dress business casual. Hair neat. Smell good. If you don’t know how to dress well (you’d be surprised how many don’t), get help. These days it’s affordable to look good — go to H&amp;M, Express, or any trendy store and ask the younger employees for advice. They’ll likely be more helpful than your relatives or significant other. You don’t need to wear a tie, but get clothes fitted to your body shape. Don’t wear clothes that are super baggy or shirts that are too tight — yes, I see this a lot.\n\n**Small lifehack:** Buy a work outfit and wear it around the house. You’ll get comfortable in it and won’t feel awkward wearing it to work. Dress nicer than your peers in the same position, and you’ll be taken more seriously by managers — I promise.\n\n**Communication:**  \nI want someone with a good demeanor, who’s well-spoken, helpful, and has common sense. This is huge. Friendly, but not overly social. When dealing with office staff, get in, get out — don’t linger. The IT industry has improved a lot but there's still that stereotype of the creepy awkward it guy whos going through your personal pics, just know this is still a thing, don't be that guy.\n\n**Technical Skills:**  \nI prefer someone who’s well-rounded over someone who’s hyper-specialized but unwilling to leave their comfort zone. This is where having a few foundational certs makes a difference. A big part of your job will be putting out small fires — like solving a printer issue or dealing with a dead laptop, RMA, recover data, setup the user with a new device and make it look like the old one did. etc... it depends on your job, but just know the more well rounded you are the better..\n\n**Resourcefulness:**  \nThis is HUGE. It's okay not to know something. What matters is how you handle it. I look for someone who can say, *\"I’m not sure what’s going on, but I’ll get back to you within X time,\"* then takes ownership, researches (whether through escalation or Google), and follows up with a resolution — without needing a babysitter. I hate the micromanaging culture!\n\n**Direction:**  \nIf you’re just getting into IT, you probably don’t know which branch of IT you'll end up in. That’s OK. I used to be a Linux Telecom Engineer before realizing there were better-paying opportunities in finance. Now I work for a Private Equity firm. Why? It pays more — that’s it.\n\n# Some things I wish I did sooner:\n\n* Get a mentor — ideally someone in a high-level position in the field you're aiming for.  for example, in cyber security it would be a CISO, Compliance Officer, etc.\n* If possible, get an internship, even doing low-level work. It’ll show you the path.\n* Talk to successful people in the branch of IT you want to enter. Burned-out people love telling you how bad it is — that’s often a reflection of their own life, not the industry.\n* Mentorship programs at mature companies are GOLD — take advantage.\n\nAvoid negative, salty people. I've read plenty of those comments here. Sure, bad days happen. But I’ll share this: In one of my previous jobs (and still as a consultant doing internal IT assessments and M&amp;A work), I developed a knack for spotting unhappy IT employees — the complacent, lazy, or those who lost their drive. Every profession that pays well requires *continuous* improvement. IT is no different. If you stop learning, someone will pass you by. It’s just how it is.\n\nKnow the difference between **perception and reality**. Some folks lie A LOT on their resumes. Some don’t lie at all. Find the balance. Also understand that **corporate politics will always play a role** in career growth. If you think just being technically good and keeping your head down will land you a $250k salary — you’re mistaken.\n\nPerception matters. That’s why dressing decently and having a well-rounded cert portfolio are important in the beginning. Also, realize that your resume might end up in front of a 25 year old HR person that doesn't know Jack Shit about IT and all she's thinking about is her drama with her bf and how she needs to find an outfit to go have drinks with the girls, **make it easy** for them to put you on the lists of candidates that should be interviewed, and this might mean pay for someone to review your resume but don't overly rely on this either.\n\nThis was supposed to be a short post 😅. If you made it this far and have questions, drop them — I’ll answer as best I can.\n\nEDIT: I'm trying to wrap my head around the few Chatgpt comments, do you think I didn't write this? In a way it's very fascinating because if you cant tell a human being wrote this post then we're all done for in the future lol.  \n",
    "score": 765,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lmsg0t/vp_of_tech_with_20_yrs_experience_i_wanted_to/",
    "created_at": "2025-06-28T17:31:03.000Z",
    "num_comments": 188
  },
  {
    "id": "reddit-1jgozse",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "IT Can Be a Thankless Job",
    "text": "Working in IT is exhausting. You’re expected to fix problems people can barely explain, and when you do, you’re lucky to get a thanks. But make one mistake, suddenly, you’re public enemy #1.\n\nNo one notices the overtime or the extra effort, but the second something goes wrong, it’s like the world’s ending. Here’s the thing: being rude to your IT team doesn’t help. It just makes us less likely to go out of our way for you.\n\nA little patience and appreciation go a long way. We’re here to help, but we’re human too.\n\nAnyone else feel this way?",
    "score": 723,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jgozse/it_can_be_a_thankless_job/",
    "created_at": "2025-03-21T19:17:14.000Z",
    "num_comments": 149
  },
  {
    "id": "reddit-1k8yoy0",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "If you're looking to get into Cyber Security please consider the following..",
    "text": "1. It’s mostly meetings, audits, report writing/reading, and then more meetings. Yes, there is a large technical component, but it’s often overshadowed by paper pushing. This isn’t just true for blue teams - it applies to red teams too. One pentest report could have 12–15 pages dedicated to one IDOR vulnerability.\n2. Cybersecurity degrees are almost never worth it. College is great, and it’s even better when you’re studying a tried and true degree like Computer Science, which will always offer value well into the future. Howevr, cybersecurity is not an entry level field, and very few people actually graduate and move directly into a JR Sec Analyst/SOC role. It just doesn’t happen. You’re better off doing a 2 year IT program that covers computer science fundamentals/programming from an accredited school, or a 4 year CS degree from a traditional university. If neither of those are an option due to cost or flexibility, then go for certificates from known and reputable vendors - not some random LinkedIn Learning module nobody has heard of..\n3. You’re going to need knowledge across several domains: networking, programming, OS architecture (deep familiarity with Windows, Linux, and macOS internals.. especially command line, file systems, permissions, processes, and memory), incident response, risk management, threat analysis, and much more. Most importantly, soft skills. You will not get hired if people don’t want to work with you.\n\nI just wanted to list these as I feel they are most pertinent to finding a job in cyber security. I work as a Cybersecurity Analyst and have 7 years in IT, and it's PARAMOUNT that you understand the above IMO.\n\n\n\n",
    "score": 714,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1k8yoy0/if_youre_looking_to_get_into_cyber_security/",
    "created_at": "2025-04-27T07:54:41.000Z",
    "num_comments": 141
  },
  {
    "id": "reddit-1kpq8m2",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Got yelled at for taking a 7-minute break Fuck Corporate Life",
    "text": "Just today, my manager called me out in front of the team for \"being away from my desk too long.\" I had stepped out for literally 7 minutes to take a breather no lunch yet, 6 hours into my shift, and handling back-to-back calls from angry clients.\n\nApparently, \"it sets a bad example.\"\n\nYou know what sets a bad example?\n\nMaking employees sit for 9+ hours with no mental break\n\nMeasuring productivity in minutes instead of outcomes\n\nPreaching \"mental health matters\" in HR emails while micromanaging bathroom breaks\n\nI used to think I needed this job for stability.\n\nNow I'm starting to think it's killing me slowly.\n\nI'm tired of being a cor a machine that doesn' t care if I break down\n\nFuck corporate life.\n\nIf you've had a similar moment that pushed you over the edge, I'd love to hear it. Maybe I'm not crazy after all.\n\n",
    "score": 713,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kpq8m2/got_yelled_at_for_taking_a_7minute_break_fuck/",
    "created_at": "2025-05-18T18:04:08.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1npydua",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I did it guys. After 7 months...",
    "text": "I was laid off back in Feb. Spent not even a year with my last employer before I got the dreaded Teams meeting with my boss and HR. Got RIF'd, a measly severance, and escorted out of the building by front desk security. In this economy, might as well be a death sentence.\n\nI feel for you guys who are looking in the current job market, it's hell. They're paying pennies on the dollar, it's all onsite with little to no remote work, mostly contracts. I remember I was almost willing to take a Tier 2 Desktop Analyst position for 25hr cuz I was desperate. I had to burn through my savings, unemployment is a joke. I lost my relationship of three years because of the layoff, (my ex would say otherwise but we mostly argued over finances), couldn't afford repairs for my car, and my cat required surgery ($4000). To add insult to injury, the ex moved out, wanted half of her deposit back and now I had to pay for everything in full for almost half a year. Dude, I was going through it.\n\nAfter 7 months, 24 interviews, hundreds of emails, and thousands of applications, I got the job I was aiming for. IT support for the city public transportation department, and the commute is 12 min. $70k a year, direct to hire, full benefits. I can't tell you how much relief I feel, it's like I got my life back. I owe it in part to this sub, all the tips and questions answered helped me build a decent resume and improve my interview skills. There is a light at the end guys if you're willing to keep the course and put in the work!",
    "score": 707,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1npydua/i_did_it_guys_after_7_months/",
    "created_at": "2025-09-25T05:21:27.000Z",
    "num_comments": 111
  },
  {
    "id": "reddit-1lptmof",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I was going to be a Software Dev, but I guess I'll be an IT Guy.",
    "text": "I'm 25(M) who graduated with a Computer Science degree last summer. I had planned becoming a software developer, and all my internships and projects were focused on software dev. But as you might know, it's incredibly tough for new grads to land a software job right now. So, instead of staying idle, I took an IT support role without any prior experience.\n\nSurprisingly, I've started to really enjoy it! I've found that instead of coding or debugging all day, I prefer dealing with a variety of technologies. One day I might be setting up a physical server, another day I'm handling hosting issues, and the next, I'm knee-deep in Active Directory.\n\nThe only problem was that I worked at a food company, and there weren't any IT professionals I could learn from. But good news! Last week, I received  a job offer from a company that specializes in IT, with a higher salary. I'll be starting in a few weeks.\n\nThe best part is that I'll be working with professionals in a company whose core business is IT.  So, it feels like a great step forward for my IT career. The only catch is that it's a shift-based role, meaning I'll sometimes work weekends or even all night. But I think it'll be worth it.\n\nWhat do you all think? Am I on the right track?",
    "score": 700,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lptmof/i_was_going_to_be_a_software_dev_but_i_guess_ill/",
    "created_at": "2025-07-02T11:41:51.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1ik6vze",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "One month in from changing careers at 41.",
    "text": "I was a retail manager for 20 years and at 41 I packed it all in, got my A+, and last month I landed a role in an IT support role (hybrid, 3 days wfh). I feel like the luckiest person in the world!\n\nOne guy in the office was complaining about pay and I was just smiling.\n\nAfter earning a fairly decent salary for decades yet being completely miserable in my role, I honestly just can't believe I'm doing this stuff every single day and can't wait to learn more and push further in my new career.\n\nTo anyone considering switching careers but worried about age or prospects etc - just do it. \n\nIf I can do it, you can.",
    "score": 691,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ik6vze/one_month_in_from_changing_careers_at_41/",
    "created_at": "2025-02-07T21:55:58.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1mbz88x",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "From unemployed to $70k+remote in 2 years",
    "text": "Just wanted to give you guys my story and  hopefully some motivation to those who need it.\n\n\nDec 2022: Graduated college with a compsci degree. No certs, no projects, nothing. At the time, I thought a degree was all I needed to get a high paying job. Reality set in quickly.\n\n\nAugust 2023: Months of applying to SWE jobs with no luck. I made a pivot into IT. Started studying for Sec+ while doing UberEats + Doordash everyday. \n\n\nFeb 2024: Landed my first job @ help desk making $21/hr. Earned Sec+. Happy to finally get my foot in the door.  \n\n\nNow: Earned my Net+. Landed a job making +$70k fully remote. \n\n\nFor those searching for their first job in IT, keep learning, obtain relevant certifications, do a few projects, make good connections, and keep applying.\n\n\nGood luck to you all\n",
    "score": 681,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1mbz88x/from_unemployed_to_70kremote_in_2_years/",
    "created_at": "2025-07-29T02:03:57.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1ikoezx",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Going on 30 years in IT, here are my answers to the FAQs of this sub",
    "text": "* Get whatever entry level IT job you can. \n   * If you’re in college, get an on-campus student job doing any sort of tech support.  Every college has these types of roles.\n   * Non-profits and small businesses are often more willing to hire with less experience.\n* Early in your career look for opportunities that give you a broad range of exposure to different technologies. \n* Certifications complement experience, I’ll take a shot with someone that has 1 year of helpdesk experience before someone with no experience and multiple certs. Get a job and if you’re interested in the tech used in that org, go after an applicable certification.\n* The best path to cyber security is through IT.  The most effective and successful cybersecurity professionals I work with all came up through the IT ranks. How can you secure tech unless you understand how things work?\n* Titles in IT are largely worthless.  Titles are often inflated, especially in organizations under 100 people.  IT Director at a 75-person company is basically a glorified helpdesk/sysadmin role.\n* Explore professional organizations and industry events to get to know others in the field.\n   * [https://www.aitp.org/](https://www.aitp.org/)  for IT professionals\n   * [https://www.issa.org/](https://www.issa.org/) for Cybersecurity",
    "score": 659,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ikoezx/going_on_30_years_in_it_here_are_my_answers_to/",
    "created_at": "2025-02-08T14:27:42.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1m9fl4k",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I doubled my IT salary in less than a year by job hopping",
    "text": "\n\nFirst, I fully acknowledge that I may have just gotten lucky through this process, but I also feel that I definitely put in a lot of work to progress my skills faster. \nLong story short, loyalty to a company is dead nowadays. \nI only have (coming up on) a year in the IT industry with just one cert(Sec+)and I have job hopped 3 times in that time. \nI started at $48k for my first job, help desk. After 5 months, I found another help desk job for $62k. Then, 3 months later, I found another role as  system administration role for $80k, then 3 months later, I just now accepted an offer for $100k in networking. \n\nThe things I PERSONALLY feel made made me excel were only small things that compounded. \nFirst, I would always ask what project to be put on that could be improved. Things like bench stock inventory, software documents, or any additional duty. Something that is big enough to show you really made a difference, but not so big you’re in over your head. This gave me something to do in my down time and made me always look busy. I’d always gone a very brief weekly update without being asked to show that I’m still working it, the progress I made, and what I had planned next week. This can show your skills like organization, initiative, and willingness to learn. \nSecond, cross training and finding single points of failure within the desk or job. Someone doesn’t have a secondary for an additional duty, help them out. Only one person knows how to do a specific job, ask to learn. This helps you meet and get to know your cowriters, learn the job better, and help the team. For me, this helped me bond with coworkers via work and not small talk because I’m an introvert and hate that. \nLastly, I took my time with applying to jobs. I applied to only 2-3 a week, but I tailored my resume to each one and made sure I met all or most requirements. Tailoring my resume started giving me about an 85% response rate vs just mass applying. I can’t stress how much this helps. \nThis wasn’t a bragging post, but just something I wanted to share to see if it helps something else and to let them know that it’s possible to speed run the salary ladder to decent pay. \n\nThere’s more I felt I did and I’d be happy to explain if you want more tips. ",
    "score": 512,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1m9fl4k/i_doubled_my_it_salary_in_less_than_a_year_by_job/",
    "created_at": "2025-07-26T00:28:21.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1i0c82h",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Which IT Certifications Are Most Valuable in 2025?",
    "text": "What are the most in-demand IT certifications for 2025 that can boost career prospects and salary potential? Are certifications like AWS, CompTIA, or Salesforce still relevant, or are there emerging ones to consider?",
    "score": 508,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1i0c82h/which_it_certifications_are_most_valuable_in_2025/",
    "created_at": "2025-01-13T11:49:44.000Z",
    "num_comments": 199
  },
  {
    "id": "reddit-1jjkls4",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Is it me or does everyone want to work in IT now?",
    "text": "Is it just me, or does it feel like everyone suddenly wants to work in IT? I get it, no degree required, remote work sounds great, and people hear about six-figure salaries for IT managers and think, “Why not me?”\n\nBut here’s the thing... just because the barrier to entry *looks* low doesn’t mean success is guaranteed. The field is getting oversaturated fast. Everyone’s trying to pivot into tech, especially from physical labor jobs, and while I understand the motivation, the reality isn’t as easy as it’s made out to be. Back in a day if you were a PC gamer you had a good chance. Now everyone is a PC gamer and they all think they can work in this field.\n\nIf you're over 35 and thinking of switching careers, be aware you’ll probably take a pay cut and might not see decent income until year three or four. IT also requires constant learning. New tech pops up all the time. It’s not a laid back job anymore, it’s a grind, and it’s competitive.\n\nWhat really gets me is when someone lands their first help desk role and a few months later starts asking how to become a cloud engineer or how to double their salary. Chill. You're not alone, everyone's trying to climb at the same time.\n\n**Edit:** I didn’t expect this to get so much attention, so I just want to clarify a few things. This post isn’t meant to discourage anyone from pursuing a career in IT. My goal was to bring awareness to the fact that the field is getting saturated and that success takes time and effort.\n\nIf you truly have a passion for IT, keep going, there’s absolutely a place for you. And ambition is a good thing! If you feel ready to move into a better role quickly, go for it. The point I wanted to make is that many people ask how to level up fast, and while that’s understandable... **experience matters a lot**. No one’s handing out senior roles unless you’ve built a solid foundation, or have really strong connections.\n\n**TL;DR: IT sounds great on paper, and yeah, a lot of people are rushing in, but it’s not the golden ticket people think it is. If you land a job, stick with it, build your experience, and take the long road. Otherwise, you’re just adding to the noise.**",
    "score": 501,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jjkls4/is_it_me_or_does_everyone_want_to_work_in_it_now/",
    "created_at": "2025-03-25T14:25:51.000Z",
    "num_comments": 411
  },
  {
    "id": "reddit-1kwxjyr",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "From Railroad to IT: Career Change at 34—Now 40 and Grateful I Took the Risk",
    "text": "Hey everyone,\n\nI wanted to share my journey in case it helps someone who’s feeling stuck or unsure about making a career change later in life. Especially those of us in our 30s and 40s who wonder if it’s “too late” to start over.\n\nAt 34, I left a six-figure job as a freight train conductor. The money was good, but the 60+ hour weeks, dangerous work, and time away from my wife and newborn pushed me to rethink everything. I had no degree, no certs, and no professional IT experience—just a lifelong interest in computers and tech.\n\nI used my Post-9/11 GI Bill to enroll in community college for software development. After two years of pushing through advanced programming classes, I came to a tough but honest realization: I wasn’t built for coding. I just didn’t enjoy it—and that’s okay.\n\nThankfully, I landed an internship in a local school district’s IT department. I started out repairing Chromebooks and running cables, but the experience changed everything for me. I discovered how much I loved support work and being hands-on with users and systems. That internship turned into a full-time IT Support Technician role, where I worked with an amazing team and truly felt valued—for the first time in a long time.\n\nFrom there, I earned my BS in IT, and moved into a Systems Administrator role at a defense contractor. Within the first six months I picked up Security+, and a Secret Clearance. Currently in my second term working towards an MBA. \n\nEventually, I was promoted. Now a year later I am moving on to another Defense Contractor and will begin earning a salary that rivaled what I had at the railroad—but now I work 40 hours a week instead of 60+, I enjoy what I do, and I get to be there for my family. \n\nCareer Path Summary:\n\n2019 - Left Railroad, enrolled into school FT\n\n2020 – IT Intern (School District) – $16/hr\n\n2021 – IT Support Tech (School District) – $55K\n\n2023 – Systems Admin I (Defense Contractor) – $72K\n\n2024 – Promoted to Sys Admin II – $86K\n\n2025 – New Company as Info Systems Engineer II - $110k\n\nI’m 40 now. And I’m telling you—if you’re thinking about switching careers into IT, it’s not too late. But be honest with yourself. Don’t force yourself into a niche just for the salary. IT is a huge field. There’s a spot for everyone—support, networking, sysadmin, security, project management, you name it.\n\nIf I could tell my younger self one thing, it’d be this: Take the risk sooner. You can always recover from a wrong turn, but you can’t get back the time you didn’t try.\n\nIf anyone reading this is at a similar crossroads, feel free to reach out. I know how scary it is—but I also know how worth it it can be.\n\nWishing all of you the best in your journeys.",
    "score": 496,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kwxjyr/from_railroad_to_it_career_change_at_34now_40_and/",
    "created_at": "2025-05-27T20:14:51.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1k24tkn",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Don't put up with bs in your job",
    "text": "About a month or 2 ago, I posted in this sub about my current job asking me to do some odd tasks while they looked for a new maintenance guy. This included cleaning coffee machines, cleaning leaves out of storm drains, and painting.\n\nMost of the comments on my original post were negative telling me to suck it up, quit bitching, and not to leave my job in this economy. \n\nI started applying anyway, and ended up receiving 25k over my current salary, a better title, and more PTO with a new company.\n\nDon't put up with it and don't listen to others when you feel you are being disrespected.",
    "score": 469,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1k24tkn/dont_put_up_with_bs_in_your_job/",
    "created_at": "2025-04-18T13:22:48.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1mj3ihg",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "20k&gt;162k in 8 years. Here’s how it happened.",
    "text": "This is gonna be long as shit. Sorry.\n\nI keep getting asked about my job progression when I post about my current salary, and I figure it’s about time to post one of these career maps to help others get a sense of how I got here. Keep in mind, when I broke into IT it was definitely easier than it is now, but I still think the path I took still exists for anyone motivated beyond just money and finding a cushy remote gig. This played out in the Greater Boston area where cost of living has skyrocketed so your mileage may vary.\n\nBefore this, I worked retail for 7 years at the same grocery store from 16 to about 23. I went full time training to be a front end dept head because I really had no other prospects and I didn’t yet know IT was a plausible career for me without having a degree. I worked for an extremely toxic manager and got panic attacks about engaging with her at work. I began trying to find any way out and started looking into how to break into IT. This went into overdrive when I quit on the spot one day after I found out she launched an over the top investigation into me being short 15 dollars after I performed a drawer sweep. Anywho, onto the good stuff. I had a few roles on here that I won’t list because I was at them for less than a month each.\n\n**First Role: Cell Phone Repair for 20k from 2016 to 2017**\n\nI was here for one year. This role wasn’t glamorous, didn’t pay well, and was very far from home. Fortunately, I was young and still living with my folks. I didn’t have an A+ and didn’t have the patience to get one, so I did the best I could to find ANYTHING tech adjacent, which landed me here. I fixed phones and consumer laptops. The job sucked monetarily and I hated commuting there but I actually met some lifelong friends there who I am still very close with now. I kept my eyes on the plan, and told myself to stick it out for the good of my career. I did a year there.\n\n**Second role: Imaging PCs and doing light desktop support for 33k from 2017 to 2018**\n\nI was here for one year. Another role that wasn’t glamorous but I was so excited to just be away from retail and doing something that got me on my way to a career in IT. I spent my days imaging laptops for employees, prepping dozens of lab devices for projects, troubleshooting issues that came up during both processes and kinda just dicking around with my Nintendo Switch while PCs ran through scripts. I left this job for a role at an MSP for about 55k that I ended up leaving after 3 weeks due to a highly aggressive commute, a toxic atmosphere, and a profound sense that I made a wrong decision.\n\n**Third role: Small business sysadmin for 55k from 2018 to 2019**\n\nI credit this role with launching my career in a real way. I interviewed for a “Help Desk” job with a small manufacturing company, about 60 people. At the interview I learned they wanted much more than just help desk. They wanted to fire their MSP, and have the candidate run their environment entirely. Systems, network, licensing, budgeting, infosec, backup and DRDA, you name it. Funny enough, when I posted about this role before accepting it a certain cranky system administrator on this board told me the experience was going to teach me awful habits and I’d never be able to transition to a big company.\n\nI was way under qualified but if I learned anything from years of browsing this sub it’s that breaking the sysadmin ceiling is the hardest thing to do in IT and I was eager to do it so I rose to the occasion. I took on way too much for (in hindsight) painfully little pay but I learned a lot. I put SSDs in their old PCs, gutted their old box servers in favor of new hypervisors, set up folder redirection their devices, enrolled them into 365, etc. It was a lot of modernization for them and I learned a lot. I also took on a lot of super unique and weird issues. Weirdest I saw was having to fix the PC that was attached to a 50 year old cutting instrument. Ever try troubleshooting RAM issues in DOS? There’s not much info online I’ll tell you, and finding 32kb of free RAM is harder than you might think.\n\n**Fourth role: System Admin for 65k from 2019 to 2020**\n\nThis job sucked. I was hired to be a sysadmin but was a glorified help desk level 2. My boss was flaky and the job was unsatisfying. The interview process tossed up red flags left and right and I learned a lot about scrutinizing opportunities that seem too good to be true from that experience. I was laid off right before the pandemic. Role lasted about 7 months total.\n\n**Fifth role: MSP System Engineer for 72k (left at 86k) from 2020 to 2022**\n\nSysadmin duties and long term consulting and planning for Biotech startups and small businesses. A lot of cloud planning, a little MDM, a lot of jack of all trades’ing. I don’t find this job to have been very stimulating to my skill set but the perks were cushy and most of my clients let me come and go as I pleased. I worked from home when I wanted and came onsite when I wanted (outside of situations where I was actively needed)\n\n**Sixth and current role: Infrastructure Engineer for 143k (currently at 162k) from 2022 to now**\n\nOnsite three days, work from home two days. Four hours of on call a month and needing to be available for major outages that might impact business the following weekday.\n\nAll sysadmin and engineering duties as needed. This role was where I finally was able to consider myself a network engineer. A lot of our systems are abstracted into datacenters and our core network egress and ingress point is routed states away, so a lot of what I was used to working on (patching, hypervisor management, storage, etc) is being managed by an MSP (who also hosts our datacenter) so I had to skill up elsewhere.\n\nI spend my days doing a mix of everything. A lot of network hardening for our branch locations, biggest project last year was setting up failover DMVPN circuits. I also take part in lots of app rollouts, server and system builds, and the in house automations for the company like SFTP transfers and coordinating privileged access to things like our DMZ. This year the big one is MDM rollout with Intune and Windows 11 (MDM and Cloud I think are my long term aspirations). We are a bank and half of my job is fighting with our limitations imposed because of auditors.\n\nAll of this growth happened without a degree or a single cert to speak of, although I can tell that I’m maxing out on what I can achieve without one of the two. For certs I’m targeting CCNA (I find myself to be able to hold my own on the network side now, but I really want to make sure I have my gaps covered), Azure Administrator, and MDM Administrator in the near future.",
    "score": 450,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1mj3ihg/20k162k_in_8_years_heres_how_it_happened/",
    "created_at": "2025-08-06T12:37:27.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1ita5oh",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Landed a job with no certifications or experience",
    "text": "Started studying IT about 6 months ago completely tailored my resume to a help desk role and set up my LinkedIn. Once I felt comfortable enough to explain some networking concepts I started applying for jobs, I landed an interview at a high school as a IT support specialist. \n\nTo prepare for the interview I set up a home lab  and showcased how to set up Active Directory and manage group policies because it was mentioned in the job description. I documented my steps on google docs printed it out and presented it at the interview. \n\nWell today I was offered a salaried position at the school with no certifications or IT experience. I wanted to share this to anyone that’s on the edge of making the career change or still trying to break in. Don’t lose hope and don’t give up and keep in mind customer service skills are so important. \n\nThis is just the beginning of my journey and I look forward to what comes in the future ! ",
    "score": 404,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ita5oh/landed_a_job_with_no_certifications_or_experience/",
    "created_at": "2025-02-19T16:51:10.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1nmapst",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I optimized my LinkedIn profile and got a job in 2 weeks (I'm a software dev).",
    "text": "Hello. Will try to save your time right away. The one-liner to take away from this post will be: If you’re struggling to get your next job in IT, then go and optimize your LinkedIn profile now. If this piece of advice sounds pretty obvious to you and you already know how to do it properly, then that’s it, you can skip the post :)\n\nI’m subscribed to multiple IT subreddits here related to software dev, DevOps, etc. 2-3 times a week, with pretty impressive stability, I see new posts about how dead the market is right now and how impossible it is to find a job even for experienced professionals. I just want to share my little story, in case it helps anyone. Even if it’s just a single person.\n\nI’m a software dev. Not junior, I have solid experience. I got into a big layoff wave and was looking for a new job. My biggest problem was that I’m currently located in LATAM, but was looking for EU/US-level salaries (I work only 100% remotely).\n\nLong story short. I thought the IT market was very bad right now (and realistically it is worse than 5 years ago, but it’s far from being dead). I had a LinkedIn profile, but I was receiving almost no messages from recruiters. I was applying from time to time to positions and my applications were usually automatically rejected.\n\nThen one day I was having a conversation with ChatGPT about my job search problem, the stability of the IT market, etc. And AI raised an important question: “Is your LinkedIn profile actually optimized for the next role that you’re looking for? Because if not, maybe the recruiters simply can’t find you, because you’re invisible to them.” The next thing I did (and I advise you to do the same) was provide ChatGPT my full dev experience description and ask for help to update my profile. I don’t fully know how it works under the hood of LinkedIn, but the update made my profile more visible to recruiters for the targeted keywords. So what I did is basically going through with ChatGPT section by section and updated:\n\n1. Headline (the most critical part). What I had before was something like: “Fullstack developer / DevOps.” It became: “Senior Node.js Engineer / Fullstack Developer (Typescript, React, DevOps, Cloud)” - it now contains keywords of technologies that I aim for right now in my next position.\n\n2. About section. It was very short. We changed it to something more informative and formatted: short opener (who I am and years of experience) + bullet-point highlights (my tech stack: backend, frontend, DevOps, cloud) + strong focus on impact (what I bring to the table, like scaling systems, leading projects, etc.) + in my case a note about 100% remote work.\n\n3. Experience. My role descriptions for previous jobs. Before, they were focused more on the tech I used in every position + my duties. I extended them with actual achievements in every project + optimized texts for stack keywords (Node.js, React, NestJS, Kubernetes, AWS, and other relevant ones).\n\n4. Skills. I had it almost empty before. So I added all relevant skills (tags). Btw, you can also order this section by putting the most important skills on top (recruiters usually won’t read the whole list). Ah, and another thing: endorsements. I opened profiles of my previous colleagues and endorsed their skills. They got notifications about it, and some of them did the same for me - I didn’t even have to ask explicitly.\n\n5. \"Featured\" section. In my case it’s empty, but you can put your personal website, GitHub profile, downloadable CV, etc.\n\n6. Banner. I had no banner until AI told me I could create one :D I added a calm gradient banner image. Very minor thing, probably no impact, but still cool.\n\n7. Open to work settings. Check if these settings are configured for the correct job type. In my case, it had ticks for onsite and hybrid work enabled, so I was receiving mismatched offers sometimes.\n\n8. Location. In my case it was okay/precise, but check yours.\n\n9. Small posts. This was the hardest part for me, because I’m usually too shy to post stuff, especially in a circle of ex-colleagues, friends, etc. If you have nothing to post about, it can be something neutral: a useful link to an article you liked (with a small comment), some actual news, a piece of advice, maybe even a post-question to the community, or some funny tech stuff. Whatever. The idea is to show LinkedIn’s internal algorithms that your profile is active.\n\nThe outcome: I now receive 1-4 messages from recruiters a day (usually 1–2), vs 1–3 messages per month. Also, these messages are more accurately matched with my profile (for example, before I could receive GoLang offers, even though my Go experience is very limited). As a bonus, I found my next position in 2 weeks after I made the change. I’m starting next month, day 1 (congratulations are welcomed :D).\n\nAdditional piece of advice: If you rely not just on recruiters contacting you but also apply yourself by sending CVs (including on LinkedIn), go through your CV with ChatGPT and optimize it for ATS. Today, most companies use ATS systems that will auto-reject your profile if ATS thinks you don’t match. You won’t even reach HR. Not sure how accurate this data is, but from what I found:\n\n* Big enterprises = 95%+ use an ATS.\n* Mid-sized companies = 70–80%.\n* Small companies = 30–50%.\n\nIf the company uses ATS, when you apply on LinkedIn (Apply or Easy Apply) it gets redirected into the ATS via integration. And ATS scans your CV and makes a decision. Same thing for applying through an external company website. AI helped me optimize my CV to have a good keyword density + still recruiter-friendly text + simple design that won’t confuse ATS systems.\n\nNot trying to advertise LinkedIn or ChatGPT, just sharing my experience which worked extremely well for me.",
    "score": 391,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1nmapst/i_optimized_my_linkedin_profile_and_got_a_job_in/",
    "created_at": "2025-09-20T21:54:11.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1jw9sat",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Has anyone noticed a drop in IT salaries?",
    "text": "I’m just wondering if this is maybe the area I’m in but most of the IT jobs in my area pay max 35k to 40k. I could have sworn just a few years back helpdesk salaries were around 50-60k but I’m seeing helpdesk jobs paying as little as 13-14 an hour in my area. Even for higher level roles I’m seeing system administration roles pay 45-50k (which I think is pretty good for my first role) which is what I’m making now as a technician. Is this due to the influx of entry level employees causing salaries to drop? I’m just wondering if I’m crazy or if anyone else noticed this. I go to look for other jobs in my area but it seems for entry level that I’m not going to get anything that pays more than where I’m at.",
    "score": 368,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jw9sat/has_anyone_noticed_a_drop_in_it_salaries/",
    "created_at": "2025-04-10T21:48:42.000Z",
    "num_comments": 241
  },
  {
    "id": "reddit-1i2cg15",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "From no professional experience to $30/HR in one year ",
    "text": "I’ve seen a lot of posts for inspiration lately and I wanted to chime in. You can do it! All I can say is that you have to put yourself out there and network. \n\nI quit my job as a property manager beginning of 2023 as my wife was employed so she could support us while I focused on my career change. Due to unforeseen circumstances she got laid off a month later which put us in a difficult position. I studied my butt off for certs and got my A+ with about 2 months of study. By this time it was April and I started applying like crazy. I was getting no responses at all and had to pick up a server job to support our bills as our savings was running out. I was getting interviews here and there but no results until one day I was serving a customer and they were wearing an IT shirt. I asked him how he got into the business and what I can do to propel myself and get noticed. We chatted for quite a bit and he ended up passing me a number to a recruiter. I reached out to the recruiter and was set up with an interview immediately and got the job about a week and a half later as a PC Tech I for the city government as a 6 month contract employee. The pay was $20/HR with zero benefits or holidays but I made sure to keep improving and gained my Security + a few months later and stood in great standing with my peers. \n\nThey ended up offering me a full time position but by this time I got an offer for Technical Analyst II at an MSP as a fully remote employee. This job was for a small MSP that paid $55K a year with benefits. Within 4 months I was up for promotion and was promoted to a Cloud Solutions Analyst which brought my pay to $60K. I enjoyed working there but the growth didn’t align with what I wanted to do so I started applying again with my newly learned skills and updated resume. \n\nI ended up getting an interview with a real estate software company and negotiated my salary to be $30/HR which is roughly $62,400 a year with full benefits and more flexibility albeit in the office 2 days. Currently, I am enjoying my position here and learning as much as I can. Also making sure I’m putting myself out there to expose myself to different technologies. \n\nSo from August 2023 to August 2024 I went from a $20/HR contract job to full time $30/HR full benefits job. I know if I can do it then you can do it! Don’t give up!",
    "score": 319,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1i2cg15/from_no_professional_experience_to_30hr_in_one/",
    "created_at": "2025-01-16T00:36:42.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1l4z8e3",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Did I fuck up? Declined a big salary increase.",
    "text": "\n\nSo I’m currently at a job where I make decent money, 71k. \n\nI’m at zero risk for layoffs essentially, retirement is great, I can work from home a bunch (I still have to go in twice a week), etc.\n\nI got a job offer for 95,000 a couple weeks ago, but I said no, and for a few reasons:\n\n1. The company is having an RTO - and I’m fine with working in office, but they forced an RTO upon people living in other states. The manager I was talking to didn’t even know if they were staying due to RTO - they said “if I didn’t have to move, I’d stay, but they’re forcing us to move. So I don’t know if I’ll be able to stay”.\n\nRTO was brought up each time in a bunch of my interviews.\n\n2. The work environment just looked hella depressing in office, no one was talking to each other, just bad vibes and a gut feeling I guess. \n\nRecent Glassdoor interviews are extremely negative; but it seems to be because of RTO? \n\nMy commute would’ve been from 20 minutes to 45 minutes to an hour. I can move but housing is a little more expensive in the new area.\n\n3. I was still interviewing for another position that I vastly would’ve preferred but it was taking forever. I finally got a rejection from that position, but at the time I was in serious consideration.\n\nDid I fuck up? I know that’s a huge salary increase, so I feel dumb saying no. ",
    "score": 292,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1l4z8e3/did_i_fuck_up_declined_a_big_salary_increase/",
    "created_at": "2025-06-06T18:08:00.000Z",
    "num_comments": 191
  },
  {
    "id": "reddit-1ido8ex",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Been told I work too fast",
    "text": "I recently made a big salary jump and left the MSP field after starting my IT career in it over 10 years ago. \n\nFor reference - I had to log every minute of my day and had to be over 75% billable in a week at most MSPs, almost sweat shop stuff. In order to get those numbers, you work fast, efficient, and had to plan out your day by sprinting and other forms of planning.\n\nHad my weekly 1 on 1 with my director this week and they mentioned that although I work incredibly fast, efficient, and a wealth of knowledge - they would like me to slow down and have other people be part of the process.\n\nDefinitely going to ask my coworker to be part of my work if they want, but has anyone else encountered this before? I am all ears on tips and suggestions so I can be a better coworker.\n\nIt's been a huge shift moving from a decade of pure MSP to internal and want to be the best coworker /team player I can to them",
    "score": 275,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ido8ex/been_told_i_work_too_fast/",
    "created_at": "2025-01-30T14:31:30.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1ipbq68",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "What’s the biggest salary jump you’ve had in IT?",
    "text": "Curious to hear from others in IT, what’s the biggest salary jump you’ve had in your career?\n\nIt could be from switching companies, negotiating a raise, moving to a new industry, or even a career pivot within tech.\n\nIf you’re willing to share, please include:\n• Previous title &amp; pay\n• New title &amp; pay\n• YOE at the time\n• Location cost of living (LCOL/MCOL/HCOL/VHCOL)\n\nLooking forward to seeing everyone’s experiences! ",
    "score": 271,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ipbq68/whats_the_biggest_salary_jump_youve_had_in_it/",
    "created_at": "2025-02-14T14:26:52.000Z",
    "num_comments": 416
  },
  {
    "id": "reddit-1jz5aok",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Is making $75-80k+ in IT still realistic for a non-enthusiast?",
    "text": "I've been in IT for 5 years with a BS degree and I'm currently making $55k. My goal is to reach around $80k, but I'm starting to wonder how realistic this is in today's job market.\n\nFrom what I've observed, the IT field seems increasingly saturated. I didn't go into this field because I'm passionate about tech - I don't play video games in my free time, and if it were up to me, I wouldn't touch technology outside of work. I chose IT as a practical career path, but the industry seems to be favoring those who are tech enthusiasts.\n\nI'm wondering about others' experiences trying to advance in IT without making it your entire identity. Is it still possible to reach $80k for someone who sees IT as just a job rather than a passion? How long did it take you to reach that salary level, and what was your path to get there?\n\nI dont meant to say I didnt expect this career to take work. Of course any field takes work to get promoted.. But with entry and mid positions getting incredibly saturated the expectations are rising. I never got into this field to be rich, but to live comfortably enough to own a home, travel a bit, and raise a small family. That doesnt feel in reach currently and with the trajectory of the market it doesnt seem like things will get easier.\n\nedit:  \nI live in Raleigh NC\n\nMy background\n\nBS in IT Management/Cybersecurity (2019), CompTIA Security+ (2022)\n\n* IT Intern at community college (4 months)\n* Help Desk Specialist (contract, 2 months)\n* Tech Support Tier 1 (10 months)\n* Tech Support Tier 2 (3.5 years)\n* Current: Director of IT (inflated title) at a school (7 months) - managing Chromebooks, ticketing system, IT policies, and support\n\nedit: I am not saying I hate It. I just dont go home and tinker with computers in my free time for fun. My passions make no money. Art, music, running, cycling, photography... I had to choose a career that made money and tech just made sense to me. I dont want to set up servers or play with networks in my free time though, unless its necessary career development.\n\nsaying find a job your actually passionate about doesnt work for everyone.",
    "score": 225,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jz5aok/is_making_7580k_in_it_still_realistic_for_a/",
    "created_at": "2025-04-14T17:56:24.000Z",
    "num_comments": 203
  },
  {
    "id": "reddit-1nab3c8",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Anybody have any IT “side hustles”?",
    "text": "Wondering if anybody has any side hustles outside of their normal 9-5 that are IT related. \n\nHow did you get started? \nWhat do you do? \nDo you have any advice? \n\nCurrently on the job search and hate that feeling like my life depends on another employer. Do I expect it to pay what a salary will? Of course not, I just want that extra security/ safety net in case times get rough. \n\nTYIA ",
    "score": 224,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1nab3c8/anybody_have_any_it_side_hustles/",
    "created_at": "2025-09-06T21:17:34.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1kmbzml",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Non-IT people migrating into IT roles.",
    "text": "I am CSE graduate and I have 6 YOE.\nI am making this post after hearing about layoffs, minimal jobs etc.\n\nI have seen many people migrating into IT field even if the salary is less, hoping that in future salary will grow exponentially.\n\nHowever I feel completely opposite. \n\nIT golden days are over. \n\nWith everyone coming over to this side, there are simply more supplies than demands and thus, companies choose people who can do work with minimum salaries. Some people may disagree but AI has part in it too.\n\nWhat do y'all think?",
    "score": 219,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kmbzml/nonit_people_migrating_into_it_roles/",
    "created_at": "2025-05-14T10:43:08.000Z",
    "num_comments": 134
  },
  {
    "id": "reddit-1k0vei6",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Is it just me or the market is really that bad?",
    "text": "I have 6 years of IT experience, 3 years as a Sys admin with a CS degree and I’ve been wanting to job hop my job the past year.\n\nI am slightly picky about what jobs I apply for (the ones that say weekends as needed/overtime I completely ignore) but not too picky, I’m okay with full in office.\n\nBut wow I’ve gotten maybe 6 interviews. I’ve gotten 1 offer but the pay increase wasn’t that large so I saw no reason to hop. \n\nIt seems like unless you’re a unicorn for a position even in the mid level the competition is immense. \n\nIt also seems like salaries have gone down a lot. I make 77k at my current position but want 95-100 at my next and the job pool is really small for that salary, when a few years ago basic Sys admins were making 100k. \n\nJust want to know if it’s something I’m doing wrong or not. ",
    "score": 208,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1k0vei6/is_it_just_me_or_the_market_is_really_that_bad/",
    "created_at": "2025-04-16T21:03:22.000Z",
    "num_comments": 172
  }
]