[
  {
    "id": "reddit-1hpynb0",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I GOT THE JOB!!! 60K A YEAR",
    "text": "After years of being adrift and working every odd job under the sun. I finally got a job as an IT technician! No certs no degree (in school now). Mostly remote too. I’ve never been salaried before so this is all new. It’s a growing company so I’m getting in on the ground floor. Plenty of room for growth. I’m honestly still in shock. I will admit I feel under qualified and like I have a lot more need to learn. I’m going to brush up on my A+ tho! Anything I should know? Tips? From corporate culture to just what to expect from my first tech job? Any and all advice is welcome!",
    "score": 1832,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1hpynb0/i_got_the_job_60k_a_year/",
    "created_at": "2024-12-30T21:56:11.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1jb5psx",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Rant: Just found out a good friend who's hiring is \"that guy\".",
    "text": "A friend of mine is the IT manager of a medium sized company. Yesterday I was sitting in his office, and he was talking about how he's not getting any \"qualified\" applicants for a couple of entry level positions he has open. These are positions that mostly involve imaging new builds, replacing broken keyboards, changing out toner cartridges, occasionally patching in a network drop, etc. The positions pay $36.5k / year. Granted it's in a LCOL area in the Midwest, but still.\n\nSo I'm flipping through this stack of 20+ resumes on his desk, and it's all recent college grads, or post high school with A+ - basically, exactly the resumes you would expect for a position that *you, yourself,* are calling \"entry level\".\n\nNope! He want's someone with *at least* six years of experience and a four year degree or multiple progressive certs. For $36k a year. To change out toner cartridges and plug in keyboards. We've all heard of companies like that, but I guess I'd just never come face-to-face with that line of thinking.... Honestly didn't even know what to say.\n\nEDIT: For everyone asking: The next time we're sitting around drinking beers on his porch, I'll have no problem tell him he's a fucking idiot. But I wasn't going to call him out in his office, at his job, with other employees around. I also don't know what his budget looks like. This could be beyond his control.",
    "score": 1700,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jb5psx/rant_just_found_out_a_good_friend_whos_hiring_is/",
    "created_at": "2025-03-14T14:51:47.000Z",
    "num_comments": 216
  },
  {
    "id": "reddit-1kmosh9",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "JUST RECEIVED A JOB OFFER!",
    "text": "**HEY GUYS!** I just landed a job offer for $60,000 a year and I’m absolutely thrilled! It’s been a wild ride job hunting since March—hundreds of applications, 20 interviews, 18 rejections, 2 companies moved forward with second-round interviews (I failed both), and then this one came through after just a single interview stage. 🙌\n\nI’ve only got 9 months of IT experience, and now I’m officially a **Network Technician**! 🤯\n\nWent from making $18/hr at a help desk position to locking in a full-time **salary** role—$60K, baby!! Let’s goooo!!\n\nI have a BS degree in IT from WGU, as well as the CompTIA A+, Network+, and Security+ certifications, along with the AWS Certified Cloud Practitioner, ITIL 4, and Linux Essentials.  \n  \nTo be honest, I don’t even know how I got the job. Most of the interview questions they asked, I didn’t know the answers to. I just told them that I don’t know much, but I’m willing to learn.",
    "score": 1661,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kmosh9/just_received_a_job_offer/",
    "created_at": "2025-05-14T19:55:05.000Z",
    "num_comments": 282
  },
  {
    "id": "reddit-1kwswnn",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Quit looking to do IT; it’s not worth it.",
    "text": "Honestly, this job feels like a joke sometimes. If you’re cool with being a glorified nerd and under appreciated, then maybe it’s for you. But don’t buy into the hype — the pay isn’t nearly as great as people make it out to be. I’ve got 6+ years of experience, and my friends in the trades are clearing way more than I am, with half the stress and none of the corporate nonsense.\n\nMost companies expect you to be an entire IT department in one body — sysadmin, help desk, cybersecurity, project manager, cable runner, and unofficial therapist — all rolled into one. And they want to pay you like you just learned how to reset a router.\n\nIt’s a never-ending grind of certs, degrees, and “keeping your skills sharp” just to stay in the same place. Half the stuff you’re pressured to learn? You’ll never even touch it in the real world. Just fluff to tick a box on a job listing.\n\nRespect? Forget it. You’re invisible when things work and public enemy #1 when Karen’s printer won’t connect. Everyone’s got jokes until the network goes down — then suddenly you’re supposed to be a magician. People laugh when I say I work in IT.\n\nAnd moving up? Good luck. It’s less about skill and more about kissing the right ass. Office politics and fake enthusiasm get you further than real knowledge. You could be carrying the whole team, and still get passed over.\n\nI hope this offends a few nerds who think they’ve “made it” — maybe you need a wake-up call too. IT can be useful, sure, but don’t act like it’s the golden path. If you don’t absolutely love this field or have a clear exit plan, you’re probably wasting your time.\n",
    "score": 1654,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kwswnn/quit_looking_to_do_it_its_not_worth_it/",
    "created_at": "2025-05-27T17:14:28.000Z",
    "num_comments": 674
  },
  {
    "id": "reddit-1ks0nym",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "CEO leaked I'm getting laid off",
    "text": "Hello,\n\nThe CEO at my job replied to an email with me accidentally cc'd to the company lawyer this morning with a list of folks for separation agreements. They will begin preparing the drafts today and meet tomorrow. I assume I'm getting laid off Friday. \n\nI plan on taking PTO tomorrow but how should I address this if I bump into the CEO today? I've never been in this situation before. I'm currently sending out applications on indeed and trying to stay positive. I could use some professional help if anyone wants to review my resume. Thanks everyone!",
    "score": 1625,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ks0nym/ceo_leaked_im_getting_laid_off/",
    "created_at": "2025-05-21T15:26:55.000Z",
    "num_comments": 320
  },
  {
    "id": "reddit-1jj1ilw",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Stop Applying to IT Help Desk Jobs If You Can't Even Google a Problem",
    "text": "Look, I get it. Everyone wants to break into IT. The help desk is a common entry point, and I respect people trying to start their careers. But for the love of all that is holy, if you don’t know basic troubleshooting, you have no business applying.\n\nI’m talking about people who:\n\nDon’t know how to ping an IP address.\nHave never used the command line.\nThink turning it off and on again is some kind of joke instead of the golden rule.\nCan’t even explain what DNS does.\nHave never, in their lives, Googled an error message before asking for help.\nI sit in interviews with people who claim to be “passionate about IT” and then blank out when I ask them how they’d troubleshoot a printer not working. A PRINTER. If you can’t handle a basic, day-one issue, why are you applying to a role where 90% of your job is literally fixing basic issues?\n\nI’m not saying you need a CompTIA cert or years of experience, but at least show that you’ve tried to learn something. Set up a home lab. Watch YouTube tutorials. Get familiar with basic networking. Hell, just tinker with your own computer a little!\n\nI’d rather hire someone with zero formal experience but a clear eagerness to learn than someone who just wants an easy job in tech and expects to be spoon-fed solutions.\n\nAnyone else dealing with this flood of unqualified applicants? It’s exhausting.\n\n\nEdit: I guess this post triggered the incompetent mods and they banned me.",
    "score": 1391,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jj1ilw/stop_applying_to_it_help_desk_jobs_if_you_cant/",
    "created_at": "2025-03-24T20:48:47.000Z",
    "num_comments": 308
  },
  {
    "id": "reddit-1ir46b3",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Didn’t realize it was this bad",
    "text": "Recently my job opened up a new position on my team that I’m going to be conducting interviews for.\n\nWithin 24 hours we had over 3k applications. Thats 3k for a general senior position.\n\nA little over 600 were from people without the proper background and were thrown out, and around 1300 were entry level (2 years or less of experience) and were thrown out. So we had around 1200 left of people qualified for the actual role.\n\nIts insane, the first guy we’re interviewing was a senior engineer back in 2004, and has since went on to become a principal engineer for a big name company.\n\nIm honestly a little shocked that the market is THIS bad where someone like this would even apply to this position thats so many levels below what he currently has. Also, how are actual regular mid career folks supposed to compete against these behemoths? ",
    "score": 1191,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ir46b3/didnt_realize_it_was_this_bad/",
    "created_at": "2025-02-16T22:14:03.000Z",
    "num_comments": 386
  },
  {
    "id": "reddit-1ma04es",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "To those who want to get into IT, full remote, six figures , with no experience",
    "text": " I work at AWS as a sys engineer making 125k (L4 pay) People don’t get how fucking hard it took here, 3 rounds of interview, 2 technical ones. I’m not a SDE but still grinded leetcode and got my certs in SAA and Cloud+. \n\nOn top of that I had to mass apply like a maniac since my freshman year as in 30 apps a week, to get a couple of internships to set the best outcome for me possible out of college. My GPA never went under a 3.8 and I made sure to TA and volunteer early on. \n\nLike the point is, it makes me sick people think they can skip all of this and get to that salary, it just sounds so entitled hearing “can I get into tech with just my A+, full remote, and pays at least 100k.” The amount of post I see per day asking this is just disgusting, yes it sounds like I’m gatekeeping from the field, but tbh I would not really have an issue with people who wanted to get into this field, did their research that market is rough, and have realistic expectations on what they need to get their first helpdesk job.\n\nWhy does everyone keep looking at the one guy who made six figures, no experience. It’s a one off situation, why does everyone keep people suddenly think they’re built different than others after seeing one YouTube video? \n\nAlso spoiler alert, majority of people in IT don’t make six figures, there’s a reason why six figures is the top 15% in the US. within that 15% there are doctors, lawyers, politicians, other engineers unrelated to tech. So how many tech people do you really think make six figures? Be real people, and if you’re in IT or getting into IT, you should have the logical comprehension to figuring that shit out. ",
    "score": 1036,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ma04es/to_those_who_want_to_get_into_it_full_remote_six/",
    "created_at": "2025-07-26T18:09:38.000Z",
    "num_comments": 490
  },
  {
    "id": "reddit-1lm7g0n",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I’ve hired over 30 IT pros in the last few years and here’s what I’ve learned that surprised me.",
    "text": "Not all of our best hires had degrees from big-name schools or the most impressive resumes. A few didn’t even do great on the technical test. But they stood out in other ways and ended up being some of our strongest team members.\n\nHeres what they did have:\n\n* They communicated clearly and confidently\n* They were resourceful and didn’t wait to be told what to do\n* They were genuinely curious and always looking to learn\n\nI’m still figuring things out as I go, but thought I’d share in case it helps someone else who’s hiring (or job hunting).\n\nWhat have you noticed when it comes to spotting great people in tech, either as a manager or as someone who's been on the other side of the table?",
    "score": 980,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lm7g0n/ive_hired_over_30_it_pros_in_the_last_few_years/",
    "created_at": "2025-06-27T22:46:14.000Z",
    "num_comments": 181
  },
  {
    "id": "reddit-1k5jusg",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Just got cussed out by a doctor",
    "text": "I (24M) have been doing IT for a chain of clinics for over a year with no issues—until today. I was on a call helping a doctor with some software. About 10 minutes in (only 4 of which I was actually on his laptop), he snapped and said, “I have shit to do and you’re just fucking around. Can you get someone who knows what the fuck they’re doing?”\n\nI had just uninstalled the app and was about to reinstall it. I told him, “You don’t have to talk to me like that,” and he kept cussing me out. My team lead overheard and took over the call. I was heated, so I stepped out and took a walk to calm down.\n\nLater, I told my manager I needed the rest of the day off, and he was understanding. He also said he heard the call, confirmed I did everything right, and that they’re reporting it to HR and the CEO. Still, I doubt anything will happen—he’s a doctor and brings in money.  \n\nNot looking for advice or anything just ranting maybe I am in the wrong but idk. My parents and manager says I shouldn’t let stuff like that get under my skin but I’m not used to be talking to like that especially when I’m helping someone. I need to get out of help desk. \n\nUpdate: I want to clear up a few things. I do not work for an MSP — I’m directly employed by the clinic. That means the doctor involved isn’t just some external client; he was my coworker.\n\nAlso, I did not take the entire day off. I only left one hour early.\n\nAfter speaking with management, I learned this isn’t the first time this doctor has acted this way. Management is fully on my side. They’ve already spoken with HR and the Chief Regional Officer (CRO) about the situation.\n\nThey made it clear this incident does not affect my standing with the company in any way. They told me they know my character and how I treat our users. They specifically mentioned I’m typically very calm and professional, and that it takes a lot to get a reaction out of me — so they understood that the doctor must have said something inappropriate.\n\nFor context, the first six minutes of the call were me trying to connect to his laptop using LogMeIn123, which anyone familiar with the tool knows is a standard part of our process.\n\nManagement also let me know the doctor has since apologized.",
    "score": 967,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1k5jusg/just_got_cussed_out_by_a_doctor/",
    "created_at": "2025-04-22T22:44:12.000Z",
    "num_comments": 345
  },
  {
    "id": "reddit-1itjm3h",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "From $19/hour to $31/hour, I am so scared, what to do?",
    "text": "I've been at a copier company installing copiers on local businesses network. I set up scan to email and smb and troubleshoot printing issues and those above.\n\nI interviewed for another job for on-site support tier 1. They asked a lot of questions about azure and cloud usage, and Active Directory. I have no experience in either. I was honest about that too.\n\n3 weeks later after the interview they called and offered the job at $31 and hour! I nearly gasped. That's such a jump from $19.\n\nI'm so scared. Like imposter syndrome that I shouldn't be getting this money or position. What to do?\n\nEdit: thank you all for the kind words and encouragement. I'm very nervous but I will give it 100% effort to learn as much as possible",
    "score": 961,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1itjm3h/from_19hour_to_31hour_i_am_so_scared_what_to_do/",
    "created_at": "2025-02-19T23:11:09.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1kxtcr3",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Just want to offer a cheat code",
    "text": "I say this every now and again. If you want an unlimited money and job glitch when it comes to IT/tech.  Go cyber guard/reserve Air Force, get the free training, grab the top secret clearance, and then just profit from there.  \n\nEDIT: this post pissed some people off somehow lol.  Just wanted to show lost people an option. If it’s not for you then hold back the tears and keep it moving.  Also, I am not a recruiter and can’t help you in the process of joining. Just wanted to possible open a path\n\nEDIT2: thanks for all the interaction folks :] I feel like I genuinely helped some folks!! I don’t feel like my calling is IT or tech. I enjoy helping people the most but there isn’t much room to raise a family for helping people for free so I’m gonna stick to my career in the meantime. \n\nEDIT3: like I’ve said though, I will not be helping any of you through the process of actually getting started because there are way to many of you asking for it.  I just wanted to open the door, now you have to do the research and see if it’s right for you",
    "score": 865,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kxtcr3/just_want_to_offer_a_cheat_code/",
    "created_at": "2025-05-28T21:37:50.000Z",
    "num_comments": 547
  },
  {
    "id": "reddit-1i1nwy3",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "From Unemployed to a $58k IT Job in a Year: My Journey",
    "text": "I wanted to share my story to inspire those of you who feel stuck or are starting from the bottom. A year ago, I was completely unemployed, three months behind on rent, and facing a court order to either pay up or leave my apartment. My life was the very opposite of stable. \n\nI scraped together what I needed to stay in the apartment, and I took a dishwashing job to stabilize myself. It wasn’t glamorous, but it was exactly what I needed to keep going. Around the same time, I heard about the Google IT Support Professional Certificate. I decided to use what little stability I had from dishwashing to focus on earning that certification.\n\nWhen I finished, I started posting about it routinely on LinkedIn. That decision changed everything. A recruiter from Robert Half saw my posts and reached out with an opportunity: a four-month temp contract hanging wireless access points (WAPs) for schools in northeast Ohio—1300 of those. I took the job, did my best, and made sure to keep my resume updated with everything I learned.\n\nBefore that, my only real IT experience was a tech sales job with an ISP a few years back, where I occasionally reset passwords or rebooted modems. Still, I kept networking and applying. Posting updates on LinkedIn led to more opportunities, including one from Randstad. I accepted their offer, but just three days before my start date, it was rescinded because the organization froze all contracting services after their CEO was fired.\n\nThat could’ve crushed me, but I didn’t give up. I kept my resume sharp and continued posting. Eventually, a recruiter from my current organization found me on LinkedIn. They helped me prep for an interview, and I made the most of it. The result? A $58k job with a $3k relocation bonus that I started last month.\n\nThe funny thing is, my experience was minimal—just the Google cert and some AP installations. What got me here was mastering soft skills, learning to interview, and refusing to give up, even when things went sideways.\n\nHere’s what worked for me and might work for you:\n\n1.\tTake the first step, no matter how small – For me, that was a dishwashing job to stabilize my life and the Google cert to build momentum. Do NOT go into the grind saying what you aren’t gonna do. If you wanna bend the situation to your will, you have to be willing to do whatever it takes.\n\t\n2.\tLeverage LinkedIn – Share your journey, post your progress, and connect with recruiters. It works.\n\t\n3.\tStay resilient – Losing that first job offer hurt, but I kept going. Persistence really is key in this field.\n\t\n4.\tFocus on soft skills – You don’t need to know everything about IT right away. Being able to communicate, adapt, and think critically will set you apart.\n\nA year ago, I felt hopeless. Today, I’m in a role with more upward mobility than I ever thought possible, with a stable income and a clear path forward. If you’re struggling, I hope my story shows you that you can fucking do it. It won’t be easy, but if you keep at it, an opportunity WILL break. Good luck. ",
    "score": 843,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1i1nwy3/from_unemployed_to_a_58k_it_job_in_a_year_my/",
    "created_at": "2025-01-15T02:57:51.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1l29wnc",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Am I a jerk for making my boss think I'm going to accept a promotion when I'm in the process of quitting?",
    "text": "For the record, they offered me a \"promotion\" with no salary increase. It came with increased responsibilities, a heavier workload, and restrictive working hours. After interviewing me, they put me through my paces for two months while deciding between several candidates.\n\nIn the meantime, I prepared an exit strategy in case I was rejected and started looking elsewhere. I was offered a much better position. Like, a lot more. However, I won't be able to start at the new company for a few months. My current company decided to promote me. I just said, \"Cool, I'm happy. Let's do it.\"\n\nThe truth is, I'm going to quit in a few weeks. They don't expect it at all. They're starting to organize for my new position, and I must admit that I'm starting to feel guilty about it. Today, I tried negotiating my salary again, but they refused. I'm waiting for a precise start date from the other company before submitting my resignation.\n\nDo you think I should tell my current employer?",
    "score": 804,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1l29wnc/am_i_a_jerk_for_making_my_boss_think_im_going_to/",
    "created_at": "2025-06-03T11:53:09.000Z",
    "num_comments": 308
  },
  {
    "id": "reddit-1hyiz2m",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I landed my first IT job at $25 an hour!",
    "text": "So I work in manufacturing  and I've been working on my IT certifications. In the last few months I've earned my A+ and Net + and next week I take the test for my Security +.\n\nI was pretty dismayed, because when I started looking around at IT jobs in the area that I might qualify for I realized I'd have to take a major pay cut. I have bills and a family so it didn't feel like an option. \n\nFortunately, my company had decided to bring me into their IT department.   \nAt our branch we have one IT guy that does both System Admin and Net Admin stuff and I'll be working with him every day and he's going to show me the ropes. \n\nI'm super excited because I didn't expect to be able to start in IT with the same pay I was making. \n\nHopefully, in a year or two I can move on up, I'm working on my CCNA next!\n\n",
    "score": 791,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1hyiz2m/i_landed_my_first_it_job_at_25_an_hour/",
    "created_at": "2025-01-11T00:05:05.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1klwmua",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Leaving the IT industry for good, and I won't be coming back.",
    "text": "Good afternoon fellow or should I say former IT folks. Its been a good run just under 4 years in the field and im here to say that I will be leaving IT. Im a network administrator and just realized that it isn't for me. The office/office politics are not for me. The people playing the blame game, the constant stress of not knowing if your network is going to go down overnight, and the pressure from others to excel when you just cant anymore. I wish whoever enters the field to keep an open mind and always be willing to learn that's how you make the big bucks out here. Bust your butt, and always look for a better opportunity no matter how good your current job is be disciplined because I wasn't. Also don't be arrogant try to bring the people around you up and don't put people down because that brings tons of negative energy and people can feel it. \n\n\nTLDR: im leaving because I cant keep up with people around me. I hope you do well. Always keep your head up and always learn and try to do more no matter how good you are at what you do. ",
    "score": 783,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1klwmua/leaving_the_it_industry_for_good_and_i_wont_be/",
    "created_at": "2025-05-13T20:34:22.000Z",
    "num_comments": 353
  },
  {
    "id": "reddit-1lmsg0t",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "VP of Tech with 20 Yrs experience, i wanted to offer some advise to those new or looking to get into IT.",
    "text": "I've been browsing through this sub all morning and I've seen a ton of negative posts from burnt-out individuals. This can seem very discouraging to anyone looking to get into IT or new in the industry. This advice is only for those brand new or looking to get into IT.\n\nA single cert (such as A+) unfortunately isn't enough to be put on top of the list of candidates for a position. This is interesting and a bit unfair since, on paper, an A+ is technically more than enough for a level-1 helpdesk position (I personally still have and update my A+).\n\nIf you're looking to appear more well-rounded, skip the A+ and focus on the following:\n\n* **Microsoft 365 Fundamentals**, followed by **AZ900**\n* **Microsoft Office Specialist (MOS)** — focus on **Outlook** first, because it causes the most \"noise\" in a normal office.\n* Maybe add **Azure Fundamentals** or **AWS Cloud Practitioner**.\n\nIf I'm looking to hire an on-site level-1 technician, here’s what I’m looking for (and so are most IT Managers/Directors):\n\n**Appearance:**  \nHow are you dressed? Personally, I'm a metalhead with tattoos and a sleeve — but you'd never tell by looking at me because I cover it. Work isn’t the place to express yourself; it's where you go to make money. At minimum, dress business casual. Hair neat. Smell good. If you don’t know how to dress well (you’d be surprised how many don’t), get help. These days it’s affordable to look good — go to H&amp;M, Express, or any trendy store and ask the younger employees for advice. They’ll likely be more helpful than your relatives or significant other. You don’t need to wear a tie, but get clothes fitted to your body shape. Don’t wear clothes that are super baggy or shirts that are too tight — yes, I see this a lot.\n\n**Small lifehack:** Buy a work outfit and wear it around the house. You’ll get comfortable in it and won’t feel awkward wearing it to work. Dress nicer than your peers in the same position, and you’ll be taken more seriously by managers — I promise.\n\n**Communication:**  \nI want someone with a good demeanor, who’s well-spoken, helpful, and has common sense. This is huge. Friendly, but not overly social. When dealing with office staff, get in, get out — don’t linger. The IT industry has improved a lot but there's still that stereotype of the creepy awkward it guy whos going through your personal pics, just know this is still a thing, don't be that guy.\n\n**Technical Skills:**  \nI prefer someone who’s well-rounded over someone who’s hyper-specialized but unwilling to leave their comfort zone. This is where having a few foundational certs makes a difference. A big part of your job will be putting out small fires — like solving a printer issue or dealing with a dead laptop, RMA, recover data, setup the user with a new device and make it look like the old one did. etc... it depends on your job, but just know the more well rounded you are the better..\n\n**Resourcefulness:**  \nThis is HUGE. It's okay not to know something. What matters is how you handle it. I look for someone who can say, *\"I’m not sure what’s going on, but I’ll get back to you within X time,\"* then takes ownership, researches (whether through escalation or Google), and follows up with a resolution — without needing a babysitter. I hate the micromanaging culture!\n\n**Direction:**  \nIf you’re just getting into IT, you probably don’t know which branch of IT you'll end up in. That’s OK. I used to be a Linux Telecom Engineer before realizing there were better-paying opportunities in finance. Now I work for a Private Equity firm. Why? It pays more — that’s it.\n\n# Some things I wish I did sooner:\n\n* Get a mentor — ideally someone in a high-level position in the field you're aiming for.  for example, in cyber security it would be a CISO, Compliance Officer, etc.\n* If possible, get an internship, even doing low-level work. It’ll show you the path.\n* Talk to successful people in the branch of IT you want to enter. Burned-out people love telling you how bad it is — that’s often a reflection of their own life, not the industry.\n* Mentorship programs at mature companies are GOLD — take advantage.\n\nAvoid negative, salty people. I've read plenty of those comments here. Sure, bad days happen. But I’ll share this: In one of my previous jobs (and still as a consultant doing internal IT assessments and M&amp;A work), I developed a knack for spotting unhappy IT employees — the complacent, lazy, or those who lost their drive. Every profession that pays well requires *continuous* improvement. IT is no different. If you stop learning, someone will pass you by. It’s just how it is.\n\nKnow the difference between **perception and reality**. Some folks lie A LOT on their resumes. Some don’t lie at all. Find the balance. Also understand that **corporate politics will always play a role** in career growth. If you think just being technically good and keeping your head down will land you a $250k salary — you’re mistaken.\n\nPerception matters. That’s why dressing decently and having a well-rounded cert portfolio are important in the beginning. Also, realize that your resume might end up in front of a 25 year old HR person that doesn't know Jack Shit about IT and all she's thinking about is her drama with her bf and how she needs to find an outfit to go have drinks with the girls, **make it easy** for them to put you on the lists of candidates that should be interviewed, and this might mean pay for someone to review your resume but don't overly rely on this either.\n\nThis was supposed to be a short post 😅. If you made it this far and have questions, drop them — I’ll answer as best I can.\n\nEDIT: I'm trying to wrap my head around the few Chatgpt comments, do you think I didn't write this? In a way it's very fascinating because if you cant tell a human being wrote this post then we're all done for in the future lol.  \n",
    "score": 763,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lmsg0t/vp_of_tech_with_20_yrs_experience_i_wanted_to/",
    "created_at": "2025-06-28T17:31:03.000Z",
    "num_comments": 188
  },
  {
    "id": "reddit-1jgozse",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "IT Can Be a Thankless Job",
    "text": "Working in IT is exhausting. You’re expected to fix problems people can barely explain, and when you do, you’re lucky to get a thanks. But make one mistake, suddenly, you’re public enemy #1.\n\nNo one notices the overtime or the extra effort, but the second something goes wrong, it’s like the world’s ending. Here’s the thing: being rude to your IT team doesn’t help. It just makes us less likely to go out of our way for you.\n\nA little patience and appreciation go a long way. We’re here to help, but we’re human too.\n\nAnyone else feel this way?",
    "score": 720,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jgozse/it_can_be_a_thankless_job/",
    "created_at": "2025-03-21T19:17:14.000Z",
    "num_comments": 149
  },
  {
    "id": "reddit-1k8yoy0",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "If you're looking to get into Cyber Security please consider the following..",
    "text": "1. It’s mostly meetings, audits, report writing/reading, and then more meetings. Yes, there is a large technical component, but it’s often overshadowed by paper pushing. This isn’t just true for blue teams - it applies to red teams too. One pentest report could have 12–15 pages dedicated to one IDOR vulnerability.\n2. Cybersecurity degrees are almost never worth it. College is great, and it’s even better when you’re studying a tried and true degree like Computer Science, which will always offer value well into the future. Howevr, cybersecurity is not an entry level field, and very few people actually graduate and move directly into a JR Sec Analyst/SOC role. It just doesn’t happen. You’re better off doing a 2 year IT program that covers computer science fundamentals/programming from an accredited school, or a 4 year CS degree from a traditional university. If neither of those are an option due to cost or flexibility, then go for certificates from known and reputable vendors - not some random LinkedIn Learning module nobody has heard of..\n3. You’re going to need knowledge across several domains: networking, programming, OS architecture (deep familiarity with Windows, Linux, and macOS internals.. especially command line, file systems, permissions, processes, and memory), incident response, risk management, threat analysis, and much more. Most importantly, soft skills. You will not get hired if people don’t want to work with you.\n\nI just wanted to list these as I feel they are most pertinent to finding a job in cyber security. I work as a Cybersecurity Analyst and have 7 years in IT, and it's PARAMOUNT that you understand the above IMO.\n\n\n\n",
    "score": 716,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1k8yoy0/if_youre_looking_to_get_into_cyber_security/",
    "created_at": "2025-04-27T07:54:41.000Z",
    "num_comments": 141
  },
  {
    "id": "reddit-1npydua",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I did it guys. After 7 months...",
    "text": "I was laid off back in Feb. Spent not even a year with my last employer before I got the dreaded Teams meeting with my boss and HR. Got RIF'd, a measly severance, and escorted out of the building by front desk security. In this economy, might as well be a death sentence.\n\nI feel for you guys who are looking in the current job market, it's hell. They're paying pennies on the dollar, it's all onsite with little to no remote work, mostly contracts. I remember I was almost willing to take a Tier 2 Desktop Analyst position for 25hr cuz I was desperate. I had to burn through my savings, unemployment is a joke. I lost my relationship of three years because of the layoff, (my ex would say otherwise but we mostly argued over finances), couldn't afford repairs for my car, and my cat required surgery ($4000). To add insult to injury, the ex moved out, wanted half of her deposit back and now I had to pay for everything in full for almost half a year. Dude, I was going through it.\n\nAfter 7 months, 24 interviews, hundreds of emails, and thousands of applications, I got the job I was aiming for. IT support for the city public transportation department, and the commute is 12 min. $70k a year, direct to hire, full benefits. I can't tell you how much relief I feel, it's like I got my life back. I owe it in part to this sub, all the tips and questions answered helped me build a decent resume and improve my interview skills. There is a light at the end guys if you're willing to keep the course and put in the work!",
    "score": 710,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1npydua/i_did_it_guys_after_7_months/",
    "created_at": "2025-09-25T05:21:27.000Z",
    "num_comments": 111
  },
  {
    "id": "reddit-1kpq8m2",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Got yelled at for taking a 7-minute break Fuck Corporate Life",
    "text": "Just today, my manager called me out in front of the team for \"being away from my desk too long.\" I had stepped out for literally 7 minutes to take a breather no lunch yet, 6 hours into my shift, and handling back-to-back calls from angry clients.\n\nApparently, \"it sets a bad example.\"\n\nYou know what sets a bad example?\n\nMaking employees sit for 9+ hours with no mental break\n\nMeasuring productivity in minutes instead of outcomes\n\nPreaching \"mental health matters\" in HR emails while micromanaging bathroom breaks\n\nI used to think I needed this job for stability.\n\nNow I'm starting to think it's killing me slowly.\n\nI'm tired of being a cor a machine that doesn' t care if I break down\n\nFuck corporate life.\n\nIf you've had a similar moment that pushed you over the edge, I'd love to hear it. Maybe I'm not crazy after all.\n\n",
    "score": 709,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kpq8m2/got_yelled_at_for_taking_a_7minute_break_fuck/",
    "created_at": "2025-05-18T18:04:08.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1lptmof",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I was going to be a Software Dev, but I guess I'll be an IT Guy.",
    "text": "I'm 25(M) who graduated with a Computer Science degree last summer. I had planned becoming a software developer, and all my internships and projects were focused on software dev. But as you might know, it's incredibly tough for new grads to land a software job right now. So, instead of staying idle, I took an IT support role without any prior experience.\n\nSurprisingly, I've started to really enjoy it! I've found that instead of coding or debugging all day, I prefer dealing with a variety of technologies. One day I might be setting up a physical server, another day I'm handling hosting issues, and the next, I'm knee-deep in Active Directory.\n\nThe only problem was that I worked at a food company, and there weren't any IT professionals I could learn from. But good news! Last week, I received  a job offer from a company that specializes in IT, with a higher salary. I'll be starting in a few weeks.\n\nThe best part is that I'll be working with professionals in a company whose core business is IT.  So, it feels like a great step forward for my IT career. The only catch is that it's a shift-based role, meaning I'll sometimes work weekends or even all night. But I think it'll be worth it.\n\nWhat do you all think? Am I on the right track?",
    "score": 695,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lptmof/i_was_going_to_be_a_software_dev_but_i_guess_ill/",
    "created_at": "2025-07-02T11:41:51.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1ik6vze",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "One month in from changing careers at 41.",
    "text": "I was a retail manager for 20 years and at 41 I packed it all in, got my A+, and last month I landed a role in an IT support role (hybrid, 3 days wfh). I feel like the luckiest person in the world!\n\nOne guy in the office was complaining about pay and I was just smiling.\n\nAfter earning a fairly decent salary for decades yet being completely miserable in my role, I honestly just can't believe I'm doing this stuff every single day and can't wait to learn more and push further in my new career.\n\nTo anyone considering switching careers but worried about age or prospects etc - just do it. \n\nIf I can do it, you can.",
    "score": 691,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ik6vze/one_month_in_from_changing_careers_at_41/",
    "created_at": "2025-02-07T21:55:58.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1mbz88x",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "From unemployed to $70k+remote in 2 years",
    "text": "Just wanted to give you guys my story and  hopefully some motivation to those who need it.\n\n\nDec 2022: Graduated college with a compsci degree. No certs, no projects, nothing. At the time, I thought a degree was all I needed to get a high paying job. Reality set in quickly.\n\n\nAugust 2023: Months of applying to SWE jobs with no luck. I made a pivot into IT. Started studying for Sec+ while doing UberEats + Doordash everyday. \n\n\nFeb 2024: Landed my first job @ help desk making $21/hr. Earned Sec+. Happy to finally get my foot in the door.  \n\n\nNow: Earned my Net+. Landed a job making +$70k fully remote. \n\n\nFor those searching for their first job in IT, keep learning, obtain relevant certifications, do a few projects, make good connections, and keep applying.\n\n\nGood luck to you all\n",
    "score": 684,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1mbz88x/from_unemployed_to_70kremote_in_2_years/",
    "created_at": "2025-07-29T02:03:57.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1ikoezx",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Going on 30 years in IT, here are my answers to the FAQs of this sub",
    "text": "* Get whatever entry level IT job you can. \n   * If you’re in college, get an on-campus student job doing any sort of tech support.  Every college has these types of roles.\n   * Non-profits and small businesses are often more willing to hire with less experience.\n* Early in your career look for opportunities that give you a broad range of exposure to different technologies. \n* Certifications complement experience, I’ll take a shot with someone that has 1 year of helpdesk experience before someone with no experience and multiple certs. Get a job and if you’re interested in the tech used in that org, go after an applicable certification.\n* The best path to cyber security is through IT.  The most effective and successful cybersecurity professionals I work with all came up through the IT ranks. How can you secure tech unless you understand how things work?\n* Titles in IT are largely worthless.  Titles are often inflated, especially in organizations under 100 people.  IT Director at a 75-person company is basically a glorified helpdesk/sysadmin role.\n* Explore professional organizations and industry events to get to know others in the field.\n   * [https://www.aitp.org/](https://www.aitp.org/)  for IT professionals\n   * [https://www.issa.org/](https://www.issa.org/) for Cybersecurity",
    "score": 662,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1ikoezx/going_on_30_years_in_it_here_are_my_answers_to/",
    "created_at": "2025-02-08T14:27:42.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1lahn45",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "How I got into a 6-figure tech job without an IT/Comp Sci. degree or coding",
    "text": "A few years ago, I was working in a low paying Finance job with no clear direction. I didn't have an IT/Comp Sci degree and had zero interest in learning how to code. I kept seeing stories about people landing high-paying tech jobs, but I felt completely left out of that world.\n\n  \nThen I discovered a lesser-known tech career path through something called Microsoft Dynamics 365 Finance &amp; Operations (D365 F&amp;O). It is enterprise software that big companies use to manage things like finance, inventory, and supply chain, and they need people who know how to work with it.\n\nWhat surprised me is that these roles (like D365 ERP Analyst or D365 Functional Consultant) are in high demand, often remote, and usually pay 80K-120K. You don't need to be a programmer or have a traditional background, just the right training and a good understanding of how businesses operate.\n\nI followed a structured learning path, practiced with real examples, and got certified. Within a few months, I had my first offer and I've been working in the space ever since. It completely changed my career and income.\n\nIf you're looking for a way into tech that doesn't require coding or a CS degree, I'd highly recommend exploring D365. It's not talked about much, but the demand is real.\n\n  \nHappy to share what I learned or point anyone in the right direction if this sounds like something you're curious about.",
    "score": 649,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lahn45/how_i_got_into_a_6figure_tech_job_without_an/",
    "created_at": "2025-06-13T14:40:20.000Z",
    "num_comments": 216
  },
  {
    "id": "reddit-1pclgy1",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "The IT to Trades Pipeline - The Grass is NOT Always Greener",
    "text": "I recently was trapped in a longer-than-comfortable drive with an in-law around my age in his mid-20s. We're both in IT, although he's a bit more junior and frustrated by his lack of growth at his company. During the ride he couldn't stop talking about a couple of things which inspired me to make this post (as I'm pretty sure this sub inspired him):\n\n*  IT is a dead field with no growth\n* AI is going to take all of our jobs\n* Trades are where it's at! We should all switch careers and get into trucking/plumbing/electrical\n\nHere's the thing - I've worked in trades for over 5 years. What people don't seem to realise is that the *exact same barriers exist*.\n\nMost trades in North America require an **apprenticeship**, and you can’t start an apprenticeship without a sponsor (usually an employer).  \nBut employers often want someone who:\n\n* already has some hands-on experience\n* won’t slow down the job site\n* doesn’t require a lot of training\n* shows up prepared with basic skills\n\n**Sound Familiar?**  \nYou need experience to get experience — kinda like IT?\n\nYes, trade schools are a thing that exist. No, they are not a guaranteed job. Many college grads from mechanic and HVAC programs constantly deal with lack of employment in their fields due to the exact dilemma above.\n\nWorried AI is going to replace you? Become someone that people enjoy having around with skills that either cannot be replicated or are protected by governance that AI cannot touch. \n\nFeel stuck in your position? Study on your own time and level up.\n\n Can't find a job? Hey, we've all been here at some point. The best advice I can give is to level up your soft skills for interviews.\n\nTrades are 100% not a cakewalk. I have injuries from my short stint that I carry with me to this day. Times are tough, but you can choose to be tougher fellas.",
    "score": 642,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1pclgy1/the_it_to_trades_pipeline_the_grass_is_not_always/",
    "created_at": "2025-12-02T21:42:15.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1kkdyhj",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "IT Career at Porn Company",
    "text": "Some dude in here past up a remote job at a porn company. It got my interested and has piqued my interest? What is it actually like? Are you looking at porn more often than not? Or is pure IT and all the component stuff? Super curious and don’t mean any offense at all. \n\nWhat’s it like working in Tech for a company that does porn or adult entertainment?",
    "score": 641,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1kkdyhj/it_career_at_porn_company/",
    "created_at": "2025-05-11T23:07:19.000Z",
    "num_comments": 207
  },
  {
    "id": "reddit-1lvb6ea",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "So let me get this straight in IT you learn certifications for 10 years, have 10 years work experience, 15 certs under your belt and you have no security and get paid 70k for 10 years of studying plus a degree?",
    "text": "I keep seeing job postings that require A+, Network+, CCNA and a tech based degree and they pay 41k-46k. Are you joking that 6 years of education for a job paying less than 20 an hour. Is this industry just a joke or what. Please help me understand! ",
    "score": 613,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lvb6ea/so_let_me_get_this_straight_in_it_you_learn/",
    "created_at": "2025-07-09T05:54:54.000Z",
    "num_comments": 329
  },
  {
    "id": "reddit-1juhnxg",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Thousands of North Korean IT workers have infiltrated the Fortune 500—and they keep getting hired for more jobs",
    "text": "FORTUNE just came out with this information. Not sure what to think of it given the current job market and layoffs ... https://fortune.com/2025/04/07/north-korean-it-workers-infiltrating-fortune-500-companies/",
    "score": 610,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1juhnxg/thousands_of_north_korean_it_workers_have/",
    "created_at": "2025-04-08T16:22:46.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1n33ojb",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "How many of you work in IT that make over $100k with no Bachelors or higher?",
    "text": "Title states it - so happy and thankful I landed a job with about a  $100k cap with no bachelors required - Tier 2 desktop support - only did 2 years technical school no certs ",
    "score": 603,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1n33ojb/how_many_of_you_work_in_it_that_make_over_100k/",
    "created_at": "2025-08-29T10:24:58.000Z",
    "num_comments": 588
  },
  {
    "id": "reddit-1m25nxx",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "H1B Abuse - Why is no one on here talking about it?",
    "text": "Hello,\n\nMicrosoft just laid off 9,000 people and applied for 15,000 H1B (cheap foreign labor). Why isn't this discussed on here considering the terrible job market? \n\nhttps://www.newsweek.com/microsoft-layoffs-h1b-visa-applications-2094370\n\n",
    "score": 584,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1m25nxx/h1b_abuse_why_is_no_one_on_here_talking_about_it/",
    "created_at": "2025-07-17T12:00:50.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1lrskmr",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Gen Z is ditching college for ‘more secure’ trade jobs",
    "text": "https://www.yahoo.com/news/gen-z-ditching-college-more-125239819.html\n\nThis is a good insight when people talk about joining Trade work instead of Information Technology. \n\nA reminder to do what you love/find interesting because the grass isn't greener on either side.",
    "score": 571,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lrskmr/gen_z_is_ditching_college_for_more_secure_trade/",
    "created_at": "2025-07-04T20:28:11.000Z",
    "num_comments": 149
  },
  {
    "id": "reddit-1jzkjzq",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "IT-veteran here with a word of advise- make sure you finish a 4-year degree to stay in corporate IT",
    "text": "Years ago, a degree was “nice to have,” and experience trumped a degre. Things have changed in the current market with layoffs and offshoring. \n\nYour resume is likely to be screened out without one. And if you work for a larger company you are probably aware that chances of promotion are nil without a formal degree.",
    "score": 522,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1jzkjzq/itveteran_here_with_a_word_of_advise_make_sure/",
    "created_at": "2025-04-15T05:58:05.000Z",
    "num_comments": 304
  },
  {
    "id": "reddit-1m9fl4k",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I doubled my IT salary in less than a year by job hopping",
    "text": "\n\nFirst, I fully acknowledge that I may have just gotten lucky through this process, but I also feel that I definitely put in a lot of work to progress my skills faster. \nLong story short, loyalty to a company is dead nowadays. \nI only have (coming up on) a year in the IT industry with just one cert(Sec+)and I have job hopped 3 times in that time. \nI started at $48k for my first job, help desk. After 5 months, I found another help desk job for $62k. Then, 3 months later, I found another role as  system administration role for $80k, then 3 months later, I just now accepted an offer for $100k in networking. \n\nThe things I PERSONALLY feel made made me excel were only small things that compounded. \nFirst, I would always ask what project to be put on that could be improved. Things like bench stock inventory, software documents, or any additional duty. Something that is big enough to show you really made a difference, but not so big you’re in over your head. This gave me something to do in my down time and made me always look busy. I’d always gone a very brief weekly update without being asked to show that I’m still working it, the progress I made, and what I had planned next week. This can show your skills like organization, initiative, and willingness to learn. \nSecond, cross training and finding single points of failure within the desk or job. Someone doesn’t have a secondary for an additional duty, help them out. Only one person knows how to do a specific job, ask to learn. This helps you meet and get to know your cowriters, learn the job better, and help the team. For me, this helped me bond with coworkers via work and not small talk because I’m an introvert and hate that. \nLastly, I took my time with applying to jobs. I applied to only 2-3 a week, but I tailored my resume to each one and made sure I met all or most requirements. Tailoring my resume started giving me about an 85% response rate vs just mass applying. I can’t stress how much this helps. \nThis wasn’t a bragging post, but just something I wanted to share to see if it helps something else and to let them know that it’s possible to speed run the salary ladder to decent pay. \n\nThere’s more I felt I did and I’d be happy to explain if you want more tips. ",
    "score": 518,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1m9fl4k/i_doubled_my_it_salary_in_less_than_a_year_by_job/",
    "created_at": "2025-07-26T00:28:21.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1iosm03",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "I FINALLY BROKE INTO THE INDUSTRY.",
    "text": "Long time lurker/asker of question here.\n\nI finally did it. Just accepted my first actual IT role at a MSP. I currently have no certs. My only experience is ~ 6 months at an “help desk role.” You really can’t even call it that. I do super basic stuff, and run everything here. My current company is a mess if you can’t tell. I have a few years building PC experience and have been around computers my whole life. \n\nToday I got the call for the offer. I couldn’t believe it. I am so excited to actually start my career and LEARN. I am so interested in this stuff that it is great to have a company that is willing to take a chance. I can’t believe it.\n\nThanks for listening to my Ted talk.",
    "score": 516,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1iosm03/i_finally_broke_into_the_industry/",
    "created_at": "2025-02-13T20:24:57.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1lm8tuw",
    "subreddit": "ITCareerQuestions",
    "soc_codes": [
      "15-1232",
      "15-1244"
    ],
    "title": "Cybersecurity job interview: I thought I was being tested, and I was not",
    "text": "Update (7/3): the recruiter contacted about a final interview next week. I nearly choked on my breakfast. \n\nUpdate (7/10): I had the interview today. While it was not the final interview, it was with people the position would be working with. Going out of the interview, I felt awful as no matter what answer I gave, the panel was not impressed looking. Awesome feeling. \n\nI had a job interview today for a cybersecurity project manager role at a large, multinational company. I'm currently an IT Director overseeing all IT operations for a small company - including cybersecurity. \n\nWhen I entered the building, security didn't copy my ID nor did I get a guest badge. When the interviewer brought me to a conference room across the building from the entrance, I noticed unsecured workstations INCLUDING his that was sitting open screencasting to a large TV. After introductions, he asks me my background in cyber, so I give him a rundown AND I bring up all the security issues I saw in just the walk to the conference room, and I congratulated him on the test on whether I would notice. \n\nIt wasn't a test. Security is just that shitty. The guy looked really embarrassed, and seemed to go through the motions for the rest of the interview. I either knocked it out of the park so well he just didn't care about the rest of his planned questions, or I fucked myself over. Thoughts? ",
    "score": 510,
    "url": "https://reddit.com/r/ITCareerQuestions/comments/1lm8tuw/cybersecurity_job_interview_i_thought_i_was_being/",
    "created_at": "2025-06-27T23:49:57.000Z",
    "num_comments": 106
  }
]