[
  {
    "id": "reddit-1ko4338",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "When a server is complaining to you about \"only\" making $200 in tips in their 5 hour shift.",
    "text": "Oh no, so you're telling me you only made $58 an hour with your base pay? Please, tell me more.\n\nP.S. I do generally love the servers I work with, but this will never not bother me lol.",
    "score": 46955,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1ko4338/when_a_server_is_complaining_to_you_about_only/",
    "created_at": "2025-05-16T15:43:32.000Z",
    "num_comments": 1829
  },
  {
    "id": "reddit-1olvspj",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Day 1: Chopping crayons until the sub says they’re perfect",
    "text": "Chefs, forgive me, for I have sinned... may the kitchen gods have mercy on me for what I've done to my knife.\n\nMy kid’s 1st grade class is doing a “make your own rock cycle” project, and apparently the igneous stage requires a fine chiffonade of Crayola. So here I am, standing at my board, mincing crayon and channeling my inner chive-guy.\n\nMy cuts are rough and inconsistent, but I’ll be back tomorrow. And the day after. Until the sub finally says my crayon cuts are perfect.",
    "score": 41772,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1olvspj/day_1_chopping_crayons_until_the_sub_says_theyre/",
    "created_at": "2025-11-01T18:53:18.000Z",
    "num_comments": 655
  },
  {
    "id": "reddit-1nn98wf",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Is it true?",
    "text": "I'm not working in a kitchen but worked briefly as a bus boy long time ago \n\nAnd been following this page for a while \n\nI saw this meme on Facebook and it made me laugh and immediately made me think of the post that i see here ",
    "score": 25955,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1nn98wf/is_it_true/",
    "created_at": "2025-09-22T01:16:14.000Z",
    "num_comments": 548
  },
  {
    "id": "reddit-1kjs8v7",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I'm so tired.",
    "text": "ICE was raiding restaurants near work tonight. Immediately shut the kitchen down, ran all the managers through protocol, told the cooks where to go on the off chance they showed up. Got everything cleaned and all the managers coordinated getting everyone home.\n\nNone of us are ignorant to the current reality, but the actual weight of this reality is so hard to ignore when it's down the street. My heart aches for my team who all terrified to leave their houses, and the rest of me is so pissed off and doesn't feel like anything we can do will be enough. \n\nKeep an eye out for your own and keep yourselves safe. We got a long few years ahead of us.\n\nEDIT : Why the did this get locked. Someone explain to me how this isn't relevant.\n\nEDIT 2: well we're unlocked now. Glad a human moment I had on a whim caused discourse for the greater good. FUCK ICE.",
    "score": 15507,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1kjs8v7/im_so_tired/",
    "created_at": "2025-05-11T04:03:47.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1j3fkj1",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "How fucked am I?",
    "text": "For context, I’m the PM Grill Cook (and “pm lead without the title” as described by my executive Sous - the one I’m talking with here) at the hospital cafe I work at. We strive to do pretty good quality food, and make it fun. We go all out for Mardi Gras, busting out two extra stations and running extra specials all day long. This is totally reasonable and doable during our lunch period, but after 2:30, it’s just me and a 58 year old cashier whose cooking skills amount to assembling a ham and cheese sandwich. \n\nSo yesterday, after pumping out several batches of beignet dough before heading out to run the cafe as the sole cook, I’m told “hey by the way, you need to take over king cake production.” I figure that’s fine, I can rock it while taking care of the cafe. Head out to find the cafe line in complete shambles. Flatty is black and crusted over, sticky and greasy counters, black fryer oil, nothing on the line is restocked and most items are 3/4 empty, and all the ice baths are completely melted. Morning crew just left all this shit, knowing I would have to clean it up. So I delay king cake production to lock in on making the line decent enough to cook out of again and not scare away our customers, because this is open concept and the doctors will not order food if the place looks like shit. Between cleaning and taking/cooking orders, I get to the time for my lunch without being able to run any of my usual pre-lunch cleaning that will let me close on time. Come back from lunch, start king cake production. As soon as I get one dough batch rolled out, 3 whole families of 4-8 come down and need service. After that wave, I keep ping-ponging between cake and grill and sometimes even the cash register because my cashier takes a whole 30 minutes to slice a ham and turkey. Finally finish king cake production at 7:10, 20 minutes to close. Nothing’s done. I’m veritably fucked.\n\nWork as fast as I can, maximizing efficiency as much as possible. Prep cart is fucked. No labels on anything. Completely disordered, raw sausage on the top rack and lettuce right beside it. Wrap jobs are ass. Have to redo the whole thing, restructure it, and get it decent. Weigh out all our waste and food donations. Still haven’t cleaned a damn thing, and it’s 7:45.\n\nSo then, finally, I get to cleaning. Housekeepers come in and say that a banquet was left in one of the least used conference rooms over the weekend. So of course, I gotta go take care of that too. All told, I’m out by 10:25. My off time is supposed to be 8:30. Texted chef, and the above was his response.\n\n“No more overtime.” Really man? What the fuck am I supposed to do, just leave the place a wreck? It feels so passive aggressive, and I can’t help but feel like there’s a write up waiting for me when I get there. How fucked do y’all think I am? ",
    "score": 10797,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1j3fkj1/how_fucked_am_i/",
    "created_at": "2025-03-04T17:02:16.000Z",
    "num_comments": 681
  },
  {
    "id": "reddit-1nbcfh9",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Boston. My industry runs on immigrants. Boh, and foh. imo any owners voting Republican, I hope the staff walks out and your business goes under. Respect your workers more.",
    "text": "I wrote it all in the title. I just don't understand it. A friend owns a pizza place and loves Trump. Put some memorabilia in his restaurant and had his 2 long time cooks and dishwasher walk out together. He shut down last month. Imo well deserved and I don't feel bad, he made his choice.",
    "score": 8058,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1nbcfh9/boston_my_industry_runs_on_immigrants_boh_and_foh/",
    "created_at": "2025-09-08T02:49:57.000Z",
    "num_comments": 308
  },
  {
    "id": "reddit-1o9pziv",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I spent 1 month working as an unpaid apprentice after 20 years as a Chef.",
    "text": "I have been struggling with my career lately.  The spark had been flickering.  I’ve spent a lot  of my career in management positions at high end- large volume restaurants and kept running into the same problems.    \n\nI came to a breaking point and decided to start over again in the world of fine dining as a Stagiaire in a restaurant chasing its third Michelin star. \n\nIt was hard.  Taking orders from people half your age and humbly saying “Yes chef”- but honestly it’s the best thing I could have done and I feel inspired in my cooking again.  I plan to repeat the experience again somewhere else next year- and would recommend this to any chef who feels “stuck” in their career.\n\nI made this documentary if you’d  like to know more.\n\nhttps://youtu.be/Tr8KJ4EdN_g?si=DHnPW99Cey5ZNWKH\n",
    "score": 6203,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1o9pziv/i_spent_1_month_working_as_an_unpaid_apprentice/",
    "created_at": "2025-10-18T08:01:17.000Z",
    "num_comments": 760
  },
  {
    "id": "reddit-1jmfrdz",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Remembering the time that I walked from a restaurant and they closed.",
    "text": "I worked at this bistro for 3 years, I was the sous chef for the final year. Almost to the day. Like the title says, I walked and they closed.\n\nMother’s Day week, I worked 106 hours and slept there once. Only paid for 50, since I was on salary, which amounted to $404 in 2022. That in itself is some shit, but I wouldn’t have left over it. Day after Mother’s Day, the owner tells me I’m not doing enough for the company. I was flabbergasted and sat with it all day.\n\nThe next morning, like 7am, I was out back with the executive chef smoking a couple cigarettes before putting together a catering and it just hit me like a ton of bricks, I’m not doing this anymore.\n\nI looked at the executive chef and exact words said “it’s been real man, I’m going home”. He laughed and then looked at me all concerned like really? “Yeah dude I’m for real, I’m sorry, but I’m out. It’s been a long ass week, it’s been a long ass day (remember it was like 7am I just got there), it’s been real dawg, I’m leaving.”\n\nHe went upstairs without a word, I wrote burn baby burn on the dumpster, and then got 2 trash bags full of all of the equipment I brought in from home for them, I stuffed 2 beers in my pocket, nodded to the EC and drove off.\n\nYou bet your ass that wasn’t even close to the first straw. I talked to one of my old employees after they closed and he said after I left it was complete mayhem, they couldn’t keep staff, cleaning went undone, they couldn’t find another lunatic to fill the role of sous there obviously, the EC got burned to the ground (hate that for him), hard drugs spread like a wildfire, food quality dropped massively, they eventually stopped getting their biggest catering customers and that bitch closed. For reference, our local food magazine voted us best restaurant of the previous year (my town is only 40k population). Lo and behold, I leave and they’re wiped off the map. Smiling as I type this. I’m not saying I’m the reason they were open, I’m not that arrogant, but I was the glue that held that kitchen together. Who didn’t do enough for your company? You fucking cunt, eat shit.\n\nA short victory story for under appreciated chefs everywhere. ",
    "score": 5085,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1jmfrdz/remembering_the_time_that_i_walked_from_a/",
    "created_at": "2025-03-29T05:54:10.000Z",
    "num_comments": 125
  },
  {
    "id": "reddit-1mtvo2r",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Why was this actually my experience managing a kitchen?",
    "text": "I managed a theater that served food and I swear to god it made me legitimately swear off working anywhere that serves food. I literally had to stop the cooks from throwing a fit every time a ticket got printed, I occasionally just decided to fire them randomly if they caused too many issues and the replacements did the same stuff. SURELY you can’t all be like this. I have plenty of stories ask away. \n\nThis is the only place *and department* in my career I’ve ever gotten mad enough to legitimately yell at employees. ",
    "score": 5058,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1mtvo2r/why_was_this_actually_my_experience_managing_a/",
    "created_at": "2025-08-18T19:19:34.000Z",
    "num_comments": 180
  },
  {
    "id": "reddit-1jatixd",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "For all my kitchen homies struggling with sobriety",
    "text": "10 years clean and sober today. Shit was hard af to go cold turkey and give up powder and vodka but worth it and my career has only went up since I made this change. I also got my family and myself back which is the most important thing.\n\n\n\n",
    "score": 3631,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1jatixd/for_all_my_kitchen_homies_struggling_with_sobriety/",
    "created_at": "2025-03-14T02:23:00.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1j5wii2",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I’m convinced that servers in the US don’t actually want to be paid a livable wage.",
    "text": "So I remember being a sous chef, I worked infinitely harder and longer than every server in the building, but my take home pay was $404 a week (I was on salary, that’s my own fault and not entirely relevant to this argument). Meanwhile, every single night I heard servers complain when they “only made $150 today”. Compare my 14 hour work day to their 5 hour work day.\n\nMy wife was a server for 7 years. There were some jobs where she hardly made anything, there were some jobs where she made bank and didn’t even have to think before buying anything. Here’s the main thing, you hear servers say all of the time in America “well maybe if we got paid a livable wage instead of relying on tips it would be different, but until then tipping is a requirement and if you can’t afford to tip then don’t eat out!” but I’ve offered to pay my servers a livable wage and split tips with the whole restaurant, (AFTER hearing them say that for weeks!) they all said they would walk out that same day if it went into effect. My wife tends to agree as well, they don’t want to be paid well, they want to rely on tips, because the earning potential is FAR higher that way. Furthermore, a server can quit anywhere and start anywhere else almost in a heartbeat, they don’t have to be there, if the money really really sucks, they can and will leave.\n\nOn paper, they make $2 an hour plus tips. In reality, they often make more than anyone else in the building. They have the POTENTIAL of making $30-50 an hour. Hell I’ve seen bartenders make upwards of $100 an hour some days, so why the fuck would they accept a measly $20 an hour? I wouldn’t in their position and you wouldn’t either, it’s just basic math, so it’s all bullshit to get you to feel bad and tip more.",
    "score": 2347,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1j5wii2/im_convinced_that_servers_in_the_us_dont_actually/",
    "created_at": "2025-03-07T18:46:40.000Z",
    "num_comments": 708
  },
  {
    "id": "reddit-1jrg8y7",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Don’t go to culinary school. Don’t do it.",
    "text": "This is not a message for everyone, this is a PSA for anyone who has never worked in a restaurant that’s about to go through or is considering going through culinary school, so they can be a chef. If you’ve been in the industry for a while, you enjoy it as a career and you feel like going to culinary school, this isn’t for you. \n\nThis question is asked all of the time, should I go to culinary school. My two cents, absolutely not. First things first, return on investment is very low. Secondly, it doesn’t matter if you’ve gone to the culinary institute of America, you’re not going to start out as a sous chef. You’ll be at the very bottom, same as the guy who didn’t go to culinary school and within 2 years you’ll both have the same knowledge database, assuming the other guy is passionate and asks questions, except he won’t be in debt. \n\nI’ve seen literally no exaggeration hundreds of culinary school graduates who start in a restaurant and nope the fuck out within a few months, then switch to a different career. See if it’s actually what you want to do first, at least. It’s not like what you’re probably imagining. The hours are grueling, the pay is shit unless you land a good corporate gig, rarely will you find benefits or paid time off, holidays are gone, your coworkers will know you better than your family. With that said, obviously people do this for a reason, including myself. That reason is passion. It’s easy to have passion for cooking when you aren’t a cook. You may love making a dish using chicken thighs, but stand in one spot for 3 hours cutting chicken thighs and tell me how you feel about chicken thighs. I promise the answer is fuck those chicken thighs lol. You love making cheesecake, so do I, I’m a slut for cheesecake, but I’ve made thousands of them and my view on the subject is probably less romanticized. \n\nBe a chef, by all means, we welcome you with open arms. I love this career, there’s almost nothing else I’d want to do, this is the life for me, it could be the life for you, but for the love of god, don’t go to culinary school. ",
    "score": 1671,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1jrg8y7/dont_go_to_culinary_school_dont_do_it/",
    "created_at": "2025-04-04T16:34:06.000Z",
    "num_comments": 250
  },
  {
    "id": "reddit-1osmc9c",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Feeding hungry parents and kids until this sub says SNAP is fully funded (day 6)",
    "text": "Well another slower Saturday then expected, which is a positive sign.  45 last night, 68 Friday, 132 Thursday, 156 Wednesday, 118 Tuesday, 400 last week.\n\nLooks like most of the SNAP benefits went out in Clark County, although we did hear from several folks that came in that their balance on the card still says \"pending,\" so we will continue to run the special into next week.\n\nAnd even after this cruelty to our own people is behind us, the Pay in Forward Board is now a permanent fixture in the restaurant, as a testament to the good and generous people of Clark County, and how easy it is to find yourself on the other side of hunger.\n\nSo if ends aren't meeting and you and your family needs a hot meal, simple pull down a ticket and we will feed you.  Those tickets don't belong to me, they belong to you, the people of our community.\n\nWith love-\nChef Steve",
    "score": 1508,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1osmc9c/feeding_hungry_parents_and_kids_until_this_sub/",
    "created_at": "2025-11-09T15:36:18.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1m7u09e",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Michelin Star \"chef\" can't pay his vendors PART 2: RENT IS DUE",
    "text": "Link to the original post if you didn't see it before ⬇️\n\nhttps://www.reddit.com/r/KitchenConfidential/s/3X5s1UgV30 the\n\n\nSo here's a fun little update. First of all, I already found a much better job so I'm jumping ship immediately like everyone commenting on the original post was saying. But today I found this notice just sitting right on top of the printer in the office. Given the balance due, I can only assume he hasn't been paying the lease at all since we opened. I don't care about professionalism anymore because this man who has the audacity to call himself a \"chef\" doesn't know the meaning of the word. People who fuck up this badly in this industry deserve to be outed for the sake of all the people whose livelihoods they disrupt. \n\nTo recap, the \"famous award-winning chef\" Matt Horn managed his multiple restaurants so badly that he couldn't pay his employees, his vendor, and now his rent on time. Barely 4 months after opening his Elk Grove location, we're already about to get shut down because his obsession with being a restauranteur has prevented him from paying for his existing locations. Instead of just being happy with having one or two popular, profitable, well-managed locations, he decided to open multiple locations at once in cities that are HOURS away from each other.\n\nHe's been dumping all our money (yes, our money, because we haven't been getting paid on time) into opening a location in Fresno because that's his hometown apparently. If you aren't familiar with Fresno California, it is a certified shit hole. And it's a 3-hour drive from the Elk Grove location. Fresno is hardly what one would consider to be a culinary tourism destination. But yeah, it makes perfect business sense to open an expensive BBQ restaurant in the crime-riddled, drug-infested armpit of California. I'm sure all those people doing the fent fold outside the front door of the new restaurant will draw huge crowds!\n\nIf Matt sees this, I want him to know he has no business being in our industry. You were a retail salesman who decided he wanted to cook, and you got lucky on social media where you can construct and influencer narrative to make yourself look good. Just because you can smoke some meat and post a cool video doesn't make you a Chef. Chef is a title you earn after years of hard work and experience in our industry. You never worked your way up like a real Chef. You never worked in any real restaurants at all. You never even bothered to learn the most basic business practices necessary for running a restaurant properly. You don't get to hurt your employees by making them late on their rent and car payments. You're a joke. You wear big your stupid cowboy hat and sit out there in the dining room doing social media interviews acting like you're some hot shot while your employees, vendors, and landlord are all asking where the hell their money is. Shame on you, Matt. Shame. Do our entire industry a favor and sell your locations, cut your losses, and get a job as a line cook in a real restaurant so so you can learn how restaurants are supposed to be run. \n\nAnyway, thanks for letting me rant. Hope you guys enjoyed it. I'm washing my hands of Horn BBQ and \"award-winning chef\"  Matt Horn. I'm not even going to bother following him to see his career crash because I can already see the trajectory. ",
    "score": 1419,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1m7u09e/michelin_star_chef_cant_pay_his_vendors_part_2/",
    "created_at": "2025-07-24T03:42:42.000Z",
    "num_comments": 254
  },
  {
    "id": "reddit-1i5d8un",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "A day in the life...",
    "text": "Sat \n\n1200 Wake Up\n\n1210 shit shower shave\n\n1245 consider calling out sick\n\n1250 remember your broke and need the hours\n\n1300 check bus schedule\n\n1302 remember there is construction slowing busses\n\n1310 feed cat\n\n1312 walk 1/2 mile to temp bus stop\n\n1320 bus is delayed, cigarette\n\n1355 arrive at work\n\n1356 realize no prep(regular or special) is done\n\n1400 clock in, do all the prep\n\n1630 realize you haven't eaten\n\n1648 prepare food for self\n\n1655 prepare food for FOH\n\n1703 coworker burns hand, on line alone for dinner\n\n1706 full house, full rail, chef won't help\n\n1757 rail clear, do dishes(we don't have anyone in the pit)\n\n1820 caught up on dish, full house, full rail(burnt coworker now on expo)\n\n1837 chef tell me I'm doing it wrong(I'm not)\n\n1840 argue with chef, cigarette\n\n1855 full house, full rail\n\n1909 eat food i made 2+ hours ago\n\n1929 chefs family in dining room, and so is chef\n\n1945 full house, full rail, dishes stacked\n\n2058 finished rail, dishpit time\n\n2130 preclose\n\n2148 undo preclose to fire last minute ticket\n\n2200 kitchen close, dessert only. Dump pasta water, drain fryers, everything to dish.\n\n2215 chefs mom wants fried food, its her birthday\n\n2216 pan fry special request\n\n2232 cigarette\n\n2240 dish pit\n\n2310 clock off, double whiskey neat\n\n2322 head home\n\n0023 go to bed\n\n0356 actually fall asleep\n\n0530 alarm\n\n0740 actually wake up\n\n0750 laundry\n\n0825 shit, shower, shave\n\n0925 spend last of money on Lyft to stage\n\n0935 Lyft driver is pulled over by police\n\n0954 half a cigarette\n\n1000 stage, cut root veg for 3 hours\n\n1020 fail to find anything in walkin(it's a stage, its day 1)\n\n1135 question existence\n\n1220 decide you're horrible at this, and everything else\n\n1330 new chef apologizes for being busy, apparently the stage was over at 1200\n\n1355 mis en place complete, labeled, put in walk in. Clean station. Wonder if I should find a new career.\n\n1420 staff meal(first food since yesterday's 2hr old meal from yesterday)\n\n1430 Owner says i got the job, Head Chef of Caterring\n\n1450 bus home\n\n1600 tell reddit I'm tired, but also hired.\n\nTLDR: I just became Head Catering Chef at my favorite restaurant. My other job didn't appreciate me, so I did the grind til I got what I deserved. ",
    "score": 1100,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1i5d8un/a_day_in_the_life/",
    "created_at": "2025-01-20T00:10:26.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1i9qow8",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I love how genuinely merit based this industry is",
    "text": "~You're gay? Doesn't matter so long as you can cook\n\n~undocumented immigrant? Just keep flipping burgers man it doesn't matter\n\n~disenfranchised by society and generally looked down upon? Hey we've all been there before just keep firing all day\n\nAs a trans person I've gotten more love and support from kitchens and my fellow restaurant coworkers than I ever have from my own home or government. One of the very first conversations I had in a kitchen with a chef when I was 18 went something like this\nMe: \"Hey I use different pronouns than what's on my ID is that a problem?\"\nChef: \"huh? No Idc I need a cook and you can cook. I'll call you whatever you want just don't burn the bacon\"\nI love this industry and I wouldn't leave it for even the most cushy 9-5 120k+ salary job. \n\nStay strong out there chefs and remember no matter what your race, gender, sexuality, politics (unless it's just pure hatred) you're welcome in the kitchen to give us a hand\n",
    "score": 1004,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1i9qow8/i_love_how_genuinely_merit_based_this_industry_is/",
    "created_at": "2025-01-25T16:29:24.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1nsk48w",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I left commercial kitchens for something different and heres how it goes...",
    "text": "For the past 14 years I have been a salaried chef.  Constraints of labor statistics literally put me in a position of *needing* to work 60 to 80 hours a week.  I didn't have a choice.  It was my name on the menus and my pride wouldn't let my places of employment fail.  \n\nOver the years i experienced coming home to my wife crying because I had to shower, go to bed, and wake up st 5a to go back.  I missed my kids school plays and concerts.  The 1000s of times I came home to cold dinner in the fridge, I missed having dinner with my family again... But this was all I knew.  I was in my 40s, a career change now wouldn't keep the mortgage paid. \n\nI tried different things- healthcare, higher ed... nope..  no change.  Still the same grind but with even more toxicity in some cases.  So I stuck with higher ed, because at least there were some \"breaks\" where things slowed down for parts of the year.  \n\nI kept watching Indeed.  Will my perfect job show up?  The job market worsened and I felt a deep depression.  I felt stuck.  Burnt.  Aging and fucking *stuck.*\n\nA few months ago something popped up that really piqued my curiosity.  A union job managing a grocery deli (a 14k yearly pay cut, but hourly pay with insanely good benefits.)  Immediately I started researching.  Were my skills transferable?  \n\nI applied.  I had to lie about family emergencies to go interview.  I met the GM.  (Great dude, we hit it off immediately.)  We talked about a day in my life at my work.  A day in the life of a hypothetical deli manager.  And they lined up.  Big time.\n\nI accepted the position two days after interviewing.  Asked for a three week start date so I could enjoy a 1 week breather.   They obliged without hesitation.  \n\nThe job-  holy shit, folks.  I get to schmooze with the customers.  We talk about food.  There is a lot of surprise in customer's eyes as i suggest cheeses to go with their freshly sliced meats and give advice on recipes to take them over the top...\n\nI work 7 to 3.  I am *forced* to take the two 15 minute mandated breaks.  I had to get used to my staff not hustling 24-7, but shit, we get everything done, and our clientele genuinely seems thrilled with our foods.  I get to use my skills with our shrink (waste in the chef's world) and spread it into corporate recipes, helping the bottom line. Easy.  \n\nI will always miss the creativity, but that desire is fulfilled in a different outlet... cooking dinner for my family every night.",
    "score": 877,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1nsk48w/i_left_commercial_kitchens_for_something/",
    "created_at": "2025-09-28T09:35:51.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1izmn29",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Craziest thing you saw someone do in a kitchen?",
    "text": "Yesterday I saw a post of someone dipping their coated hand in the fryer and it reminded me of a sous chef I used to work with. This guy had burnt off all the nerves in his fingertips over the years to the point where he would hold his bare finger tip in the fryer for multiple seconds and show no reaction. As a 17 year old working their first kitchen job it used to blow my mind. \n\nWhile I know that mine is a little tame I would love to hear your stories about the crazy/stupid/dangerous shit you either did or saw over your career. ",
    "score": 823,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1izmn29/craziest_thing_you_saw_someone_do_in_a_kitchen/",
    "created_at": "2025-02-27T18:24:55.000Z",
    "num_comments": 756
  },
  {
    "id": "reddit-1m0db7s",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I just found out my girlfriend (admin officer who constantly complains about having nothing to do at work) earns the same salary as me (head chef who works 55+ hours a week)",
    "text": "this really is a chump's game isnt it?",
    "score": 802,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1m0db7s/i_just_found_out_my_girlfriend_admin_officer_who/",
    "created_at": "2025-07-15T09:33:58.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1mo009a",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "The salary is worth it but ooof.",
    "text": "Closer called out and nobody could cover. 20 person party ended up being a 60 person party and had two new people on tonight. Cheers and here’s to hoping it doesn’t happen again 😂👏",
    "score": 766,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1mo009a/the_salary_is_worth_it_but_ooof/",
    "created_at": "2025-08-12T05:14:56.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1k8bzj3",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I left my kitchen job of 20 plus years for my family. This note made me realize I made the right choice",
    "text": "I’ve been in the industry for over 20 years and became an executive chef 10 years ago. I’ve had the privilege of working in some incredible, high-end kitchens and even came close to earning a Michelin star.\n\nThree years ago, I married my beautiful wife. Together, we’re raising an amazing family — two stepkids (13 and 11), my nephew (13) whom I’m now the legal guardian of, and our 3-year-old son.\n\nNot too long ago, my wife sat me down and gave me the kind of talk that changes your life. She told me, “You’re working six days a week, 12+ hours a day. If you blink, your son will be all grown up.” Those words hit me harder than anything else ever could.\n\nSo, in late October of last year, I made one of the hardest — and best — decisions of my life: I walked away from the career I had poured everything into.\n\nSince then, everything has changed for the better. I’m at baseball and soccer games. I’m helping with homework, sitting in IEP meetings, and getting to be present for all the little (and big) moments. Every evening, I cook dinner and we sit together as a family, sharing stories about school, friends, and life.\n\nCooking at home has become a family affair — my stepkid is always by my side, helping roll pizza dough, cut veggies, stir soups, fry food, and handle all the mise en place. We make everything from scratch, and we make memories right alongside it.\n\nToday, I received a note from one of their teachers — a small reminder that the love and time we pour in really matters.\n\nI’m so grateful to my wife for encouraging me to choose my family over my career — for reminding me that some things can’t wait. I’ll never regret it.\n\nMaybe I didn’t get the Michelin star.\nBut I got something better — a kid who looks at me and says, “I want to be like you.”",
    "score": 649,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1k8bzj3/i_left_my_kitchen_job_of_20_plus_years_for_my/",
    "created_at": "2025-04-26T12:38:06.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1lwulc7",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Local diner struggling, I reached out",
    "text": "Hey everyone, \n\nMy town has a little, family run diner that’s been reasonably successful for decades. Unfortunately, both of their sons have passed away, one of whom was the heir apparent and primary operator of the diner.\n\nThey’ve recently announced occasional closures due to staffing challenges. While I’ve only occasionally eaten there, I’ve always had a soft spot for the place and suggest it to as many people as I can because it’s a great little diner.\n\nWell, they posted again on FB that they will be closed again due to staffing challenges and it just made me upset. I messaged them on FB asking how I can help and laid out a brief of my resume.\n\nI’m keeping my current career, Assistant GM at a regional C-store that’s very food heavy, but I can’t lie, I have a bit of a romantic dream of owning my own diner some day. Maybe this’ll open that door. Maybe it’ll just be an experience that helps a small business recover. I don’t know, but I’m getting a phone call at about 11 tomorrow morning to start discussing how we’re going to move forward.\n\nI’m quite capable of running a fast paced business with many revenue streams, but this just feels like the right thing to do for a little place having a rough patch.\n\nAnyhow, I might be making a move from just chain foodservice and adding in some 60’s era diner. I’ll probably be asking for advice on some things depending on what I find out exactly what they need. I just really want to see this place thrive.\n\n\nUPDATE: I start my cooking gig on Monday. They mentioned possibly selling it at some point. I told them that while I’m quite possibly interested, I wanted to learn their business first. 👨🏼‍🍳",
    "score": 626,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1lwulc7/local_diner_struggling_i_reached_out/",
    "created_at": "2025-07-11T01:49:37.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1p5m488",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I Spent Four Years Across Michelin Restaurants in NYC, SF, and Chicago - AMA",
    "text": "I feel like I've been seeing a lot of posts about what it's like to be in Michelin Star restaurants recently, so wanted to offer my insights as a former Michelin restaurant cook.\n\nI worked as a full-time employee at three different Michelin spots (opening to 1-star, 2-star, and 3-star), interned at a 3-star for a month, and staged while job-hunting across 12 in all three cities. Less relevant, but I've also dined at 20 Michelin restaurants across NYC and SF.\n\nI was originally going to share a photo I took of this hilarious tidbit in an on-boarding packet from a Thomas Keller property that had accidentally been deleted, but feel free to ask me for whatever verification I can offer that isn't a photo of my face.\n\nEDIT: When I said \"a lot\" above, I meant like two, but that's a lot to me.\n\nSECOND EDIT: I'll obviously elaborate as much as I can, but you can basically assume that all my answers will be \"super variable\".\n\nTHIRD EDIT: I'm going to abridge it a bit, but this was DMed to me:\n\n\"I have an established career in a completely different sector that I want to throw away to become a chef, how do I -\"\n\nDo not do this. Do not do this. Do not do this at all.\n\nFOURTH EDIT: I am not responding to further chive content.\n\nFIFTH EDIT: Also had this convo over DM so thought it was worth sharing:\n\nHello, saw you post about working in \\*\\*\\* restaurants. I was just really curious about the ridiculous TK Group onboarding thing you mentioned in your post. I worked for TK Group decades ago so I always appreciate stuff like that. Thanks!\n\nEqual-Still-2488 9:03 PM\n\nThere was a segment in a paper packet titled \"Be The Bacon\" that talked about how TK thought about who \"gives the most\" in an average breakfast plate. Like, the chicken gives its egg, etc. The answer was the pig because it dies to make bacon. So they made an award for who sacrifices the most in the kitchen called \"Be The Bacon\". Just in case \"Fucking Kill Yourself For This Job\" was too on the nose.\n\nI think it was discontinued because most of the packet was out of date, (including the equipment list which got me yelled at my literal first day because I only brought all the shit they told me to bring and not all the shit they didn't tell me to bring) but it killed me when I saw it.",
    "score": 531,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1p5m488/i_spent_four_years_across_michelin_restaurants_in/",
    "created_at": "2025-11-24T16:47:30.000Z",
    "num_comments": 208
  },
  {
    "id": "reddit-1kwh7dl",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Unsure if I made the right choice.",
    "text": "Recently made a career pivot involving switching to a speakeasy.\n\n For context, I've been in kitchens for 20 years. 9 of those as chef. I ran a very popular kitchen for 7 years but had differences with the owner in the end. Weekly specials, brunch on sunday, and a brunch special. Almost increased their business by tenfold. I got burnt out and spent a year as a produce inspector, but I got bored. Ended up as a sous chef for a country club. Worthless staff, but I could run the whole show myself if needed. But the food was soulless. Just frying sysco trash.\n\nI got a random offer one day from a previous coworker to take over the kitchen. I met up and had great conversations with the people running it. Everyone seemed on the same page. Except it was a substantial paycut. I have done this before and ended up improving things to the point that I earned more than ever before. So I took the plunge.\n\nI've been getting my footing for a few months now. I love how I'm cooking real food again.  But I have only one employee that works 3 days a week. He's a solid guy. I love his gusto. But the FOH has 4 people every night. I've inquired about having 2 people in the kitchen on busy nights. They seem to dance around the topic. So now I work 7 days a week for less hourly pay. All of this while sharing a small section of a kitchen that's staffed by 10 other cooks I have to share space with.\n\nI wake up and place orders. I go in on my \"days off\" to make specials or do inventory. It's like im a glorified line cook that has to take the fall for everything. Every bartender seems to have their input be final word on every dish I make. AND I run the food! I run it past FOH sitting on their phones. It's like nobody notices even if I bring it up.\n\nDo you think I can fix this?\n\n*Shitty picture of my last special italian beef because the photographer is trash too and I needed to use up some frozen smoked ribeye before it died.",
    "score": 508,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1kwh7dl/unsure_if_i_made_the_right_choice/",
    "created_at": "2025-05-27T07:25:06.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1lsc2rj",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I think I'm a chef now.",
    "text": "I dont understand the system in English. Please help me out. I was hired to be a Kitchen helper (ayudante de cocina in Spain) but now I know how to make everything in the menu, Chef had to go open a new restaurant, Sous Chef became Chef and me, I'm sous Chef? This sounds kind of dumb now, but I'm actually dumbfounded... Today I gave lunch to 40 people with a helper... I was a chef! I am Chef.\n\nFinally, I have a career, lol. I love it, I rest now 2 hours and go back to the fire for 5 more hours, just what I need.\n\nUPDATE: Guys, you are so awesome! Thank you so much for the encouragement and good wishes. I'm on my way to get good shoes as someone suggested.",
    "score": 497,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1lsc2rj/i_think_im_a_chef_now/",
    "created_at": "2025-07-05T15:10:37.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1l5lil8",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Dont let anyone dim your light‼️",
    "text": "One day when I first started at a previous job the Executive Chef told me \"I would never go anywhere in the culinary world\" because I wouldnt let me him berate me and yell in my face.\n  Today im an Executive Pastry Chef making 58k base salary (65k if you wanna include quarterly bonuses.)\nI held on to that memory to 1. Spite that guy and 2. So I can train future cooks better than I was, with compassion and hopefully inspiration.\n\nHolding grudges is healthy for you‼️",
    "score": 400,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1l5lil8/dont_let_anyone_dim_your_light/",
    "created_at": "2025-06-07T14:00:39.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1ltt8n9",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "The Best Cooking Job Ever",
    "text": "I worked as a chef for years. No weekends off. Every day all summer. No time with my kids. Fighting for overtime. Stressed. Eating Tums like M&amp;M's. I was burnt out. Tired. Done. And then I found this job. Working on research vessels all over the world. I cook breakfast, lunch and dinner for a crew and staff of 40ish people. I have 2 support people. I work from 5am until 7pm with a two hour break in between. I've been to 40 countries. Snorkeled in Guam. Climbed a glacier in Alaska. Hiked a mountain in Hawaii. I work for 60 days and then have 30 days off. PAID. This summer I'm taking my family to Europe for 3 weeks. Sounds amazing right? You should try it. I want you to.\n\nNOAA's hiring freeze should (fingers crossed) be lifted on July 15. If you are good chef, good at cooking, training and planning then I'd like you to consider coming to work for NOAA. There are some requirements. You need a Merchant Mariners Credential (possibly being waived, NOAA will help you get in first year), a TWIC, a passport, your vaccinations and a basic safety course. It all takes time and about a $2000 investment. But I am telling you that this is an amazing job with excellent benefits. Health, Dental, Vision. Thrift Savings Plan for retirement.\n\nYou do need to be THC free. The return is worth it.\n\nMust be US Citizen.\n\n4 months a year paid vacation. Real time with your family.\n\nI've attached a copy of my latest paycheck to verify what I am saying is reliable.  Sometimes you get laiud up at a dock or do repair yard work and then the pay isn't this good but it's still $3000 or so.\n\nMessage me if you are interested and we'll chat. If you are good at what you do then I'll help you with the process and introduce you to the hiring staff.\n\nLooking forward to hearing from you!",
    "score": 390,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1ltt8n9/the_best_cooking_job_ever/",
    "created_at": "2025-07-07T12:46:07.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1ow7kap",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Feeding hungry kids and parents in Vancouver (WA) day 17?  18?  Everything is blending together at this point",
    "text": "The final day of the Shutdown Special, although the Pay it Forward board will remain up year round as a permanent fixture in the restaurant. \n\nFinal count (not including today)\nof hungry kids, parents, hardworking men and women, and anyone in the community that was effected (affected?) by the SNAP funding cruelty stands at 1059 meals in a two week period (Oct 28th to today)\n\nNot too shabby out of a 300 sq foot kitchen with a full time staff count of 2 (plus me).  Im super proud of my staff, both the full time vets and the PT high school kids who could not have been more kind and gracious to everyone who stopped by.  None of this would have happened without their help, and I hope they are as proud and happy with themselves and the results as I am.\n\nThanks again to all of you guys in the sub, I appreciate everything this place has to offer, from the serious recipe help post to the eye rolling ridiculous we deal with every day vents, and of course, so. many. chives.\n\nWith love- Chef Steve ",
    "score": 385,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1ow7kap/feeding_hungry_kids_and_parents_in_vancouver_wa/",
    "created_at": "2025-11-13T17:41:48.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1hv8dhq",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "We all know pay is usually shit for BOH. What do yall consider reasonable/average for a salaried chef?",
    "text": "*Mods I know surverys aren't allowed, and I'm not sure if this counts. Please delete if not appropriate*\n\nI have been in the industry for 9 years, going into my second year as an EC. I consider myself very lucky to be making 75k base salary with quarterly bonuses (HCOL area). I work 50-60 hours a week in a high volume restaurant. \n\nWhat do you guys make? What do you consider reasonable? I know BOH generally always makes less than they should given the skill and effort required for the job, but I have no idea how much other managers generally make. \n",
    "score": 243,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1hv8dhq/we_all_know_pay_is_usually_shit_for_boh_what_do/",
    "created_at": "2025-01-06T20:06:28.000Z",
    "num_comments": 164
  },
  {
    "id": "reddit-1iu85g7",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I know this is normal now but jeez (rant/vent)",
    "text": "For context minimum wage is $16.50 where I live- but $18/hr for a full time position at a MICHELIN STAR restaurant?? I know those benefits are good (especially for the industry) but the pay is just baffling to me. Is this a typical salary or am I just a spoiled millennial? ",
    "score": 177,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1iu85g7/i_know_this_is_normal_now_but_jeez_rantvent/",
    "created_at": "2025-02-20T20:15:01.000Z",
    "num_comments": 146
  },
  {
    "id": "reddit-1lh5lu6",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Kitchen nightmare",
    "text": "This is just a vent post cus idk what to do or feel at this point. I’ve been working at one of the last running Whiskey Creek steakhouses for the last three years. I am 21 years old and when I first started there where three other cooks all my age with one being the bosses son and kitchen manager. This year I am the last man standing and the only cook with any experience because the boss and his son and other cook left to start their own place. When the new management came in, she brought like 4 of her friends from her old restaurant to help. One of them was a kitchen manager. I was concerned because that was the position I wanted now that I was the only one with experience, so I talked to her about it and she told me that upper management was not allowing us to have a new kitchen manager now that the last one was gone because they don’t want any more the kitchen staff on salary, an that yes she had brought her in to be the kitchen manager but was not able to. \n\nAlarm bells ringing. How is a kitchen supposed to operate without a lead?! Well that’s what we have been doing for the last 6ish months and it’s been hell. Everyone needs my help or knowledge. I’m doing all the training, I have to cut my crew based on labor. consistency and quality are out the window, not to mention the kitchen schedule is always posted late and truck is ordered incorrectly leading to not enough inventory.\n\nNow let’s talk about wage like I said three years now and I just got my first raise with the management shift, and don’t get me wrong I will always be grateful for $18 an hour but when I have not broken 40 hours a week since I started working here it puts me on edge. And that is not an exaggeration. The amount of times I have been cut early because I am getting close to 40 hours is incalculable, it makes me feel like shit when I know the most I can ever make off a paycheck is 1100, and the fact that the servers can make that in two weeks (also not an exaggeration we are one of the busiest restaurants in our town they make bank).\n\nAll of the equipment is half broken it feels like, we haven filtered our fryers since I’ve been here because we don’t have a filter. we’ll boil out and scrub (which I do) weekly. \n\nIdk last night I didn’t start he smoker and wasted like 500 dollars worth of meat and no one was even upset with me. It sounds scuffed but I just want to take pride in my work.\n\nAlso it’s hot as dick, like over 100 air temp",
    "score": 176,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1lh5lu6/kitchen_nightmare/",
    "created_at": "2025-06-21T20:09:22.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1k3d09b",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "This weekend nearly broke me.",
    "text": "So we have been open for about 3 years now. The first year our Good Friday was slow because we were still new and word hadn't gotten around. Last year on GF we did about $5000 in sales. This year we did nearly $7000 in sales. To put that in perspective, a really good Friday would be around $3500-$4000 in sales. \n\n  \nLast night our expo walked out middle of supper rush and just abandoned us. Needless to say by the time we were finally done everyone was exhausted, we were beat down and burned out. My boss said just do the -absolute- min we had to do to get out, as he didn't want to have to pay 1.5X pay just to do cleanup and dishes, and that he would come in early today and do them all. \n\nAfter working a 14 hour shift (Everyone else worked 6-8 hour shifts) I didn't say boo, I was completely and utterly exhausted as literally $5000 of that $7000 sales were fish and chips and I am on fryers. \n\n  \nSo today I woke up and was already tired and ready to be done but stuff had to be done, prepped, cleaned etc. for tonight so I was at work at 10:30 this morning. I was already pissed off at my boss for other BS stuff when he calls me at 11:00 wondering why I was at the restaurant already (I am kitchen manager and put in 2-3x as many hours as everyone else) and I told him I had a TON of stuff to get ready for tonight, etc. He tells me he needs to go to the bulk produce store to get a box of sweet potatoes and then he would be in to help with cleanup. AT THREE THIRTY HE WALKS IN AND ASKS WHY THE KITCHEN IS STILL A DISASTER!!!!!!!\n\n  \nOn top of that we had a PVC pipe break in the basement leading to a bunch of water pouring directly onto the hot water tank, shorting it out, so no hot water for the night...\n\n  \nI told my boss I am not working till Wednesday as I needed a few days off to rest after a brutal few weeks and I am VERY strongly looking in to a anonymous tip to the health inspector about the lack of hot water and putting out some resumes as, to be blunt, my boss cannot afford to pay me what I am worth. (I do all the scheduling, inventory, most of the ordering, deliveries, most of the prep, I open-close 6 days a week, average 55-65 hours per week and am paid 40 hours per week salary(I know)) ",
    "score": 172,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1k3d09b/this_weekend_nearly_broke_me/",
    "created_at": "2025-04-20T02:57:10.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1iudb1g",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "was let go today, lol.",
    "text": "whopping 3 week run as head chef. was told they couldn’t afford to keep me on salary, offered an hourly position but was too much of a pay cut to accept. took it as a sign and moving forward with my own business plans now of opening a ramen bar. cheers chefs🍻",
    "score": 150,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1iudb1g/was_let_go_today_lol/",
    "created_at": "2025-02-20T23:56:51.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1i2yaqs",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Investors want me to run food truck ",
    "text": "For context, i’ve been running a food pop up for about a year and a half, wood fired pizzas, smash burgers, birria tacos mostly. I’ve built a really good clientele of at least 100 regulars who support me and i’m super grateful, i do private caterings and dinners on the side as well as a part time job in nice italian spot mon-thursday. The owners of the brewery I most frequently pop up to want to buy a food truck and have me run it. Im excited about the opportunity, but want to ask my favorite subreddit to weigh in. Essentially, they would buy it, get it licensed and do the marketing. I would just have to come up with menus, and run the operation. I’m just not sure what to negotiate pay wise, would it make more sense to negotiate for a salary, or a percentage of profits. One thing that kills me is i’ve been the sole owner of my food venture and it feels fucking amazing to make all the money, and i understand that won’t be the case if i go forward with this. Although I get the opportunity to build a brand and name as a local chef with no investment. Have any of you been in a similar position? If so any advice or guidance would be really helpful. Right now i’m making probably 75k with my part time job and weekend pop ups, but i’m working a ton and i’m all over the place these days, would like to just focus on one thing. ",
    "score": 89,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1i2yaqs/investors_want_me_to_run_food_truck/",
    "created_at": "2025-01-16T20:20:18.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1jb6vqu",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "How bad of an idea is it to walk out right now?",
    "text": "Fellas if you go through my post history you can see I've had this same issue several times. Well. Now the CEO wants salaried managers to work 60 hours a week, even working 6 days if needed. I make 63k salary plus bonuses that could bump up to atleast 80k. \n\nBut guys. I am so burnt out. I know my store is struggling. I am pretty much the only manager. I'm supposed to interview/hire/train, make the schedule, do truck orders, do inventory. Yeah. You get it. The workload of 3 managers is all being placed on me. \n\nAnd it's not just my store. A majority of locations are lacking managers. \n\nI can't do this anymore. My feet hurt. I'm exhausted. I don't have any energy. Physically, mentally, emotionally. I cry in my car sometimes before each shift. \n\nI have a bit of savings. Not a lot. I had a pet emergency 2 weeks ago and that almost wiped me clean. But I can do like 2 weeks without a job. I'm already looking. For anything. But I can't keep doing this. ",
    "score": 73,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1jb6vqu/how_bad_of_an_idea_is_it_to_walk_out_right_now/",
    "created_at": "2025-03-14T15:41:41.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1m8lz4n",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "I had to cry in the walk in for the first time",
    "text": "I had to put down my cat last tuesday. I had that day off with my BF and we made the decision that it was time. The poor boy was just suffering. Massive dose of barbituates after he was under a general sedative and it was all over. Just peaceful. Poor boy was only 6 but cancer ate him down to the bone. It was one of the worst days of my life.\n\nI called my chef on monday to tell him that i could not come in on tuesday, my day off. Schedules are always subject to change in the industry. Sometimes you just get a shitload of reservations and need more people. I get it. So i called to say that Tuesday, i could not be on call for that reason. He was apologetic of course and said \"you're ok, we got other people. Sorry it came to this. My daughter went through that last year and was broken up about it for months. But are you good for wednesday? because we got a lot of people then and we need your help.\n\nSo i show up wednesday. I was off my game. I was just kind of out of it. Going through the motions, needing more direction as to what i should be doing next than normal. Of course i was, given the day i had yesterday. And then for service, I perform. The exec, who is a good boss but over the hill and just putting in time before he retires to the south, he's laughing it up with the sous who is working cold side. meanwhile me and this other guy - who is the real backbone of the kitchen who makes all the shit happen - are putting up the buffet taco menu we got for that night. He did the steak and beans and marked the tortillas on the grill, while i did the ground beef and chicken and rice. And it was upsetting. We're the two lowest paid guys in the kitchen and we're doing the important part while the highest paid salaried guys did the easy part. and we had 2 other cooks in the kitchen helping them and doing prep for saturday. The backbone guy and I wanted some help. And the foh manager noticed and asked us what was up. And the backbone guy just told her straight up how it was bullshit he gets all this responsibility and none of the pay, and i second it saying \"i don't like how they're running it compared to last year\" when we had a different sous who quit over conditions, and then said \"it's not right and unfair to both of us, but especially to (the backbone guy).\n\nThen it hits me that my cat won't be there to say welcome home and make biscuits against my chest and bicep while i play on my computer and pet him. And i'm also hot as fuck because it was a hot day and i'm in a kitchen, so i go to the freezer and just cry once the buffet is closed because i was at a breaking point. That was the best part of my day, when i came home to him. \n\nThe next day the exec and sous pull me aside and ask what happened and why backbone guy and I had bad attitudes that day. I tell them straight up that the backbone guy and i felt under the gun while you guys and the 2 other cooks were taking it easy on cold side prepping for saturday, and that it was also one of the worst days of my life and that i had to cry in the freezer because of how shitty everything was with me relating to my cat and that i'm sorry i let my personal life affect my work. They understood and things were fine. Backbone guy said to me that i was a better man than him because there was no way he'd be there after something like that. I told him i wouldn't put him in that position because then he'd have been even more in the shit and he's taught me too much for me to do him like that. \n\n  \nAnyway, i wanted to share about the first and only time i've ever had to cry in the walk in because of how shit the day was. Usually i just get mad and go outside and smoke a cig and curse people out in my head. ",
    "score": 64,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1m8lz4n/i_had_to_cry_in_the_walk_in_for_the_first_time/",
    "created_at": "2025-07-25T01:14:18.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1nnejgd",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Is this offer for General Manager worth it? $70K a year for 62 hours a week.",
    "text": "This is a salary position for GM.\n\nIt is All-You-Can-Eat Sushi restaurant in Southern California. It is located at an outdoor mall.  \n\nI don't have any manager experience. I just have sushi chef and cook experience. But he said he will train me thoroughly and teach me everything about management.\n\nHe said I will work minimum 5 days a week (12 hours x 3 days &amp; 13 hours x 2 days). So 62 hours total.\n\nBut he claims that I will only work 52 hours a week because I get 2 hour breaks.... I don't know if I agree with that. I would still count those 2 hour breaks as part of my working hours because I am still going to be at the restaurant. Also something could go wrong and my staff would need me to be on-site. So even during breaks I'm technically still working and on-call.\n\nAnd of course, he said I will have to cover shifts if someone doesn't show up. So sometimes I will work 6 days a week. Obviously I would have to cover for every and any shifts - server, host, cooks, sushi chefs, etc.\n\nWhen I calculate $70K a year for 62 hours a week, it only comes out to be $21.71 per hour.\n\nThoughts?",
    "score": 56,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1nnejgd/is_this_offer_for_general_manager_worth_it_70k_a/",
    "created_at": "2025-09-22T05:55:40.000Z",
    "num_comments": 148
  },
  {
    "id": "reddit-1kjlq5f",
    "subreddit": "KitchenConfidential",
    "soc_codes": [
      "35-1011",
      "35-2014"
    ],
    "title": "Just got a job without necessary experience — now I’m overwhelmed and not sure this is what I want",
    "text": "So, I recently landed a job in a fine dining restaurant inside a private club — high-end place, members only, serious stuff, if you’re gonna ask, no, I didn’t lie about my experience I was 100% honest. I’m technically a Demi Chef de Partie, which sounds cool but in reality it’s basically one step above dishwasher since we don’t have commis. That said, the salary is surprisingly good.\n\nHere’s the thing: everyone in the kitchen has been to culinary school and has like 10+ years of experience. I’m the only one with no formal education and barely a year of experience. Despite that, they put me in charge of all the pasta dishes — and I’m working the station alone. No support. They trust me because I show up and get the job done, but honestly, the pressure is insane.\n\nI wish I had the chance to start from the very bottom, doing prep and learning slowly, building a proper foundation. Right now, I’m dealing with high responsibility without the skills to back it up. I still struggle with basic knife work. I make mistakes often and constantly have to ask if I’m doing things right. It’s frustrating and stressful and it makes me feel stupid.\n\nI’m also starting to question if this is even what I want long-term. I respect the hustle and the craft, but I’m not sure I see myself doing this forever. And with everyone around me being formally trained, I wonder if there’s even a real career path for someone like me in this environment.\n\nHas anyone been in a similar position? How and when did you realize this was (or wasn’t) your path? What should I do now?",
    "score": 56,
    "url": "https://reddit.com/r/KitchenConfidential/comments/1kjlq5f/just_got_a_job_without_necessary_experience_now/",
    "created_at": "2025-05-10T22:09:24.000Z",
    "num_comments": 27
  }
]