[
  {
    "id": "reddit-1mt8t00",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Sherita Won’t Check Guest In",
    "text": "@sheritayoung50 on TikTok\n\nI used to work in hotels and I LOVE this gal. Gotta love the, “I am a Platinum member” entitlement. ",
    "score": 3244,
    "url": "https://reddit.com/r/CustomerService/comments/1mt8t00/sherita_wont_check_guest_in/",
    "created_at": "2025-08-18T01:37:34.000Z",
    "num_comments": 232
  },
  {
    "id": "reddit-1hpes2h",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Woman threatened to stab me after getting her discount. ",
    "text": "I am a 36 year old man who works at a discount retail outlet. On Christmas Eve, I was working the register. A woman cut the line to ask me to price check a heated blanket that was not in its packaging. \n\nI told her there were customers in line ahead of her, but the next customer said “it’s fine” so I went ahead and checked the price. I told the woman it was 24.99. She said “I don’t want to pay more than 19.99 for it, it doesn’t even have a bag” \n\nI was feeling a little annoyed to be working Christmas Eve, and this lady was not being kind, so I said to her “ok, I’ll put it in a bag for you. 24.99”. She then said “cmon, it’s Christmas and I don’t have any money” I said back to her “well, I don’t want to be a Scrooge, so let’s ask my manager” \n\nI called my manager over and I admit, I was feeling snarky. I said “this woman would like a discount because it’s Christmas” and he looks at me and then over to her. She then Says “I’m a really good customer, I just bought a heater here last week and I’m in here all the time. Think of all the days I’ll be back next year” and he said “ok, I can do 25% off” and I then Said “hey that’s great! 25% off of 24.99 is pretty close to 19.99, that’s what you wanted to pay!”\n\nSo I’m ringing up the blanket for her, and she says “you know, you should really treat your customers better” I said “well…” then trailed off, and said “you know, let’s just leave it there.” The woman got very upset and said “oh yeah, you’d better just leave it there. We don’t want things to get ugly”\n\nI’m still being snarky, so I said to her “ma’am, we cant be ugly on Christmas Eve!” Very sarcastically. She then said to me “I’ve got a knife on me, and I know how to use it!” And took a step towards me. I handed her the receipt and said “oh no ma’am, if you stab me, I’ll have to go home early and see my family instead of working all Christmas Eve!” \n\nShe then said “well maybe you will” and gave me another dirty look before she walked away. \n\nI admit I was sarcastic and snarky with her, but I still feel what she said was uncalled for. I feel quite upset. ",
    "score": 2760,
    "url": "https://reddit.com/r/CustomerService/comments/1hpes2h/woman_threatened_to_stab_me_after_getting_her/",
    "created_at": "2024-12-30T04:16:43.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1o7r0kp",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "I got my boss fired without realizing",
    "text": "I worked at a fast food restaurant that is local to North Carolina for a little over 3 years as the drive thru cashier. I became so good that the store had the best drive thru time of all the stores. I was the person that was called in whenever anyone called out, and I ran that store like I owned it. I knew how to do everything except the managerial office stuff. \n\nAfter about 2 years there, I began to apply for the shift manager position, and the assistant manager began training me on how to do more things that I would need to know. After 3 of my applications were denied by my store manager, I talked with him and he said that he couldn't afford to lose me to another location. \n\nBecause we were a local business, the owner of the company would tour all the stores about every 3 months. Every time he came in, he would stop and talk to me and other employees, making sure we were happy. On one visit, I asked if I could talk to him, and we sat down together. I told him what my manager had said, and he said that if I wanted to stay in my store, I could go straight back after going to the training store. \n\nSo, I talked to my manager again and told him that I was going to train there and come right back to this one. He said ok, so I put in another application for shift manager. When it was denied again, I knew that he would never approve it, and it was time for me to find another job. \n\nI found a better position at a different place within 3 weeks and gave my two weeks notice. I began telling customers that I was leaving, and where I was going. One day, he told me I couldn't do that anymore. I asked him what was wrong with it, and he said if I didn't stop, he'd fire me. I laughed and said I already quit, I was just working out my notice.\n\nAfter about 4 months after I left, I went by to visit, and they had a new manager. I asked my old work friend what happened, and she said that after I left, they lost 40% of their business. Corporate got upset and paid them a visit to find out why. Everyone there told them that the customers left when I did because no one wanted to come in if I wasn't there. When they confronted my old boss, he gave them the excuse that he didn't want me moved to another location, so he wouldn't approve me training to be aa shift manager. The owner told him he was fired and to leave immediately.\n\nI was really shocked to hear it, and she told me they never really recovered. Funny thing, when I left the next place, the same thing happened there too.",
    "score": 2111,
    "url": "https://reddit.com/r/CustomerService/comments/1o7r0kp/i_got_my_boss_fired_without_realizing/",
    "created_at": "2025-10-15T23:42:28.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1nxl0rf",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "A moment I will never forget",
    "text": "I just clocked in yesterday when something happened that really stuck with me.\n\nA sweet elderly lady, probably in her 80s, came in shaking badly and walking slowly with a cane. She was clearly struggling, and my heart sank seeing her like that. I walked over and asked if I could help with anything. She smiled and said, “Do you mind filling up my cup with ice, dear?” Of course, I said yes and filled it up for her.\nWhile I was helping, she started chatting with me and apologized for bothering me, explaining that a new medication was making her shaky and affecting her mobility. I told her not to apologize I was there to help.Then she said something that broke my heart “Dear, I hate to be a bother again, but do you have anything old or expired I can get for a discount? I don’t have much money.” That’s when I just knew she needed more help than she was asking for. I told her, “Ma’am, whatever you need today, I’ll pay for it. Doesn’t matter the price.”\n\nShe looked at me in shock.\n\n“Are you sure? You don’t have to.”\n“I’m positive. Would you like a drink or maybe some food?”She nodded slowly, clearly emotional.“C-can I get a coffee and maybe a c-cheeseburger? If that’s not too much for you.\" I smiled and said of course. I bought her a Starbucks coffee and a cheeseburger. When I handed it to her, she started crying and hugged me, saying thank you over and over. I hugged her back and told her she’s going to get through this that it’s going to be okay.\nI walked her to her car, and she told me she was going through her second round of cancer. She’d spent nearly everything she had left on chemo and doctor visits. She said what I did was the kindest thing anyone had done for her in a long time, and that she didn’t have much family or support left.Before driving away, she said\n“Sweetie, you made this day amazing. Thank you. I’ll keep you in my prayers tonight.\"\n\nAfter she left, I went into the backroom and cried. For her. For everything she’s going through. \nI don’t share this to be recognized or praised. I share it as a reminder: always be kind. You never know what someone is going through and sometimes, the smallest gesture can mean the world. ",
    "score": 1576,
    "url": "https://reddit.com/r/CustomerService/comments/1nxl0rf/a_moment_i_will_never_forget/",
    "created_at": "2025-10-04T04:55:03.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1j24ksu",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Accused of poisoning a kid",
    "text": "I work at an ice cream shop. At our shop we have regular ice cream and then another ice cream that is not dairy free but lactose free.\n\nIt is a busy night because it is one of the first nights it has been warm in a while. Line was wrapped out of the building. Whatever we typically have lines out of the buildings because it a popular local ice cream place.\n\nA family comes in and I ask them what I can get for them today. The adults are too busy chatting away in the back to one another but the little boy about 8-10 year old speaks up. He ask me what ice cream we have that doesn't have any dairy in it. I explain to him that we have sorbet and that we also have two flavors (cookies and cream and orange dream) that are not dairy free but are lactose free. The boy says he wants the cookies and cream of the lactose free one.\n\nWe use different scoops and it is stored separately. So I get him his scoop and the adults he were with proceed to pay for him.\n\nAbout a hour later a lady walks in a demands to talk to our manager. She says that her nephew had to be rushed to the ER because he was allergic to dairy and that I served him a diary product. I immediately knew who she was talking about.\n\nI explained to her that I told the kid that it was lactose free and not dairy free. I also mentioned how he did not say he had a allergy to dairy.\n\nShe kept saying \"still my nephew is really sick right now.\" I told her I understood and that I hope he was okay, however I gave him all the information he requested and also pointed out that if you are going to take a kid to a place full of dairy products knowing he was allergic then it would probably be helpful to help him order instead of chit chatting with adults.\n\nLuckily my manager sided with me. I feel bad for the kid but I honestly feel like I did nothing wrong.\n\nEdit: Those saying that I should have only told him about the sorbets. The reason I suggested both is because that is a script of what the company tells us to say. A lot of people (including kids who know they can't have dairy) come in asking for dairy free ice cream and not actually being allergic, just lactose intolerance. If I was informed of the allergy then of course I would have said something along the lines of \"Ok then you should probably stick to the sorbet and we will go to the back and clean all the products for you and use an un-open scooper. We can't guarantee anything.\" Ultimately it is up to the customer to inform of allergies which he did not (not his fault but the aunts fault).",
    "score": 1526,
    "url": "https://reddit.com/r/CustomerService/comments/1j24ksu/accused_of_poisoning_a_kid/",
    "created_at": "2025-03-02T23:21:44.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1kdln51",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Customer unironically said “this is America” and “you people” over his food not being ready",
    "text": "Rant incoming. For context, my workplace is a Chinese restaurant that specializes in Hong Kong-style BBQ meats (think roast duck, bbq pork/char siu, etc.). If you've ever been/seen one, we have all the meats literally hanging in a glass box for customers to see. \n\nThis customer didn't order any BBQ items, just generic kung pao/orange chicken. After he ordered, two more customers came in and also ordered within a few minutes of him. Both customers ordered BBQ items, one of them exclusively BBQ and the other had an additional order of veggies. \n\nNaturally, these customers' orders were handed off quicker because, again, the meats are already cooked and literally on show -- they just need to be cut and packed up. His was 2/3 done by the time we handed off to the other customers. But this evidently rubbed him the wrong way so he was already mumbling stuff under his breath. \n\nFinally he speaks up, talking about deserving his money back and why they got their orders first. Both my boss and I attempted to explain the whole BBQ vs kitchen entrees thing (and very nicely might I add), but dude cut us off and said \"I don't wanna hear it\" lol. Then he mumbled some more stuff before randomly saying \"this is America\"... I mean yeah it is but how is that relevant? \n\nAt this point my boss is visibly upset and firmly points out that, again, he ordered different things. Then he hits us with the good ol' \"you people\" and then even tried to claim we were discriminating against him (the other customers happened to be Asian). I was done with the guy right about here and just went off on him. Pointed out how he's been rude and disrespectful with us from the get-go, that he's not even letting us reply/explain. He said \"freedom of speech\" somewhere along the way, so I said it right back.\n\nHis concern was an objectively reasonable one, anyone would question why people behind them are getting something first. But he automatically decided that no reason was good enough, there was no point in hearing us out, and that resorting to racial insults was the way to go. Down to the lowest circle with losers like that. ",
    "score": 1352,
    "url": "https://reddit.com/r/CustomerService/comments/1kdln51/customer_unironically_said_this_is_america_and/",
    "created_at": "2025-05-03T05:35:05.000Z",
    "num_comments": 87
  },
  {
    "id": "reddit-1k1vrj7",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Insane red-pill guy at AutoZone",
    "text": "I just got a new car and I had to register it when they gave me the plates I realized I didn’t have any screws so I went to autozone, I went in and the guy on the register asked me what I was looking for. I told him and he showed me where the screws were. They a had a bunch of different ones so I asked him if he could help me choose cuz I didn’t know which to get. He says “lets go look at your car and then I can tell you “ we walk towards the door and when we get to the door this guy says “open the door for me” at first I laugh cuz I thought he was joking. This guy was dead serious, I opened it whatever. We go to my car and walk back towards the entrance, mind you this guy is walking ahead of me. He gets to the door and waits for me to get next to him and says “open the door for me” AGAIN!!! At this point I’m like WTF, I laugh and I asked him “WTH do you think you’re a woman, you need your door to be opened for u?” And he responds with ”is 2025 man don’t need to open their own doors anymore “ I was baffled. I opened the cuz at this point I just wanted to get out of there and this man has the audacity to try and flirt with me after acting like a total dickhead!! This was the most bizarre thing that a man has ever said to me. Do man this days really think this type of shit work on women????",
    "score": 1343,
    "url": "https://reddit.com/r/CustomerService/comments/1k1vrj7/insane_redpill_guy_at_autozone/",
    "created_at": "2025-04-18T03:49:26.000Z",
    "num_comments": 185
  },
  {
    "id": "reddit-1ifvlt7",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Thoughts?",
    "text": "The company wants baristas to write something on the cups/bags to make more of a “connection”. It’s unauthentic in nature to force them to write messages…I heard a barista left a “tip your baristas” message and I was shocked/embarrassed as a shift manager, convinced it wasn’t at the store I work at. \n\nHowever…suggesting the baristas are being greedy/whiny left me even more shocked. A lot of them are working here for a living right now, some are in school, some are parents. \n\n(Obviously it’s not on the customer to support these baristas financially. I also know these customers are spending on average $9.00 per order, some spending this every day). I guess what I’m getting at is that I’m more offended at the response than I am the initial message written. \n\nThoughts?",
    "score": 692,
    "url": "https://reddit.com/r/CustomerService/comments/1ifvlt7/thoughts/",
    "created_at": "2025-02-02T11:48:51.000Z",
    "num_comments": 170
  },
  {
    "id": "reddit-1hn7xoy",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "“I’m going to give you to my husband”",
    "text": "Does anyone else work in a call center environment and find it kind of funny when you call and speak to a woman and are giving her bad news, telling her what she doesn’t want to hear, etc and she just stops talking mid conversation and says “hold on I’m giving you to my husband” only for him to get on the line and talk violently to you in a threatening manner as if you’re going to cave and give him what he wants???\n\nYou can put your husband, your daddy, your grand pappy whoever on the line ma’am but whatever I’m telling you remains the same. If you need to get your husband on the line to raise his voice and talk over me (I’m a woman) that’s fine. You may tolerate it but I certainly will not. ",
    "score": 627,
    "url": "https://reddit.com/r/CustomerService/comments/1hn7xoy/im_going_to_give_you_to_my_husband/",
    "created_at": "2024-12-27T05:31:07.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1kx4hfg",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Customer tried everything she could to shake me today, but she failed.",
    "text": "She was mad about her premium. Even though it actually went down by about $15 a month. \n\nAnyway, she yelled at me, to the point she was hurting my ear and I had to turn my phone volume all the way down. But I remained stoic. I offered to quote some changes on her policy that would bring it down a little. She then wanted me to send her a copy of her insurance declarations so she could “shop around and compare rates.” I told her I’d be happy to send it. She then said “I want you to send it while I’m on the phone. I know you’re telling me you’ll send it, but I bet you won’t.” Not sure how she got that idea. Because I have nothing better to do than refuse to send people documents they asked for? I put her on hold while I sent the document. \n\nI got back on the phone with her and let her know it was sent. She continued yelling at me. She was talking in circles at this point because I sat there in complete silence letting her go off. She started doing *everything* she could to get a reaction out of me. Saying things like “oh I’m sure you get this all the time. I bet you have the same script memorized in your head on what to say.” I didn’t respond to that. (She sure seemed to enjoy making a lot of assumptions about me though.)\n\nIt was like this for another five or so minutes. She kept with the same threats, “Just so you know, I am going to be looking elsewhere!” As if I did something to her personally. I just kept responding calmly. And she continued *hating* it. I don’t know if her life is just *that* miserable or what. I offered what I could. It is what is.\n\nNeedless to say, I was proud of myself for not letting her rattle me. If this had happened a year ago, I’d have been a stressed out mess. ",
    "score": 604,
    "url": "https://reddit.com/r/CustomerService/comments/1kx4hfg/customer_tried_everything_she_could_to_shake_me/",
    "created_at": "2025-05-28T01:19:04.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1ok8q2c",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "I think there is a literacy crisis in America.",
    "text": "For context, I work doing customer service for a company similar to Hello Fresh, that services weekly meal-kits. \n\nI don't know what it is but there seems to be a going epidemic of people simply not... ***reading***. People will throw their credit cards at anything that looks shiny or interesting then call or email with the most rage-filled attitudes because they don't understand what they signed up for. To then get support for it, reminded of how to avoid \"X\" issue in the future, to then not bother to read it, to then reach back out about the same issue.\n\nBetter yet, there are people who get surveys from our interactions then respond to the surveys saying \"I never spoke to anyone at \"X\" company.\" Huh?! I just interacted with you an hour ago! This consequently turns into our agents receiving poor CSAT scores for problems that were solved, but the customer didn't bother to check their email for a follow up. Or customers who call in because \"they haven't received a response\", then we ask them to check their email, for them to go \"Oh... why'd that take so long then? I would've check my email earlier if I knew you responded\".... \n\nI could go on forever, deadlines that are always notified ahead of time, a bunch of support articles that are readily available incase they don't understand something, people fighting to **CHANGE** a company policy to fit their desires because they didn't bother to read them in the first place.\n\nThis probably isn't a new topic here but I just needed to vent. What are some crazy interactions you've had with people who don't read what they're signing up for?",
    "score": 566,
    "url": "https://reddit.com/r/CustomerService/comments/1ok8q2c/i_think_there_is_a_literacy_crisis_in_america/",
    "created_at": "2025-10-30T19:09:54.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1nm18mg",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Trailer Trash Barbie",
    "text": "I am very pissed at this given moment as its all very fresh but I need to lay it out so I dont lay HER out. \n\nAnyway, I work at a chicken restaurant/gas station. Our sales primarily come from those two things. \n\nIts 10 am when this starts, we have about 4 catering orders due at 10:30-11 am, and lo and behold, only 2 people are scheduled for the kitchen. Great. \n\nSo im doing my thing, breading, frying, draining as fast as I possibly can. All the while we're still getting to-go orders. \n\nThe lovely lady in question is ordering her food, Im talking to another customer as we're really behind and I needed to know what they wanted to replace their bone-in chicken with since there was gonna be about a 20 minute wait on it. While Im talking to customer A, trailer trash barbie interrupts and demands to know why the sale price isnt showing on her order ticket. I tell her Id be with her in a moment as Im helping someone else and she just. keeps. Interrupting. \n\nSo I finally turn to her after the 5th interruption, and tell her to ask my coworker manning the register, she quite literally scoffs and stomps over like a toddler who didnt get fruit snacks. \n\nI can see from the corner of my eye her question got answered, and all is well for the next like, 5 minutes. \n\nAs im packing up the first catering order she quite literally steps one foot into the kitchen and barks at me: \"When is this order gonna be done?\" while shoving her order ticket in my face. I tell her its gonna be another 10-15 minutes because the chicken is LITERALLY COOKING. She gets all pissy at that and then storms off again. 2 minutes later she comes back and does the same thing, one foot in kitchen, barking, order ticket in face. At this point I dont know what my face looks like but after nearly 10 years of working retail I cannot hold my facial expressions back anymore. I probably rolled my eyes or something but whatever my face said, pissed her the FUCK off!!!!! She started hootin and hollering about waiting so long for \"chicken of all things\" then she notices my manager in the back and literally SNAPPED her fingers and pointed down like my manager was a dog. That pissed my manager off so she told me that we're filling to-go orders at the order it was received, and not by attitude. Barbies order was the back of the queue. \n\nMy managers telling her its gonna be upwards of 10-15 mins bc the chickens cooking and that we'll get her order out asap (reader, we did everyone elses order first before hers, as stated above) and when we sent out the first order after talking to her and she saw it wasnt her order she started getting mad aggressive. At that point my manager told her she needed to leave and that we're refunding her money, and that she can leave. \n\nThis lady points her meaty finger at me and yells \"FUCK YOU!!!\" and thats when my manager had to like, get in between us bc this lady was charging at me like a badly bred pitbull. Cops were called, a scene was made. She left on her own accord after her money was refunded but not after spitting in the vestibule. \n\nLike seriously what the fuck is wrong with people these days, all over 8 pieces of chicken.???? Cmon now. \n",
    "score": 564,
    "url": "https://reddit.com/r/CustomerService/comments/1nm18mg/trailer_trash_barbie/",
    "created_at": "2025-09-20T15:32:22.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1lfio6w",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Society is doomed",
    "text": "Working in customer service has taught and shown me that the education level of the average adult is shockingly bad, and most of them have abysmal human interaction skills. Simple things like reading are an afterthought, basic social skills like situational awareness are nonexistent, and the entitlement is disgusting. Just because you're paying for something does not mean you can be rude and obnoxious. Sometimes I wonder how the majority of these people made it through life, and they're passing this behavior down to their children too we're fucked. ",
    "score": 543,
    "url": "https://reddit.com/r/CustomerService/comments/1lfio6w/society_is_doomed/",
    "created_at": "2025-06-19T18:46:40.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1obqwft",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Control your kids.",
    "text": "I work at a well known hardware store in the garden center. Today, a customer and 5 of her little goblins came in to get soil and t posts. She had one of the big, long carts and all 5 of her children were sitting on it at first. \n\nI'm cleaning up my area (taking out the trash, changing receipt paper, etc) when I look up and this lady's kids are climbing all over the soil area in front of me. Standing on the soil bag piles, talking loudly. Before I could even say anything to her, she rushes inside with her soil and goblins. \n\nShe came to check back out and those damn kids wouldn't move off the cart or out of my way to help me ring out the items. \n\nThis event gave me a couple of questions: \n\n1. Why are those kids not in school at 9am on a Monday? \n2. Who lets their children act like that publicly? I know if I were doing that as a child, my mom and dad would've spanked me all the way through the parking lot. *I'm not advocating for spanking by any means, I'm just saying that my parents would never allow me to act like that.* \n\nI truly don't think she's preparing those kids to be adults.",
    "score": 478,
    "url": "https://reddit.com/r/CustomerService/comments/1obqwft/control_your_kids/",
    "created_at": "2025-10-20T19:18:24.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1oa0qp3",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "You can’t leave with merchandise if you haven’t paid",
    "text": "Sorry I need to vent for a sec\n\n I had this customer come in grab some bags of ice and he just walked out I yelled out “you have to pay for that” he just ignored me he comes back and I tell him kindly “Hey sorry but you can’t walk out with items you have to pay first” he dismissed me and said “I will pay I just have to get more” I said ok and when he came back with another handful of bags he just walked out again to which I said again “Sir you can’t leave I have to count how many you took and you have to pay” again he ignores me and leaves. I call my manager so she can listen, he comes back and I tell him again “Sir like I said you can’t leave without paying and I have to count how many you took and he says “ yeah yeah I took 12 bags and I’m sorry”\n\nMind you it’s a liquor store and we have had problems with people stealing our bottles and they always blame us for shit disappearing, it’s only one cashier and one stocker for each shift and the cameras don’t work and somehow even though the manager listened to my interaction with the customer I was still blamed for not yelling out for the stocker to come in and help me? Like what was he going to do if the asshole kept just walking out with the stuff? \n\nI’m so tired of management and the owners lecturing us for shit like this we can’t stop them if they walk out with shit but somehow we are still at fault make it make sense!!!!!",
    "score": 452,
    "url": "https://reddit.com/r/CustomerService/comments/1oa0qp3/you_cant_leave_with_merchandise_if_you_havent_paid/",
    "created_at": "2025-10-18T16:47:26.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1isfxen",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Screamed at by medical front desk",
    "text": "Last week, I went in for my annual checkup.  I haven't visited this medical office for years.  My past experience in this office was always a positive one.  This time, things have changed drastically.  When I drove in, I noticed the parking lot was mostly empty.  Hmm, strange.  When I came in the office, the waiting room was mostly empty except for 1 guy who apparently had been waiting for his appointment before mine and was not called.  I watched him look at his phone, get up and told the front desk that his appointment was 1:20 (I arrived at 1:30).  He had been waiting for awhile.  Then the front desk tells him that his appointment was next week, not today.  The look of frustration on his face was obvious and he let without a word.  Well, what a way to start my appointment.  I checked in, the lady in front of me didn't say hi, no eye contact, she's glanced at me and nothing more.  I had to tell her why I'm there to get things started.  Ok... Fine, whatever.\n\nThings have changed in the office where now you have to pay first before you get seen.  In the past, you would get seen first then pay on your way out.  I'm fine with that. However, I didn't know where to go after I paid.  The cashier didn't say hi or thank you after I paid, only told me to go back out in the waiting room for instructions.  Then she turned away, as if waiting for me to go away.  Ok... Fine, I went back out to the waiting room.  There's a doorbell by the door leading up to the hallway where I would see the doctor.  I wasn't sure if I was supposed to ring the doorbell, so I looked to the front desk lady (Same one who didn't greet me) and asked her, do I ring the doorbell?  Where do I go from here?  A new patient walked into the office and was dropping something off to this lady.  I take accountability for the first interruption and I waited for them to finish talking.  After the patient leaves, and the front desk lady got up to go somewhere, again I asked, do I press the doorbell or where do I go.\n\nShe screamed at me, Wait!!!!\n\nEveryone at the front desk stopped and stared at us.  I yelled back at her stating that I was only asking a question.  She stared at me, eyes wide open, for a few seconds, and leaves to buzz me in.  The doctor and medical assistant were nice.  However, I felt like I was walking into the DMV, where employees seem like they don't want to be there and don't care how they treat people.\n\nI did speak with the supervisor on the phone about this today.  She wanted to know what happened so I told her.  She apologized profusely, she knows who I was referring to, and will speak to upper management about this as well as addressing mannerism in the workplace with the front desk staff.  It wasn't just 1 person... From the time I made the appointment, to checking in, to paying, to asking questions and checking out, the entire experience left a sour taste in my mouth.  No hi, no thank you, no you're welcome.  I don't care for overtly niceness but this is ridiculous.  Patients come in because they have to, not out of fun.  Many are sick, or in pain, or have been diagnosed with a serious disease. Many are also elderly that comes to this clinic.  A little bit of sympathy and patience go a long way.  She could've said, \"Excuse me I'll be right with you\" or \"One moment please\".  Nothing.  She ignored me until she decided to lash out at me for not reading her mind on what is going on.  I used to be in retail, banking and restaurant work so I get that customers can be nasty as hell.  I had things thrown at me, cussed at, racial slurs, stalked... So I get it.  But never did I ever lash out and there are mature ways on handling stressful situations.  I'll always be nice to those who work in the service industry but don't mistake my laidback attitude as a sign that I'm an emotional punching bag because your day isn't doing too great.  Communicate what you need, and I'm one of those customers or patients who will listen and give you grace.  Let's do that for each other.  Life is hard enough as it is.\n\nRant over.",
    "score": 431,
    "url": "https://reddit.com/r/CustomerService/comments/1isfxen/screamed_at_by_medical_front_desk/",
    "created_at": "2025-02-18T15:57:13.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1ik2zxn",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "My 35 years of customer service is written in my face, apparently.",
    "text": "I was at Walmart yesterday getting cat litter and a woman came up to me and asked me if I knew where the \"pooph\" was. I told her I didn't know what that was. \"It's cleaner for pet odors\" she said, showing me an empty bottle. \"No, haven't seen it\" I said. She looked at me, dug her heels in and made a little exhale, like customers do when they're frustrated and they expect you to fix whatever the problem is for them, even when their problem is out of the scope of your job, it's a needyness, she was expecting me to help her find it. Being a naturally helpful human I said \"It's probably either somewhere around here somewhere or with cleaning supplies.\" She didn't move, just looked at me like I should start looking for it with her. Only I don't work at Walmart, nor was I wearing a bright blue vest. I said \"Go on Walmarts website, look up the item and it will show you what aisle it's on\" and she continued to stare at me some more and made that sound again! I studied her for a second, there was nothing to indicate that she was a special needs adult... And then, thank God, I saw a Walmart employee and said \"hey, there's a guy who works here, go ask him\" and walked away. I could hear her behind me \"oh I already asked him, he doesn't know anything...\" But I kept going and didn't look back. ",
    "score": 430,
    "url": "https://reddit.com/r/CustomerService/comments/1ik2zxn/my_35_years_of_customer_service_is_written_in_my/",
    "created_at": "2025-02-07T19:11:49.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1jumfvz",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "believe your coworkers when they warn you about THAT person",
    "text": "just getting on here to rant, im still shaking from the phone call that i took with this person.\n\nfor context, i do customer service for our customers, and customer service/help desk for our sales team. when i first started working here, my trainer told me that we have amazing customers who never want to start shit (which is absolutely true 99% of the time, i LOVE my customers) BUT to look out for just one of our sales reps. i laughed it off, but then even my MANAGER warned me about her in one of our 1-1s, saying that if this rep ever said something out of line, to report it immediately as they have had to do this many many times throughout the years this rep has worked for the company. okay so — manager tells me and trainer tells me, maybe they’re just preparing me for the worst and it won’t be that bad?\n\nwell, after being at the company for 6 months now, i finally just took my first phone call with this rep. out the gate, she’s giving me attitude, and i didn’t even recognize her name until she gets mad at me for not giving her the correct information, when she had given me the wrong information to find what she needed. and then it clicked — ohhhhh.. the infamous so and so, and my heart sank. \n\nat first she was just condescending, whenever i tried to explain something that she called in for answers for, she would then correct me, and tell me that i was wrong (which i wasn’t, but im not about to sit here and argue for an hour). she then tells me she wants to move on to the next thing she needed, and to decided to throw in there “maybe this will be simple enough for you to understand”\n\nthe rest of the call, i used my monotone robot voice and gave her one word answers when i could. obviously this probably didn’t bother her, but it made me feel better.\n\nanyways, happy tuesday!",
    "score": 387,
    "url": "https://reddit.com/r/CustomerService/comments/1jumfvz/believe_your_coworkers_when_they_warn_you_about/",
    "created_at": "2025-04-08T19:36:43.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1l51dmw",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Why is it that women between 55 and 70 are so rude?",
    "text": "Hi everyone! \nGenuine question here and I want your genuine answers. I know we have all had our experiences with Karen’s, but I want to know why we all think it is that women of this age are just so freaking entitled?!?!?\nFor context I had a call from a customer today ( 63 year old Lynda) I answered the phone as normal first thing she says is “I am cancelling  my policy immediately!” I say ok no problem let’s gets your policy up.  Proceed to ask the dpa question (our dpa policy is to ask four questions). She answered one wrong so I proceeded to ask another, as this is what I’ve been told to do. She proceeds to shout down the phone “JESUS HOW MANY QUESTIONS ARE YOU GOING TO ASK FFS”.\nI’m pleased to say I kept my cool and just said sorry I’m only doing the data protection act as instructed. She sighs and says whatever. \nI immediately cancelled the policy, didn’t offer any discount or any alternatives. \nI just can’t understand the need to be so rude? Obviously I don’t decide the renewal price and I’m just the girl answering the call?!?!? \nAnyways rant over! \nBut would like to hear your theory’s as to why people of this age group are so freaking rude and entitled. \nLots of love ❤️ ",
    "score": 342,
    "url": "https://reddit.com/r/CustomerService/comments/1l51dmw/why_is_it_that_women_between_55_and_70_are_so_rude/",
    "created_at": "2025-06-06T19:36:19.000Z",
    "num_comments": 610
  },
  {
    "id": "reddit-1i95u5n",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Rich Customers Beg Worse than the Homeless",
    "text": "Vent:\n\nAs per NDA I'm changing the name of certain things. Sorry if it's unclear. \n\nCustomer wants a $800 product that includes extreme travel benefits. (Usuaully only beneficial to those who travel A LOT) \n\nAsks me to give it for free. \n\nI can't give the item for free.\n\nThey proceed to bktch me out because they travel over 30 times every couple months and need it to buy fuel for their personal jets. Asking for a manager \n\nManager says, can't give this for free. Company policy. \n\nThey continue to belittle flaunting their wealth all over the place. They STILL end up getting the product then has the balls to ask if they get it for their wife, could they get that one for free instead?\n\n\n\nI'm tired. I deal with very stupid people, very rich/pompous people, or both. I only make a little over minimum wage. Its exhausting. Im only sticking with this to avoid a gap in my resume while I finish college. Anyone deal with the same kind of stuff? This happens daily. And trust me I'm incredibly friendly and nice about it, I know it doesn't appear so in this post, but that's why it's a vent post. ",
    "score": 318,
    "url": "https://reddit.com/r/CustomerService/comments/1i95u5n/rich_customers_beg_worse_than_the_homeless/",
    "created_at": "2025-01-24T20:59:00.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1lsfmpa",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Fitness Center isn't Preschool",
    "text": "First off, I don't work at the preschool. I work at a fitness center located across from the preschool in question.  Second, it's a holiday weekend. A lot of places aren't open, especially education centers and government offices. \n\nSo I had this lady call in during my shift this morning demanding to register her child for preschool. I explained that \"sorry, you have the wrong number. Let me get you the correct one.\"I literally answered the phone with \"So and So Fitness. How may I help you? Looking up the right number was way more than I needed to do. It's not my job to get you the number for a random business but I'm trying to be nice. Lady starts crashing out on me, saying \"do your fucking job. You're being so rude. I'm just trying to register my nearly 3 year old. This is ridiculous. Can't reach nobody all week.\"  In my head I'm thinking yeah cause you don't know how to find the correct phone number and no one wants your business with you acting like that. My manager happens to walk by as this lady is going off and takes the phone. He also explains that she has the wrong number, gives her the correct one, and explains that they re-opened on Monday. Apparently it's fine cause he's a manager but he told me the lady said I was rude. I'm just shaking my head wondering if I should have gotten her info and made a CPS report.",
    "score": 97,
    "url": "https://reddit.com/r/CustomerService/comments/1lsfmpa/fitness_center_isnt_preschool/",
    "created_at": "2025-07-05T17:47:06.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1klfoxg",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Wish people used their brains",
    "text": "I work in a call center for a bank. Since I can't ask anyone for their ID (duh), we have questions that are pulled from public records. It's literally 3 questions that generate. \nI have had people get so mad because \"those questions have nothing to do with my account, why are you asking me these questions\"\nAnd then I have to explain we can't ask any account questions because those can be stolen from the mail or off your statement. And no, you providing your social security number is not a form of verification. \nI had someone very confidently say \"oh no we don't need to do the verification steps, I just wanna know what my loan balance is\"\nLike sir, can you imagine the issues we would get if anyone could call in and get any loan info they wanted? Like, come on. Think for 2 seconds about that. \nAnd then when people call and say \"I'm not on my wife's account, but I just wanna transfer x amount of money out of her account to mine\" \nExcuse the fuck outta me?????\nNo. You can't just transfer money out of an account you aren't on. \nAnd I would be more understanding if people we just stupid. But no, they're stupid and then get offended, or pissed off. \nMy 3rd day out of training I had a man call in wanting to ensure we weren't selling his info to 3rd parties (?) And I told him I could check his account to see if anything was listed (as a standard, we don't share info. And who would we even sell it to??) And he got so mad at me for going through very basic security questions and said \"it shouldn't be this hard to check my own account\" \nCLEARY YOU DONT WANT ANYONE CHECKING YOUR ACCOUNT. I NEED TO MAKE SURE YOU ARE WHO YOU SAY YOU ARE. \nAnd he ended up failing the verification, cussed me out, and hung up. \nAnd I wish I could start telling people who get mad \"imagine if it was any easier to get your account info\" there would be millions of dollars lost to fraud so so quickly, not to mention identity theft. But no. No one uses their freaking brains.",
    "score": 51,
    "url": "https://reddit.com/r/CustomerService/comments/1klfoxg/wish_people_used_their_brains/",
    "created_at": "2025-05-13T07:09:52.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1ks9vpa",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Why is no one nice to customer service workers?",
    "text": "I know this is a standard question and I think a lot of things dictate a persons kindness. Especially when referring to customer service. I worked for over three years in a very high call volume high stressed call center for a credit union. (Technically I’m still employed, but I had to take a medical leave of absence.) During my my time on the phone I was working from home and my family could hear people screaming at me through my headset and I was getting 65-100 calls a day and as the years went on I would hear my family talk to customer service employees and when they started to get upset they would take a deep breath and say “I know it’s not you and you are just doing your job. I’m not mad at you. I’m mad at the policy/company/bank” I pay for Walmart + frankly because I have terrible agoraphobia and hate grocery shopping and from time to time stuff is missing from my order so I have to chat with a representative to get a refund. Every time I chat with a rep their final message to me is always that I’m the nicest person they have ever talked to and that I’m the most understanding customer they have ever dealt with. This always breaks my heart a little because I know random people that are just trying to survive are getting emotionally and verbally abused and no one cares. This isn’t really meant to be a question more of an acknowledgment to all the workers that take abuse everyday and never get justice for it. I know we need customer service as of right now to help with human error or computer error but wishing people were nice to each other is an understatement. ",
    "score": 35,
    "url": "https://reddit.com/r/CustomerService/comments/1ks9vpa/why_is_no_one_nice_to_customer_service_workers/",
    "created_at": "2025-05-21T21:36:28.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1khr240",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "The customer service industry is a nightmare.",
    "text": "I work in a customer service job for one of the biggest loan companies in my country. And once I'm able to leave this job I am never going back to a customer service job.\n\nI work as a call center agent (I also occasionally do emails) as one of the bilingual consultants. I was specifically hired because of that. And since taking this job I've realised 3 things.\n\n1. Clients will absolutely treat you like shit.\n- I have never had worse interactions than those I've had whole working at a customer service job. Clients will swear, scream, interrupt, ask you for personal information about yourself and even making inappropriate comments. And I am quite honestly fed up with this.\n-Having to sit and speak pretty while they are going off at you is simply the most infuriating thing I have ever experienced and I hope that once I walk out of this department I will never. Ever. Ever. Have to do another customer service job again.\n\n2. Some colleagues will absolutely take any opportunity to make their work yours. \n-Weaponised incompetence, taking advantage of new employees, wrongfully sending work to you instead of the correct department you name it.\n-No one wants to do their job and some will refuse to do it even if you simply cannot assist the client as that is not what you deal with. Even if it's something that's not done in your department.\n-So many times I've had other consultants send work to me when I don't have access to the systems required, or I don't have the relevant information, or it's just a process I am not allowed to do due to my position. Because that's not my department. And I am sick of it.\n\n3. Just how many people actually do not have a drop of comprehension skills.\n- I don't know if they are acting dumb in hopes that we just concede and give them what they want or if they really just are that fkn stupid. \n- They waste both my time and theirs to ask me stupid questions about the most self explanitory things. (I won't be getting into specifics as I'd rather not let this get out to my employers)\n- And what's worse is the OTHER CONSULTANTS not being able to do the simplest of task or being able to perform the simplest of processes. They are unable to do things that was covered the FIRST WEEK OF MY TRAINING. And what grinds my gears is the people who've been there much longer than I have not being able to do these things as well.\n\nHonestly this has been the most draining thing I've done in my life. The only reason I haven't quit yet is because ai need the money. And I have to wait a certain period before I move to another department. \n\nI seriously can't wait to leave.",
    "score": 27,
    "url": "https://reddit.com/r/CustomerService/comments/1khr240/the_customer_service_industry_is_a_nightmare/",
    "created_at": "2025-05-08T14:10:04.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1kaoau8",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Hospitality Burnout",
    "text": "As someone who has worked in the hospitality and customer service industry for almost 20 years, I have to vent.\n\nGone are the days when grace was given to people who worked hard and could barely put enough food on the table for their families. After all, we are only human. \n\nGone are the days when \"to serve\" meant something, and even on a tough day, you could go home knowing you helped make someone's day better, sometimes at your own expense.\n\nWe used to pride ourselves on the customer is always right... Now, the customer expects to be right and holds an unbearably gross sense of entitlement to that antiquated adage. \n\nWe are all burned out, talked down to, yelled at, sexually harassed (I won't even go into all those cringe-worthy moments in my career), and for what?!?\n\nThis is why many of us have left the industry altogether and are replaced by the children of \"I demand a refund\" parents who were the bane of our existence in the early 00s and AI Chatbots.\n\nSo, if you are wondering what ever happened to customer service, well, it died, and its soul is living happily in Remote Work heaven.\n\n\nObviously, this isn't everyone's perspective, but I bet that a lot of people who spend time in the service industry feel this way. I just had to say it. Of course, there are amazing people who we are so grateful for their kindness, but unfortunately, the rudeness of others has taken over more than people realize. We, as a people, are just meaner. And I'm sure I'm going to get a lot of rude comments on this thread, but at this point, nothing you can say hasn't already been told to my face, and maybe, just maybe, you might consider yourself the reason why kindness in customer service is practically dead. \n\n\n2006-09 Brand Name Movie Theater\n2009-2020 Brand Name Hotel Chain in various cities.\n2020-2025 Vacation Rental Business\n2025- Ghost\n\nTL;Dr customer service is dead, we are all too mean to each other and need to do better as customers and service employees",
    "score": 18,
    "url": "https://reddit.com/r/CustomerService/comments/1kaoau8/hospitality_burnout/",
    "created_at": "2025-04-29T13:44:53.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1i4geh0",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Just thinking … we all talk / vent  about the nasty customers and work environment:::  what positive do you have? ",
    "text": "\nAn example for myself. I am very fortunate to have a wonderful caring supervisor. That has my back on everything.  I’ve been with this company for almost 3 years. And I’ve had a very positive experience with this call center.\nFor the most part and there are a few that are complete jerks. But it’s very far and few between. Also, there are some seniors that just don’t understand how logistics work and expecting something in three days when there’s a snowstorm and there’s no way for things to move around. Those are the exceptions.  No as far as a positive I have these wonderful people that have left notes to my supervisor that they wouldn’t want to call anybody but me, to help them. \n\nMy friends let’s talk about a positive experience your call center has for you ",
    "score": 18,
    "url": "https://reddit.com/r/CustomerService/comments/1i4geh0/just_thinking_we_all_talk_vent_about_the_nasty/",
    "created_at": "2025-01-18T20:20:08.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1o1cxip",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Trainer Doesn’t Want to Use My First Name",
    "text": "\nThis is just a vent, but I won’t mind some good opinions. \n\nI started a new call center job yesterday. Our class has around 30 people. Our trainer has made an effort to learn to pronounce everyone’s first name except for mine. Every time she calls my name, she mispronounces it, and I correct it. After she did it for the second time today, she said, “Well, I’m just going to call you by your last name. It’s easier.”\n\nThis isn’t right to me. Other people have more difficult names than I do. I was taught by my grandma that learning how to pronounce someone’s name correctly is a sign of respect, and I just don’t feel respected. I’m also a full time student, and I’ve said that school comes first; and if this interferes with school, the job goes. \n\nI’m going to see if I can express my frustration with the head of training and see if she can do anything, even swap me to another class. ",
    "score": 17,
    "url": "https://reddit.com/r/CustomerService/comments/1o1cxip/trainer_doesnt_want_to_use_my_first_name/",
    "created_at": "2025-10-08T15:01:05.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1kuplwh",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "If customer service was a game...",
    "text": "I work as a customer service rep at a strict gov call center (my first job, nearly 3 months so far), and lately I’ve been thinking… if my job were a video game, it would be like playing Soulsborne games, but you’re under-leveled in a high level area, with low level gear, and the NPCs are constantly yelling at you for not saving them/doing their quests fast enough.\n\nYou're not allowed to dodge or block, there's no pause button, and the boss fights (angry customers) come at you randomly, with no checkpoints or warning. You just hope you survive long enough to get through the day. Oh and the game is buggy as hell and sometimes crashes mid-battle, but you're still somehow expected to win.\n\nThere’s barely any loot or XP, basically no sense of reward, just a constant grind to not fail or get penalized for something you couldn’t even control.\n\nSo yeah, as a gamer, this is how I would describe this job in terms of difficulty for me personally.",
    "score": 17,
    "url": "https://reddit.com/r/CustomerService/comments/1kuplwh/if_customer_service_was_a_game/",
    "created_at": "2025-05-25T00:11:09.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1l86ovx",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Call center job has made me hate people, if you can stay away",
    "text": " I work in a call center, I’ve had people threatening to call the New York Times. Entitled people. Rude people who will just scream at you because you’re just a call center, take their anger out on you and say the most atrocious things. People being snarky. People cursing you out. People who will let their anger out on you and tell you so many disgusting things and then ending it with “it’s not on you” and think it makes it okay after they say that. I actually just had a call and this woman started cursing me out, she had called the wrong department, refused to be connected to the right department. Asking me why am I even answering calls, saying fuck this and fuck that, fuck fuck fucking is all I heard, literally screaming at me, she then wanted to be connected to a supervisor, as I was trying to get a hold of a supervisor, this woman says, “my arm is hurting, do you understand that??!!!” As I was answering she said yeah you don’t which is why im going to hang up on your fucking ass” and hangs up. Yeah people are horrible. Customer service has made me realize how many fucked up people that were clearly not raised right are in this world.\n\nAnd that’s just off today. I am so drained by the end of the day that I don’t even want to talk to my family.\n\nIt’s made me want to not even be alive, it’s made me wish I got into a car accident. It’s made me sad to even wake up in the morning. 10/10 don’t recommend. If you can, stay away from customer service/call centers.",
    "score": 17,
    "url": "https://reddit.com/r/CustomerService/comments/1l86ovx/call_center_job_has_made_me_hate_people_if_you/",
    "created_at": "2025-06-10T18:41:14.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1hq3lj6",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "People wake up with the goal to drag others down with them.",
    "text": "\nWorking in any sort of customer service job, we get this sense on a weekly basis.  Some of us get it on the daily, even.  To a degree I understand peoples’ frustration.  Working at a call center for a utility company won’t get you a ton of friends.  Customers will call to complain about the rise or change in their bills and blame it on the company in any way that they can imagine.  The company is greedy, a monopoly and we don’t care about the customers, all that jazz.  \n\nThe longer you deal with people the thicker skin you develop.  Every once in a while there’s people that still make a point to be as rude as they can.  No matter how long of time is spent going over all options you have or can think of, none of that matters.  They’ll still cuss at you, call you bad names, blame you personally if they or their [random family member they call about] dies, make threats of harm upon you or themselves, and more.  \n\n  On one hand you can’t totally blame people for doing this.  You know and you can see that they’ve had issues for months, if not years and they’ve been at the end of their rope for so long that it gets to them.  On the other hand, you just want to hang up on that person as soon as you connect due to you know it’ll devolve into a 30 minute argument that leads to nowhere besides shouting, name calling and guilt tripping.  An entire self serving issue of spreading the bitterness.  ",
    "score": 16,
    "url": "https://reddit.com/r/CustomerService/comments/1hq3lj6/people_wake_up_with_the_goal_to_drag_others_down/",
    "created_at": "2024-12-31T01:43:28.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1jp390n",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Hate it with a passion",
    "text": "I am repulsed by customer service. Five years is too long, I hate my job with an absolute PASSION. It’s the people. I hate the people with an absolute passion.\n\nIt’s the being entitled, rude, nasty, unintelligent, aggravating customers that are SO hard to deal with when you are dealing with REAL LIFE SHIT or when you can’t respond to these assholes they way you want to because let’s be real, you need your job. \n\nBut I’m to a point where I can’t let it go at the end of my work day. It’s ruining my life, my mood sucks all day- before and after. My mental is FUCKED all day. I can’t even enjoy my days off because I’m too busy being crippled by the dread of having to go back to work the next day. \n\nMy job pays well, and it’s from home but that’s about it. No benefits. And everywhere else is not paying enough or asking too much of you. Like I’m being stressed out in my own home which I’ve done very well to ensure that my home is my peace. \n\nNo, I am not a disgruntled employee either. I am a remarkable asset to this and any company I’ve worked for. I have been promoted at this company and experienced things from another side of the fence, and even that was just…a story for another time lol. If you’ve worked in a call center YOU ALREADY KNOW! \n\n\nHOW DO I GET OUT OF CUSTOMER SERVICE!!! If you’ve made it out, please share HOW?! Where??all the jobs I search that are decent pay come up to be some form of customer service. ",
    "score": 14,
    "url": "https://reddit.com/r/CustomerService/comments/1jp390n/hate_it_with_a_passion/",
    "created_at": "2025-04-01T18:41:08.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1oco4y6",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Call center Rep venting part 1,000,000",
    "text": "Dear customers, We do thank you for your urgency to talk to us.  However, saying “HELLO!  HELLO!”  Whenever there’s a lull in the conversation doesn’t snap us back into work faster as if we suddenly fell into eternal slumber mid conversation.\n\n - Being irate with me because your statement you received in the mail showed up late does not make me want to jump in our Time Machine to talk to the USPS for you.  We can only use that one a month.  So using it for what could be resolved with an email is not as urgent as other things we need to break the laws of reality for.  How about creating and regularly checking an email address? That would be helpful.  My 80 year old grandma can do it, I have faith in you that you can too.  \n\n - Also, if you’re sent a statement that includes a due date on it, nowhere is it written that you must pay this only on this date.  You’re allowed to pay something early if you must.  If the due date is on the 25th of the month but you only get paid on the 10th of the month, guess what date comes before the 25th.  You have the option to pay a bill before the 25th if you have to.  And if you don’t get the bill or statement until, say, the 20th for example, refer to the prior point and create an email address and make a point to check it regularly.  And then giving us that email to send those statements that way.\n\nSimple solutions don’t always require extreme effort.\n\n",
    "score": 14,
    "url": "https://reddit.com/r/CustomerService/comments/1oco4y6/call_center_rep_venting_part_1000000/",
    "created_at": "2025-10-21T20:30:44.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1ppbfo2",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Handling demanding customers",
    "text": "This is self explanatory and how do you tactfully handle it:\n\nMe: Would you like soup or salad?\nCustomer: French fries.\n\nWhy would you ask for an item that I didn't offer? When I'm in a restaurant, I ask IF I can make a substitution. People act like the world owes them something and them demand things instead of asking for them. No one has manners anymore. How would you handle this from a demanding customer in a tactful way?\n****I work in a call center taking orders for the restaurant*****",
    "score": 13,
    "url": "https://reddit.com/r/CustomerService/comments/1ppbfo2/handling_demanding_customers/",
    "created_at": "2025-12-17T23:22:34.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1pkmyvv",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Demanding customer complains about replacement vehicle equipment",
    "text": "Hello Reddit community,\n\ntoday I'd like to share my first story from a car dealership where I used to work.\n\n\nFor many years, I was a service advisor at a three-brand dealership. We had two service advisors (including myself) and a service assistant who handed out loaner cars and helped a bit with scheduling.\n\n\nOne day in the middle of winter, a customer walked in without an appointment and complained that the center screen, which also controls the heating, wasn't working (yes, a complete design flaw, especially since the manufacturer wasn't exactly known for its reliable onboard electronics).\n\n\nThe regular appointment lead time would have been about three to four weeks, but it was freezing cold outside, the heating wasn't working—what could we do?\n\nSo, dear customer, leave your car there; we'll squeeze it in somehow and get back to you when everything was working again. (Luckily, the car was still under manufacturer's warranty.)\nOf course, nobody can be without their car for more than an hour these days, so he needed a replacement vehicle for that time.\n\n\nRemember, he showed up without an appointment, without even calling ahead, and desperately needed a car.\n\nThe service assistant actually had a vehicle available and was able to reschedule the next appointments so the customer could have it for a few days.\n\nUnfortunately, this vehicle was a different brand and didn't have the same features as his car (management's requirement for courtesy cars was basically just that the car had to run; features were irrelevant).\n\nSo the customer got the replacement car, drove off, and we thought, \"Cool, all good.\"\n\n\nNo, we wouldn't be here if that were all there was to it.\n\n\nA day later, he shows up and starts yelling at the colleagues about what a piece of junk we'd given him, that the car is the absolute worst, yeah yeah...\n\nHe yells for about 10 minutes until he finally calms down enough for us to figure out what's going on...\n\n--&gt;The loaner car didn't have a heated windshield (to clarify, he didn't mean the normal ventilation system people use to clear condensation from the windshield in winter, but an electrically heated windshield with very fine wires embedded in the glass).\n\nA little part of me died that day. Today, my former colleagues and I, with whom I'm still in contact, can laugh about it; it even became a running joke. But seriously... You show up without an appointment, we bend over backwards to help you, and you complain about the lack of high-end features? Are you kidding me?!\nI hope you enjoyed the story :)",
    "score": 11,
    "url": "https://reddit.com/r/CustomerService/comments/1pkmyvv/demanding_customer_complains_about_replacement/",
    "created_at": "2025-12-12T08:37:17.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1nfcvju",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "A conversation with a Deaf customer.",
    "text": "I have nothing against deaf people. And I do understand there is a language barrier between us. But this customer was trying to get approved for credit financing and this is how it played out:\n\n\nMe: I cannot approve the application unless you have the total you make as a household listed \n\nC: but I have income why do I need to list that? So you won’t process my application because I don’t have enough!?\n\nMe: It’s not that you won’t get approved possibly but you have to prove the income in order for it to process\n\nC: I don’t pay rent\n\nMe: I understand, but since you listed on the application that you “live with others” and because the application is income based, it has to verify what you and the household make total\n\nC: Bullshit! This is discrimination!\n\nMe: *In annoyed shock* I am not trying to discriminate at all I am trying to explain how our applications work so I can get you approved.\n\nBut like I was saying, The application is income based. What that means is household income is how much everyone in your home makes as a whole, including your income.\n\nC: They don’t tell me that information online!\n\nMe: Yes I do understand there was some misunderstanding, but The lenders cannot approve the application because there is missing information for the household income. \n\nC: That’s not the issue! There is no missing information!\n\nMe:I’m just trying to explain the process, the system will not let me even process your application due to missing information.\n\nC: This is what they told me online, *shows me a screenshot of an online chat form* all they said I needed was an ID and bank. \n\nMe: Yes I see that, i apologize that they did not explain this process. But to get approved the 3rd party lenders have to run an income check, therefore they need rent/mortgage amount and household income. This is to verify that you can pay it back.\n\nC: But I don’t pay any rent\n\nMe: Correct you do not, but since you listed “live with others” it has to verify the entire household.\n\nC: Then this is false advertising\n\nMe: Again I apologize they didn’t explain this.\n\nC: Then this is false advertising *shows me the same chat form*\n\nMe: The messages on the website come from our corporate call center I have no control over what they may have told you\n\nC: I’m calling BBB! I want to contact your supervisor!•\n\nC:*takes card and leaves*•",
    "score": 10,
    "url": "https://reddit.com/r/CustomerService/comments/1nfcvju/a_conversation_with_a_deaf_customer/",
    "created_at": "2025-09-12T19:47:20.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1ow5aao",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Language Selections Meaningless?",
    "text": "I've been working in call centers for the better part of two decades, and do you know what's the worst? It's not customers yelling, it's not high call volume, it's not bad IVRs, it's not confusing policies, it's not inexplicable price increases. No. It's when you get a call from a customer who explicitly selected another language. I'm sure lots of people have experienced this. My fellow Canadians, have any of you ever appuyer sur la 9 pour Francais only to get a baffled Anglo? Americans, have you ever gotten an English-speaking agent when you clearly chose Spanish? Guess what: WE HATE IT TOO! The queues exist, but there are never enough agents to cover the necessary volume for the language in question, so what do they do? Simple, they ignore your request. They direct you to another agent because they figure you'd rather have your preferences ignored than wait a bit longer. It's infuriating.",
    "score": 9,
    "url": "https://reddit.com/r/CustomerService/comments/1ow5aao/language_selections_meaningless/",
    "created_at": "2025-11-13T16:16:45.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1i24g4n",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "CS at a university - holy hell",
    "text": "I've worked at a university for seven years in various roles, all student and faculty facing but not necessarily \"customer service.\" After enduring six months of mistreatment by my supervisor at my last job (which was academic advising, my dream job) and being exhausted by needy privileged students, I wanted a role that had little academic-based interaction.\n\nI got one in my university's service center and god it is the WORST DECISION I've ever made. For some reason I didn't think it would be like a traditional call center, but it is. I thought the work would be different/better, but it's not. It's just that the customers are different. They're still rude, mad, selfish, and especially lazy. I'm not cut out for this, I hate talking to people on the phone, and I was led to believe it was largely a ticket system. And I was not made aware of the fact that the agents are essentially middlemen -- we have no access to the higher systems or info so whenever we can't answer a question that's just simple policy we literally have to slack that area's people and wait for them to respond. None of them will take a transferred call. It's maddening!!\n\nWanting to job hop again has me feeling bad. I'm fully remote and making the most money I ever had, but I can't deal with these customers. It's hard to believe that my fellow employees are so damn stupid. ",
    "score": 6,
    "url": "https://reddit.com/r/CustomerService/comments/1i24g4n/cs_at_a_university_holy_hell/",
    "created_at": "2025-01-15T18:42:52.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1kx0cyp",
    "subreddit": "CustomerService",
    "soc_codes": [
      "43-4051"
    ],
    "title": "Quirky and strange things customers have said over the years",
    "text": "Working in a call center, or customer service in general, customers tend to be in many different moods and mindsets when they want something resolved.   Thus things develop in the call that make people say rather strange things that make less sense than what we’re being accused of.   Some things that are just void of any logic or possibly even illegal.  Things people have said to me during a call include but not limited to:\n\n- I want to bite you.\n\n- That N***er is going places [is weird enough at t\this day and age on top of the fact that I’m \tCaucasian]\n\n - How dare you schedule my power to be off on a \tFootball Saturday?!?\n\n- It’s illegal for you to ask me for my [piece of \tpersonal information that was already given by \tthat person since we have it on record]\n\n- Is there any way for you to NOT inform the other \tperson on the account of the fact that we are \tpast due right now?\n\n-    My power’s been out for an hour and I haven’t seen one vehicle in the area to get it back on.  \n“My apologies, do you see anything that’s causing your power to be out?  Like a power line that’s down, a tree fell over, power pole leaning?”\n\nNo!  I don’t see anything like that at all.\n\n\n- I haven’t received a bill yet over the last couple months.  Why is that?\n(The bills are mailed to them.  I offer paperless billing to avoid that from happening again)\nNo!  I just want them to arrive on time to my house!\n\n\nWhat are some random off the wall things you’ve had people say to you while working with our fine customers?",
    "score": 5,
    "url": "https://reddit.com/r/CustomerService/comments/1kx0cyp/quirky_and_strange_things_customers_have_said/",
    "created_at": "2025-05-27T22:06:57.000Z",
    "num_comments": 5
  }
]