[
  {
    "id": "reddit-1o27har",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Don’t become a dental hygienist. Don’t go into this field. These offices are worse than high school.",
    "text": "I just quit my job. 3rd office in 1 year. The #1 toxic thing about being a hygienist is the drama these offices have. It’s ridiculous and I’ve experienced these same scenarios at multiple offices. I’ve never had these problems outside of the dental field. \n\nIf you want to mind your own business and stay outta whatever bullshit the office is plotting on some poor girl who just got hired- they will hate you and start talking shit about you too for not participating. Team player my ass. \n\nWhere do I really start? Jealous no-life office managers who are too lazy and dumb to actually get our degree, but they want to micromanage us like they actually even have a clue as to what we do. Egomaniac doctors that are pissed they have to replace scalers from the 90s and pay us to do a job PROPERLY. Bitchy dental receptionists that want YOU to call &amp; confirm the patients because they’re too busy scrolling thru social media. \n\nGod forbid I get done with a patient 10 mins early and want to change my tampon and take a sip of water. And when I do- all of these “busy” dental assistants are going past my room peaking in to make sure I do it in 1 minute tops otherwise they snitch to the office manager who has been foaming at the mouth to reprimand me in front of everyone to solidify her dominance because it eats her up inside that I’m a beautiful person with A LIFE and I’m living my life making enough money to only have to deal with this bullshit for 3 days a week. \n\nDon’t go into this field. It’s so bad I end up getting a new job every 6 months. It’s so bad that I quit on the spot, fuck 2 weeks notice. \n\nThe actual job- X-rays, scale, polish, floss, education- I’m completely fine with. It’s the same thing everyday. I fucking hate this field but it’s just a job. It’s not my life. I should of became a pilot…",
    "score": 307,
    "url": "https://reddit.com/r/DentalHygiene/comments/1o27har/dont_become_a_dental_hygienist_dont_go_into_this/",
    "created_at": "2025-10-09T14:30:54.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1n3hu2v",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Patient made me cry",
    "text": "I had such a bxtch PT this morning. I got her from the waiting room, and said how are you and she just says “I’m fine.” Which was my first clue because an at least DECENT pts will say fine, how are you. \n\nWe sit down and discuss need for X-rays a what not and I can already tell she’s annoyed and says “I’m literally just here for a cleaning.”\n\nThankfully, without much pushback, we get the X-rays and I’m explaining to her the X-rays and what we’re assessing for and she snaps at me and says I shouldn’t mention the word cancer first thing in the morning at the dental office because no one wants to hear that. \n\nMind you, all I said was we’re assessing for common bone cancers and they’re commonly seen in the side of the jaw…. \n\nWe proceed with the cleaning and she then starts complaining about how long it’s taking and why it’s so long and that when she comes they just normally scrap it off and she’s gone. Like …I’m so sorry I’m trying my best to do a thorough JOB?!?! \n\nThat part was my tipping point, because I’m a new grad, I’m already insecure about my skills and suffer heavily with imposter syndrome, plus one of my parents was hospitalized the night before and I was worried about them and I guess her remark really just brought everything up to surface. \n\nSo I sat there, scaling and polishing her teeth, while I was silently crying to the point where my mask was all wet and my vision was getting blurry and my nose was stuffed. I couldn’t even bring myself to tell my doctor what was going on with the PT or with my family because I was going to breakdown even harder after I did in the bathroom before I went to get the doc for the exam. \n\nI’ll never understand why people just act so entitled and bxtchy for no reason at 8AM!! ",
    "score": 226,
    "url": "https://reddit.com/r/DentalHygiene/comments/1n3hu2v/patient_made_me_cry/",
    "created_at": "2025-08-29T20:08:40.000Z",
    "num_comments": 84
  },
  {
    "id": "reddit-1k5zoun",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Crying on a Monday Morning...",
    "text": "Okay, I need to share something that seriously moved me this week.\n\nAbout a year ago, I had a longtime patient come in—someone I’ve seen for over 6 years. His oral health had always been solid, but when he came in that time, everything had changed. I won’t go into all the personal details, but life hit him hard. He lost a long-term partner and his job all within a month. You could see the toll it took—not just emotionally, but physically, and especially in his mouth. The neglect was clear. It broke my heart.\n\nHe told me he had “tried everything” but nothing was working. Same story, different day. Six months ago, I decided to have a real talk with him. I downloaded a toothbrushing timer app on his phone right then and there, and explained that he needed to start treating his whole mouth, not just brushing one side. (The tartar buildup was only on one side—seriously!)\n\nThis week, he came back… and I’m not exaggerating—his oral health has completely turned around. I’ve only seen this kind of transformation a few times in my 8-year career. His gums were healthier, plaque was minimal, and for the first time in a long time, he smiled with confidence.\n\nHere’s what really got me: he thanked me 😭 He said that one little push helped him start pulling himself out of his funk. He showed me a 164-day brushing streak on his phone (better mouth app). He said it became part of his routine and gave him something to feel good about every day. It helped him get out of that dark place.\n\nDental health *is* mental health. We do so much more than just clean teeth. So to all my fellow RDHs: take those extra 5 minutes to talk home care. Think about what your patient’s going through in the six months between appointments. We have the POWER to change lives! \n\nWhat a way to start a Monday.",
    "score": 191,
    "url": "https://reddit.com/r/DentalHygiene/comments/1k5zoun/crying_on_a_monday_morning/",
    "created_at": "2025-04-23T13:51:24.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1mgxstx",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Trigger warning: dental hygienists “complaining about our easy jobs” again",
    "text": "Walk into my world for one hygiene appointment:\n\nI start by speed‑reading a medical history that would make a nurse sweat. Blood thinners, diabetes, high blood pressure: check, check. My brain juggles a thousand clinical red flags, but the clock started when I opened the door.\n\nI smile, greet my patient, and immediately try to calm their nerves while they apologize for “not flossing enough.” I listen, educate, and reassure, connection is part of the care.\n\nThen the juggling act begins:\n\n* Probe six points per tooth\n* Check X‑rays and spot anything the dentist will want to discuss\n* Do an oral cancer screening, soft tissue exam, plaque index, identifying local factors, etc \n* Chart, stage, grade, and explain, all while staying on time\n\nMeanwhile, my patients start opening up about their dry mouth and bleeding gums, and I know they need more time. But the system doesn’t allow that. I have 50 minutes to address everything, or someone’s upset; maybe the next patient, maybe the dentist, maybe production.\n\nSo I rush the cleaning, not because I want to, but because the next patient is waiting. I hate the feeling in my gut that I couldn’t give the complete care I know they deserve.\nBy the end of the day, I’ve repeated this 8–10 times, my hands are throbbing, my bladder is a hostage, and I’m running on fumes. And then I get told:\n\n“Well… maybe you just don’t like your job.\nAre you sure this is about patients and not about you?” \n\nOh and if we call out… kid sick, mom died, car crash, cancer, ect. We are treated like we killed somebody. Que the passive agressive messages “hey, hope everything is ok, are you sure you can’t work half a day?” \n\nHere’s the truth:\n\nThis is about patients.\n\n* Patients get rushed through care.\n* Preventive visits feel like speed dating instead of healthcare.\n* The system implicitly pushes production over wellness, and the provider and the patient lose.\n\nSo yes, I love my job.\n\nI love my patients.\n\nBut loving my job doesn’t mean ignoring that the current system is failing both sides, and blaming hygienists for noticing is absurd.",
    "score": 140,
    "url": "https://reddit.com/r/DentalHygiene/comments/1mgxstx/trigger_warning_dental_hygienists_complaining/",
    "created_at": "2025-08-03T23:24:00.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1l19zy9",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Nevada Association of General Dentists is speaking loudly and opposing the recent bill aiming to create an alternative path to hygiene licensure (watering down hygiene practice).",
    "text": "This is not in the best interest of Nevadans or any Americans. Americans have some of the best healthcare in the world, and the American healthcare education system is what sets America apart. \n\nThis bill is ideal for those who believe a formal education with formal clinical training in an educational setting is no longer critical. Everyone’s looking for a shortcut today. Dumbing down the academic component is not the way to fix the hygiene shortage. (p.s. By hygiene shortage, I mean the one that was created in the heart of Covid when hygienists finally started to speak up and demand a more equitable compensation structure, and then the dentists got mad along with the ADA, so they began to push stuff like this). Above, I emphasize a formal education with formal clinical training because an office setting is rarely designed for this.\nIn contrast, a school is absolutely set up and equipped to educate students. Again, private offices are not. This is not to say they can’t educate students in limited capacities, but they can’t and shouldn’t replace schools.  ",
    "score": 134,
    "url": "https://reddit.com/r/DentalHygiene/comments/1l19zy9/nevada_association_of_general_dentists_is/",
    "created_at": "2025-06-02T05:28:40.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1kint38",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Do less make more !",
    "text": "Overheard an assistant discussing with another assistant how she wants to get into hygiene school. When the other assistant asked her why she told her “I want to do less and get paid more”. I often wonder if anyone has any clue how insane our job is other than those also in the field. This isn’t to say that assisting isn’t a difficult job but I think this lady is in for a rude awakening if she gets into the program. If you already have a do less attitude…. Hygiene is not for you… the program alone will eat you alive, sh!t you out and then catapult you into oblivion… and I personally enjoyed school and found it to be fairly straight forward. Big yikes. Thanks for reading my rant ! ",
    "score": 122,
    "url": "https://reddit.com/r/DentalHygiene/comments/1kint38/do_less_make_more/",
    "created_at": "2025-05-09T17:11:36.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1j71eoa",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "I GOT IN",
    "text": "I only applied to one hygiene school because it was the only one with a manageable commute and it was a very demanding application process so I wanted to put all of my focus into it. My application included 2 essays, the ATDH, an interview, 2 years of prerequisites, etc. Basically it was the hardest thing I’ve ever done, I’m not a naturally good student or a genius I have to work very hard in school to do well so the fact that I got into this program with a 20% acceptance rate on the first try is so mind boggling to me and I’m so proud of myself it doesn’t even feel real. I guess I just wanted to share that because whew that was so much stress. I’m really excited to start the program this summer and if anyone has any advice for me I’d love to hear it!! :) I know it’s going to be a million times harder than the application process but I’m ready, the only thing that makes me nervous is that you can’t get below a C on any assignments in order to stay in the program and if that includes tests then I’m screwed because I’m a terrible tester. Anyway sorry for rambling overall I’m just really happy and nervous.",
    "score": 115,
    "url": "https://reddit.com/r/DentalHygiene/comments/1j71eoa/i_got_in/",
    "created_at": "2025-03-09T06:18:24.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1jupk7e",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Walked out on the spot",
    "text": "Title says it all. I literally walked out on the spot because of the DISRESPECT and toxic environment I was in for the past 8 months. I have been working at this office for the past two years, and it was great at first but the last 8 months has been hell from me. \n\nI work commission based in a rural area 7 hours away from the city where I’m from. The owner’s wife (a dentist) has been taking my patients without my knowledge, literally taking them from my schedule and putting them with her FOR HYGIENE. She calls my patients when I’m not there (usually Saturdays) and deletes them on my schedule. I finally had the courage to say something and I was gaslighted and lied to straight to my face. I was told I was “making a big fuss” for no reason. IT IS A BIG REASON THIS IS HOW I MAKE MY LIVING AND YOU ARE TAKING IT AWAY FROM ME. I walked out and although I do love my coworkers and patients, I had to put myself first. (I just hope they pay me lol)\n\nThis is your sign to leave if you feel you are not respected as a hygienist. ",
    "score": 113,
    "url": "https://reddit.com/r/DentalHygiene/comments/1jupk7e/walked_out_on_the_spot/",
    "created_at": "2025-04-08T21:47:44.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1ou8ba2",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Dental hygienists and building rapport with patients …",
    "text": "\nIt confuses me why it’s so pressed upon dental people, especially hygienists to build so much rapport with patients and coddle them and be all happy and jovial all the time. \n\nI’m not close or have literally any rapport with any other person who has anything to do with my body? Not my gynecologist, not my chiropractor, not my masseurs, not my physician. Not anyone?? We only see them maybe one or two more times a year more than everyone else, but it’s expected that we build these happy fun relationships with patients.\n\nWhy can’t we just come to do a job?? Of course I’ll be nice but I like to keep it straight to the point. I don’t have energy to be buddy buddy with every patient all day bc then I have nothing left to give to my family and friends who truly matter to me back at home. Why is this the norm?? \n\nAll these job listings saying, we want someone who wants to be involved with patients and them as people and be jovial and loves getting to know and foster relationships with them. This isn’t therapy or a community center?!? I never see that sort of description on any other listing for any other healthcare job…\n\nI’m aware patients have dental anxiety. People also have healthcare anxiety period. I almost shit my pants when I have to get my blood drawn or get a Pap smear, but no one in there is tryna be my therapist or soothe me? They just do it and say are u ok? And that’s it..",
    "score": 97,
    "url": "https://reddit.com/r/DentalHygiene/comments/1ou8ba2/dental_hygienists_and_building_rapport_with/",
    "created_at": "2025-11-11T12:36:32.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1nxpwbs",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Periodontal neglect at new job",
    "text": "I’m a dentist, not an RDH but I care a lot about Perio health. It’s the foundation, and a pt can’t demonstrate a commitment to their oral health, I won’t give diagnose implants on them or other restorative options due to them not being compliant.\n\nAnyway, I started working at this new job and I’m… not really happy. I keep seeing pts who have been seen regularly, and have Perio disease with calculus caked on their teeth and evident in their radiographs. Some of these pts even have a history of SRP being completed in the last year. However, is it possible to get calculus to such as extent, in such a short amount of time?\n\nThe dentist previous to me at this location refused to have a hygienist. In fact, all the docs in this area refuse to have a hygienist because they want to take home the production that they make from prophy and SRP (laughable, really. You’re telling me you can’t make up the difference with treatment?). But you tell me, is it even possible to give everyone a prophy and/or SRP of 2 quads in less then 20 minutes alongside restorations in that same 1 hour appointment?! I don’t think so. And I’m seeing the clear evidence of this. \n\nOffice has piezo scalers but DAs don’t know they have different tips. I had to look it up because I’ve never worked with piezo scalers, only cavitron. They give me one universal supragingival scaler tip. One random scaler (could be anything, 13/14, /\n15/16, universal, jaquette, literally makes zero sense). No UNC probes, only plastic with 3mm markings. No 11/12 explorer, no nabers probe, etc.\n\nAm I missing something here, or am I the stupid one? Why are these docs neglecting Perio health?!",
    "score": 86,
    "url": "https://reddit.com/r/DentalHygiene/comments/1nxpwbs/periodontal_neglect_at_new_job/",
    "created_at": "2025-10-04T09:55:38.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1nvetdm",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "That's it ...",
    "text": "\nThis morning’s huddle really triggered me. The front desk called my schedule “light” even though I had 12 patients. I told her that’s busy, even for accelerated hygiene, and she snarked back, “well, I could stack it.” That moment hit me hard—I think I’ve reached my limit with dental hygiene.\n\nI’m in my second year as a hygienist. I’ve bounced between several offices and temped, trying to find the right fit. No office is perfect, but what I’ve seen is discouraging: pressure to upsell regardless of need, falsified records to boost profits, insurance fraud, double-columned schedules with no support. The business model feels broken—it’s about money, not care—and it’s drained my passion for working in-office.\n\nYes, I enjoy the pay and those rare moments of connecting with patients, but the constant push for production in 30–45 minute blocks leaves no time for real care. My current office at least gives me an assistant, but the schedule is inconsistent, treatment plans are often ignored, patients run late but are still seen, and I end up cutting corners just to keep up. By week’s end, I’m physically hurting, mentally drained, and questioning why I’m even here.\n\nI didn’t choose this field to rush through people—I wanted to build relationships and provide care. Instead, I feel like I’m doing the bare minimum while the system sees me only as a revenue generator. I’ve tried to give feedback, but it’s brushed aside and the chaos continues. There’s little culture or connection—it’s just work, then leave. Maybe it’s Nevada’s corporate, money-driven model, but it’s left a bad taste in my mouth about hygiene in general.\n\nI respect my team and doctor for their feedback and support, but ultimately, I don’t see myself in this field much longer. I’m already working toward my master’s, where I hope to transition into a role that lets me help others in a more sustainable and meaningful way.\n\n**TL;DR:** I’m two years into dental hygiene, but the profit-driven business model, unrealistic scheduling, and lack of real patient care have burned me out physically and mentally. While I value patient connections and teamwork, I can’t see myself staying in this system. I’m pursuing my master’s to move into a more impactful, sustainable career helping people outside of the operatory.",
    "score": 77,
    "url": "https://reddit.com/r/DentalHygiene/comments/1nvetdm/thats_it/",
    "created_at": "2025-10-01T17:35:51.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1m9c6a1",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Stressed!!!",
    "text": "   I have been a hygienist for twenty-eight years, and most days I absolutely love it. I have a great job with employers who really build me up and treat me fantastic. \n   A few weeks ago I had a patient literally leave mid appointment because he couldn’t stand the scraping on his teeth. He assured me it wasn’t anything I did wrong, it was just him. I still felt like I failed him. \n   A couple of days later I had a crazy heavy SRP. I took a post op BWX, and it was perfect. I felt redeemed.\n   Today I was shown a review praising a part time hygienist, and implying she told this patient I left calculus behind at the last appointment. I checked the intra oral photos, and even a first year hygiene student would not have left that behind. I know 100% I didn’t leave that behind. \n   My last patient today was extremely nervous and scared. I talked to her before I started and assured her this would an easy appointment. I explained every step as I went. The patient had a few tears, but very cooperative. At the end she was very happy with the way her teeth looked and thanked me. I offered to put her on my schedule for her next cleaning, and she readily accepted. \n   So…the point? Don’t let unhappy patients ruin your confidence! Most of my patients are very happy, thank me, and compliment my thoroughness. I do beat myself up when someone isn’t happy, but then I take a deep breath and give the next patient my all. ",
    "score": 75,
    "url": "https://reddit.com/r/DentalHygiene/comments/1m9c6a1/stressed/",
    "created_at": "2025-07-25T21:57:46.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1ope1b7",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "A patient hates me for making her swallow her saliva.",
    "text": "I saw this lady in her 60s about a year ago — twice, for recall appointments. After that, she started seeing the other hygienist while I was on maternity leave. Today, she was scheduled with me again because the other RDH was sick, and she made a huge scene at the front desk, saying she doesn’t like me because I “made her swallow her saliva last time.” (This is a patient who likes to hold the suction herself and wants every bit of saliva removed, and to my best knowledge, I had acknowledged her preference.)\n\nShe ended up canceling the appointment and re-booking for next week with the other hygienist. It completely ruined my day. How do you guys cope with experiences like this? I’m such a people pleaser, and now all I want to do is cry.\n",
    "score": 73,
    "url": "https://reddit.com/r/DentalHygiene/comments/1ope1b7/a_patient_hates_me_for_making_her_swallow_her/",
    "created_at": "2025-11-05T20:22:36.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1iehitk",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "5+ years hygienists: did you go through this too?",
    "text": "I was an assistant for 5 years first and am now 5 months away from hitting my 5 year mark as a hygienist. I've heard many times that it takes 5 years to be proficient, and now that I am nearing that date, I must admit I feel like I've turned a corner, like a few lights have come on, and suddenly I realize I have left burnished calc on many patients that I couldn't feel before and now I realize it's there. I feel like I'm kinda going back on many of my regular patients and cleaning up my own mistakes! I really struggle to feel things with the explorer, but I am just now beginning to be able to adapt it well enough and now am starting to just 'know' where it's likely to be anyway. In the last several months, I've noticed I can just naturally get into deeper areas sub-g and well look at that, I piece that probably I left is there! \n\nJust a couple days ago, I had a very nice patient remark that in the past, she could get go-betweens interprox at 25/26, but over the last year or so (under my care) the area seems to be unable to take a go-between at quicker rates than before. I go into the spot with a freshly sharpened instrument and scrape out like a ton of what appeared to be just smooth, overlapped tooth but was instead calc I had burnished, slowly closing in the gap! \n\nI finally feel like I know how to sharpen my instruments, despite my best efforts to do this often and correctly in the last 5 years. Like, suddenly, I can tell as I'm sharpening if I've got it, like I can hear a change in the sharpening. I now can totally tell the difference of using a nice sharp instrument and a somewhat dull one.  \n\nAt the same time, for the entire last 4.5 years, I would have berated myself harshly and endlessly for missing spots. I would have questioned my ability to even do this job. I would have apologized up and down the patient. But not now, because, at least in my mind, I feel like the only way to have gotten to the spot I'm at now is by practicing so hard for the last 4 years, and that making those mistakes were somewhat unavoidable. So I'm not hating on myself. I'm just taking it like this is probably what a lot of hygienists experience and thus this is why they say it takes 5 years and you just have to go through this stage to get there. \n\nAm I kinda right? Does this sound like I'm not a terrible hygienist for burnishing and leaving things despite my best efforts, and that I will simply move forward, clean up what I've left before, and feel good I've finally hit this level? ",
    "score": 69,
    "url": "https://reddit.com/r/DentalHygiene/comments/1iehitk/5_years_hygienists_did_you_go_through_this_too/",
    "created_at": "2025-01-31T15:38:29.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1l460qz",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Leaving dentistry for good.",
    "text": "Big rant ahead, because I need to vent. I'm sure a lot of you won't relate to this, but maybe some will...\n\nI will FINALLY be free of this (in my opinion) awful career at the end of June. \n\nThese last three months have been a living hell. I broke down at work after being forced by my boss to carry out procedures for which I've had barely any training - CT scans, sedation, phlebotomy etc. I have a dentist co-worker who belittles me in front of patients any time I miss a TINY bit of calculus. The assistants don't respect me and often leave me working alone for multiple appointments at a time whilst they sit in the staff room chatting.\n\nAfter my breakdown, during which I was sobbing and hyperventilating, my manager told me to take some time off to clear my head and reset. So I requested ONE day off a month in advance -nothing major, right?- but they refused it as I'm fully booked for the next six months and they won't cancel patients. So what do they expect me to do? I got signed off sick for three weeks by my doctor but my bosses guilt tripped me into coming in anyway. A few days later, I handed in my notice, and I'll be done on June 28th.\n\nSince then, my life has consisted of daily panic attacks before work. I've unintentionally lost 25lbs as a result of only being able to force down one small meal a day. I'm only getting two or three hours of sleep before work, and as soon as I wake up and realise I have to go in - a panic attack begins. I've now been put on beta blockers and SSRIs, but it still takes every ounce of energy I can muster to leave my house.\n\nI've worked in dentistry for 12 years (assisting for seven years, an RDH for five), and hygiene has made me HATE the field that I used to adore. This mental breakdown has been a long time coming, because I've been burnt out pretty much since the day I started. This job was nothing like it was made out to be in school.\n\nI'm sick of entitled and rude patients, constantly running late due to things outside of my control, arrogant dentists, pushy receptionists, back/shoulder/wrist/neck/hip pain, the SHEER MONOTONY, and having to be 'on' all day. \n\nThis job is hard enough in and of itself, but having to spend nine hours a day 'performing', slapping on a fake smile, and pretending everything is great all the time for the sake of the patients, has ruined my mental health. This job has been slowly killing me from the inside out. I used to be happy, I used to have a social life, I used to have hobbies that brought me joy. I'm just a shell of my former self now. I genuinely have no energy to do anything other than lay in bed and disassociate when I'm not working.\n\nI used to say that I'm an introvert doing an extrovert's job. I'd hoped that after a few years, I'd get used to it, but after receiving my autism diagnosis recently, I realised that there's no 'getting used to it' for me. I've spent five years masking in order to make everyone else comfortable, and I'm exhausted.\n\nI can't stand dealing with people all day, making pointless small talk, having to molly-coddle full grown adults, and having the treatment I'm going to be carrying out dictated by patients that think they can just pick and choose what they have done like they're at a spa, not a dental office.\n\nThe only upsides of hygiene for me are the pay and part time hours, but that's just not worth it for me any more.\n\nOnce I'm done, I'm taking at least a month out to work on my mental and physical health, then I'm going to find a job in a completely different field. I don't care if it's less pay and involves more hours, as long as it's not related to dentistry -and I don't have to be patient/customer facing- I'll be happy. I just want to sit in front of computer with my resting bitch face and not talk to anyone.\n\nI know the vast majority of hygienists love their career, and I'm really happy for those that do, but I'm not one of them.\n\nI wanted to post this just in case anyone is having similar feelings. There are ways out. If you hate this job, please don't let it ruin your physical and mental health like it has mine. It's not worth it.\n\n\nUpdate: it's June 28th and I'm finally free! Walking out of that place, knowing I'll never have to see any of my asshole former patients or pick up a scaler ever again was the most relieved I think I've ever been in my life. I feel like the world has been lifted off of my shoulders. No regrets. Shall update again after my break!\n\nUpdate 2: it's September 20th and I'm working again! Since the job market in the UK is in tatters at the moment, I had to go back into dentistry. I'm now assisting at an orthodontic office. My best friend also works there, which helps a lot, but it's genuinely the best practice I've ever worked at, and orthodontics is so much easier (to me) than general dental assisting. My mental and physical health has improved greatly. I'm in a good place now. ",
    "score": 67,
    "url": "https://reddit.com/r/DentalHygiene/comments/1l460qz/leaving_dentistry_for_good/",
    "created_at": "2025-06-05T18:01:50.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1kx1wy7",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "California Hygiene Salary 150k+",
    "text": "I am just posting for salary transparency. I see so many RDHs in California saying they are making less than 100k. Please don’t settle for less! I am currently making $185,000+. I graduated in 2022. I mainly work in Los Angeles and OC. In 2023, I made 200,000 temping two days a week instead of one. I now \ntemp one day a week for $100/hr and regularly I make $75/hr. I know more inland the rates drop, but don’t settle for less when others are doing the same work as you for more! \nMuch love to all dental staff &lt;3\n\nEDIT: I work six days a week. For those of you who are saying the math doesn’t check out it’s \n\n$75hrx8hrs(600 a day x 5 days a week) that’s 3,000. I make 800 on the day I temp ($100/hr) That’s a total of 3800 a week. 3800x52 weeks is 197,000. I take some time off (so more like 48 weeks) so I made around 185k. Also…this is all BEFORE taxes. And when I made 200k I worked at $75/hr for 4 days a week instead of one, still working a total of SIX days a week. I hope this is more clear, sorry for any confusion! This is the last year I plan on working so much as well. ",
    "score": 66,
    "url": "https://reddit.com/r/DentalHygiene/comments/1kx1wy7/california_hygiene_salary_150k/",
    "created_at": "2025-05-27T23:16:01.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1nogtj6",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "I’ve tried most of the dental temping apps! Here are my honest thoughts (Central FL RDH who also picks up DA shifts) and what I wish I knew before going full-time temp",
    "text": "Hi! I’m a dental hygienist in Central Florida who temps full time. Because I’m full time temping, I also pick up dental assistant shifts if it makes sense $$$ wise. I genuinely love temping! It lets me control my schedule and spend more time with my son. Here’s my take on the apps I’ve used the most, plus a few things I wish I knew before making the jump.\n\n**Apps I use and how they’ve been for me:**\n\n1. Cloud Dentistry: The first agency I tried. Easy to use but it glitches sometimes. Free CE is a nice perk. Biggest issue for me has been cancellations, I had a fair number of last-minute cancels from offices. Also if an office requests you and you can’t work, it dings your profile score, which is annoying.\n2. Teero: Quicker pay is great. For me there just weren’t as many shifts and the consistency wasn’t there. I’m not a huge fan of the clock in/out flow and support has been hit or miss. Not awful, just not my favorite.\n3. GoTu: My most-used app honestly. Most amount of shifts, solid pay, and most offices I’ve gone to have been okay to great. I like being able to counter offers and just apply when I want a shift. Customer service has been decent and I like that you still get paid if an office cancels close to the shift. \n4. Kwikly: Not a ton of shifts in my area, but the app works fine. I only used once for a bonus.\n5. Toothio: I only used once, I stopped checking because there weren't any shifts I would pick up.\n\n**What I wish I knew before going full-time temp:**\n\n* Have a floor rate and stick to it. Decide your “won’t go below” number for shifts. Counter respectfully and don’t be afraid to pass. I found myself being super resentful working at offices way below I felt like I'm worth.\n* Confirm basics the day before. Software (Dentrix/Eaglesoft/Open Dental), parking, instruments/ultrasonic availability, x-ray sensors, PPE, who to report to. Almost all of these apps give you a way to talk to the office the day before.\n* Build a “go bag.**”** Loupes, light, masks you like, safety glasses, favorite scaler/prophy angle if allowed, pen, name tag, snacks, water, phone charger. If you're already feeling shy in a new area having to ask for a phone charger is going to make you feel like passing away LOL.\n* Track favorites. After a good shift, save the office as a favorite and write 2–3 quick notes (doctor’s style, op layout, staff names). That list becomes gold.\n* Expect cancellations and protect your income**.** Know each app’s cancellation policy and lean into ones that pay for late cancels. I feel like I won the lottery every time I get paid for a late cancel. \n* Mind taxes and mileage**.** If you’re 1099, set aside a % from every payout and log mileage the same day. Future-you will be grateful. This has been a gamechanger with me. One of the apps I use has a partnership with H&amp;R block and they helped me set-up my LLC.\n* Be versatile. If you're serious about full-time temping and willing to do it take on DA shifts here and there fills gaps and keeps cash flow steady when hygiene slows.\n* Communicate!!! A quick morning text (“I’m Y/N, arriving 7:45, anything special today?”) sets a profesh tone and avoids surprises.\n* Don’t take a bad day personally. Every office has off days. Say thank you, leave a professional impression, and move on. I used to want to go on Google and leave them a review after a bad experience but now I just make a note to not go there anymore.\n\nWhy I love temping:  \nI control my time. I can load up on work when I want to and block days for my son (8YO) without asking anyone for permission. I get to meet different teams, pick up tricks, and avoid getting stuck in a toxic culture. The variety keeps me sharp.\n\nHappy to answer questions about any of these apps or temping in general! Pay, packing lists, handling nerves at new offices, whatever you’re curious about. If you’re on the fence about going full-time temp, I’m cheering you on. It’s not perfect, but for me it’s been worth it.\n\nI have referral links for all these apps where we both get cash, DM me if you want any of them.",
    "score": 65,
    "url": "https://reddit.com/r/DentalHygiene/comments/1nogtj6/ive_tried_most_of_the_dental_temping_apps_here/",
    "created_at": "2025-09-23T13:03:26.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1pipcvw",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "I’m not a good hygienist",
    "text": "I’m a year and a half into my hygiene career and I am one of those hygienist that is probably too light handed. The main reason I am this way is because patients give me significant anxiety, which causes me to not really get in there and do what I need to do. For instance, I tried to use the releaf system and immediately my patient was like “I have had dozens of cleanings in my life and they have never needed to use this”. I try to explain the benefits and he said “well I prefer to not have it” in a very aggressive tone. Then I got insecure and never tried it again. I’ve had patients freak out on me when I request they wear safety glasses. I told a patient I noticed her lips were really dry and asked if they had been more so with cold weather and she ripped off her napkin and said “I’m done” and left.  I’ve had great patients too and many that request me, but I’m literally terrified I’m going to trigger them and have them either flip out on me or leave me a terrible review and get me in trouble with my boss. I find myself hand scaling a lot because people get so upset over the water/sound of the cavitron, even when I do everything to control both those factors. I also feel like sometimes I’m not as aggressive as I need to be hand scaling because I don’t want to cause pain and have my patient be upset with me. I really want to do better and be a great hygienist but I get so intimidated by these experiences. Does anyone have any tips on how to be a more confident hygienist and not let myself be so intimidated by patients? I have been on maternity leave and really want to do better when I go back. ",
    "score": 58,
    "url": "https://reddit.com/r/DentalHygiene/comments/1pipcvw/im_not_a_good_hygienist/",
    "created_at": "2025-12-10T01:20:04.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1hymlu9",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Am I Overreacting?",
    "text": "I’ve been a hygienist for almost a year now, and let me tell you, I hit a new low today that has me completely mortified! You know how it is for us, we're constantly swapping through gloves. Grab something, gloves off; back to the mouth, gloves on; then off again to jot down notes during the DDS exam. \n\nWhile sleep-deprived and running dangerously behind schedule, I started to feel flustered and more rushed. It wasn’t until after the DDS evaluation that I finally started the cleaning, only to realize my next patient was already waiting! \n\nIn a rush, I swung around from the computer to the patient’s side, grabbed the low-speed suction and the cavitron, and pulled her lip back to get started on those lower anteriors.\n\nThen, in a horrific moment that will live with me forever, I gasped \"OH MY GOD!\" as I yanked my hand away...\n\nI HAD NO GLOVES ON!!! I was bare-handed, grabbing her mouth like a caught trout.\n\nI started apologizing up and down and said that I wash my hands constantly and that they're \"clean\". I immediately washed them right there in front of her (because nothing screams professionalism like a frantic hand-washing in the middle of an appointment), cavi-wiped the suction, changed the tip, swapped out the cavitron... By this point I was drowning in the weeds... \n\nTo top it off, my next patient was the angriest I’ve encountered yet, yelling at me about the time and how this impacted her. To be fair, I did pull her back nearly 40 minutes late... but still! More apologizing and self-dread for me.\n\nSo, I have to ask, has anyone ever had a similar glove-less moment? Is this kind of mistake somewhat common, or should I increase my anti-anxiety meds and prepare for a potential lawsuit? \n\n",
    "score": 54,
    "url": "https://reddit.com/r/DentalHygiene/comments/1hymlu9/am_i_overreacting/",
    "created_at": "2025-01-11T03:09:29.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1pjkr9f",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Had a patient cry after using cavitron.",
    "text": "I had a patient today who came in for a prophy and I did my normal shpeel and started the cleaning. I started with perio probing and then I got out the cavitron to go through before hand scaling - like I always do. \n\nI obviously asked if it was okay with her if I used it and she was like “yea sure that’s fine!” Super friendly and such. So I started to cavitron her teeth and periodically asked if she was doing okay and every time she was like, ‘yea this is fine!’ No sensitivity or discomfort or anything when I asked about both. So I thought it was all was good. When I was done with the cavitron and put it away to get my hand scalars, she asked if I could grab her some water. So I sat her up and went to the lobby to grab water. When I got back she was bawling. Like with her stomach bawling, I was completely taken off guard and I asked her what was wrong and she said she was so scared of the ‘water thing’ I used and that she couldn’t believe I used it and that she’s been having cleanings for over 40 years and has never had it used on her. \n\n\nI got her tissues and tried to comfort her. She was inconsolable for a while but then she calmed down… I asked her if she wanted to finish the prophy and she said yes, so I did. Once I finished the appointment I flagged her account and noted to never use the cavitron on her again and then told my office manager. \n\n\nI was kinda shocked though? I’ve only been a hygienist for a year and a half so I’ve never seen this before? Why didn’t she say during the MULTIPLE times I asked how she was doing to stop because she didn’t like it? I just wasn’t expecting it and was wondering if this was something I should be more conscious of or if I should ask more questions before starting? ",
    "score": 48,
    "url": "https://reddit.com/r/DentalHygiene/comments/1pjkr9f/had_a_patient_cry_after_using_cavitron/",
    "created_at": "2025-12-11T01:29:01.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1kfqpq8",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "I want to leave the dental field",
    "text": "I've been a dental hygienist for 11 years and I absolutely hate it. The worst part is, I've always hated it. At the time, I thought I was going into a field I would love but I don't want to do it anymore. I'm so stuck because I have NO idea what to do or go back to school for. Has anyone left dental hygiene and did something completely different? I'm only 38, I don't want to spend my life unhappy. It's getting to the point where I have to talk myself into going to work. Advice? \n",
    "score": 46,
    "url": "https://reddit.com/r/DentalHygiene/comments/1kfqpq8/i_want_to_leave_the_dental_field/",
    "created_at": "2025-05-05T23:51:51.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1mijw5d",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "🦷 The “Implicit Downgrade” of Dental Hygiene (And Why It Matters)",
    "text": "\nLet’s talk about something no one says out loud:\nOur licenses are technically safe… but quietly being devalued.\n\nHere’s how the implicit downgrade works: \n\n1️⃣ Your RDH License Still Exists… On Paper\n*You went to school, passed boards, and earned licensure.\n* Legally, you are recognized as a healthcare provider.\n* But in practice, your scope is boxed in under dentist control, making your license functionally less independent.\n\n2️⃣ Lower-Standard Alternatives Quietly Move In\n* Foreign-trained dentists, dental therapists, or on-the-job-trained “hygiene assistants” are introduced to fill the same roles.\n* They don’t meet the same education or board requirements as you.\n* Yet, they perform “hygiene” tasks in the public eye.\n* Patients can’t tell the difference, and that’s the point.\n\n3️⃣ The Profession Is Financially Undermined\n* Offices claim “Hygiene doesn’t even cover overhead” to justify:\n    * Flat or reduced wages\n    * Packing schedules back-to-back\n    * Hiring cheaper substitutes\n* The ADA implicitly frames hygiene as replaceable labor, not a specialized profession.\n\n4️⃣ The Public Perception Shift\n* Over time, if anyone can “do a cleaning,” the value of your license erodes.\n* It becomes harder to justify:\n    * Independent practice\n    * Competitive pay\n    * Policy respect\n* Eventually, the pipeline of fully trained hygienists shrinks, because why invest in a career that’s treated like an accessory?\n\n⚠️ Why This Matters\nThis is how professions are weakened without a single law change:\n1. Keep the license “alive” to avoid lawsuits.\n2. Slowly replace or dilute the workforce with cheaper, less-trained alternatives.\n3. Frame it as “innovation” or “access to care.”\n\n\nBy the time the public realizes the difference in care quality…\nIt’s too late.\n\nThis isn’t fearmongering, it’s what we see across the country. If we want our license to mean something in 10 years, we have to:\n* Educate patients on who we are and what we do\n* Advocate for a policy that respects the RDH license\n* Support each other instead of silently accepting erosion\nWe earned these credentials.\nWe deserve better than an implicit downgrade.",
    "score": 45,
    "url": "https://reddit.com/r/DentalHygiene/comments/1mijw5d/the_implicit_downgrade_of_dental_hygiene_and_why/",
    "created_at": "2025-08-05T20:09:16.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1jldje1",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Hygiene Pay overall",
    "text": "How do you feel when dentists talk about the amount they have to pay “new grads” versus “seasoned hygienists”. A few voiced how the OG hygienists had to work to earn as much as the minimum is now versus nowadays where hourly is high and only getting higher without “earning it” Or they talk about getting too low of payment from insurance to pay that much to hygienists. \n\n\nWhy wouldn’t dentists that value their hygiene pay just as much and not complain that they have to pay more. I feel like if that’s the case OG hygienists should fight for the hourly just as much because they are gold for patient retention in offices.\n\nBut some offices charge out $50 fluoride treatments, desensitizers, laser therapy, oral cancer screenings - then there’s talking about toothpastes, floss, mouth rinses, I can go on and on about it. On Velscope there was an office that implemented it and the DDS doesn’t even take time to look in the velscope then why should I advocate it if they don’t put the time to check it also for $30+ out of pocket for patient?\n\nWe generate a lot of income for dental offices, why is this still an issue with dentists and paying hygienists! \n\nDefinitely know in every state pay is different with our profession but still surprised as to this comment. \n\nAll I was able to say to it previously was that as long as someone puts effort into what they do and show they’re worth that hourly it doesn’t matter if you’re a “new grad”\nor “seasoned hygienist”; and to pay it if you want to keep someone that’s good and turnover rate goes down also. Why does salary always have to be hush hush in offices like that where they complain to pay higher and still keep their loyal hygienist low. \n\nWant to hear any and all the opinions on this ",
    "score": 24,
    "url": "https://reddit.com/r/DentalHygiene/comments/1jldje1/hygiene_pay_overall/",
    "created_at": "2025-03-27T20:59:26.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1prhjnk",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Is it common for dental hygienists to not receive raises?",
    "text": "Hi everyone. Since I started the dental hygiene program, my hygienist has shared her experience with me. She’s in Houston, TX and has worked at the same office for 7 years, private practice, making $45/hr, full time, with no benefits and no raise for 5 years.\n\nIs this normal for hygienists? She’s not worried about money, but I will have bills to pay. Any tips on how to earn a higher salary? ",
    "score": 18,
    "url": "https://reddit.com/r/DentalHygiene/comments/1prhjnk/is_it_common_for_dental_hygienists_to_not_receive/",
    "created_at": "2025-12-20T15:55:20.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1kz57ys",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Is dental hygiene worth it?",
    "text": "I already have a bachelors degree that I got in 2020 however not using it. I’ve been working random jobs for the past five years. Dental hygiene has been interesting me for about a year now so I decided to do the pre-req’s.  I should be applying for my program in December. Just wondering if any dental hygienist think that at the job is still worth it? do we think the salary is going to go down in the next few years? I’m currently 27 so I’ll start around 30 if all goes to plan. However, all the hygienist on Reddit really scare me and it sounds like they hate their job and I would hate to waste the money and time on school. I’m choosing hygiene because I’ve always been interested in dental and also I love the fact that you can work 30 hours a week and still be able to pay for life. I also plan on full-time temping because the flexibility would work best with my lifestyle. I’d love some insight from some current hygienist or those in school!",
    "score": 15,
    "url": "https://reddit.com/r/DentalHygiene/comments/1kz57ys/is_dental_hygiene_worth_it/",
    "created_at": "2025-05-30T14:11:01.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1m854ui",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "ALABAMA HYGIENISTS, have you seen the survey from the dental board?",
    "text": "The Alabama Dental Board has put out a survey to get people’s opinions on letting assistants take over hygiene duties, like coronal polishing, doing sealants, OHI etc. \n\nPlease take the survey. They are trying to let assistants take over hygiene duties so they can pay us hygienists even less and just scale all day while the untrained assistant does everything else. It just feels like this would screw both assistants and hygienists in the long term. Assistants will demand more pay (rightfully so) and hygienists will get paid even less than we are now, and we all know that the hygiene salary in Alabama is among the lowest in the country. ",
    "score": 15,
    "url": "https://reddit.com/r/DentalHygiene/comments/1m854ui/alabama_hygienists_have_you_seen_the_survey_from/",
    "created_at": "2025-07-24T13:57:46.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1ir7lte",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "DH annual salary POST tax?",
    "text": "Obviously you don't have to put down your exact numbers but I'm curious on how much a dh ACTUALLY makes. Yes I've heard they make great pay (Ontario, Canada) but they are mostly part time with no benefits. If taxes are taken out, and ur independently paying for insurance, ur own benefits, etc. How much do you actually make? (preferably CAD annually)",
    "score": 14,
    "url": "https://reddit.com/r/DentalHygiene/comments/1ir7lte/dh_annual_salary_post_tax/",
    "created_at": "2025-02-17T00:55:56.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1kiq8bz",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "Dental hygienists in Puerto Rico",
    "text": "I'd always heard that there were a couple of active hygienists in PR, and I just met them! I presented a CE course at UPR dental school, and they're faculty there, both of them with doctorates in education.\n\nFor some history, there used to be a hygiene program in PR until the 70's, but it was phased out for multiple reasons, primarily that the market couldn't sustain hygienists with higher salary due to minimal reimbursement rates.\n\nAssistants in PR can become EFDA's who can do prophies, but no perio, similar to the recent assistant expansions here on the mainland. Perio cases are usually referred to periodontists here. The difference is, these assistants still have to go to school for two years and get certified. This program is taught by one of the hygienists at the dental school.\n\nHygiene is still legal as a profession, there's just training for it anymore. Also, you could only expect about $14 an hour working as a hygienist here. That's a survivable wage on the island, the average wage is $8 an hour, but you'd essentially be stuck. Dentists here only make about 70-90k/year here themselves. Gentrification by mainlanders is rapidly making life incredibly difficult for Puerto Ricans though, but that's another story.\n\nAnyway, just thought some of you might find the state of hygiene in paradise interesting. :)",
    "score": 14,
    "url": "https://reddit.com/r/DentalHygiene/comments/1kiq8bz/dental_hygienists_in_puerto_rico/",
    "created_at": "2025-05-09T18:53:31.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1m8d3iz",
    "subreddit": "DentalHygiene",
    "soc_codes": [
      "29-1292"
    ],
    "title": "How does being a DH work?",
    "text": "Like scheduling, pay, benefits more than anything. Are you contracted? Do you get salary? Do you choose your hours? What benefits do you get (PTO, paid sick time, health insurance, company sponsored 401k, etc)? \n\nDo you like what you do? Does it feel like a hustle (I imagine it could if it is contract based?).\n\nCurrently working in startup white collar remote work and it’s crushing my soul. Trying to determine if the resources required (schooling cost &amp; time) to do DH would make sense, as I think I’d enjoy working 1:1 with my hands in a body/health oriented way. TIA! :)",
    "score": 13,
    "url": "https://reddit.com/r/DentalHygiene/comments/1m8d3iz/how_does_being_a_dh_work/",
    "created_at": "2025-07-24T19:00:28.000Z",
    "num_comments": 10
  }
]