[
  {
    "id": "reddit-1iikxwu",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "4500 year old skeleton. Teeth look fantastic!",
    "text": "Nothing in particular to share- just makes me wonder what the impact of their diet and lifestyles was or if they had some forms of dental care. Maybe it was nothing and this was just a young person with straight teeth. Elsewhere I’ve read that loss of dentition was the primary cause of death in early hominids. Would love to read people’s thoughts on the topic. Thanks!\n\n(Also full disclosure- I’m a crna who works almost exclusively in dental offices, but the flair options were both limited and required.)\n\nLink to the article. https://apple.news/A_UMmufE2S_WzfyQoAxsyVQ",
    "score": 690,
    "url": "https://reddit.com/r/Dentistry/comments/1iikxwu/4500_year_old_skeleton_teeth_look_fantastic/",
    "created_at": "2025-02-05T21:09:12.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1m92vxv",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "Crazy patient story: she made more money than me just by fixing her teeth",
    "text": "Had a female patient come in yesterday—mouth full of bombed-out teeth. Treatment plan came out to a bit over $10,000.\n\nShe was accompanied by a guy who paid in full upfront at the front desk, then waited for her downstairs the whole time. During treatment, she FaceTimed three different people, telling each of them how painful everything was and how ridiculously expensive it all cost.\n\nApparently, all three Venmo’d her money.\n\nWhen she was done, she asked for two separate itemized receipts, smiled sweetly, and walked out looking like she just closed a series of high-return investments.\n\nI did the work. She made triple my pay.\n\nStill processing what just happened. 😂\n",
    "score": 656,
    "url": "https://reddit.com/r/Dentistry/comments/1m92vxv/crazy_patient_story_she_made_more_money_than_me/",
    "created_at": "2025-07-25T15:54:07.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1k5zx68",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "Positive 6-Month Outcome After Tooth Autotransplantation!",
    "text": "Hey everyone,\n\nJust wanted to share a positive follow-up from a tooth autotransplantation case I've been monitoring. Today, I had a 6-month recall appointment with a patient who underwent this procedure. This was only the second autotransplantation I've ever performed, so I was particularly invested in this case.\n\nThe patient is a 15-year-old and 8-month-old male who was referred for root canal re-treatment on his lower right first molar. Honestly, I wasn't entirely on board with the initial treatment plan and felt the tooth was questionable to hopeless. Instead, I saw a good opportunity for a tooth autotransplantation, especially since his lower right third molar was only a soft-tissue impaction and a viable donor.\n\nFast forward six months, and the follow-up is really encouraging! Radiographically, we're seeing significant thickening of the transplanted tooth's root and even a slight increase in its length. This strongly suggests continued vitality and successful integration.\n\nI'm genuinely excited to see how this progresses over the next 2-3 years as the root fully forms. It's moments like these that make the work so rewarding!\n\nHas anyone else had experience with tooth autotransplantation, especially in adolescent patients? I'd love to hear your insights!",
    "score": 615,
    "url": "https://reddit.com/r/Dentistry/comments/1k5zx68/positive_6month_outcome_after_tooth/",
    "created_at": "2025-04-23T14:01:16.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1lr7zh1",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "5 Surface Anterior Composite Documentation",
    "text": "Young female patient with rampant decay. She is serious about turning her oral health around and will be doing extensive orthodontics after we freeze all the decay. \n\nI was doing a lot of large anterior restorations on her and I realized I was getting pretty good consistent results and I used to have trouble doing these.\n\nI've documented my workflow and can give greater detail if anyone is interested. \n\nThanks for taking a look. ",
    "score": 594,
    "url": "https://reddit.com/r/Dentistry/comments/1lr7zh1/5_surface_anterior_composite_documentation/",
    "created_at": "2025-07-04T02:49:43.000Z",
    "num_comments": 146
  },
  {
    "id": "reddit-1nepiua",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "Good dentists are great actors",
    "text": "And I think it's the hardest part of the job that few people outside of the profession can understand. You always have to be the most smiling, happy, pleasant, charismatic person in the room. You can't have a bad day. You can't be tired. You can't be depressed or sad. You can't have more important things on your mind. You can't be angry. You can't be any of those things because that's not what the patient wants to see, and when we only see most patients twice a year, one bad experience carries a lot of weight. You have to play that charismatic character for every single patient in every single interaction on every single day. You have to be ON. And that's exhausting. For me, personally, I think it's the hardest thing about dentistry.",
    "score": 540,
    "url": "https://reddit.com/r/Dentistry/comments/1nepiua/good_dentists_are_great_actors/",
    "created_at": "2025-09-12T00:46:24.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1ios54b",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "So there I was...",
    "text": "Everything was planned to perfection. I had even blocked a full hour for this.\n\nIt was smooth sailing for the first 15 minutes. Routine stuff, you know?\n\nOver-confident? Maybe?\n\nBut I've done this thousands of times...\n\nSo there I was, sitting today for a change, getting some good movement.\n\nBut then it broke in two.\n\nFuck me.\n\nSecond time this week, cant get the full thing out in one piece. I used to be pretty consistent at this too.\n\nSo I just went back to my training, moving to the cheek side then back,\n\nGetting some good bleeding so that'll loosen things up.\n\nBut then I hit a wall. No progress for like 10 solid minutes. I have a good mentor in the practice,  I probably should have called him in way before this.\n\nI was too busy thinking what I was going to get for lunch. Maybe something fancy?\n\nMy inner voice told me to fuck off,  \"You always get the same shitty sandwich and sprite combo. Who tf do you think you are?\"\n\nIt was right. I'm a fraud. I've never deviated.\n\nBut then I remembered, I saw a post on this sub a few days ago about the motion of pumping up and down and squeezing, so you know what? Lets try.\n\n5 solid minutes of sweating, squeezing and worrying yielded fruit.\n\nIt just popped out.\n\nI am a god.\n\nLike, literally, god.\n\nIt took me a solid 2 minutes to come to,  I was just applying pressure to stop the bleeding and staring into space.\n\nDad would be proud. This is why I worked so hard; all those late nights, shit food and missed socials was worth it.\n\nThis is why we do it.\n\nI pulled myself together, flushed the toilet, then went back to surgery.",
    "score": 499,
    "url": "https://reddit.com/r/Dentistry/comments/1ios54b/so_there_i_was/",
    "created_at": "2025-02-13T20:04:41.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1k9ak55",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "PSA: Guys it’s not worth it",
    "text": "If you are an aspiring dental student, don’t pay over 450k to become a dentist- it’s not worth it. Everything is different but the max I’d say is reasonable is 390k (unless you have military/NHSC scholarship)",
    "score": 450,
    "url": "https://reddit.com/r/Dentistry/comments/1k9ak55/psa_guys_its_not_worth_it/",
    "created_at": "2025-04-27T18:16:28.000Z",
    "num_comments": 281
  },
  {
    "id": "reddit-1iwtxak",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "Fuck Benco, Patterson, and Schein. Alternatives welcome",
    "text": "Yeah that's right. They got busted for colluding to fix prices, look it up yourself. \n\nIf you work for them, fuck you. \nIf you message me defending them, fuck you.\n\nIf there are companies to avoid let a fellow tooth mechanic know.  \n\nTrios is overrated.\nNobel is garbage.\n\nSome new owners and I do our best to find affordable alternatives for supplies, e.g. synergy/darby/net32/frontier/safco but we can always learn more...\n\nHow do people feel about a shared file where people can input where they get X supplies for Y price and how they felt about it? Can include the cost per unit, etc. Would it save us time scouring said platforms for the best bang for buck deal? \n\n\n**edit: holy shit i had a busy day and did not see this. If anyone's already started on the doc, send me a link and I'll paste it here!**\n\n\n**edit2: once we get this doc going maybe we'll come for the insurance companies. Fuck the insurance companies.**\n\n**edit3: upvote this for visibility!**\n\n**edit4: u/Careful-Bad-5477 made https://dentalsupplyprices.streamlit.app/ for us! Check it out, let's make it a thing**",
    "score": 431,
    "url": "https://reddit.com/r/Dentistry/comments/1iwtxak/fuck_benco_patterson_and_schein_alternatives/",
    "created_at": "2025-02-24T04:44:00.000Z",
    "num_comments": 122
  },
  {
    "id": "reddit-1iru249",
    "subreddit": "Dentistry",
    "soc_codes": [
      "29-1021"
    ],
    "title": "[Rant] I feel like Dentists are like Witchers",
    "text": "I recently started to play a game called \"The Witcher 3\". In that game, there is a profession called a \"Witcher\" who go through a lot of training (and torture) in order to be strong enough to fight monsters. They go from town to town helping people with their local monster problem. But here's the thing: everybody hates them. They keep saying bad things about them until they need to hire one. And then they make it a big deal that the Witcher asks for any amount of money for their work. \n\nI was just thinking, \"damn, we dentists have everybody bad mouth us all the time, and also people can get offended when we ask to get paid too\". \n\n(Also, I only started playing the game so I don't know if the analogy breaks down later in the game)",
    "score": 369,
    "url": "https://reddit.com/r/Dentistry/comments/1iru249/rant_i_feel_like_dentists_are_like_witchers/",
    "created_at": "2025-02-17T20:34:15.000Z",
    "num_comments": 69
  }
]