[
  {
    "id": "reddit-1nrho7w",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "This is possibly tone deaf but I just wanted to celebrate a win",
    "text": "So, I am a new grad. But I just locked in an offer to make $96,844 annually for a full-time inpatient role with comprehensive medical benefits, dental, vision, HSA, 401k and pension. \n\nAnd I literally cried because I genuinely never thought I'd get something like that in my career ever. \n\n  \nAnd, as a side note, I genuinely believe unions are the ANSWER to our fields compensation woes. \n\n  \nAnyways, just feeling really fucking happy and grateful and wanted to spread some good news because I know we only hear bad news alot in our profession. Had to celebrate",
    "score": 344,
    "url": "https://reddit.com/r/dietetics/comments/1nrho7w/this_is_possibly_tone_deaf_but_i_just_wanted_to/",
    "created_at": "2025-09-27T00:37:10.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1inuvyy",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "RD Coalition and Petition for Change Against the CDR and Academy",
    "text": "Hi everyone, it’s clear from some of the threads on this subreddit today that a significant number of us are fed up with the inadequate representation the CDR and academy provide. I know many of us feel defeated and unclear on where to start with advocacy. Myself and a couple other RDs are looking to start a coalition of like minded dietitians who are interested in this cause. If you yourself are interested in joining please comment below and I will happily add you our workgroup. Something’s we are interested in pursuing: \n\n1. Defining our objectives for change. Which are areas of concern in other profession are most important to address and unify our message. \n2. Curate a survey for RDs to contribute their voices! We want to know the top concerns and statistics from other dietitians to strengthen our case. \n3. Begin an online petition through change.org to rally numbers behind our signatures and gain public and professional support \n4. Draft a formal letter outlining our concerns and proposed solutions directly to the Academy and CDR. \n\nThese are just a few concepts to many floating ideas we have. Feel free to DM me with an email that would work for a Google sharing doc. I ask for your patience as I start adding people and am only moderately tech savvy. Remember, we are valued in the healthcare profession. We ARE the nutriton experts that have put our hard earned time and money into this field we once were so passionate about. We must not accept complacency, change starts with action. If you know any other RDs not on reddit who would be interested in this work, please send them this post! The more traction we get the better, there is power in numbers. \n\nEDIT: excited about the amount of traction this is getting, I will begin adding people once my workday is complete, so I ask for some patience in the meantime! \n\nUPDATE: I am overwhelmed and so grateful for the number of you that have agreed to participate and have messaged me on this thread and through DMs. The survey is live: https://forms.gle/gBYf3nimhcBfKzRa6\n\nUPDATE: a huge thank you to everyone who has taken the time to complete this survey! The survey will close this Saturday 2/22 evening at 8:00pm CST, from there we will begin reviewing all the information given to us and reach out accordingly! ",
    "score": 299,
    "url": "https://reddit.com/r/dietetics/comments/1inuvyy/rd_coalition_and_petition_for_change_against_the/",
    "created_at": "2025-02-12T16:27:56.000Z",
    "num_comments": 168
  },
  {
    "id": "reddit-1j94xtz",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I passed!",
    "text": "After 6.5 years of higher education I'm happy to say I passed my RD exam!!! This is such a strange feeling, I never thought I'd see the day. It was all worth it now that I can make 50k a year and have people tell me seed oils give you cancer 🫶🏻\n\nBut seriously, super excited to start my career as a Dietitian :) ",
    "score": 298,
    "url": "https://reddit.com/r/dietetics/comments/1j94xtz/i_passed/",
    "created_at": "2025-03-11T23:27:42.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1l9jjes",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "If I have one more patient with A1C &gt;10 who is drinking a ton of soda tell me that “diet soda is way worse for you then regular” I’m going to scream.",
    "text": "I’m sorry, Bob, but your uncontrolled diabetes is going to take you out way before the potential risk of aspartame consumption. Have you ever heard of relative risk?? Clearly you haven’t. But that’s fine, just keep drinking &gt;64oz of regular coke per day with your 12.9 A1c, because at least your aren’t drinking diet. You are the picture of health. \n\n*insert caveat about how I would never actually say that and I of course provide education and motivational interviewing around behavior changes etc* ",
    "score": 270,
    "url": "https://reddit.com/r/dietetics/comments/1l9jjes/if_i_have_one_more_patient_with_a1c_10_who_is/",
    "created_at": "2025-06-12T10:58:44.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1inswmr",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "CDR just gave themselves a multimillion dollar raise, while RD salaries remain stagnant.",
    "text": "Based on registry statistics on the CDR website, there are 113,067 RDs. Therefore, CDR is currently collecting (from RD annual registration maintenance fees alone), over $7.9m, and this will increase to $10.2m over the next two years. What is that additional $2.3m going towards? And I didn’t even factor in DTR fees, exam fees, and fees for board certification. We need to ask ourselves, does an organization like this, which has not advocated for us one bit, really need over 10 million dollars to operate?\n\nI’m lucky to have finally landed a role in healthcare that is not in dietetics. However, because of this, I will be paying for the maintenance fee out of pocket for the first time in a while. And I question whether it is really even worth maintaining at this point. \n\nI feel for those that need to get a masters degree just to have a seat at the table. A table that will forever demand more of you while you struggle to make it work. Seven years of being a dietitian, and I’m still feeling the financial implications of returning to school and choosing this career path. I didn’t need a masters degree, but I was still required to obtain another bachelors, in addition to paying for an internship. \n\nMany RDs talk about the career without concern about money. Those individuals have living expenses that are subsidized by a family member, or they are perfectly fine living a very modest life. For me, I feel that all of the sacrifice should at least allow someone to pay down student loan debt in a timely manner, and maybe afford a modest vacation every few years, or a car that is reliable to get to work, or the ability to save enough to buy a home one day.\n\nYou can’t support more than your basic living expenses on an average dietitian salary, yet the cost of maintaining the dietitian credential is rising. Make it make sense. ",
    "score": 262,
    "url": "https://reddit.com/r/dietetics/comments/1inswmr/cdr_just_gave_themselves_a_multimillion_dollar/",
    "created_at": "2025-02-12T15:05:53.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1ksttnk",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Do NOT Apply at Humana",
    "text": "This is a PSA! Do NOT apply for the Humana position. I left this position about a year ago along with half the dietitian team (6 dietitians…. lol yes). This is a highly micromanaged position that requires you to be at your computer at all hours of your shift clicking or typing. Yes, they track you if you don’t click or type and go over each of your minutes at a weekly meeting to discuss why you weren’t typing or clicking for 2 minutes on Tuesday. They don’t want you pre charting and give you little time to chart in between your calls. The people you talk to don’t want to talk to you and you are often yelled at or used as a therapist. These are COLD CALLS not appointments because there is no scheduling system for the dietitians. The dietitians are expected to do the same tasks as the care managers (nurses) yet their pay is 20k less. Pay for the dietitian position starts at 53k with a max of 71k. The care managers start at 72k up to 97k. \n\nPlease reach out if you have more questions. idk if it’s okay that I am doing this so I may delete if I think I’ll get in trouble in some capacity. ",
    "score": 237,
    "url": "https://reddit.com/r/dietetics/comments/1ksttnk/do_not_apply_at_humana/",
    "created_at": "2025-05-22T15:38:04.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1klyg28",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Please stop taking low paid RD jobs",
    "text": "RD's (USA based as I can't speak to international RD's too many variables) please understand your worth. I still see people are offered and taking jobs that offer $30 USD per hour or less. (I know waiters in average restaurants nothing fancy that clear this very easily). Nothing wrong with being a waiter but as an RD with a Masters level education will spend a lifetime paying off those student loans at $30/hour and always feel under-appreciated and under-utilized for their knowledge. However, please do go for the job interview, but do not accept the job if it does not pay adequate for your years of experience and PLEASE DO tell them the pay is too low for your level of education/experience. By doing this it will help the profession, if we unite and turn down jobs with low pay.  Accepting this low pay is hurting the profession.\n\nAlso always ask if it is a W2 or 1099 and with or without benefits. This will make a huge difference in what is an acceptable pay range. Check out the federal governments pay scale for RD's (google it)this is a good payscale to begin your negotiations. It i a W2 with great benefits.\n\nA brand new RD should be around $35 an hour/W2 with benefits. Experienced 10 + years, ICU NICU etc.  with additional expertise (CNSC etc.) never less than $45/W2 with benefits.\n\nIf you are a contractor on a 1099 no benefits the extra taxes will hit hard, so nothing less than $75/hour as a starting pay. $85-100 is more appropriate for your skills. Compare yourself to SLP, OT pay not the pay of RD's from the 1990's. ",
    "score": 189,
    "url": "https://reddit.com/r/dietetics/comments/1klyg28/please_stop_taking_low_paid_rd_jobs/",
    "created_at": "2025-05-13T21:47:14.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1nrb2sw",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Update from my post yesterday about the insulting job offer",
    "text": "I applied to a cardiac rehab educator position at another hospital after turning down yesterday’s offer. \n\nThis is the text I received from the recruiter: \n\n\n“I have you scheduled for a phone interview however I noticed on your application that you are seeking a rate of pay $37 per hour. I had a rough rate quote done and based on your licensure and experience the highest we would be able to offer if an offer was extended to you would be $27 per hour. I wanted to make you aware in case you dont want to proceed in the interview process for Dietitian positions.”\n\nand this is what I replied with: \n\n“Hi, I will no longer be proceeding with this interview if that is what my pay would be. As someone with a masters degree, 4 years experience, and leadership experience, that rate is extremely low and quite frankly insulting. With masters degrees being the minimum degree required for dietitians now, pay should be no less than $35/hr. I urge you and your team to deeply consider raising your rates. Thank you for your time.”\n\n\nI’m so SICK of these horrendous salary offers. Guess I’m gonna tough it out in renal. I know I have a kushy job with lots of freedom but I am so burnt out and done with our upper management being so numbers focused and not caring about patient care. ",
    "score": 186,
    "url": "https://reddit.com/r/dietetics/comments/1nrb2sw/update_from_my_post_yesterday_about_the_insulting/",
    "created_at": "2025-09-26T19:49:29.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1jcp0qa",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "One thing about being a dietitian- A lot of people think they know more than you!",
    "text": "Ugh!!! I work in an outpatient bariatric setting. At my team meeting last week, my team (surgeons, psychologists, nurses, etc) were all bashing inpatient dietitians for caring more about feeding pts than weight loss. COME. ON. That is not appropriate in an acute care setting. I was SO frustrated just sitting there while they rant about stuff they do not understand, not letting me get a word in. \n\nAgain, UGH!!!!\n\nSorry, just needed to get it out. I’m sure many of you deal with similar situations. \n\n",
    "score": 174,
    "url": "https://reddit.com/r/dietetics/comments/1jcp0qa/one_thing_about_being_a_dietitian_a_lot_of_people/",
    "created_at": "2025-03-16T16:15:37.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1m1piyx",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I hate to say this…",
    "text": "I just need a safe space to vent this…\n\nI’ve been a dietitian for 25 years and I feel like I’m at the point that if I could go back in time and talk to my younger self, I would talk me out of pursuing a career in this field. I can’t remember a point in history where I’ve honestly felt more devalued as a dietitian. It seems to me that the general public barely recognizes us as nutrition experts anymore. Couple this with the fact that the pay is absolute crap compared to other health professions, and it’s made my life choices feel regrettable. Just curious if anyone else feels similar sentiments?",
    "score": 166,
    "url": "https://reddit.com/r/dietetics/comments/1m1piyx/i_hate_to_say_this/",
    "created_at": "2025-07-16T21:44:21.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1imadjd",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Back to basics crash course",
    "text": "I am considering holding a series of crash course presentations to my fellow clinical RDs, where I review some absorption/metabolism concepts and relate them to our practical recommendations.\n\nFor example, a refresher on thiamin absorption/metabolism, and the reason we recommend supplementation for etoh abuse pts, bariatric pts.\n\nI am thinking of this given the assumption that a lot of dietitians (including myself) tend to forget those sciency basics, and just recommend different interventions based on standard guidelines.\n\nDo you think this is a good idea? Is my assumption that most RDs are forgetting those basics correct?\n\nPlease let me know if you have any refined ideas.",
    "score": 159,
    "url": "https://reddit.com/r/dietetics/comments/1imadjd/back_to_basics_crash_course/",
    "created_at": "2025-02-10T16:38:10.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1iskqxl",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "RD exam is an insulting measure of competence",
    "text": "I took the exam last week and did not pass. That exam was incredibly disrespectful to the amount of work we have done to get not only a bachelor's degree but a master's along with 1000 hours of internships. There were barely any clinical questions and we are supposed to be able to define a single correct term from things like the \"FOCUS\" model which uses one different word in the definition of the word which can be three other answers. And there's 10 other \"models\" we're supposed to know. I understand you're supposed to pick the \"best\" answer. But no one will be using these when actually practicing. The practice exams are a joke and no where near what the actual exam is like. For the academy to write these exams and think they are adequate in assessing competence is incredibly disrespectful and frustrating. We are not trying to become project managers. We are supposed to be clinicians. I understand some go into food service but even most of those questions are ridiculous. Half of the domains just feel like busy work they decided to add in because they couldn't think of enough content to make up the exam. There should be some type of review process for this exam because it is a joke. I may sound salty because I didn't pass but for having to spend $225 to take the exam on top of everything else we have to pay for is insulting. ",
    "score": 158,
    "url": "https://reddit.com/r/dietetics/comments/1iskqxl/rd_exam_is_an_insulting_measure_of_competence/",
    "created_at": "2025-02-18T19:08:32.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1jpehrp",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Inpatient dietetics feels more like data entry? I feel like it misses the point!",
    "text": "Posting this here because I don't know any RDs in real life who seem to feel the same way. In the big picture, a patient comes in, is malnourished, and we need to find a way to provide nutrition for the patient. But I feel like some of our policies kind of miss this big picture. \n\nA lot of what we do is busy work but I think some dietitians see it as really important! Like calculating estimated requirements for everyone we see, regardless of if they are on nutrition support or not. What does it matter if I know their requirements? We never do anything with them unless they are on nutrition support. Also documenting certain labs. Besides refeeding labs and monitoring hydration status, if a lab is out of range there is nothing I can about it. And medications - besides a select few, none of these \"nutritionally relevant\" medications impacts my actual plan. I feel like I work in data entry, not clinical dietetics, rewriting all of the information in the patient's chart into my note. I have noticed some other AHPs just document what they did with the patient. They don't have to go around copying and pasting all of these silly things.\n\nAnother thing that I find annoying is malnutrition diagnoses. These are just a way to give the hospital more money, and I know that they supposedly prove our worth to the hospital, but in terms of the patient actually being helped, I don't feel that this does much for them. We would be giving them an Ensure and encouraging them to eat anyway. I also notice a lot of dietitians forcing a malnutrition diagnosis. If I found out that my hospital bill was bigger because some dietitian saw a 5% weight loss in a month prior to coming in that could be explained away by some difference in scales or an estimated weight, I'd be so annoyed! I have also noticed on some NFPEs that people are finding malnutrition where there isn't any. For example, I am a very well nourished healthy young person, but my eyes have always had dark circles and have been somewhat hollow. I am sure I could be diagnosed with malnutrition by some of these overzealous dietitians!\n\nAnother example is how we chart on patients - someone might see 15 patients and remotely review a lot of those, while another might see 10 patients and have meaningful conversations with those patients, taking into account flavor preferences etc. But I feel like in our world, quantity is valued over quality. It seems like some people value being productive on paper more than actually making a difference. \n\nI feel like we have reached a point where we think more words on a screen equals better care, but I actually think it just makes the job more tedious. And I find it so frustrating that other RDs seem to think that words on a screen matter so much when nobody looks at our notes anyway!! \n\nWith all that said, if anyone has a job recommendation for me outside of inpatient dietetics, I'm all ears haha",
    "score": 158,
    "url": "https://reddit.com/r/dietetics/comments/1jpehrp/inpatient_dietetics_feels_more_like_data_entry_i/",
    "created_at": "2025-04-02T02:49:27.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1lwipn8",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Please no one apply to this job",
    "text": "Requirements: Certified Diabetes Educator (CDE) – Endocrinology Practice\n\nBachelor's degree in Education, Health Sciences, or a related field; advanced degree preferred.\nCertification in Diabetes Education\nExperience in health coaching or patient education within a healthcare setting.\nStrong knowledge of physiology and endocrine systems.\nExcellent communication skills, both verbal and written.\nAbility to assess patient needs and develop effective educational strategies.\nIf you are passionate about empowering patients through education and want to make a meaningful impact in their lives, we invite you to apply today to join our dedicated team at Houston Thyroid and Endocrine Specialists PLLC!\n\nJob Types: Full-time, Part-time\n\nPay: $20.00 - $25.00 per hour\n\nWe should all stop applying to jobs below the average salary for RDs unless you're a first year RD, don't do it!! The pay is absurd and a mockery of our hard work. ",
    "score": 156,
    "url": "https://reddit.com/r/dietetics/comments/1lwipn8/please_no_one_apply_to_this_job/",
    "created_at": "2025-07-10T17:29:12.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1pp31fi",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Please don't accept these 1099 jobs at $40/hr",
    "text": "I remember when contract work was $60-80/hr. There's a reason for this, no benefits, you often don't get paid driving time, communication time, or charting time.\n\nTelehealth is similar, you only get paid for face to face time. Often no benefits. It's typically a 1099 so you get taxed more than a W2, and any seasoned RD should be making at least $40/hr at a full-time full benefits job to begin with. If your telehealth company is only offering $40/hr, you're actually making something more like $29/hr after charting and doing other time consuming activities like sending emails, or writing school absence notes etc. \n\nWe have to keep pushing back on our pay. It's going down not up (anecdotal)! Telehealth should at the very least be $50/hr and that's the LOWEST end. Insurance companies pay around $200/hr for us, sometimes less at $80 per visit, but still. These telehealth companies are pushing out the RD entrepreneurs because they contract with insurance companies. So when an RD entrepreneur wants to start her own business doing Telehealth when she goes to sign up with insurance companies she's denied saying they have too many RDS in that area already.  In the long-term Telehealth companies will eventually have a monopoly on RD out patient coaching (in the sense that they are encouraging patients to only select from their contracted RDs).\n\nSo for goodness sake, if they are going to monopolize on us, they can at least pay us a reasonable wage! \n\n(Rant over).",
    "score": 151,
    "url": "https://reddit.com/r/dietetics/comments/1pp31fi/please_dont_accept_these_1099_jobs_at_40hr/",
    "created_at": "2025-12-17T17:49:04.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1p91dj8",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I can’t help but to feel triggered/upset when someone tries to educate me on nutrition",
    "text": "I just endured an hour long appointment with this woman in her 60s who insisted I needed to “learn real nutrition”. She requested to see me because she states obesity has ruined and continues to ruin her life. Her BMI is 50. \n\nOur conversation started off fine. She then became tearful when discussing her weight and how she was inspired to follow this extremely restrictive &lt;30g carbohydrate per day diet she heard someone talk about on social media many years ago. She spent nearly 20 minutes educating me on how amazing this diet was and how it can cure obesity and diabetes and how government guidelines are just out to harm people. \n\nI listened to her explain and she would say things like, “you may know what an amino acid is, I don’t know, but that’s why your body needs. Not all this sugar. Based on your body I know without a doubt you don’t have a gram of carbohydrate in your diet.”\n\nThere is something about when people somehow think I’m not an actual expert in this field that stings. I know I shouldn’t have an ego about this and I never would let it show. But I then feel that regretful conflict of my own weight bias when someone with a BMI of 50 is educating me on an arbitrary fad diet they saw on Facebook. \n\nOur appointment was her talking, crying, and saying how obesity ruins everything and if she could just muster the discipline to eat &lt;30g carbohydrate per day she would be thin. \n\nAfter about 40 minutes I was mentally fogged. I saw her as a victim in of diet culture, years of disordered eating, and our food culture making a healthy lifestyle for most people nearly impossible. She was so thankful I just listened. She didn’t ask for advice, guidance, my opinion. She just wanted someone to listen. And she thanked me and that concluded it. \n\nThis field is DIFFICULT. Is it true like 1/2 of RDs have histories of disordered eating themselves? I couldn’t imagine an RD with a history enduring conversations like that. It just isn’t healthy! How do psychiatrists do their job?!\n\nForgive me, I just really needed to get this off my chest. Maybe I’m more like her than I realized. I just needed to vent. ",
    "score": 151,
    "url": "https://reddit.com/r/dietetics/comments/1p91dj8/i_cant_help_but_to_feel_triggeredupset_when/",
    "created_at": "2025-11-28T17:55:41.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1jdrt7z",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Just an Appreciation Post",
    "text": "I love Dietitian's. You know so much more than others think you do. You are so qualified. You are so needed. You are essential!!! You deserve more praise, more recognition, more love, more happiness, fulfilment, more money! Its always nurses, RT's PT's, Social workers etc. getting the spotlight, but never us. It's time for a change. The world needs us and we need to show them that! We need to be proud of who we are and the path it took us to get here. Remember that you are the head, not the tail. Wishing you all the best! ❤️",
    "score": 144,
    "url": "https://reddit.com/r/dietetics/comments/1jdrt7z/just_an_appreciation_post/",
    "created_at": "2025-03-18T00:00:21.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1j09x2l",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I love my job!!",
    "text": "Sometimes, you see disheartening posts about being a dietitian on here, so I wanted to share some highlights. I’m an outpatient dietitian specializing in weight management and a CDCES, and I love my job!\n\nI love connecting people with resources they didn’t realize were options. I love seeing that Aha! moment when something finally clicks. I love watching a patient walk in looking irritated that they’re even here—only to leave motivated, smiling, and equipped with actionable steps. I love talking about food all day, introducing people to new recipes, and hearing how their whole family loves them.\n\nI also love the options we have in this field. Oh, I hate inpatient? Let me check out outpatient. Outpatient isn’t the vibe? Let me try sales. Want to change how we treat? Let’s jump into research. My program sucks? Maybe I’ll move into program management. There’s always another door to open.\n\nI’ve had many jobs over the years, but being a dietitian is by far the best one.\n\nAnyway, happy Friday!",
    "score": 143,
    "url": "https://reddit.com/r/dietetics/comments/1j09x2l/i_love_my_job/",
    "created_at": "2025-02-28T15:13:25.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1i22s74",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "$48k per year is an insult!!",
    "text": "Saw a job posting recently where they are looking for a Sports Dietitian (CSSD) with 3-5 years experience, ISAK level 1 certification and a masters degree working with Olympic Athletes for $40-$48k per year!!! Are they insane???? What in the world is that? Just a flat out insult and slap in the face to our profession! Oh and not to mention this was in CALIFORNIA!!! \\*\\*\\*insert shocked emoji here\\*\\*\\*\\*",
    "score": 130,
    "url": "https://reddit.com/r/dietetics/comments/1i22s74/48k_per_year_is_an_insult/",
    "created_at": "2025-01-15T17:32:34.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1jvd92z",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Required Credentials: RDN, Master's Degree. Hourly pay: $27/hour.",
    "text": "The hiring manager seemed flabbergasted when I told her that for the experience and education they were looking for, that pay was simply too low.\n\nDespicable.",
    "score": 128,
    "url": "https://reddit.com/r/dietetics/comments/1jvd92z/required_credentials_rdn_masters_degree_hourly/",
    "created_at": "2025-04-09T18:38:37.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1kfrwwt",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I think I'm done.",
    "text": "Done with fighting against the business of healthcare\n\nDone with fighting weight stigma \n\nDone with dealing with misinformation with my patients and doctors\n\nDone feeling like I constantly have to hold some line of evidence-based information and empathy.\n\nDon't want to do private practice \n\nDone with watching the system fail miserably for the most vulnerable \n\nI feel oddly at peace. But also, not sure. Maybe this is a phase.\n\nEdit: tips for moving on welcome. It's dramatic but it feels like letting go of an important relationship I put a lot of effort in to.",
    "score": 126,
    "url": "https://reddit.com/r/dietetics/comments/1kfrwwt/i_think_im_done/",
    "created_at": "2025-05-06T00:50:43.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1kpz89b",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I hate the word dietary",
    "text": "I hate when people call me dietary. Some people at work asked me why do you hate being called dietary and honestly I can’t even put a good reason to it. I just hate it. I don’t like the word sounds. Does anyone feel this way?",
    "score": 124,
    "url": "https://reddit.com/r/dietetics/comments/1kpz89b/i_hate_the_word_dietary/",
    "created_at": "2025-05-19T00:55:31.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1isfmhe",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Call to Action",
    "text": "RD Coalition and Petition for Change\n\nSIGN FORM AT BOTTOM 👇\n\nREPOSTING from a fellow RD on my LinkedIn:\n\n🚨 CALL TO ACTION: DIETITIANS, IT'S TIME TO SPEAK UP! 🚨\nCDR is failing dietitians. They are out of touch with the realities of patient care and the challenges we face. We have relentlessly voiced our concerns—yet they continue to raise fees, impose barriers, and make our profession less accessible and more expensive while failing to secure higher pay or better working conditions.\n\n🔹 Masters Degree Requirement (2024) – Raising barriers but not our salaries.\n\n 🔹 RD Exam Costs &amp; Declining Pass Rates – Instead of fixing the problem, they bundle retake fees.\n\n 🔹 Annual Fees Increasing (2025 &amp; 2027) – More money for CDR, but no benefits for us. Where is the money going???\n\n 🔹 CEUs &amp; Licensing Fees – Expensive, burdensome, and favoring AND-affiliated programs, not independent RDs. \n\n 🔹 Lack of Support for Non-Traditional Career Paths – Private practice, functional nutrition, and telehealth RDNs are left behind. START ADVOCATING FOR US!\n\n💬 WE ARE MAD. Dietitians deserve better. CDR and AND must be held accountable. We need transparency, fair wages, and real solutions—not bureaucracy and fee hikes.\n\nI hope change happens soon cause I did not sign-up to work for peanuts the rest of my life. \n🔥 Join the conversation. Share your experiences. Demand change. Comment below ⬇️ or tag a fellow dietitian who feels the same! #DietitiansDeserveBetter #CDRReform #RDNsSpeakOut\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSfe_OV2qDVCAFFbP9kDb-xRw95o0vPjaCpKP3EV8HicAAVflQ/viewform?pli=1&amp;pli=1\n\n\nIf you are able to participate, share on social media/groups/co-workers, aid in connecting RD organizers to advocacy resources, PLEASE fill out and share this Google Doc as you are able. Thank you all!!\n",
    "score": 124,
    "url": "https://reddit.com/r/dietetics/comments/1isfmhe/call_to_action/",
    "created_at": "2025-02-18T15:44:22.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1muld2f",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Hot take: obesity isn’t the problem; it’s a side effect.",
    "text": "I’ve been thinking a lot about how we talk about obesity in our field. The AMA labeled obesity a disease back in 2013, but honestly, the more I look at the research and my own experience, the more I feel like obesity is more of a side effect or outcome than a disease in itself.\n\nHere’s why:\n\t•\tWeight loss/gain isn’t something you can do. It’s not a behavior or action.\n\t•\tThe behaviors are things like balanced nutrition, physical activity, stress management, and sleep.\n\t•\tThose behaviors drive health outcomes, and often weight changes as a byproduct.\n\nThis lines up with the social determinants of health model too. Factors like income, food access, stress, and education play a massive role in health and weight (BMJ, 2018). It makes more sense to me to target what’s actionable rather than focusing on weight as the primary outcome.\n\nFor example, weight-centered interventions often fail long-term and weight loss is rarely sustained (Am J Public Health, 2013). But behavior-centered approaches like Health at Every Size consistently show improvements in blood pressure, cholesterol, insulin sensitivity, and mental health, even without weight loss (Nutrition Journal, 2014).\n\nAnd I’ll add a personal layer here: by BMI, I’m considered obese. But I exercise, eat about as well as most “healthy” people (definitely not perfectly), and I don’t have any comorbidities or health issues aside from anxiety. To me, that highlights how BMI/weight alone is a pretty blunt instrument for measuring health.\n\nSo I’m curious how others here frame it with patients:\n\t•\tDo you lean into the “obesity as a disease” model for the sake of access/insurance, or do you position it more as a downstream effect of lifestyle and environment?\n\t•\tHow do you talk about it in a way that’s both actionable and not stigmatizing?\n",
    "score": 123,
    "url": "https://reddit.com/r/dietetics/comments/1muld2f/hot_take_obesity_isnt_the_problem_its_a_side/",
    "created_at": "2025-08-19T15:17:22.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1nudfu1",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I DID IT!!",
    "text": "hi all! i’ve posted a couple times over the last year or so about trying to figure out how to get out of dietetics. I love nutrition and have actually really loved the role ive been in the last two years but the ROI just is not there and we’ve all got bills to pay. I just landed a job with a major medical device company as a product trainer and I couldn’t be more excited!!\n\nthere’s actually no real point to this post, just wanted to share my success! to anyone looking to get out - it’s possible! ",
    "score": 120,
    "url": "https://reddit.com/r/dietetics/comments/1nudfu1/i_did_it/",
    "created_at": "2025-09-30T13:37:40.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1nqatn0",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Just received an absolute insulting offer",
    "text": "So I applied for a CNM position at a local hospital. Salary range was $60-96k. I’m currently in renal and region lead RD and do a LOT at my clinic. The hospital called and said they wanted to start me as a clinical dietitian first and work my way up to a supervisor position bc they wanted someone with more experience. Which I understand. Pay is $28.50. I currently make $35.7 in renal. I told them the only way I would take this job was if they could match or exceed my current pay and they said not possible. So I turned it down. THEN I get a text from dietitians on demand telling me there’s a 3mo travel position available there for $44/hr. Like WHAT. Idk. I’m just so frustrated and flabbergasted with these low ball offers. They told me they were having trouble filling rd positions at this hospital and shit no wonder they are when they’re paying less than $30/hr. Ugh. Just needed to vent. ",
    "score": 119,
    "url": "https://reddit.com/r/dietetics/comments/1nqatn0/just_received_an_absolute_insulting_offer/",
    "created_at": "2025-09-25T16:06:19.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1prm7js",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Know 👏 Your 👏 Worth 👏",
    "text": "Just need to vent: I had a recruiter reach out to me on LinkedIn for a remote 1099 job and the pay was abysmal… like lower than what my full-time job (WITH BENEFITS) pays hourly! Not to mention 1099 positions are taxed at a higher rate so it was even more insulting.\n\nThis was my response:\n\n“Hi \\[recruiter\\],\n\nThanks for reaching out! I looked at the job posting and unfortunately the hourly rate is quite a bit lower than expected for someone with a graduate degree, specialized credentials, and 8+ years of experience, especially for a 1099 position. I wish you luck in your search for a candidate!\n\nTake care,\n\n\\[one pissed-off RD\\]”\n\nI’m counting this as advocating for our profession lol",
    "score": 117,
    "url": "https://reddit.com/r/dietetics/comments/1prm7js/know_your_worth/",
    "created_at": "2025-12-20T19:14:12.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1iyity3",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Vent: RD R******can Acquaintances",
    "text": "I'm more than angry with RD acquaintances of mine that are actually \"proud\" of having supported the R\\*\\*\\*\\*\\*\\*can party in this last e\\*\\*\\*\\*ion (we live in a tossup state). What baffles me is that these are RD acquaintances that have jobs that are at least partially funded by Medicare, Medicaid, and/or research grants; my job is heavily funded by Medicare and Medicaid :/.\n\nEdit: To the MAGA people in this thread, does talking about cuts to public insurance make you feel uncomfortable? Like how people that will be kicked off Medicaid will feel when they have to go without regular healthcare and access to medications? Or how uncomfortable people will be when ambulances will have to travel farther because critical access hospitals will have closed d/t cuts to Medicare and Medicaid? Or how uncomfortable you'll be when you lose your job because there's less Medicare and Medicaid funding (if your payer mix skews Medicare and Medicaid)? ",
    "score": 117,
    "url": "https://reddit.com/r/dietetics/comments/1iyity3/vent_rd_rcan_acquaintances/",
    "created_at": "2025-02-26T08:22:22.000Z",
    "num_comments": 111
  },
  {
    "id": "reddit-1i0ukw8",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "This is such an insult to our career",
    "text": "I can't believe they are putting $10-$12/hr starting ranges. I wish AND would have some form of standards so this would be laughed at. Honestly if you need a masters, I can't believe there are positions starting under $30/hr...\n\n\nOk, for some reason, I can't attach my screenshot but Nutrisense (remote) and Foodsense  (WI) have ranges of pay off $10-$40/hr and $12-$48. I hope you Interns know that most of us RDs think it's insane you don't get paid during internship but it is what it is... But please do not start working for less than $20K/year... That is so unacceptable!! \n\nHow do we remedy this for our field? What an insult! I don't have any trust in AND and try to have as little to do with them as possible, but if anyone had other suggestions I'm open!",
    "score": 112,
    "url": "https://reddit.com/r/dietetics/comments/1i0ukw8/this_is_such_an_insult_to_our_career/",
    "created_at": "2025-01-14T01:31:12.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1k4lib4",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Anybody watching the Academy's Strategic Plan webinar??",
    "text": "The president is SO MAD that people are asking how they plan to advocate for higher salaries with the Master's degree. She is so frustrated we would dare bring it up, and gave a non-answer to the many questions being levied.\n\nI'm losing so much faith in CDR/ACEND/AND, I was hoping this webinar would illuminate some core functions but it's all corporate buzzwords and empty promises. I'm tired.",
    "score": 109,
    "url": "https://reddit.com/r/dietetics/comments/1k4lib4/anybody_watching_the_academys_strategic_plan/",
    "created_at": "2025-04-21T18:58:31.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1mk7x3i",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Can we start an insulting job position posting thread ??",
    "text": "Where we just post insulting jobs with insane salary ranges. I’ll start. And yes it does say RD required.\n\nMoms Meals - Health Educator - Remote\n$26.60 -35$\n\nLocation: Remote/ San Diego, California\n\nThey can’t provide “medically tailored meals” without dietitians, but they think we are worth 26.60$ an hour. \n\n—————-\n\nEdit:\n\nAI says that 26.60$ is about 55k a year. After taxes in CA that leaves you with about 3150$ a month take home.\n\nThe average two bedroom in San Diego according to AI is 2872$. But say you and your roommate **** yes I’ve added a roommate because we don’t deserve to live in our own studio as a dietitian *** found one for 2500$.\n\nSo 1250$ + utilities 150$\nCar insurance $150\nPhone bill - 50$ \nAccording to the usda (according to AI) a single person at minimum can expect to pay 300$ on groceries per month in San Diego. \n\nSo then you maybe have ~310$ left per week for: gasoline, a car payment, college loans, gym, any health insurance you have to cover (which if this job doesn’t offer benefits a silver plan is like $315-350$/ month before dental and vision for a plan w/o a 8k deductible), any savings you may wish to put away for retirement. \n\nAnd please keep in mind, I think my numbers are fairly conservative… most people per wk likely have a lot less than 300$ after paying for their necessities.",
    "score": 79,
    "url": "https://reddit.com/r/dietetics/comments/1mk7x3i/can_we_start_an_insulting_job_position_posting/",
    "created_at": "2025-08-07T18:27:15.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1k4lplt",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "AND's fail of a Webinar?",
    "text": "Anyone else just get done watching the live Webinar from AND today? I am extremely disappointed by their lack of responses regarding support for RDs and the future of our field. This was a pretty sad excuse for a webinar, as they blatantly insulted current RDs, gave absolutely no answers regarding rising costs for membership, and incompetently answered concerns regarding pay with \"we know it's an issue, we said RDs are underpaid!\" Clearly, the AND is not here to support dietitians or the future for our career. With questions they didn't want to answer, they stated that was for ASCEND or CDR to answer, but never stated HOW we could get those questions answered. Seems like we will continue to see lack of support for increased wages despite the AND increasing dues and increasing cost of education to be an RD, coupled with increasing inflation and already uncertain future of health care in general.... \n\nETA: this is not a discussion post regarding the masters requirement and whether we agree or don’t agree with it. That argument continues to be kicked around. I get it. It’s here to stay. This discussion is about the lack of support from the Academy concerning pay despite multiple factors increasing the cost of the dietetics profession both short and long term. ",
    "score": 79,
    "url": "https://reddit.com/r/dietetics/comments/1k4lplt/ands_fail_of_a_webinar/",
    "created_at": "2025-04-21T19:06:18.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1jm6m2r",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Space dietitians?",
    "text": "Just wondering if anyone else shares a love for all things space exploration? I saw a few articles online even one from NASA that mentioned how dietitians play an important role managing the astronauts nutritional needs during training, while on their missions, and recovering when home. I have been trying to research job opportunities in this field ( NASA career website wasn’t helpful either) and I haven’t been successful. I understand this might be a very niche dream job, but I would love for anyone to share some advice on what would be the best next step in getting experience for this “population/scope “",
    "score": 79,
    "url": "https://reddit.com/r/dietetics/comments/1jm6m2r/space_dietitians/",
    "created_at": "2025-03-28T21:48:35.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1mobaqr",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I feel numb. I think I made the worst career choice of my life.",
    "text": "\nI’ve been an RD for almost 3 years, working in LTC. Lately, I can’t shake the feeling that I don’t belong in this field at all.\n\nI constantly feel dumb when it comes to medical terminology. Everyone around me is like a walking encyclopedia, and I’m still looking things up daily. I know learning never stops in this profession, but it’s exhausting to feel like you’re always two steps behind. Being a “type A” seems like a requirement, and that’s just… not me.\n\nIt hurts because I spent years in school, sacrificed so much, and yet I don’t feel prepared or confident in my job. In my area, the only real options for RDs are LTC or clinical, and I’m burned out on both.\n\nOn top of that, there’s the constant pressure to make the nursing department “look good” — even when they aren’t providing supplements or residents are losing weight. It feels like I’m being asked to cover up problems instead of actually helping people.\n\nI feel trapped and like I’ve wasted my education. I don’t know where to go from here.",
    "score": 77,
    "url": "https://reddit.com/r/dietetics/comments/1mobaqr/i_feel_numb_i_think_i_made_the_worst_career/",
    "created_at": "2025-08-12T15:08:27.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1n7wm1e",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Does ANYONE here like their job😩",
    "text": "I understand that this site is often used to rant, but I feel like this specific sub is super negative. I see the pay as a point of frustration for a lot of of you, which I understand, but I feel like salary is not really a surprise going into this profession. I don’t feel like the pay is even that far off from other medical professionals like nurses, and I’ve never heard so many nurses encourage students to not become nurses, like the way the dietitians in this group encourage people not to become dietitians. Everyone has frustrations with their job, but I find it sad that so many people in this group wish they’d never became a dietitian/warn other people not to. ",
    "score": 71,
    "url": "https://reddit.com/r/dietetics/comments/1n7wm1e/does_anyone_here_like_their_job/",
    "created_at": "2025-09-04T01:07:10.000Z",
    "num_comments": 111
  },
  {
    "id": "reddit-1n4zjv6",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "A Rant- Just Indulge Me",
    "text": "Does anyone else who has been in dietetics for a while have an occasional crash out over how little we are paid for what we do? I find myself spiraling at times and looking into other careers because I have to work 2 jobs just to make a halfway decent salary. Why is someone with 2 degrees and almost 20 years of experience going through this? I hate it here. I saw someone else say they should’ve made nutrition their passion and not their career and honestly, like, SAME. That’s the post, thanks for listening 😭",
    "score": 70,
    "url": "https://reddit.com/r/dietetics/comments/1n4zjv6/a_rant_just_indulge_me/",
    "created_at": "2025-08-31T16:44:53.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1knga6b",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Frustrated being a dietitian and nutrition field",
    "text": "I changed my career to become a dietitian (I'm 31 now), ended up working for a hospital for 2 years then opened up a virtual private practice. I hate it. I've lost my passion for it. Everyone (non-RD's) thinks they know better about nutrition and everyone online is willing to pay for unqualified people versus us. \n\n  \nI'm struggling to find purpose as it was my dream to become an RD. \n\n  \nIs anyone else struggling with the same thing? Did you switch careers again and leave the nutrition field? ",
    "score": 66,
    "url": "https://reddit.com/r/dietetics/comments/1knga6b/frustrated_being_a_dietitian_and_nutrition_field/",
    "created_at": "2025-05-15T18:58:10.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1lk8q94",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "What other job titles should I be looking for to get out of patient care",
    "text": "Don't wanna be an RD anymore. Shocker right? Who has escaped and what job helped you get out? I've been considering being a retail manager, business office manager, Healthcare office manager, medical coding? (I know I would need to take classes on that) so anything that can get close to an RD salary but isn't being an RD. I'm down really bad and need help. ",
    "score": 60,
    "url": "https://reddit.com/r/dietetics/comments/1lk8q94/what_other_job_titles_should_i_be_looking_for_to/",
    "created_at": "2025-06-25T15:29:14.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1ixnpjq",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "being an RD is exhausting",
    "text": "i’ve been a dietitian for about two years and i was an icu RD for 1.5 years and then transitioned to outpatient about 6-8 months ago. \n\nwe were short staffed at my first job and i was charting on anywhere from 10-20 patients daily. super long hours and on call. i was so stressed out. \n\nthen i moved and got a new job as an outpatient private practice RD — my “dream job” and honestly im just as stressed and burnt out. i am finding myself working such long hours creating meal plans or worrying about possible client questions or comments. people are also so rude and combative lately. i am so utterly exhausted everyday im at a loss. some weeks are better than others and there are upsides to my job —- like doing fun presentations sometimes or being able to set my own hours, etc. but i am feeling tired on all the patient care and counseling aspect of my job. it is making me second guess my career choice. i am confused because i thought i was made for this but idk if i am. i think i would like it better if i worked part time \n\nhow do you all find work life balance? or if you transitioned out of private practice what do you do now! ",
    "score": 59,
    "url": "https://reddit.com/r/dietetics/comments/1ixnpjq/being_an_rd_is_exhausting/",
    "created_at": "2025-02-25T05:33:29.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1ma2ehc",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Lying about your job?",
    "text": "Can anyone give me suggestions on a fake career I can tell random people when we meet? Every time I say dietitian people want advice. I’m 6 years in and I’m tired of it lol. ",
    "score": 55,
    "url": "https://reddit.com/r/dietetics/comments/1ma2ehc/lying_about_your_job/",
    "created_at": "2025-07-26T19:44:08.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1n56ujc",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Can I be mean for a sec? Rant",
    "text": "Okay I need to vent and am open to feedback on if I’m the asshole or not. Now that’s it’s back to school time, my social media is being flooded with videos of teachers. Inevitably someone is talking (complaining) about how poorly teachers get paid. I live in the NorthEast where a teachers salary can range from 45-80K depending on a variety of factors. Is it just me or is that VERY comparable to what the majority of RDs make? Also very comparable to what Social Workers make?\n\nI understand teaching is difficult in a different way than nutrition or social work but last time I checked, RDs don’t get summers, every weekend and every holiday off? \n\nI had this convo with a friend who is a teacher and her argument was that teachers often work outside of contract hours… warranting the summers off. But I was like “???”. I am salary at a large academic medical center and often work outside of my contract hours too lol plus rotate every 4th weekend, plus duke it out with my co workers on who gets off for Christmas. \n\nI’m not trying to pit professionals against each other but it’s just annoying that teachers get to complain and it feels like we can are just suppose to be grateful. Maybe I’m just regretting that if I was going to get paid so poorly, I didn’t pick a profession with summers off. Oooof. ",
    "score": 53,
    "url": "https://reddit.com/r/dietetics/comments/1n56ujc/can_i_be_mean_for_a_sec_rant/",
    "created_at": "2025-08-31T21:37:04.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1n8lzrl",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Any career ideas (RD or otherwise) for someone who loves nutrition but doesn't want to talk to people?",
    "text": "I’ve worked in both **sales** and **nutrition counseling**, and while I’ve learned a lot, I’ve found both to be *draining, repetitive, and honestly kind of boring*. I love health and nutrition - but I think it's more of a personal passion. \n\nI went into counseling knowing it'd be another stepping stone and not permanent, but given that most people aren’t willing to take the necessary steps to get healthy - and that success rates are incredibly low - it's not fulfilling, has grown old quickly &amp; doesn’t feel like a good use of my time.\n\nInterestingly, the **healthiest I ever was** personally (mentally and physically) was before I became an RD. At the time, my job was low-stress and didn’t require constant output or emotional labor. (This was \\~15 years ago, and that job probably doesn't even exist anymore due to AI.)\n\nI’d love to hear from others who have:\n\n* **Pivoted away from counseling or patient-facing roles**\n* Found jobs (in or out of the field) that are **independent, quiet, creative, or analytical**\n* Created something of their own (product, content, program, etc.)\n* Or even realized the field just wasn’t for them anymore and made peace with that \n\nNot looking for a silver bullet - just genuinely curious how others have navigated this. Would love to hear your story or any ideas you might have 🙏\n\nOne last observation.. many of the sickest clients I work with - burnt out, obese, over-medicated, dealing with autoimmune conditions, etc - are in healthcare themselves: therapists, nurses, OTs, MDs, etc. It’s not a coincidence and makes me even less interested in staying in the field.",
    "score": 47,
    "url": "https://reddit.com/r/dietetics/comments/1n8lzrl/any_career_ideas_rd_or_otherwise_for_someone_who/",
    "created_at": "2025-09-04T20:57:35.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1hrf7ns",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Feeling hopeless about finances - any high earning opportunities for RDs?",
    "text": "Lately I've been feeling very hopeless about my financial outlook/earning potential as an RD. I'm 5 years into this career, and really do love my job. I work in a niche clinical area (inpatient currently, but could do outpatient as well) that gives me a lot of personal satisfaction. I earn close to 90K/year and have great benefits. This is more money than I've ever made, but I'm in an extremely high cost of living area and have significant student loans from grad school. I feel like I am basically living paycheck to paycheck, and have acquired a lot of credit card debt. My partner is in academia and makes a little less than I do. We don't have children and generally don't live outside of our means, but rents have absolutely skyrocketed and the price of everything is up with inflation. I have thought about doing private clients on the side with a service like Nourish or Fay, but I work really long hours already and need to have some semblance of a personal life. We are also considering moving to a less expensive area (southeast), however, I have looked up RD salaries in that region and looks like I would have to take a significant pay cut, so not sure how helpful that would be.\n\nI'm wondering if there are any outside of the box career options for RDs that may have a higher earning potential (&gt; $100k)? I'm not interested in food service or management at this point because I do love working with patients. I honestly feel like most of the RDs making the big bucks are instagram influencers and that doesn't seem feasible.\n\nAlso - I'm already a career changer so please don't suggest going back to school for something else. Sorry for the depressing tone of this post, just hoping to gain some advice here. Thanks in advance and happy new year at all.\n\n  \n\\*Edited for typos ",
    "score": 46,
    "url": "https://reddit.com/r/dietetics/comments/1hrf7ns/feeling_hopeless_about_finances_any_high_earning/",
    "created_at": "2025-01-01T23:06:39.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1ie0ktn",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "New RD coworker who wants to change EVERYTHING is exhausting",
    "text": "I have a new RD coworker (she’s been here 7 months, graduated and became an RD in June). I know we all have different clinical experiences, which is the whole part of dietetics is having different ways of thinking and clinical judgement. She thinks everything we all do is just wrong. She’s trying to implement new policies and do XYZ. We are salary and she usually works AT LEAST 12 hour days (idk why that bothers me but it does; probably because she is young and I don’t want her to burn out). I’m a newer RD myself, but I have so many dietetics experiences that now I’m more inclined to put my 8 hours in and go home, not going above and beyond like she is. I know her DI was a lot different than what she is doing now and we do things differently here. I’m amendable to change, but I feel like changing too much and once is why she’s getting so much push back. She complains to the CNM when people don’t diagnose something the way she would or when she doesn’t agree with a policy we have but the hospital she did her DI did. \n\nIt’s honestly just exhausting have someone brand new to the field constantly criticize me and tell me they don’t agree with XYZ that I did. I can back up why I did it, but it’s honestly not worth it to me to justify my clinical judgement to her. I’m not in court. \n\nI’ve tried to talk to her and tell her the rest of the team pushes back because she’s trying to do so much at once but she doesn’t listen. We have weekly meetings as a team and she always has something to add about what she thinks we should be improving on/changing. \n\nIt’s exhausting. \n\nWhat do you guys do in this situation? ",
    "score": 46,
    "url": "https://reddit.com/r/dietetics/comments/1ie0ktn/new_rd_coworker_who_wants_to_change_everything_is/",
    "created_at": "2025-01-30T23:16:32.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1ivqgl7",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "I want to be a dietitian but I’m hearing it sucks",
    "text": "My husband makes a good living 78k yearly and I’m working in getting my bachelors and going go for the masters in dietetics. Im very passionate about it, my son had a lot food intolerance and i have seen so many mom dying to talk to dietitians that actually listen and are informative. Reading reddit im getting a little nervous about everyone hating this career, I’m thinking of just going to medical school. The thing is i like how a dietitian career can be flexible, and because my husband is going well and his salary is just going up I’m ok with a lower pay. \n\nMedical school seems so long, and we want to grow our family, I want two more kids. So flexible is important to me and i don’t really like nursing. People of reddit please give me your advice, i do truly love nutrition and helping people, but will i hate my job in 10 years, should i just raise my kids and when they’re older go to medical school or will i be too old for that. I’m 27 rn 🤷🏻‍♀️ \n\n\n\nEDIT: thank you guys I’m gonna go for it all the way, :) thank you for giving back my spark 🔥 \n\nEdit: damn you guys are making me rethink this again ughh",
    "score": 45,
    "url": "https://reddit.com/r/dietetics/comments/1ivqgl7/i_want_to_be_a_dietitian_but_im_hearing_it_sucks/",
    "created_at": "2025-02-22T19:11:15.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1m85qmk",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Anyone quit dietetics successfully?",
    "text": "Hi friends. I’ve been an RD for 5 years and I’m kind of over it. 😢\n\nRan my own practice for 4 and now I’ve been doing outpatient nutrition counseling for 1 year and honestly cannot see myself doing this for another few years. I’m just tired of talking about food and health and sitting in an office with no windows for 8 hours a day. \n\nHas anyone left dietetics to go into a more creative field? I’ve always been a creative person but definitely studied nutrition because of my old disordered eating habits. Now that I am in a healthy place with my relationship with food I’m just so over it. I miss Making YouTube videos for fun and being a creative person, but I just cannot figure out what a career move would look like going from a science and healthcare field to something more creative like marketing? Just wondering if anyone else has left this field and does anything they find fulfilling and enjoyable.\n\nYesterday I had an OB/GYN appointment and I was laughing to myself about how I was excited to have a speculum up my Vijay if that meant I wasn’t at work 🥲🙃Now that’s just SAD! \n\nHonestly, my actual office life is great. I have great benefits, a great schedule, and great coworkers. Decent pay (67k). I definitely wouldn’t leave this type of job with this flexibility unless I knew what I had lined up could be better for me and more fulfilling. \n",
    "score": 45,
    "url": "https://reddit.com/r/dietetics/comments/1m85qmk/anyone_quit_dietetics_successfully/",
    "created_at": "2025-07-24T14:21:58.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1ox4wsn",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Discussion for HAES/Weight-inclusive RDs",
    "text": "I am not in private practice but I have the ability to decide what kinds of patient I will or will not see. I do not see weight management folks but they still slip through and get put on my schedule though so I end up seeing them occasionally.\n\nRecently, I have become very aware of the impact seeing these patients has on me. It feels dramatic but I have such a noticeable funk after seeing a weight management patient that just cannot let go of the idea that they have to lose weight in order to be healthy. My patient today is in her mid 80s walking everywhere, on 2 meds, not even near max dose, and she is so sad she cannot get wegovy. So sad my response was to tell her that there is nothing wrong or that needs fixing with her body. That if anything losing weight would put her at greater risk of losing the independence she currently has.\n\nI see combating weight stigma as a big part of my job and helping to heal trauma from the impacts of that stigma. But I am becoming more and more aware that I have accumulated my own trauma in doing this work, in being forced to inflict this harm at other points in my career when I knew it was wrong but did not have the words or confidence to stand up to it. At being disrespected by other providers for not going along with their harmful treatment plans.\n\nTyping this out felt kind of chathartic so my hope is that as weight inclusive RDs in a very very weight stigmatizing and fat phobic society we can take a moment to acknowledge our own strength and the wounds we've accumulated working in this space. I think you all are great.",
    "score": 45,
    "url": "https://reddit.com/r/dietetics/comments/1ox4wsn/discussion_for_haesweightinclusive_rds/",
    "created_at": "2025-11-14T18:45:57.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1p9955m",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "How many of you regret being dietitians?",
    "text": "I’m currently a junior in undergrad majoring in dietetics and after reading how much people hate it on here and the more I think about it I’m not sure this is a path I want to pursue. Looking at grad school and dietitian’s salaries and it doesn’t seem super enticing. But how many of you actually dislike being a dietitian? Do the few bad patients make it not worth it? Are most patients bad patients? For those of you who do like it, why do you like it? I unfortunately can’t change my major as I can’t push back my graduation for financial reasons so I’m trying to figure out what I want to do.",
    "score": 42,
    "url": "https://reddit.com/r/dietetics/comments/1p9955m/how_many_of_you_regret_being_dietitians/",
    "created_at": "2025-11-28T23:15:16.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1lqztbf",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Who here has ever worked for a SNAP-Ed program in their career?",
    "text": "Before I got my RD I worked in a SNAP-Ed funded position providing nutrition education to children. It is heartbreaking to see SNAP-Ed completely eliminated by the current administration in the USA. ",
    "score": 41,
    "url": "https://reddit.com/r/dietetics/comments/1lqztbf/who_here_has_ever_worked_for_a_snaped_program_in/",
    "created_at": "2025-07-03T20:20:54.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1m1h0r1",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Am I crazy? Salaries even lower than a few months ago...",
    "text": "I am currently a 1099 RD, own my own business and just contract with different counties, etc. I've been doing it for 13 years and with the BBB and other state budget issues, it seems like there's a real potential for me to see a huge decrease in contracts and may not be available all together in 2026. I am credentialed with insurance, but occasionally will look at jobs because it's hard to be contract and private practice, etc. Anyways, I started looking more seriously and I just saw a Clinical RD II position at a nearby for $28/hr, WTF?! Looking into LTC contracts and they are like $34/hr...It seems like a few months ago the lowest I was looking at for a Clinical II was closer to $35-$40....\n\nI started looking at enteral sales and even those seem much lower that usual. 3 years ago I applied and was offered close to $95K and the same position is starting at $65K....I feel like there are a lot of posts about this, but it seriously feels drastic. Are they just anticipating a huge influx of RD's applying because all the community RD's are at risk? Would love some thoughts? Recommendations?",
    "score": 39,
    "url": "https://reddit.com/r/dietetics/comments/1m1h0r1/am_i_crazy_salaries_even_lower_than_a_few_months/",
    "created_at": "2025-07-16T16:20:52.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1juj39a",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Salary offer for new job insulting - rant",
    "text": "I have been working in LTC for the past 2.5 years and have desperately been trying to find something that I enjoy that doesn't overwork me like this company has (don't even get me started on the sexual harassment from CNAs *and* residents, the administrator who expects unpaid nutrition advice, and the $330/month health insurance that doesn't cover shit).\n\nI started at 65k in 2022 and after two raises I am at 70k, which I've been told from others here is still low for HCOL in LTC. I have 5 years of experience as an RD. My first role was WIC nutritionist (35k) and outpatient peds (63k) was second before I switched here. I have been proud of myself for gradually bringing up my salary. When I realized I needed to leave this job, my needs I think were reasonable: 1) full time role, 2) 70k salary, and that's it... but that has proven truly a challenge. For reference, I work downtown in a HCOL major city and have my masters.\n\nI finally found a role that I not only am so excited about the work, but I jived with the team, and during our first interview the nutrition coordinator and chief medical officer promised me 70k was absolutely doable. I wish I would have gotten this in writing somehow. The job listing range is 60-80k, so I thought it was completely reasonable. I went through the second interview and they offered me the job over email a few days later and told me to watch out for the HR offer letter.\n\nWell, I received it last night, and it was for 66k. I immediately talked to the nutrition coordinator who assured me it must be a mistake from HR and she would advocate for me. She told me this morning HR is pushing back. I honestly am so disheartened- I have worked so hard these past 5 years to work up to a reasonable salary. Mind you, this new role is WIC Coordinator, where I would be head of 6 WIC offices downtown with 27 nutritionist direct reports. I know WIC may pay less, but, come on.\n\nNobody goes into dietetics thinking it's going to make you a millionaire, we go into it with a passion for helping people. I so desperately wish we didn't have to fight to pay our bills. $4k a year is the difference between paying my student loans or not. I am considering accepting the offer if they won't budge, just to get out of this hellhole and working PRN somewhere else to make up the difference... but I don't want to burn out again. The market here is abysmal for RD jobs. Anyway...end rant.",
    "score": 39,
    "url": "https://reddit.com/r/dietetics/comments/1juj39a/salary_offer_for_new_job_insulting_rant/",
    "created_at": "2025-04-08T17:21:12.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1l3dqve",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "RD salary is making me second guess my career choice",
    "text": "I’m about to apply to either get my ms in nutrition or pivot and go into nursing. I enjoy nutrition but it’s disheartening to see the low salary and job options compared to nursing. I don’t know what to do… \n\nI could get my online ms in human nutrition from university of Alabama for $12.8k, or get my bs in nursing from Elmhurst college for $50k. I feel like I have a lot more options in nursing but it’s going to be a longer, more expensive, and more arduous road. \n\nI’m a single mom already in my 40s, and I am confused on what to do. This is my last $50k. I do not like my current job, and I don’t see myself succeeding or moving up in my current career. What would you do?",
    "score": 37,
    "url": "https://reddit.com/r/dietetics/comments/1l3dqve/rd_salary_is_making_me_second_guess_my_career/",
    "created_at": "2025-06-04T18:52:43.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1hwb7z4",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Feeling defeated ",
    "text": "I posted here recently after asking for a raise and the conversation had gone very well….\n\n…well there has been another change in management (3rd in 22 months) and I was told that even though I am doing all of the responsibilities of a lead dietitian, because of imaginary KPIs that were never established, and not having a full patient load on a service line that’s barely a year old, I will not be getting a raise. \n\nThey have also decided they are going to take all flexibility out of my schedule and micromanage all of my hours. \n\nThis is after I just onboarded for a 16hr a week 1 year remote contract position which has already loaded up my schedule on my nights and weekends. \n\nI currently make 70k and have a test scheduled for my CSOWM on 2/1. I was told by my new manager I’m no longer allowed to study during company time 🙃. After passing, I will get reimbursed for the test and be eligible for a 5-10% raise but after today I’ve already applied to 3 new positions. \n\nMy manager (who isn’t even an RD) is so hyper focused on making me a pRoDuCtIvE pRoViDeR and the bottom line (LOL cuz my dietitian salary is making such a huge dent). I feel like I’m being totally dismissed and gaslit. \n\nI plan to fight one more time for my raise, and if I am denied, I plan to tell them to respectfully fuck off every time I’m asked to do anything outside of the job description of “dietitian” and ride it out til I can find another job. I can work up to 24 hours with this remote position but it’s not quite enough to meet financial needs. ",
    "score": 32,
    "url": "https://reddit.com/r/dietetics/comments/1hwb7z4/feeling_defeated/",
    "created_at": "2025-01-08T04:17:57.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1k9gx9q",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Do you think there will be salary increases?",
    "text": "\nI might become a dietitian within 2-3 years. I also plan on having a specialty like diabetes educator, maybe do cdces or another specialty that’s lucrative (lmk if you know of a better one, lol). I do want to work in a clinical setting but eventually do my own private practice. Possibly work in academia in the far future. I’m feeling a bit bummed out with the masters requirement and terrible salary. I’m trying to hold on to some hope, though. Do you think we’ll be seeing any salary increases soon? ",
    "score": 23,
    "url": "https://reddit.com/r/dietetics/comments/1k9gx9q/do_you_think_there_will_be_salary_increases/",
    "created_at": "2025-04-27T22:56:13.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1oez3el",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "20k underpaid and I'm over it.",
    "text": "RDN here with 15 years of experience. I took a somewhat flexible job at a community clinic when I had kids a few years ago.  Last year, the organization discontinued raises.  My salary is 57k/year.  I love the job's flexibility for my family's wellbeing, but I'm feeling more depressed as my buying power gets lower. This organization doesnt value my (anyone's) experience. ",
    "score": 22,
    "url": "https://reddit.com/r/dietetics/comments/1oez3el/20k_underpaid_and_im_over_it/",
    "created_at": "2025-10-24T14:22:57.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1k2dglg",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Presents for preceptors",
    "text": "I, and the rest of the interns, were told by a manager who is also a preceptor that gifts are expected for the preceptors at the end of the year. Is this really a social norm? From an etiquette standpoint I find it incredibly off-putting to request gifts. Additionally, we don't have income? For my DI I know that preceptors are paid in addition to their salaries, and for clinical preceptors they are incentivized with a stipend to use on education and other means. The concept is bizarre to me, I didn't provide professors with gifts in my undergrad or master's program. I'm paying a lot of money to attend this DI and that I'm expected to provide these instructors with a gift because they are doing their jobs is wild to me.",
    "score": 21,
    "url": "https://reddit.com/r/dietetics/comments/1k2dglg/presents_for_preceptors/",
    "created_at": "2025-04-18T19:31:20.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1irpfg5",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "Is there a chance of having a decent paying dietitian job that is not stressful?",
    "text": "I have been a dietitian for a little over 10 years, and the last years I have been working in management. I am drained and exhausted from dealing with difficult people, upper management that doesn’t care, being at the low end of a manager salary, and most of all, taking time from my family because I am constantly working. I’ve been even considering a change of career. I don’t know if I am tired of my job or tired of being a dietitian. I do know for sure that I am disappointed about the current status of our profession in many aspects. Anyone else feeling the same way? ",
    "score": 20,
    "url": "https://reddit.com/r/dietetics/comments/1irpfg5/is_there_a_chance_of_having_a_decent_paying/",
    "created_at": "2025-02-17T17:32:39.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1hunoyi",
    "subreddit": "dietetics",
    "soc_codes": [
      "29-1031"
    ],
    "title": "So many RD jobs...do we need some DTRs to help?",
    "text": "I always thought I wanted to see a robust job market for RDs. But right now, at least in my area (middle Tennessee), there are so many jobs that many places are understaffed and jobs are just perpetually open for months, even with signing bonuses. I suppose this can lead to higher salaries at some point but right now, it's very difficult for a lot of RDs that are working in understaffed locations. I see DTR job descriptions in policy handbooks all the time but no one ever has job openings for them. I'm started to think about pitching my job on trying to find a DTR instead of an RD and maybe they would be more successful but then I'm not sure they would be able to do a lot in a clinical setting without an RD on site that day. Does anyone utilize DTRs in acute hospitals successfully?",
    "score": 19,
    "url": "https://reddit.com/r/dietetics/comments/1hunoyi/so_many_rd_jobsdo_we_need_some_dtrs_to_help/",
    "created_at": "2025-01-06T01:50:26.000Z",
    "num_comments": 19
  }
]