[
  {
    "id": "reddit-1jpb4pw",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "The 504 entitlement is f***ing unreal",
    "text": "During an annual meeting for an absurdly long ADHD 504, this mother voiced concern over her daughter being behind in class since she misses so much school for cheerleading. “I don’t want my kids lives just to be school and no fun, you know? But we need some resources from y’all that explain the work she’s missed and show her how to do each step.” MA’AM…do you mean a f****ing teacher?? Is this just my building or is this bullshit normal? \n\nEdit- I’ll go ahead and clarify that I am in no way opposed to 504s for students that need them. My son is autistic and has a 504. What I’m opposed to are parents whose children do not need them taking advantage of the accommodations 504s offer. Or parents asking for absurd accommodations that have absolutely nothing to do with a disability. By these parents abusing the 504s, they diminish the original purpose which is to level the field for students who are disabled. Hell, we just need to be able to say no to these parents sometimes and not get backlash from admin and ex ed. \n\nThis blew up way more than I thought it would. I see a lot of angry parents on here saying either it’s not our place to determine what kids need or that they are having a hard time getting accommodations for their kids. There is a lot of misunderstanding here about what a school counselor is licensed to do and what 504s provide. I would encourage those parents to calmly and respectfully reach out to their school counselors and ask these questions. I’m a rando on Reddit so I’m not going to sit here and tell you what or how your particular counselors should be doing things. Every staff member, school, and district is different in terms of procedure and policy. I will say this- we are counselors because we want to support and advocate for your kids, so you being disrespectful, demanding and judgmental towards us is counterproductive. It is very hard to work with parents who won’t be a team player with us. You may not like the answer you get, but I guarantee you are doing yourself and your children no favors by pitching a fit and demanding things that are designed to support students with disabilities. ",
    "score": 1404,
    "url": "https://reddit.com/r/schoolcounseling/comments/1jpb4pw/the_504_entitlement_is_fing_unreal/",
    "created_at": "2025-04-02T00:12:15.000Z",
    "num_comments": 378
  },
  {
    "id": "reddit-1k4uj2l",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Ideas for a kid who smells like animal urine",
    "text": "Hi all - any ideas on how to approach this? I have a student that smells like cat urine. It’s starting to become a problem as students are bullying them… I tried to approach the conversation by asking about animals in the house etc. they don’t seem like they are aware of the smell. The parents don’t smell like that when they came to the school building for a different reason. Any insight? ",
    "score": 522,
    "url": "https://reddit.com/r/schoolcounseling/comments/1k4uj2l/ideas_for_a_kid_who_smells_like_animal_urine/",
    "created_at": "2025-04-22T01:35:50.000Z",
    "num_comments": 191
  },
  {
    "id": "reddit-1ns2uz7",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "A student slapped me across the face",
    "text": "Yesterday a 1st grade student slapped me across the face, hard enough to leave a mark on my face. This was because I told him he had to leave the library and walk to lunch where the rest of his class was. After giving a series of choices, I told him the final option was “We can either walk together or I will have to call Mrs. [Assistant Principal]”. When I reached for my phone, he jumped on my arms, clawed at my hands, tried ripping my phone away from me, and then slapped me hard across the face. This was the second time this student has attacked me. The first time it happened, the child was restrained by a SPED teacher (who is trained to do so) who was then reprimanded since the student does not have an IEP.\n\nThe student was sent home for the day. There was no office referral filed. He was not formally suspended. Just sent home with 2.5 hours left in the day. My AP “came to check on me” afterwards. I lied and said I was fine.\n\nThe child’s mother wants to know “what we are doing to her child to make him act like this” and demands to see the cameras. \n\nWhen I tell you I nearly left my keys on my desk and walked out for good, I really mean it. We enable children to behave like this and punish educators for not just taking it.\n\nIf this happened to you at your school, what would your admin response have been? What would your response be?",
    "score": 343,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ns2uz7/a_student_slapped_me_across_the_face/",
    "created_at": "2025-09-27T18:41:33.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1iztxj9",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Student disclosed illegal activity",
    "text": "Hi ya’ll. I am pretty troubled by a recent situation that happened. I am a counselor and I work at an alternative school. So basically one of my underage students disclosed that they sent pornography that was violent and illegal in nature to another underage child online. I spoke to my supervisor about the disclosure and they recommended to call the police. \n\nFast forward two days and the parents called a meeting with school district liaisons, school directors, etc. The parents said that I was lying about the situation and their child painted a different story. They berated and yelled at me the whole meeting and now do not want me to interact with their child at all. Leadership agreed that I did the right thing but didn’t defend me at all and caved to the parents wishes and suspended services. I am feeling completely betrayed, lost, and wondering if I really did the right thing in disclosing. This is my first job out of grad school and I just want to do what’s best for my kids but I have legal obligations as well. Hoping to hear kind words, advice, anything 🩷",
    "score": 304,
    "url": "https://reddit.com/r/schoolcounseling/comments/1iztxj9/student_disclosed_illegal_activity/",
    "created_at": "2025-02-27T23:38:56.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1jj64eh",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "College admissions - my tale of an amazing student who can't get accepted",
    "text": "I have an amazing student who has received 6 rejections for colleges and universities across the country. The student is 3rd in their class and has a 3.99  GPA. The student is from another country. Arrived in the 9th grade. Right off the bat while learning English was taking honors math and science classes. Now, at the end of their HS journey he will graduate with 11 APs under their belt. Very strong academically but is under documented. Their family was trafficked and now lives like indentured servants on a farm. The farmer gave them some bad advice about how they would take care of them and they didn't need to worry about renewing their visas and they listened. The student did not get questbridge and has since been rejected from 5 other private colleges and universities. They are still waiting on 3 schools to release decisions.  I'm starting to worry more and more. The only thing I can come up with is the colleges don't want the student to impact their potential attrition rate as the government is losing its mind. I getting so tired and worn down and my future is not on the line like others. \n\n*If it is something else please tell me. I'm not dumb enough to assume I can't make mistakes and I want to help my students in the best way possible. ",
    "score": 262,
    "url": "https://reddit.com/r/schoolcounseling/comments/1jj64eh/college_admissions_my_tale_of_an_amazing_student/",
    "created_at": "2025-03-25T00:01:48.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1k5pwb2",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Tough love",
    "text": "I’m about to wrap up my 9th year as a high school counselor in an alt school. I plan to work in this field for many more years but I’ve noticed a shift in my way of being with students. I’m sick of hearing them whine about their right to free, appropriate education that affords them an opportunity out of poverty. I have no patience for their excuses, poor attitudes, or apathy. Instead of gentle coaxing and endless amounts of encouragement, I’ve taken a much more firm approach with students who complain about the basic expectations of school. Now I just say “did you know that the two groups who represent the highest rates of poverty are hs drop outs and single mothers? Do you want to live in poverty?” They often look at me with horror and dejectedly say “no”. Then we move on and I don’t have to hear about it anymore :D My younger self wouldn’t have dared to be so direct but my current self is proud of my tough love approach. ",
    "score": 209,
    "url": "https://reddit.com/r/schoolcounseling/comments/1k5pwb2/tough_love/",
    "created_at": "2025-04-23T03:48:47.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1kn2lb4",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Student whose clothes smell like cat urine...advice",
    "text": "According to a teacher, there is a student whose clothes smell like cat urine. And I am not sure how to approach the parent about it. Our school has a washer and dryer. \n\nAny advice/tips?",
    "score": 191,
    "url": "https://reddit.com/r/schoolcounseling/comments/1kn2lb4/student_whose_clothes_smell_like_cat_urineadvice/",
    "created_at": "2025-05-15T07:50:42.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1m0s3an",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Disheartened at the News Today",
    "text": "I'm feeling so disheartened, not only at the Supreme Court's upholding of the deep Education Department cuts, but more so at the comments in news articles. It feels as if the general public is so against public educators. We are just people. I believe so deeply in public education, that every child in this country should have the right to a free, appropriate, quality education. Children deserve rights to appropriate accommodations. Teachers, support staff, and administration deserve livable wages. We deserve safe places to work. Quality and accessible public education is just as important to our civil liberty and protection as the 2nd amendment - isn't that the usual argument? Yet if you read the comments, we are villians, thieves, liberal extremists who should all be fired. I'm just so sad right now. ",
    "score": 184,
    "url": "https://reddit.com/r/schoolcounseling/comments/1m0s3an/disheartened_at_the_news_today/",
    "created_at": "2025-07-15T20:00:05.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1igf2i5",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "School shootings",
    "text": "Just need to say this, but the expectation that I lay my life down as an educator is absurd. I believe more educators need to speak out about this because otherwise this expectation becomes more normalized. My job duties are clearly outlined and dying in the line of duty is not one of them. I don’t consent. ",
    "score": 172,
    "url": "https://reddit.com/r/schoolcounseling/comments/1igf2i5/school_shootings/",
    "created_at": "2025-02-03T02:50:50.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1nd1sg5",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "I Lasted a Week as a School Counseling Intern… Here’s Why I Quit",
    "text": "Hey Reddit, I just need to vent. I lasted one week as a school counseling intern, and honestly, it was insane.\n\nI thought I was signing up for a paid internship with mentorship, like my previous unpaid ones at a middle school and a high school. Instead, I ended up running the entire counseling office on my own, full-time responsibilities, long hours, low pay ($20K for the whole year), and almost no support. My assigned supervisor was at another school, so I was basically alone, and I didn’t even have access to the files I needed from the counselor on maternity leave.\n\nThe principal tried to pressure me into staying, but it felt wrong from day one. I left everything organized for the next intern and strongly suggested they hire a real counselor or long-term substitute because this setup clearly doesn’t work. For context, the first intern before me quit after one day. I made it a full week, which felt like a small victory.\n\nThe silver lining: I’ve officially completed all my fieldwork hours. I took this paid internship to finish my remaining hours and hopefully open up future job opportunities once I get my credential. My official end date is in October, but I have enough sick and personal days to cover everything, so I’m technically done now. even though on paper it will show October. I’m leaving on my own terms and protecting my sanity.\n\nBrutally honest takeaway: set boundaries, know your worth, and don’t let anyone guilt you into staying in a situation that’s unethical or unsafe.\n",
    "score": 159,
    "url": "https://reddit.com/r/schoolcounseling/comments/1nd1sg5/i_lasted_a_week_as_a_school_counseling_intern/",
    "created_at": "2025-09-10T01:57:09.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1ihw0m4",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Is it national school counselor week if you aren’t crying in your office!?",
    "text": "Elementary school counselor here - just feeling so beat down and unappreciated. This job can feel so thankless. I know why I do it just a hard day! Sending love to everyone here - I know what you do!",
    "score": 158,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ihw0m4/is_it_national_school_counselor_week_if_you_arent/",
    "created_at": "2025-02-04T23:35:21.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1n6whzp",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "When did our job become all about behaviors?",
    "text": "5th year elementary counselor here and sometimes I wonder what our job actually is. I spend most of my time on behaviors or helping teachers implement things to help with behaviors. But honestly it’s really just me being overwhelmed by people thinking I should be able to solve all these behaviors with a group (that I have no time for due to all the behaviors). I know it’s a systems issue but does anyone feel like we are expected to have magical powers to fix behavior when they were never actually trained in behavior? What is our actual job? What are we supposed to be doing, working on? What’s our scope? What’s our lane? I honestly cannot remember anymore. ",
    "score": 146,
    "url": "https://reddit.com/r/schoolcounseling/comments/1n6whzp/when_did_our_job_become_all_about_behaviors/",
    "created_at": "2025-09-02T21:41:04.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1o6v8z3",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Do any of you feel…",
    "text": "like this job is basically helping kids find skills to cope with emotional and psychic damage caused by being forced to conform to an education system that is based on teaching everyone to ignore what their body and brain are telling them constantly? Get up before you’ve had enough rest, eat only at this time, sit here and listen, restroom only at this time, more sitting and listening to stuff you have no passion for, ok go home and go to bed before you’re ready so you can do it again tomorrow?! Like you’re just there to keep kids from having a normal reaction to all this absurdity? No, just me? K 🤯",
    "score": 141,
    "url": "https://reddit.com/r/schoolcounseling/comments/1o6v8z3/do_any_of_you_feel/",
    "created_at": "2025-10-14T23:26:45.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1n2qrz3",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Kids that won’t talk.",
    "text": "I enjoy working with the most difficult kids. This hangs in my room and I’ve never had real use for it until today. I got a kid that was completely sad, shut down, no eye contact &amp; wouldn’t talk at all. I saw him eyeing this and told him I’d guess how he’s feeling &amp; what happened. We played 20 questions &amp; I ruled out si/depression first. Y’all…by the time I got to the last one, I knew the whole entire story without him saying a single word, just using thumbs up. I self disclosed around the topic &amp; gave him an adult’s perspective. I even got smiles from him at the end! Of course my last question was, “raise your hand if you want me to shut up &amp; you hate this.” Today was a good day!",
    "score": 133,
    "url": "https://reddit.com/r/schoolcounseling/comments/1n2qrz3/kids_that_wont_talk/",
    "created_at": "2025-08-28T22:48:46.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1l8dltb",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "I got the job!",
    "text": "I applied to like 100 places and only got like 5 interviews. \n\nThe first two - I didn’t hear back from them. \n\nThe last three - I was offered a position from all of them! One from each of the education levels. I wanted the middle school one, and I got it. I’m super excited! ",
    "score": 109,
    "url": "https://reddit.com/r/schoolcounseling/comments/1l8dltb/i_got_the_job/",
    "created_at": "2025-06-10T23:20:49.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1kokexa",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "I let a 14 year old get to me today…",
    "text": "Like the title said, I let a 14 year old get under my skin today. I work at a middle school, and our behaviors are so bad sometimes us counselors have to step in. This girl disrespected me so much I almost quit. Wouldn’t listen, told me to shut up, cussed me out, and mocked me. I had to leave early I could not calm myself down. I don’t know how I am going to make it much longer in education. I love my job most of the time but these kids just keep getting worse and worse. And my admin is so overrun they don’t help. I’m glad I left cause I had to take care of myself, but dang these kids are something else I don’t even know what to do anymore. ",
    "score": 105,
    "url": "https://reddit.com/r/schoolcounseling/comments/1kokexa/i_let_a_14_year_old_get_to_me_today/",
    "created_at": "2025-05-17T04:21:18.000Z",
    "num_comments": 91
  },
  {
    "id": "reddit-1j58yf1",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Stop asking for support if you keep reinforcing the behavior.",
    "text": "1st grader doesn't want to go to school. Mom sits with him in the office every morning this week and student won't let her leave without him. Past few days I've had mom leave with him screaming and waited within in my office till he de-escalated and calm enough to go to class. \n\nTough part is im a trigger now so everytime he sees me he knows he's going to have to stay. What frustrates me was he eloped when I was mediating with two students and when I see him in the office to check on him he's on the phone with mom and a few moments later she's leaving with him and dancing with him to cheer him up. Later he's in the office because she's picking up older brother and he's in comfy pj's and happy cause he didn't have to go to school. I'm at the point that if I'm called to support him tomorrow, I kinda want to ignore it cause whatever I do or suggest to help is ignored.\n\nMom says there's no problems at home other than getting him to do school work. Behind academically but gets his work adjusted by his teacher to help him. Kids in his class give him no issues. A lot of what I see is behavior being reinforced at home. Dad works certain hours that makes him unavailable to take the kids to school.\n\nMy suggestion is mom practicing goodbyes with him as well as making him be more independent at home. The morning should be a quick goodbye with mom, let him tantrum and calm down then go to class. Id rather he miss an hour of class, not do work, but hear and see everything that's going on. Instead of being at home and miss everything.\n\nReinforcers and incentives haven't worked cause he's too focused on being with mom and the only time he has interest in reinforcers is when he's finally calm. ",
    "score": 105,
    "url": "https://reddit.com/r/schoolcounseling/comments/1j58yf1/stop_asking_for_support_if_you_keep_reinforcing/",
    "created_at": "2025-03-06T23:08:08.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1p2vbre",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "How’s everyone feeling with the recent news of our degrees?",
    "text": "Over the last couple of days I’ve seen more posts and information coming out about how “counseling and therapy degrees” will no longer be considered professional degrees which will impact loans but also lots of other things. I know it’s been scary times, but this feels significant. How’s everyone feeling? I didn’t see any forms about this and felt like a collective place to vent would be good. \n(Also, happy Friday if it’s Friday where you are reading this :) ",
    "score": 101,
    "url": "https://reddit.com/r/schoolcounseling/comments/1p2vbre/hows_everyone_feeling_with_the_recent_news_of_our/",
    "created_at": "2025-11-21T10:36:36.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1kthxt0",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "1st Year Counselors: WE DID IT",
    "text": "First year School Counselors: WE DID IT! We survived our first (full time?) year as a school counselor! 👏🏻👏🏻👏🏻👏🏻🎉🎉🍾🍾\n\nI’d love to hear about your year— your wins, your struggles, your questions, and most importantly— what you’re excited for this summer and going into year 2???\n\nsending so much love to all the practicing and future counselors here. It’s a hard time to be working in education, especially in the US. But I have to believe this work matters more now than ever. Keep your heads up! 🩷🩷🩷",
    "score": 98,
    "url": "https://reddit.com/r/schoolcounseling/comments/1kthxt0/1st_year_counselors_we_did_it/",
    "created_at": "2025-05-23T12:09:44.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1k07i79",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Does anyone else feel like…",
    "text": "we are fighting a losing battle with screens? Like screens are raising these babies up? I am in an elementary school, one counselor for about 350 kids. All day every day, kids needing support with basic kindness and social skills, like never before (year 7 for me). None of them are sleeping because they are on screens. Adults in the home either working to survive, too tired from working, or too absorbed in their own screen to make sure kids are sleeping/ have basic self care. wtf is happening?? It’s scary and I fight against falling into the same patterns with my own kid. Feeling discouraged.",
    "score": 94,
    "url": "https://reddit.com/r/schoolcounseling/comments/1k07i79/does_anyone_else_feel_like/",
    "created_at": "2025-04-16T00:29:20.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1ij43zq",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "My school forgot NSCW",
    "text": "That’s it. It feels kind of petty but it’s like forgetting my birthday. I’ve only worked there two years and they’ve forgotten both times. I’m the only counselor there so it’s not like I have a team to advocate with.",
    "score": 86,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ij43zq/my_school_forgot_nscw/",
    "created_at": "2025-02-06T14:43:50.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1idapza",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "I need to be honest",
    "text": "I have to get this out there. No one I know truly understands what school counselors do and go through, especially in a state with low pay and no unions. I work at an elementary school where test scores are truly the only thing that matter. If I sat here and listed all of my duties at my school of almost 700 kids where I’m the only counselor and 504 coordinator, I would be typing a novel. I like to think I’m a tough, positive, happy person. No matter what’s going on at school I always have a smile on my face and try to see the positive in things. Until today. A teacher approached me and demanded I tier a kid in the MTSS process for behavior (which is my job to manage all MTSS behavior kids) and she had no data to prove why I should do this. She argued with me and told me it needed to be done quickly. With no real reason. The child is very well behaved but gets distracted easily. \n\nANYWAY I went into my office and locked my door to take a minute. My name was immediately called on the radio to assist with behavior. I broke down. I just sobbed. I questioned what I’m doing. Why did I go to school and learn so many valuable things, just to work at a place where I am not valued nor appreciated. A place where my life philosophy does not align with the work I’m being told to do. \n\nThis is me venting. And I’m sorry if you read this far just to realize I’m venting. Im trying for a baby and plan to stay home after I give birth (hopefully in the next year) and don’t see the point in moving schools just to stop working shortly. \n\nThanks for listening. F",
    "score": 81,
    "url": "https://reddit.com/r/schoolcounseling/comments/1idapza/i_need_to_be_honest/",
    "created_at": "2025-01-30T01:33:26.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1ml2qyt",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "This was a bad career choice",
    "text": "Im on year 2 of no job post graduation and from the sound of things my experience is very common. The job is very rewarding despite all that comes with it but no one prepared me for the reality that it can take years to even get a job. Now I'm starting to wonder the amount of people that might literally never land a job in counseling. Its hard to think about all the time and money yhat went into getting to this point only to be not even contacted by the few job openings available.",
    "score": 81,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ml2qyt/this_was_a_bad_career_choice/",
    "created_at": "2025-08-08T18:17:03.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1j8wyxo",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "\"Student doesn't want to talk to you because they say you never help.\"",
    "text": "I don't know why teachers or staff feel the need to say this to me. It's frustrating, not helpful, and honestly hurts a little bit. I've been working as a counselor since 2014 and every school I've worked at, I've had at least one or more teachers/staff tell me this. Just a few minutes ago, a student teacher came in and relayed a conversation they had with a student and said \"I told them to talk with you but they said that you never help.\" Its frustrating that staff reinforce these ideas, instead of pushing back or even encouraging the student to talk with me, the student teacher didn't say anything. I'm frustrated. Thanks for letting me vent.  ",
    "score": 81,
    "url": "https://reddit.com/r/schoolcounseling/comments/1j8wyxo/student_doesnt_want_to_talk_to_you_because_they/",
    "created_at": "2025-03-11T17:54:38.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1i0tum2",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "I refuse to work outside of contract hours. How do I deal with being compared to my colleagues who work 2+ hours outside of work every DAY?!",
    "text": "Title says all 😭 I am SO behind right now. Between 504’s, test coordinating, scheduling, student check-ins, parent phones calls, etc., I CANNOT get caught up in the 40 hours they give me. Graduate school prepared me for this, and I am able to give myself grace. Still, HOW do I get students to give me any grace when it takes me 2+ days to answer my caseload’s emails and their friends get responses from their counselors within the day?\n\nI feel like I’m losing my mind. I refuse to get into the habits of my coworkers, who arrive an hour early and stay until they’ve crossed everything off of their to-do list... but this automatically makes me the weakest link. 😅 Any and all advice would be appreciated!",
    "score": 78,
    "url": "https://reddit.com/r/schoolcounseling/comments/1i0tum2/i_refuse_to_work_outside_of_contract_hours_how_do/",
    "created_at": "2025-01-14T00:56:10.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1n1hq5x",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Do you ever feel unprepared by grad school?",
    "text": "Took a whole course on assessments. Had to analyze assessments, write papers on assessments, etc etc \n\nDo you know how many assessments I have done in my career? Zero. Our school psych does them. Or people from the ISD/RESA who are like, special education coordinators. Or outside agencies. \n\nScheduling is like....a solid 60% of my job. Especially this time of year. Everything is scheduling.\n\nDo you know how many scheduling courses I took? Zero. It would've been so cool to learn about Student Information Systems, things like the Michigan Merit Curriculum, Count Day, and so on.\n\nIdk, I don't feel like grad school was a waste or anything, just reflecting on it all",
    "score": 59,
    "url": "https://reddit.com/r/schoolcounseling/comments/1n1hq5x/do_you_ever_feel_unprepared_by_grad_school/",
    "created_at": "2025-08-27T13:55:12.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1ndiuwy",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Does anyone actually like this career?",
    "text": "I’m in grad school to become a school counselor and I am so excited about it! But whenever I come to this Reddit page I get discouraged because it seems like sooo many school counselors are miserable in this job. Is it really that bad? I understand lots of school counselors are utilized for other things besides counseling and I can see why that would be frustrating. I’m prepared to have to be tough and advocate for myself when I start working. But I’m just curious, are there any of you who actually like this job and don’t regret it?",
    "score": 59,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ndiuwy/does_anyone_actually_like_this_career/",
    "created_at": "2025-09-10T16:23:43.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1k8qo51",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "How To Prevent Classroom Avoidance?",
    "text": "Im currently a middle school counselor. I have had a handful of students that come by my office simply because they are \"bored\" and are avoiding being in class.\n\nWhile I'm glad these students are coming to seek me out, a lot of times I'd rather they be in class and not missing class instruction unless they actually had a legitimate reason to see me (academics, socioemotional, careers). I want to have the student(s) feel comfortable and supported especially when they need me, but I don't want to enable classroom avoidance or allow students to be in my office simply because they're \"bored\". A lot of times they are sent by the teacher without the teacher calling to confirm my availability.\n\nAny tips of setting a firm boundary would be appreciated. ",
    "score": 56,
    "url": "https://reddit.com/r/schoolcounseling/comments/1k8qo51/how_to_prevent_classroom_avoidance/",
    "created_at": "2025-04-26T23:53:24.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1oxcxrg",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Things I am Grateful for as a New School Counselor coming from Community Mental Health Therapy",
    "text": "This is my first year as a school counselor. I started as a Clinical Mental Health Counselor in Community Mental Health settings working primarily with Medicaid populations. \nI know I am still a newbie and very much still in the honeymoon phase, but I wanted to share a few things that have stuck out for me to be so grateful for:\n\n1.) Salaried positions: in therapy, you are only paid for billable hours that insurance companies agree to reimburse. In school counseling I can’t believe I am on “company time” when doing my clinical notes, parent calls, walking to find a student, etc.\n\n2.) Duties: I have heard some school counselors bemoan this, but in therapy the mental load of seeing 6-7 people back to back for 6-7 hours is grueling. I can’t believe I get to pull a student for like 20-30 minutes, go hangout in the cafeteria and just shoot the breeze building relationships a bit, then get back to something else. Or car duty: getting to see the kids’ parents and siblings and greet them. (In CMH therapy you are lucky to find a parent’s phone number much less interact with them unless you have to send someone to the hospital for suicidality). And again with duties: you are being paid for that time. \n\n3.) The variety! The aforementioned sitting in a chair for 6-7 hours a day (then doing two hours of notes unpaid) really got to me with therapy. I love doing a few classroom lessons, a few parent calls, an admin meeting, lunch duty, meet with individuals or groups, time to plan.\n\n\nThese are some things I am grateful for and I wanted to share them because I often hear school counselors questioning whether they should get into a counseling practice. And maybe you should! The flexibility with that is hard to beat. If you have a client no-show you get to leave (but then you aren’t paid for that hour you were counting on). I do miss my lunch dates with my husband. But I now have my children’s exact schedule which is another thing I am grateful for! ",
    "score": 54,
    "url": "https://reddit.com/r/schoolcounseling/comments/1oxcxrg/things_i_am_grateful_for_as_a_new_school/",
    "created_at": "2025-11-15T00:06:25.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1ofrr4k",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "School counselor burnt out and looking for a new career",
    "text": "I’m a 38 year old male and have done school counseling for 8.5 years. I have 3 kids and feel burnt out dealing with the administration and high needs of students. I’m more of an introvert. While I can do presentations and talk with people, the amount of people that I deal with (caseload of 275 students, about 10 admin, more teachers and parents) is draining. \n\nI am willing to learn and do anything else. Does anybody know of in demand jobs that don’t require a ton of education?",
    "score": 47,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ofrr4k/school_counselor_burnt_out_and_looking_for_a_new/",
    "created_at": "2025-10-25T13:37:19.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1l2gk0y",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "College/trade school applications are becoming painful...anyone else?",
    "text": "So, one of my favorite parts of the job is the career counseling portion. I always offer to help students with applications if needed because I know it can be intimidating. However, I've noticed that each year, the students have less and less basic knowledge. They need help answering literally every single question - even the most general questions that you should learn in elementary school. I need to know if this is the \"norm\" everywhere. Here are some examples:\n\n  \n\\-I don't know my mom or dad's job\n\n\\-I don't know if my mom or dad went to college\n\n\\-I don't know my zip code (often confused with area code)\n\n\\-we live in Pennsylvania, right?\n\n\\-Wait, what county are we in?\n\n\\-What does \"starting semester\" mean? Do I apply for Spring 2025 or Fall?\"\n\n\\-I know my birthday is in December but I forget the date (this was a freshman applying for vo-tech)\n\n\\-I don't know how to check my email\n\n\\-What does this mean? (question asking if student was ever in the military)\n\n  \nanyone else noticing this? It is really concerning",
    "score": 47,
    "url": "https://reddit.com/r/schoolcounseling/comments/1l2gk0y/collegetrade_school_applications_are_becoming/",
    "created_at": "2025-06-03T16:34:59.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1oom74c",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "This is not for me anymore",
    "text": "This is my third year at my school and district and I’m drained. I don’t know what is in the air this school year but it has been nonstop at my school. Issue after issue. Crisis after crisis. I knew what I was getting myself into when I went into this career but I can’t with my district anymore. Admin at my school is great. They support me very well and we have similar views on how to handle certain situations but the district as a whole is a big NO. District allows parents to trample all over us and always siding with parents no matter what the situation. It has gotten to the point where I feel like quitting. I dread going into work everyday. Will definitely not be going back for the following school year. Just needed to rant. Thanks for listening ❤️",
    "score": 41,
    "url": "https://reddit.com/r/schoolcounseling/comments/1oom74c/this_is_not_for_me_anymore/",
    "created_at": "2025-11-04T22:57:16.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1kjcq56",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "How much are you getting paid?",
    "text": "What type of school do you work at? What’s your salary/benefits situation? Are you able to live the way you want in the state you’re in? Thank you! ",
    "score": 37,
    "url": "https://reddit.com/r/schoolcounseling/comments/1kjcq56/how_much_are_you_getting_paid/",
    "created_at": "2025-05-10T15:20:52.000Z",
    "num_comments": 87
  },
  {
    "id": "reddit-1kfprem",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Leaving School Counseling After 10 Years",
    "text": "This is my 10th year as a school counselor. I’ve worked primarily with middle school students, but have some experience with high school. I am seriously considering leaving the profession for many reasons, but perhaps the most important being my mental health. I work in an extremely demanding district and I am absolutely drained on a daily basis. My anxiety is so high I find it hard to function or do anything outside of worry about my job. I am a mother to an amazing kid and wife to a wonderful husband and they are also suffering because I am usually physically and mentally unavailable due to work. \n\nI do not have any other job experience besides school counseling, and I do not have a teaching license. My undergrad degree was in Psychology and my masters in School Counseling (I do not have the credits/hours to get become LPC nor do I have interest in counseling outside of a school). My husband is a small business owner and works 6 days/week so that leaves me in charge as the primary parent most of the time. I am also the primary for our health insurance coverage, and my income is an important part of our family’s finances. Looking for a job that allows me to make a similar salary and have as much time off with my daughter seems impossible. Still, I’m willing to give up the summers off and accept less pay if it means feeling human again. Does anyone have any insight, advice, or suggestions on where to even start? If you have left the profession- what do you do now? Was it difficult to find a job outside of a school? I assume potential employers don’t even glance at my resume and are probably confused on why someone with zero experience is even applying. \n\nAppreciate you all and all the hard work you do everyday :) ",
    "score": 33,
    "url": "https://reddit.com/r/schoolcounseling/comments/1kfprem/leaving_school_counseling_after_10_years/",
    "created_at": "2025-05-05T23:06:59.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1jwevz4",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Need a Career Change",
    "text": "I'm sure there are other posts similar to this one out there, but I am feeling so stuck. I worked as a HS school counselor for 2 years. I am kind of an introvert and felt so drained at the end of each day, I wasn't able to show up for my relationships or myself. I knew I needed to leave and I shifted into an academic advising position which has been a good change of pace- no dealing with parents!!! But, I know I can't do it much longer for many of the same reasons I left school counseling. \n\nI need a change- more money, more admin, organization, black and white tasks, etc. I'm tired of taking on the feelings and problems of others while making barely enough to cover basic living expenses for myself. Props to those who can do it and still have a smile at the end of the day!\n\nIs my Masters of Ed in school counseling as useless as it's feeling right now? My BA is in Psych. Any suggestions of programs that help transitioning out of education? Resume tips? Other career options? Words of wisdom? \n\nThank you!!! Rooting for you and whatever you also might be going through! 🫶",
    "score": 28,
    "url": "https://reddit.com/r/schoolcounseling/comments/1jwevz4/need_a_career_change/",
    "created_at": "2025-04-11T02:00:36.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1mz8hn7",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Severe anxiety and panic around returning. Help.",
    "text": "Going into my second year, currently employed at a title 1 school. I knew intense before this school from my internship placements, but this school is something else. It’s all crisis. All day. Answering to behavioral problems, literally because between our AP, behavior tech, PBIS specialist, and principal, there’s not enough staff to deal with all the kids sent to the office. It was a horrible first year in the field. I had nightmares on a weekly basis about the job. Many days I would leave crying from the sheer intensity, and lack of ability to actually do real counseling. \n\nI planned on not coming back, but with a jam packed summer, I wouldn’t be home enough to interview. One more year as a trade off for traveling and having fun all summer can’t hurt, right?\n\nWell, it’s time to collect. I’ve been having nightmares for the last two weeks, and on Friday I just started crying nonstop. I can’t even open my email without sobbing. Next week we start PD and even the idea of being in my office makes me sick enough that I want to vomit. I’m worried about what taking time off will do to my placement on the salary schedule, and ability to still afford life, so FMLA doesn’t seem right. Frankly, it doesn’t even feel reasonable given the school year hasn’t yet started. But I’m staring down the barrel of a loaded gun and I don’t even know how to help myself. Anything could help.\n\n\n\n",
    "score": 26,
    "url": "https://reddit.com/r/schoolcounseling/comments/1mz8hn7/severe_anxiety_and_panic_around_returning_help/",
    "created_at": "2025-08-24T21:45:50.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1pfz4ml",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Leaving mid year - 10 years at same school",
    "text": "Long story short, a lot of things have been going on in my district, my school, my new admin (see previous post), my actual role responsibilities- I started casually looking at other opportunities. I am licensed as an associate social worker so luckily, I do have the ability to work outside of education; my plan was to continue working on my hours to get licensed and eventually go into a private practice setting. \n\n\n\nI interviewed for a therapist position and got an offer the day before thanksgiving via email so I had a few days to sit on it. During that time our teacher’s union also went on strike. I decided (not hastily) that it was best for my future career plans, the money &amp; benefits were similar, and I’d actually get to counsel kids again. The only 2 things that really pulled me were the kids, of course, and summer break. I thought about what I really do during that time - if I’m not working summer school then I’m literally watching Bravo or re-runs of friends and doing crafts between sleeping in and naps. So really, the kids were my only real deciding factor. \n\n\n\nSo, that being said, I’m looking for creative ways to essentially “wrap up” services for 300 kids? Most of these students and families have known me for years, multiple siblings, continue reaching out even after they’ve moved to middle school. I have individual students I will exit services with differently but for the most part, these kids all know me - I know all of them. I’m concerned that between our week long strike and me leaving that it is going to be a difficult transition going into the break as well. \n\n\nI know grief is a natural part of life (I’ve been experiencing it a lot recently) and after speaking with my supervision provider, we discussed asking teachers if I could have 30-45 minutes to do a quick lesson about change, reinforce coping skills, share I’m leaving and then play with them for a bit so it’s not just dropping the bomb and bailing. Thoughts?\n\n\nThank you for making it this far, if you did. I’m jumbled up after a week of walking in circles with picket signs &amp; crying. We go back Monday after finally reaching a tentative agreement last night.",
    "score": 26,
    "url": "https://reddit.com/r/schoolcounseling/comments/1pfz4ml/leaving_mid_year_10_years_at_same_school/",
    "created_at": "2025-12-06T20:27:38.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1izklrx",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "If you could go back, would you choose school counseling again?",
    "text": "I am looking to apply to school counseling programs--specifically ones that have a dual-track component with clinical mental health and school counseling or allow students to take some extra classes to be eligible for the LPC in the future. \n\nI have a bachelor's in Human Development (psych and sociology) and was a teacher's assistant in college and during summers for 3.5 years, but ended up on a different path after undergrad due to having some anxiety challenges myself, so I am currently working in HR and strongly considering moving back towards working with kids and in a mental health related field. \n\nMy husband is in his 7th year of teaching, and first worked at a Title 1 school, one of the roughest in that district, for several years and then moved to a private school. He's pretty nervous about the idea of me working in schools since he had challenging experience (even though he was a great teacher throughout that situation and still is today). We do have kids, so I really enjoy working with children, want to do something meaningful, and would like to have time off when the rest of my family does. I currently get federal holidays and 10 days of PTO, so I often am working when they have breaks. I'm not making a ton $$ in my job now anyhow, so I feel like this would be a good time to move and not be stuck financially in a field/job that I don't want to be in long-term. I've been interested in mental health for a long time and took several counseling classes in undergrad and really enjoyed that experience. I also have managed to set up a couple of shadowing opportunities in the next month or so before making any decisions.\n\nThe question is--how stressful is the job? Do you think it's worth it to make a big career shift and go back to school? If your spouse is also a teacher/on a school schedule, how is that? If you have kids, do you feel too burnt out to be the parent you want to be or do you feel like you're able to be present and happy in the way you hope? How do you think the job market is or will be in 3-4 years (especially with everything going on right now in the government..)? Anything else I should know or consider before going for this?",
    "score": 25,
    "url": "https://reddit.com/r/schoolcounseling/comments/1izklrx/if_you_could_go_back_would_you_choose_school/",
    "created_at": "2025-02-27T17:01:26.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1oe2anv",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "I need to vent.",
    "text": "Got hired at a 6-12 school after I graduated in May 2025. Very lucky and blessed. I am mainly 6-8 counselor\n\nMy co-counselor's mother is the super. Okay. Didn't know that before getting hired. Wouldn't have taken the job if I knew that. Co-counselor is also best friends with the prinicpal. Absolutely would NOT have taken the job if I knew that too.\n\nPrincipal is rude and condescending, talks very ugly about teachers with co-counselor and central office admin. I am always on the backburner. Consistently ignored and left out. I am mainly there to teach career lessons. Outside of that and seeing kids, I have no purpose. I will be looking for a new job as they pop up. The favoritism is rampant. Bullying problems are ignored, especially if studentd are LGBTQI+. \n\nAll they do is sit in their offices and talk or eat. There is no focus on mental health, and I made it clear in my interview that - while I would do other duties as assigned - mental health was my focus. ",
    "score": 25,
    "url": "https://reddit.com/r/schoolcounseling/comments/1oe2anv/i_need_to_vent/",
    "created_at": "2025-10-23T12:45:10.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1hv17h1",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "If you were not a school counselor, what would you do instead? ",
    "text": "I feel as if many of us have entered careers thinking \"this is what we want to do\" and realized it either was good enough to keep going or we were not aware of what the role really was. \n\nDespite being a former educator, I feel I still don't really know what a school counselor does. I am planning on shadowing someone before I fully commit to this because I have this nagging thought in my mind that I am uncertain this is what I want. I also feel I shouldn't spend money on it if I'm not 100% sure. I wonder if I'm just having nerves or cold feet to a career but now I wonder if others who are in it wish they would have done anything else. ",
    "score": 24,
    "url": "https://reddit.com/r/schoolcounseling/comments/1hv17h1/if_you_were_not_a_school_counselor_what_would_you/",
    "created_at": "2025-01-06T15:12:08.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1ieyoqt",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Burn out",
    "text": "I am burnt out. I used to love what I do, and there are bright spots some days, but overall I am unhappy. I feel stuck and I wouldn’t even know where to look if I were to get a new job. I sometimes look on indeed and get so overwhelmed as my license and degree is strictly school counseling. Anyone else feel this way? Has anyone successfully made a career jump to something else and are happy they did?",
    "score": 24,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ieyoqt/burn_out/",
    "created_at": "2025-02-01T04:44:36.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1oawx0m",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "I Think I Chose the Wrong Career??? Help pls!",
    "text": "Hello! I am writing because I just began my master's in school counseling program this previous summer, so now I'm in my second semester right now. I really enjoyed the intro classes and all the talk about social justice, however once we have gotten into like the real counseling side of things, I'm realizing that I don't think this is for me. I love supporting students, especially BIPOC communities, but I don't feel like I can personally handle being responsible of helping students with their emotions. It's a lot that goes into it, which I somewhat knew, but now I know KNOW. It's just stressing me because I want to support students, but I don't think this is the way that I want to support them. I love organizing and providing resources and doing the occasional research here and there to provide people with the things they need, which is why I think I would like to be a school librarian instead. I love working in the school environment, and didn't want to be a teacher, and am now realizing counseling isn't for me, and so now I think third times a charm and am considering enrolling in an MLIS program to be a librarian. Does anyone have any advice, thoughts, feeling, concerns, questions?? Does it sound like I'm making the right decision? Should I wait it out? Should I just take this chance and leap while I can since it's so early in my program? I'm open to anything you folks would like to provide me. Please let me know. Thank so much!!",
    "score": 24,
    "url": "https://reddit.com/r/schoolcounseling/comments/1oawx0m/i_think_i_chose_the_wrong_career_help_pls/",
    "created_at": "2025-10-19T18:20:55.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1ipitb7",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Other Career Options for School Counselors",
    "text": "Hello - I’m a school counselor in Massachusetts and am completely burnt out. I want to leave the field completely. Does anyone have suggestions towards what other careers I’d be qualified for ? I have my Bachelors in Education and Psychology and Masters in School Counseling. Any advice is appreciated:)",
    "score": 22,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ipitb7/other_career_options_for_school_counselors/",
    "created_at": "2025-02-14T19:31:42.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1m9hxuq",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Getting nervous about job availability",
    "text": "So I’m currently enrolled in a school counseling w/ pps program with a dual concentration in professional clinical counseling here in California. I feel like the more I’m on this reddit, thinking about the budget cuts that are happening, everything with trump &amp; the DOE, the more I’m getting cold feet about choosing this career path. I really do want it to work out but there’s no guarantee I’ll get a job right after I get my masters and hours. Is it valid to be scared about job availability in the future? Or should I disregard this fear?\n\nEdit: I think I’m reconsidering this career for good. I’m heavy considering going into sped instead. Thank you for all the advice I received, it’s been very helpful.",
    "score": 22,
    "url": "https://reddit.com/r/schoolcounseling/comments/1m9hxuq/getting_nervous_about_job_availability/",
    "created_at": "2025-07-26T02:24:53.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ni7ag1",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Am I making the right choice please be honest",
    "text": "Hello everyone, I’m an 18 year-old male about to start my undergraduate journey majoring in psychology. I would love to become a school counselor. I adore my school counselors. They were the best I was always in their office they always had  Bad Bunny playing always kept up with all the trends and I started to realize hey “they’re getting paid to talk to me”. Am I making the right choice ik the pay is not amazing, but if I’m gonna go for a masters degree I want to be able to make a decent salary. What other jobs are related to school counseling? \n\nPlease be 100% HONEST I don’t want to go through all that schooling to only change careers. \n\n(Before school counseling I was interested in nursing, but then I realized I am not a blood, pee or shit person lol) ",
    "score": 21,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ni7ag1/am_i_making_the_right_choice_please_be_honest/",
    "created_at": "2025-09-16T03:54:52.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1j5yzj6",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "passed praxis= less career doubt",
    "text": "i went into this test thinking that I was going to fail so I already was mentally prepared to retake it again. well my score is a 180! i feel like such a weight has been lifted off of my shoulders. i really had began doubting if this career path is for me but now i am a little more confident and excited for the future work i will be doing. i have one more internship to go then I am officially ready for the world! woohoo!!\n\nETA what helped me: I went through the ASCA red book which was the bulk of the test and I also took this free practice test [https://www.mometrix.com/academy/praxis-ii/school-counselor/](https://www.mometrix.com/academy/praxis-ii/school-counselor/) ; did a bunch of practice games and tests with this quizlet [https://quizlet.com/837552437/praxis-5422-school-counselor-exam-flash-cards/?exitTest=1](https://quizlet.com/837552437/praxis-5422-school-counselor-exam-flash-cards/?exitTest=1) ; watched videos on the theorists [https://youtube.com/playlist?list=PLVQ3UCLwnGFOwll1Nv1pZp3DJIY1bkk2h&amp;si=wkHqBhlCf6VvzyX8](https://youtube.com/playlist?list=PLVQ3UCLwnGFOwll1Nv1pZp3DJIY1bkk2h&amp;si=wkHqBhlCf6VvzyX8) . I also looked through this sub as a lot of other threads have great suggestions. A few hours before the test, I took the practice test from praxis and treated it like the test so I knew what to expect and looked over the answers I got wrong or was unsure of. The biggest tip that I found is to answer as if it is a perfect world where everything goes exactly as it needs to.",
    "score": 21,
    "url": "https://reddit.com/r/schoolcounseling/comments/1j5yzj6/passed_praxis_less_career_doubt/",
    "created_at": "2025-03-07T20:12:27.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1nkpy7l",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Boundaries",
    "text": "As a school counselor and school adjustment counselor who’s worked in a couple different schools and levels now, I’ve seen our roles used in so many different ways by admin with varying levels of understanding.\n\nI’m wondering- where are your boundaries? At what point and for what tasks do you say- that’s not my job?\n\nFor reference- I have done IEP services, been a special Ed liaison, 504 facilitator, curriculum maker, SEL lesson teacher, safety care responder and trainer, substitute for our Bridge coordinator, behavior plan creator, pd creator and presenter, SEL MTSs designer, and more.\n\nStruggling to find the best way to put some boundaries around what feels like a boundaries career. ",
    "score": 20,
    "url": "https://reddit.com/r/schoolcounseling/comments/1nkpy7l/boundaries/",
    "created_at": "2025-09-19T01:08:58.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1oxcw1i",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Encouragement from a new School Counselor coming from Community Mental Health",
    "text": "This is my first year as a school counselor. I started as a Clinical Mental Health Counselor in Community Mental Health settings working primarily with Medicaid populations. \nI know I am still a newbie and very much still in the honeymoon phase, but I wanted to share a few things that have stuck out for me to be so grateful for:\n\n1.) Salaried positions: in therapy, you are only paid for billable hours that insurance companies agree to reimburse. In school counseling I can’t believe I am on “company time” when doing my clinical notes, parent calls, walking to find a student, etc.\n\n2.) Duties: I have heard some school counselors bemoan this, but in therapy the mental load of seeing 6-7 people back to back for 6-7 hours is grueling. I can’t believe I get to pull a student for like 20-30 minutes, go hangout in the cafeteria and just shoot the breeze building relationships a bit, then get back to something else. Or car duty: getting to see the kids’ parents and siblings and greet them. (In CMH therapy you are lucky to find a parent’s phone number much less interact with them unless you have to send someone to the hospital for suicidality). And again with duties: you are being paid for that time. \n3.) The variety! The aforementioned sitting in a chair for 6-7 hours a day (then doing two hours of notes unpaid) really got to me with therapy. I love doing a few classroom lessons, a few parent calls, an admin meeting, lunch duty, meet with individuals or groups, time to plan.\n\n\nThese are some things I am grateful for and I wanted to share them because I often hear school counselors questioning whether they should get into a counseling practice. And maybe you should! The flexibility with that is hard to beat. If you have a client no-show you get to leave (but then you aren’t paid for that hour you were counting on). I do miss my lunch dates with my husband. But I now have my children’s exact schedule which is another thing I am grateful for! ",
    "score": 14,
    "url": "https://reddit.com/r/schoolcounseling/comments/1oxcw1i/encouragement_from_a_new_school_counselor_coming/",
    "created_at": "2025-11-15T00:04:23.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1l20bkr",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Venting…advice appreciated if you end up reading it all",
    "text": "I got my masters in school counseling from NYU in 2022. Live in California now, got my pps credential, applied to soooo many jobs and never got one interview. I gave up and started working at a community mental health program as a case worker. I recently decided to do more school online for an MSW while working because I heard it’s easier to get a job as an lcsw than a sc. I just found out I am getting laid off from my job due to budget cuts. My boss told me they “might” and would love to keep me on the team if they can (they found out they can keep some of us even though we were laid off) I am contemplating taking the severance and unemployment if needed and start applying to school counseling jobs again. I get so upset about how little money I make now and see the salaries for sc jobs. It hurts me that I am qualified to make that much but I’m just scared to take the leap and try again. If my boss does decide to keep me, I could still keep applying to sc jobs, but I would have to try and find other references I guess, because I wouldn’t be able to tell my job I am trying to find another? I don’t know what to do. Spiraling lol. It also sucks that all the sc jobs in my area need 3 letters (I live in Orange County ca) ",
    "score": 13,
    "url": "https://reddit.com/r/schoolcounseling/comments/1l20bkr/ventingadvice_appreciated_if_you_end_up_reading/",
    "created_at": "2025-06-03T02:08:51.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1ppba59",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "I’m asking another question. What did you guys do for work during school?",
    "text": "I currently work as a salaried manager at a large retail chain and doing that and going to school is not feasible. I’m accepting that I’m going to have to quit and take a major pay cut. \n\nJust wondering what you guys did to get through school and still afford to live? ",
    "score": 12,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ppba59/im_asking_another_question_what_did_you_guys_do/",
    "created_at": "2025-12-17T23:15:51.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1mkiazr",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Is the pay worth it?",
    "text": "Hello I’m a graduate student and the reason I’m going into counseling is because I love working in education and helping people achieve their dreams! However would you say the pay could be better? If you don’t mind sharing you’re starting salary it would be very helpful information on what I’m getting into/ how to budget once I start my career! ",
    "score": 11,
    "url": "https://reddit.com/r/schoolcounseling/comments/1mkiazr/is_the_pay_worth_it/",
    "created_at": "2025-08-08T01:36:57.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1nu78zr",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Counselor salaries",
    "text": "Hello, im a college freshman and I am planning to major in psychology to become a highschool counselor. I was wondering what general salaries would look like and also if there was any advice that anyone could give that would be great.",
    "score": 11,
    "url": "https://reddit.com/r/schoolcounseling/comments/1nu78zr/counselor_salaries/",
    "created_at": "2025-09-30T07:58:33.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1kqq0mk",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Feeling Indifferent - Looking for what's next",
    "text": "Hello all,\n\nI've been speaking to a couple of my closest friends about what's been on my mind lately. I'm finishing up an amazing first year as a school counselor over on Long Island; it was a leave replacement position that was supposed to end in December 2024, but they extended me for the full school year. I landed a HS counselor probationary position at a different school district on Long Island. As I look back at everything I've done up until this point from going away to upstate NY to obtain my BA at SUNY Geneseo, working in private education while getting my master's, running pre-college programs across the country... I feel indifferent. \n\nI've worked with a therapist before in regards to gratitude, and working towards my goals/achievements and I'm left with the question of 'what's next?' Because I landed this job, this was everything I was chasing before I turned 30, and now that I got what I wanted... I thought I would have felt different at the end of it. It may just be me but... I feel as though I can see the next 20, 25, 30 years ahead in terms of salary structure, and how my career is going to look from the school perspective. I chose this profession because I genuinely enjoy working with students, collaborating with educators, and having an impact on the school community.\n\nThis can be said about many professions, but in a way, I wonder \"what else could I be doing\"? Long Island is pretty expensive and while my career is rewarding, homeownership looks and feels so far out of reach.",
    "score": 10,
    "url": "https://reddit.com/r/schoolcounseling/comments/1kqq0mk/feeling_indifferent_looking_for_whats_next/",
    "created_at": "2025-05-19T23:06:20.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1nqaiod",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Dual role",
    "text": "Hi there.. I’m just curious if there are any school counselors that are also considered admin? I work at a small school and am the school counselor and part of the administration team. I recently obtained my counseling degree and am looking at requesting a higher salary. I’m in the Midwest and am an 11-month employee. I make slightly less than a school counselor in area districts that work the 182 contracted days. Just looking for any input.. thanks!",
    "score": 9,
    "url": "https://reddit.com/r/schoolcounseling/comments/1nqaiod/dual_role/",
    "created_at": "2025-09-25T15:54:55.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1oxcvwo",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Encouragement from a new School Counselor coming from Community Mental Health",
    "text": "This is my first year as a school counselor. I started as a Clinical Mental Health Counselor in Community Mental Health settings working primarily with Medicaid populations. \nI know I am still a newbie and very much still in the honeymoon phase, but I wanted to share a few things that have stuck out for me to be so grateful for:\n\n1.) Salaried positions: in therapy, you are only paid for billable hours that insurance companies agree to reimburse. In school counseling I can’t believe I am on “company time” when doing my clinical notes, parent calls, walking to find a student, etc.\n\n2.) Duties: I have heard some school counselors bemoan this, but in therapy the mental load of seeing 6-7 people back to back for 6-7 hours is grueling. I can’t believe I get to pull a student for like 20-30 minutes, go hangout in the cafeteria and just shoot the breeze building relationships a bit, then get back to something else. Or car duty: getting to see the kids’ parents and siblings and greet them. (In CMH therapy you are lucky to find a parent’s phone number much less interact with them unless you have to send someone to the hospital for suicidality). And again with duties: you are being paid for that time. \n3.) The variety! The aforementioned sitting in a chair for 6-7 hours a day (then doing two hours of notes unpaid) really got to me with therapy. I love doing a few classroom lessons, a few parent calls, an admin meeting, lunch duty, meet with individuals or groups, time to plan.\n\n\nThese are some things I am grateful for and I wanted to share them because I often hear school counselors questioning whether they should get into a counseling practice. And maybe you should! The flexibility with that is hard to beat. If you have a client no-show you get to leave (but then you aren’t paid for that hour you were counting on). I do miss my lunch dates with my husband. But I now have my children’s exact schedule which is another thing I am grateful for! ",
    "score": 8,
    "url": "https://reddit.com/r/schoolcounseling/comments/1oxcvwo/encouragement_from_a_new_school_counselor_coming/",
    "created_at": "2025-11-15T00:04:13.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1pd9y6p",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Anyone work for DCPS?",
    "text": "Career urban educator who is relocating to Washington, DC this summer. Trying to gauge if I can afford to work in education. My NYC salary is sufficient, but wondering if my 10 years of experience will be honored. \n\nI’ve taught and counseled, most recently at a high-needs school as a bilingual (Spanish) counselor. \n\nSalary would be okay if they recognized my work experience — anyone have insight to this?",
    "score": 8,
    "url": "https://reddit.com/r/schoolcounseling/comments/1pd9y6p/anyone_work_for_dcps/",
    "created_at": "2025-12-03T17:07:49.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1ik1eb7",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Counselor Salary Schedule",
    "text": "I know this is obvious dependent on district, but some local ones I have looked at don’t have a separate Counselor salary schedule, only for School Psychologist. Based on the fact that counselors are certificates, would it be okay to assume they use the teacher’s salary schedule? If that’s the case, would a district take into account the years I taught?",
    "score": 7,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ik1eb7/counselor_salary_schedule/",
    "created_at": "2025-02-07T18:06:10.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1jcxltd",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Moving from AL to NYC",
    "text": "Hi everyone! I am currently a school counselor in Alabama and potentially moving to NYC (husband is in theatre).\n\nIs there anyone previously or currently working in NYC that could answer a few questions I have about the job? I have read that it can be difficult to get in the NYC DOE, which I understand. But I can’t even figure out how to get started. Also curious about contracts and how to read this salary schedule. I would like more information on how schools are set up.. it seems so different from Alabama. Please let me know if you’d be willing to chat! :-) \n\nOr if you have resources that I should be checking out, I’m happy to dig into those!\n\nThanks!! ",
    "score": 6,
    "url": "https://reddit.com/r/schoolcounseling/comments/1jcxltd/moving_from_al_to_nyc/",
    "created_at": "2025-03-16T22:29:41.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1klkeqj",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "NYC Salary Question (Charter-&gt;NYCDOE",
    "text": " for your insights. \n\nI have been working at a charter school for 6 years and just accepted a job at an nyc public school for next year.  \n\nDoes anyone have any experience switching over and if so, were all of your years (it’s capped at 5 for counselors) of experience counted?  \n\nI’m a bit concerned about the semantics; at my current job, all of the counselors are split by specialty and mine is career counseling, although my degree is school counseling.  It seems the UFT will only accept years under the title “guidance counselor.”  I’d hate for my years to not count - I’ve worked very hard and I know it’s my experience that got me hired in the first place. \n\nAny insight would be much appreciated!",
    "score": 6,
    "url": "https://reddit.com/r/schoolcounseling/comments/1klkeqj/nyc_salary_question_charternycdoe/",
    "created_at": "2025-05-13T12:16:11.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1ljncbk",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "Private Vs. Public school salary",
    "text": "I’ve been at my current position in a public high school for 7 years. I just saw that a College/Career Counselor position opened up at a nearby Private school, but no salary is listed.\n\nI’m wondering if anyone knows if private schools typically pay more or less than public? \n\nI’m in PA, not sure if that matters ",
    "score": 6,
    "url": "https://reddit.com/r/schoolcounseling/comments/1ljncbk/private_vs_public_school_salary/",
    "created_at": "2025-06-24T21:18:45.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1me906o",
    "subreddit": "schoolcounseling",
    "soc_codes": [
      "21-1012"
    ],
    "title": "ASCA specialist courses",
    "text": "Hi,\n\nHas anyone went through and purchased any of the ASCA specialist courses? Did you use those for salary advancements through Lindenwood University if you did do them? How beneficial are the trainings in these courses? I am considering do it but I am curious to hear from everyone else. Let me know your thoughts.  \n",
    "score": 5,
    "url": "https://reddit.com/r/schoolcounseling/comments/1me906o/asca_specialist_courses/",
    "created_at": "2025-07-31T18:13:20.000Z",
    "num_comments": 3
  }
]