[
  {
    "id": "reddit-1igvsux",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Repost because some of yall seem to think IBEW is gonna just bend over and take it",
    "text": "I'm not concerned in the slightest about the political climate regarding unions because as much shit that we talk on jobsites to each other and other trades, there's no way in hell we'll accept bullshit",
    "score": 31323,
    "url": "https://reddit.com/r/IBEW/comments/1igvsux/repost_because_some_of_yall_seem_to_think_ibew_is/",
    "created_at": "2025-02-03T18:18:00.000Z",
    "num_comments": 1385
  },
  {
    "id": "reddit-1l7d53t",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Here we are 35 years later and the assault on unions and the working class by the owners has only escalated.",
    "text": "There are more of us than there are of them, and we need to stand united as one labor movement. They’re trying to stomp out unions altogether, and the only thing standing between them and succeeding is us. ",
    "score": 9939,
    "url": "https://reddit.com/r/IBEW/comments/1l7d53t/here_we_are_35_years_later_and_the_assault_on/",
    "created_at": "2025-06-09T18:56:26.000Z",
    "num_comments": 269
  },
  {
    "id": "reddit-1jj5qvq",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Career day",
    "text": "Heres my career day booth i put together! I had a lot of fun putting it together and a ton of kids were very interested and had fun playing around with the switches. \n\nI was surprised at how many kids told me they have been shocked… one kid told me his outlet sparks everytime he plugs things into it! 😆 i was like, “that definitely needs to be checked out”….\n\nAll in all the kids said I had the best and most fun table so i’m glad they enjoyed it! \n\nThe table was a low voltage set up so it was safe for the kids to touch and mess with. ",
    "score": 9233,
    "url": "https://reddit.com/r/electricians/comments/1jj5qvq/career_day/",
    "created_at": "2025-03-24T23:44:47.000Z",
    "num_comments": 333
  },
  {
    "id": "reddit-1jzv52l",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "The real post; not some 72 year old",
    "text": "About a week ago, this photo was posted saying that a 72 year old electrician built this in a day. That is simply not true. I am the electrician who, with his apprentice, built this. It took us a week to put this together, and before any criticism starts, I had the full blessing of my foreman and my GF. I am a union wireman, and I was 36 when I built this. Just figured I would let you know. I am the op of this post from about 3 years ago. Thanks all, please upvote so people know the truth. ",
    "score": 6706,
    "url": "https://reddit.com/r/electricians/comments/1jzv52l/the_real_post_not_some_72_year_old/",
    "created_at": "2025-04-15T15:43:30.000Z",
    "num_comments": 258
  },
  {
    "id": "reddit-1o3hkyl",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I’m Jump Shepherd, IBEW 134. I’m running for U.S. Senate in Illinois to tax billionaires and restore wealth to the middle class. AMA.",
    "text": "https://preview.redd.it/smcr7b0bmduf1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=da77327c800d8cfb221c8583760215f370ca546b\n\n# Reddit AMA\n\n**It’s not Red vs. Blue, it’s Oligarchs vs. You 🫵🏽**\n\n[Link](https://www.reddit.com/r/illinois/comments/1nr1oxe/im_jump_shepherd_im_running_for_us_senate_im/)\n\n---\n\n[Donate on ActBlue](https://secure.actblue.com/donate/jumpforsenate)\n\nHi Reddit! 🇺🇸\n\nI’m Jump Shepherd, and I’m running for U.S. Senate. I’m running to replace Dick Durbin in the Senate and fight against Donald Trump.\n\nI’m not a politician. I’m an IBEW Local 134 electrician and I’m frustrated with our representation in Congress. We need more working class members in Congress. There are no active union members in the Senate, and we all know the unions are the backbone of the middle class. We have more than the 5000 signatures to get on the ballot for U.S. Senate. The time is now.\n\n---\n\n* 🦺 CHICAGO, ILLINOIS — Formerly known as Wesley Red—educator, astronomer, and electrician — but certainly not a politician.  \nAn active speaker and community organizer, Chicago Federation of Labor delegate, and Electrical Workers Minority Caucus member who frequently donates his Saturdays giving back to the community through volunteer electrical work, church engagement, and food pantry service. He’s no stranger to the neighborhood!\\*\n\n[Donate on ActBlue](https://secure.actblue.com/donate/jumpforsenate)\n\n---\n\n### 🔑 Top Policies\n\n**The Billionaire’s Bill**  \n1950’s era 92% top tax bracket after first $10 million in income.  \n5% wealth tax on billionaires. 💰\n\n**The Pink Tax**  \nWomen will no longer have to pay a tax just for being born with ovaries. That includes increased prices on razors and deodorant, but also on the hidden costs of pregnancy, childbirth, and more. 🎀\n\n**Teachers and Farmers Bill**  \nSets minimum wage for farm workers and teachers.  \nCreates subsidies for small farmers to compete with corporations and grants for teacher education. 👩🏾‍🌾\n\n---\n\n### ❓ FAQ\n\n**Q: What moment in your life made you realize that regular working-class people like you needed to be in the Senate?**\n\n **A:** The day I should’ve died.\n\nAnother apprentice and I were told to work on a switchgear live, something that even master electricians should not do, when his screwdriver created a path. BANG! The 500 gauge wire exploded with a flash, but shell shock insured I didn’t hear a thing. We were both knocked back and scurried to the opposite wall of the tight, rectangular electrical closet. BA-BANG!! Two more explosions and we quickly realized the breakers were not going to trip and cut power to these wires. We dashed into the even tinier electrical room offset from this one to gather our bearings. Mere seconds later, smoke began to billow in near the ceiling as flaming cardboard embers wafted in. The wires continued to discharge just outside. We had to go. We glanced at each other and knew words were unnecessary. We dashed past the switchgear to make it to the basement hallway and he got clipped by an explosion on his way through. He fell with a Ute and I jumped over him, hoping he would get up and get out. I dashed down the hall to a distance I felt safe, and looked back. He wasn’t behind me! I had no choice, I went back to the closet, yelled his name 2-3-4 times! No answer! The flames started pushing me back and I had to retreat upstairs to where the rest of the construction workers were. I yelled for everyone to leave the building NOW and reprimanded my foreman for putting two APPRENTICES in a situation like that. My partner showed up, I hugged him, and we got out of there. The owner of the electrical contractor called me later that day threatening me with counter-suits if I attempted legal action against him. I called him cold and heartless because the first thing he had to say to his employee that almost just died was a threat. I then said I didn’t plan on suing and he laid me off. He was cold and calculating. He had me replaced by the next day.\n\n**This is a microcosm of the power corporations have over individuals and over our legislation. It feels to most of us that we don’t have any power over what happens in Congress. It’s time to change that.**\n\n---\n\n**Q: You’re an engineer, a union member, a husband—why risk it all to run for office now?**  \n**A:** We are out of time. Our country is $35 Trillion in debt and Trump’s stacked Congress is cutting Medicaid and still running a deficit to give his billionaire friends even greater tax breaks, making his expiring obscene 2017 tax breaks permanent.\n\nThe risk is not in running to save our country. The risk is in doing nothing.\n\n---\n\n**Q: Your platform leads with bold policies: taxing billionaires, empowering teachers and farmers, ending the Pink Tax. Why these issues specifically?**  \n**A:** Women are treated as second class citizens in our country, the greatest country in the world. No more.\n\nTeachers and farmers are the most important, most under-appreciated people in our country. Teachers raise our children and farmers feed the world. It’s time they get the respect they deserve.\n\nBillionaires have been eroding our middle class for half a century. Thanks to them, we spend a trillion dollars every year *servicing* our debt, let alone ever paying it off. It’s time they chipped in.\n\n---\n\n**Q: You’ve never held elected office. What do you bring to the Senate that seasoned politicians don’t?**  \n**A:** I was raised in a house that struggled to keep the heat on in the winter. My mom ALWAYS went without so that we could have. I worked HARD to get my degree in physics and to earn my spot in the IBEW.\n\n98% of senators have never been working class. You ask what I bring to the Senate?\n\n**Grit.**\n\nSome would say running without money or connections is a long shot. I say running on a platform that steals from your constituents is the real long shot. Running on a platform of “not rocking the boat” or “waiting your turn” are far more dangerous to your political career and to the people you represent.\n\n---\n\n**Q: If elected, how will voters know you stayed true to the same Jump Shepherd who started with nothing but a vision and a voice?**  \n**A:** You will see it every day in my actions. There will be no question, and in fact, others will be inspired by my passion to answer the call to serve.\n\n---\n\n### 🔗 Links\n\n🌐 [Website](https://www.jump4senate.com)  \n💳 [Donate on ActBlue](https://secure.actblue.com/donate/jumpforsenate)  \n🎥 [TikTok](https://www.tiktok.com/@jumpforsenate?_t=ZT-8yb78hsUvde&amp;_r=1)  \n📝 [Threads](https://www.threads.com/@jumpforsenate)  \n📚 [More Links](https://www.atom.bio/jumpforsenate)\n\n---\n\n**It’s not Red vs. Blue, it’s Oligarchs vs. You 🫵🏽**\n\n&gt;It’s been a lot of fun talking to everyone, this is our town hall. If you believe in the message, donate to the campaign. We’re true grassroots, won’t take a dollar from AIPAC or the energy industry or any special interest group that’s an existential threat to our way of life, and every dollar goes so, so far. \n&gt;\n&gt;And remember;\n&gt;It’s not Red🔴 vs Blue🔵, \n&gt;it’s Oligarchs💰 vs You🫵🏾. ",
    "score": 5286,
    "url": "https://reddit.com/r/IBEW/comments/1o3hkyl/im_jump_shepherd_ibew_134_im_running_for_us/",
    "created_at": "2025-10-11T00:22:33.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1k1kzdf",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Found out why my friends problem customer such a problem customer",
    "text": "My friend’s company recently completed a series of jobs for a family near him, which unfortunately resulted in an excessive number of warranty claims.\n\nThe previous time they made a claim, they asserted that a loose wire had nearly caused a house fire and even discarded their lawyer’s card. Upon visiting the house, my friend noticed that a photocell, which wasn’t installed  by them, had been installed on the light.\n\nToday, while I was on a job for my own company, I drove by the house and encountered a man adding a receptacle from the light. I pretended to be a prospective customer and asked him for his card. he turned out to be the local handyman who handles all of this particular customer’s electrical work as he says. He says he doesn’t need to pull permits for any of the work he does\n\n",
    "score": 3994,
    "url": "https://reddit.com/r/electricians/comments/1k1kzdf/found_out_why_my_friends_problem_customer_such_a/",
    "created_at": "2025-04-17T19:09:35.000Z",
    "num_comments": 209
  },
  {
    "id": "reddit-1kqhl7o",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "the one where i evacuated a high school twice in one day",
    "text": "in late 2021 we were doing maintenance on a 100+ year old high school. i had to open up the mains can to take thermal photos. it was one of those fancy spring-loaded disconnects. i figure when i opened the door it opened the mains because of said disconnect. honestly i thought i was dead when everything went black lol. \n\nthe Jman i was working under instructed me to engage the spring mechanism and reconnect the mains. the power was out for maybe 2-3 minutes. not the end of the world. however the work had kicked up some dust, which made its way into the transformers. the smoke then set off the central fire alarm. luckily there weren’t any flames, it could have been way worse. we were asked off site shortly after. \n\n(don’t @ me, i was a young ape simply following instructions)",
    "score": 3379,
    "url": "https://reddit.com/r/electricians/comments/1kqhl7o/the_one_where_i_evacuated_a_high_school_twice_in/",
    "created_at": "2025-05-19T17:27:11.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1lzyb41",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Is it normal to work live electrical equipment naked?",
    "text": "I’m a first year and still pretty green.  I got sent to work with our special projects journeyman and he’s pretty eccentric to say the least.  \n\nSo the context is there were multiple transformers fed off a tap so there was no way to isolate our transformer without killing all of them which fed different tenants.  \n\nWhen it came time to disconnect and then later reconnect the feeder my journeyman set down a pallet with some cardboard and stripped down butt naked to make the connections.  \n\nHe explained that an arc flash is 30k degrees and that if you’re not wearing PPE then you’re wearing fuel and that being naked is better than wearing normal clothes.  I asked him why he didn’t just wear PPE and he pointed at his genitals and said, “cause I’m a man.”  \n\nIs this normal behavior? ",
    "score": 2942,
    "url": "https://reddit.com/r/electricians/comments/1lzyb41/is_it_normal_to_work_live_electrical_equipment/",
    "created_at": "2025-07-14T20:56:03.000Z",
    "num_comments": 424
  },
  {
    "id": "reddit-1mi9pth",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "The Great Betrayal",
    "text": "Message from IBEW President Kenneth Cooper:\n\nhttps://ibew.org/electrical_worker/the-great-betrayal/?ref=ew&amp;fbclid=IwQ0xDSwL-6wRleHRuA2FlbQIxMQABHhNn3ArnZuL-6L7J5u8xjQ0D9BjNdN-x7BDfllZ2sSNRbPuNAmi00ar2dZ9F_aem_gye_Aw1D-ljYKtB-XJj-Mw\n\nWhen Donald Trump took the oath of office the first time eight years ago, I had serious concerns that he would turn out to be just another Republican president with handouts for the rich and the back of his hand for the rest, but I was willing to see if he kept his promises to working families.\n\nI was willing to give him a chance because that’s all that working men and women needed, what the members of the IBEW needed. A chance.\n\nI saw enough in his first term to make up my mind that there were better options for the IBEW.\n\nBut nothing, I mean nothing, in his first term — nothing in my more than 60 years as an American citizen — comes close to the budget bill he just signed as a betrayal of everything I believe government should be for.\n\nNot only will this bill kill hundreds of thousands of jobs that would have been IBEW jobs, but it will rip the rug from under a generation of would-be apprentices and billions of dollars of our wages will evaporate.\n\nThis isn’t just about the elimination of union-friendly tax incentives for clean electric generation jobs.\n\nThis is the wholesale abandonment of a project to electrify our economy that would have made us the competitive marvel of the world with the kind of blue-collar careers we haven’t seen in generations.\n\nNow it’s in tatters.\n\nAnd why? What is it all for?\n\nThey’ll say they made overtime tax-free. But it isn’t true.\n\nYou still pay payroll taxes on overtime, and the maximum deduction is $12,500, getting smaller the more you make. But who’s working overtime when they’re sitting on the bench?\n\nAnd it excludes rail workers. And it ends in 2028, after the next presidential election.\n\nYou know what doesn’t have a $12,500 maximum? The deduction they left in to alleviate the struggle of owning and operating a private jet.\n\nAnd you know what doesn’t expire? The $960 billion tax cut for the wealthiest. Their tax cut is forever.\n\nWages will fall, and tariffs will drive prices up. The average family’s energy bill will go up significantly over the next half-decade, and more than 300 rural hospitals will shutter.\n\nThis so-called One Big Beautiful Bill is the greatest transfer of wealth from working people to the rich in our nation’s history.\n\nSo many of our members wanted to believe that Donald Trump was different. An elite who would betray his own in favor of us for once.\n\nThis is the great betrayal.\n\nTrump and the Republicans betrayed you and me. The billionaires and their families? They’ll be fine. \n\nKenneth W. Cooper\nInternational President",
    "score": 2538,
    "url": "https://reddit.com/r/IBEW/comments/1mi9pth/the_great_betrayal/",
    "created_at": "2025-08-05T13:49:20.000Z",
    "num_comments": 435
  },
  {
    "id": "reddit-1oo9yul",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "IBEW, we’re on the ballot for U.S. Senate in Illinois. You want change in Congress? The time is now.",
    "text": "I’m Jump Shepherd, IBEW 134. Card No. 6120695. I’m running for U.S. Senate in Illinois.\n\n- r/IBEW AMA:\nhttps://redd.it/1o3hkyl\n\n- r/Illinois AMA:\nhttps://redd.it/1nr1oxe\n\n\nBrothers, we turned in our 7,700 petition signatures on Monday and we’re entering Phase 2 of our campaign. We’re expanding the team, collecting donations, and getting out the vote.\n\nWe need union leadership in the Senate. There are no active union members in the Senate. Our middle class, our working class, our working people, are dying. And they won’t stop until we get ourselves in the door. Our representatives have betrayed us, and we’re taking America back from oligarchs and lobbyists and politicians who have sold us out for profit.\n\nI want to know what you expect from your U.S. Senator. Please ask questions, make comments and let’s have conversation. \n\nHere’s what we plan to do while we’re in office:\n\n1. Tax billionaires. We implement a 1950’s era 92% tax rate on individuals worth $50million or more. It includes a 5% wealth tax on billionaires and a 40% tax penalty for high value individuals who attempt to leave the country or move money to evade these taxes. 💰\n\n2. End the Pink Taxes against women. Eliminate unfair discriminatory taxes and pricing against women, including for menstrual and hygiene products, pregnancy, childbirth, childcare. Women will no longer have to pay to be women. We’ll reduce the costs of these expenditures to 0. 🎀\n\n3. Increased support for teachers and farmers. We increase the wages educators and farmers receive. In the wealthiest country in the world, we will have the best educators and best education. Eliminating quality of life issues such as low pay will increase the talent and results in those sectors. Implementing union ideals, structure, know-how will facilitate strong systems that allow for free and subsidized  secondary education, effective trade schools, and abolishing right to work states across America. 🌱\n\nIf you believe in the vision, support. Ask questions. Get involved. We’re here. We want universal basic income, we want universal health. We want every American to be able to take care of a family of four with 2 cars and a garage on one income. We want to restore wealth to working people and the middle class. We want the unions in office, because that is the key to success that’s been missing.\n\nSend a donation, be a part of the team, introduce us to someone we need to know! Anyone want to help create an IBEW shirt for the campaign?\n\nHere are the links to assist. Send us a message as well if you’d like to be on the team.\n\n- Donate at https://ActBlue.com/JumpForSenate\n- Official Website: https://www.jump4senate.com\n- Check out our TikTok at: https://www.tiktok.com/@jumpforsenate?_t=ZT-8yb78hsUvde&amp;_r=1\n- Read our Instagram Threads at: https://www.threads.com/@jumpforsenate\n- See more Links at: https://www.atom.bio/jumpforsenate\n\nWe will win. It’s not Red vs. Blue, it’s Oligarchs vs. You. 🫵🏽\n\nWhen you don’t have a seat at the table, you’re probably on the menu. 🇺🇸",
    "score": 2304,
    "url": "https://reddit.com/r/IBEW/comments/1oo9yul/ibew_were_on_the_ballot_for_us_senate_in_illinois/",
    "created_at": "2025-11-04T15:22:02.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1mym5pc",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "TRUMP CANCELING MORE UNION CONTRACTS… YES ELECTRICAL. MAKING US GREAT.",
    "text": "The Trump administration just halted a nearly completed offshore wind project set to power three hundred fifty thousand homes in Rhode Island and Connecticut, abruptly ending over twelve hundred union jobs. Forty five turbines are already standing, billions invested, but clean local energy has been tossed aside over vague national security claims. The move comes as a shocking setback for communities that spent years working toward affordable green power and a fair transition for workers.\nWhat makes this all the more infuriating is that Trump pledged during his campaign to oil executives that he would block wind and solar projects if re-elected. By sticking to that promise, he's delivered exactly what fossil fuel bosses want, despite the cost to jobs, families, and the climate. The cancellation sends a loud message: prioritize oil companies over clean energy, and ordinary Americans are left picking up the pieces.\nIn total, Trump's presidency has canceled over thirteen billion dollars in green energy projects, hurting working people, driving up utility bills, and undermining climate action across the country. This latest attack not only destroys jobs, but also delays meaningful solutions that help ratepayers and protect communities from extreme weather, all for the benefit of a handful of oil executives.",
    "score": 1960,
    "url": "https://reddit.com/r/IBEW/comments/1mym5pc/trump_canceling_more_union_contracts_yes/",
    "created_at": "2025-08-24T04:24:23.000Z",
    "num_comments": 264
  },
  {
    "id": "reddit-1ikvgeq",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Anyone do much lashing work?",
    "text": "I’m a 4th year apprentice. None of the journeyman wanted to do it and they know I’m good with ropes so I gave it a shot",
    "score": 1949,
    "url": "https://reddit.com/r/electricians/comments/1ikvgeq/anyone_do_much_lashing_work/",
    "created_at": "2025-02-08T19:30:38.000Z",
    "num_comments": 430
  },
  {
    "id": "reddit-1p5nyx3",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "IBEW, we’re cooking hot dogs for protesters and police at the ICE Facility near Chicago.",
    "text": "Support link: https://secure.actblue.com/donate/jumpforhotdogs 🌭\n\nIBEW, this is Jump Shepherd, I’m running for U.S. Senate. The last couple of weeks we’ve been visiting the ICE Detention Facility outside of Chicago. Peaceful, contentious at times, and full of good people. The only problem, there’s no food for protesters and police.\n\nWe want to fix that.\n\nHere’s what we want to do: cook hot dogs for protesters and police in support of our American right to protest and to bring attention to the ICE Facility and its need to go. Our aim is to get good food to the detainees during the holidays.\n\nWe already spoke to the police. No fire or cooking on-site is allowed. So the plan is:\n\t•\tCook beforehand\n\t•\tBring the food in\n\t•\tKeep everything warm at the protest zone\n\n**What we need (and where your support goes):**\n\t•\t500 hot dogs\n\t•\tFull Chicago Dog ingredients\n\t•\tChili\n\t•\tAluminum foil\n\t•\tSelf-serve table\n\t•\tVolunteers/servers\n\t•\tSpeakers + microphone\n\n**🇺🇸 FAQ:**\n\nQ: Is this an IBEW event?\nA: No. But we’re doing it anyway. If you’re a member, or a part of any union, and want to help, all are invited. This is an opportunity for those in here who are passionate and want to support the protests by serving good food to protesters, police, and detainees during the holiday season. We’re reaching out to others outside of the union as well.\n\nQ: You’re running for Senate? What?\nA: Yeah. I’m Jump Shepherd, I’m running for U.S. Senate. I’m a IBEW 134 electrician and I’m running to represent working people. I want to tax billionaires and bring the hoarded wealth at the top down to working people. I want to represent unions in the Senate and take America back from greedy politicians and lobbyists. I’m running for us. I’m running for you, brotha. \n\nQ: What’s your stance on ICE?\nA: I support a humane, service-focused immigration system that ends ICE’s punitive model by banning raids, stopping local police cooperation except for true public safety threats, closing abusive private detention centers, and replacing incarceration with community-based case management programs. I also champion an immigration system that provides a clear, affordable pathway to citizenship for longtime undocumented residents, Dreamers, TPS (temporary protected status) holders, essential workers, and families, expands and modernizes legal immigration, processes asylum claims quickly and fairly without detention, ensures humane border infrastructure, enforces full labor rights regardless of status, and addresses root causes abroad through anti-corruption, economic development, and climate-resilience investments rather than militarization.\n\nQ: Are y’all the ones acting all crazy, attacking police and all that?\nA: No. The hot dog station will be situated pretty far from the intersection between the police and protesters. We’re not getting involved in anything like that, we’re just here to feed hungry protesters and police.\n\nQ: Isn’t the facility very dangerous?\nA: We’ve been a couple times and it’s been chill. There will always be some protesters and counter-protesters looking for action, but we feel sharing a meal will quell the confusion, at least for a day. \n\nQ: Where can I donate to the hot dog fund?\nA: Right here → https://secure.actblue.com/donate/jumpforhotdogs\n\nQ: What is a Chicago dog?\nA: \n- Sesame seed bun\n- All beef frankfurter\n- Yellow mustard\n- Bright green sweet pickle relish\n- Chopped white onion\n- Tomato slices/wedges\n- Dill pickle spear\n- Pickled sport peppers\n- A dash of celery salt\n\nNo ketchup!! ❌\n\nQ: But what if I want ketchup on my Chicago dog?\nA: If you put ketchup on your Chicago dog, people will know you’re not from here.",
    "score": 1926,
    "url": "https://reddit.com/r/IBEW/comments/1p5nyx3/ibew_were_cooking_hot_dogs_for_protesters_and/",
    "created_at": "2025-11-24T17:53:33.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1latioy",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "ICE hurts IBEW members",
    "text": "I am proud to be a wireman. My profession has allowed me to help people and serve my community. Being an electrician is a big part of my identity. I love what I do.\n\nFor the past five years, my job has evolved from installing wires and devices to advocating for the men and women who work in my industry. I represent workers. I am married to my job. It is not easy, it is definitely not healthy, but it is important and often rewarding work.\n\nThe screenshots I shared with this post detail just a portion of an ongoing conversation I’m having with one of the workers I represent. This individual is an immigrant from Haiti. He is in this country legally. He is a fellow dues-paying member organization that I swore an oath to bear true allegiance to. He swore that same oath. He is experienced and credentialed in the installation of solar arrays. He’s my Brother.\n\nEarlier this year, I was tasked to assist in supplying manpower to a contractor in need of help. In the process of doing so, I helped this Brother find a job. It wasn’t necessarily easy. There were obstacles. Misunderstandings. Additional paperwork to file. There were barriers, namely language. But together, we were patient and persistent and we got it done. I didn’t do it alone and by no means do I deserve a ticker-tape parade to be held in my honor or even a goddamn cookie for my efforts, I was just doing my job. But my Haitian friend, he doesn’t see it that way.\n\nRead his texts. You’ll find genuine gratitude. Thankfulness. Honest appreciation. He’s not working an angle. He’s not using hollow flattery to curry favor so I’m more inclined to hook him up in the future. It’s sincere and it’s real. He was never looking for a handout. He was only searching for an opportunity to earn a fair wage performing dignified and valuable work. Not only does he work hard, he also acknowledged that he would pay it forward every chance he got. He’s not “taking our jobs”, he’s doing his job alongside us.\n\nYesterday, the Department of Homeland Security announced it has begun notifying hundreds of thousands of Haitians, Cubans, Nicaraguans and Venezuelans that their temporary permission to live and work legally in the United States has been revoked and that they should leave the country. I’m not yet certain how this announcement will immediately affect the Haitian workers I represent. Some may hold an alternate classification of protected legal status. But even the foreign workers who have been here the longest are at risk for deportation, as DHS Secretary Noem has shortened the deadlines and limited resources to file for legal extensions. It’s unlikely there’s a future in the States for these workers, and that sucks.\n\nI’m not an immigration lawyer or a policymaker, I’m just a wireman. But I’m also a human with a heart. I know good people when I meet them. I know the recent cruel and bitter treatment of nearly all immigrant workers, both legal and undocumented, is misplaced. I know ICE’s targeting of legal workers at job sites and courthouses is immoral as f#@k. I also know there isn’t a whole hell of a lot I can do about it, but staying silent isn’t an option. We must stand up for our fellow workers. This is a moment for solidarity. We have a right to speak out and protest. If we don’t use it, we’ll lose it.\n\nOur Haitian IBEW Brothers and Sisters would share stories about their homeland with their American coworkers during lunch breaks. They’d show them their bullet wounds and scars from injuries they suffered while protecting their families and neighbors from gang violence. At the moment, Haiti is a humanitarian nightmare. Whelp, the good ole U S of A is sending them back. Not just the criminals, either. All of ‘em. In defense of their actions, our elected leaders will scream, “America first!” I’m just wondering… first at what?\n\nDo something.",
    "score": 1738,
    "url": "https://reddit.com/r/IBEW/comments/1latioy/ice_hurts_ibew_members/",
    "created_at": "2025-06-13T22:50:45.000Z",
    "num_comments": 447
  },
  {
    "id": "reddit-1iwhnbw",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "If your local needs change internally say this.",
    "text": "Then watch the whole meeting go silent, to the point that a pin drops, and it rings like church bells. Watch the older crowd scoff, watch that guy or girl who has been asking for better negotiations shake their head like you are going for a touchdown at the lousiana bowl with bobby bouscher. Watch the brown noser get closer to an officer to cradle their buddies feelings. The boot lickers start looking around for a boot to lick. Right after all that happens, its time we pitch One member One vote, have individuals watch over our elections as you can have anyone watch in your corner. Learn more about the LMRDA, NLRA, Grievances, Past practice conditions protection, Fiduciary dut of representation and what that means, 29USC412, 29USC412, the safeguards against officers using general funds as slush funds or philanthropy funds for their own benefits. Etc.. if you want change its going to have to take action, dont do it alone and organize. If you focus on the people around you, you will see the change you want to see in your world.. it wont be easy you wipl probably be threatened, intimidated, retaliated against etc. Do what you can afford.  https://www.dol.gov/agencies/olms/compliance-assistance/interprative-manual/500-union-safeguards#:~:text=Based%20on%20this%20principle%2C%20a,Pa.",
    "score": 1660,
    "url": "https://reddit.com/r/IBEW/comments/1iwhnbw/if_your_local_needs_change_internally_say_this/",
    "created_at": "2025-02-23T19:03:42.000Z",
    "num_comments": 610
  },
  {
    "id": "reddit-1nx9jnb",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "IBEW Member Jump Shepherd is running to replace Dick Durbin in the U.S. Senate. He is asking for support from IBEW and local unions to support his team in their goal to represent unions and working class on a federal level.",
    "text": "",
    "score": 1629,
    "url": "https://reddit.com/r/IBEW/comments/1nx9jnb/ibew_member_jump_shepherd_is_running_to_replace/",
    "created_at": "2025-10-03T20:01:02.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1ktph4j",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Orange mf wants to mess with our lives",
    "text": "I worked so hard to get where I am at today I really don’t understand the low IQ individuals that vote for these clowns in Congress. I really don’t know how is this going to turn out but I Ain’t working in no inhumane job for 14 dollars an hr especially if they defund OSHA.  I’m taking my time this weekend to send a latter to my senator, hope you as well. ",
    "score": 1386,
    "url": "https://reddit.com/r/IBEW/comments/1ktph4j/orange_mf_wants_to_mess_with_our_lives/",
    "created_at": "2025-05-23T17:31:54.000Z",
    "num_comments": 671
  },
  {
    "id": "reddit-1jlwb0t",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "UPDATE: “Can you be at the office at 7am tomorrow”",
    "text": "I was terminated. I was provided two forms: one from the company and one from the state department of labor. The company one said I was fired due to reduction in force, the state one said due to poor work performance. I was never given a written reprimand, and in my 4 months there we failed inspection only once.\n\nI’m not upset, I know I’m a good electrician and I gave them 100%. \n\nOn a side note, anyone’s shop in the Denver metro hiring journeyman?",
    "score": 1334,
    "url": "https://reddit.com/r/electricians/comments/1jlwb0t/update_can_you_be_at_the_office_at_7am_tomorrow/",
    "created_at": "2025-03-28T14:25:55.000Z",
    "num_comments": 167
  },
  {
    "id": "reddit-1k4be78",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "WE DID IT",
    "text": "# IBEW Local 11 Passes Landmark Resolution to Mobilize in Defense of Immigrants\n\n**Los Angeles, CA** — In a bold and principled stand for justice, the members of the International Brotherhood of Electrical Workers (IBEW) Local 11 voted overwhelmingly at their general meeting to pass a resolution committing the union to mobilize in defense of immigrant workers facing attacks from government raids and racist groups.\n\nTitled the *Resolution to Mobilize in Defense of Immigrants*, the resolution affirms that immigrant workers are a vital and inseparable part of the labor movement and emphasizes the union’s duty to act in solidarity with all working people in the face of oppression.\n\n\"An injury to one is an injury to all,\" the resolution declares, echoing one of labor’s most fundamental principles. It states that planned immigration raids and anti-immigrant violence threaten the solidarity necessary for the strength and survival of the labor movement and the working class as a whole.\n\nThe resolution asserts that neither government institutions nor big-business political parties can be relied upon to defend immigrant workers from bigoted attacks. Instead, it reaffirms the role of unions as self-defense organizations for the working class, capable of organizing meaningful, independent action in defense of vulnerable members of the workforce.\n\nIn passing the resolution, IBEW Local 11 commits to exploring the best ways to mobilize its membership to protect immigrant communities under threat, whether from federal enforcement actions or racist violence, and calls on the broader labor movement to join in this critical effort.\n\n\"Solidarity means standing up, speaking out, and taking action,\" said a representative of Local 11 following the vote. \"We are proud to stand shoulder-to-shoulder with immigrant workers and make it clear: we will not be divided.\"\n\nThis resolution marks a significant step toward building a labor movement that is inclusive, militant, and ready to confront the injustices facing working people across all borders and backgrounds.\n\n*IBEW Local 11 represents thousands of electrical workers across Los Angeles County and is committed to the principles of solidarity, dignity, and justice for all members of the working class.*",
    "score": 1199,
    "url": "https://reddit.com/r/IBEW/comments/1k4be78/we_did_it/",
    "created_at": "2025-04-21T11:39:48.000Z",
    "num_comments": 599
  },
  {
    "id": "reddit-1ipq0oi",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "You lost one today",
    "text": "My dad died this morning after a great life. He was the rep for local 57 my whole childhood. He was union through and through. \n\nWhen I was a kid I remember sitting on his lap as he juggled me trying to unlace his sweaty lineman's boots. He used to mix Black Velvet with ice water in those tall, tan plastic Tupperware glasses. \n\nOne day he came home after his hooks cut loose and he had to bear hug the pole to not die. I remember my mom pulling slivers out of his forearms and chin. Apparently his thighs too but I didn't see that. He worked the next day.\n\nHe came home once with one of those blue foam and aluminum splints on his middle finger. I asked him what happened and he said a cross arm broke loose and smashed it. It broke his finger and split the skin bad enough he needed stitches. He worked the next day.\n\nLineman are built different. \n\nI worked my way up from the bottom in IT. I can't be in a union but I promote them constantly because of my dad. His union and his brothers were his world. He taught at the apprenticeship school until covid shut everything down. My dad was one of the good ones.\n\n",
    "score": 1178,
    "url": "https://reddit.com/r/IBEW/comments/1ipq0oi/you_lost_one_today/",
    "created_at": "2025-02-15T01:04:16.000Z",
    "num_comments": 87
  },
  {
    "id": "reddit-1lzpspo",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "And just like that “poof “gone.",
    "text": "So it’s my last couple weeks before I go for orientation at the local I got accepted into. I’m sitting there enjoying my lunch break and one of the journey men walks out to me and says, “Hey, you need to wrap up your lunch break, we no longer get 15 minute breaks and boss Man said if you want the 15 minute break you gotta work an extra 30 minutes”.\n\nThis is the bullshit I can’t wait to get away from. It just goes to show that without anything in writing, they can treat you however they want. \n",
    "score": 1102,
    "url": "https://reddit.com/r/IBEW/comments/1lzpspo/and_just_like_that_poof_gone/",
    "created_at": "2025-07-14T15:41:54.000Z",
    "num_comments": 175
  },
  {
    "id": "reddit-1i6anj4",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Elon Musk’s Nazi Salute.",
    "text": "is this something i should remember when he leads the us into adopting a no overtime pay rule",
    "score": 1026,
    "url": "https://reddit.com/r/IBEW/comments/1i6anj4/elon_musks_nazi_salute/",
    "created_at": "2025-01-21T04:35:47.000Z",
    "num_comments": 1081
  },
  {
    "id": "reddit-1ip8woz",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Remember Who You Treat Like Shit",
    "text": "So, years ago, before I was a shop owner, I had a fellow JW I worked with tell our foreman \"remember who you treat like shit so you're not surprised when they treat you like shit when they're your foreman\"\n\nI've tried to lead like that as an owner, but in a diff post I shared that a GF that tried to write me up for refusing to do hot work because \"it was too expensive to shut the machines down\" and put me on a DNR list just took a call for my shop.\n\nWhen he saw me come out of the office to have him fill out paperwork he looked panicked, now I don't do 90% of the manpower decisions in my company, my GFs do, but they all know who the guy is and one of them got written up by this guy for \"excessive foul language\".  So there's some bad blood between a few guys.  This former GF has a reputation for being a dick in our local as well.\n\nI'm not going to give him a reason to file a grievance, but I'll be damned if I didn't want to spin him when I saw his dispatch sheet come in my email.  But I figured I'd give him a chance.  So just a reminder to all you foreman, GF's, and JW's, apprentices and other JW's have long memories and you may end up working for one of them and your life could be miserable.  Treat people with decency and the respect they've earned.  Except Nazis.  Fuck those guys.",
    "score": 969,
    "url": "https://reddit.com/r/IBEW/comments/1ip8woz/remember_who_you_treat_like_shit/",
    "created_at": "2025-02-14T11:52:49.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1l7g0ig",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Here's another one for you",
    "text": "Pictured: Joslin, John. Union supporter. Two incidents. (1) Clubbed into unconsciousness and dragged across Mound Road by Sterling Heights police at the North Plant. Sustained severe head cuts. (2) Punched by a scab near the News building. Sustained bruises and a black eye.\n\nhttps://www.marxists.org/history/etol/newspape/atc/811.html",
    "score": 944,
    "url": "https://reddit.com/r/IBEW/comments/1l7g0ig/heres_another_one_for_you/",
    "created_at": "2025-06-09T20:46:11.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1iz08th",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "The conservative argument is that when workers win more rights and higher wages, businesses will logically want to move to places where they can pay lower wages and have less regulations on worker rights. So are pro labor states and countries destined to fail? Or how can we fight back against that?",
    "text": "",
    "score": 787,
    "url": "https://reddit.com/r/IBEW/comments/1iz08th/the_conservative_argument_is_that_when_workers/",
    "created_at": "2025-02-26T22:29:06.000Z",
    "num_comments": 498
  },
  {
    "id": "reddit-1pofm84",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "IBEW, the Illinois State Board of Elections knocked us off the ballot. We’re taking them to court.",
    "text": "I’m Jump Shepherd, IBEW Local 134. Card No. 6120695.\n\n**The Illinois State Board of Elections has struck us from the ballot for U.S. Senate.**\nThey struck us because we wrote our campaign address rather than our residential address in a box that doesn’t ask for our residence.\n\nIt sounds silly to me and you, and it’s an example of how election law works when they rely on people to give up at the first sign of adversity. **We’re appealing the decision, and challenging the Illinois State Board of Elections at the Cook County Circuit Court this week, on December 17th and 18th.**\n\n**The County is making the hearing public**, so voters and constituents can be in on the process of electoral law and be present when it’s challenged. \n\n**Get your popcorn ready, and pull up to support the campaign.**\n\nActBlue Link: https://secure.actblue.com/donate/jumpforsenate\n\n—-\n\n💻 1. December 17th, 10am CST:\n**Jump Shepherd v. Illinois State Board of Elections, Alivia Jones, Brayden Garza**\n\nZoom ID: 963 9239 3803\nPasscode: 043502\nZoom Call-In Number:\n312-626-6799\n\n💻 2. December 18th, 11am CST:\n**Jump Shepherd v. Illinois State Board of Elections, Pericles Abassi**\n\nZoom ID: 977 2570 0908\nPasscode: 821555\nZoom Call-In Number:\n312-636-6799\n\n—\n\nHere’s more info on the campaign event of the winter. Tell everybody that you know… it’s a party. This is what democracy looks like.\n\n**Edwardsville, Illinois: “Illinois lawmakers must fix broken ballot rules—now”https://www.theintelligencer.com/opinion/article/illinois-election-law-must-be-reformed-21237114.php**\n\n**Interview with Jump Shepherd by Cynthia Pooler, from New York’s “Issues that Matter” show: **https://youtu.be/9BdzbScWdtU\n\n**Donate to the campaign: https://secure.actblue.com/donate/jumpforsenate**\n\n**Additional links: \nhttps://www.atom.bio/jumpforsenate**\n\n—-\n\nIt’s not Red vs. Blue, it’s Oligarchs vs. You. 🫵🏽\n\nJoin the Revolution.\n\n**Support the campaign: https://secure.actblue.com/donate/jumpforsenate**\n\n—-\n\n**FREQUENTLY ASKED QUESTIONS:**\n\n**Q: Wait, so they said you didn’t get enough signatures to get on the ballot for U.S. Senate?**\nA: Our petition signatures were not challenged. Our objectors alleged that we wrote our campaign address rather than a home residence on the petition sheets themselves.\n\n**Q: Well, did you write the wrong address?**\nA: There are multiple places on the petition sheet and statement of candidacy that ask for “Place of Residence”, and in those areas, that’s exactly what we put—our residence. The area that’s being challenged simply says “Address”, with no indication of a specific type of address.\n\n**Q: When is the appeal hearing?**\nA: This Wednesday and Thursday, December 17th and 18th, and 10am and 11am, respectively.\n\n**Q: And wait, y’all are live streaming the event? Pretty ballsy.**\nA: The Cook County Circuit Court is providing the stream link; this is a public hearing. We’re letting folks know to pull up. To be honest, this isn’t about one challenge or campaign. But taking qualified candidates off the ballot for following the instructions of official paperwork exactly is a setup for us and future working people running for office.\n\n**Q: OK well before I support, what’s your policies anyway? Are you a Democrat?**\nA: That’s a good question. My top policies: A 92% tax on billionaires, repealing the Pink Tax that unfairly forces women to pay more than men, raise salaries for teachers and farmers, recognize Palestinian Statehood and establish a government office to audit where United States weaponry is being sent and how it’s being used, and use funds from those taxed billionaires to establish universal healthcare, universal basic income, and bring wealth back to our middle and working classes.\n\n**Q: Where’s the Zoom link?**\nA: This is what we’ve been provided so far by the Cook County Circuit Court:\n\n1. December 17th, 10am CST:\nJump Shepherd v. Illinois State Board of Elections, Alivia Jones, Brayden Garza\n\nZoom ID: 963 9239 3803\nPasscode: 043502\nZoom Call-In Number:\n312-626-6799\n\n2. December 18th, 11am CST:\nJump Shepherd v. Illinois Sate Board of Elections, Pericles Abassi\n\nZoom ID: 977 2570 0908\nPasscode: 821555\nZoom Call-In Number:\n312-636-6799\n\n**Q: Where can I support the campaign?**\nA: Check out our ActBlue link at https://secure.actblue.com/donate/jumpforsenate and links to our social media, website, etc. at https://www.atom.bio/jumpforsenate",
    "score": 760,
    "url": "https://reddit.com/r/IBEW/comments/1pofm84/ibew_the_illinois_state_board_of_elections/",
    "created_at": "2025-12-16T22:26:15.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1mk727p",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Tax on overtime",
    "text": "All overtime pay isn't tax free. Remember that word \"qualified.\"\n\nFor those of you working Double Bubble, you need to read and understand what “qualified” means. \n\nThe Fair Labor Standards Act, mandates at least \"time-and-a-half\" overtime pay for certain professions, but the act does not require \"double-time\" pay for overtime, as is required in some conditions under some labor contracts. As a result, only the half-time portion of overtime pay would qualify for the new tax deduction.\n\nSome people who work overtime will not benefit or benefit as much as others, including people who already owe no income tax, people whose income is in the phase-out range, and people who do not receive overtime in accordance with the Fair Labor Standards Act.\n\nFederal tax deductions for construction workers, as W-2 employees, for items like union dues, tools, work boots and unreimbursed work-related travel expenses, were suspended from 2018 through 2025 due to the Tax Cuts and Jobs Act (TCJA) of 2017. \n\nBecause most of y'all voted against your own best interests again, installing a dude who literally mocks the working class, veterans, disabled and pretty much everyone like you.\n\nYour taxes will stay the same and the people who need the least will get a bigger break than you’ll ever see in your lifetime. \n\nI guarantee you without hesitation those of you that voted for this clown will jump all over the opportunity to defend this with some bullshit cover-up reason.\n\n I just wish there was a way we could all sit in a room and talk this out because there’s absolutely no way, with all the facts in front of us that anybody supports this shit. #StayStrong, support the #LaborMovement and #Organize\n\nThe crazy thing to me is, the people who literally built and maintain America can’t write off on their Federal tax deductions for items like union dues, tools, work boots and unreimbursed for work-related travel expenses.\n\n- I might be a little late to the party but I thought the members here should see what the Henry Miller page had to say about this new bill.",
    "score": 666,
    "url": "https://reddit.com/r/IBEW/comments/1mk727p/tax_on_overtime/",
    "created_at": "2025-08-07T17:55:12.000Z",
    "num_comments": 193
  },
  {
    "id": "reddit-1m7e8ah",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Asked To Leave A Job As A Foreman",
    "text": "So, this is one of my favorite stories where I was politely asked to leave a job I was running. \n\nI was down to my third strike in about 2002 or so. I didn't want the first two because they were about 2 hours from my house and I was doing fine money wise. The call came in and it was with a contractor with a horrible name in the local, but I took it anyway, since it was my third strike, etc. I show up on the warehouse &amp; office space job and the first thing I notice is everything is piped in 1/2\"! I asked the foreman why and it turns out the first foreman quit and this guy was a residential upgrade that was still in the upgrade classes. He begged me to take the job over, but I said hell no. A few days later, the owner and PM show up and tell me they'll give me a truck and foreman's pay (10%), if I take the job over, so I did. \n\nWe finished that job and I go to the next one, which is a dental sales office. We had to saw cut and run everything under the slab to hook up chairs and all the stuff you see in a dentists office. I asked for a scope of work and the owner tells me to quit whining and just go off the print. No problem, dickhead. \n\nAfter about two weeks, the owner shows up and wants to know why it's taking so long. We argue a bit and he finally has someone bring out the scope. It's too much to list, but for example, the estimator had bid 26 receptacles and there were actually about 170. The owner and estimator come out and the kid estimator says, what's the big deal? It only takes a few minutes to install a recep and they're only a few bucks each. I asked him if he forgot all the conduit, wire, labor to get that recep ready to install? \n\nWe finished that job and lost quite a bit of cash on that one. So, off I go to the next one. It's an operating factory &amp; warehouse and we have to demo a ton of conduit, 1/2\" up to 4\", all loaded with wire. I split the wire with the building guy and me and my crew got about 10k out of it. Then we have to run new stuff for new equipment they have coming in. I was able to save some of it, but not much. Again, I'm asking for the scope of work and some help. This goes on for about three weeks. I got help but no scope. The owner calls and asks how it's going. I said I have no idea how far along we are because I don't have a scope. It seems to be going pretty good, but if the same guy bid this job, we could be in trouble. Hell, he couldn't bid receptacles right, how's he gonna bid something like all this equipment? I, of course, was laughing about it. Made some comments like, where did he get his degree, from a box of cracker jacks? Maybe a county fair at the goldfish pond? Bubblegum machine? Things like that. \n\nTwo days later, the owner shows up with a shop rocket. Talks to me for a few minutes and said this guy was going to take over my job because they had something closer to home for me. I walked the dude around for about a half hour or so. We go back to the owner, guy hands me a check! I've got his van! I'm like, what the fuck, dude? How the hell am I supposed to get home and why all of a sudden? Turns out the estimator was his son. That's the why. \n\nAs far as getting home, dude hired a limo to bring me two hours home! I made him stop at the hall so I could sign the books first. But I still laugh my ass off thinking this dude sent me home in a limo!\n\nI guess the guy technically didn't lie to me, it was closer to home. \n\nJust thought you brothers and sisters might get a chuckle out of this.\n\nIn solidarity.",
    "score": 616,
    "url": "https://reddit.com/r/IBEW/comments/1m7e8ah/asked_to_leave_a_job_as_a_foreman/",
    "created_at": "2025-07-23T16:40:55.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1iwt3hk",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Some Project 2025 Goodies for the working person",
    "text": "I can not believe our union leaders did not give us these shining examples of Project 2025 before the election. Just a small sampling of all the benefits of voting Republican. \n\nGuys, you have got to look into this Project 2025. I just looked at it and in 20 minutes I found:\n\n1) Get rid of OSHA, NLRB. Quote from 2025 \"End PLA requirements. Agencies should end all mandatory Project Labor Agreement requirements and base federal procurement decisions on the contractors that can deliver the best product at the lowest cost. l Repeal Davis–Bacon. Congress should enact the Davis–Bacon Repeal Act and allow markets to determine market wages.\"\n\n2) Get religious organizations involved in labor organizations I quote 2025 \"Encourage and enable religious organizations to participate in apprenticeship programs, etc. Both DOL and NLRB should facilitate religious organizations helping to strengthen working families via apprenticeship programs, worker organizations, vocational training, benefits networks, etc.\" They have that in Canada called CLAC, google it.\n\n3) Another one is get teenagers into high risk job training. I quote from 2025 \"Hazard-Order Regulations. Some young adults show an interest in inherently dangerous jobs. Current rules forbid many young people, even if their family is running the business, from working in such jobs. This results in worker shortages in dangerous fields and often discourages otherwise interested young workers from trying the more dangerous job. With parental consent and proper training, certain young adults should be allowed to learn and work in more dangerous occupations. This would give a green light to training programs and build skills in teenagers who may want to work in these fields. l DOL should amend its hazard-order regulations to permit teenage workers access to work in regulated jobs with proper training and parental consent.\" Of course they don't define the age group precisely. Like 13-19? 14-19? Hell why stop there, get them while they are young and start at 6.\n\n4) No OT on retirement or annuities. I quote 2025 \"Congress should clarify that the “regular rate” for overtime pay is based on the salary paid rather than all benefits provided. This would enable employers to offer additional benefits to employees without fear that those benefits would dramatically increase overtime pay.\" Of course this is why employers don't offer more benefits (sarcasm included).\n\n5) 40 hours will not define OT anymore. I quote 2025\" Congress should provide flexibility to employers and employees to calculate the overtime period over a longer number of weeks. Specifically, employers and employees should be able to set a two- or fourweek period over which to calculate overtime. This would give workers greater flexibility to work more hours in one week and fewer hours in the next and would not require the employer to pay them more for that same total number of hours of work during the entire period.\"\n\nLot more goodies in there for the working man/woman. Enjoy the fruits of your votes for the brothers (if I can call them that) that voted for these clowns.",
    "score": 522,
    "url": "https://reddit.com/r/IBEW/comments/1iwt3hk/some_project_2025_goodies_for_the_working_person/",
    "created_at": "2025-02-24T03:57:09.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1mx6a47",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "NO TAX on OT: Explained",
    "text": "If you work 2,080 straight-time hours at $50/hr, that’s $104,000. Add 500 overtime hours at time-and-a-half ($75/hr), that’s another $37,500, for a total of $141,500. For the “No Tax on Overtime” law, only the .5 premium ($25/hr in this case) counts toward the deduction. So 500 hours gives you $12,500 — the maximum allowed for a single filer. At a 22% bracket, that saves you about $2,750 in federal income tax (because it’s a deduction, not a tax credit — it lowers taxable income, it’s not cash back). Social Security, Medicare, and state income taxes are still withheld the same.\n\nThat 22% you hear about is just your federal income tax bracket on dollars in that range. Separately, every paycheck also has 7.65% for Social Security + Medicare taken out, and the new law doesn’t touch that. That’s why the savings are limited to income tax only.\n\nThis example assumes all 500 hours of OT are eligible. In practice, some OT won’t qualify:\n\t\nWeeks where you don’t actually work over 40 hours (like using vacation, holiday, or sick time). PTO counts as paid hours, but it’s not “worked hours” under the law.\n\nMinimum call-in pay (e.g. work 1 hour but get paid for 4) — only the hours actually worked are eligible.\n\nDouble time and any contractual premiums above 1.5x don’t qualify, although the law should still allow you to count the .5 premium portion of those hours.\n\nSo, realistically, it’s about the equivalent of a $1.32/hour raise if you hit the single-filer max. It’s better than nothing, but probably not what people imagined when they first heard “no tax on overtime.” A lot of folks thought they’d save 22% of their whole overtime check — tens of thousands in some cases. In reality, the maximum benefit is capped at about $2,750 for a single filer or $5,500 for a married couple assuming that couple worked 1,000 hours at that rate, equal to about $2.60 an hour on straight time.\n\nThis benefit starts in 2025 and sunsets after the 2028 tax year. The corporate tax benefits like the private jets deduction is permanent and obviously more important to the working class so our bosses can get around to keep making jobs for us :)",
    "score": 494,
    "url": "https://reddit.com/r/IBEW/comments/1mx6a47/no_tax_on_ot_explained/",
    "created_at": "2025-08-22T13:17:45.000Z",
    "num_comments": 184
  },
  {
    "id": "reddit-1ixti9w",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "4x8s no change in pay",
    "text": "I, for the life of me, dont understand why people are so pessimistic, if not hostile to the idea of working 4 8s with no change in pay. I understand the pessimism a little bit but to get upset about it? Is it just a boot licker thing? I am young, and an apprentice so a lot of my progressive ideas get dismissed a lot. But i am very educated and i understand that all the labor rights we enjoy now came at a time where workers had almost nothing, and were fought tooth and nail for. Its just so upsetting for people to be so unwilling to demand or even think of better.",
    "score": 483,
    "url": "https://reddit.com/r/IBEW/comments/1ixti9w/4x8s_no_change_in_pay/",
    "created_at": "2025-02-25T12:10:10.000Z",
    "num_comments": 244
  },
  {
    "id": "reddit-1lrmmjc",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Help. I need to charge $311 a billable hour to stay in business.",
    "text": "I run a residential service electrical company in TN. I took a look at my pricing (\\~$140 per hr) and after calculating all of my expenses: rent, office lady, health insurance, salary, lead cost, etc. It looks I need to charge around $300 a billable hour (about a 50% efficiency score) . What are you guys charging and how much do you make per year after it's all said and done?\n\nThanks for all the Input. Here are my numbers. Where should I trim? Or am I leaving too much out?\n\nElectrical Numbers\nOwner Salary:120,000\nDave’s Salary: 75,00\n Health Insurance: 16,350\nMarketing: 30,000\nVan Payments: 12,000\nAuto Insurance: 7,200\nLiability: 1,600\nRetirement: 25,000\nGenevieve Salary: 30,000\nConsumables:75,000\nGrowth:100,000\n=492,150\nX profit margin(23%)\n=605,344.50\n/billable hours (2000) 1000 per tech\n=302.67",
    "score": 464,
    "url": "https://reddit.com/r/electricians/comments/1lrmmjc/help_i_need_to_charge_311_a_billable_hour_to_stay/",
    "created_at": "2025-07-04T16:13:33.000Z",
    "num_comments": 609
  },
  {
    "id": "reddit-1kmgioj",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "\"Banking hours\" instead of overtime",
    "text": "I recently started at a very small shop, where the apprentice told me the owner refuses to pay overtime for weekends/anything over 8.\nHis solution, is to let you \"bank\" your hours and you can use them for straight time, for \"paid vacation time\"\nThis seems to be against our contract and he tells us to keep quiet about it.\nHow do you guys feel about this? ",
    "score": 426,
    "url": "https://reddit.com/r/IBEW/comments/1kmgioj/banking_hours_instead_of_overtime/",
    "created_at": "2025-05-14T14:25:43.000Z",
    "num_comments": 255
  },
  {
    "id": "reddit-1iqa5ik",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Union shop now being managed by non-union workers.",
    "text": "Collective bargaining agreement pre-negotiations are coming up for my shop.\n\nMorale is super low, and I feel like I’m doing shop steward work trying to get all the field workers on the same page. \n\nOur management currently has been widely taken over by a non-union competitor.  So their views are very different, we start at $43hr have a 30- month step program to get to our full wage.  Outside guys are making $54/hr+ benefits and Electric utility low voltage guys make $64/hr.  The non-union guys didn’t have an 8,000hr program and start at around $20/hr.\n\nThese non union guys leading us are whittling us down, turning crews against each other because we are so understaffed.\n\nHow is it possible to lift morale and get the fight back in our union guys.  Most are close to retirement and don’t seem to care to shake things up.  I’m hungry and at the start of my career, I’ve laid out a two page strategy how to get things back on track.  \n\nAny insight would be helpful, I’ve talked to the shoppies,  the last ones gave away all our benefits and kissed company ass.",
    "score": 408,
    "url": "https://reddit.com/r/IBEW/comments/1iqa5ik/union_shop_now_being_managed_by_nonunion_workers/",
    "created_at": "2025-02-15T20:12:19.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1hrc1bn",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "How did y'all do in 2024?",
    "text": "This year was a record breaking one for me. I basically doubled what I made in 2022 working my ass off at a steel mill.\n\nLong story short, I was happy with my last job, but it was super dangerous, stressful, big workload 24/7. Only paying me 32 an hour to do BOTH mechanical and electrical work.\n\nOctober 2022 we find out my wife is pregnant. Surprise! OK no problem, let's go house hunting so we can get out of our 1 bed apartment in the ghetto. \n\nAt 6 mos pregnant, her plant shuts down permanently and she's out of work. Goodbye house hunting...I'm stressing the fuck out on how I'm supposed to take care of the 3 of us on my salary alone.\n\nStart applying for jobs everywhere. Even out of state. Find the most ridiculous dollar/hr job out there and apply. Mind you, I had just hit my 5 year mark as an electrician (title, but still do mechanical work) at the time, so I felt like I for sure wasn't going to be as experienced or qualified as other applicants. \n\n2 months go by before I finally get the call to interview. Smash the interview. On a mission to raise my family and let my wife be a stay at home mom. \n\nOffer extended an week later. I accept. E&amp;I technician level VIII (top out).\n\nI've been here a year and a half now and I love it. After nearly 10 years in industrial maintenance in 3 different industries, I finally found a job that I actually enjoy AND pays me what I think is a pretty incredible wage for a younger guy with no fancy degrees or schooling apart from trade school and apprenticeship. I honestly feel like any good maintenance electrician should be making at least 100k a year base if they know their stuff and an asset to the team.\n\nI feel extremely blessed to have had this happen to me. And to anyone out there doubting themselves saying they can't find a better job or make more money because reason X Y or Z, if my sorry ass can do it, so can you! \n\nI wish an amazing 2025 for all my guys and girls rocking and shocking out there!",
    "score": 334,
    "url": "https://reddit.com/r/electricians/comments/1hrc1bn/how_did_yall_do_in_2024/",
    "created_at": "2025-01-01T20:44:24.000Z",
    "num_comments": 319
  },
  {
    "id": "reddit-1noeoti",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Why electricians salaries relative to median of all workers dropped since 2000?",
    "text": "looking at bls in 2000\n\nmedian hourly wage for all workers was 12.55  \nfor electricians it was 19.29\n\nso electricians in 2000 earned about 53% more than median worker\n\nwhile in 2024\n\nmedian hourly wage is 23.8  \nfor electricians it is 29.98\n\nso electricians in 2024 earned 26% more than median worker on median.\n\nWhy median electrician is in 2024 falling behind compared to 2000? Arent they like getting more in demand compared to other occupations?\n\nIts like electricians lost 17% of purchasing power in 24 years compared to other occupations.",
    "score": 180,
    "url": "https://reddit.com/r/electricians/comments/1noeoti/why_electricians_salaries_relative_to_median_of/",
    "created_at": "2025-09-23T11:22:27.000Z",
    "num_comments": 162
  },
  {
    "id": "reddit-1pd3wmk",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "wages",
    "text": "your wages are not high, or even close to high, if you put the average journeymans pay rate from 1980 where they were making 28$/ hour into and inflation calculator it comes out to 102.5$/ hour this is average we are talking about here. How? Everyones standard of living has improved look at all stuff thats been made since 1980! My point of this post is if you dont hold your delegates/ employers feet to the fire everyone gets burned, im not trying to turn this into a crusade but at this rate of decline everyone is going to be living in a room share or worse in the next 40 years. My point is that with inflation all the goal posts keep moving except salary doesn’t keep pace. one of the higher paid packages is 73.5/hour thats still about 30% less than what the same guy was paid in 1980, what happened? is there an over saturation of qualified people? thats not what im seeing if anything its the opposite. If you dont hold your delegates / owners feet to the fire everyone gets burned. Im old enough to remember the 90s and im concerned with the trajectory things are on. People know what im talking about but no one does anything, please dont accept another 40 year decline and dont think robots will do everything and we will just get paid to live by then - thats not how its going to shake out good luck out there\n~from some guy with decades in this field, a masters in two states and old enough to remember the 90s lol im qualified ",
    "score": 168,
    "url": "https://reddit.com/r/electricians/comments/1pd3wmk/wages/",
    "created_at": "2025-12-03T13:18:13.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1k2fqkw",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Sparky salary",
    "text": "Wassup sparkies ⚡️ (19M) I’m currently a first year apprentice in Cali &amp; make $21.50 an hour. I’m just curious as to what your salaries are &amp; if it’s non-union or not. Reason is because I see people claim to be making 150k a year while others are at 80k both JW. Just wondering is all ! ",
    "score": 161,
    "url": "https://reddit.com/r/electricians/comments/1k2fqkw/sparky_salary/",
    "created_at": "2025-04-18T21:09:51.000Z",
    "num_comments": 408
  },
  {
    "id": "reddit-1o34jjb",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I am sorry, but salary doesn't pay overtime in the US ? I am in Europe 🇪🇺 and I get overtime and I have a salary.",
    "text": "I littlerally left work four hours early today because there was nothing to do. I still get paid for those hours. And I get paid overtime. ",
    "score": 101,
    "url": "https://reddit.com/r/electricians/comments/1o34jjb/i_am_sorry_but_salary_doesnt_pay_overtime_in_the/",
    "created_at": "2025-10-10T15:46:20.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1i00ag8",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "What’s your salary (NO OT) and where are you located? ",
    "text": "i’m freshly 20, spent too much on a coding bootcamp and things are looking bleak / i lost a lot of interest. I don’t know if college is going to be my thing nor do i have lots of money or want to wait 4 years. \nTrying to decide if this or welding would be a good career choice for me.\n",
    "score": 84,
    "url": "https://reddit.com/r/electricians/comments/1i00ag8/whats_your_salary_no_ot_and_where_are_you_located/",
    "created_at": "2025-01-12T23:32:21.000Z",
    "num_comments": 551
  },
  {
    "id": "reddit-1nvcv1p",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "American electricians, is salary pay not a thing for trades in the USA ?",
    "text": "I read a lot of comments that said that they would love a salary or they wished when they were apprentices that they had a salary. Is salary more uncommon in the US ?In Austria pretty much everyone gets a salary. My salary is about 1900 after taxes.",
    "score": 46,
    "url": "https://reddit.com/r/electricians/comments/1nvcv1p/american_electricians_is_salary_pay_not_a_thing/",
    "created_at": "2025-10-01T16:25:10.000Z",
    "num_comments": 171
  },
  {
    "id": "reddit-1iwqx7n",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "How much were you making in the first 2 years as an apprentice ?",
    "text": "Hey you guys I live in SoCal, Los Angeles area,\n\nI'm 29 and I currently work as an armed security supervisor getting paid $30/hr with OT I'm averaging 75k to 80k a year after taxes. And l've been thinking about changing career fields, I have buddy's who are electricians and they've been in the trade for over 4 years and they are getting 40-50/hr with overtime. One can only wish to get paid that much so it was motivation for me to get into a trade preferably electrical. Also I'm not just doing it for the money I genuinely want to learn something new and I know when you're working a trade there is always something new to learn everyday so much potential for growth every single year, the problem is if I decide to switch fields ima have to take HUGE pay cut im talking about 40% pay cut from my annual salary, i don't mind taking the cut for the lst year and half if anything I know I will have to budget some how but how much were Yall getting paid after your first 2 years as an apprentice??? Non union workers. I was thinking as soon as I get my ET certificate to just apply right away to a shop or something just to start getting my hours in.",
    "score": 26,
    "url": "https://reddit.com/r/electricians/comments/1iwqx7n/how_much_were_you_making_in_the_first_2_years_as/",
    "created_at": "2025-02-24T02:02:41.000Z",
    "num_comments": 117
  },
  {
    "id": "reddit-1lutfz7",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "First job salary?",
    "text": "What was your guys first job salary? I just got hired as an apprentice and I’m at $17 a hour. \n\nWhat do you make now and how long have you been working there ? Just questions don’t wanna be too invasive lol I have no experience this is my first job and I also am only 19 ",
    "score": 20,
    "url": "https://reddit.com/r/electricians/comments/1lutfz7/first_job_salary/",
    "created_at": "2025-07-08T16:40:38.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1ochxgj",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Electrician to an electrical engineer?",
    "text": "I’m 26 years old and started electrical work 3 years ago. Went to trade school got my certification and school hours (non union). Ended up getting my state master license and opened up my own company but beating around the idea of going back to school to get an electrical engineering degree.. any benefits or am I wasting my time and money? Idea of owning my own company is great on paper but I just started and the first few years of ownership i’m sure will be hell. Is it worth it? Or better to just get a degree and take whatever 6 figure salary a company will give you with all the benefits? Thanks in advance.",
    "score": 16,
    "url": "https://reddit.com/r/electricians/comments/1ochxgj/electrician_to_an_electrical_engineer/",
    "created_at": "2025-10-21T16:40:32.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1kbsems",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "How do you guys handle biohazards?",
    "text": "Im likely getting a job for \"community safety\" and have been made well aware. Its an old timer that has been rat and mold infested (i cant condemn and i have no eyes on). Ill take double salary but i need me and my guy to be safe. Rats are being cleared before any other work is done. Ive made it clear i dont work around rotted rats. Id like to know if anyone has worked in a biohazard \"make safe\"\n\nEDIT: i worded this poorly. We inflated the budget heavily to account for all safety measures plus additional ppe. My ask was have you done biohazard and what have you used. I already set my base parameters. It's off hours this is just curiosity ",
    "score": 15,
    "url": "https://reddit.com/r/electricians/comments/1kbsems/how_do_you_guys_handle_biohazards/",
    "created_at": "2025-04-30T21:49:02.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1lti87r",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "ELECTRICIANS SALARY",
    "text": "all electricians I’m curious\n-What is your state of service \n-what is you net salary \n-how many years experience\n-would you open your own company later on",
    "score": 10,
    "url": "https://reddit.com/r/electricians/comments/1lti87r/electricians_salary/",
    "created_at": "2025-07-07T01:57:28.000Z",
    "num_comments": 150
  },
  {
    "id": "reddit-1l1z0gl",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Does this count towards Apprenticeship hours?",
    "text": "I’m looking around to get hired as an apprentice and found this job at an electrical products company. Would this count towards apprenticeship hours and then I can start an apprenticeship program at a vo tech?",
    "score": 6,
    "url": "https://reddit.com/r/electricians/comments/1l1z0gl/does_this_count_towards_apprenticeship_hours/",
    "created_at": "2025-06-03T01:03:00.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1psl3w1",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "questions for the Californians",
    "text": "got my Jcard in FL few years back, i do majority commercial and industrial work. The wife wants to relocate to CA for nursing, is it worth it on my end for the pay? I've checked site for average salary but its too broad of numbers. ",
    "score": 5,
    "url": "https://reddit.com/r/electricians/comments/1psl3w1/questions_for_the_californians/",
    "created_at": "2025-12-22T00:05:40.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1o42gaa",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Subbing vs employed pay",
    "text": "I'm in the UK. I've been subbing to one company for about 10 years and he's finally getting a bit worried about getting caught (as your only supposed to sub for 6 months max) by the tax man. I'm currently on between 200 and 250 a day depending where and what work I'm doing. I average about £51k a year but obviously I provide my own van, tools etc.  What do people think would be an equivalent wage as employed on a salary? He said he would be happy to provide a company van and probably about 25 days holiday plus bank holidays. Obviously he is going to have to pay a lot more National Insurance now and pay for holiday pay so I know my salary would be less than 51. It needs to be fair for both of us. Just wondering would people think would be realistic. Any advise would be appreciated ",
    "score": 4,
    "url": "https://reddit.com/r/electricians/comments/1o42gaa/subbing_vs_employed_pay/",
    "created_at": "2025-10-11T18:07:26.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1ok3l9u",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Any advice for someone who got offered a job out of the field.",
    "text": "I’ve been in the field for almost ten years, and just got offered a position as a project manager at a different company than the one I’ve been at for the last seven years. The company I’m at currently has been telling me about all these great opportunities I’m going to have, but they have been telling me this for the last two years and nothing has come to fruition. Haven’t even had a pay raise in that time, so I’m starting to feel like I’m being taken advantage of. That’s why I started applying for more leadership/office positions with different companies. Today, I got offered a new job to be a PM with one of the larger companies in my area and am asking for advice or stories from anyone else has gone through this change. It’s a position in the office, so that will be a huge change. Pay is comparable to what I make now, but the benefits are much better. 75% of insurance paid for me and my whole family, 100% match up to 6% for 401k, company vehicle, and an annual bonus based on performance. I would also be going from hourly to salary which is the scariest thing in my eyes, so any advice there is much appreciated. Any and all advice is appreciated from anyone who has made this swap before. Wondering what I should negotiate, any questions, or what other peoples pay/benefits are in this position if you are comfortable sharing that info or maybe some things I may not have though about going from the field to the office. ",
    "score": 4,
    "url": "https://reddit.com/r/electricians/comments/1ok3l9u/any_advice_for_someone_who_got_offered_a_job_out/",
    "created_at": "2025-10-30T15:59:12.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1ohrv1z",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "On the job training",
    "text": "I am looking to find a company in Philadelphia that does on the job training. I’m 31 and I’m currently a chef, but I can’t physically or mentally do this anymore. It’s literally killing me. The only thing is that I make a decent salary (80k/yr). It’s not worth it tho. I work 12-14 hours a day and then work from home on my days off. It is not worth the time I am putting in. Also I have a 2 year old and another baby on the way in December. I am completely unsure of what to do, but I do know I want out of the culinary life and I want to get into union electrical/hvac work where I will actually get paid for my time and actually have a work life balance to spend time with my family",
    "score": 3,
    "url": "https://reddit.com/r/electricians/comments/1ohrv1z/on_the_job_training/",
    "created_at": "2025-10-27T21:57:33.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1j11tcs",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Starting a career at 42?  Thoughts?",
    "text": "Prior military (10 years fighter jet avionics and 10 year IT security).  \n\nBeen out for a few years and looking for a possible new career.\n\nI very much enjoyed the electronics work I did and was thinking about possibility starting the journey to become an electrician.  I can't stand IT security and need to be physically working to be happy.\n\nI have a BS in Aeronautics and three associates in electronics and sciences.\n\nWhat do you think the possibilities of an old man like myself getting started in an entirely new career?\n\nThoughts on where to get training? \n\nThoughts on salary to expect?\n\nAlso any advice at all would be greatly appreciated.   Thx in advance!",
    "score": 3,
    "url": "https://reddit.com/r/electricians/comments/1j11tcs/starting_a_career_at_42_thoughts/",
    "created_at": "2025-03-01T15:22:18.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1mcvgzz",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Electricians Quebec",
    "text": "Im having this dilemma I’m 22M I currently work in Nunavik (nothern Quebec) in a basic field(non trade) and make 4K (from what I understand basically a journeymen’s wage) a month, my work is mildly physical and overall chill. I’m basically maxed out in terms of salary for my position so my future doesn’t have a promising ladder. My work is mentally pretty boring \n\nBut I signed up for public electrician school around 2-3 years ago and my call to finally get in is coming up within a couple months\n\n it’s hard for me to justify going back to school for 2 years and making nothing after school for probably another 2-3 years(apprenticeship). I’m basically maxed out in terms of salary for my position so my future doesn’t have a promising ladder. \n\nThe real positive I see from becoming a electrician is you do have a future there’s a large ladder to climb (apprentice - journeymen - master electrician - red seal electrician) and from what I’ve read (please correct me if I’m wrong) electrician isn’t just slave SUPER physically demanding(of course it’s physical but you know) and you actually use your head a bit which is a positive for me\n\nThe negatives really are just starting pay and those years to materialize a good wage. job security I’ve heard from others job security can be difficult in Quebec. \n\nSo really my question to you all is do you think it’s worth it to leave my comfy but boring job making 4000$ a month to become an electrician and work my way up the ladder? \n\nI’d really like to hear others opinions. Young apprentices or old Journeymen any and all are welcome to share what they think. Was it worth it? If you could go back would you do anything differently? Are you able to live in Quebec as a journeymen comfortably? If you could go back would you chose a different trade etc etc! \n\nThanks \n\n",
    "score": 3,
    "url": "https://reddit.com/r/electricians/comments/1mcvgzz/electricians_quebec/",
    "created_at": "2025-07-30T02:58:56.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1o30ql2",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Should I switch careers??",
    "text": "experienced Electricians. \n\nIm 35, and make about 70k a year as an operations Superviser in a warehouse environment, the  benefits are good, the salary if cool but I'd like to be making 90k plus. I work 3 (12 hours shifts a week) and get great work life balance. But something in me keeps  pulling me toward this trade  skill. I love to working with my hands and do alot of DIY projects. From those who have been successful, does it make sense for me to switch into this field  or am I tripping and should enjoy where im at?",
    "score": 2,
    "url": "https://reddit.com/r/electricians/comments/1o30ql2/should_i_switch_careers/",
    "created_at": "2025-10-10T13:20:43.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1jctc6f",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Los Angeles Apprenticeship Programs (need advice)",
    "text": "**Hi everyone,**\n\nI'm planning to start my journey as an electrician this spring and have a few questions.\n\nI've done some research (GPT, Reddit, YouTube), and here’s what I found:\n\n1. **Best places in LA to train:**\n   * IBEW Local 11 &amp; LA Electrical Training Institute (LAETT)\n   * WECA (Western Electrical Contractors Association)\n2. **Best programs (for me):**\n   * Commercial Electrician (at WECA)\n   * Inside Wireman (at IBEW Local 11) *(I believe this is essentially the same as Commercial Electrician)*\n\nI'm considering these programs because they seem to offer the best balance between salary, work conditions, and job opportunities. Other options like residential, low voltage, and lineman apprenticeships seem less balanced in my opinion, even though they are shorter.\n\nI have a bachelor's and master's degree in Electrical Engineering, but I earned them abroad, so I assume they won’t make much difference in my electrician career here in the U.S. Also, as a foreigner, I’m unfamiliar with the whole **union vs. non-union** debate and which is better.\n\nI haven’t had the chance to consult with a real person yet, so I’d really appreciate your insights on:\n\n* Which institution and program you’d recommend\n* Pros and cons of each\n* Any advice you might have\n\nThanks in advance!",
    "score": 2,
    "url": "https://reddit.com/r/electricians/comments/1jctc6f/los_angeles_apprenticeship_programs_need_advice/",
    "created_at": "2025-03-16T19:20:54.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1krn3n9",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "RANT/Discussion",
    "text": "TL;DR roast me into reality, starting an electrical contracting business is way out of the realm for me, long days/weeks doesn’t scare me away but not having touched the work and being so far removed and a potential lack of income + start-ups costs does. \n\nI’ve been in the trade since 2011. Bounced around early on but majority of early career/apprenticeship was spent working for a mechanical contractor, close to a decade, few years of solar installs, few years of HVAC Controls, sprinkled in with random electrical work as required (RTU swap outs, small commercial roughs/fit-outs, etc), I left for a year to work for a smaller elec outfit but wound up back as it was a really good company hence the almost decade of employment. \n\nThey eventually offered me a role as commercial PM/Estimator for mechanical work. I was reluctant as I had recently been licensed and was planning on leaving for an elec firm to keep growing/expanding, but it seemed like a good opportunity with good growth potential, stuck with it for a few years then left for a large commercial electrical contractor in a PM role, this was a money move more than anything, wasn’t a fan of the office life and was hoping getting back into electrical would change that, it didn’t, same BS. This is where I really started flirting with getting my contractor license and going on my own, ordered some study materials, booked the test, grabbed a domain name, close to filing an LLC., my hesitation was that now I have a family that relies on my income and the initial start-up costs and having to go for it while I haven’t had the tools on or been chasing side work, quitting the safety net of a regular paycheck, too much risk I felt for the stage of life I’m in. So while I was checking the boxes and queuing up this potential shift I did a quick indeed search and a local CM/GC that I was familiar with, was great to deal with, was hiring and since the office side seemed to be all the same BS I figured why not and threw my hat in the ring to see what would happen, well they bit, I threw out what I felt was a high salary and they accepted. It’s been 2 years now, and it’s so much worse, I don’t even feel like I’m building anything anymore, dealing with varying degrees of architects and owners reps, non stop meetings with follow up, chasing deadlines and dates, sub par sub contractors, not being able to be as efficient as I would like to be in everything I touch because of the amount of things requiring management.\n\nAll of this, and recently renewing my license and taking me CEU has me dreaming of trying to go on my own again but realistically I know it isn’t feasible, again, I haven’t had my tools on it 5 maybe 6 years, have barely grazed the code book in the same amount of time, and have zero clients/side work to gain any traction with and no time to try to build that up.\n\n**end rant**",
    "score": 2,
    "url": "https://reddit.com/r/electricians/comments/1krn3n9/rantdiscussion/",
    "created_at": "2025-05-21T02:33:22.000Z",
    "num_comments": 3
  }
]