[
  {
    "id": "reddit-1igvsux",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Repost because some of yall seem to think IBEW is gonna just bend over and take it",
    "text": "I'm not concerned in the slightest about the political climate regarding unions because as much shit that we talk on jobsites to each other and other trades, there's no way in hell we'll accept bullshit",
    "score": 31317,
    "url": "https://reddit.com/r/IBEW/comments/1igvsux/repost_because_some_of_yall_seem_to_think_ibew_is/",
    "created_at": "2025-02-03T18:18:00.000Z",
    "num_comments": 1385
  },
  {
    "id": "reddit-1l7d53t",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Here we are 35 years later and the assault on unions and the working class by the owners has only escalated.",
    "text": "There are more of us than there are of them, and we need to stand united as one labor movement. They’re trying to stomp out unions altogether, and the only thing standing between them and succeeding is us. ",
    "score": 9939,
    "url": "https://reddit.com/r/IBEW/comments/1l7d53t/here_we_are_35_years_later_and_the_assault_on/",
    "created_at": "2025-06-09T18:56:26.000Z",
    "num_comments": 269
  },
  {
    "id": "reddit-1jj5qvq",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Career day",
    "text": "Heres my career day booth i put together! I had a lot of fun putting it together and a ton of kids were very interested and had fun playing around with the switches. \n\nI was surprised at how many kids told me they have been shocked… one kid told me his outlet sparks everytime he plugs things into it! 😆 i was like, “that definitely needs to be checked out”….\n\nAll in all the kids said I had the best and most fun table so i’m glad they enjoyed it! \n\nThe table was a low voltage set up so it was safe for the kids to touch and mess with. ",
    "score": 9240,
    "url": "https://reddit.com/r/electricians/comments/1jj5qvq/career_day/",
    "created_at": "2025-03-24T23:44:47.000Z",
    "num_comments": 333
  },
  {
    "id": "reddit-1l9y6w5",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Conservatives have gone full white nationalist. About one third of IBEW members are non-white, descendants of immigrants from non-white countries. They are legal, American, and union brothers. Thoughts from the Republicans on this sub that assured me they were only against illegal immigration?",
    "text": "",
    "score": 8822,
    "url": "https://reddit.com/r/IBEW/comments/1l9y6w5/conservatives_have_gone_full_white_nationalist/",
    "created_at": "2025-06-12T21:16:56.000Z",
    "num_comments": 1223
  },
  {
    "id": "reddit-1jzv52l",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "The real post; not some 72 year old",
    "text": "About a week ago, this photo was posted saying that a 72 year old electrician built this in a day. That is simply not true. I am the electrician who, with his apprentice, built this. It took us a week to put this together, and before any criticism starts, I had the full blessing of my foreman and my GF. I am a union wireman, and I was 36 when I built this. Just figured I would let you know. I am the op of this post from about 3 years ago. Thanks all, please upvote so people know the truth. ",
    "score": 6696,
    "url": "https://reddit.com/r/electricians/comments/1jzv52l/the_real_post_not_some_72_year_old/",
    "created_at": "2025-04-15T15:43:30.000Z",
    "num_comments": 258
  },
  {
    "id": "reddit-1o3hkyl",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I’m Jump Shepherd, IBEW 134. I’m running for U.S. Senate in Illinois to tax billionaires and restore wealth to the middle class. AMA.",
    "text": "https://preview.redd.it/smcr7b0bmduf1.jpg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=da77327c800d8cfb221c8583760215f370ca546b\n\n# Reddit AMA\n\n**It’s not Red vs. Blue, it’s Oligarchs vs. You 🫵🏽**\n\n[Link](https://www.reddit.com/r/illinois/comments/1nr1oxe/im_jump_shepherd_im_running_for_us_senate_im/)\n\n---\n\n[Donate on ActBlue](https://secure.actblue.com/donate/jumpforsenate)\n\nHi Reddit! 🇺🇸\n\nI’m Jump Shepherd, and I’m running for U.S. Senate. I’m running to replace Dick Durbin in the Senate and fight against Donald Trump.\n\nI’m not a politician. I’m an IBEW Local 134 electrician and I’m frustrated with our representation in Congress. We need more working class members in Congress. There are no active union members in the Senate, and we all know the unions are the backbone of the middle class. We have more than the 5000 signatures to get on the ballot for U.S. Senate. The time is now.\n\n---\n\n* 🦺 CHICAGO, ILLINOIS — Formerly known as Wesley Red—educator, astronomer, and electrician — but certainly not a politician.  \nAn active speaker and community organizer, Chicago Federation of Labor delegate, and Electrical Workers Minority Caucus member who frequently donates his Saturdays giving back to the community through volunteer electrical work, church engagement, and food pantry service. He’s no stranger to the neighborhood!\\*\n\n[Donate on ActBlue](https://secure.actblue.com/donate/jumpforsenate)\n\n---\n\n### 🔑 Top Policies\n\n**The Billionaire’s Bill**  \n1950’s era 92% top tax bracket after first $10 million in income.  \n5% wealth tax on billionaires. 💰\n\n**The Pink Tax**  \nWomen will no longer have to pay a tax just for being born with ovaries. That includes increased prices on razors and deodorant, but also on the hidden costs of pregnancy, childbirth, and more. 🎀\n\n**Teachers and Farmers Bill**  \nSets minimum wage for farm workers and teachers.  \nCreates subsidies for small farmers to compete with corporations and grants for teacher education. 👩🏾‍🌾\n\n---\n\n### ❓ FAQ\n\n**Q: What moment in your life made you realize that regular working-class people like you needed to be in the Senate?**\n\n **A:** The day I should’ve died.\n\nAnother apprentice and I were told to work on a switchgear live, something that even master electricians should not do, when his screwdriver created a path. BANG! The 500 gauge wire exploded with a flash, but shell shock insured I didn’t hear a thing. We were both knocked back and scurried to the opposite wall of the tight, rectangular electrical closet. BA-BANG!! Two more explosions and we quickly realized the breakers were not going to trip and cut power to these wires. We dashed into the even tinier electrical room offset from this one to gather our bearings. Mere seconds later, smoke began to billow in near the ceiling as flaming cardboard embers wafted in. The wires continued to discharge just outside. We had to go. We glanced at each other and knew words were unnecessary. We dashed past the switchgear to make it to the basement hallway and he got clipped by an explosion on his way through. He fell with a Ute and I jumped over him, hoping he would get up and get out. I dashed down the hall to a distance I felt safe, and looked back. He wasn’t behind me! I had no choice, I went back to the closet, yelled his name 2-3-4 times! No answer! The flames started pushing me back and I had to retreat upstairs to where the rest of the construction workers were. I yelled for everyone to leave the building NOW and reprimanded my foreman for putting two APPRENTICES in a situation like that. My partner showed up, I hugged him, and we got out of there. The owner of the electrical contractor called me later that day threatening me with counter-suits if I attempted legal action against him. I called him cold and heartless because the first thing he had to say to his employee that almost just died was a threat. I then said I didn’t plan on suing and he laid me off. He was cold and calculating. He had me replaced by the next day.\n\n**This is a microcosm of the power corporations have over individuals and over our legislation. It feels to most of us that we don’t have any power over what happens in Congress. It’s time to change that.**\n\n---\n\n**Q: You’re an engineer, a union member, a husband—why risk it all to run for office now?**  \n**A:** We are out of time. Our country is $35 Trillion in debt and Trump’s stacked Congress is cutting Medicaid and still running a deficit to give his billionaire friends even greater tax breaks, making his expiring obscene 2017 tax breaks permanent.\n\nThe risk is not in running to save our country. The risk is in doing nothing.\n\n---\n\n**Q: Your platform leads with bold policies: taxing billionaires, empowering teachers and farmers, ending the Pink Tax. Why these issues specifically?**  \n**A:** Women are treated as second class citizens in our country, the greatest country in the world. No more.\n\nTeachers and farmers are the most important, most under-appreciated people in our country. Teachers raise our children and farmers feed the world. It’s time they get the respect they deserve.\n\nBillionaires have been eroding our middle class for half a century. Thanks to them, we spend a trillion dollars every year *servicing* our debt, let alone ever paying it off. It’s time they chipped in.\n\n---\n\n**Q: You’ve never held elected office. What do you bring to the Senate that seasoned politicians don’t?**  \n**A:** I was raised in a house that struggled to keep the heat on in the winter. My mom ALWAYS went without so that we could have. I worked HARD to get my degree in physics and to earn my spot in the IBEW.\n\n98% of senators have never been working class. You ask what I bring to the Senate?\n\n**Grit.**\n\nSome would say running without money or connections is a long shot. I say running on a platform that steals from your constituents is the real long shot. Running on a platform of “not rocking the boat” or “waiting your turn” are far more dangerous to your political career and to the people you represent.\n\n---\n\n**Q: If elected, how will voters know you stayed true to the same Jump Shepherd who started with nothing but a vision and a voice?**  \n**A:** You will see it every day in my actions. There will be no question, and in fact, others will be inspired by my passion to answer the call to serve.\n\n---\n\n### 🔗 Links\n\n🌐 [Website](https://www.jump4senate.com)  \n💳 [Donate on ActBlue](https://secure.actblue.com/donate/jumpforsenate)  \n🎥 [TikTok](https://www.tiktok.com/@jumpforsenate?_t=ZT-8yb78hsUvde&amp;_r=1)  \n📝 [Threads](https://www.threads.com/@jumpforsenate)  \n📚 [More Links](https://www.atom.bio/jumpforsenate)\n\n---\n\n**It’s not Red vs. Blue, it’s Oligarchs vs. You 🫵🏽**\n\n&gt;It’s been a lot of fun talking to everyone, this is our town hall. If you believe in the message, donate to the campaign. We’re true grassroots, won’t take a dollar from AIPAC or the energy industry or any special interest group that’s an existential threat to our way of life, and every dollar goes so, so far. \n&gt;\n&gt;And remember;\n&gt;It’s not Red🔴 vs Blue🔵, \n&gt;it’s Oligarchs💰 vs You🫵🏾. ",
    "score": 5300,
    "url": "https://reddit.com/r/IBEW/comments/1o3hkyl/im_jump_shepherd_ibew_134_im_running_for_us/",
    "created_at": "2025-10-11T00:22:33.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1lmypbx",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Does everyone realize hundreds of thousands of union jobs are about to be lost?!",
    "text": "Adding a 20% tax on all existing solar/wind projects is going to cancel alot of projects! This is on top of removing the 30% subsidies we have on solar at the moment! \n\nA 45% increase in cost will destroy the industry! ",
    "score": 5036,
    "url": "https://reddit.com/r/IBEW/comments/1lmypbx/does_everyone_realize_hundreds_of_thousands_of/",
    "created_at": "2025-06-28T22:06:35.000Z",
    "num_comments": 1137
  },
  {
    "id": "reddit-1k1kzdf",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Found out why my friends problem customer such a problem customer",
    "text": "My friend’s company recently completed a series of jobs for a family near him, which unfortunately resulted in an excessive number of warranty claims.\n\nThe previous time they made a claim, they asserted that a loose wire had nearly caused a house fire and even discarded their lawyer’s card. Upon visiting the house, my friend noticed that a photocell, which wasn’t installed  by them, had been installed on the light.\n\nToday, while I was on a job for my own company, I drove by the house and encountered a man adding a receptacle from the light. I pretended to be a prospective customer and asked him for his card. he turned out to be the local handyman who handles all of this particular customer’s electrical work as he says. He says he doesn’t need to pull permits for any of the work he does\n\n",
    "score": 3995,
    "url": "https://reddit.com/r/electricians/comments/1k1kzdf/found_out_why_my_friends_problem_customer_such_a/",
    "created_at": "2025-04-17T19:09:35.000Z",
    "num_comments": 209
  },
  {
    "id": "reddit-1kqhl7o",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "the one where i evacuated a high school twice in one day",
    "text": "in late 2021 we were doing maintenance on a 100+ year old high school. i had to open up the mains can to take thermal photos. it was one of those fancy spring-loaded disconnects. i figure when i opened the door it opened the mains because of said disconnect. honestly i thought i was dead when everything went black lol. \n\nthe Jman i was working under instructed me to engage the spring mechanism and reconnect the mains. the power was out for maybe 2-3 minutes. not the end of the world. however the work had kicked up some dust, which made its way into the transformers. the smoke then set off the central fire alarm. luckily there weren’t any flames, it could have been way worse. we were asked off site shortly after. \n\n(don’t @ me, i was a young ape simply following instructions)",
    "score": 3381,
    "url": "https://reddit.com/r/electricians/comments/1kqhl7o/the_one_where_i_evacuated_a_high_school_twice_in/",
    "created_at": "2025-05-19T17:27:11.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1lzyb41",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Is it normal to work live electrical equipment naked?",
    "text": "I’m a first year and still pretty green.  I got sent to work with our special projects journeyman and he’s pretty eccentric to say the least.  \n\nSo the context is there were multiple transformers fed off a tap so there was no way to isolate our transformer without killing all of them which fed different tenants.  \n\nWhen it came time to disconnect and then later reconnect the feeder my journeyman set down a pallet with some cardboard and stripped down butt naked to make the connections.  \n\nHe explained that an arc flash is 30k degrees and that if you’re not wearing PPE then you’re wearing fuel and that being naked is better than wearing normal clothes.  I asked him why he didn’t just wear PPE and he pointed at his genitals and said, “cause I’m a man.”  \n\nIs this normal behavior? ",
    "score": 2939,
    "url": "https://reddit.com/r/electricians/comments/1lzyb41/is_it_normal_to_work_live_electrical_equipment/",
    "created_at": "2025-07-14T20:56:03.000Z",
    "num_comments": 424
  },
  {
    "id": "reddit-1jvacil",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Never seen this tag before. On a 45 year old piece of switch gear running 4k amps we are gonna have to tear into. Plant thought we could work on it live with a suit and no shutdown, guess no one there can read.",
    "text": "Literally first thing I saw when I walked up to it. Got 8 hours to walk in and read a tag and now the plant doesn't know wtf to do. Hilarious and expected. ",
    "score": 2575,
    "url": "https://reddit.com/r/electricians/comments/1jvacil/never_seen_this_tag_before_on_a_45_year_old_piece/",
    "created_at": "2025-04-09T16:41:30.000Z",
    "num_comments": 304
  },
  {
    "id": "reddit-1mi9pth",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "The Great Betrayal",
    "text": "Message from IBEW President Kenneth Cooper:\n\nhttps://ibew.org/electrical_worker/the-great-betrayal/?ref=ew&amp;fbclid=IwQ0xDSwL-6wRleHRuA2FlbQIxMQABHhNn3ArnZuL-6L7J5u8xjQ0D9BjNdN-x7BDfllZ2sSNRbPuNAmi00ar2dZ9F_aem_gye_Aw1D-ljYKtB-XJj-Mw\n\nWhen Donald Trump took the oath of office the first time eight years ago, I had serious concerns that he would turn out to be just another Republican president with handouts for the rich and the back of his hand for the rest, but I was willing to see if he kept his promises to working families.\n\nI was willing to give him a chance because that’s all that working men and women needed, what the members of the IBEW needed. A chance.\n\nI saw enough in his first term to make up my mind that there were better options for the IBEW.\n\nBut nothing, I mean nothing, in his first term — nothing in my more than 60 years as an American citizen — comes close to the budget bill he just signed as a betrayal of everything I believe government should be for.\n\nNot only will this bill kill hundreds of thousands of jobs that would have been IBEW jobs, but it will rip the rug from under a generation of would-be apprentices and billions of dollars of our wages will evaporate.\n\nThis isn’t just about the elimination of union-friendly tax incentives for clean electric generation jobs.\n\nThis is the wholesale abandonment of a project to electrify our economy that would have made us the competitive marvel of the world with the kind of blue-collar careers we haven’t seen in generations.\n\nNow it’s in tatters.\n\nAnd why? What is it all for?\n\nThey’ll say they made overtime tax-free. But it isn’t true.\n\nYou still pay payroll taxes on overtime, and the maximum deduction is $12,500, getting smaller the more you make. But who’s working overtime when they’re sitting on the bench?\n\nAnd it excludes rail workers. And it ends in 2028, after the next presidential election.\n\nYou know what doesn’t have a $12,500 maximum? The deduction they left in to alleviate the struggle of owning and operating a private jet.\n\nAnd you know what doesn’t expire? The $960 billion tax cut for the wealthiest. Their tax cut is forever.\n\nWages will fall, and tariffs will drive prices up. The average family’s energy bill will go up significantly over the next half-decade, and more than 300 rural hospitals will shutter.\n\nThis so-called One Big Beautiful Bill is the greatest transfer of wealth from working people to the rich in our nation’s history.\n\nSo many of our members wanted to believe that Donald Trump was different. An elite who would betray his own in favor of us for once.\n\nThis is the great betrayal.\n\nTrump and the Republicans betrayed you and me. The billionaires and their families? They’ll be fine. \n\nKenneth W. Cooper\nInternational President",
    "score": 2538,
    "url": "https://reddit.com/r/IBEW/comments/1mi9pth/the_great_betrayal/",
    "created_at": "2025-08-05T13:49:20.000Z",
    "num_comments": 435
  },
  {
    "id": "reddit-1oo9yul",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "IBEW, we’re on the ballot for U.S. Senate in Illinois. You want change in Congress? The time is now.",
    "text": "I’m Jump Shepherd, IBEW 134. Card No. 6120695. I’m running for U.S. Senate in Illinois.\n\n- r/IBEW AMA:\nhttps://redd.it/1o3hkyl\n\n- r/Illinois AMA:\nhttps://redd.it/1nr1oxe\n\n\nBrothers, we turned in our 7,700 petition signatures on Monday and we’re entering Phase 2 of our campaign. We’re expanding the team, collecting donations, and getting out the vote.\n\nWe need union leadership in the Senate. There are no active union members in the Senate. Our middle class, our working class, our working people, are dying. And they won’t stop until we get ourselves in the door. Our representatives have betrayed us, and we’re taking America back from oligarchs and lobbyists and politicians who have sold us out for profit.\n\nI want to know what you expect from your U.S. Senator. Please ask questions, make comments and let’s have conversation. \n\nHere’s what we plan to do while we’re in office:\n\n1. Tax billionaires. We implement a 1950’s era 92% tax rate on individuals worth $50million or more. It includes a 5% wealth tax on billionaires and a 40% tax penalty for high value individuals who attempt to leave the country or move money to evade these taxes. 💰\n\n2. End the Pink Taxes against women. Eliminate unfair discriminatory taxes and pricing against women, including for menstrual and hygiene products, pregnancy, childbirth, childcare. Women will no longer have to pay to be women. We’ll reduce the costs of these expenditures to 0. 🎀\n\n3. Increased support for teachers and farmers. We increase the wages educators and farmers receive. In the wealthiest country in the world, we will have the best educators and best education. Eliminating quality of life issues such as low pay will increase the talent and results in those sectors. Implementing union ideals, structure, know-how will facilitate strong systems that allow for free and subsidized  secondary education, effective trade schools, and abolishing right to work states across America. 🌱\n\nIf you believe in the vision, support. Ask questions. Get involved. We’re here. We want universal basic income, we want universal health. We want every American to be able to take care of a family of four with 2 cars and a garage on one income. We want to restore wealth to working people and the middle class. We want the unions in office, because that is the key to success that’s been missing.\n\nSend a donation, be a part of the team, introduce us to someone we need to know! Anyone want to help create an IBEW shirt for the campaign?\n\nHere are the links to assist. Send us a message as well if you’d like to be on the team.\n\n- Donate at https://ActBlue.com/JumpForSenate\n- Official Website: https://www.jump4senate.com\n- Check out our TikTok at: https://www.tiktok.com/@jumpforsenate?_t=ZT-8yb78hsUvde&amp;_r=1\n- Read our Instagram Threads at: https://www.threads.com/@jumpforsenate\n- See more Links at: https://www.atom.bio/jumpforsenate\n\nWe will win. It’s not Red vs. Blue, it’s Oligarchs vs. You. 🫵🏽\n\nWhen you don’t have a seat at the table, you’re probably on the menu. 🇺🇸",
    "score": 2300,
    "url": "https://reddit.com/r/IBEW/comments/1oo9yul/ibew_were_on_the_ballot_for_us_senate_in_illinois/",
    "created_at": "2025-11-04T15:22:02.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1i8edpg",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Federal Court Strikes Down PLA Requirements for Federal Projects. Anybody working for Construction Unions, let any fellow workers who voted for Trump know that the right-wing lobbying groups who oppose their good Union wages and benefits just pulled the rug out from under them.",
    "text": "",
    "score": 2136,
    "url": "https://reddit.com/r/IBEW/comments/1i8edpg/federal_court_strikes_down_pla_requirements_for/",
    "created_at": "2025-01-23T21:20:25.000Z",
    "num_comments": 453
  },
  {
    "id": "reddit-1mym5pc",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "TRUMP CANCELING MORE UNION CONTRACTS… YES ELECTRICAL. MAKING US GREAT.",
    "text": "The Trump administration just halted a nearly completed offshore wind project set to power three hundred fifty thousand homes in Rhode Island and Connecticut, abruptly ending over twelve hundred union jobs. Forty five turbines are already standing, billions invested, but clean local energy has been tossed aside over vague national security claims. The move comes as a shocking setback for communities that spent years working toward affordable green power and a fair transition for workers.\nWhat makes this all the more infuriating is that Trump pledged during his campaign to oil executives that he would block wind and solar projects if re-elected. By sticking to that promise, he's delivered exactly what fossil fuel bosses want, despite the cost to jobs, families, and the climate. The cancellation sends a loud message: prioritize oil companies over clean energy, and ordinary Americans are left picking up the pieces.\nIn total, Trump's presidency has canceled over thirteen billion dollars in green energy projects, hurting working people, driving up utility bills, and undermining climate action across the country. This latest attack not only destroys jobs, but also delays meaningful solutions that help ratepayers and protect communities from extreme weather, all for the benefit of a handful of oil executives.",
    "score": 1955,
    "url": "https://reddit.com/r/IBEW/comments/1mym5pc/trump_canceling_more_union_contracts_yes/",
    "created_at": "2025-08-24T04:24:23.000Z",
    "num_comments": 264
  },
  {
    "id": "reddit-1p5nyx3",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "IBEW, we’re cooking hot dogs for protesters and police at the ICE Facility near Chicago.",
    "text": "Support link: https://secure.actblue.com/donate/jumpforhotdogs 🌭\n\nIBEW, this is Jump Shepherd, I’m running for U.S. Senate. The last couple of weeks we’ve been visiting the ICE Detention Facility outside of Chicago. Peaceful, contentious at times, and full of good people. The only problem, there’s no food for protesters and police.\n\nWe want to fix that.\n\nHere’s what we want to do: cook hot dogs for protesters and police in support of our American right to protest and to bring attention to the ICE Facility and its need to go. Our aim is to get good food to the detainees during the holidays.\n\nWe already spoke to the police. No fire or cooking on-site is allowed. So the plan is:\n\t•\tCook beforehand\n\t•\tBring the food in\n\t•\tKeep everything warm at the protest zone\n\n**What we need (and where your support goes):**\n\t•\t500 hot dogs\n\t•\tFull Chicago Dog ingredients\n\t•\tChili\n\t•\tAluminum foil\n\t•\tSelf-serve table\n\t•\tVolunteers/servers\n\t•\tSpeakers + microphone\n\n**🇺🇸 FAQ:**\n\nQ: Is this an IBEW event?\nA: No. But we’re doing it anyway. If you’re a member, or a part of any union, and want to help, all are invited. This is an opportunity for those in here who are passionate and want to support the protests by serving good food to protesters, police, and detainees during the holiday season. We’re reaching out to others outside of the union as well.\n\nQ: You’re running for Senate? What?\nA: Yeah. I’m Jump Shepherd, I’m running for U.S. Senate. I’m a IBEW 134 electrician and I’m running to represent working people. I want to tax billionaires and bring the hoarded wealth at the top down to working people. I want to represent unions in the Senate and take America back from greedy politicians and lobbyists. I’m running for us. I’m running for you, brotha. \n\nQ: What’s your stance on ICE?\nA: I support a humane, service-focused immigration system that ends ICE’s punitive model by banning raids, stopping local police cooperation except for true public safety threats, closing abusive private detention centers, and replacing incarceration with community-based case management programs. I also champion an immigration system that provides a clear, affordable pathway to citizenship for longtime undocumented residents, Dreamers, TPS (temporary protected status) holders, essential workers, and families, expands and modernizes legal immigration, processes asylum claims quickly and fairly without detention, ensures humane border infrastructure, enforces full labor rights regardless of status, and addresses root causes abroad through anti-corruption, economic development, and climate-resilience investments rather than militarization.\n\nQ: Are y’all the ones acting all crazy, attacking police and all that?\nA: No. The hot dog station will be situated pretty far from the intersection between the police and protesters. We’re not getting involved in anything like that, we’re just here to feed hungry protesters and police.\n\nQ: Isn’t the facility very dangerous?\nA: We’ve been a couple times and it’s been chill. There will always be some protesters and counter-protesters looking for action, but we feel sharing a meal will quell the confusion, at least for a day. \n\nQ: Where can I donate to the hot dog fund?\nA: Right here → https://secure.actblue.com/donate/jumpforhotdogs\n\nQ: What is a Chicago dog?\nA: \n- Sesame seed bun\n- All beef frankfurter\n- Yellow mustard\n- Bright green sweet pickle relish\n- Chopped white onion\n- Tomato slices/wedges\n- Dill pickle spear\n- Pickled sport peppers\n- A dash of celery salt\n\nNo ketchup!! ❌\n\nQ: But what if I want ketchup on my Chicago dog?\nA: If you put ketchup on your Chicago dog, people will know you’re not from here.",
    "score": 1924,
    "url": "https://reddit.com/r/IBEW/comments/1p5nyx3/ibew_were_cooking_hot_dogs_for_protesters_and/",
    "created_at": "2025-11-24T17:53:33.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1latioy",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "ICE hurts IBEW members",
    "text": "I am proud to be a wireman. My profession has allowed me to help people and serve my community. Being an electrician is a big part of my identity. I love what I do.\n\nFor the past five years, my job has evolved from installing wires and devices to advocating for the men and women who work in my industry. I represent workers. I am married to my job. It is not easy, it is definitely not healthy, but it is important and often rewarding work.\n\nThe screenshots I shared with this post detail just a portion of an ongoing conversation I’m having with one of the workers I represent. This individual is an immigrant from Haiti. He is in this country legally. He is a fellow dues-paying member organization that I swore an oath to bear true allegiance to. He swore that same oath. He is experienced and credentialed in the installation of solar arrays. He’s my Brother.\n\nEarlier this year, I was tasked to assist in supplying manpower to a contractor in need of help. In the process of doing so, I helped this Brother find a job. It wasn’t necessarily easy. There were obstacles. Misunderstandings. Additional paperwork to file. There were barriers, namely language. But together, we were patient and persistent and we got it done. I didn’t do it alone and by no means do I deserve a ticker-tape parade to be held in my honor or even a goddamn cookie for my efforts, I was just doing my job. But my Haitian friend, he doesn’t see it that way.\n\nRead his texts. You’ll find genuine gratitude. Thankfulness. Honest appreciation. He’s not working an angle. He’s not using hollow flattery to curry favor so I’m more inclined to hook him up in the future. It’s sincere and it’s real. He was never looking for a handout. He was only searching for an opportunity to earn a fair wage performing dignified and valuable work. Not only does he work hard, he also acknowledged that he would pay it forward every chance he got. He’s not “taking our jobs”, he’s doing his job alongside us.\n\nYesterday, the Department of Homeland Security announced it has begun notifying hundreds of thousands of Haitians, Cubans, Nicaraguans and Venezuelans that their temporary permission to live and work legally in the United States has been revoked and that they should leave the country. I’m not yet certain how this announcement will immediately affect the Haitian workers I represent. Some may hold an alternate classification of protected legal status. But even the foreign workers who have been here the longest are at risk for deportation, as DHS Secretary Noem has shortened the deadlines and limited resources to file for legal extensions. It’s unlikely there’s a future in the States for these workers, and that sucks.\n\nI’m not an immigration lawyer or a policymaker, I’m just a wireman. But I’m also a human with a heart. I know good people when I meet them. I know the recent cruel and bitter treatment of nearly all immigrant workers, both legal and undocumented, is misplaced. I know ICE’s targeting of legal workers at job sites and courthouses is immoral as f#@k. I also know there isn’t a whole hell of a lot I can do about it, but staying silent isn’t an option. We must stand up for our fellow workers. This is a moment for solidarity. We have a right to speak out and protest. If we don’t use it, we’ll lose it.\n\nOur Haitian IBEW Brothers and Sisters would share stories about their homeland with their American coworkers during lunch breaks. They’d show them their bullet wounds and scars from injuries they suffered while protecting their families and neighbors from gang violence. At the moment, Haiti is a humanitarian nightmare. Whelp, the good ole U S of A is sending them back. Not just the criminals, either. All of ‘em. In defense of their actions, our elected leaders will scream, “America first!” I’m just wondering… first at what?\n\nDo something.",
    "score": 1738,
    "url": "https://reddit.com/r/IBEW/comments/1latioy/ice_hurts_ibew_members/",
    "created_at": "2025-06-13T22:50:45.000Z",
    "num_comments": 447
  },
  {
    "id": "reddit-1iwhnbw",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "If your local needs change internally say this.",
    "text": "Then watch the whole meeting go silent, to the point that a pin drops, and it rings like church bells. Watch the older crowd scoff, watch that guy or girl who has been asking for better negotiations shake their head like you are going for a touchdown at the lousiana bowl with bobby bouscher. Watch the brown noser get closer to an officer to cradle their buddies feelings. The boot lickers start looking around for a boot to lick. Right after all that happens, its time we pitch One member One vote, have individuals watch over our elections as you can have anyone watch in your corner. Learn more about the LMRDA, NLRA, Grievances, Past practice conditions protection, Fiduciary dut of representation and what that means, 29USC412, 29USC412, the safeguards against officers using general funds as slush funds or philanthropy funds for their own benefits. Etc.. if you want change its going to have to take action, dont do it alone and organize. If you focus on the people around you, you will see the change you want to see in your world.. it wont be easy you wipl probably be threatened, intimidated, retaliated against etc. Do what you can afford.  https://www.dol.gov/agencies/olms/compliance-assistance/interprative-manual/500-union-safeguards#:~:text=Based%20on%20this%20principle%2C%20a,Pa.",
    "score": 1663,
    "url": "https://reddit.com/r/IBEW/comments/1iwhnbw/if_your_local_needs_change_internally_say_this/",
    "created_at": "2025-02-23T19:03:42.000Z",
    "num_comments": 610
  },
  {
    "id": "reddit-1nx9jnb",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "IBEW Member Jump Shepherd is running to replace Dick Durbin in the U.S. Senate. He is asking for support from IBEW and local unions to support his team in their goal to represent unions and working class on a federal level.",
    "text": "",
    "score": 1628,
    "url": "https://reddit.com/r/IBEW/comments/1nx9jnb/ibew_member_jump_shepherd_is_running_to_replace/",
    "created_at": "2025-10-03T20:01:02.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1ktph4j",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Orange mf wants to mess with our lives",
    "text": "I worked so hard to get where I am at today I really don’t understand the low IQ individuals that vote for these clowns in Congress. I really don’t know how is this going to turn out but I Ain’t working in no inhumane job for 14 dollars an hr especially if they defund OSHA.  I’m taking my time this weekend to send a latter to my senator, hope you as well. ",
    "score": 1385,
    "url": "https://reddit.com/r/IBEW/comments/1ktph4j/orange_mf_wants_to_mess_with_our_lives/",
    "created_at": "2025-05-23T17:31:54.000Z",
    "num_comments": 671
  },
  {
    "id": "reddit-1jlwb0t",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "UPDATE: “Can you be at the office at 7am tomorrow”",
    "text": "I was terminated. I was provided two forms: one from the company and one from the state department of labor. The company one said I was fired due to reduction in force, the state one said due to poor work performance. I was never given a written reprimand, and in my 4 months there we failed inspection only once.\n\nI’m not upset, I know I’m a good electrician and I gave them 100%. \n\nOn a side note, anyone’s shop in the Denver metro hiring journeyman?",
    "score": 1338,
    "url": "https://reddit.com/r/electricians/comments/1jlwb0t/update_can_you_be_at_the_office_at_7am_tomorrow/",
    "created_at": "2025-03-28T14:25:55.000Z",
    "num_comments": 167
  },
  {
    "id": "reddit-1k4be78",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "WE DID IT",
    "text": "# IBEW Local 11 Passes Landmark Resolution to Mobilize in Defense of Immigrants\n\n**Los Angeles, CA** — In a bold and principled stand for justice, the members of the International Brotherhood of Electrical Workers (IBEW) Local 11 voted overwhelmingly at their general meeting to pass a resolution committing the union to mobilize in defense of immigrant workers facing attacks from government raids and racist groups.\n\nTitled the *Resolution to Mobilize in Defense of Immigrants*, the resolution affirms that immigrant workers are a vital and inseparable part of the labor movement and emphasizes the union’s duty to act in solidarity with all working people in the face of oppression.\n\n\"An injury to one is an injury to all,\" the resolution declares, echoing one of labor’s most fundamental principles. It states that planned immigration raids and anti-immigrant violence threaten the solidarity necessary for the strength and survival of the labor movement and the working class as a whole.\n\nThe resolution asserts that neither government institutions nor big-business political parties can be relied upon to defend immigrant workers from bigoted attacks. Instead, it reaffirms the role of unions as self-defense organizations for the working class, capable of organizing meaningful, independent action in defense of vulnerable members of the workforce.\n\nIn passing the resolution, IBEW Local 11 commits to exploring the best ways to mobilize its membership to protect immigrant communities under threat, whether from federal enforcement actions or racist violence, and calls on the broader labor movement to join in this critical effort.\n\n\"Solidarity means standing up, speaking out, and taking action,\" said a representative of Local 11 following the vote. \"We are proud to stand shoulder-to-shoulder with immigrant workers and make it clear: we will not be divided.\"\n\nThis resolution marks a significant step toward building a labor movement that is inclusive, militant, and ready to confront the injustices facing working people across all borders and backgrounds.\n\n*IBEW Local 11 represents thousands of electrical workers across Los Angeles County and is committed to the principles of solidarity, dignity, and justice for all members of the working class.*",
    "score": 1196,
    "url": "https://reddit.com/r/IBEW/comments/1k4be78/we_did_it/",
    "created_at": "2025-04-21T11:39:48.000Z",
    "num_comments": 599
  },
  {
    "id": "reddit-1ipq0oi",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "You lost one today",
    "text": "My dad died this morning after a great life. He was the rep for local 57 my whole childhood. He was union through and through. \n\nWhen I was a kid I remember sitting on his lap as he juggled me trying to unlace his sweaty lineman's boots. He used to mix Black Velvet with ice water in those tall, tan plastic Tupperware glasses. \n\nOne day he came home after his hooks cut loose and he had to bear hug the pole to not die. I remember my mom pulling slivers out of his forearms and chin. Apparently his thighs too but I didn't see that. He worked the next day.\n\nHe came home once with one of those blue foam and aluminum splints on his middle finger. I asked him what happened and he said a cross arm broke loose and smashed it. It broke his finger and split the skin bad enough he needed stitches. He worked the next day.\n\nLineman are built different. \n\nI worked my way up from the bottom in IT. I can't be in a union but I promote them constantly because of my dad. His union and his brothers were his world. He taught at the apprenticeship school until covid shut everything down. My dad was one of the good ones.\n\n",
    "score": 1177,
    "url": "https://reddit.com/r/IBEW/comments/1ipq0oi/you_lost_one_today/",
    "created_at": "2025-02-15T01:04:16.000Z",
    "num_comments": 87
  },
  {
    "id": "reddit-1lzpspo",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "And just like that “poof “gone.",
    "text": "So it’s my last couple weeks before I go for orientation at the local I got accepted into. I’m sitting there enjoying my lunch break and one of the journey men walks out to me and says, “Hey, you need to wrap up your lunch break, we no longer get 15 minute breaks and boss Man said if you want the 15 minute break you gotta work an extra 30 minutes”.\n\nThis is the bullshit I can’t wait to get away from. It just goes to show that without anything in writing, they can treat you however they want. \n",
    "score": 1095,
    "url": "https://reddit.com/r/IBEW/comments/1lzpspo/and_just_like_that_poof_gone/",
    "created_at": "2025-07-14T15:41:54.000Z",
    "num_comments": 175
  },
  {
    "id": "reddit-1jcn3d8",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "This career changed my life. Homeless at 17 to six figures at 24.",
    "text": "I had a sort of tough life growing up and ended up being homeless at 17. I had no idea what I was going to do with my life but I knew that I had to make something of myself. I watched my dad try many different careers throughout my life in order to provide for us but things never quite worked out for him. I thought being an electrician sounded cool even though I had no idea what the work was really like. I signed up for my local apprenticeship program and found a company to work for within a few weeks. Fast forward a few years and I’ve graduated college debt free, passed my journeyman test at 23, and am about to be making six figures at 24 years old. I never thought I could make good money and enjoy what I do. I felt so hopeless as a teen and now I’m stacking money, gaining knowledge everyday, and working towards building a life to create the family I always wanted. Life really can get better if you are willing to put in the work. ",
    "score": 1006,
    "url": "https://reddit.com/r/electricians/comments/1jcn3d8/this_career_changed_my_life_homeless_at_17_to_six/",
    "created_at": "2025-03-16T14:48:43.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1ltbj7q",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "$19 an hour to wire Lutron panels?",
    "text": "I feel like I’m Being underpaid. I’m only first year apprentice but I work in Princeton NJ and have been for 2 years. I don’t have any benefits to this job either",
    "score": 975,
    "url": "https://reddit.com/r/electricians/comments/1ltbj7q/19_an_hour_to_wire_lutron_panels/",
    "created_at": "2025-07-06T20:43:21.000Z",
    "num_comments": 347
  },
  {
    "id": "reddit-1ip8woz",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Remember Who You Treat Like Shit",
    "text": "So, years ago, before I was a shop owner, I had a fellow JW I worked with tell our foreman \"remember who you treat like shit so you're not surprised when they treat you like shit when they're your foreman\"\n\nI've tried to lead like that as an owner, but in a diff post I shared that a GF that tried to write me up for refusing to do hot work because \"it was too expensive to shut the machines down\" and put me on a DNR list just took a call for my shop.\n\nWhen he saw me come out of the office to have him fill out paperwork he looked panicked, now I don't do 90% of the manpower decisions in my company, my GFs do, but they all know who the guy is and one of them got written up by this guy for \"excessive foul language\".  So there's some bad blood between a few guys.  This former GF has a reputation for being a dick in our local as well.\n\nI'm not going to give him a reason to file a grievance, but I'll be damned if I didn't want to spin him when I saw his dispatch sheet come in my email.  But I figured I'd give him a chance.  So just a reminder to all you foreman, GF's, and JW's, apprentices and other JW's have long memories and you may end up working for one of them and your life could be miserable.  Treat people with decency and the respect they've earned.  Except Nazis.  Fuck those guys.",
    "score": 965,
    "url": "https://reddit.com/r/IBEW/comments/1ip8woz/remember_who_you_treat_like_shit/",
    "created_at": "2025-02-14T11:52:49.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1l7g0ig",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Here's another one for you",
    "text": "Pictured: Joslin, John. Union supporter. Two incidents. (1) Clubbed into unconsciousness and dragged across Mound Road by Sterling Heights police at the North Plant. Sustained severe head cuts. (2) Punched by a scab near the News building. Sustained bruises and a black eye.\n\nhttps://www.marxists.org/history/etol/newspape/atc/811.html",
    "score": 950,
    "url": "https://reddit.com/r/IBEW/comments/1l7g0ig/heres_another_one_for_you/",
    "created_at": "2025-06-09T20:46:11.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1p1knbj",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Jman is a hustler.",
    "text": "One of the Jman i work with sold this to one the new apprentice for $40. Told him hey did you bring your grounded tamper tool like I told you yesterday. Appreciate was like no. Jman was like well you are going to need one today or you will be useless all day. Ill sell you this extra one for $40. Sends funds through cash app and gives him tool. 1 hour in appreciate ask me whats this for. Im like nah i dont have one thats only for re.tards",
    "score": 893,
    "url": "https://reddit.com/r/electricians/comments/1p1knbj/jman_is_a_hustler/",
    "created_at": "2025-11-19T21:36:12.000Z",
    "num_comments": 297
  },
  {
    "id": "reddit-1ilxwex",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "A reminder to all of us apprentices",
    "text": "This came up in our safety tool box meeting this morning and last Monday. Luckily there was no death. This could have been a lot worse, thankfully in this case the apprentice gets to keep his trainee license.",
    "score": 892,
    "url": "https://reddit.com/r/electricians/comments/1ilxwex/a_reminder_to_all_of_us_apprentices/",
    "created_at": "2025-02-10T04:31:01.000Z",
    "num_comments": 118
  },
  {
    "id": "reddit-1ovlt6m",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "You Joined the Union Now Respect It",
    "text": "Lately, it seems like some folks who’ve recently organized in are still bringing non-union habits and attitudes onto the job. Let’s be clear when you join the union, you’re stepping into a brotherhood and sisterhood built on generations of hard work, sacrifice, and solidarity.\n\nThis isn’t just about rules or procedures. It’s about the values that separate union labor from everything else. Respect, safety, fairness, and doing things the right way. We don’t cut corners, and we don’t ignore standards just because it’s “easier.”\n\nIf you choose to be in the union, then respect the union way. Don’t bring non-union habits into a space built on generations of hard work and collective effort. We all benefit when we uphold the standards that make us union strong.",
    "score": 880,
    "url": "https://reddit.com/r/IBEW/comments/1ovlt6m/you_joined_the_union_now_respect_it/",
    "created_at": "2025-11-12T23:55:06.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1iz08th",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "The conservative argument is that when workers win more rights and higher wages, businesses will logically want to move to places where they can pay lower wages and have less regulations on worker rights. So are pro labor states and countries destined to fail? Or how can we fight back against that?",
    "text": "",
    "score": 788,
    "url": "https://reddit.com/r/IBEW/comments/1iz08th/the_conservative_argument_is_that_when_workers/",
    "created_at": "2025-02-26T22:29:06.000Z",
    "num_comments": 498
  },
  {
    "id": "reddit-1pofm84",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "IBEW, the Illinois State Board of Elections knocked us off the ballot. We’re taking them to court.",
    "text": "I’m Jump Shepherd, IBEW Local 134. Card No. 6120695.\n\n**The Illinois State Board of Elections has struck us from the ballot for U.S. Senate.**\nThey struck us because we wrote our campaign address rather than our residential address in a box that doesn’t ask for our residence.\n\nIt sounds silly to me and you, and it’s an example of how election law works when they rely on people to give up at the first sign of adversity. **We’re appealing the decision, and challenging the Illinois State Board of Elections at the Cook County Circuit Court this week, on December 17th and 18th.**\n\n**The County is making the hearing public**, so voters and constituents can be in on the process of electoral law and be present when it’s challenged. \n\n**Get your popcorn ready, and pull up to support the campaign.**\n\nActBlue Link: https://secure.actblue.com/donate/jumpforsenate\n\n—-\n\n💻 1. December 17th, 10am CST:\n**Jump Shepherd v. Illinois State Board of Elections, Alivia Jones, Brayden Garza**\n\nZoom ID: 963 9239 3803\nPasscode: 043502\nZoom Call-In Number:\n312-626-6799\n\n💻 2. December 18th, 11am CST:\n**Jump Shepherd v. Illinois State Board of Elections, Pericles Abassi**\n\nZoom ID: 977 2570 0908\nPasscode: 821555\nZoom Call-In Number:\n312-636-6799\n\n—\n\nHere’s more info on the campaign event of the winter. Tell everybody that you know… it’s a party. This is what democracy looks like.\n\n**Edwardsville, Illinois: “Illinois lawmakers must fix broken ballot rules—now”https://www.theintelligencer.com/opinion/article/illinois-election-law-must-be-reformed-21237114.php**\n\n**Interview with Jump Shepherd by Cynthia Pooler, from New York’s “Issues that Matter” show: **https://youtu.be/9BdzbScWdtU\n\n**Donate to the campaign: https://secure.actblue.com/donate/jumpforsenate**\n\n**Additional links: \nhttps://www.atom.bio/jumpforsenate**\n\n—-\n\nIt’s not Red vs. Blue, it’s Oligarchs vs. You. 🫵🏽\n\nJoin the Revolution.\n\n**Support the campaign: https://secure.actblue.com/donate/jumpforsenate**\n\n—-\n\n**FREQUENTLY ASKED QUESTIONS:**\n\n**Q: Wait, so they said you didn’t get enough signatures to get on the ballot for U.S. Senate?**\nA: Our petition signatures were not challenged. Our objectors alleged that we wrote our campaign address rather than a home residence on the petition sheets themselves.\n\n**Q: Well, did you write the wrong address?**\nA: There are multiple places on the petition sheet and statement of candidacy that ask for “Place of Residence”, and in those areas, that’s exactly what we put—our residence. The area that’s being challenged simply says “Address”, with no indication of a specific type of address.\n\n**Q: When is the appeal hearing?**\nA: This Wednesday and Thursday, December 17th and 18th, and 10am and 11am, respectively.\n\n**Q: And wait, y’all are live streaming the event? Pretty ballsy.**\nA: The Cook County Circuit Court is providing the stream link; this is a public hearing. We’re letting folks know to pull up. To be honest, this isn’t about one challenge or campaign. But taking qualified candidates off the ballot for following the instructions of official paperwork exactly is a setup for us and future working people running for office.\n\n**Q: OK well before I support, what’s your policies anyway? Are you a Democrat?**\nA: That’s a good question. My top policies: A 92% tax on billionaires, repealing the Pink Tax that unfairly forces women to pay more than men, raise salaries for teachers and farmers, recognize Palestinian Statehood and establish a government office to audit where United States weaponry is being sent and how it’s being used, and use funds from those taxed billionaires to establish universal healthcare, universal basic income, and bring wealth back to our middle and working classes.\n\n**Q: Where’s the Zoom link?**\nA: This is what we’ve been provided so far by the Cook County Circuit Court:\n\n1. December 17th, 10am CST:\nJump Shepherd v. Illinois State Board of Elections, Alivia Jones, Brayden Garza\n\nZoom ID: 963 9239 3803\nPasscode: 043502\nZoom Call-In Number:\n312-626-6799\n\n2. December 18th, 11am CST:\nJump Shepherd v. Illinois Sate Board of Elections, Pericles Abassi\n\nZoom ID: 977 2570 0908\nPasscode: 821555\nZoom Call-In Number:\n312-636-6799\n\n**Q: Where can I support the campaign?**\nA: Check out our ActBlue link at https://secure.actblue.com/donate/jumpforsenate and links to our social media, website, etc. at https://www.atom.bio/jumpforsenate",
    "score": 762,
    "url": "https://reddit.com/r/IBEW/comments/1pofm84/ibew_the_illinois_state_board_of_elections/",
    "created_at": "2025-12-16T22:26:15.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1mk727p",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Tax on overtime",
    "text": "All overtime pay isn't tax free. Remember that word \"qualified.\"\n\nFor those of you working Double Bubble, you need to read and understand what “qualified” means. \n\nThe Fair Labor Standards Act, mandates at least \"time-and-a-half\" overtime pay for certain professions, but the act does not require \"double-time\" pay for overtime, as is required in some conditions under some labor contracts. As a result, only the half-time portion of overtime pay would qualify for the new tax deduction.\n\nSome people who work overtime will not benefit or benefit as much as others, including people who already owe no income tax, people whose income is in the phase-out range, and people who do not receive overtime in accordance with the Fair Labor Standards Act.\n\nFederal tax deductions for construction workers, as W-2 employees, for items like union dues, tools, work boots and unreimbursed work-related travel expenses, were suspended from 2018 through 2025 due to the Tax Cuts and Jobs Act (TCJA) of 2017. \n\nBecause most of y'all voted against your own best interests again, installing a dude who literally mocks the working class, veterans, disabled and pretty much everyone like you.\n\nYour taxes will stay the same and the people who need the least will get a bigger break than you’ll ever see in your lifetime. \n\nI guarantee you without hesitation those of you that voted for this clown will jump all over the opportunity to defend this with some bullshit cover-up reason.\n\n I just wish there was a way we could all sit in a room and talk this out because there’s absolutely no way, with all the facts in front of us that anybody supports this shit. #StayStrong, support the #LaborMovement and #Organize\n\nThe crazy thing to me is, the people who literally built and maintain America can’t write off on their Federal tax deductions for items like union dues, tools, work boots and unreimbursed for work-related travel expenses.\n\n- I might be a little late to the party but I thought the members here should see what the Henry Miller page had to say about this new bill.",
    "score": 666,
    "url": "https://reddit.com/r/IBEW/comments/1mk727p/tax_on_overtime/",
    "created_at": "2025-08-07T17:55:12.000Z",
    "num_comments": 193
  },
  {
    "id": "reddit-1iy9qhx",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Fired",
    "text": "Im a 5th year apprentice and have worked with my company for 2.5 years, a couple months ago I was digging in a ditch when the owner pulled up and screamed at me for not wearing my safety glasses. It was just me and my journeyman on the job and I didn’t think too much about putting on glasses just for digging with a shovel. Anyway he told me he was going to fire me if he saw me not wearing them again. Shittt fast forward to a couple weeks ago I was wearing my sunglasses because it was sunny, after I finished my work outside I walked inside, took my sunglasses off because it was dark as shit and 15 seconds later the owner walked in and fired my ass! What a joke man! I’ve gone above and beyond for this company and it feels crazy to have been fired, I’ve never been disciplined before in my whole career. I’ll be out of work for a few months and I can’t even get unemployment because of my termination. I’m trying to appeal their decision, but still what a pain in the ass. Anyone else worked for a cruel asshole? ",
    "score": 655,
    "url": "https://reddit.com/r/electricians/comments/1iy9qhx/fired/",
    "created_at": "2025-02-25T23:52:55.000Z",
    "num_comments": 273
  },
  {
    "id": "reddit-1m7e8ah",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Asked To Leave A Job As A Foreman",
    "text": "So, this is one of my favorite stories where I was politely asked to leave a job I was running. \n\nI was down to my third strike in about 2002 or so. I didn't want the first two because they were about 2 hours from my house and I was doing fine money wise. The call came in and it was with a contractor with a horrible name in the local, but I took it anyway, since it was my third strike, etc. I show up on the warehouse &amp; office space job and the first thing I notice is everything is piped in 1/2\"! I asked the foreman why and it turns out the first foreman quit and this guy was a residential upgrade that was still in the upgrade classes. He begged me to take the job over, but I said hell no. A few days later, the owner and PM show up and tell me they'll give me a truck and foreman's pay (10%), if I take the job over, so I did. \n\nWe finished that job and I go to the next one, which is a dental sales office. We had to saw cut and run everything under the slab to hook up chairs and all the stuff you see in a dentists office. I asked for a scope of work and the owner tells me to quit whining and just go off the print. No problem, dickhead. \n\nAfter about two weeks, the owner shows up and wants to know why it's taking so long. We argue a bit and he finally has someone bring out the scope. It's too much to list, but for example, the estimator had bid 26 receptacles and there were actually about 170. The owner and estimator come out and the kid estimator says, what's the big deal? It only takes a few minutes to install a recep and they're only a few bucks each. I asked him if he forgot all the conduit, wire, labor to get that recep ready to install? \n\nWe finished that job and lost quite a bit of cash on that one. So, off I go to the next one. It's an operating factory &amp; warehouse and we have to demo a ton of conduit, 1/2\" up to 4\", all loaded with wire. I split the wire with the building guy and me and my crew got about 10k out of it. Then we have to run new stuff for new equipment they have coming in. I was able to save some of it, but not much. Again, I'm asking for the scope of work and some help. This goes on for about three weeks. I got help but no scope. The owner calls and asks how it's going. I said I have no idea how far along we are because I don't have a scope. It seems to be going pretty good, but if the same guy bid this job, we could be in trouble. Hell, he couldn't bid receptacles right, how's he gonna bid something like all this equipment? I, of course, was laughing about it. Made some comments like, where did he get his degree, from a box of cracker jacks? Maybe a county fair at the goldfish pond? Bubblegum machine? Things like that. \n\nTwo days later, the owner shows up with a shop rocket. Talks to me for a few minutes and said this guy was going to take over my job because they had something closer to home for me. I walked the dude around for about a half hour or so. We go back to the owner, guy hands me a check! I've got his van! I'm like, what the fuck, dude? How the hell am I supposed to get home and why all of a sudden? Turns out the estimator was his son. That's the why. \n\nAs far as getting home, dude hired a limo to bring me two hours home! I made him stop at the hall so I could sign the books first. But I still laugh my ass off thinking this dude sent me home in a limo!\n\nI guess the guy technically didn't lie to me, it was closer to home. \n\nJust thought you brothers and sisters might get a chuckle out of this.\n\nIn solidarity.",
    "score": 611,
    "url": "https://reddit.com/r/IBEW/comments/1m7e8ah/asked_to_leave_a_job_as_a_foreman/",
    "created_at": "2025-07-23T16:40:55.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1jankwa",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I love all you degenerates",
    "text": "I fucking love being able to bullshit around and make a shit ton of money with the boys every day at work, I love getting to travel pretty much wherever in the country I want to. I really fucking love not having to give a shit about any one company, or having to suck off some middle management boss in order to keep my job or improve my circumstances. \n\nI love laughing my ass off on a daily basis and feeling like I’ve known some guy from a totally different state than me for a long time, I love being union a being protected from corporate bullshit and knowing I’m getting a good raise to my wages and benefits every year, knowing I’m going to retire well. I love that my wife doesn’t have to work anymore and can pursue her passions which has made her so happy, and so grateful for the IBEW as well. \n\nI love knowing there are a bunch of dudes who know me very well, or barely know me, who have my back through whatever I’m going through. I lost a parent and everyone really was there for me through that shit, bought them flowers and sent it to hospice, and paid me for weeks while I sat at their bedside as they passed.\n\nI just love this shit, and wanted to express it. \n\nLots of bad shit going on in the world right now, unions are under attack, but fuck that this is the best thing to ever happen in my life. I never thought I’d get the chance to live the life I’m living right now AND enjoy doing it. Plus if I get bored there is plenty of other shit to learn and do.\n\nShits awesome ",
    "score": 588,
    "url": "https://reddit.com/r/IBEW/comments/1jankwa/i_love_all_you_degenerates/",
    "created_at": "2025-03-13T21:41:08.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1k8oddi",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Why do I, a Union worker, support immigrants?",
    "text": "Because immigrants, documented or not, are workers—and workers are the Union. They build our homes, serve our food, care for our families, and fight alongside us for better wages, benefits, and dignity on the job. Supporting them strengthens all of us.\n\nLet me be clear: no human being is illegal. If you speed, you’re breaking the law—does that make *you* illegal? Immigration is not a crime. Exploitation is a crime, and when we let big bosses divide us, *they* win.\n\nThe IBEW grows stronger when more workers organize. Immigrant workers are leading union drives, walking picket lines, and demanding justice. Their fight is *our* fight.\n\nThe same people demonizing the poor, the Black, and the Brown, are happy to sell visas to millionaires. This is not about the law; it is all about money and class.\n\nDoes immigration lower wages? Only when workers are left unprotected and unorganized. When immigrants are unionized, they raise the bar for *everyone.* The real threat to wages is not immigration; it is union-busting, wage theft, and corporate greed.\n\nImmigrants do not weaken the IBEW—they *are* the future of the IBEW.\n\n**We rise together, or we fall divided. Organize everyone. No exceptions.**",
    "score": 548,
    "url": "https://reddit.com/r/IBEW/comments/1k8oddi/why_do_i_a_union_worker_support_immigrants/",
    "created_at": "2025-04-26T21:59:49.000Z",
    "num_comments": 791
  },
  {
    "id": "reddit-1iwt3hk",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Some Project 2025 Goodies for the working person",
    "text": "I can not believe our union leaders did not give us these shining examples of Project 2025 before the election. Just a small sampling of all the benefits of voting Republican. \n\nGuys, you have got to look into this Project 2025. I just looked at it and in 20 minutes I found:\n\n1) Get rid of OSHA, NLRB. Quote from 2025 \"End PLA requirements. Agencies should end all mandatory Project Labor Agreement requirements and base federal procurement decisions on the contractors that can deliver the best product at the lowest cost. l Repeal Davis–Bacon. Congress should enact the Davis–Bacon Repeal Act and allow markets to determine market wages.\"\n\n2) Get religious organizations involved in labor organizations I quote 2025 \"Encourage and enable religious organizations to participate in apprenticeship programs, etc. Both DOL and NLRB should facilitate religious organizations helping to strengthen working families via apprenticeship programs, worker organizations, vocational training, benefits networks, etc.\" They have that in Canada called CLAC, google it.\n\n3) Another one is get teenagers into high risk job training. I quote from 2025 \"Hazard-Order Regulations. Some young adults show an interest in inherently dangerous jobs. Current rules forbid many young people, even if their family is running the business, from working in such jobs. This results in worker shortages in dangerous fields and often discourages otherwise interested young workers from trying the more dangerous job. With parental consent and proper training, certain young adults should be allowed to learn and work in more dangerous occupations. This would give a green light to training programs and build skills in teenagers who may want to work in these fields. l DOL should amend its hazard-order regulations to permit teenage workers access to work in regulated jobs with proper training and parental consent.\" Of course they don't define the age group precisely. Like 13-19? 14-19? Hell why stop there, get them while they are young and start at 6.\n\n4) No OT on retirement or annuities. I quote 2025 \"Congress should clarify that the “regular rate” for overtime pay is based on the salary paid rather than all benefits provided. This would enable employers to offer additional benefits to employees without fear that those benefits would dramatically increase overtime pay.\" Of course this is why employers don't offer more benefits (sarcasm included).\n\n5) 40 hours will not define OT anymore. I quote 2025\" Congress should provide flexibility to employers and employees to calculate the overtime period over a longer number of weeks. Specifically, employers and employees should be able to set a two- or fourweek period over which to calculate overtime. This would give workers greater flexibility to work more hours in one week and fewer hours in the next and would not require the employer to pay them more for that same total number of hours of work during the entire period.\"\n\nLot more goodies in there for the working man/woman. Enjoy the fruits of your votes for the brothers (if I can call them that) that voted for these clowns.",
    "score": 526,
    "url": "https://reddit.com/r/IBEW/comments/1iwt3hk/some_project_2025_goodies_for_the_working_person/",
    "created_at": "2025-02-24T03:57:09.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1kogsu6",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Do you guys actually use these?",
    "text": "I've had this thing kicking around my my tool bag my entire apprenticeship and have literally made it all the way to journeyman without ever using it. Kind of debating just leaving it in the car or at home from now on as I'm honestly not sure what its even good for aside from having a straight edge to draw with.\n\nWhat is this artifact good for and do you even need them as an electrician?",
    "score": 504,
    "url": "https://reddit.com/r/electricians/comments/1kogsu6/do_you_guys_actually_use_these/",
    "created_at": "2025-05-17T01:01:09.000Z",
    "num_comments": 267
  },
  {
    "id": "reddit-1mx6a47",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "NO TAX on OT: Explained",
    "text": "If you work 2,080 straight-time hours at $50/hr, that’s $104,000. Add 500 overtime hours at time-and-a-half ($75/hr), that’s another $37,500, for a total of $141,500. For the “No Tax on Overtime” law, only the .5 premium ($25/hr in this case) counts toward the deduction. So 500 hours gives you $12,500 — the maximum allowed for a single filer. At a 22% bracket, that saves you about $2,750 in federal income tax (because it’s a deduction, not a tax credit — it lowers taxable income, it’s not cash back). Social Security, Medicare, and state income taxes are still withheld the same.\n\nThat 22% you hear about is just your federal income tax bracket on dollars in that range. Separately, every paycheck also has 7.65% for Social Security + Medicare taken out, and the new law doesn’t touch that. That’s why the savings are limited to income tax only.\n\nThis example assumes all 500 hours of OT are eligible. In practice, some OT won’t qualify:\n\t\nWeeks where you don’t actually work over 40 hours (like using vacation, holiday, or sick time). PTO counts as paid hours, but it’s not “worked hours” under the law.\n\nMinimum call-in pay (e.g. work 1 hour but get paid for 4) — only the hours actually worked are eligible.\n\nDouble time and any contractual premiums above 1.5x don’t qualify, although the law should still allow you to count the .5 premium portion of those hours.\n\nSo, realistically, it’s about the equivalent of a $1.32/hour raise if you hit the single-filer max. It’s better than nothing, but probably not what people imagined when they first heard “no tax on overtime.” A lot of folks thought they’d save 22% of their whole overtime check — tens of thousands in some cases. In reality, the maximum benefit is capped at about $2,750 for a single filer or $5,500 for a married couple assuming that couple worked 1,000 hours at that rate, equal to about $2.60 an hour on straight time.\n\nThis benefit starts in 2025 and sunsets after the 2028 tax year. The corporate tax benefits like the private jets deduction is permanent and obviously more important to the working class so our bosses can get around to keep making jobs for us :)",
    "score": 496,
    "url": "https://reddit.com/r/IBEW/comments/1mx6a47/no_tax_on_ot_explained/",
    "created_at": "2025-08-22T13:17:45.000Z",
    "num_comments": 184
  },
  {
    "id": "reddit-1ixti9w",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "4x8s no change in pay",
    "text": "I, for the life of me, dont understand why people are so pessimistic, if not hostile to the idea of working 4 8s with no change in pay. I understand the pessimism a little bit but to get upset about it? Is it just a boot licker thing? I am young, and an apprentice so a lot of my progressive ideas get dismissed a lot. But i am very educated and i understand that all the labor rights we enjoy now came at a time where workers had almost nothing, and were fought tooth and nail for. Its just so upsetting for people to be so unwilling to demand or even think of better.",
    "score": 481,
    "url": "https://reddit.com/r/IBEW/comments/1ixti9w/4x8s_no_change_in_pay/",
    "created_at": "2025-02-25T12:10:10.000Z",
    "num_comments": 244
  },
  {
    "id": "reddit-1iu33km",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Labor Party Now!",
    "text": "First and foremost, I am not a member of the union. But, honestly there is a lot of us that look up to your organization. When I see a person with an IBEW shirt, I always think “there is the good guys”. This administration will eventually outlaw unions. I know that sounds outrageous but as you see on the news it’s outrageous times. The DNC has failed us in the past three elections. They are not going to change, they are weak, beholden to their masters. It’s time for a break. We need a party for the people and by the people with one main message, workers rights. These billionaires are hoarding all the money that our hard work provides their riches! It doesn’t matter if you make 2500 or 25000 a month, if you work for a corporation you’re underpaid! Our power is in grassroots movements. We are powerful, they get rich off our hard-work, and most of us give it right back to them! Stop doing that now. Know where you spend your money, and who benefits? There’s lists circulating now with companies to avoid. Protesting is bullshit. Boycotting is where we wield our sword! Look at the bus boycotts during the civil rights movements. If you don’t think your spending is powerful look at malls across this country. Dead. Doors shuttered. Why? Because we changed our spending habits. Change starts with us! Take back the power. Thank you for your time. Vote Labor. As long as we can still vote.\n\nUpdate: After conversation throughout this post I was reminded of the uphill battle of a third party. So because I believe in not being stubborn to a fault, I recognize the error in my message. What I am implying is we need a labor “movement”. Much like MAGA did with the GOP. Regardless, the messaging is the same. Our constitution starts with We The People. Let’s make them not forget that.",
    "score": 470,
    "url": "https://reddit.com/r/IBEW/comments/1iu33km/labor_party_now/",
    "created_at": "2025-02-20T16:52:02.000Z",
    "num_comments": 245
  },
  {
    "id": "reddit-1lrmmjc",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Help. I need to charge $311 a billable hour to stay in business.",
    "text": "I run a residential service electrical company in TN. I took a look at my pricing (\\~$140 per hr) and after calculating all of my expenses: rent, office lady, health insurance, salary, lead cost, etc. It looks I need to charge around $300 a billable hour (about a 50% efficiency score) . What are you guys charging and how much do you make per year after it's all said and done?\n\nThanks for all the Input. Here are my numbers. Where should I trim? Or am I leaving too much out?\n\nElectrical Numbers\nOwner Salary:120,000\nDave’s Salary: 75,00\n Health Insurance: 16,350\nMarketing: 30,000\nVan Payments: 12,000\nAuto Insurance: 7,200\nLiability: 1,600\nRetirement: 25,000\nGenevieve Salary: 30,000\nConsumables:75,000\nGrowth:100,000\n=492,150\nX profit margin(23%)\n=605,344.50\n/billable hours (2000) 1000 per tech\n=302.67",
    "score": 460,
    "url": "https://reddit.com/r/electricians/comments/1lrmmjc/help_i_need_to_charge_311_a_billable_hour_to_stay/",
    "created_at": "2025-07-04T16:13:33.000Z",
    "num_comments": 609
  },
  {
    "id": "reddit-1op353y",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Unspoken Jobsite Rules",
    "text": "Alright, let's add some unspoken rules that you need to know to survive in construction.  I'm going to add mine here, keep it going.\n\n-Check for TP before you commit to the shit\n\n-The worse you have to shit, the further from the porta johns you are\n\n-Never count on someone else providing food.  They'll forget, or it'll be late, or absolutely disgusting \n\n-your journeyman is never wrong if another trade asks\n\n-if someone left a piss bottle, it's probably a drywaller\n\n-If there's time to lean, there's time to clean\n\n-it'll look good from your house \n\n-You can be a decent foreman and not let your guys walk all over you\n\n-The apprentice you treat like shit will be a foreman on one of  your next jobs\n\n-Respect others work, if you want them to respect yours\n\n-put your tools back in the same spot in your cart, tool bags, etc because you can very rapidly see if something is missing\n\n-never borrow someone's tools without asking\n\n-cover for guys in true emergency or family issues, not for addictions or shitty behavior \n\n-when in doubt, install it how the prints show and you're covered\n\n-Get a notebook, write down everything your foreman says &amp; when, who you worked with, what hours, and date it all.  Keep that notebook for at least the duration of the job\n\n-if another trade or other foreman asks you to do something, check with your foreman &amp; journeyman first before doing it\n\n- you are responsible for your own safety.  Don't count on the company safety guy or GC's safety guy.  Just say \"no\" if it's not safe\n\n-Sacety never trumps production.  Once money gets involved, safety becomes a lower priority.  Especially on tight deadlines. --by this I mean that you can never count on a company asking you to do it \"the safe way\" when money gets involved.  You should always expect them to cut corners when it comes to safety.  When in doubt, see above where I said \"you are responsible for your own safety --\n\n-as an apprentice you'll do all the shit work, but don't be afraid to do it as a JW\n\n-edited for clarification &amp; spelling",
    "score": 453,
    "url": "https://reddit.com/r/electricians/comments/1op353y/unspoken_jobsite_rules/",
    "created_at": "2025-11-05T13:40:13.000Z",
    "num_comments": 261
  },
  {
    "id": "reddit-1mr216e",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Replacing an actuator arm in some heavy duty switch gear!",
    "text": "Love my job! I get to learn cool stuff all the time, and my journeyman takes great pictures. \n\nThis is the replacement of a plastic actuator arm for the knifing system of a switch gear that supplies power for boats to plug into at a local shipping port! \n\nFor clarification, circuits closed at the substation, we are locked and tagged out, and all safety measures are in place, hence to why I’m not wearing a suit. We do safe work because we wanna take our money home! Have a Good Friday gents.",
    "score": 432,
    "url": "https://reddit.com/r/electricians/comments/1mr216e/replacing_an_actuator_arm_in_some_heavy_duty/",
    "created_at": "2025-08-15T16:01:05.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1nf6l35",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Here is your fcking “Flux capacitor” Bob",
    "text": "I’m an apprentice, so in my contract it states I have to be able to withstand journeymen’s ball busting. Most of the time I actually enjoy it, some guys are so clever and quick with shit, I love humour sm so I like to see what some guys come up with lol. But, I absolutely despise basic repetitive humour. And I have been paired with a journeyman from my company whose ball busting is so basic. Yesterday was the 3rd time now since being with him where he told me to “oh ya also grab a flux capacitor” when he told me what I needed to get from shop to bring down the next morning. Well I made my version of one, and will be bringing it to him today. My only worry is I will be pulled over and the cop will see it and think it’s some sort of bomb lol.",
    "score": 421,
    "url": "https://reddit.com/r/electricians/comments/1nf6l35/here_is_your_fcking_flux_capacitor_bob/",
    "created_at": "2025-09-12T15:41:15.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1kmgioj",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "\"Banking hours\" instead of overtime",
    "text": "I recently started at a very small shop, where the apprentice told me the owner refuses to pay overtime for weekends/anything over 8.\nHis solution, is to let you \"bank\" your hours and you can use them for straight time, for \"paid vacation time\"\nThis seems to be against our contract and he tells us to keep quiet about it.\nHow do you guys feel about this? ",
    "score": 421,
    "url": "https://reddit.com/r/IBEW/comments/1kmgioj/banking_hours_instead_of_overtime/",
    "created_at": "2025-05-14T14:25:43.000Z",
    "num_comments": 255
  },
  {
    "id": "reddit-1iqa5ik",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Union shop now being managed by non-union workers.",
    "text": "Collective bargaining agreement pre-negotiations are coming up for my shop.\n\nMorale is super low, and I feel like I’m doing shop steward work trying to get all the field workers on the same page. \n\nOur management currently has been widely taken over by a non-union competitor.  So their views are very different, we start at $43hr have a 30- month step program to get to our full wage.  Outside guys are making $54/hr+ benefits and Electric utility low voltage guys make $64/hr.  The non-union guys didn’t have an 8,000hr program and start at around $20/hr.\n\nThese non union guys leading us are whittling us down, turning crews against each other because we are so understaffed.\n\nHow is it possible to lift morale and get the fight back in our union guys.  Most are close to retirement and don’t seem to care to shake things up.  I’m hungry and at the start of my career, I’ve laid out a two page strategy how to get things back on track.  \n\nAny insight would be helpful, I’ve talked to the shoppies,  the last ones gave away all our benefits and kissed company ass.",
    "score": 401,
    "url": "https://reddit.com/r/IBEW/comments/1iqa5ik/union_shop_now_being_managed_by_nonunion_workers/",
    "created_at": "2025-02-15T20:12:19.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1ntq0f2",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I might have just lost my apprenticeship because I took of my jacket and told my journeyman to stfu.",
    "text": " I have a lot of self harm scars and some very ugly looking scars. \n\nI generally always wear long sleeves so no-one knew about this. \n\nToday i got assigned to a journeyman I have worked with before, whom I dont really like. He is kind of an asshole and I have heard other journeyman refer him as an asshole before. He isn't well liked.\n\nIt was hot weather today and so he was pestering all day about taking off my jacket. Which actually by company regulation I need to wear.\nI told him multiple times to let it go.\n\nAnd with pestering I mean littlerally every third sentence he said was something about my jacket. And not in a nice caring way but a very bossy tone. He is weird honestly.\n\nAnd so at one point when i was concentrating on wiring correctly I snapped and took my jacket off and threw it at his chest and basically told him to shut the fuck up.\n\nHe obviously reported this to the manager. \n\nWe will see how it goes.\n\nThe stfu part and throwing was the problem.\n\nI know I was disrespectful and mean and I regret doing it.\n\nAlso yes its the same guy who called me a sissy for kneeling that I mentioned in a post earlier.\n\n",
    "score": 365,
    "url": "https://reddit.com/r/electricians/comments/1ntq0f2/i_might_have_just_lost_my_apprenticeship_because/",
    "created_at": "2025-09-29T18:32:59.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1mupkt4",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Member quitting so they could come out",
    "text": "I'm feeling pretty cranky when I hear these things. A member quits their job and deletes their social media accounts and nobody checks up on them. That in and of itself is problematic because, more often than not, that can mean they could be a danger to themselves, and nobody picks up on it, or just doesn't care enough if they do pick up on it.\n\nLater, it turns out that member decided to come out of the closet, but felt they had to give up their career and benefits,  and sever all ties for safety reasons, before they could do it. I'm just hoping they haven't withdrawn their card, but it sounds like that's a done deal. \n\n\"Look for the helpers,\" please, before you give everything up.\n\nhttps://youtube.com/shorts/6AL_jnVBps0?si=3-dHc9L25NC4nCWO",
    "score": 363,
    "url": "https://reddit.com/r/IBEW/comments/1mupkt4/member_quitting_so_they_could_come_out/",
    "created_at": "2025-08-19T17:48:07.000Z",
    "num_comments": 136
  },
  {
    "id": "reddit-1kfm027",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I’m out",
    "text": "We only have 2 contractors.  Neither will bid on any work unless it’s with a car plant in jurisdiction.   \n\nOrganizer won’t leave the office and get any new contractors.  There a bunch of work going non-union thru out our jurisdiction.  \n\nMy options are…\n\nA. Work for one of the 2 contractors and drive 100+ miles and 3+ hours a day, no per deim.  Work every weekend because car plant work let us do much work during week.   \n\nB. Travel, I’m basically already doing that inside my local.  \n\nC.  Go non-union and work 10 mins from home, same pay and benefits, plus vacation time.  \n\n\nI’m going with C.  \n\nLife in 5th district for ya! It’s been real! \n\nEdit…   No.  I’m not with 369.  We are further south.  Option C for me means Leave the trade entirely and Go be a robot in a factory.  \n\nWe over 800 members in our local, only 20 work under the agreement.  Most of use work in the local to our east and west. But have to drive 100+ miles one way to work in those locals. Takes about 2 hours to drive it.  And that’s what we do.  We have new banks, hotels, steel production plants, lumber mills all in need.  Our hall has told an out of state non union contractor from Louisiana that asked for help. “we will not fill your calls” . While we starve on the books. ",
    "score": 337,
    "url": "https://reddit.com/r/IBEW/comments/1kfm027/im_out/",
    "created_at": "2025-05-05T20:27:17.000Z",
    "num_comments": 187
  },
  {
    "id": "reddit-1hrc1bn",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "How did y'all do in 2024?",
    "text": "This year was a record breaking one for me. I basically doubled what I made in 2022 working my ass off at a steel mill.\n\nLong story short, I was happy with my last job, but it was super dangerous, stressful, big workload 24/7. Only paying me 32 an hour to do BOTH mechanical and electrical work.\n\nOctober 2022 we find out my wife is pregnant. Surprise! OK no problem, let's go house hunting so we can get out of our 1 bed apartment in the ghetto. \n\nAt 6 mos pregnant, her plant shuts down permanently and she's out of work. Goodbye house hunting...I'm stressing the fuck out on how I'm supposed to take care of the 3 of us on my salary alone.\n\nStart applying for jobs everywhere. Even out of state. Find the most ridiculous dollar/hr job out there and apply. Mind you, I had just hit my 5 year mark as an electrician (title, but still do mechanical work) at the time, so I felt like I for sure wasn't going to be as experienced or qualified as other applicants. \n\n2 months go by before I finally get the call to interview. Smash the interview. On a mission to raise my family and let my wife be a stay at home mom. \n\nOffer extended an week later. I accept. E&amp;I technician level VIII (top out).\n\nI've been here a year and a half now and I love it. After nearly 10 years in industrial maintenance in 3 different industries, I finally found a job that I actually enjoy AND pays me what I think is a pretty incredible wage for a younger guy with no fancy degrees or schooling apart from trade school and apprenticeship. I honestly feel like any good maintenance electrician should be making at least 100k a year base if they know their stuff and an asset to the team.\n\nI feel extremely blessed to have had this happen to me. And to anyone out there doubting themselves saying they can't find a better job or make more money because reason X Y or Z, if my sorry ass can do it, so can you! \n\nI wish an amazing 2025 for all my guys and girls rocking and shocking out there!",
    "score": 330,
    "url": "https://reddit.com/r/electricians/comments/1hrc1bn/how_did_yall_do_in_2024/",
    "created_at": "2025-01-01T20:44:24.000Z",
    "num_comments": 319
  },
  {
    "id": "reddit-1p3nauw",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Finally got a full time!",
    "text": "Finally got a full-time position as an electrician, and honestly… I’m still trying to process it.\n\nI’m 23, I graduated trade school in 2022, and ever since then it’s been this nonstop fight just to find stability. Every job I had was temp-to-hire, 2–3 months on a site, and then gone. No matter how hard I worked or how big the jobs were, I’d end up back at square one. I kept telling myself “just get through this job, maybe this one will stick,” and it just never did.\n\nI’ve done travel work.\nI’ve done short contracts.\nI’ve even done risky solo jobs I probably shouldn’t have done, just because I needed to survive and take care of the people I love.\n\nIt gets to you after a while tbh, like the uncertainty and pressure, the feeling like you have no place in the trade even when you’re giving everything you have. There were nights I couldn’t sleep at all because I genuinely didn’t know what my future was supposed to look like. I felt overlooked, disposable and honestly just mentally drained.\n\nI’ve always had this big dream in my head of what electrical work should feel like and kind of pride and structure I wanted to build under my brand, when I was doing solo work.\n\nI’ve always had this weird little dream in my head of what electrical work should feel like.\nAlmost like an old builder’s guild — a place where the guys actually care about the craft, where there’s pride and stability, custom gear, colors, crests, meetings, mentorship… all that stuff.\n\nBack when I was doing solo work, I even started building it out under the name Wolford Elektrik.\nIt sounds crazy, but I wrote like a 50-page document about it. I had ideas for a crew “identity,” for a real apprenticeship structure, even an inventors program where anyone in the company could share ideas, we’d build them, etch their name into it, give them lifetime royalties, basically a place that gave back to the people who built it.\n\nI always knew it was probably out of reach.\nIt was just something I daydreamed about while grinding through chaotic jobs.\nBut honestly, that dream is what kept me going. It gave me purpose when everything else felt pointless.\n\nLast week I interviewed with a company, and then had a second interview today, it felt different. They were genuinely kind. Professional. Clean. Respectful. Almost reminded me of the old-school IBEW guys, like those who really take pride in their work and would treat you different.\n\nI was honest with them about everything:\nthe solo jobs, the travel, why I ended up in unstable spots, why an apprentice was doing journeyman-level work alone in old houses and businesses. They connected the dots immediately and they even found my little one-man company from back when I was trying to survive off homeowner sign-offs. I told them straight up I wasn’t proud of that path, but I did what I had to do.\n\nThey really didn’t judge me, they listened and it was calming to see I was on the right path and had goals that others could respect. They actually were very intrigued I would say about learning about my past, and drive, goals.\n\nToday they offered me full-time.\n$20/hr starting.\nThey’re putting me in as a 2-year apprentice based on my logged hours, I recommend they just put me at 2 years (even though I’ve been doing electrical longer than that) it was fair for the both of us I felt.\n\nThey have their own schooling program.\nCustom company gear, matching helmets, a real team environment, it felt like the vision I always had in my head about my own ideology I came up with.\n\nI’m still nervous and I’m trying to not get my hopes up too high after so many unstable years.\nWhen you’ve been dropped so many times, it’s hard to trust good news, but I finally feel relieved and I hope this is where things start smoothing out and i can just breathe again after working so hard and seeing little progress.\n\nI start Tuesday, for the first time in a long time, I’m actually hopeful, hopefully it’s lasting and I can start building a future now, move out and just build something real.\n\nIf anyone out there is going through what I went through, unstable jobs, doing risky side work because you’re desperate, feeling forgotten or overlooked just know there are good people that exist, companies who will give you a real chance and that stability can exist. But you’ve gotta stay respectful, keep learning, and never lose pride in your work even when no one notices.\n\nThese last 3–4 years have been the hardest of my life.\nI’m still anxious, but I’m also grateful.\nAnd for once, I’m actually excited for Tuesday.\n\nSorry for the yapping, Thanks for reading if you made it this far, I just felt like I needed to get this stress finally off of my chest.\nTake care of yourselves, stay safe out there, and God bless.\n\n ",
    "score": 323,
    "url": "https://reddit.com/r/electricians/comments/1p3nauw/finally_got_a_full_time/",
    "created_at": "2025-11-22T07:33:24.000Z",
    "num_comments": 188
  },
  {
    "id": "reddit-1oaxbre",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "My company doesn't own an arc flash suit and is expecting me to de-energize an old CDP and tie in a new panel and re-energize it without a suit. Thoughts?",
    "text": "Im a Canadian sparky currently working at a company that just recently started branching into electrical work. We're doing a renovation of a pre-existing building and are adding a new panel to be fed off of their CDP. Multiple journeyman at my company have informed the office that we'd like an arc flash suit for when we inevitably have to re-energize the old CDP once we finish tying in the new panel. We've basically been told that \"an arc flash suit will just get you an open casket funeral\" and it seems very likely theyre just not going to get one and hope well just be okay with doing the work without proper ppe.\n\nI know a lot of guys in this trade have the cowboy attitude of \"we probably wont die\" and \"gotta get the job done\" but honestly i have a really hard time seeing this attitude as anything other than full on exploitation.\n\nIt seems to me that any electrical contractor thats serious about doing this line of work should own an arc flash suit. Its one thing if the owner of the company is the one performing the work without PPE however once theyre telling employees to perform work without PPE i fully believe its entering the territory of profits over workers health and safety.\n\nIm considering putting my foot down and flat out refusing to perform the work until I have a suit provided to me. However i imagine there will be some tension in this decision.\n\nThoughts on how to go about this? Every other company ive been at has had an arc flash suit.",
    "score": 316,
    "url": "https://reddit.com/r/electricians/comments/1oaxbre/my_company_doesnt_own_an_arc_flash_suit_and_is/",
    "created_at": "2025-10-19T18:36:28.000Z",
    "num_comments": 290
  },
  {
    "id": "reddit-1mnv0me",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I screwed a big time",
    "text": "Hey all, I’m a first-year apprentice who jumped from a $17/hr resi job with a chill three-man crew to a 2 man crew  piecework gig paying $30/hr. The catch? The pace is insane—they expect a full rough-in done in one day. At my old job, we took five days for the same work. I’m boxing the whole house ( I can typically get the plugs and switches on living room and upstairs under a hour 30 minutes, I just struggle with the lights because I’ve never really did them before) while the journeyman wires, and it’s a lot. Not whining, just adjusting to the grind. Any tips for keeping up? Thank you!! ",
    "score": 313,
    "url": "https://reddit.com/r/electricians/comments/1mnv0me/i_screwed_a_big_time/",
    "created_at": "2025-08-12T01:09:11.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1ol54tl",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I did it brother's and sister's!",
    "text": "4 and a half years since I made my very first boot prints on a construction site, and now I'm here. No longer a dumb ass apprentice, I'm now a dumb ass Journeyman! ",
    "score": 312,
    "url": "https://reddit.com/r/electricians/comments/1ol54tl/i_did_it_brothers_and_sisters/",
    "created_at": "2025-10-31T20:18:37.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1ho984t",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "New construction. Spot the issue",
    "text": "Was told by my journeyman that this was supposed to be a gas fireplace. The wire wasn’t done by us. Anyone have any idea why they did this?",
    "score": 308,
    "url": "https://reddit.com/r/electricians/comments/1ho984t/new_construction_spot_the_issue/",
    "created_at": "2024-12-28T16:30:31.000Z",
    "num_comments": 164
  },
  {
    "id": "reddit-1p5rjyj",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Journeyman wanting to specialize to avoid annoying trades",
    "text": "I’m a journeymen now, been doing this for 6.5 years now. I’m so fucking sick of working around drywallers and painters. They’re the most inconsiderate out of any group of people I’ve ever met. They’re always bring in their giant speakers and blast shitty music all fucking day with no regard for anyone that it annoys. I can’t take it anymore. I hate them so fucking much. They constantly bury my boxes and fill them with mud and make my job hell. What can I specialize in so that I never have to see them on site? I don’t want to do fire alarm and I don’t want to do low voltage data work. Any ideas?",
    "score": 305,
    "url": "https://reddit.com/r/electricians/comments/1p5rjyj/journeyman_wanting_to_specialize_to_avoid/",
    "created_at": "2025-11-24T20:05:10.000Z",
    "num_comments": 283
  },
  {
    "id": "reddit-1kclabc",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "3 years and a few months after starting in this trade, I passed my Journeyman’s test today boys.",
    "text": "Which is dumb, I mean why the fuck would they let me get certified? Do they know how retarded I am? Oh well",
    "score": 267,
    "url": "https://reddit.com/r/electricians/comments/1kclabc/3_years_and_a_few_months_after_starting_in_this/",
    "created_at": "2025-05-01T22:17:14.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1l586kc",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I love the life the ibew has provided me.",
    "text": "The ibew has given me the best life style.  \nGot laid off on Tuesday. What a crazy fun run, met some real brothers, Hope to see them on the next. 5.5 months on the road work 60-90h weeks, with perdiem, I was able to make a more than a years worth of pay and save most of it. Now I can retire for the summer/fall. while collection my unemployment pension and having benefits. \n\nThis truely is the most freeing job and its all thanks to the union. \n\n",
    "score": 266,
    "url": "https://reddit.com/r/IBEW/comments/1l586kc/i_love_the_life_the_ibew_has_provided_me/",
    "created_at": "2025-06-07T00:42:20.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1jye3co",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Only knowledge and solidarity will set us free! Books recommendations",
    "text": "This is not directly related to the IBEW, but it is directly correlated to the labor movement, and the working class politics.\n\nThese are books I highly recommend for those who are willing to learn about labor history, cultural context, the capital owning class divisive politics and what it means to be union minded (a good Brother who sees unions as more than a job with good pay and benefits).\n\nIf you have read some of these books or have more recommendations, please don't hesitate to share! Let's make anti-intellectualism uncool again, we are blue collar workers, which doesn't necessarily mean that we re unintelligent! All they want is obedient workers and reliable consumers who punch down (against different races/sexualities...) for a reason! to stay divided.",
    "score": 245,
    "url": "https://reddit.com/r/IBEW/comments/1jye3co/only_knowledge_and_solidarity_will_set_us_free/",
    "created_at": "2025-04-13T18:14:38.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1ietr2q",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Why is there a trade shortage, Why is it so hard to get into the trades, why are all the jobs crap?",
    "text": "For anyone wanting to become an apprentice reading this. There's not a shortage of apprentices. There's a shortage of journeyman. The reason that you can't easily find an apprentice position is there is not enough jmen to sponsor your education. Why is there not enough jmen? Well \"in Ontario, studies have shown that the completion rate for apprenticeship is only 50%.\"\n\nhttps://www.hrpa.ca/wp-content/uploads/2020/10/Apprenticeship-Reform-WhitePaper-2014.pdf",
    "score": 236,
    "url": "https://reddit.com/r/electricians/comments/1ietr2q/why_is_there_a_trade_shortage_why_is_it_so_hard/",
    "created_at": "2025-02-01T00:21:53.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1p7oqpo",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "What are they teaching electricians these days?",
    "text": "Got a journeyman friend who thought 40 amp breakers on receptacle circuits were good to go (issue was a guy who ran a 70 amp circuit to a 2 position sub panel for a shed and realized he wouldn't be able to use all the power). He admitted after some chatting about it that he \"didn't really understand all the volts and amps stuff in school\". Was talking to another electrician the other day who insisted you can only get 208 volts on a 240v circuit cause \"You're only allowed to pull 80%\". Got any good ones?",
    "score": 223,
    "url": "https://reddit.com/r/electricians/comments/1p7oqpo/what_are_they_teaching_electricians_these_days/",
    "created_at": "2025-11-27T00:52:28.000Z",
    "num_comments": 170
  },
  {
    "id": "reddit-1l1bhky",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "New CBA ratified by MI Dem Party Workers!",
    "text": "Thrilled to announce that MDP permanent staff **(Local 1106)** and the Michigan Democratic Party have ratified our second contract! Working alongside our new party chair during negotiations brought fresh energy and perspective to the process. Special thanks to IBEW, Local 1106, and other locals across Michigan**,** whose steadfast guidance and support were instrumental in reaching this milestone. As a nonpartisan union representing workers across the political spectrum, IBEW's expertise helped us secure fair working conditions and benefits for our dedicated staff.\n\nThis contract represents another step forward in our commitment to practicing the labor values we champion. Together, we're building a stronger party that walks the walk when it comes to workers' rights. Thank you to everyone who helped make this happen! 💪 #UnionStrong #Labor #IBEW #Solidarity",
    "score": 220,
    "url": "https://reddit.com/r/IBEW/comments/1l1bhky/new_cba_ratified_by_mi_dem_party_workers/",
    "created_at": "2025-06-02T07:04:52.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1noeoti",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Why electricians salaries relative to median of all workers dropped since 2000?",
    "text": "looking at bls in 2000\n\nmedian hourly wage for all workers was 12.55  \nfor electricians it was 19.29\n\nso electricians in 2000 earned about 53% more than median worker\n\nwhile in 2024\n\nmedian hourly wage is 23.8  \nfor electricians it is 29.98\n\nso electricians in 2024 earned 26% more than median worker on median.\n\nWhy median electrician is in 2024 falling behind compared to 2000? Arent they like getting more in demand compared to other occupations?\n\nIts like electricians lost 17% of purchasing power in 24 years compared to other occupations.",
    "score": 183,
    "url": "https://reddit.com/r/electricians/comments/1noeoti/why_electricians_salaries_relative_to_median_of/",
    "created_at": "2025-09-23T11:22:27.000Z",
    "num_comments": 162
  },
  {
    "id": "reddit-1pd3wmk",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "wages",
    "text": "your wages are not high, or even close to high, if you put the average journeymans pay rate from 1980 where they were making 28$/ hour into and inflation calculator it comes out to 102.5$/ hour this is average we are talking about here. How? Everyones standard of living has improved look at all stuff thats been made since 1980! My point of this post is if you dont hold your delegates/ employers feet to the fire everyone gets burned, im not trying to turn this into a crusade but at this rate of decline everyone is going to be living in a room share or worse in the next 40 years. My point is that with inflation all the goal posts keep moving except salary doesn’t keep pace. one of the higher paid packages is 73.5/hour thats still about 30% less than what the same guy was paid in 1980, what happened? is there an over saturation of qualified people? thats not what im seeing if anything its the opposite. If you dont hold your delegates / owners feet to the fire everyone gets burned. Im old enough to remember the 90s and im concerned with the trajectory things are on. People know what im talking about but no one does anything, please dont accept another 40 year decline and dont think robots will do everything and we will just get paid to live by then - thats not how its going to shake out good luck out there\n~from some guy with decades in this field, a masters in two states and old enough to remember the 90s lol im qualified ",
    "score": 171,
    "url": "https://reddit.com/r/electricians/comments/1pd3wmk/wages/",
    "created_at": "2025-12-03T13:18:13.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1lelvqr",
    "subreddit": "IBEW",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Local 701 Needs Travelers",
    "text": "Just a heads up, Local 701 is putting travelers to work. I just called and listened to the job calls and most were schools doing OT. I included our most recent wage package. Come to work, folks, and good luck!",
    "score": 162,
    "url": "https://reddit.com/r/IBEW/comments/1lelvqr/local_701_needs_travelers/",
    "created_at": "2025-06-18T16:40:50.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1k2fqkw",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Sparky salary",
    "text": "Wassup sparkies ⚡️ (19M) I’m currently a first year apprentice in Cali &amp; make $21.50 an hour. I’m just curious as to what your salaries are &amp; if it’s non-union or not. Reason is because I see people claim to be making 150k a year while others are at 80k both JW. Just wondering is all ! ",
    "score": 161,
    "url": "https://reddit.com/r/electricians/comments/1k2fqkw/sparky_salary/",
    "created_at": "2025-04-18T21:09:51.000Z",
    "num_comments": 408
  },
  {
    "id": "reddit-1o34jjb",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "I am sorry, but salary doesn't pay overtime in the US ? I am in Europe 🇪🇺 and I get overtime and I have a salary.",
    "text": "I littlerally left work four hours early today because there was nothing to do. I still get paid for those hours. And I get paid overtime. ",
    "score": 105,
    "url": "https://reddit.com/r/electricians/comments/1o34jjb/i_am_sorry_but_salary_doesnt_pay_overtime_in_the/",
    "created_at": "2025-10-10T15:46:20.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1i00ag8",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "What’s your salary (NO OT) and where are you located? ",
    "text": "i’m freshly 20, spent too much on a coding bootcamp and things are looking bleak / i lost a lot of interest. I don’t know if college is going to be my thing nor do i have lots of money or want to wait 4 years. \nTrying to decide if this or welding would be a good career choice for me.\n",
    "score": 82,
    "url": "https://reddit.com/r/electricians/comments/1i00ag8/whats_your_salary_no_ot_and_where_are_you_located/",
    "created_at": "2025-01-12T23:32:21.000Z",
    "num_comments": 551
  },
  {
    "id": "reddit-1nvcv1p",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "American electricians, is salary pay not a thing for trades in the USA ?",
    "text": "I read a lot of comments that said that they would love a salary or they wished when they were apprentices that they had a salary. Is salary more uncommon in the US ?In Austria pretty much everyone gets a salary. My salary is about 1900 after taxes.",
    "score": 47,
    "url": "https://reddit.com/r/electricians/comments/1nvcv1p/american_electricians_is_salary_pay_not_a_thing/",
    "created_at": "2025-10-01T16:25:10.000Z",
    "num_comments": 171
  },
  {
    "id": "reddit-1iwqx7n",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "How much were you making in the first 2 years as an apprentice ?",
    "text": "Hey you guys I live in SoCal, Los Angeles area,\n\nI'm 29 and I currently work as an armed security supervisor getting paid $30/hr with OT I'm averaging 75k to 80k a year after taxes. And l've been thinking about changing career fields, I have buddy's who are electricians and they've been in the trade for over 4 years and they are getting 40-50/hr with overtime. One can only wish to get paid that much so it was motivation for me to get into a trade preferably electrical. Also I'm not just doing it for the money I genuinely want to learn something new and I know when you're working a trade there is always something new to learn everyday so much potential for growth every single year, the problem is if I decide to switch fields ima have to take HUGE pay cut im talking about 40% pay cut from my annual salary, i don't mind taking the cut for the lst year and half if anything I know I will have to budget some how but how much were Yall getting paid after your first 2 years as an apprentice??? Non union workers. I was thinking as soon as I get my ET certificate to just apply right away to a shop or something just to start getting my hours in.",
    "score": 24,
    "url": "https://reddit.com/r/electricians/comments/1iwqx7n/how_much_were_you_making_in_the_first_2_years_as/",
    "created_at": "2025-02-24T02:02:41.000Z",
    "num_comments": 117
  },
  {
    "id": "reddit-1lutfz7",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "First job salary?",
    "text": "What was your guys first job salary? I just got hired as an apprentice and I’m at $17 a hour. \n\nWhat do you make now and how long have you been working there ? Just questions don’t wanna be too invasive lol I have no experience this is my first job and I also am only 19 ",
    "score": 20,
    "url": "https://reddit.com/r/electricians/comments/1lutfz7/first_job_salary/",
    "created_at": "2025-07-08T16:40:38.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1kbsems",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "How do you guys handle biohazards?",
    "text": "Im likely getting a job for \"community safety\" and have been made well aware. Its an old timer that has been rat and mold infested (i cant condemn and i have no eyes on). Ill take double salary but i need me and my guy to be safe. Rats are being cleared before any other work is done. Ive made it clear i dont work around rotted rats. Id like to know if anyone has worked in a biohazard \"make safe\"\n\nEDIT: i worded this poorly. We inflated the budget heavily to account for all safety measures plus additional ppe. My ask was have you done biohazard and what have you used. I already set my base parameters. It's off hours this is just curiosity ",
    "score": 15,
    "url": "https://reddit.com/r/electricians/comments/1kbsems/how_do_you_guys_handle_biohazards/",
    "created_at": "2025-04-30T21:49:02.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ochxgj",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Electrician to an electrical engineer?",
    "text": "I’m 26 years old and started electrical work 3 years ago. Went to trade school got my certification and school hours (non union). Ended up getting my state master license and opened up my own company but beating around the idea of going back to school to get an electrical engineering degree.. any benefits or am I wasting my time and money? Idea of owning my own company is great on paper but I just started and the first few years of ownership i’m sure will be hell. Is it worth it? Or better to just get a degree and take whatever 6 figure salary a company will give you with all the benefits? Thanks in advance.",
    "score": 15,
    "url": "https://reddit.com/r/electricians/comments/1ochxgj/electrician_to_an_electrical_engineer/",
    "created_at": "2025-10-21T16:40:32.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1lti87r",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "ELECTRICIANS SALARY",
    "text": "all electricians I’m curious\n-What is your state of service \n-what is you net salary \n-how many years experience\n-would you open your own company later on",
    "score": 10,
    "url": "https://reddit.com/r/electricians/comments/1lti87r/electricians_salary/",
    "created_at": "2025-07-07T01:57:28.000Z",
    "num_comments": 150
  },
  {
    "id": "reddit-1l1z0gl",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Does this count towards Apprenticeship hours?",
    "text": "I’m looking around to get hired as an apprentice and found this job at an electrical products company. Would this count towards apprenticeship hours and then I can start an apprenticeship program at a vo tech?",
    "score": 6,
    "url": "https://reddit.com/r/electricians/comments/1l1z0gl/does_this_count_towards_apprenticeship_hours/",
    "created_at": "2025-06-03T01:03:00.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1psl3w1",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "questions for the Californians",
    "text": "got my Jcard in FL few years back, i do majority commercial and industrial work. The wife wants to relocate to CA for nursing, is it worth it on my end for the pay? I've checked site for average salary but its too broad of numbers. ",
    "score": 5,
    "url": "https://reddit.com/r/electricians/comments/1psl3w1/questions_for_the_californians/",
    "created_at": "2025-12-22T00:05:40.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1o42gaa",
    "subreddit": "electricians",
    "soc_codes": [
      "47-2111"
    ],
    "title": "Subbing vs employed pay",
    "text": "I'm in the UK. I've been subbing to one company for about 10 years and he's finally getting a bit worried about getting caught (as your only supposed to sub for 6 months max) by the tax man. I'm currently on between 200 and 250 a day depending where and what work I'm doing. I average about £51k a year but obviously I provide my own van, tools etc.  What do people think would be an equivalent wage as employed on a salary? He said he would be happy to provide a company van and probably about 25 days holiday plus bank holidays. Obviously he is going to have to pay a lot more National Insurance now and pay for holiday pay so I know my salary would be less than 51. It needs to be fair for both of us. Just wondering would people think would be realistic. Any advise would be appreciated ",
    "score": 5,
    "url": "https://reddit.com/r/electricians/comments/1o42gaa/subbing_vs_employed_pay/",
    "created_at": "2025-10-11T18:07:26.000Z",
    "num_comments": 10
  }
]