[
  {
    "id": "reddit-1npso4r",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Grateful for TkE who have solidified my family's financial future",
    "text": "https://preview.redd.it/dz93tu30h7rf1.jpg?width=6091&amp;format=pjpg&amp;auto=webp&amp;s=0a9c609478190255a3130e7654415755117847c4\n\nI work in sales for an independent and I've picked up more accounts and made more commission from TK's rotting customer base this year alone than my entire sales career up to this point.\n\nI just want to share some gratitude. Best of luck on your IPO.  \nYour shareholders and competition are thrilled with you!",
    "score": 127,
    "url": "https://reddit.com/r/Elevators/comments/1npso4r/grateful_for_tke_who_have_solidified_my_familys/",
    "created_at": "2025-09-25T00:27:06.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1khsyuf",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Not good",
    "text": "There's been an eath quake in turkey not long ago and we felt it in Bulgaria where I started working as a lift technician. I thought you guys might find this interesting. The counter weights came out of the rails.",
    "score": 115,
    "url": "https://reddit.com/r/Elevators/comments/1khsyuf/not_good/",
    "created_at": "2025-05-08T15:29:31.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1lulgnv",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Asking for a little bit of help.",
    "text": "As many of you know, I run a small elevator museum in Roanoke, VA.   Many of my visitors are younger autistic people and my goal is to send every visitor home with an elevator piece.  Obviously I am not sending them home with anything really historic or any thing.   I have something called the \"giveaway bin\" where I have just stuff like adams survivor, dover impulse, and just modern basic fixtures.   What I need help with is my giveaway bin is running very low.   WHAT I AM LOOKING FOR.  Just standard sized call stations, not the big surface mount rather just standard sized call stations.  I am looking for a fairly large quantity to replenish the give away bin.  I know alot of you work in the industry and if any of you pull just some standard sized call stations, I don't really care the brand as they are just to give out to visitors as a souvenir of their visit.   Please DM me if you can help and I will pay shipping. Of course as far as the museum goes, I am ALWAYS looking for historic car panels and call stations to put on display but that is not really the purpose of this post.  I am simply trying to replenish my \"giveaway bin\"   Thanks so much in advance for any help. ",
    "score": 103,
    "url": "https://reddit.com/r/Elevators/comments/1lulgnv/asking_for_a_little_bit_of_help/",
    "created_at": "2025-07-08T10:51:27.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1oaamck",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Classroom Elevator Model",
    "text": "Over the last year, my students in my school worked together to repurpose an old bookshelf and create remote controlled elevators with functional doors for a class science project. We made sure to add notable features like simplified governors, floor selectors, and hall lanterns. The floor numbering is inspired by Macy’s Herald Square.",
    "score": 102,
    "url": "https://reddit.com/r/Elevators/comments/1oaamck/classroom_elevator_model/",
    "created_at": "2025-10-18T23:25:04.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1o1umjf",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Leave cushy office job for elevator trade?",
    "text": "Currently, I (20s with a STEM degree that I will most likely never fully utilize) work a cushy 9-5 relatively stress free office job with a 20min commute and everyone wear headphones all day and I keep to myself most of the time but it is your typical soulless corporate job with low pay and career growth is nonexistent. I will most likely never get any significant raise from what I have now unless it is a promotion. \n\nIt's just mind numbing work which can be good depending on how you look at it. This job however doesn't give me a lot of marketable skills to find another job but its unlikely that I would be laid off anytime soon here.\n\nWould it be a good idea to jump into the elevator trade or would you take a relaxing and easy office job any day of the week if you could? \n\n",
    "score": 18,
    "url": "https://reddit.com/r/Elevators/comments/1o1umjf/leave_cushy_office_job_for_elevator_trade/",
    "created_at": "2025-10-09T02:35:22.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1japszs",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Why does this subreddit preach third party controls?",
    "text": "I just came from a mod job walk that was last done in 2009 using MCE controls. It’s been maintained its entire life by a union “independent” shop. (VC backed is why I use “”) \n\nI’ve got a customer with a 2021 EC pixel controller that is trying to seeking legal assistance because EC is telling everyone some board is obsolete and it will require an upgrade and new software. \n\nI admittedly have worked for a major my entire 20 year career. I’m not saying a major is better, I’m honestly asking. I’ve serviced plenty of competitor equipment over the years. \n\nI’ve installed smart rise in multiple jobs and they seem fine but again, those jobs are pretty new so nothing really to go on with them. \n\nAm I missing something? If so, again, I’m trying to learn here. ",
    "score": 17,
    "url": "https://reddit.com/r/Elevators/comments/1japszs/why_does_this_subreddit_preach_third_party/",
    "created_at": "2025-03-13T23:18:54.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1keyc90",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Homework - Acronyms!",
    "text": "Hi all, I'm a 4th year electrician in Australia, I've recently had a field career change from commercial electrical then into doing lift, escalator and travelators. It's been an incredible journey so far learning so many different style of systems. Learning those systems has not been easy but isn't an issue for me, however the acronyms for the safety circuit have been the most confusing for me. It's imperative I understand these safety circuits, not only for myself but also for those around me, I want to know these acronyms as best as I can so it's easier for me to fault find after doing repairs on a motors/ gearboxes. I also want to understand so when it comes to bridging these safety circuits I'm not putting myself and others in danger. \n\nFrom my understanding with what has been explained to me is;\n\nJ - are a form of a stop switch e.g. emergency stop switch\nK - a form of contact/or\n\nI'm not sure where the T1-T2-T3A-T3B-T4-T5 are individually located in the whole lift system\n\nAnd that's as far as I'm hung up on. The rest of the acronyms I have no clue about what they do and where they are relatively positioned in the whole system. I don't have any material to better me understand these acronyms and any help would be so much appreciated as it helps better me and those around me. TIA!!\n",
    "score": 16,
    "url": "https://reddit.com/r/Elevators/comments/1keyc90/homework_acronyms/",
    "created_at": "2025-05-05T00:08:06.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1mczbo7",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Drop 150k job to pursue apprenticeship?",
    "text": "Hi there fellas, I'm currently an industrial mechanic at a union shop (teamsters) I average around 135k-150k  some guys clear over 180k. I'm 29yo I've always wanted to get into the elevator trade and I feel like my time is running out to join an apprenticeship. My local is accepting apps in March. Idk if I can go 5yrs with lower pay but I'm sure it would be worth it at the end.\n\nWould you guys drop this job to pursue a career in the elevator trade if you had to do it all over again? TIA",
    "score": 15,
    "url": "https://reddit.com/r/Elevators/comments/1mczbo7/drop_150k_job_to_pursue_apprenticeship/",
    "created_at": "2025-07-30T06:33:08.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1mmzsqd",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Too old ?",
    "text": "Hello,\nI’m a 28-year-old male looking for a career change. I’m currently working as a CDL driver, earning between $75,000 and $85,000 annually, I understand the apprenticeship is a four-year process. Question is iam crazy for even considering it ? \n",
    "score": 14,
    "url": "https://reddit.com/r/Elevators/comments/1mmzsqd/too_old/",
    "created_at": "2025-08-11T01:17:56.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1kclsgp",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "7 year auto door tech. How realistic would a career change be?",
    "text": "I’m 27, hard worker, I can piss clean. I’ve worked on auto doors for 7 years, sliding doors, heavy rolling steel doors, vault doors, fire doors. I have my MSHA certification, AAADM cert, and my CFDAI certification (life safety and fire code). I want to move to elevators and live in Arizona. Am I SOL or could I pull it off?",
    "score": 10,
    "url": "https://reddit.com/r/Elevators/comments/1kclsgp/7_year_auto_door_tech_how_realistic_would_a/",
    "created_at": "2025-05-01T22:40:08.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1octruc",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "IUEC Local 8 Mechanics",
    "text": "Hey all! Hope you are well!\n\nI am looking to connect with mechanics in IUEC local 8, hear your career story, hear about what type of equipment you’ve seen in the bay, and network!\n\nLet me know if you are in IUEC 8, as I’d love to connect!\n\nThank you for all of the hard work you do daily, you are appreciated!",
    "score": 6,
    "url": "https://reddit.com/r/Elevators/comments/1octruc/iuec_local_8_mechanics/",
    "created_at": "2025-10-22T00:25:06.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1jttmua",
    "subreddit": "Elevators",
    "soc_codes": [
      "47-4021"
    ],
    "title": "Guide rails oil viscosity",
    "text": "Hi guys, sorry if i make spelling mistakes, English is not my first language.\n\nSo for the better time of my career, i've been oiling the guide rails with an oil specifically designed for guide rails of machinery with a viscosity of 220. I also pour it in oilers that you see on newer elevators. So far it has always worked great on all the equipment i service. Rails are never dry and the oilers don't empty fast.\n\nToday A colleague told me that for a Schindler 3300, you need to put viscosity 68 or at most 150 in the oilers. Indeed, after I checked the maintenance instructions, it's true. Though I've never had problems with 220 in the past on a 3300. In fact they run super smooth lol.\n\nThe instructions did not specify *why*, though. Does anyone here know why Schindler wants you to pour 68 in there? I'd guess it's to not contaminate the STM's, but i'd guess the 220 would then be better because it's more sticky to the rails.\n\nAnd what do you use on the daily?",
    "score": 5,
    "url": "https://reddit.com/r/Elevators/comments/1jttmua/guide_rails_oil_viscosity/",
    "created_at": "2025-04-07T19:15:55.000Z",
    "num_comments": 11
  }
]