[
  {
    "id": "reddit-1klih0h",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Lost my first peds in the rig, never felt pain like this on the job",
    "text": "Drunk driver hit family of 4 going on a roadtrip late last night, mom and dad dead, two young twins in critical condition, the twin our rig took on was lucky to still be alive. I did everything I could but she passed away before we got to the hospital, pronounced DOA at hospital. Literally sat outside for 2 hours staring at the stars, I've never lost someone that young on the rig. Boss told me to take few days off to regain my composure but holy shit, as a Dad myself I've been taking this one HARD.\n\nAlso, if you drink and drive, fuck you. Fuck you to hell. 9 year old girl has to grow up without Mom, Dad and Sister now. Of course, for some fucking reason the drunk driver was perfectly ok.",
    "score": 1349,
    "url": "https://reddit.com/r/ems/comments/1klih0h/lost_my_first_peds_in_the_rig_never_felt_pain/",
    "created_at": "2025-05-13T10:26:41.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1mggqtr",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Our Station Cat of +10 years Passed Away",
    "text": "Rest easy Catniss Meowverdeen. The only supervisor who never missed a shift, always knew when we needed comfort, and managed to nap through every emergency call. You were more than just a station cat; you were family to everyone. We'll miss your quiet wisdom, your judgemental stares, and your uncanny ability to show up exactly when morale was low. Thanks for being our furry little constant in the chaos.",
    "score": 1252,
    "url": "https://reddit.com/r/ems/comments/1mggqtr/our_station_cat_of_10_years_passed_away/",
    "created_at": "2025-08-03T11:17:26.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1jelpt1",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "i did it.",
    "text": "guys,\n\ni left the stretcher at the hospital. \n\ngot to a call. opened the door. no stretcher.\n\nwill never happen again (i swear).\n\nsincerely,\ndumbass\n\nfeel free to share your embarrassing experiences to quell my sadness. thanks ",
    "score": 1208,
    "url": "https://reddit.com/r/ems/comments/1jelpt1/i_did_it/",
    "created_at": "2025-03-19T01:28:19.000Z",
    "num_comments": 183
  },
  {
    "id": "reddit-1j3wn0k",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "This is why I loved working in Healthcare.",
    "text": "12y/o female patient asked if her arm was broken upon our exam prior to Xray. When we told her it was broken and she needed a cast she was in tears because she said, \"I don't want a stupid pink one because I'm a girl.\" I asked the ortho doc what size casting he was going to use. He showed me and I grabbed all the colors we had but pink. I showed the patient and she stopped crying and asked for a hug. She needed up picking black, blue and purple to be spiral wrapped. \n\nThen, in recovery when the patient woke up she demanded to see me to be the first one to sign her cast. I had left as my shift was over at the ER and headed to the station for work. That little girl called the station herself and asked if she could come down. I said yes,  but we may not be here if we get a call. Half hour later her and her parents arrived at the station and got me to sign her cast and take a pic of us. \n\nIt's little things like that memory that helps the CPTSD.",
    "score": 1166,
    "url": "https://reddit.com/r/ems/comments/1j3wn0k/this_is_why_i_loved_working_in_healthcare/",
    "created_at": "2025-03-05T06:12:18.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1nnrsel",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "My partner broke the sacred rule.",
    "text": "I got to the truck after I finished pumping and found my partner using both of the cup holders. No amount of passive aggression when looking for a place to put my drink worked. I said nothing because almost everything out of his mouth is moronic and I try to minimize any interaction I have to have with him for my own sanity. \n\nOther highlights this week are: Tylenol causes autism, getting visibly upset when I said I’m not a stay at home mom because I don’t want to be, and saying Baptist isn’t evangelical Christianity. But there’s plenty more. \n\nI am counting the days until the new shifts take effect with glee! ",
    "score": 1128,
    "url": "https://reddit.com/r/ems/comments/1nnrsel/my_partner_broke_the_sacred_rule/",
    "created_at": "2025-09-22T16:49:37.000Z",
    "num_comments": 153
  },
  {
    "id": "reddit-1m5ksxn",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "I am officially retired.",
    "text": "20 minutes left,  but already handed off my keys to next crew. Brutal day, got 2 hours down on a 24, put probably 500 miles on the rig (rural private ems emt-b on an ALS unit). 15 years. Nicu/picu team, large city, rural, ran two nonprofit EMS programs.\n\nI remember my first patient. She wrote a book. Keep a copy of it at home.\n\nIt felt very weird putting the uniform on for the last time. I almost wanted to iron it. But that would obviously be inappropriate for private EMS. \n\nI did however convince the charge nurse to give me a set of psych scrubs for where I'm going next.\n\nI start med school in 3 weeks. See y'all from the other side in 4 years. \n\nKeep calling for those safety breaks when dispatch forgets you aren't a robot and your focus is hovering around the drink/drive limit. You covering/hustling too much on nonemergent calls for a perpetual lack of staffing just tells management they can get away with it. Protect your backs. Don't tailgate, 2-4 seconds following minimum. Take care of your mental health. And (most likely) get that ADHD actually treated. It's worth it.\n\nCheers, fellas. \n\n",
    "score": 885,
    "url": "https://reddit.com/r/ems/comments/1m5ksxn/i_am_officially_retired/",
    "created_at": "2025-07-21T14:44:26.000Z",
    "num_comments": 98
  },
  {
    "id": "reddit-1ld849j",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "From over on Facebook",
    "text": "**TLDR: I don't personally have strong opinions for or against this, mostly just posting to hear why others feel this is or isn't a good idea.**\n\nIMO it could potentially be beneficial, could potentially be harmful. While I think footage of certain high acuity calls could be useful for internal training purposes something I wouldn't want to see is such footage being used to put EMSPs clinical judgement/approach further under the microscope and subjecting it to unnecessary scrutiny from administration, though I do think that for the most part if protocol was followed this is a non-issue. \n\nThe concerns for potential HIPAA violations are also a non-issue IMO, unless for some reason access to the footage wasn't restricted. Where I work we already have cameras in the back of the ambulance (also have inner facing dash cameras in the front so big brother can keep an eye on us) and then of course for many high acuity calls law enforcement is usually around with their cameras recording, at least until we leave the scene. ",
    "score": 581,
    "url": "https://reddit.com/r/ems/comments/1ld849j/from_over_on_facebook/",
    "created_at": "2025-06-16T23:28:48.000Z",
    "num_comments": 319
  },
  {
    "id": "reddit-1kgow6e",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Seeing this shit PMO",
    "text": "Nurses should not be educators for Paramedics unless it’s about specialty care like NRP or ICU devices. We should be receiving education from experienced paramedics or physicians ONLY. Side note - STOP letting single role nurses teach at paramedic programs. Happy nurses week.",
    "score": 556,
    "url": "https://reddit.com/r/ems/comments/1kgow6e/seeing_this_shit_pmo/",
    "created_at": "2025-05-07T04:35:50.000Z",
    "num_comments": 282
  },
  {
    "id": "reddit-1lpdbm5",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "I Found A Baby",
    "text": "This won’t be the typical EMS post:\n\nI’m a paramedic and I moonlight doing in home urgent care. Today I’m in the urgent care role. \n\nI was leaving my last patient and as I was driving through the neighborhood to get to the main street, I saw a baby in the yard of one of the houses. Probably 1 and a half years old. Walking, not really talking. She had a bottle in her mouth and she was sitting in the rocks near the street and she would get up and walk a couple steps and sit down and then I saw she wasn’t wearing any shoes or socks and she had a bottle of milk (It’s 111 degrees btw). I don’t want her to get run over by a car or burn her feet so I stop and get out. I walk up to her and say hello. And she gives me the blank baby stare. \n\nI reach down to pick her up and she gives the international “uppies” signal and puts her bottle in her mouth and holds it by her teeth and raises both arms up for me to pick her up. I pick her up and she immediately puts her head on my shoulder and hugs me. 🥹\n\nI carry her to the front door of what I suspect is her house. No doorbell so I just kinda shout through the screen for whoever is in there. An abuelita shows up and sees the girl and she’s like “oh adios mio! No no no no no! The. She starts yelling in Spanish at someone else in the house and this girl comes to the door and she’s stunned, concerned, embarrassed. She started apologizing profusely and I just said it’s okay. I’m a dad. I get it. It happens. Kids find ways to get away from their parents. And she takes the kid and thanks me. \n\nWe said goodbye and I start walking away and the baby reaches out both hands to me and starts screaming at me. She was so upset I was leaving. Hahaha it was so freaking cute.",
    "score": 478,
    "url": "https://reddit.com/r/ems/comments/1lpdbm5/i_found_a_baby/",
    "created_at": "2025-07-01T21:00:32.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1jis7ms",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Should Paramedics Have the Authority to Refuse Transport for Patients Who Do Not Need an ER Visit?",
    "text": "I know my answer. Debate it you salty dogs.\n\nEdit Below:\nloving the discussions! \nFor the “Liability” people - everything we do is a liability. You starting an IV is a liability. There are risk to everything we do, picking someone up off the floor has risk and liability.We live in a sue happy world and if your not carrying mal-practice insurance ( not saying your a bad provider ) then you probably should if your worried about liability. \n\nFor the Physicians. I loved the responses. I agree, EMS providers do not have the education that you have. Furthering our field requires us to atleast start obtaining bachelors for Paramedicine with a background in biology, pathophysiology, etc. if we really want to start looking at bettering pre-hospital care and removing the strain off the ERs.\n\nWill have another clinical debate soon.\n",
    "score": 417,
    "url": "https://reddit.com/r/ems/comments/1jis7ms/should_paramedics_have_the_authority_to_refuse/",
    "created_at": "2025-03-24T14:39:46.000Z",
    "num_comments": 311
  },
  {
    "id": "reddit-1ktodpt",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "After 6 years of being a paramedic, I can't stand EMS culture anymore. I quit.",
    "text": "Been in EMS for 9 years now and I am just sick of it. Came into EMS in my early 20s. I need to vent and guess I need advice on what the heck to do with my life. I have a degree in biology with 3 years of it being an ED tech for my certs.\n\nI don't mind patients at all. I love helping people as cliche as it sounds. In fact, this is the sole reason and will remain my reason for why I stayed in this career. Yes, there's been the frequent flyers, entitled ones, assholes, and everything in between. It's not bad considering you're only with them temporarily. Yet, I still give every one the same high quality care because they deserve it. Each patients get a full and fair patient assessment. Every patient is accomodated that best way I could make it work. If I can't, I'll just apologize and move on.\n\nIt's the culture of that I can't stand. I'm not trying to sound like a feminist, but I swear females get the crappy end of the stick. Granted, I understand this a male dominant field. \"Oh you missed an IV. Looks like you're not cut out to be a paramedic. Girls like you should just stick with being an EMT and drive, which sucks cause women can't drive\". (FUCK YOU Dave. I don't care. I wish I would have said something that day. I was livid.)\n\nI am small. I am 5'1 and 110lbs. But I feel like I get bullied because of my stature. The constant teasing, the constant butt end of the jokes. I was trying to restock my truck and the i-gels are at the top of the shelve. I am so short that I need a step stool. The supervisor says, \"Looks like this is a job for a tall man. Let me get this for you.\" I'm sure he meant no malicious intent from it, but I hear it all the time. Also, I was cheerleader in the past for years. I've helped throw people up in the air before and I still consistently weight lift. Lifting patients remind me of cheerleading where we need teamwork. Earlier this year, a firefighter pushed me away (not hard, but just enough to let me know to get out of the way) while I was holding the mega mover ready to move this patient to a stretcher.\n\nI am that stereotypical cheerleader where I have this bubbly, funny, high spirits (no pun intended lol), and charismatic nature. But this toxicity has turned me into a miserable person that I swore I never would become.\n\nMy washing machine broke one day and all I had was just old EMS uniforms, so I wore that. I wore a thong that day since I didn't have any clean underwear. My partner hit something under the ambulance, so we pulled over and I am bending over look to see if there were any damages. My shirt got untucked while looking and I didn't think anything of it. Then, one of my coworkers started being super friendly and flirty with me one day. I was confused. I told my partner about it and he laughed. I was still confused. Apparently, my partner snapped a picture of me bending over and you can clearly see that I was wearing a thong because my shirt was untucked. I felt so violated, so I went to the director. My partner got suspended for a week, but still worked there. To this day, I don't know how many people got that picture. I quit that agency a month afterwards because rumors got spread and I just got too embarrassed to work there.\n\nIt's the shitty partners, admins, nurses, and doctors that just make this job miserable. Granted I've had a significant fair share of wonderful colleagues and it makes the crappy low-paying job worth it.\n\nCool, thanks for the ROSC challenge coin. Cool, thanks for the delivering baby challenge coin. Omg another EMS shirt. Hey, the hospital just restocked chips and water in the EMS room. Collected a crap ton of coins that is just collecting dust. Oooo cool I got a paramedic of the year in 2022 and 2024. Yayyy. But, where is the pay? I started off making 14.50/hr as EMT in 2016 and 22.50 as a paramedic in 2019. Guess what I make now? A whopping $25.50. I don't care about rewards. I can't pay my bills with a challenge coin. (sorry if this sounded like I am listing accomplishments. I am more frustrated that they spend money on gifts rather than money.\n\nThe constant negativity from previous partners. Whether it's raging road rage, being mean to patients, or the micromanagers. I know my post sounds negative, but I guess I bottled it up for way too long. This makes me dread going into work everyday. When I have a great partner, I love love this job because it makes it more manageable. There were some partners where we were just incompatible after several weeks of trying to work it out, that's no problem. I've been constantly told to \"just deal with it\" by the supervisors when I wanted to just switch partners.\n\nWe get a lot of third rides and I've been an FTOing (lol) for 2 years now. I am very easy-going and supportive of every student I get. My biggest pet peave are those that don't want to learn and have a bad attitude or rudeness. I don't kick people off the ambulance, but I had this one student that had all the characteristics of a bad student/person. He had no business in EMS. I let him practice taking lead on a call and he was rude to this guy to the point where the patient said, \"Are you okay? Is everything okay with you?\" He said, \"Yes, you're being a pain in the rear.\" I understand the patient was being a PITA and the student did not curse, but stay professional. So I talked to the student at the of the call about my concerns, and he said, \"Well he's an idiot.\" I drove the student back to the station and signed off on his paperwork and told him to go home. He said, \"Pfft, whatever dude\".\n\nWhere do I move on from here? I am sorry about the long post.",
    "score": 397,
    "url": "https://reddit.com/r/ems/comments/1ktodpt/after_6_years_of_being_a_paramedic_i_cant_stand/",
    "created_at": "2025-05-23T16:48:29.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1k39sg7",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Most disgusting call you have ever been on?",
    "text": "Hey Y’all, \n\nI currently teach an EMT class and this coming week we will be doing what I call the “wet lab” in which I give them scenarios related to the most insultingly gross/moist things we have to deal with in EMS are (poop, vomit, copious blood, mucus etc). All of these are related to calls that either I have been on personally, or coworkers have shared with me over the years. If I can switch some out for some fresh material that would be fantastic, but I’m a little short on ideas! \n\nSo lay it on me - what’s the grossest call you’ve dealt with? ",
    "score": 377,
    "url": "https://reddit.com/r/ems/comments/1k39sg7/most_disgusting_call_you_have_ever_been_on/",
    "created_at": "2025-04-19T23:55:45.000Z",
    "num_comments": 280
  },
  {
    "id": "reddit-1jo4t3q",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "My latest assailant got convicted and sentenced.",
    "text": "First time in 15 years I've had charges stick until conviction. Usually the DA declines to prosecute immediately. You might be asking yourself, what could the cost of kicking a paramedic in the face possibly be? The chair? 30 days in the hole? Banishment?\n\n6 months jail (suspended), 60 days mandatory (time served credit), 40 hours community service, $350 fine....",
    "score": 359,
    "url": "https://reddit.com/r/ems/comments/1jo4t3q/my_latest_assailant_got_convicted_and_sentenced/",
    "created_at": "2025-03-31T14:41:46.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1ljhvt6",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Our patch board",
    "text": "Just thought I'd share the board of patches our service has collected over the years, mainly from people working for those specific services. Keep in mind most are local but you can still zoom in to see if one is a service you recognize or may have worked/ work for. ",
    "score": 339,
    "url": "https://reddit.com/r/ems/comments/1ljhvt6/our_patch_board/",
    "created_at": "2025-06-24T17:49:30.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1hm57ra",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Partners car got stolen while we were on shift",
    "text": "I guess thats oakland for you but it was just yoinked from our company’s parking lot. Gate was left open and conveniently theres no cameras outside even though we keep rigs out there. OPD was thoroughly uninterested in helping so she wont be coming to work for a while considering its an hour 45 commute. Stealing an EMTs car on Christmas is just wild to me.",
    "score": 320,
    "url": "https://reddit.com/r/ems/comments/1hm57ra/partners_car_got_stolen_while_we_were_on_shift/",
    "created_at": "2024-12-25T17:45:00.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1jrsvb1",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "\"Don't Put That in the Chart\" vs. Neurosurgery",
    "text": "A neurosurgeon that I know at the hospital granted me some sanity on charting and attention to detail recently.\n\nEverybody here brings different sets of experiences to EMS. Some of us grew up around people with certain medical problems, like maybe seizures or kidney disease or alcoholism, or we may have health problems ourselves. We may know more about some random aspect of EMS just because of life happening to us, and this may give us a leg up on helping certain patients better than others.\n\nIn both the hospital and on the ambulance, I used to make a point to repeat my patients' symptoms in detail to other people, especially if it was neuro, psych, or musculoskeletally related. An athlete broke their leg and has sensation in just their big toe but not the others? Cool, let's put that in that chart. A seizure patient is seeing red and blue swirls and hearing buzzing 2 minutes before their seizures? Put that in the chart. I would make a point to tell the nurses and docs at the hospital these same details on hand-off, even if I got a weird look. I figured that these kinds of things matter to their doctor, who has to call the shots on a near stranger's health.\n\nI don't know about you guys, but some of the folks that I have worked with have treated me like I'm naive for caring about these details. There's a retort of, \"Oh, you don't have to put that in the chart. It doesn't matter.\" Or, \"You can just put 'toe numbness' down.\" More ER and floor nurses than I would have expected take this approach as well. The lack of care for detail is a bummer, because I know from my biology and neuro background that all of this shit is connected. The kidneys affect the heart affects the brain affects the immune system, and it goes on and on. Details matter, and putting them in the chart matters. Like, why even have this job or keep taking CMEs if I just to write on every little grandma's chart, \"RLQ stomach pain x3 days,\" and then go fuck off to the station and take another nap? There's more to this patient's story, even if I am technically allowed to forget that they exist once I clock out.\n\nAnyway, I was talking to one of the neurosurgeons at the hospital about one of their patients as they were reviewing the chart, and the reports from all of that patient's multi-physician team were insanely detailed. It was stuff like, \"Experiences psychosis after eating bread,\" and, \"Sees red and green blocks in upper left of field-of-view in morning only.\" It was unreal. Just wildly detailed things that were written exactly how the patient experienced them. No vagueness. No judgment or laughing about the patient \"making things up\" at the nurses' station. Just attention to detail and trusting the patient.\n\nI looked at the doctor and asked, \"You guys care about this stuff?\" The doc said, \"Yeah, absolutely. If a person usually hallucinates red and green shapes before brain surgery, but now they're seeing blue and yellow shapes after, we need to know. Maybe we have to go back in or change their meds.\" I told the doc that more folks in EMS than they would have guessed have expressed irritation about noting these kinds of things, but the doc said, \"If I read something that detailed in an ambulance report, I would want to know where they worked, so I could give them a prize.\"\n\nI don't know your experiences in EMS. Maybe you have worked at places that championed detailed charting and Michelin star medicine. I'm also no medical genius, and I have much to learn. The medics and nurses who chastised me about charting also taught me other cool things that my dumb-ass didn't know. Some medics and nurses were also just as jazzed about the details as I was. With that being said, this conversation with the neurosurgeon showed me how EMS and ED charts matter and that the details that our patients tell us can actually help their doctors fix them. It didn't feel like my extensive charting marked me as some greenhorn EMT grad at that point. Our charting of some seemingly superfluous symptom may actually change our patients' treatment weeks or months down the line. If some salty bastard is going to make you feel like a gullible child for caring about that and being curious about your patient, then that is their own prerogative.\n\nDoes this fit with your experience? What do you guys think?\n\nNote: slightly changed details about the patient and the doc, because HIPAA/PHI.",
    "score": 296,
    "url": "https://reddit.com/r/ems/comments/1jrsvb1/dont_put_that_in_the_chart_vs_neurosurgery/",
    "created_at": "2025-04-05T02:05:51.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1i9frec",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "John Moon (likely first paramedic to ever intubate in the field) speaking at Brown 1/25",
    "text": "John Moon - The Legacy of Freedom House: A Lesson in Perseverance, Resiliency, and Determination\n\nTime: 11:00am\nSponsor: Brown EMS and Student Health &amp; Wellness\nLocation: Salomon Center for Teaching\nEvent Type: Hybrid\nLink: [Join Virtual Event](https://livestream.brown.edu/live2)\nRoom: 001\nJoin Brown EMS for a presentation by John Moon, former Freedom House Medic and Retired Assistant Chief of Pittsburgh EMS. The presentation will be followed by Q&amp;A and Mr. Moon will be available to sign books.\n\nJohn Moon began his EMS career in 1972 with Freedom House Ambulance, after seeing the impressive crews in action while he was working as an orderly in a local hospital. After completing the necessary training on his own, he was hired by Freedom House and changed the course of his life. Mr. Moon demonstrated his competence and determination at his new-found calling and was selected by Dr. Peter Safar to be the first medic to perform endotracheal intubation on patients in surgery. After succeeding on his first attempt in the operating room, Moon went on to perform what is believed to be the nation’s first intubation in the field by a paramedic. When the City of Pittsburgh ended its contract with Freedom House in 1975 and instituted its own ambulance service, Moon was one of the few Freedom House paramedics who successfully made (and endured) the transition. ",
    "score": 286,
    "url": "https://reddit.com/r/ems/comments/1i9frec/john_moon_likely_first_paramedic_to_ever_intubate/",
    "created_at": "2025-01-25T05:10:56.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1kqp3mt",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "EMT Being Treated (DIPSHIT update)",
    "text": "Previous post:\n\nhttps://www.reddit.com/r/ems/s/jiIWp20kvM  \n\nI think I mentioned in the comments that I was visiting the ER for post-exposure rabies shots.  This means four visits to the ER, and each time I've said or done something stupid.  \n\nFor my latest visit I went at 09:30 to beat the rush.  They process traumas about as well as Frank Castle, so I knew there wouldn't be any morning commute accidents.  I did the same routine, check in at the admission desk, they scan my ID, I get my bracelet and chuckle that it says \"dipshit\", then park my ass in the empty waiting room for about thirty seconds before the nurse calls me in.  \n\nNow, it might've been that I hadn't slept much for a couple days, or that she put the autocuff over my two shirts, but my BP read as about 20 points below normal.  I haven't run my stupid mouth for about five seconds at this point, so I ask:\nme: **Am I gonna live?**  \nNurse: **I'm afraid so**\nme: ***goddamnit***\n\nNo chuckle, no acknowledgement at all from the nurse.  That's fine, not everyone loves the dark stuff, even when it's corny.  A few keystrokes later she says **\"ok, in case it gets busy we're gonna put you in another room over here while I go get your shot\"**  and has me take a seat.\n\nI recognized the room immediately, having transferred patients to and from this room.  This holding room.  **This. fucking. behavioral. holding room.**  i can't believe with all the dumb shit I've said and done, that it's an \"am I gonna live\" that gets me a fucking three day time out?  No, no, I talked myself into this, I can maaaaaaaaaybe talk myself out of it.  \n\nThe nurse comes back with the vial and syringe.  **\"Heyyy, I thought this room looked familiar.  This is behavioral holding, isn't it?\"** I ask, already knowing the answer.  **\"it used to be, but now it's just our fast track.\"**  I don't let on that I know she's bullshitting me, the bed and chairs still have BH signs and numbers above them.  After giving me the shot, she says **\"ok, just hang out a few minutes and someone from registration will be with you shortly.\"**  Well that can't be right, and I tell her I registered when I came in, they even scanned my license.  **\"oh, it's to give you your discharge papers\"**.\n\nMy spidey sense *knows* I'm being lied to  now.  Nurses, PA's, even doctors give you your walking papers, as long as it's someone who can clarify something or answer questions, not the front desk.  After a minute, a lady with a clipboard comes in, surely the travel agent for my grippy sock vacation.  She verifies my name and date of birth, and asks one more question with a very serious tone:  \n**\"Do you know who might have changed your preferred name on your profile?\"**  \n\n***fucking. dipshit.***\n\nThe isolation and stalling was because my nurse had to show it to the charge nurse, thinking that someone on their end was commenting on me as a patient.  I poked my head out of the room to see clipboard lady go up to the charge nurse and relay my explanation of having changed it myself.  The charge nurse just looked down at the floor, her belief that she had seen everything was just proven wrong, and somehow it was still disappointing.   \n\ntl;dr - I went in for a shot and thought I got put in a holding cell because I made a joke about not wanting to live, but it was because I'm a dipshit.\n",
    "score": 284,
    "url": "https://reddit.com/r/ems/comments/1kqp3mt/emt_being_treated_dipshit_update/",
    "created_at": "2025-05-19T22:24:21.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1l1ex54",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Death of a friend and closure",
    "text": "My ex girlfriend died recently. We still remained close friends even after choosing not to move forward romantically. I went out to where she lived and worked for her funeral. \n\nShe was a talented firefighter and paramedic, and thankfully received full honours. She was a medic before I was an EMT, and as such when I began my field instruction she taught me a ton about patient care and field assessments. She was brilliant and hardworking, and I’ll never be able to forget her.\n\nOn the drive home from her funeral, my best friend (an ICU Nurse) and myself witnessed a motorcycle crash in her first due area. We initiated pt care (tbh the guy was fine, no major trauma) and handed off to the ambulance she used to work on. I used the same assessment techniques she taught me and let me practice on her. I’m not religious, but if that’s not a sign that she’s still with me, I’m not sure what is. This career brought me to her, and she had guided and changed me in an irreversible way. Her memory is a blessing, and she will dearly be missed. ",
    "score": 279,
    "url": "https://reddit.com/r/ems/comments/1l1ex54/death_of_a_friend_and_closure/",
    "created_at": "2025-06-02T10:51:13.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1no1km7",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "2 North Carolina EMS providers killed in ambulance crash",
    "text": "On Sunday, September 21st, Paramedic Stephen Anderson and EMT Skye Oraczewski from Midwest Medical transport of NC (private ambulance company) were involved in a collision in Chesapeake, Virginia. Both were transported to a local trauma center, where they later succumbed to their injuries. The driver of the other vehicle died on scene. More details about the accident are linked in the article.\n\nSuch an awful situation to occur and another devastating line of duty death. Prayers to the families as they navigate the death of loved ones, and EMS personnel who’ve worked alongside the providers. Just another example of how we can do everything right as providers, yet still face danger due to the actions of others.",
    "score": 274,
    "url": "https://reddit.com/r/ems/comments/1no1km7/2_north_carolina_ems_providers_killed_in/",
    "created_at": "2025-09-22T23:11:11.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1ktcxuq",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "For EMS Week…",
    "text": "My company gave a substantial hourly pay increase to part time employees. Just part time employees and they are capped at 36 hours per week. This is obviously a tactic to improve our staffing. However, the new hourly rate is so substantial that if I dropped down to part time status and then picked up a single 12 hour shift a week at my other EMS gig, my yearly salary would increase by almost 10%. My coworker and I pointed this out to our Ops manager and he promptly called the president of the company. Shortly after we were informed that this new pay rate was for new employees only and that current employees were ineligible to receive it, including current part time employees. Which is too bad since they already told the part timers they were getting a raise. \n\nManagement is scratching their heads wondering why everyone is angry. \n\nAnyway, happy EMS week. Hope ya’ll are being showered with snacks. ",
    "score": 236,
    "url": "https://reddit.com/r/ems/comments/1ktcxuq/for_ems_week/",
    "created_at": "2025-05-23T06:42:51.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1k3g3pr",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Forced out due to injury",
    "text": "(Btw, I'm already using mental health resources, fyi) \n\nI sustained a stable pelvis fracture on the job, and I'm about to be \"released\" from duty because I haven't yet been cleared back to work. I'm also about to lose out on fully paid paramedic school with my salary covered. After months of repeated delays in diagnosis and insurance authorization (they initially thought my pelvis fracture was anxiety with bumps/bruises 😮‍💨), I'm about to have my restrictions lifted *one week* after the day that I'll lose my job. \n\nI love EMS. I've been in EMS for over 6 years, unable to afford paramedic school because of 130k of private loan student debt (initially 60k but interest snowballed). I'm realizing that I don't know who I am without EMS. My experiences have made it hard to relate to other people. My job accounts for most of my social interactions, my feelings of self worth, my purpose, my excitement, and my confidence. Being in EMS affects almost every aspect of my life. \n\nI'm absolutely devastated. I was so excited to finally become a paramedic. My EMT uniform has been on display in my room for 3 months as motivation to get better. I feel as though my future and my identity are being ripped away by the indifference and incompetence of others. Meanwhile, I'm rushing myself through PT trying to force a faster return (I'm so close!), but because of the fucking insurance authorizations, I just started pelvis PT last week. I have about 8 more days until the deadline. The bones have long since healed, but my musculature is a little fucked up. While doing PT, I strained my neck 🤬. Pushing through the neck strain to rehab everything else, the neck strain is getting WAY worse, and I'm *constantly* in pain. It's been 6 days, and I can't stand up straight. \n\nI'm not usually one to complain..., but this really fucking sucks.Things are really rough right now. Any advice or words of wisdom would be appreciated. \n😮‍💨",
    "score": 93,
    "url": "https://reddit.com/r/ems/comments/1k3g3pr/forced_out_due_to_injury/",
    "created_at": "2025-04-20T06:11:34.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1la32wf",
    "subreddit": "ems",
    "soc_codes": [
      "29-2041",
      "29-2042"
    ],
    "title": "Boston medflight FC-P pay?",
    "text": "Does anyone know what Boston or UMass lifeflight pays cct medics?  Im hoping the salary im seeing online is outdated, i keep seeing 75k, which is my salary now for 911. I can't imagine requiring additional certs and higher risk for baseline medic pay. ",
    "score": 6,
    "url": "https://reddit.com/r/ems/comments/1la32wf/boston_medflight_fcp_pay/",
    "created_at": "2025-06-13T00:57:28.000Z",
    "num_comments": 19
  }
]