[
  {
    "id": "reddit-1jmsqi9",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Wimpy Engineers",
    "text": "Time to burn some karma.\n\nSo much talk in this sub about intelligence. Let's talk about character.\n\nThere are a lot of posts here of people expressing all their uncertainty and doubt. There are 3 or 4 a day. They are pumping reddit for some emo validation on how they can continue in the profession when they are so dumb in school. You cannot persist in this state.\n\nI want all of you aspiring engineers to consider something about the world you will face.\n\nThere is an engineer or 3 or 4 who were directly involved in the design of the 737 MCAS system. They spec'ed out the single angle of attack sensor. They wrote the code that drove the airplane un-recoverably nose down. There was all this pressure to deliver that system. We've all seen the result.\n\nSame goes for OceanGate. There was all this pressure. A few people protested, but the thing still got built and killed people, poetically, also the idiot who pressured people.\n\nThese are just visible and tragic examples of engineer failure. There are a hundred smaller moral controversies that you can encounter that will never rise to this level of disaster. Some will cost a lot of money. Some will sink the company. Some will ruin lives.\n\nThis is what is waiting for you in your career.\n\nYou are going to have to say NO, and often. You might even be in a situation where you have to quit your job to avoid end up being a party to death and destruction. You may have to testify in front of Congress.\n\nYou don't have to be an immovable rock on day one. You can grow into it. But you will be put to the test eventually. I guarantee it.\n\nPeople are depending on you. You cannot be a wimp.",
    "score": 2344,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1jmsqi9/wimpy_engineers/",
    "created_at": "2025-03-29T18:25:03.000Z",
    "num_comments": 136
  },
  {
    "id": "reddit-1oxqh9d",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Young Engineers: do not trust AI at its word.",
    "text": "This week, I was designing a safety gate for a piece of equipment which can surely kill someone. I’m not well educated on guarding standards and we currently don’t have a person internal to the company who is an expert. \n\nI plugged the information into ChatGPT and asked it to provide the standards for height, clearances, etc. It did a deep dive, provided tables and citations, etc. It was extremely convincing.\n\nThe problem? The numbers didn’t pass the gut check. I did a deeper dive, which took a few hours identifying ANSI standards and finding the correct information. Turns out, what ChatGPT recommended would have been against ANSI standards and extremely dangerous. \n\nWhile it was clear in my circumstance, I’m sure there’s a lot of grey-er areas where it sounds convincing. \n\nWhen it comes to Engineering, stick to your fundamentals. Don’t take AI’s information at face value. It can literally kill someone, significantly damage your company’s reputation, significantly hurt your career, etc. \n\nEdit: wow this blew up, and I’m getting tons of comments with criticism over even considering AI in the first place. To add more detail, I decided to give AI a spin before researching the ANSI standards for gating (which is where a “responsible” engineer would look for direction). There’s an insane amount of hype towards using AI in industry, and a lot of skepticism. This is a message of warning because, let’s say I was new and didn’t know enough to look up ANSI standards? It would be disastrous. ",
    "score": 2309,
    "url": "https://reddit.com/r/engineering/comments/1oxqh9d/young_engineers_do_not_trust_ai_at_its_word/",
    "created_at": "2025-11-15T12:27:27.000Z",
    "num_comments": 392
  },
  {
    "id": "reddit-1j9rzhe",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "How was/is college for you?",
    "text": "Not sure if many of you have seen but engineering TikTok is going pretty viral for the University of Waterloo and what it does to students in engineering (picture above). I’m curious on what your experience was like, did you go to a big university like MIT, or a smaller one close to your house for money? Understanding that engineering is a struggle and I’ve personally never met anybody who flew through it, I understand some people are better than others.\n\nI personally struggled with math and dropped calc 1, I didn’t take school serious and just winged it, THAT WAS SO WRONG. I’m back and I have a 97% in calc, and an A in the rest of my other classes, I put it work and time, I still seem lost in some subjects but just put others of studying a day to learn it and be able to teach it. But was your guys time as bad as everybody is making it seem, obviously there are obstacles I’m heading physics 2 and thermodynamics are the biggest ones overall. But what helped you through that?\n\nAlso how did you maintain a school and personal life balance. I personally work full time Thursdays-Sundays, and school is Mondays-Thursdays, I keep hearing about making blocks to study each class, but what happens if after 2 hours you still don’t understand it, what if after 6 hours you still don’t understand it. Because then that eats to personal time in my situation. \n\nThank you for the responses and any advice you have to offer.",
    "score": 2304,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1j9rzhe/how_wasis_college_for_you/",
    "created_at": "2025-03-12T19:05:07.000Z",
    "num_comments": 128
  },
  {
    "id": "reddit-1j8cjnq",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Parents don’t understand how hard it is",
    "text": "Hello everyone, I’m a 21F pursuing a degree in electrical engineering. I was a pretty perfect student throughout my life but during my second year of university I had a harsh awakening how hard engineering really is. So I decided to take less classes so I wouldn’t completely flunk out and handle the workload, while working a part time job on the side. Both my siblings finished in 4 years, one a degree in psychology and the other in criminal justice. I’m not trying to downplay those degrees but I will admit they aren’t workload heavy as engineering in my opinion(or maybe I’m just being a jerk). My parents didn’t go to college so when I told them I will need a 5th year in my degree they are flipping out and got disappointed in me. I explained the work was pretty hard and even showed them what I was doing but they said it’s because I’m being lazy and there’s no excuse. I don’t party or fool around. I pretty much just study or work and put the rest of my life on the back burner. I love engineering but this attitude makes me lose my passion and motivation. Sometimes I even feel like I’m not cutout because how discouraging my parents can be",
    "score": 2033,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1j8cjnq/parents_dont_understand_how_hard_it_is/",
    "created_at": "2025-03-10T23:17:19.000Z",
    "num_comments": 193
  },
  {
    "id": "reddit-1pfhu07",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I hope ya’ll don’t mind if I boast for a moment..",
    "text": "I went from barely graduating high school to getting  over 100% in every Math specific class for my degree(Electrical Engineering).\n\n..Okay, technically I got 100% in calc 1 (not pictured because I took it outside of this program), but they didn’t offer extra credit and the original phrasing sounds better lol \n\nI know that pretty much every single class is going to be more math, and I know it will continue to get substantially harder, but I wanted to share this with those who know what it actually takes to pull this off. I’m so proud of myself, I really didn’t think I’d even make it this far. \n\ncalc 1,2,&amp; 3\nDifferential  Equations \nLinear algebra\n",
    "score": 2019,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1pfhu07/i_hope_yall_dont_mind_if_i_boast_for_a_moment/",
    "created_at": "2025-12-06T05:54:11.000Z",
    "num_comments": 251
  },
  {
    "id": "reddit-1pkzgbc",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "The amount of cheating in engineering is another level.",
    "text": "Every year since i’ve started this program there are these six indian guys in my class that sit together during the exams and cheat their way through it. In our coding and drawings class they all did a number each on their computer and sent each other the rest of it and had the exam completed in 15 mins all 6 of them while I was sitting behind them and the assistant was in the back of the class, I was confused as hell how he didn’t see.\n\nEvery exam I hear them talk through the whole class when we are literally 120 people in it and all my friends noticed that they are cheating too. They literally have their phones and chatgpt opened between their legs for some exams or they go to the washroom to pee each of them like at least 2-3 times. This basically happened again today and because I was the one sitting in where I have to get up to let them through, I got up at least 16 times during the exam to let them in or out. The prof literally looks at them and hears them talk because he is beside us and does nothing? This is so frustrating because they literally brag about their 4.3GPA to everyone and all they do is cheat and to imagine these people will build our bridges and stuff in the future…\n\nEDIT: Today they have done the same thing in the math class and the math teacher just got pissed off and said he knew they we’re cheating and talked to them but he told some of us that nothing can be done but they will pay in the future I guess. The prof had even told them to bring their phones in the front and suddenly they had no phones again.",
    "score": 1875,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1pkzgbc/the_amount_of_cheating_in_engineering_is_another/",
    "created_at": "2025-12-12T18:33:58.000Z",
    "num_comments": 333
  },
  {
    "id": "reddit-1inwx9l",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Having a low GPA is like being a felon",
    "text": "It has destroyed my future in ways I can't even fathom. I have already been told I can't get into grad school. Academic advisor said it would take 2 years to raise my GPA. I don't have 2 years to put my career and dreams of a family on hold. I have already seen SOOOOOOOO many internships that I WOULD be able to qualify for if they didn't have that horrible 3.0 GPA requirement. Even small, local companies have a 3.0 GPA requirement. No internship. No hope of decent paying job. \n\nI try my absolute DAMNDEST to network and make connections and do extracurriculars but it's all meaningless because I don't have an internship under my belt. All because I don't have a \"good\" GPA. Companies stupidly assume I'm too dumb to tie my own shoes just because of a NUMBER. \n\nAnd I get it!!! Engineering is super competitive because so many people want to be one and it requires a lot of knowledge. I get it. But the RIDICULOUS difficulty of being bad grades expunged makes an unfair challenge for students trying to turn their lives around. \n\n\nIt's like having an ankle monitor on. Not being able to do anything to really improve my life because of the ugly mark of having a low GPA holding me back. My life is pretty much ruined because of silly mistakes I made early in college. I have to pay for my biggest regret for the rest of my life. ",
    "score": 1616,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1inwx9l/having_a_low_gpa_is_like_being_a_felon/",
    "created_at": "2025-02-12T17:50:00.000Z",
    "num_comments": 605
  },
  {
    "id": "reddit-1jm2gng",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "My grandpa was a coke oven engineer, and I've transcribed his final invention from hospice",
    "text": "20 years ago, in the last few months of his life, my grandpa became consumed with this idea of a plasma-heated coke oven. He was a coke oven engineer for decades and had several patents. \n\nBut as a non-engineer, I'm curious what /r/engineering has to say about this. Is it interesting and coherent? Have these ideas been adopted? Are they no longer relevant? Would it do the world good? \n\nRegardless, I'm sure he would want to see it shared! Here's a carefully made transcript from about 30 minutes of recording.\n\n\"Well, anyhow, the thing about how you're gonna to zap this: if we use the Westinghouse units, which are small, I figured that each unit would do about 4 cubic feet of coal. I think when you zap it, they have some kind of a bayonet or something goes down with this gas. And I figure you'd have one of those for each cubic foot. Now I'm guessing at that, but I think that's within the reasonable range of what you could do.\n\nSo if you have 24 feet of coal slug moving down this system, and you move it two-foot-a-clip—every time you move it you move it two feet, you're actually moving 48 cubic feet, down this slot oven. \n\nYou have to get into the construction, a little bit, of this thing, because to build a refractory slot vertically, to put a lid on it is not much of a problem. You put a little arch over, you got 18 inches to span. Now you lay it down, you've got 24 feet to span, this way. And depending on how far you go, hundreds of feet that way to span. So you have to use a construction called a flat arch. The flat arch is a refractory arch that is supported on the exterior with metal. There's two designs that I'm familiar with: one's the American Arch, that uses round pipe as a supporting structure, and the other one is the Dietrich Arch, which uses cast iron casting support. Either one of them would work; the American would probably be easier to design.\n\nIn order to support that, the top of this oven would to have a support system, so that the first four feet or so is up where you're doin' the charging and have the pistons and all. Of course, that would all be structural steel, and you wouldn't have to support anything.\n\nAnd then when it gets to about six feet, then the refractory would start. When the refractory starts, then you have to support it.\n\nSo, I figured the way this would be designed is, going down you'd have six feet of the initial structure, then you could have two feet of trusswork strength that went across—would be two foot wide and 24 feet or more that way, and it would completely span the unit. Then you'd have a space of six feet, you'd have another structure like that, two foot wide, and so forth. All the way down the line, every six feet you'd have this structure. To visualize it, it'd be like a little bridge across it, except it would be designed in such a way that could hold it.\n\nAnd then the whole area in the middle would have structural beams, or so forth, running from that two foot wide girder type unit over to the next one. And they would be just a few inches above the top of the refractory roof, so that the brick layer, when you put that refractory in, would hang it up and then you would be right there standing on it. And then you have removable grill work on the walkway.\n\nNow the first area you had of that, the first six foot wide area, you'd take the first two foot in the corner, and you'd equip that with a refractory sliding block that slid across the top, and have it powered with air cylinders so that it could be automatically backed off. And that would expose the coal cake, two foot of it—12 inches this way, 24 inches that way—right at that point. Then over on the other side of the six foot draw, it would go up a foot. So, in the first section you'd have two holes, two foot by one foot in the top of the refractory, which you could live with. And they would have removable doors and you would mount these bayonets or whatever they call them, the plasma units, right above them. And the unit for the plasma thing would be just up the, that same six foot area, a short distance, and could be hung on the structural steel, or however you wanted to support it.\n\nIt wouldn't take much room; it looked like the size of a refrigerator.\n\nNow you do that at one end of the 24 inch thing, and over at the other end you do the same thing. Now,  that meant in the first six feet you would have eight square feet exposed.\n\nSo, now you'd have the next two up the line, and the next two up this line. So that in a matter of about six of these units, you would eventually get where you had the whole business covered. So as this coal would be bein' pushed down, this part here would up the temperature, and, of course, as it moved, the next zap would hit the piece behind it. So there would be a piece there, and then a piece up here would be goin'.\n\nAnd on this end of the 24 feet, you would have what they call a 'collecting main,' which is common practice in the slot-baked ovens now. At the end, they have a main that goes along, and they have what they call goose neck connections. They come up out of the refractory—they're lined with masonry—and they go into this collector main. And the collector main is under suction, and it's full of water—sprays, or liquor sprays as they turn out to be. And that's what cools the gases as they're generated. And it's drawing the gas out of this unit.\n\nAnd, of course, these first two at this end, when you're doin it, there's nothing hot coming over the top of it—that's nothing but raw coal above them. And over here the same way. And that's true right up to the middle one. Now, you have a collecting main on both ends, so you're pulling, really, suction on 12 feet of em. 'Cause you have it not really blocked in the middle, but you have it so there's not much clearance.\n\nAnd, so anyhow,  when you finally get down here about 40 feet, you've got it all red hot, and it's gone. And then, every so often from then on, you have resistant bars—like they have in a toaster—that would be fed with electricity. It would be red hot. It would be in the base of the slot. So that any temperature that was lost through the evolution of gas, or radiation, or conduction, or for whatever reason, would be regenerated by these... I don't know what you would call them... resisting units, that would be tied into  your high voltage units over here. And they'd also act as dampeners, because when you kept switching these things off over here, you don't want to slam a million volts and stop it right now; you would instead use a dump switch where it wouldn't be stopped, it would just be diverted into these dampening things. And then through it was used next to heat the coal.\n\nNow, we've got that all, and I, we figure that that would be countin' the first six feet and the rest of you would have 36... you'd have somethin' like 42 feet, maybe. Tthat area would be what we'd call a Preheating Area. All you were doing was heating the coal charge to get it up to around 2,000 degrees Fahrenheit, that's all we need—maybe a little bit more, a little bit less. We don't have to fuse it when you get it up there. So the whole unit wouldn't have to be as strong as most units of this type would be.\n\nSo, now that only takes 42 feet. But we still have all this structure goin' down here—we have 120 more feet. And the reason we have that is, we found from carbonizin' the coal it takes usually in a typical slot-type oven, they call it 'an inch an hour'—so, if you have an oven 18 inches wide, it takes 18 hours to cook it. But, of course, that's based on the fact of startin' from ambient temperature and heating it up—when you dump the coal in, you dump it in by the ambient temperature.\n\nWell, with this setup, you zap it and you're at a workin' temperature of 2000° right away. So I don't think you'll need an inch an hour—in fact, I know from experience you'd probably get by with half that much. So we have only a a 12 inch thick slab and if we decide we could heat it in six hours, then since we're movin' this unit down two foot every six minutes, in an hour we move at 20 feet. And so to get a dwell time of six hours, you need 120 ft.\n\nSo, after this charging area, 42 feet, you'd have 120 more feet of this flat arch business, some strip heaters buried in the floor... and by the time it got through there it, should be completely devolatilized and completely carbonized.\n\nBut now, it's a red hot mass—the same as it would be in a slot-type oven. On a slot-type oven, they open the door and take this pushing machine and push out all this flaming red hot coal—coke—into a car that catches it, a railroad car. And then, after they catch it—we're talkin' on a typical oven about 50 feet of that and 20 some feet high, 18 inches wide—then they run that up under a Quenching Tower, and then they dump tons of water on it. And that's what you see in these Coke Plants, where you see these tremendous clouds. And if you you're down in Indianapolis some days, you look to the southeast and every so often you see this tremendous cloud go up, that's a Quench Cloud. All that heat is wasted. So with this system, you're in a position to much easier recover the heat and cool it down scientifically without quenching it.\n\nSo, you would turn that over to a boiler company and they would have the next 40 feet where this stuff would be going through there at 20 foot an hour. And they would extract the heat from it and make steam. Then when it come out of the end of that, it would be hot, but you would be able to handle it on rubber conveyor belts and whatnot. It would come out, get on conveyor belts and go to storage, and be screened and sorted later.\n\nAnd it would be built sort of like a boiler, and this red hot coke would be running over these tubes that would be full of—you wouldn't use water in them, you'd use Dowtherm, which is a salt solution that can get awfully hot without vaporizing.\n\nAnd so the first two cooling areas that this coke would get in would have tubes of Dowtherm—or similar, there's other chemical—and then they would cool it down. And then the next area would have tubes with water in 'em. Now, then they'd have a Dowtherm boiler, and the Dowtherm converts water to steam. And this whole unit end result would be would makin' steam that would go someplace and make electricity, hopefully. And then your coke would be cool enough to handle, which is all you were after. \n\nNow, the other big source of energy that you're getting is all this gas! That would be handled just as it is now in the modern byproduct gas plant off of coke ovens. So they strip all the goodies out of the gas and then instead of burning it in the unit, they would burn it to make electricity. Because you used electricity up in the initial step and now you're getting sources of electricity. It would power itself.\n\n And the byproducts would be the same as they are in a modern coke oven—you still make all the tar and chemicals and things that they do now! That's where the tar for your roof comes, most of it's coal tar. And your highways: what isn't asphalt is coal tar! And they use the coal tar to mix with the asphalt. Makes the asphalt easier to handle, I guess. And that's a problem today, because these companies don't have a source for their tar! They have to go to China or something, because the coke industry has dropped considerably from when it was at its height right after the World War, after I come back from the Army. But then it started goin' downhill. It's still a big industry in this country, despite all the beating it's taken. But everybody else are in the business now—their governments are more friendly about pollution than our government is.\n\nI didn't mention the plasma stream is a gas stream, and in order to make it, the easiest way, you use natural gas—which has been used before for the plasma ionized stream, is what they call it. And they use the natural gas. Now in this case, the beauty of it is that, since the ionized beam hits the coal within the chamber, within the oven itself, the gas that comes in with the plasma ray goes into the effluent product of the coal and ends up in the byproduct plant. And it's cleaned up and then it's part of the coke oven gas! So it's all recovered. Where in most cases, like where they use this plasma heating for heating steel and stuff, that's all wasted—it goes into the air. But in this case, it's recovered.\n\nAnd now, that just one of these units. And say, well, and of course we got no labor involved! All we have is couple fellas sitting up with a pulpit running and looking at a bunch of instruments and timers and things like that are taking care of—the automation as this thing goes through. Because once it's set it, nobody has to do anything, it just goes.\n\nAnd but now that would, you got 24, say, roughly for figuring sake. You had 24 cubic feet of coal and you move two feet of it every six minutes: in an hour, you'd move 480 cubic feet out of this one oven. And at a conservative rate, the coke would weigh 30lbs.\n\nThe other thing that's very important about this is the materials of construction! The refractory has to be fused silica, which is an expensive refractory, but it has some properties that are essential—for one thing, it is a insulating refractory rather than a conducting refractory and where in a standard coke oven you want to conduct the heat from the gas to the coal, in this process you want to retain the heat in the oven and not lose it through the wall. And fused silica is a very good insulator. It also is very hard and would be resistant to the mechanical abrasion that would come with this type of a utilization. It would also have good structural strength. They also make it in castable, so that the ceiling or flat arch type construction in the oven could be castable fused silica.\n\nRegular silica refractory, like we'd use in a modern coke oven, has very high expansion coefficient. So it expands very high durin' heat and if you cool it down, it cools down in such a way that it's almost impossible to heat it up and cool it down without fracturing the refractory. So in the case of fused silica, the coefficient of expansion is practically nil. So you don't have the problems of expanding refractories, and you can cool the unit down or heat it up! And one of the things I hadn't mentioned when I showed the dual feeding system, you could either feed coke in, and if you set the levers right, you could feed 100% coke, or you could feed it in fractions depending on where you put the slide gates.\n\nAnd if you have a shutdown for whatever reason—if a major strike or major catastrophe or a major loss of base product or something, that you had to shut the unit down and in a hurry you might have to shut it down, without sufficient help and so forth... you could, once you set the gates and so forth, you could start filling the unit with coke and then at the end of a day's time you would have the complete unit shut down, full of coke! And it would be safe that way, because of the fact that the fused silica did not crack up on ya'. Well, you could never do that with a modern slot-type coke oven. Once you start those, you have to continue running them.\n\nThis, I think, would be a good feature for modern industry, to have a unit that could be started up and shut down with such ease. And it would not take a big crew to do it—it just could take the normal operating crew, and they could shut it down without getting their hands dirty, except for movin' a few slide valves that might not have been automated.\"\n\nIf you've made it this far, thanks for reading!",
    "score": 990,
    "url": "https://reddit.com/r/engineering/comments/1jm2gng/my_grandpa_was_a_coke_oven_engineer_and_ive/",
    "created_at": "2025-03-28T18:49:49.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1i4f7w2",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I was a habitual C student, I graduated 6 years ago:  an honest report",
    "text": "tl;dr: The things I struggled with in school continued to be a problem in my career, until I learned to look for work that complimented my strengths. Think less about external things like salary and more about the kind of work that would serve you.\n\n\n\nHello, I graduated in December of 2018 with a civil engineering degree and a terrible GPA. I know many of you are probably worried about your own GPA, wondering if it's a sign you're in the wrong field. I wanted to share my honest experience with that, because all the existing popular advice seems, imo, either too optimistic or just shaming and unhelpful. (On that note, it probably goes without saying that my anecdotal experience is more applicable to civils than other engineering degrees.) The bottom line is that if you are passing your classes at all, you ARE intelligent enough. I am glad I stuck with my degree, but those poor grades are probably important insight to your future.\n\nI chronically underperformed in school because of ADHD and CPTSD. I kept dropping out, taking partial credits, etc. and didn’t end up graduating until I was 28.  I think most people would have given up way before that, but I had a genuine passion for civil engineering and am just incredibly proud and stubborn in general.\n\nIn spite of my GPA, I got outstanding internships by just working on my interview skills and bringing my enthusiasm for the subject matter to bear. And yes I might have fudged a few things on my resume. My performance as an intern was very hit or miss. I had a manager who I didn't mesh well with and I had anxiety attacks every day: that job certainly didn't love me. But then I got an internship with a firm where my manager was a sweet older woman and I got all-star reviews.\n\nIn my senior year I got an internship with AECOM and my team loved me. Then as soon as I graduated, my work performance sank like a rock.  Anxiety attacks became a huge and daily problem. I quit to avoid getting fired after working there for about 4 years, got a similar job at a smaller firm and ended up in the same situation in just a year.\n\nIn an effort to get something as different as I could, I accepted an entry level position as an ops engineer for a municipal water department. I like my job a lot; most days I'd say I love my job. I research and present solutions to problems in a way I didn't get to do as a design engineer. The office environment is way more relaxed, I go out in the field regularly, I never work in CAD. Best of all, it's a union gig so that means my work-life balance is better protected: something that is critical for me as someone who struggles with mental health and neurodivergence. \n\nI hope that, if you're struggling at school, this provides a little insight into what will help you succeed post-college. First of all you are smart enough: abolish that brain weasel from your mind now.  If you're not thriving in college, consider avoiding jobs that seem to more closely fit the lifestyle of a college student: i.e., high-pressure and confined mostly to a screen. Focus instead on what sparks your interest about engineering as a field of study and look for that. And if you're like me, it certainly wasn't drawing lines in AutoCAD all day.\n\nMost importantly, when you first graduate and start working full-time, give yourself grace: you hardly know anything about yourself as an engineer yet.  You may make some bad decisions about your work life, and that’s normal and expected.  I’ve talked to countless people that had to cycle through a few different positions before they found one that fit.\n\nThe truth of the matter is, civil engineering is not a particularly competitive field and you could probably get whatever job you wanted just by learning the game and working on your interview skills. But if you are just shooting for the most high-salaried or flashiest position you can get without regard for the lifestyle that would work best for you, you’re going to be unhappy and you’re going to burn out. College teaches us that we should be sacrificing our mental health to outperform our peers, but that’s not a mindset you need to adopt for yourself.\n\nI am happy to answer folks’ questions. There’s a lot of things I glossed over but if there’s anything in particular you’d like to know about my experience, please ask. My DMs are always open to engineering students having a hard time. College was an extremely isolating and scary time for me and if I can make it a little less for you, I think that's awesome.\n\n",
    "score": 978,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1i4f7w2/i_was_a_habitual_c_student_i_graduated_6_years/",
    "created_at": "2025-01-18T19:27:13.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1mpcml4",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Why do people in the UK not know what engineering is?",
    "text": "After accepting that software development jobs are impossible to get now, I have recently been looking into engineering jobs and qualifications to see whether it's actually possible to get into the field (I am not asking for career advice), and my first observation is that nobody seems to know what engineering is.\n\nPeople think engineering means things like operating machines in a factory, installing equipment on a building, performing maintenance and repairs, assembling things, etc. Any time I have tried to look for engineering jobs, these are the only things that come up. Well, these, and even less engineering-related things like \"sales engineer\", \"tech support engineer\", etc.\n\nA while ago I had an appointment with the national careers service, who are supposed to provide career advice, guidance, etc. and they didn't know what engineering was either. I asked about engineering, and just got information about welding, forklift driving, and machine operating.\n\nThere's an organisation near me that supposedly provides engineer training, but even they don't seem to know what engineering is. All the courses on their website are things like forklift driving, welding, machine operating, factory safety, power tool usage etc. and there's no actual engineering anywhere.\n\nWhy is it like this? Is this just a UK thing or is it like this in the US and other places too?",
    "score": 971,
    "url": "https://reddit.com/r/engineering/comments/1mpcml4/why_do_people_in_the_uk_not_know_what_engineering/",
    "created_at": "2025-08-13T18:34:57.000Z",
    "num_comments": 390
  },
  {
    "id": "reddit-1lwd8xa",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "How I got an engineering internship with a 3.1 GPA and no experience",
    "text": "# Hi\n\nI wanted to contribute a success story with a lower GPA of 3.1 from a year ago.\n\nI was very unsure when I applied due to my lack of experience and GPA, so I wanted to encourage and guide others. I applied Fall 2023 for Summer 2024.\n\nI was a Mechanical Engineering student from the University of Miami, finished up 3rd year when I applied (Fall 2023), and got into a respectable power company as a Structural Engineering intern without any connections or previous internships. My internship peers all had either high GPA's (above 3.4) and/or had previous internship experience.\n\n# General Cheerleading\n\nTHIS IS A GAME OF NUMBERS.\n\nDON'T\n\nFEEL\n\nINCOMPETENT\n\nI got rejected from a potato factory and a washing machine industry but got accepted to a respectable HRSG power company. What does this mean? THIS IS A GAME OF NUMBERS.\n\nMy intern peers at the company had 3.4+ GPAs and previous internship experience, and I was just there like \":D\"\n\nI believe that any person who learns how to play the internship finding game will find one.\n\nYou just got to get a 200 rejected applications down payment before you get your first acceptance.\n\n# Stats\n\nI applied to a bit more than 200 places, got 5 interviews, 3 people got back to me, 1 offer.\n\n# Applying\n\nI tried Indeed, LinkedIn, career fair and Handshake.\n\nCareer fair and Handshake were kind of useless because there are fewer positions available and all the students with the 3.99 GPA's swoop them up quick.\n\nThere are two ways I saw people pace themselves in distributing the applications -- (1) the holy way and (2) the way of the cursed. The holy way is submitting 3-5 every day for 30 minutes, and the cursed way is sitting down one day every couple days to fill out 25 in a 3 hr session. (I prefer cursed)\n\nThe strategy that worked for me is:\n\n1. Start during September, the window is usually from Sept.--Nov. Some companies do last minute during spring, bust most do it in Fall.\n2. Go to the back pages of LinkedIn/Indeed, like page 6 and onwards. Bonus points if they ask you to apply by email. I was looking for company desperation and incompetence.\n3. 80% of your application are with Indeed/LinkedIn quick/easy apply.\n4. 20% of your applications are with the cover letters and unique application sites that take 139439 years to fill in. The advantages of these applications are fewer people applying to them so you get higher chances of getting in, but also that time could be spent spamming other easy apply.\n5. Do that for 200–300 applications\n6. CHECK YOUR EMAIL AND PHONE!! I missed out on an opportunity cause a recruiter decided to call me and I thought it was spam 😫. So do listen to at least all voicemails from Sept. to Dec. Be as responsive as possible.\n7. Another huge thing: after your potential interview with a company, write a nice “Thank You” email. Multiple recruiters told me this makes you stand out.\n\nPS: My internship, and a couple other people I know, got theirs from Indeed, so if you are choosing one, use Indeed.\n\n# Resume\n\nMake sure your resume is pretty. This video showed how HR look through resumes so you get an idea: [https://youtu.be/veFlfYjRo1Y?si=SiTqXSIYHDB-tloZ](https://youtu.be/veFlfYjRo1Y?si=SiTqXSIYHDB-tloZ)  \nYou got 5 seconds of unskippable ad time to sell yourself to HR.\n\n**Your Audience**  \nI had to generalize the people who are reading the resumes to better tailor it to them -- they are typically not engineers and respond well to pretty resumes. Make sure the resume is VERY readable to the target audience.\n\nThey typically prefer organized and legible documents. Take care in your formatting, and KEEP YOUR FORMATTING mostly STANDARD. I made the mistake of trying to make it different, but it just gives the reader a headache because they are used to a certain format.\n\nI talked to the recruiters at my company and garnered information in general to what they don't like:\n\n1. Messy resume. They got hundreds of applications and a big headache. Make it easy for them to see why they want you. List your selling points in the first few lines. NO SUMMARIES. They don't like it and its not valuable information for them since you are not specialized yet.\n2. No more than a page.\n3. No colors and those weird templates that certain websites provide. I honestly don't know why those exist. Most ATS resume readers that they feed them through can't even read it either.\n4. A non-engineering based resume. Engineering resume are built different from other major resumes. Try to reference engineering based resumes. Copy and paste your resume into like notepad.exe. If it's still readable, you're good. If not, readjust your formatting. They may feed it to ATS for auto sorting and yours wont be readable.\n5. Some are annoyed with you not showing your GPA, it also scares them away subconsciously? Never-ending debate is whether to show or hide your 3-3.4 GPA, take your pick. So idk, I've been told to keep it a secret if it's below 3.4. Definitely a secret if below a 3. My recruiters did say if you don't show your GPA they will assume it's terrible (below 3), but also they hired me and I didn't show it, so? I'm not sure tbh.\n\nI attached mine how I applied for reference.\n\nTo develop your resume, look through reddit resumes and see which one sells you the most, and copy that style. References are crucial to develop your resume.\n\nAlso quick PS, a resume is a summarized CV, CV is everything you have ever done in your engineering life, resume summarizes all that in a page. CV's can be many pages long, resume are the 1 page highlight reel. I personally didn't know that :')\n\n# Cover Letters\n\nThe recruiters I spoke with said they don't even read them???? Idk I guess it shows interest 🫠. But same strategy as before, less is more. They have a LOT of these apps, and even if they do scan them keep them to like 7 sentences. Ill attach an example.\n\n# Interviews\n\nLook up common questions for interviews, decode them to what they actually mean, and have an answer ready. Yes this is a test of whether you studied the cryptic language of the interview. Ill list an example:\n\n**Question:** What are your weaknesses  \n**What it actually means:** How do you overcome your weaknesses/ how adaptable are you.  \n**Example:** I have a hard time retaining auditory information, so I take notes during conversations to better recall it later.  \n**Analysis:** It shows how you have a weakness, but you worked with it to find a solution, showing you are capable of overcoming hardships by finding solutions.\n\nDo NOT:\n\n1. Arrogance. Be as humble and polite as possible while still selling yourself. They want to know you are pleasant to work with.\n\nAfter the interview, write a thank you note for meeting with you.\n\n# Summary of Application Timeline\n\n1. September October and a bit of November is applying time, so abuse quick apply and do some complex applications. 200 apps is the minimum for a result nowadays.\n2. Check your Emails phone calls often, be careful not to miss offers.\n3. Take up all interview offers because at the very least you practice.\n4. Write thank you notes after interviews.\n\n# Misc. Advice\n\nThe best help for me was looking at other applications on Reddit, online and peers, and asking myself would I want to employ them. Why and why not. And then copying what I liked from those resumes/cover letters and excluded what I didn't like.\n\nALSO, it was mentioned to me, I was hired because they liked I had programming skills (most of my job was excel programming). If you are struggling, take a course or two in programming to keep yourself competitive.\n\nDo ask the company if they offer relocation assistance if you live far, mine did. Don't be shy.\n\nTry to not limit yourself in choosing companies, just apply for everything if it is your first internship.\n\n# Final Remarks\n\nI've done the documents 2 years ago now I guess, so I do think my resume is outdated, I personally use a different style now. But I decided to publish this anyway as a data point. And for people to be like woah this got an internship, I can do this too!​\n\nIf anyone has any corrections to what I wrote, want to offer your own advice, or have any questions, please feel free to comment, I will try to get back to you asap.\n\nI might edit the post and add more stuff as I remember it, but I'll post this for now 👌",
    "score": 958,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1lwd8xa/how_i_got_an_engineering_internship_with_a_31_gpa/",
    "created_at": "2025-07-10T13:51:16.000Z",
    "num_comments": 130
  },
  {
    "id": "reddit-1nult0c",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Are engineering career fairs just meant to be a humiliation ritual?",
    "text": "I went to my universitiy's engineering career fair today. I was talking to someone at one of the company booths. I informed him that I am looking for my first internship. He then proceeds to grill me and interrogate me on why I don't have any internship experience yet. I thought the whole point of internships was to get your first hands-on experience. Requiring previous experience seems like it defeats the whole purpose of an internship. These companies only want to hire interns to do their grunt work because they are too cheap to hire an actual engineer for it.\n\n\n\nAt another booth, the guy I spoke to seemed hungover and totally disinterested.\n\n\n\nLike what the Hell is the point of all this? I thought civil engineering students were in such demand, yet everything I've experienced first hand seems to indicate that the field is oversaturated.\n\n\n\nI think I'm just going to join the military or some shit once I graduate. I am not built for the corporate world, lol.",
    "score": 950,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1nult0c/are_engineering_career_fairs_just_meant_to_be_a/",
    "created_at": "2025-09-30T18:55:25.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1iwnp9o",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Why are engineering salaries so low?",
    "text": "I read a couple of other threads where people were posting their starting salaries - many in the \\~60-70k range.\n\nI find this shocking, as Engineering degrees are some of the most difficult, and you can earn close to as much or more than this in much easier fields.\n\nFrom personal experience, there are fast food places hiring in my area for $20/hr. I personally know people in normal-ass jobs like HR, Sales, or a manager at a bus company making over $130k/yr each. These are all in LCOL/MCOL and no degree required, btw.\n\nIs there a large uptick in salaries later on after you gain experience, similar to how airline pilots start low but eventually make 300k+ as captains?\n\nI find it very strange that entry-level engineers make less than twice as much as the dude slinging fries at a Wendys.",
    "score": 865,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1iwnp9o/why_are_engineering_salaries_so_low/",
    "created_at": "2025-02-23T23:24:47.000Z",
    "num_comments": 442
  },
  {
    "id": "reddit-1hvmixm",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Degree ≠ Job",
    "text": "As a student, I browse this subreddit frequently, and every day I see some variation of:\n\n“I have no/little engineering relevant skills or experience, but I need an internship/job. What do I do?”\n\nThe answer is “You get some experience.” \n\nThat’s it. \n\nA STEM degree is no longer a “gold star” that nets you a $100k+ salary out of the gate. STEM degrees, due to a myriad of reasons, are over-saturated in the job market right now. Holding a piece of paper does not separate you from the other ten thousand people with an identical copy. \n\nAre these degrees overpriced? You bet your ass they are. Unfortunately, everyone wants a STEM degree, and so institutions capitalize on that and jack up the price; but I digress.\n\nYou still need a job. \n\n“How do I get experience if I need experience to get a job?” The trick is exploiting the resources at your disposal. \n\nDoes your college offer design teams? STEM focused clubs? Makerspaces? Undergrad research assistants? Certifications? IF THE ANSWER IS YES, YOU SHOULD BE PURSUING THOSE. \n\nWhat if they don’t offer any of that? The answer is PROJECTS. This comes from personal experience. It wasn’t until I started attaching a portfolio detailing all of my projects to my resume that I started getting callbacks for interviews. It wasn’t until I joined a design team that I started getting offers. \n\nOnce you’ve landed that first internship or job, that is now your primary experience. I think a lot of students falter on getting to that first opportunity, but if you follow my advice your chances will be orders of magnitude better. \n\nWhat if you’re in your senior year, you didn’t do any of that, and now you don’t have time to? What then? At that point start exploiting your connections and network, and if that fails (almost never does though), sign up for grad school.\n\nAs a side note, USE COLLEGE AS AN OPPORTUNITY TO DEVELOP YOUR SOCIAL SKILLS. Employers care about how you communicate with others oftentimes MORE than your credentials. Get involved on campus, get out of the dorms, be a part of a team, do SOMETHING.\n\nThanks for reading!",
    "score": 734,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1hvmixm/degree_job/",
    "created_at": "2025-01-07T07:52:50.000Z",
    "num_comments": 148
  },
  {
    "id": "reddit-1kx4czb",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "PLEASE read this if you are doing an internship this summer",
    "text": "Hey guys, I feel like a lot of people feel like they don’t gain much out of their internships. I read a lot of posts about people who sit on their phones all day because they weren’t being assigned work or didn’t learn anything. While sometimes companies just don’t treat their interns very seriously, there are very many ways to gain valuable experience from their internships. I’m on my 4th term at my company and I wanted to share some advice for those of you who are starting their first internship or maybe don’t feel like they’re getting very much out of it. \n1. You are not too dumb for this. You are completely green to the industry and everyone around you has been in it for years. Self doubt and imposter syndrome are inevitable, but remember that everyone starts somewhere. The goal at the end of your term is not to be a pro, but to get a basic understanding of the industry. Nobody expects you to get it right away. \n2. PLEASE keep a journal and write down what you worked on every day. There is so much information thrown at you every day that it’s nearly impossible to retain all of it by memory alone. Write down what confuses you, what you learned, or what you want to learn more about. It doesn’t have to be very long, it can even be bullet points, just make sure you keep it written down somewhere. \n3. Remember that having an intern is a learning experience too. If your boss isn’t giving you tasks, they probably don’t know that you’re twiddling your thumbs waiting for more work. This is practice delegating work to another person, and they need to be (gently) reminded when they are not delegating correctly. \n4. Dealing with difficult people is a skill everyone learns at one point. If you have to deal with a difficult person this summer, try your best to turn it into a learning lesson and be grateful that you can build this skill early in your career. \n5. There is no point in being competitive or trying to show off. You are there to learn and build a reputation. The only thing you are guaranteed to take with you to your next job is your reputation. \n\nThere is a lot more I can include on here, but I feel like these are the most important points I can share. Hopefully this helps someone out there because I wish someone told me this when I started working lol \n",
    "score": 698,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1kx4czb/please_read_this_if_you_are_doing_an_internship/",
    "created_at": "2025-05-28T01:13:04.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1klox0j",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "It’s Not Possible To Just Use AI To Get A Degree Especially For STEM Degrees",
    "text": "I’ve seen quite a bit of talk about college students using AI to cheat through school and how it’s worrying for careers like nursing, engineering etc.\n\nI don’t really understand the argument because 1.) people been cheating since school was a thing; and more importantly, 2) it’s not even possible to just use AI throughout in all classes unless maybe you go to an online college.\n\nCan you use AI on homework? Yes. Essays? Yes. Exams, quizzes that are still primarily in person especially for STEM degrees? NO\n\nEven without going into how hard it is to be a doctor and they go through many stages of education that one can’t just use AI to get through. I see this as just the current hype about students\n\nWhat do y’all think?",
    "score": 600,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1klox0j/its_not_possible_to_just_use_ai_to_get_a_degree/",
    "created_at": "2025-05-13T15:30:42.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1ncvy0d",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "What Engineering school doesn’t tell you is…",
    "text": "How much work time you’ll be spending on PowerPoint. That’s basically my work load for rest of the week. Making slides for presenting to CEO, key customers, and trainings. \n\nIt’s not beneath you. Practice, watch guides, be anal about format and visual. Get good at it. Don’t use animation.\n\nPractice public speaking. Yes, it sucks ass. Yes I hated it. I could barely speak in front of my class back in school. Now I do it in my sleep, through sheer volume of practice. \n\nDon’t be the ones that have to be locked away in the back room. Not if you want to advance your career anyways. ",
    "score": 580,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1ncvy0d/what_engineering_school_doesnt_tell_you_is/",
    "created_at": "2025-09-09T21:38:04.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1hwk2et",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "It’s kind of wild to me your degree means basically nothing to get into this field. ",
    "text": "I graduated in 2017 near perfect gpa, lab experience, led design teams, went to career fairs and industry events-zero interviews for internships or jobs. Had to get a masters, get in serious debt, and work unpaid internship to get my first job and been working five years now. \n\nI’m sitting here watching all these fresh grads in 2025 still going through same shit but it’s arguably worse. If internships and student design teams are mostly what matters why must we go through this grueling 4-5 year degree? Why must a future mech design engineer, field test engineer, or quality engineer go through three years of calculus and partial differential equations to never use it? Listen I work in the rocket industry in fluids and heat transfer if I almost needed to use it once in 5 years, most of us don’t need it. \n\nAdd on to it the stagnated wages we really should only be needing a 2 year degree with extra curricular built in for this field let the rest be taught on the job when it’s needed or graduate school. \n\nEdit: I’m not saying we need to cut mathematics. But maybe streamline the program and possibly limit number of people entering the programs because of stagnating wages and high % of grads that never go on to work in STEM. ",
    "score": 574,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1hwk2et/its_kind_of_wild_to_me_your_degree_means/",
    "created_at": "2025-01-08T13:19:13.000Z",
    "num_comments": 141
  },
  {
    "id": "reddit-1kdpen1",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Why does no one tell engineering students that “just having a degree” isn’t enough anymore?",
    "text": "Not a rant, just something I’ve seen way too often — folks doing all the right things on paper (college, projects, CGPA) and still feeling lost when it comes to actual career direction.  \nI’ve been talking to a lot of engineering students lately, and honestly? Most don’t need more content — they need clarity, structure, and someone to tell them what step comes next.  \nAnyone else feel like we should’ve been taught how to build a career, not just code?",
    "score": 544,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1kdpen1/why_does_no_one_tell_engineering_students_that/",
    "created_at": "2025-05-03T09:58:16.000Z",
    "num_comments": 149
  },
  {
    "id": "reddit-1iuzrqp",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "It has been one hell of a ride",
    "text": "I started applying last October before I even knew how to write a cover letter and my resume was absolutely crap. After many meetings with my school's career help center, and getting advice from professors, I finally found what I was searching for. I'm majoring in mechanical and technically, I'm about the level of someone 4 semesters. Because of that, the main tool under my belt was SolidWorks.\n\nI started searching for mechanical design internships rather than specifically mechanical engineering internships. It only took me a month from first being invited for an interview to get the offer.\n\nTook me 4 months to finally get my first internship.",
    "score": 538,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1iuzrqp/it_has_been_one_hell_of_a_ride/",
    "created_at": "2025-02-21T19:45:03.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ibce25",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I’m tired",
    "text": "When I was a kid, I wanted more than anything to work for NASA. That was all I wanted. So I worked my ass off in high school, got accepted to the school I wanted with scholarships, and have been working my ass off here for nearly four years now.\n\nTwo years ago I found out that NASA doesn't pay well...at all. Before, that didn't bother me, but now...something's changed. SpaceX? I know how they treat their engineers, I don't want to be worked like a slave because I get to work on cool stuff. \n\nI want respect, and freedom, and a work-life balance. I'm so tired from college. I've given this my all, and now that I'm about to graduate this May I'm just done...pay me. \n\nI got a job secured last October in the construction machines industry. I'm excited for it. It feels realer...more tangible of an impact than \"space.\" My salary offer is insane, and the benefits are also insane. Is this what respect feels like? The promise of a career?\n\nSorry for the rant it just feels so melancholy. I can't decide if I'm not living up to my childhood dreams because I simply changed or because I just failed...but I'm so tired. I'm done. Just give me a job.",
    "score": 506,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1ibce25/im_tired/",
    "created_at": "2025-01-27T15:56:43.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1ip3xki",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Dropping out of Engineering, and this is why.",
    "text": "I'm 24 years old. I separated from the Navy 2 years ago with an entirely new outlook on life. I felt a sense of maturity, importance, and overall I just felt like I was doing the right thing in life.\n\nAbout a year after I got out, I decided to try to go against all odds, and enroll in Mechanical Engineering. I was always told the classic \"you're a smart kid, you just don't apply yourself\". This may have been true, due to the fact that I almost failed out of highschool and graduated with a 1.2 GPA. \n\nI started in accelerated intermediate algebra, and then straight into college algebra. A few mental breakdowns later and I passed both classes with high 80's and finished off my first semester with a 3.8 GPA while working 50 hours a week while taking care of the house I just bought, my dogs and my fiancee. I was on top of the world! Or so I thought. \n\nFast forward to winter break. I had recently finished my first semester, and I felt like I had to CONVINCE myself I was doing a great thing. Meanwhile, I had lost close to 15 pounds, barely found time to shave and keep with hygiene, slacking at work, getting an average of 6 hours of sleep, and hardly talking to family. But I was doing good.. right? Those depressive, intrusive thoughts were all a normal byproduct of working hard through college.. right?\n\nAs I've begun my second semester, I finally figured out how I REALLY felt. Why did I take this degree path? Was it to stroke my ego? Try to impress friends and family who thought I wouldn't be able to do it? Try to convince myself I could do something that was bigger then what I actually am? What's the point? I don't even really have a passion for this field. Would it help my 7 years of welding experience? Sure, but what is the point. I hate the math, I hate the pointless classes, and nothing TRULY interests me in the field. Is the money good? Sure! Is the field secure? Absolutely! Good career trajectory? Definitely. But why kill myself for a degree I don't even have a passion for? Who am I really getting this degree for? And why?\n\nIt crushes me to the soul that I had to come to a decision like this. I DO feel like a failure. I DO feel like I let down my family. I DO feel embarrassed that, just like high school, I couldn't cut it. But you know what? I somewhat feel relieved. I'm relieved that I figured this out early enough so that I didn't trap myself behind a desk for the rest of my days wishing I didn't choose that path for anybody but myself.\n\n I hope nobody else has to go through something like this, but I guess this is just my experience. I envy each and every one of you that fights the hard fight and comes out the other side with that degree. My upmost respect, because this degree is absolutely no cake walk. ",
    "score": 496,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1ip3xki/dropping_out_of_engineering_and_this_is_why/",
    "created_at": "2025-02-14T05:55:10.000Z",
    "num_comments": 251
  },
  {
    "id": "reddit-1k5a27n",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Update on the guy with a masters who couldn’t land an interview",
    "text": "Well I did it. I managed to land a job after many applications, cover letters, and denial emails. It ended up being with one of the companies I co-op’d at. It’s also car design which is basically my dream job and I’m excited to start working there in July. \n\nI was really discouraged for a long time going through the whole soul crushing online application process and career fair struggles, but it did eventually pay off. \n\nI also had several people reach out to me offering to help me get employed at their place of work and I sincerely appreciate it, but I’m ending my job search here. \n\nGood luck everyone, if I can make it, you can too. \n\n\n",
    "score": 458,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1k5a27n/update_on_the_guy_with_a_masters_who_couldnt_land/",
    "created_at": "2025-04-22T16:04:55.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1jqpjdr",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Is this the average salary of enginners out of college or do all of these outliers",
    "text": "I was going to post this on r/engineering, but in order to make a post, I needed to comment first, and I was too lazy for that.\n\nBasically, most of my family members are engineers. My older cousin K (UNC BCS '22) got a job offer in Washington, DC, right out of college with a starting salary of $120K. His brother A (UNC BCE '24) received an offer from the same company with a starting salary of $150K. Then my mom told me about her friend’s daughter, who graduated from Auburn with a bachelor's degree in nuclear engineering and started working in Atlanta with a $150K starting salary.\n\nAre these numbers typical, or are they outliers? Also, I’d like to know the average starting salary for electrical engineers.\n\nThanks!",
    "score": 444,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1jqpjdr/is_this_the_average_salary_of_enginners_out_of/",
    "created_at": "2025-04-03T18:05:25.000Z",
    "num_comments": 158
  },
  {
    "id": "reddit-1hzyfmo",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Why do cars not use resistive heating on the windshield like they have on the rear window?",
    "text": "Those resistive heaters are much more effective, especially when the car is first started.  What reason(s) are there to not use them on the front?  My guess is that the heaters are more likely to fail than hot air, which necessitates having hot air as a backup, and if you're doing that, the marginal benefit of resistive heaters is not deemed to be worth the added cost.  I'd like to hear from somebody who actually knows the answer(s), though.  Thanks!\n\nEdit: Thanks to everyone who answered.  This question can be considered closed.\n\nEdit 2: Please do not comment that a specific make or model has this feature.  It is not answering the question. It is not helpful in any way.",
    "score": 439,
    "url": "https://reddit.com/r/AskEngineers/comments/1hzyfmo/why_do_cars_not_use_resistive_heating_on_the/",
    "created_at": "2025-01-12T22:08:42.000Z",
    "num_comments": 343
  },
  {
    "id": "reddit-1ptenjp",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "If in USA there sre about 1,800,000 engineers and each year there graduate about 200k people with engineering degree then where the vast majority of people go when they dont manage to get engineering job?",
    "text": "I think the disproportion is easily visible if we assume that career is 40 yesrs long and each year there graduate 200k people then we should have  8,000,000 engineers but we have only 1,800,000 of them. Where goes the rest why only 25% of people who graduate with engineering degree decides to go into engineeering?",
    "score": 402,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1ptenjp/if_in_usa_there_sre_about_1800000_engineers_and/",
    "created_at": "2025-12-22T23:41:31.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1ppd3na",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Don’t Give Up! Especially you low GPA kids",
    "text": "Hey talking from experience here- I was a low GPA 2.5 ChemE. Graduated 12 years ago, went into process engineering for refineries and now I am in upstream oil and gas. Bottom line I was not dumb but a horrible anxiety prone test taker. Pretty much felt like a fraud and almost quit my junior year.\n\nI never got the fancy internships. What I did do was apply to about every small to mid level design company I could find. NOBODY-cares about your GPA after your first job. So, take what you can get- work for ham sandwiches. Think about it as the cost of opportunity.\n\nI leveraged that first job into a career where I am making 400k plus. I am one of the best at what I do because I know how to outwork anyone around me, even though school was not my thing.\n\nThe advice I would give everyone is don’t be afraid to job hop. That is really how you make the big pay bumps.\n\nYou got this!",
    "score": 398,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1ppd3na/dont_give_up_especially_you_low_gpa_kids/",
    "created_at": "2025-12-18T00:36:29.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1otv4kz",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Why is air traffic control still done by humans? Why hasn't it been digitized or mechanized?",
    "text": "I understand the other idiot talking about giving the job to \"ai\" has no idea what he is talking about, but why HAVEN'T they massively upgraded the computer controls for air traffic controllers? Last I heard they were still using floppy drives for a lot of systems. Surely a more digitized system would pay for itself in just increased efficiency leading to less fuel being burnt, not to mention a reduction in stress for the ATCs and less risk overall. ",
    "score": 352,
    "url": "https://reddit.com/r/AskEngineers/comments/1otv4kz/why_is_air_traffic_control_still_done_by_humans/",
    "created_at": "2025-11-11T00:32:04.000Z",
    "num_comments": 233
  },
  {
    "id": "reddit-1io54nq",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I attended my first career fair from the other side. AMA",
    "text": "Title basically.\n\nI graduated from an engineering school in Texas at the end of 2023 with a job right out of college in the energy industry. After working for a little over a year I asked my company if I could go to my schools career fair with the recruiters and they let me.\n\nI see a lot of things get bandied about by people, both doomer mentalities and overly optimistic that I'd give my perspective on if it comes up. The main one being: GPA absolutely (at my company) matters. It isn't the end all, but it is heavy consideration.\n\nPeople with otherwise lackluster resumes with really high GPA get more consideration conversely people with more experience than the former with low GPA get less consideration.\n\nLastly all opinions expressed are unique to my anecdotal experience at this one company. Your mileage may vary.",
    "score": 344,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1io54nq/i_attended_my_first_career_fair_from_the_other/",
    "created_at": "2025-02-12T23:30:40.000Z",
    "num_comments": 106
  },
  {
    "id": "reddit-1l9vmz0",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Job Search | 2.5GPA | No Internship | EE Degree | Female",
    "text": "So I started my job search in December, and started the application process with the job I just accepted in May. I went through a phone get to know you interview and then a video call technical interview. The role I initially applied for closed a week after I applied so I applied for another role within the company that got filled shortly after my get to know you interview, I stayed in contact with the company and the initial role I applied for opened up again and I was able to have a technical interview, they sent me an offer letter a couple days after. ",
    "score": 312,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1l9vmz0/job_search_25gpa_no_internship_ee_degree_female/",
    "created_at": "2025-06-12T19:33:29.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1icku72",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Looking to create a trapdoor style stair cover.",
    "text": "Hello all! Looking for advice and suggestions for how to create a cover for the hole around the spiral staircase which leads to the upstairs owners suite of the house. The house is shared and the room the stairs lead to is the living room adjacent to the master bedroom which is directly above the living room where others like to watch movies so we are looking to build something that would also aid in soundproofing the rooms from each other. \n\nThe owner is an engineer who claims to be too broke to pay for something elaborate but believes the only reasonable idea is to build a large box over the whole thing with a door. \n\nPictures 4 and 5 are my current simpleton idea which would be to attach a piece of plywood via hinges to the floor which would lay flat with the left corner being supported by being on the floor by the red flag seen in picture 3. \n\nPicture 4 displays how it would be when it fully covers the hole. The right side would be a second piece of plywood, cut to fit the curve of the stairs and hinged so it can be folded back onto the other piece and lifted to open. \n\nMy idea would be to have a hook or clasp on the upper railing by the desk which would connect to a handle on the plywood so it could be safely locked in the upright position. The bottom side would then be covered with sound deadening panels to reduce the noise between rooms and to give privacy to the upstairs room. \n\nI think my idea could be accomplished for under $150 and would be simple, economical and effective while still looking good if done with a touch of creativity. But I am open to and hoping for critiques, enhancements or completely new ideas altogether.",
    "score": 303,
    "url": "https://reddit.com/r/engineering/comments/1icku72/looking_to_create_a_trapdoor_style_stair_cover/",
    "created_at": "2025-01-29T03:40:02.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1htjyd3",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Did aerospace engineers have a pretty good idea why the Challenger explosion occurred before the official investigation?",
    "text": "Some background first: When I was in high school, I took an economics class. In retrospect, I suspect my economics teacher was a pretty conservative, libertarian type. \n\nOne of the things he told us is that markets are almost  magical in their ability to analyze information. As an example he used the Challenger accident. He showed us that after the Challenger accident, the entire aerospace industry was down in stock value. But then just a short time later, the entire industry rebounded except for one company. That company turned out to be the one that manicured the O-rings for the space shuttle. \n\nMy teacher’s argument was, the official investigation took months. The shuttle accident was a complete mystery that stumped everybody. They had to bring Richard Feynman (Nobel prize winning physicist and smartest scientist since Isaac Newton) out of retirement to figure it out. And he was only able to figure it out after long, arduous months of work and thousands of man hours of work by investigators. \n\nSo my teacher concluded, markets  just figure this stuff out. Markets always know who’s to blame. They know what’s most efficient. They know everything, better than any expert ever will. So there’s no point to having teams of experts, etc. We just let people buy stuff, and they will always find the best solution.  \n\nMy question is, is his narrative of engineers being stumped by the Challenger accident true? My understanding of the history is that several engineers tried to get the launch delayed, but they were overridden due to political concerns. \n\nDid the aerospace industry have a pretty good idea of why the Challenger accident occurred, even before Feynman stepped in and investigated the explosion?",
    "score": 297,
    "url": "https://reddit.com/r/AskEngineers/comments/1htjyd3/did_aerospace_engineers_have_a_pretty_good_idea/",
    "created_at": "2025-01-04T17:52:14.000Z",
    "num_comments": 310
  },
  {
    "id": "reddit-1jukt7a",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "found out my degree isnt ABET accredited",
    "text": "I’m a first year robotics engineering student, and I found out that even though almost every other engineering program at my university is ABET accredited (including one they don’t even offer anymore), robo eng is not.\n\nThis is kind of devastating but whatever. My options are systems, software, mechanical, or electronic and computing eng. Thoughts on which one is the best choice to still be able to have a robo career?",
    "score": 286,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1jukt7a/found_out_my_degree_isnt_abet_accredited/",
    "created_at": "2025-04-08T18:29:18.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1ite3en",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Is it normal to feel extremely stupid?",
    "text": "I am 25 I started college at 20. I am in computer engineering and still have 2 years to go. My problem is, that I cannot retain any information from previous classes. Today I took a midterm and realized I had forgotten the most basic of concepts, and I probably failed because of this. This is why I always feel like the dumbest in every classroom I am in. My grades are usually B's and C's and my GPA is 2.7. I have also been told engineering might not be for me after failing Calc 3 the first time, but I know this is what I want to do with my life. I just have a very bad memory and a short attention span. I get migraines when I try to actually focus in class. I don't know what's wrong with me, I'm just hoping this is somewhat normal for eng students and that I will be okay when/if I graduate. Sorry for the novel.\n\n  \nEdit: I got diagnosed with ADHD and prescribed Adderall. And holy shit where has this been my whole academic career?",
    "score": 285,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1ite3en/is_it_normal_to_feel_extremely_stupid/",
    "created_at": "2025-02-19T19:24:39.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1odanz5",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Why wasn't AWS redundant enough to survive the server outage the other day?",
    "text": "I've heard a ton about \"Well everything's on the cloud, so a server goes down, and there goes the whole internet\" which does not really make sense to me on some level. Isn't this stuff multiple-times redundant? Aren't there fallbacks, safeties, etc? \n\nI thought modern networks are de-centralized and redundant. Why wasn't AWS? ",
    "score": 265,
    "url": "https://reddit.com/r/AskEngineers/comments/1odanz5/why_wasnt_aws_redundant_enough_to_survive_the/",
    "created_at": "2025-10-22T15:00:37.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1kavgc8",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I switched from Mech Engineering to become a Dentist",
    "text": "My first engineering role was a very antisocial \"deep in the weeds of CAD simulation\" role. As a young man, I extrapolated that all engineering must be super lonely egghead work. In reality there are tons of other roles that I would have loved. I did summer engineering roles at phosphorus mines in the west during dental school. Loved it. So if you think you don't like engineering, just remember there's SO many roles out there that have nothing in common with each other. \n\nEngineering is great money and only 4 years of school. But it definitely has a ceiling for MOST engineers, unless you hit management.  If you want to earn 350k as an engineer, you better be exceptional at climbing the corp ladder, be willing to move every 3 years etc.\n\nWith dentistry, 350K isn't a ultra-rare thing. As an engineer looking into the switch, i made a SUPER hardcore spreadsheet, that calculated the lost opportunity costs of 4 years of dental school, plus debt, it even had all the tax brackets in it, expected raises in engineering, early start in investing etc.\n\nTo be equal in terms of net worth by age 50, dentistry MUST out earn the engineer to overcome the lost years and (huge) debt, but in my calculations, the income boost from dental was large enough to cover those costs. \n\nAnother reason is owning your own business is still great in dentistry. Very few professions can just be successful with some diligence. Owning your own engineering consulting firm, for instance, is possible but ballsy. Not something likely to be success. Dentistry has like a sub 3% default rate. Just don't be in the bottom 3% of owners and you're going to float. Simply picking an at-need area is 100% chance of financial success IMO. Even if you are an ugly smelly mofo. Not too many careers can you just grab success by the nads so easily.\n\nEngineering goes through layoffs. Dentists rarely get fired for downturns, but maybe make less in a recession. \n\nNow I'm 4 years out of school, and dentistry has already passed up the net worth of a clone of myself that stayed working engineering at John Deere right out of school. It's more than I had expected when i was just looking into dental salaries. \n\nMy main hobbies are still mechanical, I watch engineering youtube channels all the time and love working on tractors etc. But dental pays the bills, and I love being face to face with staff and patients. I'm not a mega extrovert, but engineering in my roles was too introvert heavy in my few roles I had. I actually wrote this as a comment to another dentist that was asking why I left engineering, thought it might be a conversation the engineering students would appreciate, esp if they are realizing that engineering is not their dream anymore. ",
    "score": 263,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1kavgc8/i_switched_from_mech_engineering_to_become_a/",
    "created_at": "2025-04-29T18:39:27.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1pija4h",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Why don't car engines use air pressure tanks?",
    "text": "I recently saw a volvo design that eliminated turbo-lag by having an air pressure tank feed into the intake. But why can't they just ditch the entire intake all together and have all the air filtrated and prepared before it gets sent into the combustion chamber in an external air pressure tank? It would be kind of like a hybrid battery in a prius, it's constantly refilled by the compressor and used by the engine at the same time. [My proof of concept](https://imgur.com/a/GhvV5YH). Why couldn't it work? My first thought is that maybe the engine just goes through more air then an air compressor could compress. Other than that, is there anything? Im not an engineer, just a hobby car guy so excuse me if it's a really dumb question.",
    "score": 255,
    "url": "https://reddit.com/r/AskEngineers/comments/1pija4h/why_dont_car_engines_use_air_pressure_tanks/",
    "created_at": "2025-12-09T21:05:18.000Z",
    "num_comments": 174
  },
  {
    "id": "reddit-1naprnf",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "How are defects in complex things like airplanes so rare?",
    "text": "I am studying computer science, and it is just an accepted fact that it’s impossible to build bug-free products, not even simple bugs but if you are building a really complex project thats used by millions of people you are bound to have it seriously exploited /break  at a point in the future. \n\nWhat I can’t seem to understand, stuff like airplanes, cars, rockets, ships, etc.. that can reach hundreds of tons, and involve way more variables, a plane has to literally beat gravity, why is it rare for them to have defects? They have thousands of components, and they all depend on each other, I would expect with thousands of daily flights that crashes would happen more often, how is it even possible to build so many airplanes and check every thing about them without missing anything or making mistakes! And how is it possible for all these complex interconnected variables not to break very easily? \n\n",
    "score": 246,
    "url": "https://reddit.com/r/AskEngineers/comments/1naprnf/how_are_defects_in_complex_things_like_airplanes/",
    "created_at": "2025-09-07T10:27:38.000Z",
    "num_comments": 259
  },
  {
    "id": "reddit-1l4ktpz",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Why are companies pushing wireless charging so hard when pogo pins are cheaper, faster, and more reliable?",
    "text": "Not trying to rant, just genuinely curious as an engineering student working on robotic and embedded systems.\n\nFrom what I understand:\n\nPogo pins are more efficient — almost no energy loss compared to wireless (which gets hot).\n\nYou can combine them with magnets for perfect alignment (just like MagSafe, but better).\n\nOxidation? Easily handled with gold-plated pins or sealed designs.\n\nCost-wise they're much cheaper — no need for complex coils, controller ICs, or alignment tuning.\n\n\nSo why is everyone hyping up wireless charging for everything — phones, watches, earbuds, even electric cars? It seems like more cost, more complexity, and worse performance. Sure, aesthetics and portless design is cool, but are we just trading practical design for sleek marketing?\n\nIs there a real engineering advantage I'm missing here — or is it mostly just consumer-side hype and long-term product vision stuff?",
    "score": 222,
    "url": "https://reddit.com/r/AskEngineers/comments/1l4ktpz/why_are_companies_pushing_wireless_charging_so/",
    "created_at": "2025-06-06T05:39:54.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1jlzrvn",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "What would a $10K production car in 2025 look like? Is it even possible? Profitable?",
    "text": "Car prices are ridiculous right now (and have been) and there doesn't seem to be any market impetus to get them lower. Car companies need to make a profit and I'm sure there's standards and requirements that are making cars more expensive too (Crash safety req, technology, etc).  \n\nIf a production car were designed today with an ~~MSRP~~ *production cost* of $10,000 USD in 2025, what would that even look like?  \n~~Is it even possible to do so and turn a profit? (Make money on the car itself, not because of budgetary voodoo, IE a $10k loss-leader, microtransactions, or selling a 0-emission hybrid as a regulatory offset for a large SUV line, etc.)~~\n  \n~~For the IEs out there, What kind of numbers would they need to be sold in?  I assume \"at scale\", but like hundreds of thousands? Millions?~~\n\nEdit: Eww, forget I mentioned profits.  I'm really not interested in the commercial feasibility of this as a business model.  Purely, what design and manufacturing considerations would be needed for a car that COSTs $10k to produce.\n\nYes, that's US Dollars.  Yes, the NTSB has to approve it for road use.  No, not an NEV or low-speed vehicle.",
    "score": 211,
    "url": "https://reddit.com/r/AskEngineers/comments/1jlzrvn/what_would_a_10k_production_car_in_2025_look_like/",
    "created_at": "2025-03-28T16:57:13.000Z",
    "num_comments": 242
  },
  {
    "id": "reddit-1nhohtc",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Why are server farms built in deserts when they need so much cooling?",
    "text": "I live in Nevada and there has been some buzz about several major server farms and data centers for ai. I get that land is cheap and the state will probably give them tons of tax breaks (let’s not start any political debates please), but it just seems like a bad place for practical reasons. \n\nFirst, while we do get cold winters, they aren’t really that cold compared to many places. And our summers are some of the hottest in the country. So cooling these servers is going to be a challenge.\n\nAdd to that the high altitude and dry air, which means the air has less mass and a lower specific heat. This will compound the cooling problem.\n\nMy understanding, and please correct me if I’m wrong, is that the main operating cost of these facilities is cooling. So wouldn’t it make more sense to place them somewhere like North Dakota or even in Canada like Saskatchewan? Somewhere where the climate is colder so cooling is easier?\n\nI get that there may be issues with humidity causing system problems. I think humidity would be easier to control than heat since you can reduce the humidity with heat and you only need to maintain low humidity, not constant reduce it. ",
    "score": 190,
    "url": "https://reddit.com/r/AskEngineers/comments/1nhohtc/why_are_server_farms_built_in_deserts_when_they/",
    "created_at": "2025-09-15T15:10:29.000Z",
    "num_comments": 240
  },
  {
    "id": "reddit-1ncmxq2",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Why are manufacturers still asking basic RFQ questions 3 months later?",
    "text": "As an engineer heavily involved in procurement, I have to vent about something that's been driving me up the wall. We sent out an RFQ over three months ago, and I'm still fielding the same stupid questions from multiple manufacturers! Questions that are clearly answered in the RFQ package. It’s like they're not even reading it! \n\nI get that some queries might be legitimate; those are the minority. But the sheer amount of repetitive nonsense I have to deal with is a huge time sink. I've already dedicated countless hours to this and it’s making it impossible for me to focus on my actual work. \n\nI feel like I'm stuck in an endless loop of explaining the same details over and over again. Is there a better way to handle this? Has anyone else faced this issue, and how have you tackled similar problems? I'm looking for solutions or strategies that could help streamline this process.",
    "score": 145,
    "url": "https://reddit.com/r/engineering/comments/1ncmxq2/why_are_manufacturers_still_asking_basic_rfq/",
    "created_at": "2025-09-09T16:03:02.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1m62p3c",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Lost passion.",
    "text": "I got into Mechanical Engineering back in college because high job placement. Did a couple years working for a tool manufacturer doing continuous improvement, got into quality, did some process engineering for another manufacturer and then I met my wife. We ended up moving across country for her career and I’ve been not liking my job for the year before we moved. I decided to try and do a change but nothing came up. Now I’m working in quality for a food manufacturer here and I just don’t care anymore…. No passion, just want to do my job and go home.  I find passion in making things, fixing things, and just feeling like I’m doing something worthy.  Not really looking for advice, just more venting and wondering how many of you are in the same boat.  Honestly, been thinking about quitting and just focusing on wood working but not a lot of money in that field.  I talked with the plant manager and I’ll be moving to an operational role. Hoping that if I can just get away from quality, I might like what I do. Last job I had that I truly loved was being a testing technician for a ceiling fan manufacturer. Loved getting paid to break things. ",
    "score": 135,
    "url": "https://reddit.com/r/engineering/comments/1m62p3c/lost_passion/",
    "created_at": "2025-07-22T02:45:10.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1jrxob9",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Luck favors those who put in the work",
    "text": "Hey all. For some background I graduated in 2022 from my state school (not one of the elite ones) with a mediocre GPA. I was lucky (in every sense) to get my first job, which was at an integrated photonics startup that took a chance on me. I burned out and left after 1.5 years. I joined my second employer 6 months later and left after 5 months because I hated it, then felt heavy regret over the circumstances in which I left my first employer because they’re still going strong. I hated my second job so bad that I’d rather be unemployed than work in that environment (which was filled with technical incompetence). \n\nSo there I was, without an MS or PhD to do any core technology development in photonics and with 5 months of experience in RF. I took 3 months to beef up my resume with a DIY project before applying to jobs, and made my resume highly technical in its content. \n\nThis mattered as once I started applying to jobs at the same pace I usually do, I was so much more competitive in the market from the amount of phone calls I was getting and the types of companies that were interested in me. Resume should be highly technical with discipline-specific terminology. For me, I committed to RF PCB design for those 3 months.\n\nMy job search ended 2 days ago with an offer from an advanced RF/mmWave packaging startup creating enabling technology platforms for highly-integrated RF/mmWave components and system-in-packages, with potential applications for datacenter interconnects (and hence photonics). It’s an opportunity that fully utilizes my cross-disciplinary background, and it has just the right amount of risk involved for me. I’m so happy and grateful I got it.\n\nAnd I got it because I busted my ass for those 3 months.\n\nSalary progression since September 2022:\n85k —&gt; 95k —&gt; 110k\n\nIt’s also in a low cost of living area (5% below national average). I’m lucky.\n\nTLDR; I took a risk quitting my job in this economy and it paid off because of what I did with my time. Thanks to all those who read it in full.\n\n",
    "score": 132,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1jrxob9/luck_favors_those_who_put_in_the_work/",
    "created_at": "2025-04-05T07:02:02.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1mhp3ln",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Manufacturing Engineers, what is your relationship like with the fitters/operators on the shop floor?",
    "text": "I think ive made a bad first impression and need to fix it, to have an easier life at work. They seem pissed at me for asking too many questions. I may have been to excited and thought they didnt mind. \n\nRather than directly tell me, they must have went through managment. Which I think is a little extreme. Could have just talked to me themselves. \n\nDo you have any advice from your exp? ",
    "score": 126,
    "url": "https://reddit.com/r/engineering/comments/1mhp3ln/manufacturing_engineers_what_is_your_relationship/",
    "created_at": "2025-08-04T20:40:34.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1ij73pd",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Calculator for engineers of a certain age...",
    "text": "As I get older, I find it a pain to get out the graphing calc with a hundred teeny buttons for every little thing, and I don't always have my computer nearby.\n\nIs there a desktop-style physical calculator that's just there in the real world and that I don't have to open a damned app or navigate to just to do basic stuff?  Maybe some basic scientific notation and unit conversions?  You know the ones that tax accountants have that have a couple extra functions useful to them?  Like that, but for me.\n\nBonus points if it's steam powered, I guess.",
    "score": 125,
    "url": "https://reddit.com/r/engineering/comments/1ij73pd/calculator_for_engineers_of_a_certain_age/",
    "created_at": "2025-02-06T16:49:37.000Z",
    "num_comments": 178
  },
  {
    "id": "reddit-1mx1xpb",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Anyone else thinks that downturn in tech is a good thing? We really need more civil mech and electrical engineers and for past decade many people who would become them were stolen by absurdly high salaries that are not possible in normal engineering.",
    "text": "We need innovations in physical engineering not software. And companies wont be able to take people from normal engineering by offering them overinflated salaries. They will still earn great money and be much more usefull there were way too many smart people doing dumb software engineering job while they could be civil engineers for great money just not absurdly high. ",
    "score": 118,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1mx1xpb/anyone_else_thinks_that_downturn_in_tech_is_a/",
    "created_at": "2025-08-22T09:36:40.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1n2ldhr",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Everything Needs a Torque Spec",
    "text": "Hello, frustrated Manufacturing Engineer here. Recently, my company has been trying to utilize impacts with torque-sense technology so we can hit the optimal torque quickly. \n\nWhat I’ve observed is that these tools are not incredibly accurate or precise. Additionally they are very expensive and require repair often. \n\nWhat has happened to the days of knowing when something is “snug”? There are times when precise torque is critical, i.e pressure vessels, etc. but theres seems to be a push towards everything having a torque spec, and I do not think the tech is ready for it.\n\nWhat are your thoughts? Have you had success with programmable, powered fastening tools? \n\n\n**Edit** I think it’s safe to say I’ve been certifiably schooled on this topic. I appreciate the genuine suggestions, advice, and criticism here. \n\nTLDR\n\nI think this frustration with torque tools is just a symptom of a larger frustration I have. At my plant, we are constantly told that we just don’t have the same operators we used to. They say we used to have craftsman working in the plant, but now we just have people off the street. I’ve been told this has really changed since COVID when a lot of the older generation quit. Since then, a lot of our processes have suffered from that expertise leaving the building. Now, we seem to be trapped in a never ending cycle of rapidly hiring to fill void positions of employees who quit, inadequately training our new employees because the ones with expertise are too busy, then having the new crop of operators quit because of frustration with lack of training. I want our plant to be a place where operators want to work. I want them to feel like they can have a career in this field. As great as automation is, it feels that factory operators have become button pushers and not problem solvers. We don’t provide then with fulfilling work that challenges them. We instead ask them to push a button all day long, and call engineering if it ever breaks. Automation can be great, and I don’t want to deter from that, but I’m just searching for ways to make operators feel like they matter. I don’t want them to feel like a cog in a machine. I’m not sure how to resurrect that feeling.",
    "score": 112,
    "url": "https://reddit.com/r/AskEngineers/comments/1n2ldhr/everything_needs_a_torque_spec/",
    "created_at": "2025-08-28T19:13:41.000Z",
    "num_comments": 129
  },
  {
    "id": "reddit-1o6u58m",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "30 year old too late to study engineering?",
    "text": "I’m a 30 yo female with an arts and social sciences Bachelor’s. My salary is low and I’m considering going back to school to study mechatronics (interested in robotics). \n\nMy question is, for someone who hasn’t studied any science and math since high school, is it crazy for me to do this? I have forgot almost everything I knew about these subjects but I used to be good at math and chemistry. Do you think it’s possible to learn and excel at this field after all these years? \n\n",
    "score": 98,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1o6u58m/30_year_old_too_late_to_study_engineering/",
    "created_at": "2025-10-14T22:39:50.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1idp2np",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Does anyone else feel like they waste their time because half the things they do even if requested get pushed aside?",
    "text": "I personally do a lot of automation of reports/actions for a tool I support to help my team and provide transparency for quality goals. However it feels like everytime I put time (hours-days) into actually  developing a solution it gets waved away/shot down by a more senior engineer.....even if its something requested by them, usually because the tool honestly has some shit design (no api overwrite for things that can be done manually using the UI prompting workarounds) honestly makes me wonder \"WTF am I here for if apparently nothing I do is good enough?\" Always get great performance reviews but its really annoying and eats away at the self confidence to have my work be shut down constantly",
    "score": 93,
    "url": "https://reddit.com/r/engineering/comments/1idp2np/does_anyone_else_feel_like_they_waste_their_time/",
    "created_at": "2025-01-30T15:10:39.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1l01928",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Masters in Engineering Management vs MBA",
    "text": "**Choosing Between MEM and MBA: A Practical Perspective**\n\nWhen engineers think about postgraduate studies, the MBA often feels like the default path. But there's a lesser-known alternative that might suit many of us better: the Master of Engineering Management (MEM). While the MBA opens doors across industries, the MEM focuses on building leadership and business skills specifically for tech-oriented professionals. It's a hybrid degree designed for those who want to climb the ladder without stepping away from the technical side entirely.\n\n**MEM vs MBA: Key Differences That Matter**\n\nThe MEM is usually tailored for recent STEM grads and doesn’t always require work experience, unlike top MBA programs which often demand 2–3 years in the field. It’s also cheaper and faster—typically 12–15 months with lower living costs. MBA programs, especially in the US, are longer (often 2 years) and can exceed $100K in tuition alone. Content-wise, the MEM mixes engineering and business courses, while the MBA covers broader management topics. Your choice depends on whether you want to pivot out of tech or grow within it.\n\n**Career and Salary Insights**\n\nMEM graduates can expect starting salaries in the $78K–$110K range depending on experience, while MBAs see a wider spectrum from $46K for junior roles to well over $200K at the executive level. MEM grads often step into roles like project engineer, systems analyst, or operations manager, especially within tech-heavy industries. MBAs, meanwhile, have more flexibility to shift across industries into roles in finance, strategy, marketing, or HR.\n\n**Bottom Line: What Should You Choose?**\n\nIf you’re an engineer who loves tech but wants to lead, MEM could be a better fit. It’s cost-effective, focused, and designed for people like you. But if you're aiming to break into consulting, investment banking, or want the widest array of options, an MBA might be worth the extra time and money. Either way, it's crucial to align the program with your long-term career goals. Make the call that gets you closer to where you truly want to be.",
    "score": 86,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1l01928/masters_in_engineering_management_vs_mba/",
    "created_at": "2025-05-31T16:31:14.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1liqvx8",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Do you ever “go along” with projects you don’t think will pan out, just to keep the engagement from the client?",
    "text": "No judgment, just curious to hear from engineers, especially those working at firms or as consultants.\n\nHave you ever had a client or startup approach you with a project that, deep down, you knew had very little chance of success—whether due to poor planning, unrealistic expectations, lack of funding/experience, or just a weak concept?\n",
    "score": 75,
    "url": "https://reddit.com/r/engineering/comments/1liqvx8/do_you_ever_go_along_with_projects_you_dont_think/",
    "created_at": "2025-06-23T20:05:27.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1iheeno",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "How do you guys organize all the daily tiny fires that come up?",
    "text": "Looking for a free software solution or other solution for this. I have my main projects I work on that are easy enough to track. But I constantly have people coming in my office asking for little things here and there. But it's constant. I try to write it all down but then sometimes the paper I wrote it on ends up in the garbage. \n\nHow do you guys organize all your tasks? I'm forgetting things when people bring me 50 problems a day. I need to track every time someone brings me a task and when I will or am working on it. \n\n\nAny suggestions? I really need to improve my organization as I have epilepsy so my short term memory is nonexistent. ",
    "score": 70,
    "url": "https://reddit.com/r/engineering/comments/1iheeno/how_do_you_guys_organize_all_the_daily_tiny_fires/",
    "created_at": "2025-02-04T10:04:56.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1izaxru",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Job/Internship hunt with 2,66 gpa",
    "text": "Every year I went to the career fair happening at my school. Had a chat with many people, asked a ton of questions. Almost all sent applications got me an interview invite. Between them I chose the nearest company and canceled other interviews after getting an offer.\n\nFirst year internship really wasn’t engineering related, more like manufacturing, but with that I scored my second internship. Third year I got my current job.\n\nFirst internship -&gt; second internship salary increase 100%\n\nSecond internship -&gt; 3rd year job salary increase 70%\n\nLocation: Estonia",
    "score": 70,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1izaxru/jobinternship_hunt_with_266_gpa/",
    "created_at": "2025-02-27T08:14:17.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1nqaaz9",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "3 Month Job Search - New ME Grad with M.S. and ~3 Years of Internship Experience",
    "text": "Got an offer last week for \\~$80,000 base salary in the midwest. Happy to share my anonymized resume if anyone would find it useful. Applied to everything through [hiring.cafe](http://hiring.cafe/), big thanks to [u/alimir1](https://www.reddit.com/user/alimir1/)",
    "score": 63,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1nqaaz9/3_month_job_search_new_me_grad_with_ms_and_3/",
    "created_at": "2025-09-25T15:46:34.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1psqfqk",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Parents disapproves my major. Feeling stuck and need advice.",
    "text": "I'm sophmore in college studying civil engineering in US. Ever since I applied, my parents have been nagging me constantly to switch major to mechanical, electrical or CS because those seem more \"prestigious\" and makes way more money. I understand I won't make a lot in civil but i genuinely have no interest in mech or electrical and I'm honestly just fed up with all the nonsense they talk saying \"I'll live poor for rest of my life\" if i continue civil and search up the median salary on chatgpt and say \"I deserve a better job\"🥀🥀.\n\nThey are paying for my college tho, so I get they have a say but I find their arguments very discouraging, makes me upset and sometimes feel scared that they might be right and regret it later on.\n\nI already have internship I wanted (transportation) lined up for summer but at this point I question if this field is even right for me and just tired with all the explaining and convincing I have to do to please them. \n\nWhat would be a healthy approach to deal with this? \n\n",
    "score": 62,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1psqfqk/parents_disapproves_my_major_feeling_stuck_and/",
    "created_at": "2025-12-22T04:29:16.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1jdqw2y",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I’m stressing about what college to transfer to",
    "text": "Ok I’m 21 transferring to university to study ME, I want to focus on either aerospace, robotics or automotive. Both colleges don’t have individual programs for either besides automotive because yk Michigan. I honestly wasn’t planning on Oakland at first but when I got my FAFSA back I saw the college scorecard from the department of education and this is what i’ve gathered.\n\nOakland: Pro v. Con\nPros: It’s closer to home about a 20 min drive, it also has a very nice campus and parking isn’t as bad as Wayne which is in the heart of Detroit. It’s also cheaper by a little bit and graduates make a little more. My main focus honestly isn’t only money but I won’t lie it plays a big part for me and my family. And although I don’t religiously listen to it but take it my opinion, rate my professor rates a lot of the professors whose classes I’ll be taking in the future really well.\n\nCon: I fear that it being located in the suburbs not really near any big big companies will hurt my networking chances a little.\n\nWayne State: Pro v. Con\nPros: Like I said located in the heart of Detroit, right down the street basically from the GM building, I feel I’ll have a better chance of networking with people there. I also enjoy the city and felt like it’d be nice as a college experience to go there. And not just stay in the suburbs my whole life.\n\nCons: it’s a 40ish min drive there and 40ish min back, 20 miles which I’ll probably bring driving down to 4 days a week so it’ll put some work on my car. The parking situation is not good at all, and walking in the winter is hell on earth. It’s also a little more expensive and the median ME salary is about 2k less. All the ratings I’ve seen on RMP, state that they have a really poor staff who won’t help you, which I have already felt the hit of by the transfer advisor. And the teachers I’ll have in the future have really bad ratings as well.\n\nLike I said I do not take RMP to heart but it’s definitely something to keep in mind when looking for classes to take. Also a big thing which idk how big, and I’m hoping not too big, is that I’ve already applied and been accepted into Wayne, I haven’t submitted an application Oakland yet and plan on it tomorrow after I speak to an advisor. I’ve basically planned out my entire transfer path for Wayne, but am pretty sure the transfer equivalencies between both are pretty similar. Last thing is the amount of credits required to take at either institution, Wayne Requires at least 70 while Oakland is at least 45.\n\nHonestly I don’t know anybody who has personally gone there for engineering, most people I know are nursing and bio (doctor) majors. I’ve heard great things by both. But I just don’t know what to do. How did you guys choose?",
    "score": 59,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1jdqw2y/im_stressing_about_what_college_to_transfer_to/",
    "created_at": "2025-03-17T23:17:44.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1l2boae",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I wish I majored in engineering.",
    "text": "For Context: I’m a 4th year Finance Co-op student in Canada. \n\nAs much as I like my program, I feel like I could have study engineering and learn about stochastic, applied physics etc . \n\nI’m kinda leaning towards Mechatronic or Industrial Engineering but it too late for that. \n\nAs the world is constantly involving, the high finance industry aren’t looking for finance majors anymore. They are looking for computer science, engineers, actuary etc. \n\nIt’s too late for me to transfer and I don’t think it worth it doing another bachelor degree. My program barely has any quant skills compared to your major. \n\nI don’t know what to do. I wish I should have done engineering undergrad and an MBA. That a killer combo. \n\nTBH I don’t know if I would like engineering or be passionate about it, but I would just grind it out. \n\nI fcked up by not taking physics in high school. \n\nSince I didn’t realized in finance you’re expected to work 70-100 hours a week. If you do the hourly salary is the same as an engineer salary. \n\nDo you guys have any recommendations on what I should do? Is there master engineer program? \n\nI’m just trying my best to be competitive as possible. ",
    "score": 54,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1l2boae/i_wish_i_majored_in_engineering/",
    "created_at": "2025-06-03T13:18:18.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1jpl12n",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Electronic Technician VS Fresh Electrical Engineer: Salary Disparity",
    "text": "I'm a little older  than my engineering student peers on this reddit. I graduate next month with my bachelor's in EE. Im an Electronic Technician and electrician by trade, specializing in radars and 400 Hz power distribution, circuit card repair, a little bit of everything. I made over 86k with benies prior to pursuing EE.\n\nAs I apply to electrical engineering jobs for first time engineers, it's a little jaw dropping how little these salaries are compared to technician roles. I knew I most likely would take an initial pay cut, but it's somewhat anticlimactic to see the salary offers I'm currently receiving. I even completed the FE, CAPM, and lean 6 certs. I have a 3.9 GPA from an ABET accredited uni, multiple internships, but it doesn't seem to impact my salary negotiations.\n\nAre there any prior techs out there that went EE? What was it like switching from a technician to engineer? Did you also take a salary hit post graduation? Am I overthing salary expectations? The current posted first time EE salaries makes me want to pursue a higher paying technician role again, even though I just graduated.",
    "score": 54,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1jpl12n/electronic_technician_vs_fresh_electrical/",
    "created_at": "2025-04-02T10:08:57.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1oi0awj",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "is an extra year really that bad?",
    "text": "I kind of had a nightmare recently where everyone I know (this includes friends, and people who bullied me who unfortunately attend my university) all graduated and are making like solid 60k+ salaries, and I'm still in school struggling, while they're showing off how fun it is to relax after college and go on vacation and stuff. I noticed a lot of students both in and out of engineering treat an extra year almost like it makes me worthless as a person, but unfortunately my grades are tanking and I might miss a pre req for all my 300 level classes next year. My one friend she criticizes me quite a bit, like she tells me I need to lock in and make generational wealth for my family, ( of course she was born rich...I digress) and one time she told me \"you're not attractive if you want to get married you better get a good job\", she told me that a 5th year is terrible and basically I must've royally fucked up to end up in a position like that. I really do want to graduate on time, and an extra year isn't ideal but the way people treat me for being so nonchalant about it concerns me and it makes me more stressed and depressed than I already am. I also believe stress and depression has led to my poor performance so I was hoping the people closest to me would be kind and supportive about it. ",
    "score": 53,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1oi0awj/is_an_extra_year_really_that_bad/",
    "created_at": "2025-10-28T04:30:25.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1p5zj8d",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Increased my earning potential by 3x to 4x since 2021",
    "text": "All part-time jobs below... (Note: Despite my hourly salary, it's only at $15k to $20k per year because I was a student.)\n\n2021: $15/hr at Fastfood\n\nEarly 2022: $18/hr &amp; $16.50/hr at two different jobs\n\nJuly 2022: $23/hr at Fastfood\n\nJanuary 2023: $12/hr (cheap pay disguising as 'scholarship')\n\nJune 2023 – August 2023: $33/hr internship\n\nSeptember - December 2023: Jobless despite me applying for 50+ jobs.\n\nDecember 2023 – 2024 (McDonald's): $20/hr\n\nUnpaid internship: $0/hr\n\nMay 2024: $38/hr to $40/hr internship\n\nFeb 2025 – May 2025: $29/hr internship\n\nJuly 2025 – January 2026: $40/hr internship\n\n  \nFull-time job:\n\nFebruary 2026: $95,000/yr",
    "score": 43,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1p5zj8d/increased_my_earning_potential_by_3x_to_4x_since/",
    "created_at": "2025-11-25T01:31:02.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1pkx3ec",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I made a post before. But dropping it here again. After having a family, traveling the world with them and barely surviving financially, I completed my bachelor's in mechanical engineering! Today!",
    "text": "Graduating after 9.5 years!\n\nAs some of you all may know, fellow engineering students, I received a job offer recently but it was rescinded. They said it's an executive decision, but I feel that it's due to my poor salary negotiation skills &amp; perhaps for being 'greedy' haha.\n\nI have submitted job applications for construction, civil and mechanical engineering roles. For the first time in my life, I kept getting rejections. I contacted the HR people I networked with. They mentioned that they'll share my name to their fellow HR while some said that they currently have no openings.\n\nThe only recruiters who contacted me, replied to me, guided me and followed up with me are the police and sheriff departments. I reviewed the job descriptions. I can earn more than $100k/year if I start with them. They will cover me if I attend police academy or start at juvenile centers for $94k/year and later attend police academy.\n\nMy workplace can't hire a full-time right now, but they are paying me decently as an intern and willing to keep me at least until I finish my max hours for them (about less than 3 months from now).\n\nAny guidance y'all? I'd really appreciate it.",
    "score": 43,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1pkx3ec/i_made_a_post_before_but_dropping_it_here_again/",
    "created_at": "2025-12-12T17:02:00.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1j9sb1t",
    "subreddit": "EngineeringStudents",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Job offer but long commute",
    "text": "For context, I just graduated 2 months ago with a degree in Mechanical Engineering. I got a job offer from a company with 65k starting salary and they're bumping me up to 70k after half a year if all goes well. Though it sounds great, the commute is really bad imo. It's anywhere from 1 hr to 1hr 30 min in the morning/afternoon. I feel like this will mentally drain me. I can also take the metro but its gonna be the same time.\n\nEveryone I know is telling me to take it to get work experience considering I haven't had any internships. While I do agree with the sentiment, I don't know if I can last doing that long of a drive every day. Anyone else been in a similar situation before? What did you do\n\nEdit: Thanks for the advice, I read each of your comments and decided to go through with it. Commute is gonna be brutal but I'll try and stick it out until I can find somewhere close to move :( Thanks again guys!",
    "score": 40,
    "url": "https://reddit.com/r/EngineeringStudents/comments/1j9sb1t/job_offer_but_long_commute/",
    "created_at": "2025-03-12T19:18:19.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1ibhdhw",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "The Q1 2025 AskEngineers Salary Survey",
    "text": "# Intro\n\nWelcome to the AskEngineers quarterly salary survey! This post is intended to provide an ongoing resource for job hunters to get an idea of the salary they should ask for based on location and job title. Survey responses are NOT vetted or verified, and should not be considered data of sufficient quality for statistical or other data analysis.\n\nSo what's the point of this survey? We hope that by collecting responses every quarter, job hunters can use it as a supplement to other salary data sites like the Bureau of Labor Statistics (BLS), Glassdoor and PayScale to negotiate better compensation packages when they switch jobs.\n\n&gt; [Archive of past surveys](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n## Useful websites\n\nFor Americans, BLS is the gold standard when it comes to labor data. A guide for how to use BLS can be found in our wiki:\n\n* [*How do I figure out how much salary to ask for? (U.S. only)*](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_how_do_i_figure_out_how_much_salary_to_ask_for.3F)\n\nWe're working on similar guides for other countries. For example, the Canadian counterpart to BLS is [StatCan](https://www.statcan.gc.ca/eng/start), and [DE Statis](https://www.destatis.de/EN/Themes/Labour/Labour-Market/Employment/_node.html) for Germany.\n\n* [Glassdoor](https://www.glassdoor.com/member/home/index.htm)\n\n* [PayScale](https://www.payscale.com/)\n\n# How to participate / Survey instructions\n\nA template is provided at the bottom of this post to standardize reporting total compensation from your job. I encourage you to fill out all of the fields to keep the quality of responses high. Feel free to make a throwaway account for anonymity.\n\n1. Copy the template in the gray codebox below.\n\n1. **Look in the comments for the engineering discipline that your job/industry falls under, and reply to the top-level AutoModerator comment.**\n\n1. **Turn ON Markdown Mode.** Paste the template in your reply and type away! Some definitions:\n\n  * **Industry:** The specific industry you work in.\n  * **Specialization:** Your career focus or subject-matter expertise.\n  * **Total Experience:** Number of years of experience across your entire career so far.\n  * **Cost of Living:** The comparative cost of goods, housing and services for the area of the world you work in.\n\n## How to look up Cost of Living (COL) / Regional Price Parity (RPP)\n\n### In the United States:\n\nFollow the instructions below and list the name of your Metropolitan Statistical Area and its corresponding RPP.\n\n  1. Go here: **https://apps.bea.gov/itable/iTable.cfm?ReqID=70&amp;step=1**\n\n  1. Click on **\"REAL PERSONAL INCOME AND REGIONAL PRICE PARITIES BY STATE AND METROPOLITAN AREA\"** to expand the dropdown\n\n  1. Click on **\"Regional Price Parities (RPP)\"**\n\n  1. Click the **\"MARPP - Regional Price Parities by MSA\"** radio button, then click \"Next Step\"\n\n  1. Select the Metropolitan Statistical Area (MSA) you live in, then click \"Next Step\" until you reach the end\n\n  1. Copy/paste the name of the MSA and the number called **\"RPPs: All items\"** to your comment\n\n### NOT in the United States:\n\nName the nearest large metropolitan area to you. **Examples:** London, Berlin, Tokyo, Beijing, etc.\n\n---\n\n# Survey Response Template\n\n## !!! NOTE: use Markdown Mode for this to format correctly!\n\n    **Job Title:** Design Engineer\n\n    **Industry:** Medical devices\n\n    **Specialization:** (optional)\n\n    **Remote Work %:** (go into office every day) 0 / 25 / 50 / 75 / 100% (fully remote)\n\n    **Approx. Company Size (optional):** e.g. 51-200 employees, &lt; 1,000 employees\n\n    **Total Experience:** 5 years\n\n    **Highest Degree:** BS MechE\n\n    **Gender:** (optional)\n\n    **Country:** USA\n\n    **Cost of Living:** Los Angeles-Long Beach-Anaheim, CA (Metropolitan Statistical Area), 117.1\n\n    **Annual Gross (Brutto) Salary:** $50,000\n\n    **Bonus Pay:** $5,000 per year\n\n    **One-Time Bonus (Signing/Relocation/Stock Options/etc.):** 10,000 RSUs, Vested over 6 years\n\n    **401(k) / Retirement Plan Match:** 100% match for first 3% contributed, 50% for next 3%",
    "score": 35,
    "url": "https://reddit.com/r/AskEngineers/comments/1ibhdhw/the_q1_2025_askengineers_salary_survey/",
    "created_at": "2025-01-27T19:15:31.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1nv432i",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "The Q4 2025 AskEngineers Salary Survey",
    "text": "# Intro\n\nWelcome to the AskEngineers quarterly salary survey! This post is intended to provide an ongoing resource for job hunters to get an idea of the salary they should ask for based on location and job title. Survey responses are NOT vetted or verified, and should not be considered data of sufficient quality for statistical or other data analysis.\n\nSo what's the point of this survey? We hope that by collecting responses every quarter, job hunters can use it as a supplement to other salary data sites like the Bureau of Labor Statistics (BLS), Glassdoor and PayScale to negotiate better compensation packages when they switch jobs.\n\n&gt; [Archive of past surveys](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n## Useful websites\n\nFor Americans, BLS is the gold standard when it comes to labor data. A guide for how to use BLS can be found in our wiki:\n\n* [*How do I figure out how much salary to ask for? (U.S. only)*](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_how_do_i_figure_out_how_much_salary_to_ask_for.3F_.28u.s._only.29)\n\nWe're working on similar guides for other countries. For example, the Canadian counterpart to BLS is [StatCan](https://www.statcan.gc.ca/eng/start), and [DE Statis](https://www.destatis.de/EN/Themes/Labour/Labour-Market/Employment/_node.html) for Germany.\n\n* [Glassdoor](https://www.glassdoor.com/member/home/index.htm)\n\n* [PayScale](https://www.payscale.com/)\n\n# How to participate / Survey instructions\n\nA template is provided at the bottom of this post to standardize reporting total compensation from your job. I encourage you to fill out all of the fields to keep the quality of responses high. Feel free to make a throwaway account for anonymity.\n\n1. Copy the template in the gray codebox below.\n\n1. **Look in the comments for the engineering discipline that your job/industry falls under, and reply to the top-level AutoModerator comment.**\n\n1. **Turn ON Markdown Mode.** Paste the template in your reply and type away! Some definitions:\n\n  * **Industry:** The specific industry you work in.\n  * **Specialization:** Your career focus or subject-matter expertise.\n  * **Total Experience:** Number of years of experience across your entire career so far.\n  * **Cost of Living:** The comparative cost of goods, housing and services for the area of the world you work in.\n\n## How to look up Cost of Living (COL) / Regional Price Parity (RPP)\n\n### In the United States:\n\nFollow the instructions below and list the name of your Metropolitan Statistical Area and its corresponding RPP.\n\n  1. Go here: **https://apps.bea.gov/itable/iTable.cfm?ReqID=70&amp;step=1**\n\n  1. Click on **\"REAL PERSONAL INCOME AND REGIONAL PRICE PARITIES BY STATE AND METROPOLITAN AREA\"** to expand the dropdown\n\n  1. Click on **\"Regional Price Parities (RPP)\"**\n\n  1. Click the **\"MARPP - Regional Price Parities by MSA\"** radio button, then click \"Next Step\"\n\n  1. Select the Metropolitan Statistical Area (MSA) you live in, then click \"Next Step\" until you reach the end\n\n  1. Copy/paste the name of the MSA and the number called **\"RPPs: All items\"** to your comment\n\n### NOT in the United States:\n\nName the nearest large metropolitan area to you. **Examples:** London, Berlin, Tokyo, Beijing, etc.\n\n---\n\n# Survey Response Template\n\n## !!! NOTE: use Markdown Mode for this to format correctly!\n\n    **Job Title:** Design Engineer\n\n    **Industry:** Medical devices\n\n    **Specialization:** (optional)\n\n    **Remote Work %:** (go into office every day) 0 / 25 / 50 / 75 / 100% (fully remote)\n\n    **Approx. Company Size (optional):** e.g. 51-200 employees, &lt; 1,000 employees\n\n    **Total Experience:** 5 years\n\n    **Highest Degree:** BS MechE\n\n    **Gender:** (optional)\n\n    **Country:** USA\n\n    **Cost of Living:** Los Angeles-Long Beach-Anaheim, CA (Metropolitan Statistical Area), 117.1\n\n    **Annual Gross (Brutto) Salary:** $50,000\n\n    **Bonus Pay:** $5,000 per year\n\n    **One-Time Bonus (Signing/Relocation/Stock Options/etc.):** 10,000 RSUs, Vested over 6 years\n\n    **401(k) / Retirement Plan Match:** 100% match for first 3% contributed, 50% for next 3%",
    "score": 32,
    "url": "https://reddit.com/r/AskEngineers/comments/1nv432i/the_q4_2025_askengineers_salary_survey/",
    "created_at": "2025-10-01T10:00:38.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1il921g",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "r/engineering's Monthly Feb 2025 Hiring Thread for Engineering Professionals",
    "text": "\\# Overview\n\nIf you have open positions at your company for engineering professionals (including technologists, fabricators, and technicians) and would like to hire from the r/engineering user base, please leave a comment detailing any open job listings at your company.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWe also encourage you to post internship positions as well. Many of our readers are currently in school or are just finishing their education.\n\n&amp;#x200B;\n\n\\*\\*Please don't post duplicate comments.\\*\\* This thread uses Contest Mode, which means all comments are forced to randomly sort with scores hidden. If you want to advertise new positions, edit your original comment.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of old hiring threads](https://www.reddit.com/r/engineering/search?q=flair%3A\"hiring+thread\"&amp;restrict_sr=on&amp;sort=relevance&amp;t=all)\n\n&amp;#x200B;\n\n\\## Top-level comments are reserved for posting open positions!\n\n&amp;#x200B;\n\nAny top-level comments that are not a job posting will be removed. However, I will sticky a comment that you can reply to for discussion related to hiring and the job market. Alternatively, feel free to use the \\[Weekly Career Discussion Thread.\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22Weekly+Discussion%22&amp;sort=new&amp;restrict_sr=on&amp;t=all)\n\n&amp;#x200B;\n\n\\## Feedback\n\n&amp;#x200B;\n\nFeedback and suggestions are welcome, but please \\[\\*\\*message us\\*\\*\\](https://www.reddit.com/message/compose?to=%2Fr%2Fengineering&amp;subject=Feedback:%20Quarterly%20Hiring%20Thread) instead of posting them here.\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\# READ THIS BEFORE POSTING\n\n&amp;#x200B;\n\n\\## Rules &amp; Guidelines\n\n&amp;#x200B;\n\n1. Include the company name in your post.\n\n&amp;#x200B;\n\n1. Include the geographic location of the position along with any availability of relocation assistance.\n\n&amp;#x200B;\n\n1. Clearly list citizenship, visa, and security clearance requirements.\n\n&amp;#x200B;\n\n1. State whether the position is \\*Full Time\\*, \\*Part Time\\*, or \\*Contract\\*. For contract positions, include the duration of the contract and any details on contract renewal / extension.\n\n&amp;#x200B;\n\n1. Mention if applicants should apply officially through HR, or directly through you.\n\n  \\* \\*\\*If you are a third-party recruiter, you must disclose this in your posting.\\*\\*\n\n  \\* While it's fine to link to the position on your company website, provide the important details in your comment.\n\n  \\* Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.\n\n&amp;#x200B;\n\n1. \\*\\*Pandemic Guidelines:\\*\\*\n\n  \\* Include a percent estimate of how much of the job can be done remotely, OR how many days each week the hire is expected to show up at the office.\n\n  \\* Include your company's policy on Paid Time Off (PTO), Flex Time Off (FTO), and/or another form of sick leave compensation, and details of how much of this is available on Day 1 of employment. \\*\\*If this type of compensation is unknown or not provided, you must state this in your posting.\\*\\*\n\n  \\* Include what type of health insurance is offered by the company as part of the position.\n\n&amp;#x200B;\n\n\\## TEMPLATE\n\n&amp;#x200B;\n\n\\### !!! NOTE: Turn on Markdown Mode for this to format correctly!\n\n&amp;#x200B;\n\n\\*\\*Company Name:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Location (City/State/Country):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Citizenship / Visa Requirement:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Type:\\*\\* (Full Time / Part Time / Contract)\n\n&amp;#x200B;\n\n\\*\\*Contract Duration (if applicable):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Third-Party Recruiter:\\*\\* (YES / NO)\n\n&amp;#x200B;\n\n\\*\\*Remote Work (%):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Paid Time Off Policy:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Health Insurance Compensation:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Details:\\*\\* \n\n&amp;#x200B;\n\n(Describe the details of the open position here. Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.)",
    "score": 30,
    "url": "https://reddit.com/r/engineering/comments/1il921g/rengineerings_monthly_feb_2025_hiring_thread_for/",
    "created_at": "2025-02-09T07:01:02.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1loxpim",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "The Q3 2025 AskEngineers Salary Survey",
    "text": "# Intro\n\nWelcome to the AskEngineers quarterly salary survey! This post is intended to provide an ongoing resource for job hunters to get an idea of the salary they should ask for based on location and job title. Survey responses are NOT vetted or verified, and should not be considered data of sufficient quality for statistical or other data analysis.\n\nSo what's the point of this survey? We hope that by collecting responses every quarter, job hunters can use it as a supplement to other salary data sites like the Bureau of Labor Statistics (BLS), Glassdoor and PayScale to negotiate better compensation packages when they switch jobs.\n\n&gt; [Archive of past surveys](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n## Useful websites\n\nFor Americans, BLS is the gold standard when it comes to labor data. A guide for how to use BLS can be found in our wiki:\n\n* [*How do I figure out how much salary to ask for? (U.S. only)*](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_how_do_i_figure_out_how_much_salary_to_ask_for.3F_.28u.s._only.29)\n\nWe're working on similar guides for other countries. For example, the Canadian counterpart to BLS is [StatCan](https://www.statcan.gc.ca/eng/start), and [DE Statis](https://www.destatis.de/EN/Themes/Labour/Labour-Market/Employment/_node.html) for Germany.\n\n* [Glassdoor](https://www.glassdoor.com/member/home/index.htm)\n\n* [PayScale](https://www.payscale.com/)\n\n# How to participate / Survey instructions\n\nA template is provided at the bottom of this post to standardize reporting total compensation from your job. I encourage you to fill out all of the fields to keep the quality of responses high. Feel free to make a throwaway account for anonymity.\n\n1. Copy the template in the gray codebox below.\n\n1. **Look in the comments for the engineering discipline that your job/industry falls under, and reply to the top-level AutoModerator comment.**\n\n1. **Turn ON Markdown Mode.** Paste the template in your reply and type away! Some definitions:\n\n  * **Industry:** The specific industry you work in.\n  * **Specialization:** Your career focus or subject-matter expertise.\n  * **Total Experience:** Number of years of experience across your entire career so far.\n  * **Cost of Living:** The comparative cost of goods, housing and services for the area of the world you work in.\n\n## How to look up Cost of Living (COL) / Regional Price Parity (RPP)\n\n### In the United States:\n\nFollow the instructions below and list the name of your Metropolitan Statistical Area and its corresponding RPP.\n\n  1. Go here: **https://apps.bea.gov/itable/iTable.cfm?ReqID=70&amp;step=1**\n\n  1. Click on **\"REAL PERSONAL INCOME AND REGIONAL PRICE PARITIES BY STATE AND METROPOLITAN AREA\"** to expand the dropdown\n\n  1. Click on **\"Regional Price Parities (RPP)\"**\n\n  1. Click the **\"MARPP - Regional Price Parities by MSA\"** radio button, then click \"Next Step\"\n\n  1. Select the Metropolitan Statistical Area (MSA) you live in, then click \"Next Step\" until you reach the end\n\n  1. Copy/paste the name of the MSA and the number called **\"RPPs: All items\"** to your comment\n\n### NOT in the United States:\n\nName the nearest large metropolitan area to you. **Examples:** London, Berlin, Tokyo, Beijing, etc.\n\n---\n\n# Survey Response Template\n\n## !!! NOTE: use Markdown Mode for this to format correctly!\n\n    **Job Title:** Design Engineer\n\n    **Industry:** Medical devices\n\n    **Specialization:** (optional)\n\n    **Remote Work %:** (go into office every day) 0 / 25 / 50 / 75 / 100% (fully remote)\n\n    **Approx. Company Size (optional):** e.g. 51-200 employees, &lt; 1,000 employees\n\n    **Total Experience:** 5 years\n\n    **Highest Degree:** BS MechE\n\n    **Gender:** (optional)\n\n    **Country:** USA\n\n    **Cost of Living:** Los Angeles-Long Beach-Anaheim, CA (Metropolitan Statistical Area), 117.1\n\n    **Annual Gross (Brutto) Salary:** $50,000\n\n    **Bonus Pay:** $5,000 per year\n\n    **One-Time Bonus (Signing/Relocation/Stock Options/etc.):** 10,000 RSUs, Vested over 6 years\n\n    **401(k) / Retirement Plan Match:** 100% match for first 3% contributed, 50% for next 3%",
    "score": 23,
    "url": "https://reddit.com/r/AskEngineers/comments/1loxpim/the_q3_2025_askengineers_salary_survey/",
    "created_at": "2025-07-01T10:00:44.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1jpkwrh",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "The Q2 2025 AskEngineers Salary Survey",
    "text": "# Intro\n\nWelcome to the AskEngineers quarterly salary survey! This post is intended to provide an ongoing resource for job hunters to get an idea of the salary they should ask for based on location and job title. Survey responses are NOT vetted or verified, and should not be considered data of sufficient quality for statistical or other data analysis.\n\nSo what's the point of this survey? We hope that by collecting responses every quarter, job hunters can use it as a supplement to other salary data sites like the Bureau of Labor Statistics (BLS), Glassdoor and PayScale to negotiate better compensation packages when they switch jobs.\n\n&gt; [Archive of past surveys](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n## Useful websites\n\nFor Americans, BLS is the gold standard when it comes to labor data. A guide for how to use BLS can be found in our wiki:\n\n* [*How do I figure out how much salary to ask for? (U.S. only)*](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_how_do_i_figure_out_how_much_salary_to_ask_for.3F_.28u.s._only.29)\n\nWe're working on similar guides for other countries. For example, the Canadian counterpart to BLS is [StatCan](https://www.statcan.gc.ca/eng/start), and [DE Statis](https://www.destatis.de/EN/Themes/Labour/Labour-Market/Employment/_node.html) for Germany.\n\n* [Glassdoor](https://www.glassdoor.com/member/home/index.htm)\n\n* [PayScale](https://www.payscale.com/)\n\n# How to participate / Survey instructions\n\nA template is provided at the bottom of this post to standardize reporting total compensation from your job. I encourage you to fill out all of the fields to keep the quality of responses high. Feel free to make a throwaway account for anonymity.\n\n1. Copy the template in the gray codebox below.\n\n1. **Look in the comments for the engineering discipline that your job/industry falls under, and reply to the top-level AutoModerator comment.**\n\n1. **Turn ON Markdown Mode.** Paste the template in your reply and type away! Some definitions:\n\n  * **Industry:** The specific industry you work in.\n  * **Specialization:** Your career focus or subject-matter expertise.\n  * **Total Experience:** Number of years of experience across your entire career so far.\n  * **Cost of Living:** The comparative cost of goods, housing and services for the area of the world you work in.\n\n## How to look up Cost of Living (COL) / Regional Price Parity (RPP)\n\n### In the United States:\n\nFollow the instructions below and list the name of your Metropolitan Statistical Area and its corresponding RPP.\n\n  1. Go here: **https://apps.bea.gov/itable/iTable.cfm?ReqID=70&amp;step=1**\n\n  1. Click on **\"REAL PERSONAL INCOME AND REGIONAL PRICE PARITIES BY STATE AND METROPOLITAN AREA\"** to expand the dropdown\n\n  1. Click on **\"Regional Price Parities (RPP)\"**\n\n  1. Click the **\"MARPP - Regional Price Parities by MSA\"** radio button, then click \"Next Step\"\n\n  1. Select the Metropolitan Statistical Area (MSA) you live in, then click \"Next Step\" until you reach the end\n\n  1. Copy/paste the name of the MSA and the number called **\"RPPs: All items\"** to your comment\n\n### NOT in the United States:\n\nName the nearest large metropolitan area to you. **Examples:** London, Berlin, Tokyo, Beijing, etc.\n\n---\n\n# Survey Response Template\n\n## !!! NOTE: use Markdown Mode for this to format correctly!\n\n    **Job Title:** Design Engineer\n\n    **Industry:** Medical devices\n\n    **Specialization:** (optional)\n\n    **Remote Work %:** (go into office every day) 0 / 25 / 50 / 75 / 100% (fully remote)\n\n    **Approx. Company Size (optional):** e.g. 51-200 employees, &lt; 1,000 employees\n\n    **Total Experience:** 5 years\n\n    **Highest Degree:** BS MechE\n\n    **Gender:** (optional)\n\n    **Country:** USA\n\n    **Cost of Living:** Los Angeles-Long Beach-Anaheim, CA (Metropolitan Statistical Area), 117.1\n\n    **Annual Gross (Brutto) Salary:** $50,000\n\n    **Bonus Pay:** $5,000 per year\n\n    **One-Time Bonus (Signing/Relocation/Stock Options/etc.):** 10,000 RSUs, Vested over 6 years\n\n    **401(k) / Retirement Plan Match:** 100% match for first 3% contributed, 50% for next 3%",
    "score": 21,
    "url": "https://reddit.com/r/AskEngineers/comments/1jpkwrh/the_q2_2025_askengineers_salary_survey/",
    "created_at": "2025-04-02T10:00:39.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1mtuw7n",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Resources for Informal Continued Education",
    "text": "Apologies if this is a common topic on here - feel free to point me elsewhere if there are other similar posts. \n\nIs anyone aware of good resources or ideas for non-masters-degree continued education options? Things like trainings, newsletters, mini-courses or certifications, etc. or even just good books to read (like things that can be read casually, on a kindle for example) that are a good way to keep your skills/knowledge sharp, or branch out into new topics too, but without the time and financial commitment of a masters degree or similar pursuit. I suppose I could always dig out my old textbooks, I’m sure there’s plenty in those that I’m rusty on &amp; could stand to refresh a bit, but that honestly seems a bit intimidating without some sort of course structure to direct the learning a bit at least. \n\nI know some other professions have pretty well-established and formalized continuing education requirements, and thus tend to have pretty good options for how to satisfy them, but I’ve always felt like engineering is a bit lacking in that area (unless I’m just not plugged into the broader profession in the right way). For reference, I’m probably what you’d call on the border between early to mid career, having graduated with my bachelors almost 10 years ago &amp; been working ever since at a few different companies. I’ve toyed with the idea of a masters degree sooner or later but certain personal commitments make it tough to imagine carving out the time for one any time in the near future, but I feel like I’m not learning as much as I did early on in my career so I’m just trying not to stagnate. Any and all thoughts would be sincerely appreciated!",
    "score": 19,
    "url": "https://reddit.com/r/engineering/comments/1mtuw7n/resources_for_informal_continued_education/",
    "created_at": "2025-08-18T18:51:40.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1ifaqub",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Call for Engineers: Tell us about your job! (01 Feb 2025)",
    "text": "# Intro\n\nSome of the most common questions asked by people looking into a career in engineering are:\n\n* *What do engineers actually do at work?*\n* *What's an average day like for an engineer?*\n* *Are there any engineering jobs where I don't have to sit at a desk all day?*\n\nWhile these questions may appear simple, they're difficult to answer and require lengthy descriptions that should account for industry, specialization, and program phase. Much of the info available on the internet is too generic to be helpful and doesn't capture the sheer variety of engineering work that's out there.\n\nTo create a practical solution to this, AskEngineers opens this annual Work Experience thread where engineers describe their daily job activities and career in general. This series has been very successful in helping students to decide on the ideal major based on interests, as well as other engineers to better understand what their counterparts in other disciplines do.\n\n# How to participate\n\nA template is provided for you which includes standard questions that are frequently asked by students. You don't have to answer every question, and how detailed your answers are is up to you. Feel free to come up with your own writing prompts and provide any info you think is helpful or interesting!\n\n1. Copy the template in the gray codebox below.\n2. **Look in the comments for the engineering discipline that fits your job/industry.** Reply to the top-level AutoModerator comment.\n3. **Turn ON Markdown Mode.** Paste the template in your reply and type away! Some definitions:\n\n* **Industry:** The specific industry you work in.\n* **Specialization:** Your career focus or subject-matter expertise.\n* **Total Experience:** Number of years of experience across your engineering career so far.\n\n# !!! NOTE: All replies must be to one of the top-level Automoderator comments.\n\n* **Failure to do this will result in your comment being removed.** This is to keep everything organized and easy to search. You will be asked politely to repost your response.\n* Questions and discussion are welcome, but make sure you're replying to someone else's contribution.\n\n# Response Template!!! NOTE: Turn on Markdown Mode for this to format correctly!\n\n    **Job Title:** Design Engineer\n    \n    **Industry:** Medical devices\n    \n    **Specialization:** (optional, but helpful)\n    \n    **Total Experience:** 5 years\n    \n    **Highest Degree:** BS MechE\n    \n    **Country:** USA\n    \n    ---\n    \n    &gt; ### Q1. What inspired you to become an engineer?\n    \n    (free form answer)\n    \n    &gt; ### Q2. Why did you choose your specific industry and specialization?\n    \n    (free form answer)\n    \n    &gt; ### Q3. What's a normal day at work like for you? Can you describe your daily tasks &amp; responsibilities?\n    \n    (suggestion: include a discussion of program phase)\n    \n    &gt; ### Q4. What was your craziest or most interesting day on the job?\n    \n    (free form answer)\n    \n    &gt; ### Q5. What was the most interesting project you worked on during your career?\n    \n    (free form answer)\n    \n    &gt; ### Q6. What university did you attend for your engineering degree(s), and why should / shouldn't I go there?\n    \n    (free form answer)\n    \n    &gt; ### Q7. If you could do it all over again, what would you do differently?\n    \n    (free form answer)\n    \n    &gt; ### Q8. Do you have any advice for someone who's just getting started in engineering school/work?\n    \n    (free form answer)",
    "score": 17,
    "url": "https://reddit.com/r/AskEngineers/comments/1ifaqub/call_for_engineers_tell_us_about_your_job_01_feb/",
    "created_at": "2025-02-01T17:01:12.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1mb8e6h",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (28 Jul 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 15,
    "url": "https://reddit.com/r/engineering/comments/1mb8e6h/weekly_career_discussion_thread_28_jul_2025/",
    "created_at": "2025-07-28T06:01:03.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1j721d2",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "r/engineering's Monthly Mar 2025 Hiring Thread for Engineering Professionals",
    "text": "\\# Overview\n\nIf you have open positions at your company for engineering professionals (including technologists, fabricators, and technicians) and would like to hire from the r/engineering user base, please leave a comment detailing any open job listings at your company.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWe also encourage you to post internship positions as well. Many of our readers are currently in school or are just finishing their education.\n\n&amp;#x200B;\n\n\\*\\*Please don't post duplicate comments.\\*\\* This thread uses Contest Mode, which means all comments are forced to randomly sort with scores hidden. If you want to advertise new positions, edit your original comment.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of old hiring threads](https://www.reddit.com/r/engineering/search?q=flair%3A\"hiring+thread\"&amp;restrict_sr=on&amp;sort=relevance&amp;t=all)\n\n&amp;#x200B;\n\n\\## Top-level comments are reserved for posting open positions!\n\n&amp;#x200B;\n\nAny top-level comments that are not a job posting will be removed. However, I will sticky a comment that you can reply to for discussion related to hiring and the job market. Alternatively, feel free to use the \\[Weekly Career Discussion Thread.\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22Weekly+Discussion%22&amp;sort=new&amp;restrict_sr=on&amp;t=all)\n\n&amp;#x200B;\n\n\\## Feedback\n\n&amp;#x200B;\n\nFeedback and suggestions are welcome, but please \\[\\*\\*message us\\*\\*\\](https://www.reddit.com/message/compose?to=%2Fr%2Fengineering&amp;subject=Feedback:%20Quarterly%20Hiring%20Thread) instead of posting them here.\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\# READ THIS BEFORE POSTING\n\n&amp;#x200B;\n\n\\## Rules &amp; Guidelines\n\n&amp;#x200B;\n\n1. Include the company name in your post.\n\n&amp;#x200B;\n\n1. Include the geographic location of the position along with any availability of relocation assistance.\n\n&amp;#x200B;\n\n1. Clearly list citizenship, visa, and security clearance requirements.\n\n&amp;#x200B;\n\n1. State whether the position is \\*Full Time\\*, \\*Part Time\\*, or \\*Contract\\*. For contract positions, include the duration of the contract and any details on contract renewal / extension.\n\n&amp;#x200B;\n\n1. Mention if applicants should apply officially through HR, or directly through you.\n\n  \\* \\*\\*If you are a third-party recruiter, you must disclose this in your posting.\\*\\*\n\n  \\* While it's fine to link to the position on your company website, provide the important details in your comment.\n\n  \\* Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.\n\n&amp;#x200B;\n\n1. \\*\\*Pandemic Guidelines:\\*\\*\n\n  \\* Include a percent estimate of how much of the job can be done remotely, OR how many days each week the hire is expected to show up at the office.\n\n  \\* Include your company's policy on Paid Time Off (PTO), Flex Time Off (FTO), and/or another form of sick leave compensation, and details of how much of this is available on Day 1 of employment. \\*\\*If this type of compensation is unknown or not provided, you must state this in your posting.\\*\\*\n\n  \\* Include what type of health insurance is offered by the company as part of the position.\n\n&amp;#x200B;\n\n\\## TEMPLATE\n\n&amp;#x200B;\n\n\\### !!! NOTE: Turn on Markdown Mode for this to format correctly!\n\n&amp;#x200B;\n\n\\*\\*Company Name:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Location (City/State/Country):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Citizenship / Visa Requirement:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Type:\\*\\* (Full Time / Part Time / Contract)\n\n&amp;#x200B;\n\n\\*\\*Contract Duration (if applicable):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Third-Party Recruiter:\\*\\* (YES / NO)\n\n&amp;#x200B;\n\n\\*\\*Remote Work (%):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Paid Time Off Policy:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Health Insurance Compensation:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Details:\\*\\* \n\n&amp;#x200B;\n\n(Describe the details of the open position here. Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.)",
    "score": 15,
    "url": "https://reddit.com/r/engineering/comments/1j721d2/rengineerings_monthly_mar_2025_hiring_thread_for/",
    "created_at": "2025-03-09T07:00:49.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1ncc1y1",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "r/engineering's Monthly Sep 2025 Hiring Thread for Engineering Professionals",
    "text": "\\# Overview\n\nIf you have open positions at your company for engineering professionals (including technologists, fabricators, and technicians) and would like to hire from the r/engineering user base, please leave a comment detailing any open job listings at your company.\n\n\n\n\n\nWe also encourage you to post internship positions as well. Many of our readers are currently in school or are just finishing their education.\n\n\n\n\\*\\*Please don't post duplicate comments.\\*\\* This thread uses Contest Mode, which means all comments are forced to randomly sort with scores hidden. If you want to advertise new positions, edit your original comment.\n\n\n\n\\&gt; \\[Archive of old hiring threads\\](https://www.reddit.com/r/engineering/search?q=flair%3A\"hiring+thread\"&amp;restrict\\_sr=on&amp;sort=relevance&amp;t=all)\n\n\n\n\\## Top-level comments are reserved for posting open positions!\n\n\n\nAny top-level comments that are not a job posting will be removed. However, I will sticky a comment that you can reply to for discussion related to hiring and the job market. Alternatively, feel free to use the \\[Weekly Career Discussion Thread.\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22Weekly+Discussion%22&amp;sort=new&amp;restrict\\_sr=on&amp;t=all)\n\n\n\n\\## Feedback\n\n\n\nFeedback and suggestions are welcome, but please \\[\\*\\*message us\\*\\*\\](https://www.reddit.com/message/compose?to=%2Fr%2Fengineering&amp;subject=Feedback:%20Quarterly%20Hiring%20Thread) instead of posting them here.\n\n\n\n\\---\n\n\n\n\\# READ THIS BEFORE POSTING\n\n\n\n\\## Rules &amp; Guidelines\n\n\n\n1. Include the company name in your post.\n\n\n\n1. Include the geographic location of the position along with any availability of relocation assistance.\n\n\n\n1. Clearly list citizenship, visa, and security clearance requirements.\n\n\n\n1. State whether the position is \\*Full Time\\*, \\*Part Time\\*, or \\*Contract\\*. For contract positions, include the duration of the contract and any details on contract renewal / extension.\n\n\n\n1. Mention if applicants should apply officially through HR, or directly through you.\n\n\\* \\*\\*If you are a third-party recruiter, you must disclose this in your posting.\\*\\*\n\n\\* While it's fine to link to the position on your company website, provide the important details in your comment.\n\n\\* Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.\n\n\n\n1. \\*\\*Pandemic Guidelines:\\*\\*\n\n\\* Include a percent estimate of how much of the job can be done remotely, OR how many days each week the hire is expected to show up at the office.\n\n\\* Include your company's policy on Paid Time Off (PTO), Flex Time Off (FTO), and/or another form of sick leave compensation, and details of how much of this is available on Day 1 of employment. \\*\\*If this type of compensation is unknown or not provided, you must state this in your posting.\\*\\*\n\n\\* Include what type of health insurance is offered by the company as part of the position.\n\n\n\n\\## TEMPLATE\n\n\n\n\\### !!! NOTE: Turn on Markdown Mode for this to format correctly!\n\n\n\n\\*\\*Company Name:\\*\\*\n\n\n\n\\*\\*Location (City/State/Country):\\*\\*\n\n\n\n\\*\\*Citizenship / Visa Requirement:\\*\\*\n\n\n\n\\*\\*Position Type:\\*\\* (Full Time / Part Time / Contract)\n\n\n\n\\*\\*Contract Duration (if applicable):\\*\\*\n\n\n\n\\*\\*Third-Party Recruiter:\\*\\* (YES / NO)\n\n\n\n\\*\\*Remote Work (%):\\*\\*\n\n\n\n\\*\\*Paid Time Off Policy:\\*\\*\n\n\n\n\\*\\*Health Insurance Compensation:\\*\\*\n\n\n\n\\*\\*Position Details:\\*\\*\n\n\n\n(Describe the details of the open position here. Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.)",
    "score": 14,
    "url": "https://reddit.com/r/engineering/comments/1ncc1y1/rengineerings_monthly_sep_2025_hiring_thread_for/",
    "created_at": "2025-09-09T07:00:59.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1lvc71e",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "r/engineering's Monthly Jul 2025 Hiring Thread for Engineering Professionals",
    "text": "\\# Overview\n\nIf you have open positions at your company for engineering professionals (including technologists, fabricators, and technicians) and would like to hire from the r/engineering user base, please leave a comment detailing any open job listings at your company.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWe also encourage you to post internship positions as well. Many of our readers are currently in school or are just finishing their education.\n\n&amp;#x200B;\n\n\\*\\*Please don't post duplicate comments.\\*\\* This thread uses Contest Mode, which means all comments are forced to randomly sort with scores hidden. If you want to advertise new positions, edit your original comment.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of old hiring threads](https://www.reddit.com/r/engineering/search?q=flair%3A\"hiring+thread\"&amp;restrict_sr=on&amp;sort=relevance&amp;t=all)\n\n&amp;#x200B;\n\n\\## Top-level comments are reserved for posting open positions!\n\n&amp;#x200B;\n\nAny top-level comments that are not a job posting will be removed. However, I will sticky a comment that you can reply to for discussion related to hiring and the job market. Alternatively, feel free to use the \\[Weekly Career Discussion Thread.\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22Weekly+Discussion%22&amp;sort=new&amp;restrict_sr=on&amp;t=all)\n\n&amp;#x200B;\n\n\\## Feedback\n\n&amp;#x200B;\n\nFeedback and suggestions are welcome, but please \\[\\*\\*message us\\*\\*\\](https://www.reddit.com/message/compose?to=%2Fr%2Fengineering&amp;subject=Feedback:%20Quarterly%20Hiring%20Thread) instead of posting them here.\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\# READ THIS BEFORE POSTING\n\n&amp;#x200B;\n\n\\## Rules &amp; Guidelines\n\n&amp;#x200B;\n\n1. Include the company name in your post.\n\n&amp;#x200B;\n\n1. Include the geographic location of the position along with any availability of relocation assistance.\n\n&amp;#x200B;\n\n1. Clearly list citizenship, visa, and security clearance requirements.\n\n&amp;#x200B;\n\n1. State whether the position is \\*Full Time\\*, \\*Part Time\\*, or \\*Contract\\*. For contract positions, include the duration of the contract and any details on contract renewal / extension.\n\n&amp;#x200B;\n\n1. Mention if applicants should apply officially through HR, or directly through you.\n\n  \\* \\*\\*If you are a third-party recruiter, you must disclose this in your posting.\\*\\*\n\n  \\* While it's fine to link to the position on your company website, provide the important details in your comment.\n\n  \\* Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.\n\n&amp;#x200B;\n\n1. \\*\\*Pandemic Guidelines:\\*\\*\n\n  \\* Include a percent estimate of how much of the job can be done remotely, OR how many days each week the hire is expected to show up at the office.\n\n  \\* Include your company's policy on Paid Time Off (PTO), Flex Time Off (FTO), and/or another form of sick leave compensation, and details of how much of this is available on Day 1 of employment. \\*\\*If this type of compensation is unknown or not provided, you must state this in your posting.\\*\\*\n\n  \\* Include what type of health insurance is offered by the company as part of the position.\n\n&amp;#x200B;\n\n\\## TEMPLATE\n\n&amp;#x200B;\n\n\\### !!! NOTE: Turn on Markdown Mode for this to format correctly!\n\n&amp;#x200B;\n\n\\*\\*Company Name:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Location (City/State/Country):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Citizenship / Visa Requirement:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Type:\\*\\* (Full Time / Part Time / Contract)\n\n&amp;#x200B;\n\n\\*\\*Contract Duration (if applicable):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Third-Party Recruiter:\\*\\* (YES / NO)\n\n&amp;#x200B;\n\n\\*\\*Remote Work (%):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Paid Time Off Policy:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Health Insurance Compensation:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Details:\\*\\* \n\n&amp;#x200B;\n\n(Describe the details of the open position here. Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.)",
    "score": 14,
    "url": "https://reddit.com/r/engineering/comments/1lvc71e/rengineerings_monthly_jul_2025_hiring_thread_for/",
    "created_at": "2025-07-09T07:00:30.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1ofqfkt",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Complex circuit analysis for children's toys - any interesting stories?",
    "text": "Father, electrician, and computer engineering minor student studying Nilsson and Riedel's Electric Circuits. My boys like to play at a park jungle gym that has a touch capacitor-animal sound maker and I've been humbled by the math on the capacitance chapter from my book. I know people \"look down\" (especially techs I work with) on kids toys and I've been further humbled by not fully understanding the intracacies of these basic AA powered DC circuits. Asking engineers, have you worked on 'simple' underdog toys/devices in your career that are actually brilliant examples of electrical engineering? ",
    "score": 14,
    "url": "https://reddit.com/r/AskEngineers/comments/1ofqfkt/complex_circuit_analysis_for_childrens_toys_any/",
    "created_at": "2025-10-25T12:35:53.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1ltml4c",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (07 Jul 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 13,
    "url": "https://reddit.com/r/engineering/comments/1ltml4c/weekly_career_discussion_thread_07_jul_2025/",
    "created_at": "2025-07-07T06:01:24.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1ilzex0",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (10 Feb 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 12,
    "url": "https://reddit.com/r/engineering/comments/1ilzex0/weekly_career_discussion_thread_10_feb_2025/",
    "created_at": "2025-02-10T06:01:57.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1jd5ydy",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (17 Mar 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 12,
    "url": "https://reddit.com/r/engineering/comments/1jd5ydy/weekly_career_discussion_thread_17_mar_2025/",
    "created_at": "2025-03-17T06:01:39.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1k46hsy",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (21 Apr 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 12,
    "url": "https://reddit.com/r/engineering/comments/1k46hsy/weekly_career_discussion_thread_21_apr_2025/",
    "created_at": "2025-04-21T06:01:28.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1iwv71e",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (24 Feb 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 12,
    "url": "https://reddit.com/r/engineering/comments/1iwv71e/weekly_career_discussion_thread_24_feb_2025/",
    "created_at": "2025-02-24T06:01:51.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1l6y71p",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "r/engineering's Monthly Jun 2025 Hiring Thread for Engineering Professionals",
    "text": "\\# Overview\n\nIf you have open positions at your company for engineering professionals (including technologists, fabricators, and technicians) and would like to hire from the r/engineering user base, please leave a comment detailing any open job listings at your company.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWe also encourage you to post internship positions as well. Many of our readers are currently in school or are just finishing their education.\n\n&amp;#x200B;\n\n\\*\\*Please don't post duplicate comments.\\*\\* This thread uses Contest Mode, which means all comments are forced to randomly sort with scores hidden. If you want to advertise new positions, edit your original comment.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of old hiring threads](https://www.reddit.com/r/engineering/search?q=flair%3A\"hiring+thread\"&amp;restrict_sr=on&amp;sort=relevance&amp;t=all)\n\n&amp;#x200B;\n\n\\## Top-level comments are reserved for posting open positions!\n\n&amp;#x200B;\n\nAny top-level comments that are not a job posting will be removed. However, I will sticky a comment that you can reply to for discussion related to hiring and the job market. Alternatively, feel free to use the \\[Weekly Career Discussion Thread.\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22Weekly+Discussion%22&amp;sort=new&amp;restrict_sr=on&amp;t=all)\n\n&amp;#x200B;\n\n\\## Feedback\n\n&amp;#x200B;\n\nFeedback and suggestions are welcome, but please \\[\\*\\*message us\\*\\*\\](https://www.reddit.com/message/compose?to=%2Fr%2Fengineering&amp;subject=Feedback:%20Quarterly%20Hiring%20Thread) instead of posting them here.\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\# READ THIS BEFORE POSTING\n\n&amp;#x200B;\n\n\\## Rules &amp; Guidelines\n\n&amp;#x200B;\n\n1. Include the company name in your post.\n\n&amp;#x200B;\n\n1. Include the geographic location of the position along with any availability of relocation assistance.\n\n&amp;#x200B;\n\n1. Clearly list citizenship, visa, and security clearance requirements.\n\n&amp;#x200B;\n\n1. State whether the position is \\*Full Time\\*, \\*Part Time\\*, or \\*Contract\\*. For contract positions, include the duration of the contract and any details on contract renewal / extension.\n\n&amp;#x200B;\n\n1. Mention if applicants should apply officially through HR, or directly through you.\n\n  \\* \\*\\*If you are a third-party recruiter, you must disclose this in your posting.\\*\\*\n\n  \\* While it's fine to link to the position on your company website, provide the important details in your comment.\n\n  \\* Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.\n\n&amp;#x200B;\n\n1. \\*\\*Pandemic Guidelines:\\*\\*\n\n  \\* Include a percent estimate of how much of the job can be done remotely, OR how many days each week the hire is expected to show up at the office.\n\n  \\* Include your company's policy on Paid Time Off (PTO), Flex Time Off (FTO), and/or another form of sick leave compensation, and details of how much of this is available on Day 1 of employment. \\*\\*If this type of compensation is unknown or not provided, you must state this in your posting.\\*\\*\n\n  \\* Include what type of health insurance is offered by the company as part of the position.\n\n&amp;#x200B;\n\n\\## TEMPLATE\n\n&amp;#x200B;\n\n\\### !!! NOTE: Turn on Markdown Mode for this to format correctly!\n\n&amp;#x200B;\n\n\\*\\*Company Name:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Location (City/State/Country):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Citizenship / Visa Requirement:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Type:\\*\\* (Full Time / Part Time / Contract)\n\n&amp;#x200B;\n\n\\*\\*Contract Duration (if applicable):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Third-Party Recruiter:\\*\\* (YES / NO)\n\n&amp;#x200B;\n\n\\*\\*Remote Work (%):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Paid Time Off Policy:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Health Insurance Compensation:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Details:\\*\\* \n\n&amp;#x200B;\n\n(Describe the details of the open position here. Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.)",
    "score": 12,
    "url": "https://reddit.com/r/engineering/comments/1l6y71p/rengineerings_monthly_jun_2025_hiring_thread_for/",
    "created_at": "2025-06-09T07:01:00.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1pbdiq9",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (01 Dec 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 12,
    "url": "https://reddit.com/r/AskEngineers/comments/1pbdiq9/career_monday_01_dec_2025_have_a_question_about/",
    "created_at": "2025-12-01T14:01:17.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1i07ild",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (13 Jan 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 11,
    "url": "https://reddit.com/r/engineering/comments/1i07ild/weekly_career_discussion_thread_13_jan_2025/",
    "created_at": "2025-01-13T06:01:56.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1kvn3hq",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (26 May 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 10,
    "url": "https://reddit.com/r/engineering/comments/1kvn3hq/weekly_career_discussion_thread_26_may_2025/",
    "created_at": "2025-05-26T06:01:29.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1mn55xu",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (11 Aug 2025)",
    "text": "\\# Intro\n\n\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n\n\n\\&gt; \\[Archive of past threads\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)\n\n\n\n\\---\n\n\n\n\\## Guidelines\n\n\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.\\](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n\n\n\\## Resources\n\n\n\n\\* \\[The AskEngineers wiki\\](https://new.reddit.com/r/askengineers/wiki/faq)\n\n\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include\\_over\\_18=on&amp;restrict\\_sr=on&amp;t=all&amp;sort=new)\n\n\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki\\_what.27s\\_your\\_average\\_day\\_like\\_as\\_an\\_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 10,
    "url": "https://reddit.com/r/engineering/comments/1mn55xu/weekly_career_discussion_thread_11_aug_2025/",
    "created_at": "2025-08-11T06:01:11.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1pn03i6",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (15 Dec 2025)",
    "text": "\\# Intro\n\n\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n\n\n\\&gt; \\[Archive of past threads\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)\n\n\n\n\\---\n\n\n\n\\## Guidelines\n\n\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.\\](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n\n\n\\## Resources\n\n\n\n\\* \\[The AskEngineers wiki\\](https://new.reddit.com/r/askengineers/wiki/faq)\n\n\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include\\_over\\_18=on&amp;restrict\\_sr=on&amp;t=all&amp;sort=new)\n\n\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki\\_what.27s\\_your\\_average\\_day\\_like\\_as\\_an\\_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 10,
    "url": "https://reddit.com/r/engineering/comments/1pn03i6/weekly_career_discussion_thread_15_dec_2025/",
    "created_at": "2025-12-15T06:01:29.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1nbn3w7",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (08 Sep 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 10,
    "url": "https://reddit.com/r/AskEngineers/comments/1nbn3w7/career_monday_08_sep_2025_have_a_question_about/",
    "created_at": "2025-09-08T13:00:51.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1ix2p07",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (24 Feb 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 10,
    "url": "https://reddit.com/r/AskEngineers/comments/1ix2p07/career_monday_24_feb_2025_have_a_question_about/",
    "created_at": "2025-02-24T14:01:09.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ntheav",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (29 Sep 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 10,
    "url": "https://reddit.com/r/AskEngineers/comments/1ntheav/career_monday_29_sep_2025_have_a_question_about/",
    "created_at": "2025-09-29T13:00:57.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1ird4nf",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (17 Feb 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1ird4nf/weekly_career_discussion_thread_17_feb_2025/",
    "created_at": "2025-02-17T06:01:45.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1lo012f",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (30 Jun 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1lo012f/weekly_career_discussion_thread_30_jun_2025/",
    "created_at": "2025-06-30T06:01:00.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1ib1c7d",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (27 Jan 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1ib1c7d/weekly_career_discussion_thread_27_jan_2025/",
    "created_at": "2025-01-27T06:01:53.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1n5gvgp",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (01 Sep 2025)",
    "text": "\\# Intro\n\n\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n\n\n\\&gt; \\[Archive of past threads\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)\n\n\n\n\\---\n\n\n\n\\## Guidelines\n\n\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.\\](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n\n\n\\## Resources\n\n\n\n\\* \\[The AskEngineers wiki\\](https://new.reddit.com/r/askengineers/wiki/faq)\n\n\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include\\_over\\_18=on&amp;restrict\\_sr=on&amp;t=all&amp;sort=new)\n\n\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki\\_what.27s\\_your\\_average\\_day\\_like\\_as\\_an\\_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1n5gvgp/weekly_career_discussion_thread_01_sep_2025/",
    "created_at": "2025-09-01T06:01:48.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1m5b2ir",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (21 Jul 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1m5b2ir/weekly_career_discussion_thread_21_jul_2025/",
    "created_at": "2025-07-21T06:01:02.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1kq4hyr",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (19 May 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1kq4hyr/weekly_career_discussion_thread_19_may_2025/",
    "created_at": "2025-05-19T06:01:44.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1lzeqn9",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (14 Jul 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1lzeqn9/weekly_career_discussion_thread_14_jul_2025/",
    "created_at": "2025-07-14T06:01:31.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1mzimji",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (25 Aug 2025)",
    "text": "\\# Intro\n\n\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n\n\n\\&gt; \\[Archive of past threads\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)\n\n\n\n\\---\n\n\n\n\\## Guidelines\n\n\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.\\](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n\n\n\\## Resources\n\n\n\n\\* \\[The AskEngineers wiki\\](https://new.reddit.com/r/askengineers/wiki/faq)\n\n\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include\\_over\\_18=on&amp;restrict\\_sr=on&amp;t=all&amp;sort=new)\n\n\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki\\_what.27s\\_your\\_average\\_day\\_like\\_as\\_an\\_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1mzimji/weekly_career_discussion_thread_25_aug_2025/",
    "created_at": "2025-08-25T06:01:14.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1pi0yr6",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "r/engineering's Monthly Dec 2025 Hiring Thread for Engineering Professionals",
    "text": "\\# Overview\n\nIf you have open positions at your company for engineering professionals (including technologists, fabricators, and technicians) and would like to hire from the r/engineering user base, please leave a comment detailing any open job listings at your company.\n\n\n\n\n\nWe also encourage you to post internship positions as well. Many of our readers are currently in school or are just finishing their education.\n\n\n\n\\*\\*Please don't post duplicate comments.\\*\\* This thread uses Contest Mode, which means all comments are forced to randomly sort with scores hidden. If you want to advertise new positions, edit your original comment.\n\n\n\n\\&gt; \\[Archive of old hiring threads\\](https://www.reddit.com/r/engineering/search?q=flair%3A\"hiring+thread\"&amp;restrict\\_sr=on&amp;sort=relevance&amp;t=all)\n\n\n\n\\## Top-level comments are reserved for posting open positions!\n\n\n\nAny top-level comments that are not a job posting will be removed. However, I will sticky a comment that you can reply to for discussion related to hiring and the job market. Alternatively, feel free to use the \\[Weekly Career Discussion Thread.\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22Weekly+Discussion%22&amp;sort=new&amp;restrict\\_sr=on&amp;t=all)\n\n\n\n\\## Feedback\n\n\n\nFeedback and suggestions are welcome, but please \\[\\*\\*message us\\*\\*\\](https://www.reddit.com/message/compose?to=%2Fr%2Fengineering&amp;subject=Feedback:%20Quarterly%20Hiring%20Thread) instead of posting them here.\n\n\n\n\\---\n\n\n\n\\# READ THIS BEFORE POSTING\n\n\n\n\\## Rules &amp; Guidelines\n\n\n\n1. Include the company name in your post.\n\n\n\n1. Include the geographic location of the position along with any availability of relocation assistance.\n\n\n\n1. Clearly list citizenship, visa, and security clearance requirements.\n\n\n\n1. State whether the position is \\*Full Time\\*, \\*Part Time\\*, or \\*Contract\\*. For contract positions, include the duration of the contract and any details on contract renewal / extension.\n\n\n\n1. Mention if applicants should apply officially through HR, or directly through you.\n\n\\* \\*\\*If you are a third-party recruiter, you must disclose this in your posting.\\*\\*\n\n\\* While it's fine to link to the position on your company website, provide the important details in your comment.\n\n\\* Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.\n\n\n\n1. \\*\\*Pandemic Guidelines:\\*\\*\n\n\\* Include a percent estimate of how much of the job can be done remotely, OR how many days each week the hire is expected to show up at the office.\n\n\\* Include your company's policy on Paid Time Off (PTO), Flex Time Off (FTO), and/or another form of sick leave compensation, and details of how much of this is available on Day 1 of employment. \\*\\*If this type of compensation is unknown or not provided, you must state this in your posting.\\*\\*\n\n\\* Include what type of health insurance is offered by the company as part of the position.\n\n\n\n\\## TEMPLATE\n\n\n\n\\### !!! NOTE: Turn on Markdown Mode for this to format correctly!\n\n\n\n\\*\\*Company Name:\\*\\*\n\n\n\n\\*\\*Location (City/State/Country):\\*\\*\n\n\n\n\\*\\*Citizenship / Visa Requirement:\\*\\*\n\n\n\n\\*\\*Position Type:\\*\\* (Full Time / Part Time / Contract)\n\n\n\n\\*\\*Contract Duration (if applicable):\\*\\*\n\n\n\n\\*\\*Third-Party Recruiter:\\*\\* (YES / NO)\n\n\n\n\\*\\*Remote Work (%):\\*\\*\n\n\n\n\\*\\*Paid Time Off Policy:\\*\\*\n\n\n\n\\*\\*Health Insurance Compensation:\\*\\*\n\n\n\n\\*\\*Position Details:\\*\\*\n\n\n\n(Describe the details of the open position here. Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.)",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1pi0yr6/rengineerings_monthly_dec_2025_hiring_thread_for/",
    "created_at": "2025-12-09T07:00:47.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1kicbd4",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "r/engineering's Monthly May 2025 Hiring Thread for Engineering Professionals",
    "text": "\\# Overview\n\nIf you have open positions at your company for engineering professionals (including technologists, fabricators, and technicians) and would like to hire from the r/engineering user base, please leave a comment detailing any open job listings at your company.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWe also encourage you to post internship positions as well. Many of our readers are currently in school or are just finishing their education.\n\n&amp;#x200B;\n\n\\*\\*Please don't post duplicate comments.\\*\\* This thread uses Contest Mode, which means all comments are forced to randomly sort with scores hidden. If you want to advertise new positions, edit your original comment.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of old hiring threads](https://www.reddit.com/r/engineering/search?q=flair%3A\"hiring+thread\"&amp;restrict_sr=on&amp;sort=relevance&amp;t=all)\n\n&amp;#x200B;\n\n\\## Top-level comments are reserved for posting open positions!\n\n&amp;#x200B;\n\nAny top-level comments that are not a job posting will be removed. However, I will sticky a comment that you can reply to for discussion related to hiring and the job market. Alternatively, feel free to use the \\[Weekly Career Discussion Thread.\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22Weekly+Discussion%22&amp;sort=new&amp;restrict_sr=on&amp;t=all)\n\n&amp;#x200B;\n\n\\## Feedback\n\n&amp;#x200B;\n\nFeedback and suggestions are welcome, but please \\[\\*\\*message us\\*\\*\\](https://www.reddit.com/message/compose?to=%2Fr%2Fengineering&amp;subject=Feedback:%20Quarterly%20Hiring%20Thread) instead of posting them here.\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\# READ THIS BEFORE POSTING\n\n&amp;#x200B;\n\n\\## Rules &amp; Guidelines\n\n&amp;#x200B;\n\n1. Include the company name in your post.\n\n&amp;#x200B;\n\n1. Include the geographic location of the position along with any availability of relocation assistance.\n\n&amp;#x200B;\n\n1. Clearly list citizenship, visa, and security clearance requirements.\n\n&amp;#x200B;\n\n1. State whether the position is \\*Full Time\\*, \\*Part Time\\*, or \\*Contract\\*. For contract positions, include the duration of the contract and any details on contract renewal / extension.\n\n&amp;#x200B;\n\n1. Mention if applicants should apply officially through HR, or directly through you.\n\n  \\* \\*\\*If you are a third-party recruiter, you must disclose this in your posting.\\*\\*\n\n  \\* While it's fine to link to the position on your company website, provide the important details in your comment.\n\n  \\* Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.\n\n&amp;#x200B;\n\n1. \\*\\*Pandemic Guidelines:\\*\\*\n\n  \\* Include a percent estimate of how much of the job can be done remotely, OR how many days each week the hire is expected to show up at the office.\n\n  \\* Include your company's policy on Paid Time Off (PTO), Flex Time Off (FTO), and/or another form of sick leave compensation, and details of how much of this is available on Day 1 of employment. \\*\\*If this type of compensation is unknown or not provided, you must state this in your posting.\\*\\*\n\n  \\* Include what type of health insurance is offered by the company as part of the position.\n\n&amp;#x200B;\n\n\\## TEMPLATE\n\n&amp;#x200B;\n\n\\### !!! NOTE: Turn on Markdown Mode for this to format correctly!\n\n&amp;#x200B;\n\n\\*\\*Company Name:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Location (City/State/Country):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Citizenship / Visa Requirement:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Type:\\*\\* (Full Time / Part Time / Contract)\n\n&amp;#x200B;\n\n\\*\\*Contract Duration (if applicable):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Third-Party Recruiter:\\*\\* (YES / NO)\n\n&amp;#x200B;\n\n\\*\\*Remote Work (%):\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Paid Time Off Policy:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Health Insurance Compensation:\\*\\* \n\n&amp;#x200B;\n\n\\*\\*Position Details:\\*\\* \n\n&amp;#x200B;\n\n(Describe the details of the open position here. Please be thorough and upfront with the position details. Use of non-HR'd (realistic) requirements is encouraged.)",
    "score": 9,
    "url": "https://reddit.com/r/engineering/comments/1kicbd4/rengineerings_monthly_may_2025_hiring_thread_for/",
    "created_at": "2025-05-09T07:01:06.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1j7s0a1",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (10 Mar 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 8,
    "url": "https://reddit.com/r/engineering/comments/1j7s0a1/weekly_career_discussion_thread_10_mar_2025/",
    "created_at": "2025-03-10T06:01:21.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1oz8o0e",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (17 Nov 2025)",
    "text": "\\# Intro\n\n\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n\n\n\\&gt; \\[Archive of past threads\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)\n\n\n\n\\---\n\n\n\n\\## Guidelines\n\n\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.\\](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n\n\n\\## Resources\n\n\n\n\\* \\[The AskEngineers wiki\\](https://new.reddit.com/r/askengineers/wiki/faq)\n\n\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include\\_over\\_18=on&amp;restrict\\_sr=on&amp;t=all&amp;sort=new)\n\n\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki\\_what.27s\\_your\\_average\\_day\\_like\\_as\\_an\\_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 8,
    "url": "https://reddit.com/r/engineering/comments/1oz8o0e/weekly_career_discussion_thread_17_nov_2025/",
    "created_at": "2025-11-17T06:01:28.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1li91yy",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (23 Jun 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 8,
    "url": "https://reddit.com/r/engineering/comments/1li91yy/weekly_career_discussion_thread_23_jun_2025/",
    "created_at": "2025-06-23T06:01:17.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1i5jmzm",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (20 Jan 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 8,
    "url": "https://reddit.com/r/engineering/comments/1i5jmzm/weekly_career_discussion_thread_20_jan_2025/",
    "created_at": "2025-01-20T06:01:59.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1oxwtg8",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Call for engineers willing to be interviewed (15 Nov 2025)",
    "text": "If you're looking for engineers to interview for a school assignment or for your job hunt, this is the right place! The AskEngineers community has compiled a list of hundreds of practicing engineers across different countries, industries, and specializations to help answer your questions about what they do in their job, how they got there, and offer career advice to those that need it.\n\n**Note:** Please be courteous when requesting an interview. Everyone on the list is doing it on a volunteer basis only, and they are not obligated to respond or help you. Our users reserve the right to deny any requests for interviews and/or personal information. Harassment will not be tolerated and will be reported to the authorities.\n\n# How to use this list\n\n1. Ctrl + F  \n the engineering discipline, country (e.g. US, UK, Germany, etc.), or other criteria you're looking for looking for. If you need to be able to verify someone's identity, search for Available for e-mail?: yes\n2. Parse through each search result and message up to 3 users that you think will be able to answer your questions. **DO NOT shotgun PMs to every user!** If you don't intend to interview everyone, don't waste their time by sending messages that you won't respond to later.\n3. If the first few users don't respond within 24 hours, try messaging another user.\n\n# Interested in conducting interviews?\n\nBy signing up, you're volunteering to let high school students, prospective engineers, and new graduates PM or e-mail you with interview questions. Typically with students it will be for a class assignment (i.e. Intro to Engineering), so questions will be about about work, how you got into engineering, \"do you have any advice for...\", etc. Think of yourself as a STEM Ambassador.\n\nYou will receive anywhere from 1-4 requests per month on average, with some surges in January, July, August, and December due to new and graduating students. While these lists usually have over 100 sign-ups and is set to contest mode, which prevents the same users from getting bombarded with requests, engineers in an in-demand discipline may get more requests than average.\n\n# Requirements\n\n1. **At minimum, you should have:**\n\n* a BS / B.Sc in engineering or engineering technology, or an equivalent amount of self-study, and;\n* at least 3 years of professional engineering experience\n\n1. **Commit to answering at least two interview requests per month**. Don't list your information if you aren't willing to volunteer roughly \\~2 hours per month to conduct interviews.\n\n# How much time does it take?\n\nThe first interview you do will take about 1 hour, depending on how detailed you are. After that, most interviews will take &lt; 30 minutes because you can copy-paste answers for repeat or very similar questions. That said, please be sure to read every question carefully before using previously written answers.\n\n# How do I sign up?\n\nCopy the template below and post a top-level comment below. **Note:** \"Available for e-mail\" means you're OK with the interviewer sending you a personal e-mail to conduct the interview, usually for verification purposes. If you want to stick to reddit PM only, answer 'no' to this question. \n\n**This is purely on a volunteer basis.** To opt out, delete your comment here below. Once deleted, you will no longer receive requests for interviews.\n\n**This template must be used in Markdown Mode to function properly:**\n\n    **Discipline:** Mechanical\n    \n    **Specialization:** Power Turbines\n    \n    **Highest Degree:** MSME\n    \n    **Country:** US\n    \n    **Available for e-mail?:** yes/no",
    "score": 8,
    "url": "https://reddit.com/r/AskEngineers/comments/1oxwtg8/call_for_engineers_willing_to_be_interviewed_15/",
    "created_at": "2025-11-15T17:00:28.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1igihgy",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (03 Feb 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 7,
    "url": "https://reddit.com/r/engineering/comments/1igihgy/weekly_career_discussion_thread_03_feb_2025/",
    "created_at": "2025-02-03T06:01:55.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1l1aixv",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (02 Jun 2025)",
    "text": "\\# Intro\n\n&amp;#x200B;\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n&amp;#x200B;\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n&amp;#x200B;\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n&amp;#x200B;\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n&amp;#x200B;\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n&amp;#x200B;\n\n\\&gt; \\[Archive of past threads](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n&amp;#x200B;\n\n\\---\n\n&amp;#x200B;\n\n\\## Guidelines\n\n&amp;#x200B;\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n&amp;#x200B;\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n&amp;#x200B;\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n&amp;#x200B;\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n&amp;#x200B;\n\n\\## Resources\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers wiki](https://new.reddit.com/r/askengineers/wiki/faq)\n\n&amp;#x200B;\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include_over_18=on&amp;restrict_sr=on&amp;t=all&amp;sort=new)\n\n&amp;#x200B;\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki_what.27s_your_average_day_like_as_an_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n&amp;#x200B;\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 7,
    "url": "https://reddit.com/r/engineering/comments/1l1aixv/weekly_career_discussion_thread_02_jun_2025/",
    "created_at": "2025-06-02T06:01:36.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1m2fyso",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Cheap anti-drone system for Ukrainians review?",
    "text": "UPDATE: I have a lot more research to do. This thread can be disregarded unless you want to share your thoughts. \n\n\n\nI'm trying to understand why Ukrainians civilians or armed forces are having trouble with protecting themselves against drones and am hoping you could help explain why the following wouldn't work. I don't have an engineering background, but I do play around with electronics generally.\n\nThis idea is based on [Target Detection by Marine Radar](https://books.google.com/books?hl=en&amp;lr=&amp;id=BuvXwWAAauQC&amp;oi=fnd&amp;pg=PR5&amp;dq=marine+radar+object+detection+air&amp;ots=zhO71gn3Oj&amp;sig=p7foJ7UOp5CXUOwr05AnK7Iusnk#v=onepage&amp;q&amp;f=false) by John Biggs. In essence, it uses a combination of a marine radar + LIDAR to feed data into an Arduino board, which handles target ID and calculating a firing solution. The info is passed to a servo which has a 50w fiber laser mounted to it. The idea being that it is portable, affordable, and waterproof.\n\n|ITEM|COST USD / Hryvnia|Handles|WEIGHT (G) / WATT-HOURS|NOTES|\n|:-|:-|:-|:-|:-|\n|[~~Marine Radar~~](https://www.ebay.ie/sch/36797/i.html?_nkw=marine+radar&amp;_from=R40&amp;_fcid=209)  Furuno NXT|~~$213 /~~ **~~₴~~** ~~8,918~~ $2500+|initial target tracking|2,404 / 2000|used on eBay|\n|[LIDAR ](https://www.alibaba.com/product-detail/Long-Range-Lidar-Module-A4-1_1600705952846.html?mark=google_shopping&amp;seo=1&amp;gQT=1)(Shenzhen Hongruitai Electronics)|$240 / **₴** 10,048|final-stage target tracking|100 / 120|Alibaba;  Redundancy for Radar|\n|[Arduino Leonardo](https://store.arduino.cc/products/arduino-leonardo-with-headers)|$29 / **₴** 1,232|handling I/O|20 / 1.04||\n|[Arduino Daughter (RS485 Interface)](https://www.hwhardsoft.de/english/projects/rs485-arduino/)|$44 / **₴** 1843|interface for Radar/LIDAR &amp; Arduino|5 / 1||\n|[Arduino Daughter (Motor Carrier)](https://store.arduino.cc/collections/shields-carriers/products/arduino-mkr-motor-carrier)|$84 / **₴** 3,517|signals servo how to move to achieve firing solution|5 / 1||\n|[Arduino Daughter (buzzer)](https://store-usa.arduino.cc/products/modulino-buzzer?gQT=2)|$6.50 / **₴** 272|alerts user when drone detected, firing solution achieved|4.2 / 1||\n|[Arduino Daughter (Movement)](https://store.arduino.cc/products/modulino-movement)|$15.40 / **₴** 3,517|mounts on laser to track current position|5 / 1||\n|[150kg Servo](https://www.amazon.com/Stemedu-DS51150-Digital-Steering-Waterproof/dp/B0CZ8TKM2T/ref=sr_1_18?crid=113HWUJ9RHD1X&amp;dib=eyJ2IjoiMSJ9.z2XGHS3FD-YX_I4FLCcy0fZNBHHIoTV9kI8MpyaUx1H5v2fnZDQHBxOrDx2T3BAYsGfpC8oqx8feATTQvaSzTyCtEKp9wdPEMPeHl8-9Dnrb3yXcEZGNwL3Q4xylYYGgIXsxZX9fk7DbYt2bZBaCpYifN3zkxyFEik9oXglMVTEldY6ROLXnv-X0y6zggE90afyAZiHfgvlXByBsN-GmzSZIMHL54D5zlJ02gNo7kot5OScbWEUfVbTdkR80-laR81sVp9K75XqTVnoznTfB-ptv2NNDlbAQfCq_PJvZwVs.c7pcLSLB1rx-LXKLo1pI5scTxCVD6cflFN71v69C_ys&amp;dib_tag=se&amp;keywords=5+axis+servo+12v&amp;qid=1752772689&amp;sprefix=5+axis+servo+12v%2Caps%2C68&amp;sr=8-18)|$39 / **₴** 1,633|physically moves laser into position|60 / 1||\n|[50w fiber laser (Aliexpress)](https://www.aliexpress.us/item/3256808652471552.html?src=google&amp;pdp_npi=4%40dis%21USD%21546.39%21546.39%21%21%21%21%21%40%2112000046896447836%21ppc%21%21%21&amp;gQT=1&amp;gatewayAdapt=glo2usa)|$547 / **₴** 22,903|disables drone|1000 / depends on usage|CNC laser; unsure if sufficient|\n|[Battery ](https://www.amazon.com/OPTIMA-Batteries-Performance-Maintenance-Versitile/dp/B000AMD6CC?source=ps-sl-shoppingads-lpcontext&amp;ref_=fplfs&amp;psc=1&amp;smid=ATVPDKIKX0DER&amp;gQT=1)(Optima Blue - 50 Amp-Hour)|$310 / **₴** 12,978|powers device during blackout|19,731 / -||\n|[EU plug to 12v-10a DC adapter](https://www.aliexpress.us/item/2251832840734217.html?gatewayAdapt=glo2usa4itemAdapt)|$18 / **₴** 744|charges battery, powers device|350 / -|Not waterproof|\n\nTotal Price and weight are pending updates\n\nI'll have to work on getting the price down since the average salary in Ukraine is less than half of the cost of the whole thing, but for now I was just focusing on whether or not it would work. I haven't even factored in a case, cabling, connectors, hardware, etc. yet.",
    "score": 7,
    "url": "https://reddit.com/r/AskEngineers/comments/1m2fyso/cheap_antidrone_system_for_ukrainians_review/",
    "created_at": "2025-07-17T18:53:57.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1jiq38i",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (24 Mar 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 7,
    "url": "https://reddit.com/r/AskEngineers/comments/1jiq38i/career_monday_24_mar_2025_have_a_question_about/",
    "created_at": "2025-03-24T13:01:01.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1kkrxfm",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (12 May 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 7,
    "url": "https://reddit.com/r/AskEngineers/comments/1kkrxfm/career_monday_12_may_2025_have_a_question_about/",
    "created_at": "2025-05-12T13:01:02.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1k4cxtp",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (21 Apr 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 6,
    "url": "https://reddit.com/r/AskEngineers/comments/1k4cxtp/career_monday_21_apr_2025_have_a_question_about/",
    "created_at": "2025-04-21T13:01:07.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1l57uhe",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "I wanna learn to make machines/robots as a hobby, how do I start?",
    "text": "I’ve always been interested in engineering, and I’ve always seen these awesome videos online of people making neat machines with arduinos and various other things, my question is, how can I do stuff like that? I’m not super interested in making it a career but I would love to be able to make machines and stuff while working with my hands and whatnot, so my question I guess is, how do I start/ what do I learn? Electrical engineering? Mechanical? Something else entirely? I just don’t know where to start, thanks :)",
    "score": 6,
    "url": "https://reddit.com/r/AskEngineers/comments/1l57uhe/i_wanna_learn_to_make_machinesrobots_as_a_hobby/",
    "created_at": "2025-06-07T00:24:59.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1ph4xg5",
    "subreddit": "engineering",
    "soc_codes": [
      "17-2199",
      "17-2141"
    ],
    "title": "Weekly Career Discussion Thread (08 Dec 2025)",
    "text": "\\# Intro\n\n\n\nWelcome to the weekly career discussion thread, where you can talk about all career &amp; professional topics. Topics may include:\n\n\n\n\\* Professional career guidance &amp; questions; e.g. job hunting advice, job offers comparisons, how to network\n\n\n\n\\* Educational guidance &amp; questions; e.g. what engineering discipline to major in, which university is good,\n\n\n\n\\* Feedback on your résumé, CV, cover letter, etc.\n\n\n\n\\* The job market, compensation, relocation, and other topics on the economics of engineering.\n\n\n\n\\&gt; \\[Archive of past threads\\](https://www.reddit.com/r/engineering/search?q=flair%3A%22weekly+discussion%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)\n\n\n\n\\---\n\n\n\n\\## Guidelines\n\n\n\n1. \\*\\*Before asking any questions, consult \\[the AskEngineers wiki.\\](https://new.reddit.com/r/askengineers/wiki/faq)\\*\\* There are detailed answers to common questions on:\n\n\\* Job compensation\n\n\\* Cost of Living adjustments\n\n\\* Advice for how to decide on an engineering major\n\n\\* How to choose which university to attend\n\n\n\n1. Most subreddit rules still apply and will be enforced, especially R7 and R9 (with the obvious exceptions of R1 and R3)\n\n\n\n1. Job POSTINGS must go into the latest \\[\\*\\*Monthly Hiring Thread.\\*\\*\\]((https://www.reddit.com/r/engineering/search?q=flair%3A%22hiring+thread%22&amp;restrict\\_sr=on&amp;sort=new&amp;t=all)) Any that are posted here will be removed, and you'll be kindly redirected to the hiring thread.\n\n\n\n1. \\*\\*Do not request interviews in this thread!\\*\\* If you need to interview an engineer for your school assignment, use the list in the sidebar.\n\n\n\n\\## Resources\n\n\n\n\\* \\[The AskEngineers wiki\\](https://new.reddit.com/r/askengineers/wiki/faq)\n\n\n\n\\* \\[The AskEngineers Quarterly Salary Survey\\](https://www.reddit.com/r/AskEngineers/search/?q=flair%3A%22salary+survey%22&amp;include\\_over\\_18=on&amp;restrict\\_sr=on&amp;t=all&amp;sort=new)\n\n\n\n\\* \\*\\*For students:\\*\\* \\[\\*\"What's your average day like as an engineer?\"\\*\\](https://www.reddit.com/r/AskEngineers/wiki/faq#wiki\\_what.27s\\_your\\_average\\_day\\_like\\_as\\_an\\_engineer.3F) We recommend that you spend an hour or so reading about what engineers actually do at work. This will help you make a more informed decision on which major to choose, or at least give you enough info to ask follow-up questions here.\n\n\n\n\\* For those of you interested in a career in software development / Computer Science, go to r/cscareerquestions.",
    "score": 5,
    "url": "https://reddit.com/r/engineering/comments/1ph4xg5/weekly_career_discussion_thread_08_dec_2025/",
    "created_at": "2025-12-08T06:01:46.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1ozh1eq",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (17 Nov 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 5,
    "url": "https://reddit.com/r/AskEngineers/comments/1ozh1eq/career_monday_17_nov_2025_have_a_question_about/",
    "created_at": "2025-11-17T14:01:01.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1im6qwq",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (10 Feb 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 5,
    "url": "https://reddit.com/r/AskEngineers/comments/1im6qwq/career_monday_10_feb_2025_have_a_question_about/",
    "created_at": "2025-02-10T14:01:07.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1hpnt31",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (30 Dec 2024): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 5,
    "url": "https://reddit.com/r/AskEngineers/comments/1hpnt31/career_monday_30_dec_2024_have_a_question_about/",
    "created_at": "2024-12-30T14:00:46.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1pt0a2i",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (22 Dec 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 5,
    "url": "https://reddit.com/r/AskEngineers/comments/1pt0a2i/career_monday_22_dec_2025_have_a_question_about/",
    "created_at": "2025-12-22T14:00:58.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1irkh21",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (17 Feb 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 5,
    "url": "https://reddit.com/r/AskEngineers/comments/1irkh21/career_monday_17_feb_2025_have_a_question_about/",
    "created_at": "2025-02-17T14:00:57.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1j7y25u",
    "subreddit": "AskEngineers",
    "soc_codes": [
      "17-2199"
    ],
    "title": "Career Monday (10 Mar 2025): Have a question about your job, office, or pay? Post it here!",
    "text": "As a reminder, /r/AskEngineers normal restrictions for career related posts are severely relaxed for this thread, so feel free to ask about intra-office politics, salaries, or just about anything else related to your job!",
    "score": 5,
    "url": "https://reddit.com/r/AskEngineers/comments/1j7y25u/career_monday_10_mar_2025_have_a_question_about/",
    "created_at": "2025-03-10T13:01:38.000Z",
    "num_comments": 11
  }
]