[
  {
    "id": "reddit-1lvk295",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Walmart alone could deploy up to 11.1 GWs of solar power by turning the parking lots at all of its 3,571 U.S. super centers in to solar canopies",
    "text": "To read the study that came up with the above statistics... [Click here](https://doi.org/10.1016/j.renene.2021.01.068)\n\nTo read more articles on this topic, see the articles below:\n\n* [Why Putting Solar Canopies on Parking Lots Is a Smart Green Move](https://e360.yale.edu/features/putting-solar-panels-atop-parking-lots-a-green-energy-solution)\n* [Solarizing parking lots with solar carports or elevated solar trackers](https://solarbuildermag.com/featured/solarizing-parking-lots-with-solar-carports-or-elevated-solar-trackers/)\n* [The Untapped Solar Power Potential of Parking Lots: Benefits and Solutions](https://www.ecoflow.com/us/blog/solar-panel-parking-lot-benefits-solutions)",
    "score": 1965,
    "url": "https://reddit.com/r/environmental_science/comments/1lvk295/walmart_alone_could_deploy_up_to_111_gws_of_solar/",
    "created_at": "2025-07-09T14:22:23.000Z",
    "num_comments": 134
  },
  {
    "id": "reddit-1ifbzjf",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "How are the U.S. based env. scientists coping right now?",
    "text": "As a fellow environmental scientist based in the United States, I am feeling extremely discouraged by the actions of the federal government. \n\nIt feels like everything I have worked towards in school and my career are exploding right now on a national and local level. Conservation projects that were previously approved have come to a stop. Invoices aren’t getting paid. I don’t know if my colleagues will get paid for much longer. \n\nI’m trying to stay positive but I don’t know what I can look forward to. \n\nHow are you all dealing with this? \n",
    "score": 1563,
    "url": "https://reddit.com/r/environmental_science/comments/1ifbzjf/how_are_the_us_based_env_scientists_coping_right/",
    "created_at": "2025-02-01T17:54:47.000Z",
    "num_comments": 211
  },
  {
    "id": "reddit-1kmt047",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Should I make a report to the EPA on this runoff/waste?",
    "text": "I work in mosquito abatement, and this was flowing into a site that I was inspecting. It was coming from a warehouse at the top of this ditch. It was blackish/blue and the smell was a very bad. Almost like an unnatural sewage. I'm not sure what to do. Any advice? In Illinois by the way.",
    "score": 874,
    "url": "https://reddit.com/r/environmental_science/comments/1kmt047/should_i_make_a_report_to_the_epa_on_this/",
    "created_at": "2025-05-14T22:53:02.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1j0ih73",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Is it true that the endangered species act &amp; marine mammal protection act are getting amended/potentially removed?",
    "text": "I’m a current environmental science student, and two labs that I did research in the past with have been posting on their social medias about these acts getting potentially removed by congress—I’ve scoured Google, but I can’t find much additional information on this so I’m not sure what to think. The social medias are run by scientists I know and trust but they haven’t posted any articles, just Instagram reposts that warn about the acts being removed and suggest to email representatives about it. \n\nI think I’m just feeling very discouraged currently as I’m watching so many aspects of my chosen field go downhill. I see posts about national park employees getting laid off, wildlife biologists losing their jobs… even my top REU summer research choices I applied for have been canceled due to not getting funding. And now these acts might be changed or removed? I’m a rising senior, so I feel it’s too late for me to change career paths nor would I want to, but as someone who wants to work with endangered species and possibly marine mammals I feel like I’m losing hope. ",
    "score": 222,
    "url": "https://reddit.com/r/environmental_science/comments/1j0ih73/is_it_true_that_the_endangered_species_act_marine/",
    "created_at": "2025-02-28T21:12:56.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1nck2uj",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "\"Old Growth forests are less healthy than properly logged forests\" How true is this?",
    "text": "For context, this is something my brother tells me all the time when we are talking about climate change, resource management, environmental issues, and while I suspect it's a lot more complicated than this, my degree is in Geology, and I am not a forestry biologist. \n\nI would love to learn more about this, as I am in support of correctly managed logging (we need wood after all for lots of stuff), and some of the points that he makes, like how the tight canopy cover blocks out a lot of light for other plants, on the surface seem like valid arguments. (In this case, he says that cutting some trees down throughout the canopy allows more light to get to the ground, which helps shrubs that make berries for wildlife and such)\n\nEDIT: there's been a good number of comments on this, some more productive than others, and many people point out that to determine if that's true, we have to define what healthy means \n\nI honestly don't know the answer to that, and I was hoping some folks might have some insights into that\n \nAfter all, people always talk about how we shouldn't log because it creates unhealthy forests, or we should make ecosystems healthier to help the environment (both of which I'm generally on board with), but again, what defines a healthy forest? \n\nI don't know, but if we can't specifically say at least what parameters are more favorable, well then why not cut all of the old growth down and replace them with farmed timber? (This is me being devils advocate bty, I don't think we should cut old growth down)\n\nWe have to be able to specify what healthy means, otherwise the argument that we shouldn't log doesn't really have a leg to stand on, because after all, we do need wood and timber products for all sorts of things. If we can't say why it's unhealthy, or what healthy even is, then why not let the logging industry have free reign? (Again, devils advocate, not my actual opinion)",
    "score": 186,
    "url": "https://reddit.com/r/environmental_science/comments/1nck2uj/old_growth_forests_are_less_healthy_than_properly/",
    "created_at": "2025-09-09T14:14:21.000Z",
    "num_comments": 150
  },
  {
    "id": "reddit-1mnf0xs",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "I hate my job",
    "text": "grew up wanting to save the planet, work with animal conservation and protecting biodiversity. All my advisor could tell me was I should be a professor. I finished with a B.S. in biology and a M.S. in sustainability management. I was lead into sustainability thinking it would be a good way to merge nature and being financially stable. Now I work in a corporate environmental role. It feels so soul draining and intense. I’m reviewing thousands of pages worth of permitting, reporting for multiple sites and all of their NOVs/inspections/audits. I never pictured that this would make me feel so disconnected from my self. I love that I’m learning and growing but something doesnt seem right. I’ve applied for so many other jobs and I never get called back. If anyone has words of wisdom I would appreciate it. I feel lost but my deep passion and love for nature never has died.",
    "score": 179,
    "url": "https://reddit.com/r/environmental_science/comments/1mnf0xs/i_hate_my_job/",
    "created_at": "2025-08-11T14:48:52.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1igxhkj",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "how is this field going to be impacted by the trump administration?",
    "text": "i obviously know that the trump admin pulled out of the paris climate agreement and is pulling funding for many projects attempting to combat climate change. \n\ni’m just curious about how the job market in this sector is responding? with funding being halted, i have heard that benefactors have begun stepping in to allow organizations to continue their work. but im just not sure what direction the future of environmental science is heading in. many people tell me that it’s a field that is growing in necessity which makes me hopeful, however at the present moment im not feeling the most hopeful.",
    "score": 172,
    "url": "https://reddit.com/r/environmental_science/comments/1igxhkj/how_is_this_field_going_to_be_impacted_by_the/",
    "created_at": "2025-02-03T19:25:00.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1kft3xp",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Is it ok to work 60-80 hours a week for environmental jobs?",
    "text": "So I have an environmental science degree and work doing groundwater sampling. I enjoy the field work, I'm perfectly fine with travel including over night stays and 6 hour drives, and I generally like what I do. The only issue I have is the hours.\n\nSo I've worked 2 field jobs now, and both seem to be putting me at \\~50-70 hours a week. Now, I am only just starting in the field, but in doing a little math, it feels bad when you're trying to balance paying off student loans and actually living a life outside of work. I basically wake up at 5 am, go to work, get back home and fall asleep. \n\nIf it were a 40 hour week at 50k an hour (approx what I make), the net hourly is about $24/hour. After Uncle Sam, it's about $18 an hour. I'm not experienced with how much I should be making, and I have under a year of experience in the field, but this seems ok for me.\n\nNow, if you account for say 60 hours weekly (not including travel to and from home which is an extra 2 hours round trip for me), it's $16 an hour net. And after taxes, it's only $12 an hour. In theory, I'm all together pulling 70-80 hours a week.\n\nSo again, is the time commitment too much? I'm writing this in the 30 minutes I have before I need to go to sleep so I can get up at 5AM tomorrow for a 4 hour drive.\n\nEdit:\nSo it sounds like I should be looking for something that pays hourly with OT. It's also a partly that some emergencies have come up with other employees recently causing us to work longer days.\n\nNote: My commute to work is in my vehicle, but we drive a company vehicle to sites. It has a trailer with equipment like ATV and coolers and tools. If its nearing a 3 hour drive and multi-day event, then we will stay at a hotel. 2 people per room. Per diem is not much, like 12 dollars a travel day.",
    "score": 128,
    "url": "https://reddit.com/r/environmental_science/comments/1kft3xp/is_it_ok_to_work_6080_hours_a_week_for/",
    "created_at": "2025-05-06T01:51:33.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1njlxp3",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Can't get a job even with a degree",
    "text": "I have a bachelor of science in environmental science and diverse job experience predating my degree. Is the job market just that horrible? Is there no demand for entry level environmental science grads? Is it because I'm a woman? I'm at a total loss for why all I ever get are rejection emails. When I was applying for internships, I got an interview at 1/3 of the places I've applied to. Now, no matter how many dozens of jobs I apply for I can't get a single interview. Please help",
    "score": 103,
    "url": "https://reddit.com/r/environmental_science/comments/1njlxp3/cant_get_a_job_even_with_a_degree/",
    "created_at": "2025-09-17T18:56:10.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1kyqbe0",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Are large language models like ChatGPT really that harmful to the environment?",
    "text": "I’ve heard that training these kinds of AI systems consumes a huge amount of energy, water, and leads to significant carbon emissions.\nSome sources even claim that they are quite harmful to the environment.\nAre there any scientifically accepted studies or data on this? Can we really say they have such a major environmental impact?",
    "score": 97,
    "url": "https://reddit.com/r/environmental_science/comments/1kyqbe0/are_large_language_models_like_chatgpt_really/",
    "created_at": "2025-05-30T00:08:42.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1opmzl6",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "I feel really scared",
    "text": "hi everyone! i’m a recent grad with a bs in environmental science (I know, I know) and i’m honestly really scared for what’s to come. I have a huge fear I will never get a job and just continue on hating my life like I do right now :/ does anyone have words or wisdom or advice that may help me feel less useless in the world😭",
    "score": 84,
    "url": "https://reddit.com/r/environmental_science/comments/1opmzl6/i_feel_really_scared/",
    "created_at": "2025-11-06T02:28:59.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1n4ivpg",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Where Have We Succeeded?",
    "text": "I've been concerned about the environment since my teens, so call it 60 years (I'm 76).\n\nI get discouraged. The majority still seem to see growth as a solution to everything.  Silent Spring was delayed, but is catching up fast. GHG emissions are still increasing and the POTUS is actively rolling back environmental regulations. Years ago I thought dematerialism and the  information society was the way to go.  Now we see data centers gobbling up resources and electronic devices and AI taking over minds.  \n\nWe have succeeded in curbing some sorts of pollution (acid rain isn't a big issue) and outlawing some of the worst chemicals (CFCs, asbestos, DDT).\n\nWhere else has environmental science seen lasting gains?",
    "score": 64,
    "url": "https://reddit.com/r/environmental_science/comments/1n4ivpg/where_have_we_succeeded/",
    "created_at": "2025-08-31T02:04:34.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1jll7zz",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Is being an environmental science major worth it anymore?",
    "text": "I'm a freshman majoring in environmental science. I'm not sure if there is going to be a job market for anyone in my major by the time I graduate (2028) due to recent political decisions. Is environmental science still something worth majoring in and is there even a job market anymore? I'm not sure what I want to do in the field yet as everything sounds interesting. If I stick with the major, hopefully I'll be able to narrow down what field I want to be in based on the classes I take. Please be brutally honest.",
    "score": 62,
    "url": "https://reddit.com/r/environmental_science/comments/1jll7zz/is_being_an_environmental_science_major_worth_it/",
    "created_at": "2025-03-28T02:51:12.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1i73hs2",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Welp, looks like I'll have to learn a trade. This is an environmentalist job rant, feel free to post your own struggles about lack of eco-opportunities.",
    "text": "After 4 years of getting nowhere with my environmental science degree, with the closest I've gotten to a career in forest conservation is being an invasive plant remover for a small struggling business, I now have no choice but to learn a trade.\n\nThis isn't even about presidents (Biden didn't help me, Harris wouldn't have helped, &amp; Trump surely won't), there's just almost no environmental opportunity in the Kansas City area. I type \"Environmental Science\" on Indeed, all I see are hospitals &amp; big agriculture, both industries I HATE.\n\nI've already applied to the IBEW &amp; am waiting for them to call me. I'm not going to be very happy, but I have to start building my retirement now, &amp; I'm tired of getting rejected because I don't have experience, because I can't get any job due to lack of experience, because I can't get any job due to lack of experience, because I can't get any job due to lack of experience, because I can't get any job due to lack of experience, \\[repeats forever\\]. \n\nMy most recent rejection was a crew leader position for an invasives strike team (other candidates had more leadership experience, nevermind I have invasive removal experience &amp; have ran my crew a few times). I've been rejected from multiple positions in conservation, road work, naturalist, &amp; forester positions because every single available position receives a glut of candidates. So much for \"people don't want to work anymore.\" Even a local taco joint got 80+ applicants for a minimum wage job opening.\n\nSo I'll have to join an electrician's union, who will find work for me, even if it takes a little while, at least I'll get trained &amp; have stability. I hope I can find something in the field that might help the ecosystem (solar panels, energy efficiency, etc.).",
    "score": 54,
    "url": "https://reddit.com/r/environmental_science/comments/1i73hs2/welp_looks_like_ill_have_to_learn_a_trade_this_is/",
    "created_at": "2025-01-22T04:57:45.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1lmos3i",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Curious… what do y’all do for work in the environmental sector?",
    "text": "Figured it would be cool to prompt some discussion and learn about some different areas/careers… I myself am a PhD student beginning research into pollution derived from vehicle tire wear. Would love to hear about the work others are doing/any environmental interests you have!",
    "score": 53,
    "url": "https://reddit.com/r/environmental_science/comments/1lmos3i/curious_what_do_yall_do_for_work_in_the/",
    "created_at": "2025-06-28T14:56:54.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1ifs1ka",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Should I reconsider my environmental science major?",
    "text": "I’m going to be going to college next Fall and I originally planned on studying environmental science, this has been something I’ve wanted to do since I was little. But with everything going on in the US right now I’m worried I won’t ever be able to find a job nonetheless a job with decent wages. I’m not looking to be rich, I just can’t afford to go to college for a career that cannot bring me livable wages. Should I switch this major? If so any suggestions with what I should instead study? ",
    "score": 46,
    "url": "https://reddit.com/r/environmental_science/comments/1ifs1ka/should_i_reconsider_my_environmental_science_major/",
    "created_at": "2025-02-02T07:29:15.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1ktdbk4",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "My dad disapproves of my choice to go to environmental &amp;earth sciences",
    "text": "Hello everyone! I am hoping to attend university soon in October, and I applied to 2 different majors to get a first degree in: Life sciences and Earth&amp; environmental sciences. I'm not doing both of them at the same time, but I applied for both and I'm waiting to see which one I get accepted to and which one I'm rejected in. There are specific requirements for life sciences, I have the perfect exam scores for it and I am pretty much fitting for the major, however I'm only missing math because my score isn't high enough. That's why I chose earth &amp; environmental sciences as a second choice (it is a double major and still very interesting). I love science, I love nature and I love wildlife. I also love microbiology, I've always wanted to be a forensic DNA analyst or work with DNA and such, however if I can't get into life sciences I'd have to give up that.\n\nI was consulting in my parents and my dilemma, and I told my father about my interest in env.&amp; earth sciences (I will get instantly accepted because my grades are good for that) and he immediately disapproved saying I won't find a career, that I'm going to be a failure and that I will never find the money. I told him the chances of me finding a job with a life sciences degree is on an equal level as an earth &amp; environmental sciences degree since STEM is underappreciated nowadays. I just love science. And he just argued with me and kept pressuring me, and of course I want life sciences but I also like earth and environmental sciences. What's wrong with that?\n\nI can also easily get accepted into psychology, but it's just that I don't want to. There's majors that I can go into based on my grades – but I just don't want them. Psychology is interesting, but I don't see myself in this field. It's just not for me. Sure it makes money but I want to be passionate about what I do.\n\nDoes anyone think he's right for disapproving? am I making a mistake?\n\n# Edit: thanks to everyone! I read every single one of your comments and I appreciate it alot, with everything that has been said, ive used some of your comments to convince my dad and he is fine with it now:) Thanks a lot!",
    "score": 42,
    "url": "https://reddit.com/r/environmental_science/comments/1ktdbk4/my_dad_disapproves_of_my_choice_to_go_to/",
    "created_at": "2025-05-23T07:08:59.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1isy76p",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Genuine question: is majoring in environmental science even worth it?",
    "text": "Let’s get this straight: I want to something that will positively impact the environment, but I’m beginning to have doubts on if I should pursue a BS in environmental science. Low income and not all the recent actions of the Trump administration and the NPS layoffs are truly discouraging me. I’m early into my college education so I’m not exactly sure what career path I’d want to pursue (whether I’d want to do research, field work, policy, or environmental law—which seems the best option currently.) \n\nI’m under the impression that Environmental Science is a more limiting major for future career prospects. Sure, it has a certain focus, but what about it can’t be learned in the field by any other science majors? When searching for job opportunities, I see all kinds of science majors also entering the field of environmental science. Would it perhaps be better for me to pursue a Biology major? \n\nI still intend to at least minor in environmental science but I’m not sure where to direct my focus. Any advice or thoughts would be greatly appreciated!",
    "score": 38,
    "url": "https://reddit.com/r/environmental_science/comments/1isy76p/genuine_question_is_majoring_in_environmental/",
    "created_at": "2025-02-19T05:38:50.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1nqcdon",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Is an environmental Science degree worth it???",
    "text": "I am 20 about to be 21 I am about to graduate from the local CC with a general studies degree. The Environmental realm is the only thing that I am passionate about career wise. But my fear is an oversaturate job market or there not being many jobs available. I wanted to work in marine life conservation but decided against that due to a a fear of the job outlook, I changed from wild life conservation due to that fear, I have thought about zoology but again the fear of the job market keeps stopping me. I know the Environmental realm is getting oversaturated but my question is, is an Environmental Science degree worth it? can I work in conservation later on down the road with an Envi. Science degree? Is there any hope for a decent job? what does the job market and salary look like? I asked these questions in another reddit thread and got many people saying its not worth it at all and basically told that there is no jobs and that I should do something completely different. I just wanna know before I start Pursuing the degree.  ",
    "score": 37,
    "url": "https://reddit.com/r/environmental_science/comments/1nqcdon/is_an_environmental_science_degree_worth_it/",
    "created_at": "2025-09-25T17:05:35.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1k3uebv",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Would you recommend getting into environmental science as a career",
    "text": "I dropped out of college studying environmental science to make some money working but a few years later and I’m still making just about the same amount with no signs of growth in my job. I feel really behind without a degree. Environmental science is pretty much the only thing I would like to study but I would have to take a pretty big risk to go back to school for it, I’ve already done some research and the pay isn’t amazing for entry level even with internships, but I at least want the degree for better job opportunities. I’m 26 if that is relevant, but just be brutally honest. If I shouldn’t study this I will probably study something similar. Also anyone that started their career later in their 20’s/30’s?",
    "score": 33,
    "url": "https://reddit.com/r/environmental_science/comments/1k3uebv/would_you_recommend_getting_into_environmental/",
    "created_at": "2025-04-20T19:25:55.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1id9cm5",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Don't know if I should opt for an environmental science degree",
    "text": "As the title says. Personally, I care a lot about the environment. Seeing the recent catastrophes ( forest fires, etc ) has been alarming and knowing that the natural biodiversity is suffering because of human behavior pains me, which is the primary reason I want to study it and pursue a career in this field. \n\nHowever, my parents are reluctant about it because I come from an Asian country. This degree isn't common for them and also they worry that I can't get a high-paying job. They believe that I should study a safer degree so that I at least have a stable income.\n\nI've been doing a lot of research and I can't imagine myself being in an office job. I like to venture out and go outdoors and seeing different things everyday. Since my father is in Australia (I am not in Australia at the moment) I would also opt for an Australian university. I know there are many natural sites there. \n\nAny suggestions or advice would help. 🙏🏻",
    "score": 30,
    "url": "https://reddit.com/r/environmental_science/comments/1id9cm5/dont_know_if_i_should_opt_for_an_environmental/",
    "created_at": "2025-01-30T00:31:51.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1ojbdye",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Office job I can get with an Envi Sci degree?",
    "text": "I am currently a junior majoring in environmental science. I’ve realized I don’t want to be researcher because I don’t want to work outside and I don’t like coding. I do enjoy writing, reading, and the kind of research where you’re looking things up instead of doing studies. I’m considering a few option but they all come with downsides:\n\nPolicy worker: need a law degree to have the most career options but I don’t want to go to law school.\n\nScience writer/communicator: hard to break into/competitive\n\nGIS: I’m taking an intro class right now that I like, but I think higher level stuff requires coding\n\nCan anyone give me advice as to what career might suit my interests? I also have time for a minor if it would help. \n",
    "score": 23,
    "url": "https://reddit.com/r/environmental_science/comments/1ojbdye/office_job_i_can_get_with_an_envi_sci_degree/",
    "created_at": "2025-10-29T17:48:39.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1krse2i",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Passion &gt; money",
    "text": "So I’m a high school senior about to graduate in a week and I’m stressed about my career. To start, I have a math brain. Never got anything under a A in any math classes, 90% sure I got over a 4 on my AP stats exam, my mind is just wired for math but that’s not my passion. My passion in wildlife, and environmental stuff. I’ve always been that kid that wanted to go out and explore, and fish, and hunt and loved being outside and wildlife. I regret not taking AP environmental science in high school but it’s too late. I took a fish and wildlife class and absolutely loved it. I’m going to community college to major in finnance, but I’m gonna take some classes like zoology and environmental science and possible change my major my second year. The only thing is, this industry doesn’t make a lot of money. I want be to able to own a home, have a family, and go on nice vacations but I need a stable and decent income for that. Does anyone know of any jobs I can start researching that combine environmental study’s/wildlife and math/statistics, with their salaries (California). I want to do something I truly love, instead of sitting infront of a computer all day, but I also want to make good money.",
    "score": 21,
    "url": "https://reddit.com/r/environmental_science/comments/1krse2i/passion_money/",
    "created_at": "2025-05-21T08:02:13.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1iu9dcx",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Graduated in 2022, am I screwed?",
    "text": "So I graduated in May 2022 with a BA in Env Studies (also minor is business and ecology) After graduating I looked for jobs for a little bit with no luck but I also realized I didn’t know exactly what area I wanted to focus on (science, policy, etc). So I decided to just bartend/serve, take some time to figure out what I want to do (which focus, grad school?), travel, etc before jumping into my career. I’m now 25 and searching for jobs in the field again. I’m currently serving as an Americorps VISTA (since August 2024) and I realized I hate it. I do a lot of event planning/coordinating, lots of emailing, reaching out to partners and organizations, etc. This made me realize I really want to focus on the research or ecology side of Env Studies. I really enjoy math and science and also excelled in those courses during college. Am I screwed since I graduated in 2022 and don’t really have much experience? Should I go to grad school? Any advice is helpful please! ",
    "score": 21,
    "url": "https://reddit.com/r/environmental_science/comments/1iu9dcx/graduated_in_2022_am_i_screwed/",
    "created_at": "2025-02-20T21:06:08.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1leffkr",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Environmental science",
    "text": "Greetings everyone,\n\nWhat advise will you give to a person who is just starting a career in Environmental Science  at 40 years. What job pathways will be suitable to the age.",
    "score": 19,
    "url": "https://reddit.com/r/environmental_science/comments/1leffkr/environmental_science/",
    "created_at": "2025-06-18T12:09:34.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1nt2e5s",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "How long did it take you to go to school?",
    "text": "I am 27F, recently laid off from the construction world and am interested in going to school specifically for environmental science. My local community college offers an associates degree in ES but it would take 3 years. Is this normal? Although my husband and I can afford me to take off of work to go to school full time, I dont think I want to spend that much time for just an associates degree. The other local colleges dont offer an ES degree so my only other option is online (I haven't looked into this yet - any recommendations?). \n\nMy friend said some programs, associates or bachelors, take longer than others. Is this true? I have never been to college so this is all very new to me. I mainly want to have a realistic understanding of what and how long school is going to take.\n\nMy end career goal is to work the construction side of environmental science, which the job market in my area seems okay. Im in Colorado. Thank you in advance! I love the work you all do.",
    "score": 18,
    "url": "https://reddit.com/r/environmental_science/comments/1nt2e5s/how_long_did_it_take_you_to_go_to_school/",
    "created_at": "2025-09-28T23:03:33.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1igeuoy",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Which environmental science job should I pursue?",
    "text": "I'm a highschooler who wants to plan ahead for my career/college degree. I'm interested in pursuing environmental science, but biology and history are also interesting topics to me. I want a job that I enjoy that also allows me to make good money so I can survive and have a nice life. I'd prefer a job that isn't too monotonous , I'd like maybe a mix of working in the office and working in the field. I like working with a group of people but I also like doing individual work. I'm good at math and science classes, and I can solve problems but I also excell at memorizing facts. What job should I pursue in the environmental science field? All help is appreciated. Thank you  ",
    "score": 17,
    "url": "https://reddit.com/r/environmental_science/comments/1igeuoy/which_environmental_science_job_should_i_pursue/",
    "created_at": "2025-02-03T02:39:45.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1jttmu9",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Help me to not fuck up my life",
    "text": "Im currently 16 and i really want to study Enviromental Science as i love geography and maths and aparently this is the blend of both, i just want someone to tell me what they actually do and maybe other possible careers involving both maths and geography.\n\n",
    "score": 17,
    "url": "https://reddit.com/r/environmental_science/comments/1jttmu9/help_me_to_not_fuck_up_my_life/",
    "created_at": "2025-04-07T19:15:55.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1j2865g",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "I need advice for college regarding environmental science",
    "text": "I want to get into environmental science as a college major. But online and with people I talk to in person, it seems like a major that could either go terribly wrong or very right in the future regarding careers. So, be honest, is environmental science as a college major a waste of time? What are your thoughts? Should I pick another major instead? ",
    "score": 17,
    "url": "https://reddit.com/r/environmental_science/comments/1j2865g/i_need_advice_for_college_regarding_environmental/",
    "created_at": "2025-03-03T02:20:25.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1p03u8s",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Do I finish my Envi science degree?",
    "text": "I’ve been working towards a degree in environmental science for the past 3, almost 4, years at my community college. I’m in my first semester at a big research university after just transferring… and I absolutely HATE it. I never thought I could hate my degree, it’s been my dream field since I was a kid, but university has been crushing me with steel spiked boots. I can’t stand going to lectures, turning in assignments, or studying. My grades are great, but I’m not actually learning anything or feel any passion left. Not to mention the career outlook for this field has plummeted in the US with this administration. The career I’ve been passionate and excited about all my life has brought me to a horrible pit of depression and despair. I’m already 22 with only a junior level in credits, and I also need to pay the bills so I’m itching to just get a career started already. Has anyone gone through this, and does it get better? Should I look for a different career path at this point? Any advice is appreciated, sorry for the long rant and thank you if you’ve read this far.",
    "score": 16,
    "url": "https://reddit.com/r/environmental_science/comments/1p03u8s/do_i_finish_my_envi_science_degree/",
    "created_at": "2025-11-18T05:36:20.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1ltpa83",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Anyone Else Studying Environmental Science Without Knowing What Comes After?",
    "text": "Hi, I’m an incoming 2nd-year Environmental Science student. To be honest, Environmental Science wasn’t my first or even second choice when I entered college. I didn’t really know anything about it, and based on what I’ve seen so far here in the Philippines, it’s not a field that’s given much importance—parang konti lang yung job opportunities at hindi rin siya ganun ka-prioritized. So right now, I honestly still feel lost with what I’m taking. I’ve tried researching on Google, but I still feel like the information I found isn’t enough. I keep wondering: After I graduate, what job can I actually get? What kind of career path is available for someone like me in this field?",
    "score": 15,
    "url": "https://reddit.com/r/environmental_science/comments/1ltpa83/anyone_else_studying_environmental_science/",
    "created_at": "2025-07-07T09:00:26.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1l9kiku",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Is it realistic to travel the world for work with a degree in Environmental Sciences?",
    "text": "Hi everyone,\n\nI’m a high school senior from Italy with a background in economics and marketing (technical high school, not science-based). I’m very interested in enrolling in a bachelor's degree in Environmental Sciences or Natural Sciences.\n\nMy dream is to work internationally, traveling to different countries to study ecosystems, territories, or biodiversity — doing fieldwork or research related to nature and the environment.\n\nI have a few questions and would love to hear from anyone with experience in this field:\n\n* Is it realistic to make a living doing this kind of work?\n* Are master's degrees or PhDs necessary to work internationally and do fieldwork?\n* What are the most common jobs for people with this kind of background?\n* Can someone with a non-scientific high school education (like me) succeed in this field, with effort?\n* Any master’s programs you would recommend, especially those with a strong international or fieldwork component?\n\nThanks a lot for your time! Any advice or shared experience would be hugely appreciated 🙏\n\n\\#ecology #career #student #international #fieldwork",
    "score": 15,
    "url": "https://reddit.com/r/environmental_science/comments/1l9kiku/is_it_realistic_to_travel_the_world_for_work_with/",
    "created_at": "2025-06-12T11:53:49.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1l92nah",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Need help figuring out what to do with my Environmental Science BS",
    "text": "Hi, I'm graduating next year with a bachelors in Environmental Science with a field analysis concentration. I wanted to add on a GIS minor, but my advisor said it was too late to add it. I plan to get my Masters or PHD in geosciences or environmental dynamics but I need a job first lol. I'm very interested in doing field work/research, urban planning, and climate change work/research. My question is what do you guys think the best profession to go into would be for this? My advisors don't really help me out that much when it comes to finding a career. Anyone think getting a GIS certificate would be helpful? I really want to do work outside doing tasks such as land surveys, water testing, soil analysis, and other tasks of the sort. Any advice is greatly appreciated! Thank you!",
    "score": 15,
    "url": "https://reddit.com/r/environmental_science/comments/1l92nah/need_help_figuring_out_what_to_do_with_my/",
    "created_at": "2025-06-11T20:03:21.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1l7ll2l",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Australian job progression",
    "text": "I’m interested how did your career progress with a bachelors of enviro in Australia ? What sorts of money did you earn and how quickly did you climb the ladder? ",
    "score": 15,
    "url": "https://reddit.com/r/environmental_science/comments/1l7ll2l/australian_job_progression/",
    "created_at": "2025-06-10T00:49:25.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1jk2vch",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "I want to pursue a career in environmental science or engineering",
    "text": "I'm currently a sophomore in high school and I already know I want to go into environmental science and be a scientist or engineer. I've always loved science and math, and I'm very interested in this subject. I was wondering, what classes should I take the rest of high school, what extracurriculars should I do (I am already looking into starting an environmental club at my school!) and just overall advice? ",
    "score": 13,
    "url": "https://reddit.com/r/environmental_science/comments/1jk2vch/i_want_to_pursue_a_career_in_environmental/",
    "created_at": "2025-03-26T03:42:00.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1j33nmr",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Equivalent of a \"Wedding Planner\" in the Ecology/Environmental Science field?",
    "text": "Update: Thanks to everyone who replied, I do want to add something. It's not necessarily that wedding planner was my ideal job, and that I'm stuck in the opposite industry. It's more that I think I would be a very GOOD wedding planner with my skills of organization. But my passion is conservation biology and restoration ecology. Heck, my \"dream\" job would either being a lemur researcher in Madagascar (not happening) or a wildlife rehabilitator (hello -4k salary a year... no thanks). So since I want to make money, I need to choose a line of work that still is within the environmental sciences, but that I can use skills I know I'm good in, such as planning and organization. Having dyscalculia and being in a Master's Biology program has been a challenge, so I'm just trying to find the ideal job for me!\n\n**ORIGINAL QUESTION**: Has anyone had success curating/finding an event planner personality as a good skill for certain ecology careers? In another life, a wedding planner I would be. But with my upcoming degree in Biology/ENVSCI and my passion for habitat restoration, is there a career in Natural Resources/Ecology/Biology I may not be aware of that exists that would satisfy that Checklist/SOP/Event planner urge? That makes a minimum of 70k/year? Super curious!",
    "score": 10,
    "url": "https://reddit.com/r/environmental_science/comments/1j33nmr/equivalent_of_a_wedding_planner_in_the/",
    "created_at": "2025-03-04T05:25:18.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1iyfd4a",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Advice for my Career (Fisheries biologist major in Idaho wanting to move to Alaska)",
    "text": "Hello, I am a high schooler that will likely attend the University of Idaho and major in Fisheries Biology. I love Idaho and fisheries is my passion but my dream has always been to move to Alaska. I would have gone to college there however their fisheries education programs are mostly online and I didn’t want to do that. Does anyone know if it would be possible for me to still move to Alaska and have a job in fisheries there even though I studied completely different species, ecosystems and environments in Idaho? If so what would it look like for me and how would my salary look (not that I’m very interested in making money I’m just curious).",
    "score": 7,
    "url": "https://reddit.com/r/environmental_science/comments/1iyfd4a/advice_for_my_career_fisheries_biologist_major_in/",
    "created_at": "2025-02-26T04:35:38.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1kdcnsq",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "Careers in Environmental Science/Sustainability? Need Advice!",
    "text": "Hi! I am a freshman in college right now and unsure about my current major in education.\n\nAfter this upcoming fall semester, I will have my minor in education completed and be halfway done with a certificate in sustainability.\n\nI’m in a sustainability club at my school and absolutely LOVE it. I love feeling like I’m making an impact and learning about how to be more sustainable and sharing it with my friends and family. I am also passionate about sustainable fashion and have always wished there were ways to combat the fast fashion industry\n\nIs there any jobs any of you know about that I could work in some type of sustainability/environmental science field but with fashion brands possibly advising them or trying to find scientific ways to lessen carbon footprint or improve clothing production/quality?\n\nIf so, how easy is it to get a job in this area and what is an example of a salary?\n\nI like science, math, working with other people, graphic design, and educating others. I could switch to a major in environmental science, environmental engineering, and possibly add on a minor in textiles &amp; apparel management.\n\nAny advice appreciated 😊",
    "score": 7,
    "url": "https://reddit.com/r/environmental_science/comments/1kdcnsq/careers_in_environmental_sciencesustainability/",
    "created_at": "2025-05-02T21:41:09.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1ksuixd",
    "subreddit": "environmental_science",
    "soc_codes": [
      "19-2041"
    ],
    "title": "help for environmental science",
    "text": "hello guys i am currently doing a bsc with major in environmental science and was just thinking about jobs prospects and how environmental science industry is job wise, do you enjoy it, how’s salary and career progression \nwhat specifically would you recommend working in environmental science. \n\n And would a masters of environmental science be worth doing as i feel a bit lost and been trying to find and internship for few months the but nothing here for me in Australia so far. any advice would be appreciated.",
    "score": 7,
    "url": "https://reddit.com/r/environmental_science/comments/1ksuixd/help_for_environmental_science/",
    "created_at": "2025-05-22T16:06:04.000Z",
    "num_comments": 17
  }
]