[
  {
    "id": "reddit-1ia1xct",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "My Team Is Going to Cabo And I Wasn’t Invited",
    "text": "My team (a group of men except me) did really well last year. As a reward, we get a 4-day team trip. This is the first year since I’ve been here where a trip has been offered. The trip this year is to Cabo. I was so excited until it became clear to me that I wasn’t invited. The Managing Director of that team (the executive I directly support) never outright told me I was or wasn’t invited. But has already booked flights, hotels and activities for the rest of my team members. \n\nYesterday afternoon, I received that Managing Director’s expense report to review and forward and all of the airfare for my team (and their plus one’s) was on there. It’s against company policy to seek reimbursement for future travel and instead of coming to my desk to tell me to my face that I’m not invited, he pushed back on my denial of those line items and asked me to push it through “because it’s $11,000”. \n\nI’m hurt, embarrassed and sad. Do I just try to let it go? I’ve cried so much. I left my previous job at a law firm, supporting a CEO, in-part because of the accepted and normalized segregation. I get along with my team members and we socialize in and outside of the office. I thought I was apart of their team, but it’s now clear that I’m not. \n\nETA: other teams at my company include their EA’s in everything. The trips are actually part of their recruitment in the hiring process. \n\nWhen I refer to “my team”, I’m not referring to senior leadership. I’m referring to my peers. \n\nETA 2: The trolls have found this post and are making themselves known and that’s okay. I think everyone needs to take a step back and recognize everyone has individual experiences in their places of employment. I don’t presume to know how your companies are structured and I wouldn’t expect you to know mine. There also seems to be a fundamental (purposeful) misunderstanding of the profession as a whole and I suspect that comes from misogynistic prejudice. \n\nI’ve clearly hit a nerve with some of you. The bottom line is that my work is both impactful and valuable whether or not I have your permission to say so. Just because YOU don’t respect the profession, doesn’t mean everyone else doesn’t need to. The reason a lot of the EA’s feel unsupported and destined to be excluded from well-deserved compensation is this mentality you try to force on us- that we are unskilled, unappreciated and unvalued. I never claimed to be all-powerful and all-knowing. But I will reject your claims that I’m not deserving of what others receive and I will always advocate for myself, my position, and for what is rightfully mine. I really hope others can do the same in their jobs or at home- wherever your work is. Women (who I think the majority of commenters here) are taught early on to not make waves by advocating for themselves. That reinforced belief serves a purpose. Don’t listen to that voice. You matter, your work matters, and you deserve everything everyone else deserves. ",
    "score": 2281,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ia1xct/my_team_is_going_to_cabo_and_i_wasnt_invited/",
    "created_at": "2025-01-26T00:54:47.000Z",
    "num_comments": 418
  },
  {
    "id": "reddit-1o36g6n",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "LABUBU Emergency",
    "text": "This is ridiculous. I’m an EA for a HNWF and work for gen 1 and gen 2. They’re not usually this high maintenance, BUT today must be an exception. I need a LABUBU. By Monday. In Chicago. \n\nHere’s the thing, I’m (me, husband and kid) about to go out of town for the weekend.\n\nDoes anyone a) know how to get one (the popmart stores in Chicago don’t have any) b) have one they want to sell me in Chicago. \n\nThis is ridiculous. 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\n\nUPDATE: As per a suggestion here, I called Oakbrook Popmart and they suggested calling a local toy store and they had several to pick from. I bought two over the phone and my G2 boss picked them up on his way home! He texted me “you saved my life! Again!!”\n\nI do a fair amount of PA stuff for them because they pay me well and are generally pretty low maintenance, but sometimes you gotta get the new Harry Potter book I guess! 😂😂 \n\nI’ve done some weird shit for them but this is close to the most ridiculous. The worst was when one of them dropped their phone down an elevator shaft. As they were leaving the country. 2 days before Christmas. 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\n\nTHANKS YALL BEST GROUP IN THE UNIVERSE!!!!\n\nEdit #2: also so sorry to leave everyone hanging! As soon as I got this figured out we immediately left town and we just got to our weekend destination!",
    "score": 1395,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1o36g6n/labubu_emergency/",
    "created_at": "2025-10-10T16:56:45.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1izs90l",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "For the love of god, write thank you notes after an interview",
    "text": "A recruiter was just prepping me for a final round interview (Fortune 500), and she said “and I love that you’ve been sending thank you emails, it’s such a nice touch!”\nI responded with “….doesnt everyone?”\nShe said 80% of her candidates don’t. \n\nFor the love of god, if you are job hunting and want a job, please please please send a thank you after every single round. It goes so far and takes minimal effort. I just plug the notes I took during the interview into ChatGPT and then edit what it spits out. It takes me less than 10 minutes. I know it feels old school, but I’m not suggesting you hand write and snail mail a letter here. \n\nRant over. \n\nEdit: she was a dedicated EA recruiter. So that means 80% of EA candidates aren’t writing thank yous. ",
    "score": 1038,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1izs90l/for_the_love_of_god_write_thank_you_notes_after/",
    "created_at": "2025-02-27T22:22:02.000Z",
    "num_comments": 200
  },
  {
    "id": "reddit-1iuofc2",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "It happened again.",
    "text": "I had such a long, stressful day yesterday.  I was on at 6:30 am until about 6:45pm. I turned my phone off and crashed at 7:45pm. \nThis morning,  I wake up to a text from boss sent last night.  Check your email.  I checked it this morning and he's asking me to check flights for him at 8pm, because he's not going to make his flight.  UGH! I just now emailed him explaining that I was dead tired and asleep and asked him how he made out.  I didn't get a response,  yet. \nThis role is getting too much.  I don't understand why they feel the need to just intrude on our lives like this! After hours,  be a grown up and handle it yourself.  I did have one executive who actually took care of rescheduling his flights after hours without bothering me. Unreal!",
    "score": 937,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1iuofc2/it_happened_again/",
    "created_at": "2025-02-21T11:08:03.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1i1nm0b",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "I lost my apartment in the Palisades Fire ",
    "text": "I was the only person from a firm of 30 people that lost their home. The managing partner I work for has been super kind while the CFO has doubled my work load and has been asking me to work through nights to finish data logging for Q4 bc she’s behind. In general has been dismissive of my situation from the moment I left the office to run home and grab my dog. \n\nIt’s honestly shocking! Starting up the job search ✌🏻\n\n\nEdit: Wow, I’m honestly blown away by all the support and advice you’ve shared. I originally posted just to vent, but now I’m following so many great suggestions I’ve gotten in the comments. I can’t thank you all enough for restoring my faith in humanity and giving me the push I needed to start looking for something better. You’re all amazing! ❤️",
    "score": 903,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1i1nm0b/i_lost_my_apartment_in_the_palisades_fire/",
    "created_at": "2025-01-15T02:41:40.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1ioso7w",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Laid off, but my exec expects me to still work. Am I in the wrong for saying no?",
    "text": "I was laid off on Monday due to budget cuts and was told I would be paid for two weeks, and only needed to work a few hours over a day or two to help teach and delegate my duties. \n\nI went in the office Tuesday and went through my list of reoccurring tasks and taught them to my colleagues that were taking them on. When I was wrapping up, my exec asked me to go put gas in their car &amp; to pickup their (stay at home) spouses  prescription. For the first time, I told them no and it felt so damn good. \n\nYesterday I was called at 8:00am and asked to watch emails &amp; texts for 2 hours while they were at an event. This I did, however when I was asked to do it again at 6pm while they were at a dinner I said no. \n\nThis morning, I get another call from my exec at 8am and I don’t answer. I immediately get three texts back to back asking me to find and forward past emails to someone. I respond telling her which folders those emails are in and who they’re from but did not send them myself. \n\nAgain this afternoon I get a texting asking me to bring lunch &amp; pick up/drop off a rug to their house, I said i wasn’t able to but really wish i didn’t reply at all. I immediately get a call (that I did not answer) and a voicemail telling me how disappointing I am for not being a team player and they apparently lined up an interview up for me with a big name in our industry, but doesn’t think she can go through with it with due to my new attitude. \n\nAm I in the wrong? I don’t feel that I’m obligated to do personal tasks since I have been laid off and it was never in my job duties to begin with. I have done everything i can to help prepare my team to take on my tasks and have remained polite &amp; respectful when declining to do something (it is not uncommon for my exec to blacklist people from our industry for crossing her). In addition to this, I was told my termination won’t be communicated to/processed through corporate until the end of the two weeks I’m supposed to be paid through. I’m worried i won’t receive that if i don’t continue to do everything asked of me but that’s honestly a risk I’m willing to take. \n\nI felt free for the first time in a long time when I was let go. My exec “jokingly” told someone I was more of the help than her staff (?) and now, after being fired I’m supposed to be a team player? \n\nI don’t know if I more so needed to vent or need advice more. I guess I’m just curious, would you handle this differently? Am I doing too much or not enough?\n\n\n",
    "score": 794,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ioso7w/laid_off_but_my_exec_expects_me_to_still_work_am/",
    "created_at": "2025-02-13T20:27:40.000Z",
    "num_comments": 131
  },
  {
    "id": "reddit-1jbfm7f",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "I HATE the food aspects of this job",
    "text": "I hate ordering food, picking up food, organizing food, having lunch meetings and dealing with coordinating food sooo much. Don't even know why it annoys me so much. I know it's part of the job and none of the other personal-adjacent tasks bother me except this one -- I've even pretended to be her and called her Doctor for her with no issue! Plus we have several cafeterias on site and my boss insists on buying me lunch every time I go out for her, but I'd honestly rather starve then go. I don't even like going out to get my own food and will eat from the snack table before getting my lazy self up. \n\nIt's cold, it's raining, I'm starving, and my boss waits until 10mins before my scheduled lunch to ask me to go get her food. \n\nCould sense it coming actually and went to the bathroom hoping she'd go herself. Tried to sneak into the kitchen and heat it up (\"oh no, I already started my lunch teehee!\"). Nope, my grand-boss's EA made sure to stop me before I even got to the fridge. I sighed so loud she apologized (I'll never forgive her). I looked so annoyed that a couple ppl asked if I wanted them to pick it up for me. No, I just want her to get her own lunch.  \n\nThen there's this expectation for me to always offer my boss food or fix her plate at catered events. My grand-boss's EA is constantly whispering to me \"did you make her a plate? Does your boss want some of this? Did you ask your boss if she wanted you to grab something for her? Do you want to make your boss a to-go bag\" No?....I simply assumed as a full grown woman with functional arms and hands that she could do it herself. \n\nThis is my only pet-peeve of the job and it's so silly but just needed to vent\n\n",
    "score": 737,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1jbfm7f/i_hate_the_food_aspects_of_this_job/",
    "created_at": "2025-03-14T22:01:12.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1itam41",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "I was fired yesterday 🥲",
    "text": "As the title says. I had been with this company for almost three years. They had never had an EA before so I brought a lot of knowledge with me.\n\nI had a huge personal setback a few months ago (I lost everything I own) so admittedly I had been a bit distracted, but still showed up in-office every day, was cheerful, etc. The work got done (I would regularly send email updates with progress etc. if my execs were too busy for our catch up calls). I launched many programs for the company and had just held our kick-off charity event for our fundraising initiatives. I’m so confused why this happened. \n\nI was truly so caught off guard and did not see it coming at all. There wasn’t even much for them to say except highlighting how my positivity will be missed in the office. One of the 3 execs I work for is also leaving the company of their own accord, so I wonder if that has some influence on this decision.\n\nThey’re still giving me my bonus as well as 2 months pay. It will all be okay. I just don’t know how to navigate interviews in the future with being fired. I don’t know how to explain this and I’m just feeling insecure. \n\nThat being said… if anyone is hiring. 🥲",
    "score": 688,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1itam41/i_was_fired_yesterday/",
    "created_at": "2025-02-19T17:08:47.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1jchuqv",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "QUITTING FEELS AMAZING!",
    "text": "I'm quitting my job as an EA at a fortune 100 company. After spending the past 9 months working 60+ hours a week with no help or backup (and I've asked repeatedly for help) for a boss with a HORRIBLE reputation, she just gave me my first appraisal (yes, after 9 months). She told me I don't keep up with her demands and though she doesn't know if she can ever find someone who can, she's going in a different direction with her administrative support. (She IS correct that I don't keep up. The office is traditionally a 2-EA office, and it's only me doing both jobs). Her plan to keep me employed on the team was to demote me to support a different executive. I personally don't care about my title, and the other executive would be wonderful to work for, but I don't want to continue working on her team of chaos and negativity. Imagine her surprise when I told her thanks but I QUIT 😁 her face - it was priceless! She absolutely could not fathom that an EA would choose her own path and destiny! Now she is scrambling to backfill me and has less than two weeks before I leave. \n\nI've spent 25+ years as an EA and make great money, but money is not worth my physical and mental health.\nI'm using this opportunity to relocate and make drastic improvements to my health. I'm absolutely thrilled to be heading into the unknown! It's a new adventure and long overdue.\n\nI hope this encourages anyone reading to consider doing what works best for them, and that courage is greater than the comfort of a \"career\".",
    "score": 685,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1jchuqv/quitting_feels_amazing/",
    "created_at": "2025-03-16T09:35:54.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1iifixg",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Just quit while on an overseas business trip - what a mess!",
    "text": "Going anonymous due to my hugely embarrassing behavior.\n\nThis summer I left a good job for a phenomenal offer elsewhere (like 35k more). I felt like I could do the job with no problem. Unfortunately, pretty much from the day I started, I felt totally lost and in over my head.\n\nSome of it, I attribute to an executive that didn’t communicate and an EA that barely trained me, but most of it, I think, falls solely on me.  Specifically, the hormonal shifts occurring during perimenopause and the resulting brain fog and exhaustion from difficultly sleeping.\n\nThe fact is, I have been forgetting things. I am getting easily overwhelmed, and my performance isn’t what I would expect or hope to be.  \n\nTo cope with the misery at my job and knowing that my boss and his team think I’m an incompetent idiot, I have been spending all of my free time sleeping and stuffing my face, which, not surprisingly, has resulted in a 30-pound weight gain in just about six months. \n\nOK, so that’s the background. This week I’ve been on a business trip in Germany (I’m US-based) and I screwed up something else again in a team meeting. At this point I started to panic and I got up and left in the middle of the meeting and sent my boss an email in the middle of the day resigning. Now I’m stuck in Europe for the next 2 1/2 days until I can go home.  Note that I do not have another job lined up, although I do have six months of emergency savings.\n\nI wish I were a candidate to take hormone replacement therapy, but I’m not able to because I have a highly elevated breast cancer risk.\n\nSo here I am - no job (single, so no partner’s income to offset my job loss), no reference from this job, 30 pounds overweight, exhausted, brain fog, ashamed, hiding in a hotel room in another country until I can fly home  - if this weren’t so god-awful, it would be funny. So here I’m languishing in a sh*t stew entirely of my own making.  \n\nI think I’ve made this post partially to unburden myself from this secret because it’s eating me up inside, and also I’m hoping that some of you stellar EAs have been in a similarly awful situation and and came through it ok. \n\nTLDR: have been continuously f-ing up at a job I held for 5 1/2 months with fabulous pay due to perimenopause-induced brain fog and exhaustion. Just quit while overseas on a business trip.\n",
    "score": 641,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1iifixg/just_quit_while_on_an_overseas_business_trip_what/",
    "created_at": "2025-02-05T17:29:58.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1otsxn5",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Gave notice - and guess what happened next!",
    "text": "The VP who was recently promoted to my region and became my boss (clock watcher - micro manager) decided to bring me into a meeting today with HR to make my notice effective immediately and he'd pay me through the week. I think he thought it was punishment, but it's a week of paid vacation before I start a new job (oh no!) He's the only one who looks like an asshole here, because my team loved me. I had an email in my personal inbox by the time I drove home, several texts, and a phone call, not to mention the linkedin connections.  ",
    "score": 602,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1otsxn5/gave_notice_and_guess_what_happened_next/",
    "created_at": "2025-11-10T23:00:32.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1lpev3q",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Resigned. I'm done.",
    "text": "Not just done with my current role, I mean done with the profession entirely.\n\nBefore anyone reacts, I know there are those of you who absolutely love your job, are highly skilled in it and fly with it. This is not an attack, if anything, I envy I couldn't be you.\n\nThis is just about me.\nFell into this with two degrees in politics and international relations from a world leading London university. Really did just take the first graduate job I could get to pay the rent and get going in the adult world. \n\n13 years later, 37 years old, and I am so stressed that I wake up with nail grooves in my hands, I jump at the slightest noise, I wake up worried, I turn on my laptop worried.\n\nThe never ending expectations have worn me down. Always with hyper, exaggerated urgency from often psychologically disordered people, who often say and do ridiculous things, yet are paid 3 or 4 times my salary. \n\nCouple that with insistence you juggle 500 things at once, only to be sneered at and have your entire skillset and performance taken into question when you inevitably drop only one of those things.\n\nAnd there's nowhere to go! Fine, some EAs manage to transition, or climb... but very few in my experience. It's without a doubt one of the toughest roles in the corporate world and yet the most undervalued. Which I'm sure it wouldn't be, if more men were doing it.\n\nI've also come to learn that maybe I'm just not good at it any more...? I owned it in my 20s, but now approaching 38, I just really, really don't care about your diary. Oh, you have to have that 1-1 now?? RIGHT NOW? It's extremely urgent and we'll all die if we don't get it in?\n\nAaaaand then it's cancelled.\n\nI'm so tired of prioritising someone else's day, career and life over my own. I'm continuously advancing someone else, yet stuck where I am.\n\nMy skills lie in events management. This is probably the one thing I'm grateful this profession has given me, that experience. Offsites, All Hands, Conferences, large scale Xmas parties, team building days, I've done it all. I love seeing people enjoy themselves, I love venue and vendor research, choosing space, choosing menus, and love seeing a project come to fruition. It's stress with a reward.\n\nSo. I'm going into events management and hospitality. If it means taking a pay cut, fine. I'd even work in a nice gastropub at this rate. Nothing is worth this worry.\n\nRant over. I feel better now just writing that.\nFor those excelling at this, continue to excel! Wish I could have been you from the start! You're just a lot hardier than me.",
    "score": 534,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1lpev3q/resigned_im_done/",
    "created_at": "2025-07-01T22:03:04.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1ihxhn7",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "It finally happened, but I'm not \"terminated\"...I'm \"reclassified\"",
    "text": "UPDATE: today I got a last minute meeting with HR to give me a verbal warning for violating company policy for not sending out a birthday email (i usually send them out for all employees) and also for violating WFH policies because I only told HR i had pink eye and would be home/camera off, and my CEO did not approve this. Isn't that just great? Now they're saying if i have one more violation they'll fire me with cause. \n\n\n\n\nLong time coming, since I asked for a raise in October and then took disability leave in December. \n\nShe knocked my hours down to 20 a week, no benefits, no health insurance, in-office 830 to 1230. It's literally going to cost me more to work. Because of child care. \n\nOh and she knows I'm going through a divorce, have no help/support/tons of legal fees. \n\n\nAnd she wouldn't just terminate me. She genuinely thought I'd quit. She even asked me to spend the next two weeks making a guide for my replacement. I said, \"so I AM being terminated?\" And of course it's no no no definitely not terminated. \n\nShe just doesn't want me to be able to apply for unemployment. The whole thing disgusts me. So I'm putting in minimum effort until she finally does terminate me, or I find a new job. \n\nCue every recruiter and family member ever sending me links to jobs (like I haven't been applying to 10+ a day since last year. \n\n\nUgh what a day. My soon to be ex was of absolutely no help, and I gave to hand my 2 year old daughter over to him tomorrow. Alone for 5 days. Should be plenty of time to job hunt right? What a day. ",
    "score": 533,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ihxhn7/it_finally_happened_but_im_not_terminatedim/",
    "created_at": "2025-02-05T00:44:10.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1j8rfei",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "CEO stood up for me",
    "text": "Small warm and fuzzy moment\n\nLet me set the stage and give a quick cast\n\nThere is \nMyself - asst director of finance/office manager\nThe EA\nCEO \nDoF\n\nWe are in the thick of conference prep for our big one this week on top of a board meeting at the end of the week that’s in office. I have kept a TIGHT schedule to stay ahead of schedule. It has been a magnificent feat but I did it I’m hella proud. I’m ready for it all.\nMy CEO took notice :)\nSo the last of the printables are completed all while I am cleaning the espresso machine (oh yeah I’m the office barista on top of it all). The EA is in final detail meetings, CEO is on the phone with other CEOs about the conference, you know doing all the boss lady thangs.\n\nCEO gets done where phone call she lets a big ass sigh out and goes ladies we are done shut it down the week is going to be crazy, we are done for the day. Let me tell you this never usually includes me. My director has this inane fear of someone coming to the door and no one being here- we aren’t open to the public. So I am here to open and close it. We had an ice storm highways were shut down and my DoF was still trying to figure out how I could get to my office that is 27 miles from my home. Anywho, my CEO called my director and told her I was going home with everyone it was not PTO it was just free hours and there were no ifs ands or buts about it. \n\nShe told me she sees the hard work I do and she feels terrible I am often excluded on the early releases and she will make sure that it doesn’t happen anymore. \n\nYall it was a good day. ",
    "score": 493,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1j8rfei/ceo_stood_up_for_me/",
    "created_at": "2025-03-11T14:00:40.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1ikdpu0",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Equity in company",
    "text": "Today my boss called me at 8am. He told me 2024 was the worst year our company ever had (downsized shared services, outsourced payroll and IT) and now that we are getting back on track he awarded me with a small, but generous amount of equity in the company and said thank you for sticking by his side and he hopes I stick around a lot longer. I was shocked. As much as I hate my job some days and feel like all I do is pester people to get shit done, this made my day. I just had dinner with a girlfriend and still feel giddy about it. I just have to share the news with other people who work their asses off too to understand my excitement. I’m very thankful.",
    "score": 445,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ikdpu0/equity_in_company/",
    "created_at": "2025-02-08T03:18:54.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1iaqi3v",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Forgot me",
    "text": "This is just a rant and I’ll probably delete later but wanted to share.  \nMy team had a happy hour when my manager’s boss was visiting and we all talked about this great burrito place nearby that the boss hadn’t ever tried. They decided we’d get burritos the next morning so he can try them and have a little team breakfast. When I was leaving my manager says to me “don’t be late tomorrow, I’m picking up burritos” which I thought was a nice change from my previous manager, who would once in a while just randomly decide to get burritos for everyone and I’d literally wake up, be getting ready for work and log on to find my team all individually sending me their orders without any context (to have to dig and find that my manager had told everyone to send them to me for me to pick up on my way in).  \n\nSo I get into work the day after the team happy hour and my manager comes in with a bag from the restaurant and says to me “oh, I didn’t think you were coming in today” and gives everyone a breakfast burrito except me! Even though the night before I had responded “I’ll be in at 8:15am.”  \nNot only did he forget me, but the rest of the day he made snarky comments to rub it in like “you really missed out.” I was stunned…he was acting like I did something to deserve “missing out” like I was late or didn’t show up. What a fucking dick move.   \nThis to me was so beyond rude because I have always taken care of my team (12 people) in every way, especially when it comes to meals. I’ve sent in their orders with very specific modifications, walked to pick up, handled the expense, etc. I’ve organized countless happy hours, lunches, dinners, everything…and the one time my manager handles it himself, he forgets me. Made me feel really special that day!",
    "score": 443,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1iaqi3v/forgot_me/",
    "created_at": "2025-01-26T21:10:22.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1k6bwfb",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "I deleted Administrative Professionals Day off their calendars",
    "text": "I hate this day and I don't like the attn so I deleted from my bosses' calendars. \n\nI did what I did. \n\nEdited to add: I don't like the attn and, personally, the very last thing I want is for my boss/bosses to take me to lunch. A nice car with a gift card would be fantastic. \n\nMany years ago, my boss and his boss decided to take me and his EA to one of the really nice exclusive restaurants in the park. It was totally fine until I got a terrible stomach ache and had to use the restroom IMMEDIATELY. I excused myself and went to the restroom. A few mins later, the other EA comes to check on me!!! OMG how mortifying!!! How do I explain I just have to poop it out and I'll feel better to MY BOSS AND HIS BOSS. UGHS. Never ever again. I've learned my lesson...just delete the damn thing from their calendars. Takes the pressure off them and myself!\n\nSo for everyone who is worried about how their gift was received, pls don't worry about giving your EA a card and a gift card/cash/gift. Just don't take them to lunch and give them a stomach ache!!!! ",
    "score": 436,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1k6bwfb/i_deleted_administrative_professionals_day_off/",
    "created_at": "2025-04-23T22:08:32.000Z",
    "num_comments": 105
  },
  {
    "id": "reddit-1octhkx",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "I wish I was joking, but this really happened.",
    "text": "So not so funny story.  I plan, coordinate and execute events at work.  Usually they are 2x a year.  I did one  this time last year, and one in May this year, and another next week. It's a multi-day event for 60+ employees with , hotel rooms, meals, booze, entertainment and employee rewards.  It's a ton of planning and I work 6-8 months out.  I negotiate, meet with hotel staff, and work my tail off.  It's the one thing I love about my job.  I had an event in July of this year - one I don't normally do, but since it was in my region they asked me to plan, coordinate and execute. I did all the planning, including invites, rooms, meals (allergies) coordinating, &amp; I traveled and met with staff on location 2 weeks out.  And I shit you not, a new PM came in 2 weeks before the meeting, and said I wasn't needed anymore, and that she and the admin on location (who had not been part of any planning) would be taking over the execution of the event.  They took it over, and there was nothing for them to do except be feet on the ground and show up and follow instructions already put in place BY ME.  I didn't get a thank you for all your hard work, good job, nothing.  I recently find out this OTHER admin who was simply THERE, is getting rewarded with a trip to for all her HARD work for that meeting.  Seriously.  I am speechless at how ridiculous it is.  I'm sure it didn't hurt that she's young and attractive and sweet, but guys she didn't have a fucking clue and she's getting an all expense 3 day trip paid.",
    "score": 435,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1octhkx/i_wish_i_was_joking_but_this_really_happened/",
    "created_at": "2025-10-22T00:11:55.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1jyxftl",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Got nosy and saw something I didn’t want to see",
    "text": "\nLast week I knew my boss was having a meeting about the policy for provided lunches within the company, the budget for them, whose responsibility they are etc. I had a feeling they were going to try to push this onto me. I have a hybrid schedule and was worried this might cause me to have to come into the office more. Today I saw the ai notes from the meeting in my bosss email and I was anxious to know what they decided and read through the notes. I did not like what I saw. Basically one person was saying they knew I wouldn’t be happy about picking up large catering orders and my boss responded with something along the lines of “too bad, this is her job and she should be grateful to work here, and if she doesn’t want to get off her ass I can pay someone overseas $7 to do her job, and I don’t care”. I was honestly really shocked to see them talking about me like this. I have been at this company for over 4 years. I have a good relationship with my boss. I do everything I’m asked without complaint, and regularly even offer to do more. I’ve never once been talked to about my performance, and get yearly raises. It’s really disappointing and disheartening to hear this is what he thinks of me. Not to mention it makes me fear my job could be taken away at any given moment since they clearly don’t value me. I don’t know what to do at this point. I have been mostly happy with this job. I know I could be payed more as an EA at other companies as I see the job postings. But I’ve never tried to leave because I value liking my job vs more money. I was planning to buy a house within the next year, and also obviously things in the world aren’t exactly at great place right now which may make the job market rocky. I know I probably shouldn’t have even looked, but I did and now I know. I just don’t know what to do. I want to cry and feel worthless. How would your proceed from here?",
    "score": 418,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1jyxftl/got_nosy_and_saw_something_i_didnt_want_to_see/",
    "created_at": "2025-04-14T12:18:37.000Z",
    "num_comments": 179
  },
  {
    "id": "reddit-1kstkd1",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Guys I did it, I'm done, I'm out!",
    "text": "I've been an EA for 8 years and have had serious burn out the last year or so. I had trouble connecting with my new execs, wasn't given any constructive feedback, and worked at an org where another EA literally just walked out never to be seen again. I lost my job in April and was DEVASTATED at first.\n\n  \nBut..... \n\n  \nI realized the job was killing me and I was miserable at it. After a long hard introspection I'm changing career paths completely (at 34!) and will be spending the next year taking pre rec classes for nursing school and hopefully getting into an accelerated program sometime next year! Any leads on pt work while I'm studying welcome!",
    "score": 299,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1kstkd1/guys_i_did_it_im_done_im_out/",
    "created_at": "2025-05-22T15:27:27.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1pkso84",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "I think I figured out the WHY behind EA burn out…",
    "text": "Nearly every female EA I know (ones that choose this as a longer term professional career in particular) are either on the verge of severe burn out or in a series of burn out “cycles” (me being one of them).\n\nI have been really thinking hard on this lately because for some reason, this year in particular, has felt particularly acute with the the burn out attributes of exhaustion, despair and disengagement - why is that? I think I have peeled back the onion layers and possibly gotten to the core…\n\n“Responsibility to Other” overwhelm\n\nWhen you look back over your life (especially if you come from non-stable, chaotic or monetary volatile environment via your younger years), our lives are literally 100% dedicated and sliced up to support and be responsible (in a myriad of ways from the mundane to the critical) to literally EVERYONE ELSE EXCEPT OURSELVES (and even worse, the majority of women I know have very little external support to reciprocate any of that responsibility back).\n\nWe already get crushed by this in our personal lives (partners/spouse, kids, our parents, animals, schools, community, general unpaid labor cultural constructs etc) - adding on our work responsibilities to this (where LITERALLY our job is to prompt offload of responsibility from our Executives!) is the straw that breaks the camels back. \n\nThe more insidious unspoken and unconscious part that we don’t even realize is happening is the internal back chatter of “Will this responsibility to EVERYONE ELSE EVER END?!”  and for many of us, as we look at the path in front of us, the answer is murky enough that we truly aren’t sure, and the burn out emotions amplify. \n\nHow many of you fantasize about running away from EVERYTHING and just being by yourself and living a super simple life because you KNOW, that if you were only truly responsible to ONLY YOURSELF, that you could live off of quite little and be content- because moreso than money, you crave FREEDOM FROM RESPONSIBILITY TO OTHERS, and want to just be responsible to yourself.\n\nThis is what I believe is the true underlying core of our burn out culture in Administration - our talents of being responsible to others is not only placed on steroids, but it is expected of us In perpetuity.\n\nUntil we begin to start chipping away at our own behaviors that make this cultural/professional underlying expectation stick, the cycles, the pain, the burn out will remain.\n\nDo I have answers on how to do this? Not yet, but damn it, I am starting to try… \n\nI SEE YOU ALL - here is too a hopeful shift for each of us.",
    "score": 298,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1pkso84/i_think_i_figured_out_the_why_behind_ea_burn_out/",
    "created_at": "2025-12-12T14:03:39.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1iuya5w",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Well, it’s happening",
    "text": "Despite giving 110% in a new position within an organization I’ve been with for 25 years, “they” don’t think I’m a good fit. \n\nI won’t be out of work immediately but I need to get out of here for my sanity and physical health. \n\nThere are no open positions where I am that wouldn’t mean taking a 20-25% pay cut. I can NOT afford that. \n\nI hate to leave my benefits, retirement, and generous vacation, but I’m going to have to. \n\nAmazing how one person can utterly derail your life. \n\nIf anyone knows of an open EA or EA type position in greater Philly…\n\nGod, I feel sick. \n\nUPDATE: First, thank you all for your support and leads. \n\nHR is working on another position and seeing if they can up the salary to more of a 10% - 12% cut as opposed to 20%. At least I’d keep my benefits, banked sick time and vacation days. \n",
    "score": 273,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1iuya5w/well_its_happening/",
    "created_at": "2025-02-21T18:43:47.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1mq9l15",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "This is not an easy job.",
    "text": "Every time someone who’s having a hard time finding a job in their current field comes here and says, “I’m thinking of transitioning to be an Executive Assistant, what do I need to know” I just want to laugh. \n\nLike, I know on the surface it seems easy, like “oh I’ll just help people,” but this job takes a LOT of balancing and finagling and depending on the role, technological aptitude. I was a receptionist / admin assistant / sales analyst for fifteen years before I got this role. You can’t just give up on your dream career and decide to be an executive assistant. I mean, good luck to all of you that try, but there are a lot of EAs out of work right now who are fighting for those same positions.",
    "score": 259,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1mq9l15/this_is_not_an_easy_job/",
    "created_at": "2025-08-14T18:53:19.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1j1tzqi",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "heartbroken over passing of EA colleague",
    "text": "For much of my career, I never really met any older EA's who were very friendly, kind, and genuinely wanted to see me exceed in my position. A year ago this changed for me. She was the first person who interviewed me very sharp, very smart, very talented. I found out a month ago that she had marched into the CEO's office after speaking with me armed with my resume, and told him this is the one you need to hire. From the day I started, she was always there. A team's message away, a phone call away anything I needed she was there. I had come on with no background notes whatsoever on the role, and she didn't have much on it either, because she was supporting a different executive in a diff area and my predecessor had been abruptly dismissed. But she helped me every step of the way going above and beyond. In fast time, we became very close friends. Despite the age difference, we didn't feel it. We loved each other. We enjoyed talking with each other and we laughed with each other on so many things. \n\nThen in the fall, she abruptly became ill and needed to take medical leave. We kept in touch, mostly through occasional text messages. And we spoke, I think once or twice, but she kept saying she was hoping to return and everyone at the company really missed her and was rooting for her to come back. The last time we messaged was in late january and I honestly thought I would get a chance to speak with her once more. No one had heard from her in a while.And then devastated her husband let us know that she had passed away recently. I have never been through this before. I've never been close to colleague in the way that I was close to her, and I never had them pass away suddenly. The gap that will be left with her absence will be forever. She was such a kind bubbly, positive smart Intelligent person who made everyone love her and respect her at the same time.\n\nShe represented what an executive assistant should be efficient, highperforming, outranking in intelligence in many ways the executives that she supported. \n\nI know so many times in this group we see frequent posts about being bullied by older eas and I went through it much of my career.In fact, I am grateful that I told her she was the first one that wasn't a bully, that was kind, and a great friend, and i'm so happy I did.\n\nI really loved her and I will love her forever. It's a sad time, and i'm so grateful for this group to be able to write this post and share. RIP to a great colleague and even greater person and friend. ",
    "score": 255,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1j1tzqi/heartbroken_over_passing_of_ea_colleague/",
    "created_at": "2025-03-02T15:57:02.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1oka77k",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "OK with being \"just\" an EA",
    "text": "Im so tired of seeing how many EAs talk about career progression and how to be \"seen\" and recognized for everything we do beyond arranging seamless travel and managing inboxes and calendars. Im a career EA. Im older (50s) and have no desire to develop in to a Chief of Staff or Senior Business Administrator or whatever other BS title people want to give themselves. I fully respect people that want to \"grow\" and blah blah blah... but I love what I do (not my current role because my boss is a Class A Jerk) but i dont want to be a \"strategically minded\" EA or anything else. Looking for another job now and there's no such thing as a traditional EA any more. Maybe a sign of the times, maybe the youngsters are more ambitious, maybe im just a dinosaur thats set in my ways. Rant over. Thank you!",
    "score": 220,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1oka77k/ok_with_being_just_an_ea/",
    "created_at": "2025-10-30T20:06:36.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1mu2ols",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Putting in my notice!",
    "text": "I’m signing a job offer and putting in my notice! I feel bad to leave the two execs I support, but the CEO is a mean b and refuses to give me an annual raise or salary adjustment even after promoting me. This new job has all green flags and it’s a 13k salary increase with much more holiday and PTO. Eeeep",
    "score": 179,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1mu2ols/putting_in_my_notice/",
    "created_at": "2025-08-18T23:51:30.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1k6zb12",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "My exec is taking credit for my work in company-wide emails",
    "text": "I've been debating whether to post this for weeks because I don't want to come across as petty, but it's really starting to get to me.\n\nI've been with my current exec for just over a year. Initially, I thought I hit the jackpot – they seemed supportive, appreciative, and understood my career goals.\n\nAbout three months ago, they asked me to draft some process improvement proposals. I spent weeks researching, creating documentation, building flowcharts – the works. I was proud of what I put together and excited to contribute something meaningful beyond calendar management.\n\nMy exec reviewed them, gave minimal feedback, and then... sent them out to the entire company under their name. Not even a \"with support from\" or \"thanks to.\" The email literally said \"I've developed the following processes\" and \"my approach to solving this problem.\"\n\nSince then, it's become a pattern. Presentations I create, reports I compile, even the internal newsletter I write completely on my own – all go out with \"From the desk of \\[Exec Name\\]\" with zero acknowledgment of my work.\n\nYesterday was the final straw. I overheard them in a meeting with the CEO taking full credit for a major project reorganization that I single-handedly developed. They're actually getting a leadership award at the quarterly meeting for MY work.\n\nI know being in a support role means sometimes staying in the background, but this feels like blatant plagiarism of my professional contributions. I'm building zero professional credibility despite doing work well above my pay grade.\n\nHas anyone successfully navigated this situation? I genuinely like other aspects of this job, but I'm starting to feel invisible and used.",
    "score": 159,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1k6zb12/my_exec_is_taking_credit_for_my_work_in/",
    "created_at": "2025-04-24T18:18:02.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1kbeakq",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Salary Info?",
    "text": "I found salary info for my boss and his partner. It was in a document I needed to review so I had a right to view the info, but I’m feeling quite unsure of how to process this. I found out that last year he made $5MM and his partner made $3MM last year. They both close the biggest deals in the company, work essentially 24/7, and put a lot of equity into the company in the beginning. Just struggling because I’m making about $55k/year and was told they couldn’t give me much of a raise because of budget cuts… I can acknowledge that they work more than I do (while I do the jobs of like 2-3 people still), they make more organization level decisions, etc. but I know most of my peers are making less than that as well and most didn’t get raises. Am I right to feel miffed by this? Do you have any advice about how to deal with this? I obviously can’t use the info in negotiations. I’m just wondering why they couldn’t sacrifice $100k to make sure their people are paid really well. TIA! \n\nEdit: I live in a major TX city, I have 3 years of experience being an EA, bachelor’s degree, I work for the CEO, and we’re a small company. Again, I don’t have a problem with the fact that he makes way more than me; it seems very disingenuous to say “we don’t have money in the budget for good raises this year” when he makes that much money and a lot of the entry level and mid level employees are living hand to mouth. He uses the excuse that we are a small company to say that he’s paying fair market value. \n\nHe has told me that if I can get more certifications, that he’ll give me a more substantial raise and went along with my project to get the company an education program. I’m working on my PMP, so I’m hoping that will help come December. He’s not a bad guy, just really out of touch with what good pay rates are these days. He seems to think we pay really well, when in fact we don’t. Ive brought research that suggests otherwise, but he uses the fact that we’re a small company as his argument that we do. \n\nI think I’m going to stick around and see if my PMP actually makes a difference, throw all of my facts at him, and if it doesn’t make a difference I’ll start looking elsewhere. I enjoy this company’s culture and this job, the only thing that sucks is the pay rate. Thank you everyone for your insights, I really appreciate it! ",
    "score": 157,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1kbeakq/salary_info/",
    "created_at": "2025-04-30T11:39:16.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1j8tsmf",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Just got married, now I’m being replaced",
    "text": "Hey everyone,\n\nI wanted to share a bit about my journey. Last week, I got married, and it was an amazing experience! After a short honeymoon, I returned to work, only to find out that I’m being asked to train a replacement for my role.\n\nTo give some background, I work as an Executive Assistant for an American company, and I was placed with one of their clients, a well-known Hollywood actor. Initially, I was told that my role was to manage his schedule and provide proactive support. However, after adjusting my work style to be more in line with his preferences, it turned out that the expectations changed. Despite my efforts to adapt and provide the best support, I was informed that my role was coming to an end.\n\nI’m currently in a transition phase and open to new opportunities in the Executive Assistant field. I’ve gained a lot of valuable experience and am eager to continue growing in my career.\n\nThanks for reading, and I’d appreciate any advice or connections from this community!",
    "score": 153,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1j8tsmf/just_got_married_now_im_being_replaced/",
    "created_at": "2025-03-11T15:44:25.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1jjz738",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "The worst part about being an executive assistant is that EVERYTHING that goes wrong is our fault.",
    "text": "I love being an executive assistant, supporting a team and making shit happen. I’m 7 years into my career, started at the bottom now we’re here! BUT \n\nEverything that goes wrong is my fault. When my boss &amp; the team I support fails to do their job, it looks like I’m the one failing. I just need to vent. And maybe see if I’m completely alone in this feeling or if this is a common theme amongst people in our role.\n\nFor example,\n\nWhen I’m the one who is responsible for getting a contract turned in, and I don’t, it makes me look bad. What they don’t understand is that I have asked my boss to sign it so many times &amp; he’s legitimately incapable. They don’t see me sending emails to remind him I need this fucking thing signed. That I walk up to him to talk about it in person. That I’ve gone to him every morning for 2 weeks straight telling him “I need this by end of day” and he says “oh yeah I’ll get it to you…” and never does. I will even baby him. I will walk into his office with a pen and stand over his shoulder trying to get him to sign the goddamn line. “Oh well I need to read it first, I’ll do that today.” And then he doesn’t. They don’t see any of that. What they do see is that *I* have failed my duty to get this contract turned in on time &amp; I am at complete fault. \n\nOr when I need to make a $50,000 purchase and the vendor is hammering me, and our accounting office is hammering me, yet my boss has been sitting on an email with the quote that I need approved for a month. They see someone who’s unable to do the very simple task of creating a purchase order. What they don’t see is me asking him 20x over to reply to the email with the fucking word “Approved.”\n\nToday, one of our industry partners emailed someone 3 levels above my boss that they are thisclose to ending our partnership because they’ve needed something notarized for the past 7 months. Who’s the one that is getting flipped the fuck out on by my boss’ boss’ boss’ boss? Me. Who had no idea this was floating around? Also me. \n\nSo I tell her “hey let me look into this &amp; I will get back to you.” And then I receive 5 more emails &amp; 3 chat notifications within 30 minutes asking me what the fuck is going on. I don’t know bitch, I wish I did! \n\nThe emails she sent in this 30 minute window were forwarded emails from our partner. They were dating back to September with this partner asking us to notarize this document that *everyone and their mother* is on except for me. I swear I sat there for 5 minutes looking at the forwarded email, that I very clearly was not originally on, wondering why tf they’re so mad at me about this. So then I hunt down my boss &amp; he’s like yeah I don’t know. Figure it out.\n\nSo a) you told me I am not supposed to have anything to do with this partner at all previously (he’s micromanagy about this one partner) and b) now you’re telling me to figure something out that I have no idea who the contact is, who signs what &amp; what they even need from me. It enrages me that HE didn’t even know what was going on but expects me to. \n\nThese are just 3 examples but I had to vent. I absolutley hate that as an executive assistant, our name is on everything, everything is assigned to us and ultimately we are responsible for it. I swear I feel like I am my boss’ boss 90% of the time. I’m just so, so frustrated. \n\nAlso I used the word boss in those examples, but only the contract one was my direct superior, the other 2 were from other team members but they’re still above me so it was easier to use the word boss. Everyone on my team is incompetent as fuck. And it’s one thing to be incompetent, it’s another to drag me down with you!\n\n",
    "score": 151,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1jjz738/the_worst_part_about_being_an_executive_assistant/",
    "created_at": "2025-03-26T00:36:12.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1p33gkt",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Executive Assistants not Invited to Holiday Party",
    "text": "  \n\n\n\\*\\*\\*Edit: Thank you all for the replies. I don’t feel so alone now. I think it stings because, as I said, other internal support partners who assist the TM / DMs were invited. They are the same career level and pay grade as the EAs, so what gives! Now, they are field employees versus us being remote, so I guess that’s it. \n\nIf it were just the TM and DMs, I wouldn’t think twice about it. \n\nAlso, I should say that my three DMs always include me at their End Year gatherings. And I’m not expected to help plan. I just show up along with their team and enjoy. Two of the DMs frequently ask for my feedback and opinion when making decisions. So, I know I’m valued at the DM level.\n\nMaybe this whole thing just caught me on a bad day. \n\n—————————————————————————————————\n\nI work for a large, national company in the US. For context, here is how we are structured. We have a Territory Manager who has her own, personal EA, and then 9 District Managers, in which 3 EAs each support 3 District Managers. I’m one of those EAs. I get along great with all 3 of my DMs, and often support them in the field and live, at Meetings, even though my role is technically remote. In fact, all of three of my DMs often brag and say to the others that they “won the draft and the lottery” with me.\n\nAnyway, I learned that in two Fridays, our TM is hosting a Holiday party at her home for all 9 DMs, as well as other, internal support partners that assist she and the DMs in different capacities. The EAs, even her own EA, were left off the invite. I learned of this as one such internal support partner asked if I was going, to which I was clueless and literally said I wasn’t invited. She awkwardly laughed. Then, on a Conference Call, another internal support partner awkwardly said to cancel all Calls for that afternoon because he and the other partner will “be in an all day Meeting.” I say awkwardly because I could tell he was choosing his words very, very carefully.\n\nIf I’m being honest, I wouldn’t have attended, anyway, as it’s an hour drive and my spouse and I have plans early that same evening. But, it still stings for some reason. I‘m on the same level, career-wise, as these internal support partners, and thought I was respected and valued as such, but I guess I’m not. Unsure how the TM’s EA feels or my peer EAs. I assume they saw the invite on everyone’s calendar.\n\nJust a rant. I love my job, but sometimes there’s that smack of reality that we’ll always be considered less than, despite all our contributions.",
    "score": 148,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1p33gkt/executive_assistants_not_invited_to_holiday_party/",
    "created_at": "2025-11-21T16:40:46.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1nm8pzr",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Love my current job, but was offered role that is ~60k more",
    "text": "TLDR: received an offer for 170k + massive equity, but would rather current employer match the offer and stay- how do i address without being offensive/seeming ungrateful. \n\nhere we go: \n\nI have an incredible gig. What started as an EA gig has turned into (after two promotions) a jr CoS position. While my responsibility has grown, my executive doesn’t want to trust anyone else with his calendar and email, so i still maintain 360 support over him. He is a very good boss- CEO/founder. Treats me extremely well, and i know i am very valued. \n\nAs i’ve leveled up, my salary has grown from 90k to 110k and anticipated (we’ve discussed) to grow again at EOY. I also carry a modest equity package that i plan to negotiate higher at that time. \n\nAn old manger from 5 years ago is now head of people at another start up (i love start ups). She was also an incredible manager who treated me very well. She is offering me an executive business partner role with a short track to Chief of staff, starting at 170k with an impressive equity package that blows my current one out of the water. \n\nI did not seek this job out, in fact i told her no several times,  but she kept upping the salary- she really wants me. I am flattered. \n\nThe con: i would be supporting the CEO/founder at this new start up and apparently he is not always easy to deal with. Her words (and i really believe she would be straight up with me) is that he means well and is nice guy, but sometimes his emotions take over… “he always apologizes”. \n\nI’m not exactly scared of this- i have had monster bosses before, and idk, i’m good at not taking things personally. Start up founders, especially, can be very impassioned- it can take a lot to wrangle them. \n\nHaving said all of this, if my current company were to match this offer (or even come in just below) i would probably stay, as its better to stay with the “angel” you know than the devil you don’t. If my company cannot match, i would really consider the move. In my state, it amounts to roughly $3k more a month after taxes and 401k.\n\nMy question: how do i address this offer with my current employer without it being offensive/greedy/seeming like i am backing him into a corner — i know, a job is a job and this is part of it,  but i cannot stress how much my current situation rocks. \n\nThank you! ",
    "score": 117,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1nm8pzr/love_my_current_job_but_was_offered_role_that_is/",
    "created_at": "2025-09-20T20:30:04.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1izl64p",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "What is it that helped our execs get so much further than we have in our careers?",
    "text": "I have been having a bit of an existential crisis about my career for years now. So much so, I decided to step away from my career to raise my son for 2 years because I couldn't see a path. \n\nNow I am back in it, and my exec is incredibly flawed as a leader and I can't help but wonder what skills did she have to get her to this level in her career? On this sub we complain all time about our execs not reading emails, or answering emails, not being able to help themselves (i.e. be resourceful), and their general bad behavior and attitude. Obviously, there are many leaders this does not apply to but my question still applies.\n\nWhat skills DO they have that helped them climb the ranks?\n\nI have been doing a lot of introspection on exactly what am I actually capable of doing in my career and how do I show it so I can move up. Personally, I have no interest in the corporate world, my studies are in public administration and I work for a state university so the pay is obviously not great. To be where I want to be I would have to climb to Director of Admin Services at least. But I find myself questioning if I am even capable of that, do I have the personality for it, do I *want* to actually do that work? Maybe it's imposter syndrome mixed with my aversion for capitalism...but I am curious what you all have noticed as traits or skills your leaders had that helped them get there and/or do well in their careers? ",
    "score": 98,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1izl64p/what_is_it_that_helped_our_execs_get_so_much/",
    "created_at": "2025-02-27T17:24:16.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1huu6gt",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "How to handle telling boss his wife asks too much…",
    "text": "I am EA to a UHNWI. Long term career and really good at my job! But this has me stumped! 🙈😅\n\nBoss travels a lot, family travels with him, and one of the job descriptions (not worded exactly) is whatever makes him happy and his life easier… this includes making sure the family is looked after. Which I’m totally fine with and completely understand. Until she takes it too far… nail appointments, buying her hair/face products (a lot of ordering things online), and once she even asked me to empty the dishwasher…… (which I did NOT)\n\nHow do I have the discussion that it’s too much? I understand we’re in a unique situation in his life and it won’t last much longer… but another year of this is too long. \nHe’s mentioned it before and acknowledges that I handle A LOT, and if it ever gets too much, I should say something… but how do you say “your wife is using me as her personal assistant” without sounding like you’re not a team player, can handle a heavy workload etc\n\nI guess I have an issue with sounding like I’m the one that’s the pain in the ass and can’t do my job. \n\nTo my friends the answer is very simple, but hoping other assistants might understand why I’m struggling with this…",
    "score": 93,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1huu6gt/how_to_handle_telling_boss_his_wife_asks_too_much/",
    "created_at": "2025-01-06T08:06:02.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1m23tjc",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Why do we always have to be the friendly, perky type?",
    "text": "I have been called out in my career for not being  \"friendly enough\" or not \"perky enough \" and I have seen some complaints here regarding the same.  Why us, though?\nHere is an example.  I was in the hallway with a fellow admin chatting, and one of her jr bankers walked by. The admin said hello to her. The jr banker barely spoke back to her her. No smile, no nod. It was an inaudible hello. The admin said  I have fixed her messes and do so much for her and I know she's unfriendly,  but I  speak to her anyway. \nI barely get a hello if any from my jr and senior executives, but why do we always have to be the friendly, perky ones? Most of them are not, so if they aren't friendly towards me, why should I make the effort? Sure, I am professional,  but if I see you in passing,  and you continue to avoid eye contact to not speak,  I am giving it right back at you. One thing mama didn't raise is a button kisser. ",
    "score": 90,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1m23tjc/why_do_we_always_have_to_be_the_friendly_perky/",
    "created_at": "2025-07-17T10:18:20.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1iv7392",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Response to Low Pay Recruiters",
    "text": "I live in a very high cost of living area in the US where EA pay is incredibly low. I work for a major employer and was hired at cap ($68,000), no bonus, no raise since my first day years ago. The wages here are just awful but I love the area so I deal with it. (I moved here from the south where I along with other EAs made $90-$100k). Lately I’ve noticed recruiters from the major area employers going lower and lower. Normally I would not respond but offering someone with 12 years C Suite EA experience $24 an hour ($50,000) for three directors is so insulting, get out of here… Sad thing is this is a major company everyone would recognize 🙄",
    "score": 88,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1iv7392/response_to_low_pay_recruiters/",
    "created_at": "2025-02-22T01:25:01.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1ovcbp4",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "My previous employer wants me back",
    "text": "I left my previous job because of the pay. I loved the company culture, my executives, and the teams I worked with. I’m still friends with many excoworkers and really miss working there. I have been with my new employer for about 3 months and the culture is terrible. The other EAs are moody and very territorial. And, the rest of the office is very uptight and not at all inviting. Well, last night I got a call asking me to go back to my previous employer. They said they would pay me more than what I’m making at my new employer so not only is the salary better, I love the company. I know that this is the right move for me but I am not sure how to approach the situation. I never expected this to happen but I am so happy it did. My new employer used a recruiter to hire me so I feel bad for leaving but I have to keep reminding myself that it’s a business. They have no loyalty to me. How should I handle my resignation and am I making the right decision? ",
    "score": 85,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ovcbp4/my_previous_employer_wants_me_back/",
    "created_at": "2025-11-12T17:58:36.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1ow9syo",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "*Trigger Warning* EA friend having thoughts of self harm due to CEO behavior",
    "text": "I couldn't sleep last night. I have a headache today. I am sick to my stomach with worry. I'm feeling helpless.\n\nYesterday, I came to work and said good morning to our CEO's EA (who is also my best friend). She looked awful. Drained. Pale. Sad. She looked defeated. This from an EA who has such a big personality and has enough confidence to share and still beam with it. She's a career EA, raised her kids as a single mother (no help from the donor), has a special needs child -- who will always live with her. Needless to say, she is a tough as nails, strong woman.\n\nI asked what was going on, and she told me she did not get out of bed Thursday of last week through Tuesday of this week (no shower, barely ate, crying). Neither of our bosses were in the office so I sent her a text and asked if she wanted to ditch work and go share a bottle of wine and talk. What she told me had me in tears and seriously scared for her.\n\nA little background on the situation: she's had some amazing executives and some not so amazing. One that actually threw a phone at her but this current exec is by far the worst person she's ever worked for. This executive plays mind games with her, is always pissed off at her, doesn't say good morning, slams her door. Slowly beating her down. Making it 500% harder to do her job. She's not allowed to ask clarifying questions, she's not allowed to talk to anyone (not even the other EAs), she's not allowed to leave her desk unless it's to get something for the executive. The exec accuses my friend of not coming into the office at all (my friend is typically in the office 4-5 days per week normally and encouraged all the EAs to do the same) when at best the exec is here 25% of the time--and they are not travelling for business. Constantly accusing her of gossip (when the exec is the one who tells everyone everything) -- and maybe on the surface that does not seem anything out of the ordinary for a difficult exec but it gets way worse and I won't go into detail. Most of the tactics this exec has pulled is mind-blowing even for an asshole. There are not enough adjectives in the world to describe what an awful human being this person is.\n\nAbout two months ago, my friend went into the exec's office to review calendar, and a moment later I heard the CHRO go in there. And then my friend came out of the office in tears. I asked what was wrong and she said I'm not allowed to say. I found out later that she been fired, but told she could stay with the company until we get our bonuses at the end of the year, because out of the goodness of the executive's heart, they were allowing my friend to stay because of her home situation (exec actually said this).\n\nI knew all of this was happening because my friend confides in me every day. I knew she was getting increasingly worried about finding another job that allows her to make as money as she does now.\n\n\\*Trigger Warning Begins Here\\*\n\nAs we were discussing why she was in bed for 5 days, literally paralyzed (but still responding to this disgusting human), she at first admitted to me that every day she hoped that something would suddenly happen to take her life (auto-crash, heart attack, cancer, etc.). As we continued talking she admitted that she was so depressed and feeling hopeless that over those 5 days in bed she was trying figure out a way to painlessly do self-harm to end her own life.\n\nWe had a long talk about how she is so loved and so cherished and she is a proud mama to her amazing kids. That every part of her being is full of life and joy. We talked about how this piece of shit executive does not have her permission to make her feel the way she is feeling and to take her self-worth and her confidence. My friend is so gorgeous that people literally stop and stare at her (think Scarlett Johansson look alike) and she doesn't even know it.\n\nTogether, she and I made an appointment to talk to a mental health professional about her self-harm ideation and what caused it. Her kids now know so she has a full support system behind her to get her through this.\n\nMy friend is working from home the rest of this week as it makes her physically ill to be in the office and next week she has to be in the office 5 days to be with the asshole (early days to late nights), and I'm on vacation early next week and I can't be here to help should anything happen. No joke the exec text her this morning and said \"are you even working?\"\n\nI'm teary and shaking as I say this but I have to say it.  NO JOB, NO SALARY, NO COMPANY PERKS, NO STATUS, AND NO AMOUNT OF STRESS IS WORTH YOUR MENTAL HEALTH. NO OTHER HUMAN BEING HAS THE RIGHT TO TREAT EXECUTIVE ASSISTANTS (OR OTHER PEOPLE IN GENERAL) LIKE THEY ARE NOT WORTH AN OUNCE OF ANOTHER PERSON'S RESPECT AND HUMAN KINDNESS AND COMPASSION.\n\nIf anyone who reads this is so broken down because of how someone treats you know that you are LOVED, know that many people CARE about you, know that you are BRAVE, know that you can RECOVER from whatever it is.\n\nIf you or someone you know is struggling or having thoughts of suicide, call or text the [988 Suicide &amp; Crisis Lifeline ](https://988lifeline.org/) at 988 or chat at [988lifeline.org ](https://chat.988lifeline.org/). In life-threatening situations, call 911.\n\nThank you for reading and letting me express my worry about my bestie. She is everything to me.",
    "score": 81,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ow9syo/trigger_warning_ea_friend_having_thoughts_of_self/",
    "created_at": "2025-11-13T19:04:04.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1l3afzb",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Let the red flags fly!",
    "text": "For the past couple of months, I have been casually looking for a new position. I’m currently employed by a great company. Unfortunately, economic conditions have resulted in multiple layoffs in the past few months, so I have been keeping an eye out for new opportunities out of an abundance of caution.\n\nIt’s been a few years since I have actively had to look for a job and I had forgotten just how ridiculous some postings can be. Last month, I came across a job listing for an EA position supporting the CEO of a wealth management company. The ad was a real gem. It was a perfect example of what an unstable egomaniac might write in the middle of the night during an Adderall fueled fever dream. I’m sure some of you know exactly the type of job listing I’m talking about. It usually starts with something along the lines of:\n\n* ARE YOU THE TYPE OF PERSON WHO IS ALWAYS GRINDING, NEEDS ZERO SLEEP, AND CHEWS THROUGH YOUR DESK BY 7AM?!?!\n\n* DO YOU POUND 26 RED BULLS A DAY AND THEN AGGRESSIVELY CRUSH THE CANS AGAINST YOUR FOREHEAD WHILE MAINTAING UNBROKEN EYE CONTACT WITH YOUR SWORN ENEMIES?!?!?\n\n* CAN YOU DEFY THE LAWS OF PHYSICS ON DEMAND AND FORESAKE YOUR HEALTH, FAMILY, AND FRIENDS TO SERVE THE NEVER-ENDING WHIMS OF A PETULANT MAN-CHILD?!?!?!?\n\n* THEN THIS JOB IS FOR YOU…ALL FOR A MEDIOCRE SALARY THAT DOESN’T EVEN PAY THE BILLS!!!\n\nEven though I had no interest in the actual position, I sent my resume out of morbid curiosity. I put no effort into writing a cover letter or tailoring my resume and didn’t expect to hear back. I simply went on with my life and completely forgot about it.\n\n10 days later, I received a text message from the company COO stating that they were impressed by my resume and asking when I am available to come in for an interview. Under normal circumstances, this might be considered a good sign.\n\nEXCEPT THIS MAN SENT ME THE TEXT AT 4:17 AM!!!\n\nNo apology for texting at such an early hour. No explanation as to why he was texting strangers at a time when most people were sleeping. Just a completely oblivious and nonchalant attitude as if the text had been sent in the middle of the day.\n\nBelieve it or not, I decided to respond to this lunatic. I gave him the benefit of the doubt and thought that perhaps he was traveling and got the time zones mixed up or something similar. I waited until the reasonable hour of 10am and texted him a polite and professional response.\n\nRadio silence for another 10 days. Once again, I forgot about it...\n\n…until today when this lunatic texted me at 6:15am asking if I can come interview with the CEO tomorrow morning.\n\nStrike three, Dude. It felt good to simply delete the text message and block his number. Even more so because I had just accepted a great job offer from another company the day before. \n\nIf only all the unstable and boundaryless employers of the world were this easy to spot from the very beginning. Unfortunately, far too many of them hide their red flags until it’s too late.\n\nThank you, Kind Sir, for being so transparent and revealing just what an unreasonable lunatic you are. I’m sure you will eventually find the android or doormat that is right for you.",
    "score": 78,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1l3afzb/let_the_red_flags_fly/",
    "created_at": "2025-06-04T16:44:23.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1ichgjx",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Have you ever been written up?",
    "text": "https://preview.redd.it/mxwa74ifytfe1.png?width=484&amp;format=png&amp;auto=webp&amp;s=7dee11844e5df4ec8d95bc3141ea9aedd7bf4964\n\nOnce I told a coworker that she looked like Cloris Leachman. She got super mad at me, cried a little bit even. She told our boss and our boss wrote me up.  When we sat down to talk about it, he only knew her in present day (which was in 2012) when CL was in her 80's so he was not happy with me. I showed him the picture I was referencing, and he stumbled over his words and finally said, \"oh, she's quite nice. she does look a little bit like \\*coworker.\"   \nI still got written up, though. The reason was it was my fault my coworker didn't know of Cloris Leachman's earlier life/career.  \n",
    "score": 78,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ichgjx/have_you_ever_been_written_up/",
    "created_at": "2025-01-29T00:49:19.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1i8dm0w",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Severance questions",
    "text": "I got laid off today after 9 months with my company. The reason I am getting laid off is because my boss is retiring which was NEVER communicated to me during the interview process. My boss officially announced his retirement two weeks ago so I immediately followed up with HR on what this means for my role. I was told they would get back to me and when they didn’t, I followed up but was ghosted for two weeks until I received the news this morning. \n\nHere’s what they are offering… \n- 3 months severance \n- 3 months of health insurance \n- 3 months of resume &amp; career coaching \n\nI have never been laid off but my dad said this is very generous since I haven’t been there long. What are your thoughts? I want to be professional but also make sure I’m fully taken care of. Is there anything else I can ask for?\n\np.s. my boss told me to “enjoy my break” and “use my severance to go to Europe”lol ok how about I pay my mortgage instead????",
    "score": 77,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1i8dm0w/severance_questions/",
    "created_at": "2025-01-23T20:48:37.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1phl5zv",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Bombshell in phone interview",
    "text": "Just wrapped up an initial phone screening, my first since I started casually applying months ago. I did well and would be surprised if I didn’t get invited to an interview. HOWEVER. I asked a couple of questions about the structure of the position and the recruiter says “oh yeah, actually, this is for the second EA position. [President name] likes to have two EAs at all times and currently just has one.” WHAT?? This was NOWHERE in the job description. Nothing about the job description even vaguely raised a question in my mind, all the job functions of a normal EA and BoD support staff person are there and there’s zero mention of sharing responsibilities. I prefer to be a solo EA for many reasons so it appears this isn’t the job for me. Also, they seem firm on the salary range which is a bit lower than I need anyway. It’s just frustrating that I got excited about finally hearing back from a job only to feel like I have to take myself out of the process. Hoping 2026 brings more opportunities for all of us who are looking! 🤞🏻",
    "score": 75,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1phl5zv/bombshell_in_phone_interview/",
    "created_at": "2025-12-08T19:07:30.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1ltyc5r",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Billionaire Executive Assistant - Raise/Pay Question",
    "text": "I am turning 30 in August and started working as an executive assistant to a billionaire (net worth approx. $2-2.9B) out in Los Angeles about 11 months ago. I've been an executive assistant for about 8 years including this past (almost) year. \n\nBACKSTORY: Before I first interviewed, I was told by the recruiter that the starting pay range was $100-150K. However, the recruiter also said that I wouldn't be asked in the interview what I wanted to make, so I was focused more on crushing the interview as I had been without work for 4 months prior AND was coming from a completely different industry, so I felt like the cards were already stacked up against me. \n\nWell, in the interview, I was asked by my now-boss what I expected to make salary wise. I lowkey panicked and asked for the minimum ($100K) as I didn't want any thing to potentially sway against me. Plus, I was happy at the time because $100K was much more than I'd ever made before. \n\n  \nIn hindsight, I know that was a mistake as everyone afterwards said to always ask for the max. Work wise, I am quite often on call any time of the day (weekends and holidays are often hit-or-miss too) and plan so much private travel that I am practically a travel agent now. I also do a lot of misc. stuff for his family and work anywhere from 50-60 hours a week (my own time keeping for reference) and my \"Holiday Bonus\" was 1 weeks pay before taxes. Also, I *always* work through lunch too. \n\nNow the tricky part is that back in April (8 months into the job) - my company gave an all around 3-4% raise but I received a 17% ($17k) raise before taxes. Thus raising me to $117K annually including \"bonuses\". \n\nWhat's concerning is that some of my colleagues believe the previous assistant who was here for 1.5-2 years was making much more. I've heard rumors that the previous asst was making closer to $200K or more. However, nobody knows for sure and they also don't know if she was hourly or salary.\n\nThus, I am curious if AFTER the recent raise back in April, is it still appropriate to ask for an annual raise because with CA taxes, rent, gas, etc. I'm able to save $2-3K a month, but as a young adult trying to save up for a new car (still driving my first car from high school), potential house, future family, etc. - I feel it's still not enough unfortunately. \n\n  \nI don't want to seem ungrateful because I am *very* fortunate and try to remind myself that a lot of the time. However, I do feel like my boss is getting a steal currently at my rate and have been torn about asking for a raise after my 1 year mark - was considering something closer to $160-200K. \n\nI just want to know what any senior EAs or those working for  VHNI or HNWI's think. ",
    "score": 71,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ltyc5r/billionaire_executive_assistant_raisepay_question/",
    "created_at": "2025-07-07T16:14:10.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1la1jdg",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "awful experience talking about $$ with my new boss",
    "text": "hi everyone :)\n\nI’m dealing with a situation that is really getting me down. I think I know what I need to do but I came here to hopefully feel validated - or get other perspectives if you feel I should have handled this differently. \n\nI started working part time for a woman running her own business (very independently wealthy and the company is extremely successful). She needed help running her business and I was looking for a job that was far more involved than the typical EA job - this was it. \n\nI started about a month ago. Since it is only her, we didn’t discuss payment details other than an hourly rate which we agreed on via text. This week, she told me to give her my breakdown of hours worked and tax stuff and all that so she can pay me. She asked me what the rate we agreed on was and I reminded her. She asked if I could go lower and to come back with a new number. I was a little blindsided by that but I wanted to be flexible.\n\nSince the rate we previously decided on was low to begin with (we negotiated during that convo), I came back to her with an even lower number. I was disappointed but I wanted to be flexible since I was loving the job. She came back with an even lower number - over $10/hr lower than my starting point. This was a number I’ve never been paid even as an entry level asst - and now I have years of experience. I panicked and asked for a higher number…like $1 higher than the lowest offer. \n\nShe also wanted to cap my hours at 10 or under a week. She wanted me to let her know each week when I was approaching 10 and we would decide if I would work on things after that or not. I’ve never worked like that, I’ve always been salary or hourly with clear overtime rules. I said yes and started doing that.\n\nYesterday I hit 10 hours and let her know. She said ok that’s cool, thanks, etc. Meaning I was done for the week. Today she sent me a bunch of tasks to do. I asked her how we should handle this since I already hit my 10 hrs and she replied with, “[task] is really going to take you an hour to complete?” \n\nOf course not. It’ll take me 10-15 min. But…we didn’t discuss overtime, so I wasn’t going to do it without a plan for compensation for work after the 10 hrs a week. I’m too old for that bullshit. I know how that goes, I’ve done it, and you end up working for free. I was suspicious now, especially after being lowballed into oblivion. I said no, it doesn’t, but I just wanted to check to see how to handle work outside my set hours. She asked me what the “cost” of completing the task would be. I was like okay she cannot be serious. I did the math and it was $3.91 (I didn’t tell her that). Like…my god. We are both wasting time with this discussion.\n\nShe called me before I could answer that question and she was immediately annoyed and impatient (full 180 from her personality for the last however many weeks I’ve worked for her). She told me to come up with a solution but then very rudely offered to just pay me an hours worth for every “little task” if it “matters that much.” \n\nShe told me this was NOT a good time to have this convo and that she is stressed out beyond belief over this. I offered to talk tomorrow - no!!! We have to resolve it now or else she’ll be up all night!!! She talked in circles until she “came up with” a solution which was tallying every minute of my work even though we just said we were not going to do that. She said she needed to know I was okay with this before getting off the phone. I said I didn’t really understand the solution we got to, and I also did want to discuss the rate we agreed on at some point but now seemed like a terrible time and I’m more than happy to talk next week and not to worry about it - I really was trying so hard to calm her down and I was honestly a little scared as she had never acted this way before, she was entirely flipping out. She demanded we speak now because it would stress her out to wait (but also said she really SHOULD not be having this discussion now as she’s at the spa and needs to unplug - but SHE called me…). I told her I felt I agreed to a rate that is too low for me and cited our previously agreed upon rate. I told her I take responsibility for accepting the lower number but I wanted to see if there was an opportunity to talk about it. I told her my reasons why I felt I deserved higher (experience, previously agreed upon, already a lowball for me to begin with).\n\nShe took that as me saying I cannot do the job if I won’t get paid $XX (original number agreed to on text). She asked for the breakdown of 10 hrs at that rate and said I needed to be prepared if I’m going to have this kind of discussion. I was! I pulled up the spreadsheet I made and told her the numbers. She said she doesn’t want to pay me that. She said I could either do a lower rate and work more or work at this rate at 8 hours max and cause issues by not being available outside of that and always having to ask if I should work on stuff after my 8 hours.\n\nShe asked me to send her the breakdown of the numbers weekly and monthly and to send to her to mull over. I ended the convo by saying I really did not mean for this to be a hostile discussion and I meant no disrespect towards her personally. I said I really hope that my work/experience/value add is worth figuring this out - I really want to make it work and I hope we can. She rushed off the phone. \n\nSooooooo, I should run, right?\n\nUPDATE: Thank you guys all for your support, I teared up reading all the validating comments!! Of course, regardless of all that, I continue to second guess myself and gaslight myself!!! \n\nShe sent me the most specific and nit picky counter offer that does honor my rate but with an even lower number of hours - and with extremely specific terms that include me working on site for one hour on some days. No. I’m not doing it. I just haven’t told her that yet. I am working on a nicely worded message to tell her that the job has changed so much from the original conversations and it’s now something I’m not interested in. \n\nI’ll update once all that goes down! I already need a glass of wine and I haven’t even handled this yet.",
    "score": 70,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1la1jdg/awful_experience_talking_about_with_my_new_boss/",
    "created_at": "2025-06-12T23:43:47.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1md1y1t",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "What is your salary and where do you live? (mine is below)",
    "text": "I thought it would be interesting to see how we are compensated around the world. :)\n\nI live in Zurich, Switzerland and make 104k a year. Work for a big corporate in finance.\n",
    "score": 70,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1md1y1t/what_is_your_salary_and_where_do_you_live_mine_is/",
    "created_at": "2025-07-30T09:24:36.000Z",
    "num_comments": 224
  },
  {
    "id": "reddit-1ooryyj",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Laid off after 10+ years, single mom to 4 month old - seeking support",
    "text": "Hi everyone,\n\nI'm reaching out to this wonderful community during a tough time. After over 10 years with my company (a tax and accounting firm), I was laid off two weeks ago due to an acquisition. I'm currently navigating this transition while also being the sole parent for my 4-month-old, which adds another layer of complexity and anxiety to the job search.\n\nI spent the last decade as a Senior EA supporting C-suite leadership. I was way more than a typical EA. I was my executive's sounding board, trusted confidant, and basically performed his entire job for him. I also pioneered our firm's first AI automation initiative (which increased efficiency by over 50%) and led our employee engagement committee. I genuinely loved what I did and took pride in my role. I am still shocked at how callously they handled laying off half of our firm.\n\nIf anyone knows of openings, companies that are hiring EAs, or even just has advice for job searching with a little one at home, I would be so grateful. I'm also happy to connect on LinkedIn if that's helpful.  (I'm in San Diego but willing to relocate as far north as LA.)\n\nThank you for reading and for being such a supportive community. This career path can feel isolating sometimes, so it means a lot to have a space where people truly understand what we do.",
    "score": 68,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1ooryyj/laid_off_after_10_years_single_mom_to_4_month_old/",
    "created_at": "2025-11-05T03:13:02.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1njd6hb",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "There is an ongoing trend with companies up-titling AAs roles to EAs, and its going to create some serious problems",
    "text": "I'm always checking out EA roles (globally, as I can legally work in most places in Europe and N. America). The Administrative Assistant position seems to be slowly disappearing, not completely, but you don't see it as much as 10-15 years ago. \n\nI think there is a general trend to level up job titles to make positions more attractive, and attract better candidates, but when you have AA roles advertised as EA / Senior EA with basic administrative responsibilities and lets say only 1-3 years of experience is required, it devalues the role of an experienced career EA who does things like strategy, board, C-Suite gatekeeping etc\n\nResult? Oversaturated EAs market with lots of EAs on paper, diluted salaries and stagnant pay growth. Thoughts?",
    "score": 67,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1njd6hb/there_is_an_ongoing_trend_with_companies/",
    "created_at": "2025-09-17T13:28:31.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1hxxr0p",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Annual Review…Feeling Let Down",
    "text": "I have been with this company for 10.5 years. Every year I have had a good review and have been given a discretionary bonus. This year, my review I was rated as \"high performer\" but was only given 3.2% increase and no bonus. This means that, in fact, I will be making LESS this year than I made last year because my 3.2% is about a $3,000 increase and my bonus last year was $5,000. So to put numbers to that, my salary last year was $87,000 with a $5,000 bonus, so $92,000, and this year my salary is $90,000 with no bonus. I was so shocked and dumbfounded that I couldn't even find words to ask questions as to why. I had heard they were going to restructure bonus programs, but my position in another division had her review today and she said she got her bonus, so that tells me there is a very intentional reason I didn't get mine for the first time in 10 years. \nSo...how do I now go back and approach this with my manager? ",
    "score": 64,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1hxxr0p/annual_reviewfeeling_let_down/",
    "created_at": "2025-01-10T05:53:17.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1opjlne",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Are EA’s comfortable sharing their salary + state to compare compensation?",
    "text": "I’m not sure if this is allowed, but I think this is something we never talk about enough. How are we supposed to know where we stand if we never compare? Most of the salary sites online seem really inaccurate.\n\nI’m trying to figure out if I’m getting underpaid or if I’m in the right range. If you’re comfortable, can you share what state you’re in, who you support (C-suite level), and what you make?\n\nFor reference, I’m in Arizona. I support a CEO and make $86K a year. With year end reviews coming up I’m trying to get a better sense of where I fall.",
    "score": 63,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1opjlne/are_eas_comfortable_sharing_their_salary_state_to/",
    "created_at": "2025-11-05T23:57:37.000Z",
    "num_comments": 257
  },
  {
    "id": "reddit-1hrc98h",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Happy New Year to my Executive Assistant hive mind!",
    "text": "I come here seeking advice, tips, and tricks as a seasoned Executive Assistant who wants to approach this next chapter with a beginner’s mindset.\n\n**A little background:** I’ve been an Executive Assistant for over 15 years, primarily in the academic sector. In my last organization, I spent six years growing my career, transitioning from EA to a Special Projects/Operations Manager role where I managed an EA team. Unfortunately, I was laid off and have been on the job hunt for the past six months.\n\nInitially, I was aiming for middle-management or project management roles, but as many of you know, the job market has been particularly challenging. After shifting my focus, I recently landed a new Executive Assistant role, once again in the academic sector. While this position is more aligned with what I was doing 15 years ago, it’s a full-time, permanent role with a pension and many pathways to grow my career.\n\nThe only downside is that I took a $14k salary cut, but I’m focusing on the positives. I’ll be reporting to an Administrative Officer who has been with the organization for 22 years. We connected really well during the interview process, and it was clear that my experience in academia provides a strong foundation for success in this role.\n\n**Here’s where I’d love your advice:** I want to approach this role with humility and a beginner’s mindset. During the interview, the Director (whom I’ll also be supporting) mentioned they are looking to find process efficiencies. However, I want to tread carefully, especially since I have experience in areas that overlap with my new manager’s responsibilities. My goal is to build her trust and respect, staying “in my lane” while also making meaningful contributions.\n\nI don’t want to view this as a step back, but rather as an opportunity to refocus and rebuild. What advice do you have for navigating this transition? How can I foster a strong working relationship with my manager while staying mindful of the dynamics? I start mid-January and would love to hear your guidance on this :)\n\n",
    "score": 63,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1hrc98h/happy_new_year_to_my_executive_assistant_hive_mind/",
    "created_at": "2025-01-01T20:54:21.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1nmymv9",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Where are people finding positions that pay $140k + ??",
    "text": "Is 140k really the average where you are from?? I live in Chicago and I make $105k 20% bonus. I have been an EA for over 20 years and I have my MBA. I have been looking and there are zero job listings over $120k that I have found. By looking at all the posts in this subreddit, everyone is making over $140k and are fully remote. Is this really the norm where you are from? I have many friends that are EAs in Chicago and the highest salary I know of is $115k. Tell me where these jobs are - I’m genuinely curious. I can’t be alone am I? ",
    "score": 63,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1nmymv9/where_are_people_finding_positions_that_pay_140k/",
    "created_at": "2025-09-21T17:52:20.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1kt5qsb",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "Offer Withdrawn",
    "text": "Hi friends! I wanted to share this crazy story with you all. I posted about this in The Administrative Professionals discord, so apologies if you've seen this story before.\n\nI'm currently applying for jobs to relocate back to the DC area. This week I traveled from upstate NY to DC for two in person interviews. The first was with a higher ed nonprofit, which I was very excited about, as I'm currently in higher ed. I got a very quick rejection from that job, the day after I did a 90 minute in person with two groups. But that's not the weird part.\n\nI also interviewed with another non-profit, further details I will leave out. I went to their office on Wednesday at 3pm, left around 4:30 after meeting with CEO and CFO, both of whom I had met with previously by Zoom. At 7pm their HR person (it's a small company so there's only one HR person) called me to give me a verbal offer at $95k. I gave her a tentative yes, and we planned to talk this morning at 10:30am. In the interim, I sent her an email to ask for the full benefits information, and a second email to ask if there was any room to negotiate the salary up to just $100k. 3 hours after that email, I received a response saying thanks for my application but they are going in another direction after much consideration. \n\nThis was my first time ever trying to negotiate a salary, which I thought was normal and customary. I was really surprised when their response was to withdraw their offer. The lovely people in the discord server assured me that this is not a normal response, it's a huge red flag and I have probably dodged a bullet not getting hired there. Taking this evening to be pissed off/sad/frustrated, and then back to applying for jobs like a crazy woman.\n\nTL;DR - attempted to negotiate salary by just 5% and the offer was withdrawn!",
    "score": 62,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1kt5qsb/offer_withdrawn/",
    "created_at": "2025-05-22T23:56:12.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1pe7qdj",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "How stupid would it be to take a pay cut from $130k to $50k?",
    "text": "I am currently an EA in the finance industry with a $130k salary (high cost of living city.) I know that I am very lucky to make this amount, but I absolutely hate my job. I am deeply un-passionate about finance and the people I work for are terrible. \n\nSo, I have been looking for EA roles in other industries. There is an opportunity at an organization that I strongly align with that would offer a much better work-life balance and opportunities to develop beyond an EA role (which is my long term goal.)  The only problem is the salary is $50k. After reviewing my finances, I see that I could make it work, but I would have to make a few lifestyle changes and would be saving next to nothing for retirement. \n\nHas anyone made a jump like this? Did you regret it? ",
    "score": 60,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1pe7qdj/how_stupid_would_it_be_to_take_a_pay_cut_from/",
    "created_at": "2025-12-04T18:29:20.000Z",
    "num_comments": 137
  },
  {
    "id": "reddit-1mbrxm6",
    "subreddit": "ExecutiveAssistants",
    "soc_codes": [
      "43-6011"
    ],
    "title": "That ole bait and switch…",
    "text": "Hi folks.\n\nSo it looks as though I am about to befall ye ole bait and switch. I have been an EA to the CEO of a local NP org for going on two years now. Last spring they had let go the other admin support, and since then I had carried my work load as well as theirs all while actively discussing transitioning me into a special project manager once we could onboard new support to take on the work with my CEO and the fringe admin tasks. I was stoked. It was career progression, an increase in pay, and I felt valued and SEEN. You know, all that stuff we don’t always get in these roles.\n\nFF to now,  we have hired and on-boarded a new admin and she’s lovely. Handover has done seamlessly, she’s just an absolute gem of a human. I had my 1:1 to discuss the official role transition. And to be clear, I had a JD I had previously reviewed and agreed upon. \n\nNow? The org has found a shortfall in budget to a great amount. And since I have already on-boarded this new admin, and I don’t “technically” have a new role, I am redundant. And they don’t have the funding for the role as it was discussed,  but would I be ok moving to admin support? But they’d have to lower my pay… but it might be temporary! \n\nHonestly, I am just so disappointed. I’m not sad or angry (yet), just exhausted. \n\nThey have someone they can pay less to support the CEO.  But still have myself with my 20 years of experience and org familiarity that they’ll want to draw on, but with a pay reduction of 30%, give or take.\n\nThe best part? I accepted 15% decrease in salary to work here because it was a “permanent” role, and there were other job related perks I found to offset the pay drop. And because I believed in the work they did and its place in the community.\n\n ",
    "score": 58,
    "url": "https://reddit.com/r/ExecutiveAssistants/comments/1mbrxm6/that_ole_bait_and_switch/",
    "created_at": "2025-07-28T20:48:33.000Z",
    "num_comments": 17
  }
]