[
  {
    "id": "reddit-1ippkf4",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "Last email from USDA staffer",
    "text": "Note: Below is the last email sent by FSA employee from their usda email account. No, I am not the author. Just sharing. \n\n“Dear North Carolina Agricultural Partners,\n\n\nI am reaching out with a heavy heart. As of February 13, 2025, I have been terminated from my position as the only Outreach Coordinator for the USDA Farm Service Agency (FSA) in North Carolina. This decision is part of the current administration's new direction for the federal workforce—many of whom, like me, have dedicated their careers to serving the public and supporting those who feed America.\n\n \n\nI had the privilege of working with some of you directly, others I supported indirectly, and many of you were on my list to aid in the near future. It saddens me that I will no longer be able to provide the outreach, education, and connections you rely on to access USDA programs. When I enlisted into the U.S. Army at the age of 17, I made a commitment to serve our country and had hoped to continue that sentiment by ensuring farmers and producers have the resources they need to thrive.\n\n \n\nThat mission has now been cut short for me - not because of performance or lack of need, but due to an arbitrary policy decision that will ultimately effect America's support system for farmers.\n\n \n\nI will say with confidence that in the short time I’ve worked with FSA, the dedication, compassion, and commitment to our farmers—the backbone of our country—surpasses much of what I’ve seen in my career and is an absolute testament to each and every one of you. It’s the people like you that remind me why I signed up to serve in the first place.\n\n \n\nI want to be clear—this decision did not come from the North Carolina Farm Service Agency. The leadership and staff at North Carolina FSA have been phenomenal to work with, and they remain committed to serving the state’s farmers and producers. My Termination was bypassed at the state level and came directly from the Farm Production and Conservation (FPAC) Mission Area under the current administration’s direction. This makes it even more disappointing because it was done without regard for the relationships that have been built and the work that still needs to be done for North Carolina’s agricultural community.\n\n \n\nWhat This Means for North Carolina's Farmers &amp; Producers\n\nWith my departure, North Carolina no longer has a dedicated USDA FSA Outreach Coordinator. This means fewer resources, connections, and opportunities for small farmers and producers who need guidance in navigating programs designed to help them succeed. At a time when the agricultural community is already facing extreme economic and environmental hardships.\n\n \n\nThe administration's policies are already harming America's farmers:\n\nCuts to key farm assistance programs that once provided financial relief to struggling producers.\n\nDelays and freezes in federal loans and grants were on which many North Carolina farmers depended.\n\nThe shutdown of critical agricultural research at land-grant universities that helped develop better seeds, equipment, and global market access.\n\nSever freezes and extreme weather conditions that have devastated crops, while emergency aid remains uncertain. \n \n\nThese issues aren't just affecting North Carolina; they are part of a nationwide policy that will affect the entire American agricultural system. Please refer to the official Executive Orders that have been signed for further context.\n\n \n\nWhile I may no longer be in this position, I urge you to stay engaged and advocate for the resources that our community deserves.\n\n \n\nLastly, the challenges ahead require all American farmers to work together, remain informed, and support each other.\n\n \n\nThank you for your partnership and dedication. \n\n \n\nSincerely,\n\n\nDedicated Public Servant and U.S. Army Veteran\n\n [name redacted]\n\n\nState Outreach Coordinator\n\nUSDA Farm Service Agency\n\nNC State Office”",
    "score": 5380,
    "url": "https://reddit.com/r/Agriculture/comments/1ippkf4/last_email_from_usda_staffer/",
    "created_at": "2025-02-15T00:40:44.000Z",
    "num_comments": 428
  },
  {
    "id": "reddit-1novx1v",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "Trump’s Cruelty Toward Hungry Children Cannot Be Ignored",
    "text": "https://www.theatlantic.com/health/archive/2025/07/usaid-emergency-food-incinerate-trump/683532/\n\nIf you’re sick of watching Trump treat kids’ hunger like a punchline while pretending cruelty is leadership, join us at r/politicalsham. We call out the fraud, the waste, and the shameless neglect every single day. The truth doesn’t burn — it feeds.  \n\nTrump’s attitude toward hungry children is not leadership, it is cruelty. A president’s job is to protect and uplift the vulnerable, not to sneer at them or waste resources that could put food on the table. Families across America struggle to keep their kids fed, and instead of meeting that challenge with compassion, Trump meets it with arrogance. This is not about politics, it is about basic human decency. Burning food while children go without is not strength. It is weakness, cruelty, and moral bankruptcy. No child should suffer because of one man’s ego and indifference.",
    "score": 3819,
    "url": "https://reddit.com/r/Agriculture/comments/1novx1v/trumps_cruelty_toward_hungry_children_cannot_be/",
    "created_at": "2025-09-23T22:48:17.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1lokdbn",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "ICE raids on Californian farms risk US food supply, economists warn",
    "text": "Most economists and politicians acknowledge that many of America's agricultural workers are in the country illegally, but say a sharp reduction in their numbers could have devastating impacts on the food supply chain and farm-belt economies.\n\nDouglas Holtz-Eakin, a Republican and former director of the Congressional Budget Office, said an estimated 80 percent of farmworkers in the U.S. were foreign-born, with nearly half of them in the country illegally. Losing them will cause price hikes for consumers, he said.\n\n\"This is bad for supply chains, bad for the agricultural industry,\" Holtz-Eakin said.\n\nOver a third of U.S. vegetables and over three-quarters of the country's fruits and nuts are grown in California, according to the California Department of Food and Agriculture. The state's farms and ranches generated nearly $60 billion in agricultural sales in 2023",
    "score": 3329,
    "url": "https://reddit.com/r/Agriculture/comments/1lokdbn/ice_raids_on_californian_farms_risk_us_food/",
    "created_at": "2025-06-30T21:50:53.000Z",
    "num_comments": 262
  },
  {
    "id": "reddit-1jhwdqf",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "Flock size is too damn high!",
    "text": "U.S. layer flock sizes are absurd. Bird flu at any of these megafarms/factories causes price increases and shortages. It's plausible that a couple of bad months could wipe out half (or more) of U.S. egg production for 6+ months.\n\n- 124 out of 125 million (99.3%) of culled layer hens in the U.S. were on only 102 factory egg facilities, in flocks &gt;100,000. Avg: 1,200,000 birds/farm. 2 flocks were &gt;5,000,000 birds. (2022.02-2025.03)\n- The U.S. has 347 egg factories that house 293 million out of 389 million hens (75%). Avg: 840,000/farm.\n- Feb 2022: 5,350,000 birds were culled from a single egg \"farm\" in Iowa. Mar 2023: another Iowa farm, with 5,010,000 birds, was culled.\n- 54 egg farms, each with &gt;1,000,000 birds, have been culled.\n- 90% of U.S. laying hens are owned by 50 companies. 50% are owned by 10 companies.\n- The U.S. produces 110 billion eggs per year.\n- U.S. egg prices have more than tripled. Current: $5.90/dzn (2025.02); $1.79 (2021.12; 2-months prior to first reported bird flu on a U.S. table egg farm)\n- *Consumer Welfare Standard*:\n\n&gt;As long as an economist can argue that prices *may* go down as a result of a merger, a company’s accumulation of market power and the disappearance of its competitors doesn’t matter... It’s one main reason why economic power is more concentrated today than at any other point since [America's last Guilded Age and the robber baron era (1865-1902)]. (\"*Barons*\", Chapter 3)\n\nSources:\n\n- [2022 U.S. Census of Agriculture, table 30](https://www.nass.usda.gov/Publications/AgCensus/2022/Full_Report/Volume_1,_Chapter_1_US/st99_1_030_031.pdf) (pdf)\n- [Confirmed HPAI Detections, Commercial and Backyard Flocks](https://www.aphis.usda.gov/livestock-poultry-disease/avian/avian-influenza/hpai-detections/commercial-backyard-flocks) (USDA, APHIS)\n- [USDA Reported H5N1 Bird Flu Detections in Poultry](https://www.cdc.gov/bird-flu/situation-summary/data-map-commercial.html) (CDC)\n- [Poultry - Production and Value Summary 2023](https://downloads.usda.library.cornell.edu/usda-esmis/files/m039k491c/b2775j31b/9k4213149/plva0424.pdf) (USDA, 2024, pdf)\n- [\"The 52 largest US egg producers in 2025\"](https://www.eggindustry-digital.com/eggindustry/library/item/january_2025/4242200/) (\"Egg Industry\" magazine, 2025 Jan)\n- [Avg Price: Dozen Eggs](https://fred.stlouisfed.org/series/APU0000708111), Grade A, Large, U.S. City Average [APU0000708111] (U.S. BLS, FRED)\n- [Egg Markets Overview](https://mymarketnews.ams.usda.gov/viewReport/3725) (USDA, AMS, weekly report) ([2025.03.14](https://mymarketnews.ams.usda.gov/filerepo/sites/default/files/3725/2025-03-14/1221508/ams_3725_00067.pdf), pdf)\n\n**Recommended Reading:**\n\n- \"*Barons: Money, Power, and the Corruption of America's Food Industry*\" (Frerick, 2024)\n- \"*The Meat Racket: The Secret Takeover of America's Food Business*\" (Leonard, 2014)\n- \"*The CAFO Reader: The Tragedy of Industrial Animal Factories*\" (Imhoff, 2010)\n- \"*The Farm Bill: A Citizen's Guide*\" (Imhoff, 2019)\n\n(library genesis, anna's archive)",
    "score": 263,
    "url": "https://reddit.com/r/Agriculture/comments/1jhwdqf/flock_size_is_too_damn_high/",
    "created_at": "2025-03-23T10:34:43.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1o7o6mc",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "ELI5. I have a degree in ag, but I work on an adjacent sector. I see questions on here like \"what should we grow now?\".. what is stopping you from growing the things we import from SA? Like tomatoes, cucumbers etc? I really am curious not trying to be an asshole",
    "text": "",
    "score": 68,
    "url": "https://reddit.com/r/Agriculture/comments/1o7o6mc/eli5_i_have_a_degree_in_ag_but_i_work_on_an/",
    "created_at": "2025-10-15T21:43:52.000Z",
    "num_comments": 84
  },
  {
    "id": "reddit-1i1e17d",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "What are good Ag Companies to work for after graduation?",
    "text": "I am a 21 (F) and will be graduating this upcoming May in Agribusiness, I also have a minor in plant and soil science and have a certificate in engineering technology as well. What companies or government agencies would y’all recommend or what fields should I specifically look for? I am looking mores towards Texas but am willing to relocate as well",
    "score": 37,
    "url": "https://reddit.com/r/Agriculture/comments/1i1e17d/what_are_good_ag_companies_to_work_for_after/",
    "created_at": "2025-01-14T19:20:34.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1juziru",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "Ag careers that don’t involve crazy hours?",
    "text": "Hi all,\n\nPretty much the title. I’m passionate about ag but I’m sick of the schedules, wondering if there’s anywhere for me to go in the industry.\n\nI did farm management/mixed agronomy for 7 1/2 years - 4 1/2 on a cattle ranch/row cropping operation, 3 on a much smaller scale forestry products operation. Loved the work, hated the hours, still managed mostly.\n\nI left that life to go to school, took a retail job at a garden center, somehow ended up in a management position and I’m back at long hours trying to meet sales goals. I now have my degree (agronomy/crop science) and I’m job hunting, but every place I’ve interviewed at is giving me the same thing, long hours, okay pay, no balance.\n\nI’m honestly so sick of it, I recently had a little girl and she’s the light of my life, and it sickens me thinking that I may miss her entire life by working.\n\nIs there any career in ag or adjacent to ag that won’t have me working crazy long hours? Anything that would be available to me? Just looking to see what’s out there, would love to hear from farmers, agronomists, researchers, anyone and everyone with any ideas.\n\nThanks in advance!",
    "score": 31,
    "url": "https://reddit.com/r/Agriculture/comments/1juziru/ag_careers_that_dont_involve_crazy_hours/",
    "created_at": "2025-04-09T06:48:47.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1nlmo5u",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "What are some great ag colleges that focus on experiential learning?",
    "text": "Hi all. I have a son in high school who lives and breathes 4H stuff. It has been his singular focus for the last 7 years. His specific interest is cattle and he absolutely wants a career in livestock/ranching, though i dont think he has any idea what specific niche.\n\nThis is not a world i know anything about. My wife and I work in completely different industries.\n\nIve started to browse colleges that might be a good fit, though I feel like im fumbling about blindly. So far we have sent away for material from the University of Wyoming, Kansas State, Oklahoma State, and South Dakota State. We are in CA, and closer to home there is Cal Poly SLO and Fresno State. \n\nHe would do best at a school that focuses a lot on experiential, hands on learning.\n\nAnyone have any suggestions of schools we should check out?\n\nThanks!",
    "score": 9,
    "url": "https://reddit.com/r/Agriculture/comments/1nlmo5u/what_are_some_great_ag_colleges_that_focus_on/",
    "created_at": "2025-09-20T02:36:19.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1hpjsuz",
    "subreddit": "Agriculture",
    "soc_codes": [
      "45-2091",
      "45-2092"
    ],
    "title": "Career Options",
    "text": "Im 23M from Northern Michigan looking for a career in agriculture. Currently I’m working in Juvenile detention. I’ve tried going to college twice for things that I just wasn’t passionate about and had some health issues come up. \n\nRegardless, I ended up flunking out of college twice. After doing some self reflection I’ve come to realize that I’m passionate about animals. There’s nothing that gets me more excited than working with, handling, or knowing about animals. \n\nI’m wondering if this is something that is worth getting a degree in? I worked on a Dairy farm for about 3 yrs, and I lived on a hobby farm with Goats, chickens, and rabbits for about 6 yrs, along with doing 4h. \n\nAny help is greatly appreciated. TYIA\n\nEdit: Let’s say I wanted to start my own farm/ranch, what would be the rough start up cost? ",
    "score": 7,
    "url": "https://reddit.com/r/Agriculture/comments/1hpjsuz/career_options/",
    "created_at": "2024-12-30T09:43:40.000Z",
    "num_comments": 5
  }
]