[
  {
    "id": "reddit-1jn4lyq",
    "subreddit": "farming",
    "soc_codes": [
      "11-9013",
      "45-2091"
    ],
    "title": "Alarm as Florida Republicans move to fill deported workers’ jobs with children: ‘It’s insane, right?’",
    "text": "\"Beneath the smugness of Ron DeSantis, at Florida leading the nation in immigration enforcement lies something of a conundrum: how to fill the essential jobs of the scores of immigrant workers targeted for deportation.\n\nThe answer, according to Florida lawmakers, is the state’s schoolchildren, who as young as 14 could soon be allowed to work overnight shifts without a break – even on school nights.\"\n\n[https://www.theguardian.com/us-news/2025/mar/29/florida-republicans-immigrant-jobs-child-labor](https://www.theguardian.com/us-news/2025/mar/29/florida-republicans-immigrant-jobs-child-labor)\n\nGood times in the US of A. I wonder if Ron's children will be working overnight to harvest produce?",
    "score": 1952,
    "url": "https://reddit.com/r/farming/comments/1jn4lyq/alarm_as_florida_republicans_move_to_fill/",
    "created_at": "2025-03-30T04:19:32.000Z",
    "num_comments": 222
  },
  {
    "id": "reddit-1ippoae",
    "subreddit": "farming",
    "soc_codes": [
      "11-9013",
      "45-2091"
    ],
    "title": "Last letter from an FSA stafffer",
    "text": "“Dear North Carolina Agricultural Partners,\n\n\n\nI am reaching out with a heavy heart. As of February 13, 2025, I have been terminated from my position as the only Outreach Coordinator for the USDA Farm Service Agency (FSA) in North Carolina. This decision is part of the current administration's new direction for the federal workforce—many of whom, like me, have dedicated their careers to serving the public and supporting those who feed America.\n\n \n\nI had the privilege of working with some of you directly, others I supported indirectly, and many of you were on my list to aid in the near future. It saddens me that I will no longer be able to provide the outreach, education, and connections you rely on to access USDA programs. When I enlisted into the U.S. Army at the age of 17, I made a commitment to serve our country and had hoped to continue that sentiment by ensuring farmers and producers have the resources they need to thrive.\n\n \n\nThat mission has now been cut short for me - not because of performance or lack of need, but due to an arbitrary policy decision that will ultimately effect America's support system for farmers.\n\n \n\nI will say with confidence that in the short time I’ve worked with FSA, the dedication, compassion, and commitment to our farmers—the backbone of our country—surpasses much of what I’ve seen in my career and is an absolute testament to each and every one of you. It’s the people like you that remind me why I signed up to serve in the first place.\n\n \n\nI want to be clear—this decision did not come from the North Carolina Farm Service Agency. The leadership and staff at North Carolina FSA have been phenomenal to work with, and they remain committed to serving the state’s farmers and producers. My Termination was bypassed at the state level and came directly from the Farm Production and Conservation (FPAC) Mission Area under the current administration’s direction. This makes it even more disappointing because it was done without regard for the relationships that have been built and the work that still needs to be done for North Carolina’s agricultural community.\n\n \n\nWhat This Means for North Carolina's Farmers &amp; Producers\n\nWith my departure, North Carolina no longer has a dedicated USDA FSA Outreach Coordinator. This means fewer resources, connections, and opportunities for small farmers and producers who need guidance in navigating programs designed to help them succeed. At a time when the agricultural community is already facing extreme economic and environmental hardships.\n\n \n\nThe administration's policies are already harming America's farmers:\n\nCuts to key farm assistance programs that once provided financial relief to struggling producers.\nDelays and freezes in federal loans and grants were on which many North Carolina farmers depended.\nThe shutdown of critical agricultural research at land-grant universities that helped develop better seeds, equipment, and global market access.\nSever freezes and extreme weather conditions that have devastated crops, while emergency aid remains uncertain. \n \n\nThese issues aren't just affecting North Carolina; they are part of a nationwide policy that will affect the entire American agricultural system. Please refer to the official Executive Orders that have been signed for further context.\n\n \n\nWhile I may no longer be in this position, I urge you to stay engaged and advocate for the resources that our community deserves.\n\n \n\nLastly, the challenges ahead require all American farmers to work together, remain informed, and support each other.\n\n \n\nThank you for your partnership and dedication. \n\n \n\nSincerely,\n\n \n\nDedicated Public Servant and U.S. Army Veteran\n\n \n\n\n\nState Outreach Coordinator\n\nUSDA Farm Service Agency\n\nNC State Office”",
    "score": 762,
    "url": "https://reddit.com/r/farming/comments/1ippoae/last_letter_from_an_fsa_stafffer/",
    "created_at": "2025-02-15T00:46:33.000Z",
    "num_comments": 237
  },
  {
    "id": "reddit-1jyk5dd",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Blowing Thorns Off Cactus Pads to Feed Cattle – Anyone Else Doing This? (Jerez, Zacatecas)",
    "text": "We’ve been using cactus (nopal) as supplemental feed for our cows here in Jerez, Zacatecas. In this video, we’re using a blowtorch to burn off the thorns from the cactus pads before feeding them. It’s extra work, but the cows eat it up—especially in the dry season when grass is scarce.\n\nCurious if anyone else out there feeds cactus to their livestock? How do you prep it? Have you seen any noticeable effects—good or bad?\n\nFor those unfamiliar:\nCactus is high in water content and provides energy mainly through carbohydrates. It’s low in protein and fiber, so we supplement with our own oat/wheat blend (about 60/40). We also keep mineral blocks out year-round. From what I’ve seen, cactus pads (Opuntia) can offer:\n\t•\t~85% water\n\t•\t~6–8% carbohydrates\n\t•\t~1–2% crude protein\n\t•\tHigh in calcium, low in phosphorus\n\nWould love to hear how others are using cactus, especially in dryland or desert ranching areas.",
    "score": 518,
    "url": "https://reddit.com/r/Ranching/comments/1jyk5dd/blowing_thorns_off_cactus_pads_to_feed_cattle/",
    "created_at": "2025-04-13T22:43:31.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1iqxkuv",
    "subreddit": "farming",
    "soc_codes": [
      "11-9013",
      "45-2091"
    ],
    "title": "Farm Services Agency getting hit by Federal firings",
    "text": "FSA workers are being terminated without cause as a result of their Administration's directives.  I've already heard accounts of promised FSA Grant money being rescinded after farmers completed agreed upon work.\n\nThis is going to hurt farmers.\n\nLetter from an affected FSA worker here:\n\nhttps://www.reddit.com/r/PrepperIntel/s/ozdCjEQWoL\n\n\nPlease call your representatives in Congress and tell them how these actions are impacting their constituency. This administration is killing farmers.",
    "score": 461,
    "url": "https://reddit.com/r/farming/comments/1iqxkuv/farm_services_agency_getting_hit_by_federal/",
    "created_at": "2025-02-16T17:37:21.000Z",
    "num_comments": 253
  },
  {
    "id": "reddit-1ixhfoa",
    "subreddit": "farming",
    "soc_codes": [
      "11-9013",
      "45-2091"
    ],
    "title": "Vance and AcreTrader",
    "text": "I just heard about JD Vance's investment in AcreTrader.  Doesn't this seem like a huge conflict of interest?  It's like he's betting farms will fail.  He certainly benefits from it.\n\nhttps://www.farmlandgrab.org/post/32430-jd-vance-funded-acretrader-here-s-why-that-matters",
    "score": 439,
    "url": "https://reddit.com/r/farming/comments/1ixhfoa/vance_and_acretrader/",
    "created_at": "2025-02-25T00:14:02.000Z",
    "num_comments": 156
  },
  {
    "id": "reddit-1ph4i7z",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Inheriting ranch, what do I do first to live there?! Wild, untouched land.",
    "text": "\n\nI have found myself in a great, but unique situation. \n\ntldr: I’m inheriting my family ranch in Texas after living in a major city for 20 years. Want to move there with husband and kids. Bad credit, no savings but Grandparents still live there and will help us out some. What do I do?\n\nWe are done with city life. I grew up country there so none of the bugs/animals/outdoorsy aspects bother me. My Grandparents had offered this prospect of moving out there for years, but it was always a kinda pie in the sky idea for us because my husband is a city boy and will have to commute to work. He came around to the idea because I really want this and we are drowning financially after renting for 20+ years. \n\nI don’t feel like we are financially ready to even be able to qualify for a construction loan and we aren’t exactly “handymen” so I don’t see us pulling off a diy log cabin. \n\nWe have been offered their decent rv but we can also of course stay in their house. That’s a very short term option though - we don’t need to be together 24/7. 😵‍💫\n\n* Does it make sense to buy a trailer to live in during construction? Are trailers/mobile homes ever movable and for rent? \n\nThe house can be built anywhere and the best options are:\n\n1. A beautiful completely open clearing, fenced off due to the cattle that used to be there, no trees. Beautiful view of the woods on most sides. I’m just concerned about no tree shade, though I’m going to make damn sure we get the best hvac system we can practically afford no matter what. \n\n2. The open field next to their house but would be sandwiched with their neighbor. They’re nice neighbors and I don’t think they would like it feeling crowded all of a sudden. This would be the most cost effective way though because we wouldn’t have to build a road to the back end of the property and it would be easier to hook up water and electricity etc. \n\n3. Move to the edge of the woods so there’s some shade but not under a complete canopy. This is completely wild land, never been lived on. I worry about the tree roots fucking up the foundation over time. \n\n4. I can’t help but kinda love the idea of building in the straight up deep woods but that would probably be a nightmare due to bugs and animals, wouldn’t it? I think I’m accidentally imagining the 7 dwarves house in Snow White. \n\nI know my thoughts are scattered here. I’m overwhelmed at this dream coming true because we weren’t financially prepared to be priced out of the city so soon. I’ve been a stay at home mom for 11 years and we have a 1 year old so I won’t be finding a job until he’s in school. \n\nIf I left info out, please ask. I’d love any and all advice about any part of this. Crossposting it to get different perspectives about the different questions. Thanks! ",
    "score": 394,
    "url": "https://reddit.com/r/Ranching/comments/1ph4i7z/inheriting_ranch_what_do_i_do_first_to_live_there/",
    "created_at": "2025-12-08T05:37:30.000Z",
    "num_comments": 134
  },
  {
    "id": "reddit-1jzh9o5",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Fixing barbed wire way out in La Tierra Prieta — Sierra de los Cardos, Jerez, Zacatecas",
    "text": "\nTook us about 3 hours on foot with tools just to get to this stretch of fence. It’s part of our 5,000 ha winter rangeland up in the sierra. The terrain’s rough, but the grazing’s solid and the views are hard to beat. Just another day of ranch work—long hikes, busted wire, and quiet country.",
    "score": 224,
    "url": "https://reddit.com/r/Ranching/comments/1jzh9o5/fixing_barbed_wire_way_out_in_la_tierra_prieta/",
    "created_at": "2025-04-15T02:47:12.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1ipdf84",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Young ranch hand with no fear of bodily harm",
    "text": "We have a part time hand that works a few days during the week while going to college. He is all around a great young man. Wonderful manners and personality with a great work ethic that you can’t find often nowadays. He is always very careful and cautious operating equipment but we have had more issues come up with his lack of fear in situations where he is excited. He is interested in snakes and has a knack for catching them but there have been times he couldn’t identify if it was venomous or not and would ask us after he had caught the snake and brought it over to us. Twice now they have been venomous. I have insisted on a no messing with any snakes while on work time rule now. The same issue has happened with cattle on occasion. Where he clearly is not reading their body language and I have had to tell him to stop approaching a mother protecting a dead or live calf that was ready to fight someone but it took 3 times of “stop walking towards her” to get him to stop. In these moments he is so excited like he is on cloud 9 but it’s like his eyes glaze over and he has no sense. As soon as the moment is over he is the perfect sensible worker again. He is young only 19 so I don’t know if this will lessen with age. He is a great employee and I’d hate to have to let him go over this but also don’t wanna be the person calling his parents saying he won’t be coming home. Has anyone had experience with getting an employee to learn to stop breath and think for a minute in these situations to develop impulse control even when excited? Or is this a personal nature that won’t change?",
    "score": 134,
    "url": "https://reddit.com/r/Ranching/comments/1ipdf84/young_ranch_hand_with_no_fear_of_bodily_harm/",
    "created_at": "2025-02-14T15:43:27.000Z",
    "num_comments": 151
  },
  {
    "id": "reddit-1jo10f9",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Making a new cattle working station in Patagonia Argentina",
    "text": "I’ve been running the family ranch for 6 years now, and the working station in this paddock was over 30 years old and it was supposed to be temporary only. Now I started to build a new one with steel and wood. It’s meant to have a round corral at the entry and 6 different corrals at the end.\nWill update later on.\nPatagonia Argentina",
    "score": 112,
    "url": "https://reddit.com/r/Ranching/comments/1jo10f9/making_a_new_cattle_working_station_in_patagonia/",
    "created_at": "2025-03-31T11:32:38.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1lj0il6",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Wind farm called me, is it a good deal?",
    "text": "So, we have a ranch in Eastern Colorado, and there are a lot of wind turbines around. It's my Grandmother's ranch, and we don't run cattle anymore, we lease the land to some other ranchers that still do. \n\nRecently a wind energy company has reached out about putting turbines in some of our pastures. I'm not worried about how much they'll pay, but I am interested in what other ranchers have experienced.  \n\nDoes it affect the cattle? Does it make things more difficult for ranching? What about land value, does it decrease the value of the land for ranching? Does anyone have any experience with these projects? \n\n\nUPDATE: we've heard more from the company, this is still quite far in the future, and since my grandmother is 97, and when she dies my mom, aunt &amp; uncle split the land, if she expresses interest it will have to be their decision. Thank you all for the insight, you gave me a lot to research. Since I'm the family nerd, I'll have to gather all of the articles and advice to pass it on for them to consider. ",
    "score": 87,
    "url": "https://reddit.com/r/Ranching/comments/1lj0il6/wind_farm_called_me_is_it_a_good_deal/",
    "created_at": "2025-06-24T03:14:30.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1hup87n",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Am I being a pu**y ? ",
    "text": "I started helping at 2 ranches as a part time gig for extra fun money , job wasn’t needed to pay the bills etc etc \n\nFirst place I worked at was a small operation, I just went on weekends to do cleanup and handyman type jobs for an elderly lady, honestly an awesome place and awesome lady , but she had to “let me go” bc she said she ran out of money and couldn’t pay me anymore \n\nStarted working at this 2nd place, pays me consistently and closer to home. But this lady is an absolute nightmare, I do the same cleanup job. Get there after my day job, clean stalls and pens, food chores etc. but this lady will find ANYTHING to be upset about, it’s a 40 acre property and everyday she will drive around looking for anything I missed , she’ll find 1 freshly laid pie and send me a video 3 hours after Iv been home saying I’m irresponsible and not doing the job correctly. After a short rainy week I was cleaning off and hosing off one of their wheel barrels , she passed by me with her granddaughter and asked what I was doing and I said “just cleaning this off clean so it doesn’t cake up more and I can pull it through the muck” and she called me stupid and crazy and told me to knock it off. All infront of her granddaughter and the rest of her family ( this was while I worked on Christmas Eve and Christmas). \n\nShe lied to me and said the alfalfa cubes got wet from the rain bc I didn’t put a cover over it (the cubes were dryer than a rusted bucket in Nevada) \n\nThen she started a rumor about me that she fired me , I only heard word bc my friend that also works there told me about it . I asked if I should confront her and he said it wouldn’t change anything it’s just how she is \n\nShe’s always talking shit about employees to other employees, and then acts like a saintly Christian online when people give the ranch bad reviews , and she’s constantly getting sued \n\nMy question is : am I being a pussy about wanting to quit this job? \n\nEdit : alright alright cowboys I hear ya 😂, when my wife gets back from her trip and goes back to her job I’ll get my last check and leave this place In my rear view mirror. I appreciate y’all confirming what Iv felt for a while now ",
    "score": 80,
    "url": "https://reddit.com/r/Ranching/comments/1hup87n/am_i_being_a_puy/",
    "created_at": "2025-01-06T03:05:56.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1i27qbt",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "I quit the job ",
    "text": "A handful of y’all gave me some advice about the “ranch” I was working at. I appreciate everyone who gave me feedback and suggestions, this morning I called the lady up and told her I won’t be coming in anymore. When she asked why I wanted to go off on her and tell her the plethora of a list I had for reasons but I decided to keep it professional and say that I’m just gonna focus on my military career and my college\n\nWeight off my shoulders not working for the devil anymore, thanks y’all ",
    "score": 65,
    "url": "https://reddit.com/r/Ranching/comments/1i27qbt/i_quit_the_job/",
    "created_at": "2025-01-15T21:03:24.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1kocsr9",
    "subreddit": "farming",
    "soc_codes": [
      "11-9013",
      "45-2091"
    ],
    "title": "Do you think working in farming is worth your time financially? Is your earning potential better allocated to other fields and just using a farm as an emotionally attached store of capital?",
    "text": "The US used to have a lot of smaller farmers and many folks supported a family on one farm income. Now there are couple thousand acre farms that dont even support one family member. Do you think jts worth it to spend a lot of time “working the farm?” Entire quarter sections can be planted jn a few hours and harvested in a few hours. Feel like most of the money is in 1) owning the capital behind these farms and equipment and getting it to snowball 2) developing the technology in seeds and machinery that makes this happen as well as owning the patents/stocks related to these advances. \n\nI guess when it comes to physical work on the farm- the only activity really worth time is the $100 an hour trade jobs related to plumbing, electrical, and mechanical but that pales in comparison to the returns on capital needed to make a farm go round. Guess what im asking is- is it worth it to forego a solid career off the farm as a tradie, doctor, lawyer, accountant, engineer to farm full time?",
    "score": 18,
    "url": "https://reddit.com/r/farming/comments/1kocsr9/do_you_think_working_in_farming_is_worth_your/",
    "created_at": "2025-05-16T21:46:51.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1pczf6u",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "I don't know what to do with my life",
    "text": "I'm 18 I don't really know what to do and I don't really have any experience with anything I'm ashamed to say I'm a high school drop out and I still live with my mom I feel lost right now and I'm not sure what to do form here.\nIf anyone has any advice it would be much appreciated.\n\nUpdate: Hay guys I've seen y'all's advice and I want to thank you I had a conversation with my mom and I want to try and get my high school diploma idk how but I'm gonna figure it out ,as for my career idk yet a buddy recommended getting into the rancher industry but I'm not sure where to start and I'll still have to speak with my mom about it, thank you guys and God bless you all.",
    "score": 12,
    "url": "https://reddit.com/r/Ranching/comments/1pczf6u/i_dont_know_what_to_do_with_my_life/",
    "created_at": "2025-12-03T09:06:32.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1jvmv8c",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Elk ranching",
    "text": "Looking for general advice and resources to study up on starting an elk ranch. A quick bio, I was raised on a cattle and hog farm, joined the USMC, got out in 2018 and got an office gig (contracting and now government work). After working in an office for over a decade, I've realized I'm only happy at home with my family and miserable in my office box at work. I miss the farm life but can't go back to it (parents separated/step parent owned the farm). So now, I'm in my 30's and dare to even think about leaving my stable career for a fantasy, uprooting my family (that I only see in the evenings) for the possibility of owning and managing a ranch with a decent elk herd. I understand the hurdle of upfront investment costs but I love the animal and miss the farm lifestyle. I also want to leave something for my kids after I'm gone other than money. \n\nJust looking for some advice. Should I stick with my cushy federal job with all the benefits and retire in my 60's or should I chase after an unknown (potentially happy or disastrous) fantasy of starting an elk ranch in the Eastern side of the U.S.?",
    "score": 12,
    "url": "https://reddit.com/r/Ranching/comments/1jvmv8c/elk_ranching/",
    "created_at": "2025-04-10T01:58:54.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1joiyvi",
    "subreddit": "farming",
    "soc_codes": [
      "11-9013",
      "45-2091"
    ],
    "title": "Education Farm - where to begin?",
    "text": "Hi Reddit! \n\nI’m looking for some guidance and figured this may be a good place to start. \n\nHere’s the deal: I’m looking into opening a farm for students with special needs or those that need therapy in the central Ohio area. I’d like to have some livestock (donkeys, alpacas, chickens, goats) and “prairie” space with native species, with all things education in mind. I would hope students could learn life skills, interact with nature, and explore the variety of careers that don’t involve sitting in front of a computer. I have some students in 4-H programs, but some that cannot afford it, and I know there are many others in surrounding districts that could use this experience or “outdoor classroom” one day a week.  \n\nThis would operate as a non-profit. Obviously, we would need barn space, prairie land, ADA bathrooms/accessibility. \n\nI know there are grants and USDA money out there, but I have no idea where to begin. Currently, I’m a middle school intervention specialist  (a.k.a. special eduction teacher) in a nearby rural district and I’ve held this dream for a long time. I feel like now’s the time to figure this out. *(Or maybe this is the worst time…?)*\n\nShould add: this would not be limited to students M-F. I would love to incorporate workshops for adults (young and old) and maintain a limited staff of volunteers. \n\nAny advice on where to begin? \n\n",
    "score": 7,
    "url": "https://reddit.com/r/farming/comments/1joiyvi/education_farm_where_to_begin/",
    "created_at": "2025-04-01T00:41:41.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1ivne81",
    "subreddit": "Ranching",
    "soc_codes": [
      "45-2093",
      "11-9013"
    ],
    "title": "Ranch Hand Needed",
    "text": "\nSmall/medium equine boarding facility looking for ranch hand in Florence,Texas\n\n- Housing(small apartment) available for individual.\n- Horse Experience required (references requested)\n-This is not a riding position.\n\n-Must be able to lift 100+ Ib bales of alfalfa\n\nHours: \n-Monday - Friday 7 am until 5 pm\n\n-Saturday and Sunday am and pm feeding and cleaning only\n\nDuties include:\n-cleaning 18 stalls, feeding and watering horses AM and PM.\n\n-Horse turnout\n\n-General ranch maintenance including mowing, weed eating and fence repair. Knowledge of plumbing and electrical a plus.\n\n-Competitive salary based on experience and skills.\n\n-non- Smoking \n\nPlease DM or text 512-771-5115\n\n\n——————————————————————————————\n\nSe solicita un ayudante de rancho de tiempo completo\nEl cuidado de caballos y embarque esta ubicado en un rancho localizado en Florence, Texas\nRequisitos del Trabajo:\n• Experencia en la alimentación, cuidado y mantenimiento de los caballos\n• Proveer información de referencias previas\n• No se permite montar los caballos\n• La capacidad de cargar pacas de alfalfa (mas de 100 libras = 45 kilos)\nDeberes Laborales:\n• Mantenimiento y limpieza de 18 corrales y de puestos\n• Alimentación y hidratación de los caballos por la mañana y por la tarde\n• Traslado y pastoreo de caballos\n• Mantenimiento de tierras agricolas, edificios, corrales, pastizales\n• Mantenimiento y reparación de cercas\n• Conocimiento y experiencia en plomería y de electricista\nHorario de Trabajo:\n• De lunes a viernes 7 am – 5 pm\n• Por los sábados y domingos solo lo siguiente:\no limpieza de instalación y del rancho\no alimentación y hidratación de los caballos por la mañana y por la tarde\nSe ofrece un salario basado de previa experiencia y de tener la capacidad de cumplir con los deberes laborales\nSe ofrece un departamento ubicado en el rancho\nNo se permite fumar en el departamento\n\nFavor de enviar un texto al 512-771-5115",
    "score": 5,
    "url": "https://reddit.com/r/Ranching/comments/1ivne81/ranch_hand_needed/",
    "created_at": "2025-02-22T17:03:31.000Z",
    "num_comments": 31
  }
]