[
  {
    "id": "reddit-1k7r56d",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Customer nicknames can be... misunderstood. RE: Mocha Dan.",
    "text": "I worked at a small indie coffee roaster. Had a guy come in daily. Ordered a large mocha, preferred it made a certain way (mocha powder in the milk, not the espresso or something) but he was really kind and talkative. Kind of person who's drink goes in the queue before he's in line. Everyone called him \"Mocha Dan\" for obvious beverage reasons.\n\nOne time he comes in during a rush with a friend (not normal). He gets to the till and we hand him his mocha as his friend places an order. She laughs \"haha, Dan, you really do come here too much! They already know your drink?\" Everyone on the line starts talking, like 5 people: \"Oh sure, we love Mocha Dan. Everyone knows Mocha Dan! I'd die for Mocha Dan.\" I can see her smile starting to become fake, hiding some uncomfortable emotion.\n\nMe: \"It's because he always orders a special mocha, it has nothing to do with his skin colour.\" The RELIEF that washed over this woman. Everyone had a long laugh about it. But dear god, I am so glad I caught it.\n\nHave you ever had a nickname get misconstrued? What are your best nicknames?",
    "score": 1529,
    "url": "https://reddit.com/r/barista/comments/1k7r56d/customer_nicknames_can_be_misunderstood_re_mocha/",
    "created_at": "2025-04-25T17:47:11.000Z",
    "num_comments": 127
  },
  {
    "id": "reddit-1jfzsx3",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "I deleted my IG, thought you guys might enjoy these!",
    "text": "I’m a barista and photographer. Mostly doing stuff for the shop I work at! We don’t serve layered drinks at all, unless asked. They look cute for photos though. I’d love to see more pictures of your drinks! ",
    "score": 1294,
    "url": "https://reddit.com/r/barista/comments/1jfzsx3/i_deleted_my_ig_thought_you_guys_might_enjoy_these/",
    "created_at": "2025-03-20T21:12:27.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1jw1n9d",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "how to ask a customer to stop ordering his custom order",
    "text": "We have a regular that comes in at our cafe for years and we have a good relationship with him. A while back he asked if we could make him an omelette (instead of the egg and cheese sandwich that we have on the menu) and because it wasn’t too much work we decided to do it. For the last couple months he has been asking if we could make his omelette but oftentimes it gets kind of busy and he asks for a specific person to do it every single time (doesn’t like it when our other coworker does it) and it has gotten quite stressful. \nI know technically it’s our fault for letting this go on and on but I was wondering if anyone has any experience in turning a regular customer down when they want to order something off the menu? ",
    "score": 1105,
    "url": "https://reddit.com/r/barista/comments/1jw1n9d/how_to_ask_a_customer_to_stop_ordering_his_custom/",
    "created_at": "2025-04-10T16:08:56.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1o8kr99",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "I hate you",
    "text": "This dude asks me to make his drink in his personal cup, always gives me the lid still screwed on, I refused to make it today because of this monstrosity. I was almost gagging. That is a solid layer of milk and coffee scum with rancid liquid underneath. Made his order in a Togo cup and he took his personal cup, dumped it in the trash can, STILL asked me to rinse it out, and then asked me to also rinse the lid with hot water as well to “keep it from getting bacteria”. How entitled do you have to be to have working people be your dishwashers??\n\nI put gloves to rinse his cup out because I was too afraid of confrontation to refuse him further. I’m just shocked at the whole thing ",
    "score": 1084,
    "url": "https://reddit.com/r/barista/comments/1o8kr99/i_hate_you/",
    "created_at": "2025-10-16T22:47:36.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1iyega9",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Home barista’s aren’t baristas",
    "text": "**\\*\\*\\*EDIT:**\n\nI think it's important to clarify that this post was not intended to segregate or isolate the community of coffee lovers, I love how much we are all here trying to learn more about coffee in our own way.\n\nThis post is here to recognize and acknowledge the actual job of being a barista as opposed to just being a coffee lover. IMO anyone whoever receives their income from working shifts at a coffee shop has experienced the social, physical and financial difficulty of this job, and understand what it means to be a barista (past or current) while some people just love coffee extraction, but have little to no idea how difficult this job can be.\n\nSome baristas have a lot of experience, other's are just starting, some baristas work at a specialty shop others at coffee chains, some have this job because they are young and it's the only job they can find, others (like myself) love this job despite the way society views us.\n\nThis post is here to recognize the struggle and establish the difference between workers and hobbiests.\n\nNo matter the experience it is a role I personally find as an honorable skill, and a title worth being proud of (even if most of the world just sees baristas as lazy highschoolers)\n\n\n\n**Original post:**\n\nI know I’m gonna get a lot of flack for this, but with all these home espresso set ups, people on instagram showing how much money they’ve spent on their home set ups without ever having worked in a cafe, then calling themselves baristas has really bothered me. A barista is having to do 100 dishes at the end of a shift, learning how much to dilute the mop water to keep from the floor being sticky, how to take orders while juggling conversations and navigating coworker drama, and pouring killer latte art all during a rush. How to dial in on the fly when the door is open too long and the temperature drops or the burrs start to overheat. How to make 10 drinks in under ten minutes on a single group head. how to close a store by yourself and leave within the hour while still taking orders. The title of barista is a title of honor for the working class that should be reserved to those who are actually working professionals. Everyone at home TDSing their single origin geisha on their $2000 espresso machine they use twice a day is simply a coffee enthusiast.\n\nAm I wrong about this?",
    "score": 1078,
    "url": "https://reddit.com/r/barista/comments/1iyega9/home_baristas_arent_baristas/",
    "created_at": "2025-02-26T03:45:47.000Z",
    "num_comments": 422
  },
  {
    "id": "reddit-1l2m7ct",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "I got fired, thank God.",
    "text": "In September of 2024, I moved back across the country to the small town where I went to college. The only way I was able to do this was because a local cafe was willing to hire me remotely. The owner called me from 2000 miles away and guaranteed me employment after the phone interview. At the time I was overjoyed, this was the lifeline I needed to escape my living situation. It didn’t even occur to me that their desperation for employees was a red flag. With a job guaranteed, I bit the financial bullet and packed my bags. \n\nMy optimism crashed as soon as the nature of the establishment became clear. There were some health code violations. Major ones. The management had just recently reshuffled, and it was clear that things were messy from top to bottom. The majority of employees were aged 18-23. They were chronically understaffed, with an extremely high turnover rate.\n\nAmong other things:\n- Iced coffee is stored in the iced coffee bucket. This is a non airtight vat that is left at room temperature that leftover hot coffee is dumped into to sit in 24/7. Pitchers are filled from the perpetual bacterial stew and put into the refrigerator as needed, which is what gets poured to serve to customers. The bucket used to not be cleaned for months at a time, and is now emptied out every couple of weeks.\n- The espresso machines and wands have never been properly cleaned. This is because not a single person in the establishment knows how to clean them. There is no comprehensive training on how to care for the machines. “Backwashing” is performed daily and improperly. \n- The pitchers that hold lemonade, cold brew, iced teas, etc used to not be cleaned for unknown amounts of time. They would grow moldly, with visible detritus floating in them, and customers would be served this. Managers dismissed my concerns as “that's just what the tea looks like.” I'm pretty sure white floating spores and black mold rimming the spouts aren't normal. \n\nLast Wednesday, 20 minutes before an interview at a local restaurant, I was called and informed that I was fired. I was told not to show up to work that day. There was no advance notice, no 3-strike disciplinary actions taken against me like they claim will happen before you are terminated. Two weeks ago, I was told by a manager that I was not in danger of being written up, let alone fired. The call lasted five minutes because my interview was 15 minutes away. I hung up and cried tears of joy. \n\nThis job sucked the soul out of me. Working full-time for them rendered me unable to take care of myself on a basic level outside of work. Less than an hour after I got fired, I had a new job and a start date. I didn't even have to quit and put in an extra 2 weeks out of politeness. I'm out, I'm free. I can move on with my life and find joy in working for a place where the physical and mental toll doesnt kill me slowly.\n\nThere’s so much more I can say about the unprofessionalism, the favoritism, the isolation. But I would like to end on a positive note. If it weren’t for the kindness of my favorite regulars, who took the time to get to know me over the 9 months of my working there, I wouldn’t have made it through. I made real friends out of customers, and I’m so grateful for that. Thanks for reading.\n\n",
    "score": 1076,
    "url": "https://reddit.com/r/barista/comments/1l2m7ct/i_got_fired_thank_god/",
    "created_at": "2025-06-03T20:18:55.000Z",
    "num_comments": 116
  },
  {
    "id": "reddit-1mmqfhr",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "To those who called our shop disgusting…",
    "text": "Thank you. We are appalled and ashamed. \n\nEveryone that’s working today is a first-time barista. We’ve all tried to scrub our pitchers in the past and nothing happened, so we assumed it was a natural tarnish that happened over time. Maybe even a patina. They were like this when we got here. But the disgust from everyone on our last post made us realize this is NOT normal. Even cafiza didn’t do anything, so we used a heavy duty pot and pan cleaner. They look like new. This will be a regular part of shop cleanup now. Thanks again, we never would have known!!!",
    "score": 955,
    "url": "https://reddit.com/r/barista/comments/1mmqfhr/to_those_who_called_our_shop_disgusting/",
    "created_at": "2025-08-10T18:42:08.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1i5xaju",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "I don’t need to know!!!! Omg!!",
    "text": "Listen. I am a lactose intolerant barista. I enjoy my little soy milk, my little oat latte, whatever. I understand the trouble with dairy milk. But when I ask if whole milk is ok in your latte, I am NOT asking you to tell me what happens inside of your body when you drink dairy. \n\nI cannot tell you how many times grown adults have looked me in the eyes and told me “I love milk, it just makes me run to the bathroom!” \n\n ??????? Ew???? I don’t care? I don’t know you? I didn’t want to know that???? Why would you tell me that??? Where is the decorum???? The class??? Do you know how I will remember you for the rest of time? The customer who proudly told me, in public, out loud, that you will poop yourself if you drink milk. Is that what you want? You want to be Dookie David??? Hershey Squirts Hannah?? You can just ask for oat milk without explaining. For the love of god",
    "score": 897,
    "url": "https://reddit.com/r/barista/comments/1i5xaju/i_dont_need_to_know_omg/",
    "created_at": "2025-01-20T18:34:50.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1lfca2v",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "please dont do this",
    "text": "My cafe offers drip coffee, pour overs, espresso drinks, matcha drinks, and cold brews. This customer just came in, ordered a pour over, no big deal. I told her “it’ll take roughly 5-7 minutes” as I’m the only one on shift and have a line out the door. She says, “UGH, FINE, it doesn’t take that long at home.” She then proceeded to complain about how long it’s taking to prepare as I’m preparing it. Obviously I’m already quite pissed off. 6 minutes later the pour over is fully prepared. I set it on the counter, she comes over and adds 4 SUGAR PACKETS and CREAM to her pour over. It was unbelievable. Just get a drip coffee??? I just had to vent. Does this happen a lot to others?",
    "score": 881,
    "url": "https://reddit.com/r/barista/comments/1lfca2v/please_dont_do_this/",
    "created_at": "2025-06-19T14:31:53.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1lxmzas",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Customer asked what a latte was",
    "text": "Came in and ordered two espressos. I asked if he wanted two shots of espresso, or two separate espresso drinks- he said one espresso with two shots. Then said that he wanted a coffee as well- okay, a separate coffee? No, coffee with the two shots. Okay, so a red eye. I ring it in. He then asks what our strawberry latte is- I tell him it would be just a plain latte with strawberry syrup. Pause. He asks what a latte is. I tell him that it’s just espresso and milk, either steamed if hot or plain if iced. He says “that doesn’t make sense”, pays, and gets his red eye. Its been 10 hours and I’m still confused about this interaction.",
    "score": 795,
    "url": "https://reddit.com/r/barista/comments/1lxmzas/customer_asked_what_a_latte_was/",
    "created_at": "2025-07-12T00:29:37.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1iu5ec1",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "I finally got one",
    "text": "I always saw these types of stories but in my 4 years in the industry I have never gotten an order like this.\n\nA customer came in and wanted a large cup filled with espresso. I said “You want a 20 ounce cup. filled to the top… with espresso…” He said yes and that it shouldnt be more than 8 shots. At my shop additional shots are the same price as a single shot on its own, so I knew it was going to be pricy. I checked it on the register and it came out to around $18. I told him this and why it was so expensive and he decided he didn’t wanna pay it. I offered him a regular coffee with extra shots in it or an americano with extra shots so the price was better and he decided on a large drip coffee with a quad shot. He proceeded to have me put in 25 raw sugars. 25!!!! I have never in my LIFE have been so concerned. And he wasn’t young either! How is he still alive? 😭\n\nI never thought that those stories were real until now, I am absolutely flabbergasted 💀",
    "score": 762,
    "url": "https://reddit.com/r/barista/comments/1iu5ec1/i_finally_got_one/",
    "created_at": "2025-02-20T18:23:54.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1k7jrrd",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "\"Latte, no milk\"",
    "text": "Inspired by the cortado, no milk story I just read.\n\nThis past week was insane at work. Lots of out of towners who don't know what they want and while I generally like helping guests figure out a great drink option, I was really feeling the stress. This group comes up and orders and the woman says, \"latte, no milk\".\n\nI say, \"huh?\"\n\n\"Latte, no milk \"\n\n\"That's...not a thing.\"\n\n\"My friend asked me to order and that's what she wants.\"\n\n\"Ma'am I can guarantee that is not what she said.\"\n\nSo she calls the friend over, who orders a latte with ALMOND milk. I guess she was misheard and her friend didn't know enough about coffee to know that the order made no sense.",
    "score": 726,
    "url": "https://reddit.com/r/barista/comments/1k7jrrd/latte_no_milk/",
    "created_at": "2025-04-25T12:32:22.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1i5255t",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "How long have you been a barista for and how old are you? ",
    "text": "Hi!  \nM30 here, barista for 5+ years now and I’m wondering where the average is situated.  \n\nI love this job, I have been manager and even owner of my own coffee shop and I am now back in the payroll as Barista.  \n\nI could do this job forever while my friends are all having careers for the best and the worst.  It’s awkward to be a barista at 30yo when society (friends, family) sees it as just a student job. \n\nI am not sure how long I am going to keep this lifestyle. I absolutely love the job and the life balance that it brings, it keeps me social and healthy and plenty of time for myself.  \n\nBut the margin in this industry are so tight and I am now considering changing for a job with higher revenues because I’d like to have kids.  \n\n",
    "score": 386,
    "url": "https://reddit.com/r/barista/comments/1i5255t/how_long_have_you_been_a_barista_for_and_how_old/",
    "created_at": "2025-01-19T16:20:41.000Z",
    "num_comments": 321
  },
  {
    "id": "reddit-1k72gro",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Do you have one of these regulars? I hope so.",
    "text": "So I used to be assistant manager for a shop that's no longer there (The location closed down when covid happened).\n\nI had this regular named Gary that came in twice a day for his 12oz mocha - no lid. He was probably late 80's? He was usually the first customer of the day and then again later in the afternoon. Got his drink and then went outside to smoke his cigarette. I'm talking daily routine. If we didn't see or hear from him for longer than a day, we would have other regulars keep their eye out on him. We would ask the closer to text us to make sure he came in. \n\nHe would meet his kids and grandkids almost every sunday at the shop. His kids (late 40's/early 50's) would thank all of us employees all the time. We were his friends. He was the shop mascot. Retired military. We. Love. Him.\n\nFound this poem that he had written me for my birthday. My son was just born (September) and my birthday is in October. \n\nThat son is now almost 10 years old. I'm almost 37.\n\n(I'm starting to cry now. I need to stop crying to Reddit.)\n\nI think about this regular allllll the time. I've always wondered where or if he is still alive. I saw this guy twice or more a day for 6ish years. He was there when a lot of weird stuff was happening in my life. And he was always there to ask/talk about it. \n\nI've been working in coffee for 15+ years. This man is a pillar in my coffee career.\n\nIt reads:\n\n**Happy Birthday, Max**\n\nOf all the people that I have known,  \nOne stands out — just he alone.\n\nMaking his way and measuring up,  \nGreets, collects, and fills the cup.\n\nI know not from whence he sprung,  \nBut when born, an angel surely sung.\n\nLove filled his heart to “Max”-imum  \nWhen his eyes beheld his life’s premium.\n\nAnd the gentle hands of dearest one  \nGifted Max with a handsome son.\n\nHis presence: confident, dignity, serene,  \nSuch barista-ness I have never seen.\n\nThis sonnet now has reached its end.  \nI dedicate it to my friend.\n\n**Best of life, always.**  \n**Gary**",
    "score": 154,
    "url": "https://reddit.com/r/barista/comments/1k72gro/do_you_have_one_of_these_regulars_i_hope_so/",
    "created_at": "2025-04-24T20:25:55.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1nuffwt",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "3rd barista job, finally in a 3rd wave cafe!",
    "text": "Hey all, I've been a pro barista for more than 7 years now. I finally got a job at a spot that does their own roasting and has a very strong and independent sense of purpose. It makes me so happy to have made progress this whole time. I feel like all my hard work has paid off and it feels so fulfilling to have the appreciation of my customers and coworkers all along the way.\n\nOn a more melancholy note I am transitioning out of working in coffee full time to pursue massage therapy. I will miss this career. It has taught me so much about people and has made me a more compassionate person. \n\nUntil the final day I will be happy to make people's days better by giving them a boost of energy.",
    "score": 120,
    "url": "https://reddit.com/r/barista/comments/1nuffwt/3rd_barista_job_finally_in_a_3rd_wave_cafe/",
    "created_at": "2025-09-30T14:57:11.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1ozw0ku",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Indoor Coffee Plants Cherried",
    "text": "My 3ish year old indoor coffee plant fruited this year. I was surprised because of how young it is. The remaining 20ish plants all range in age so I’ve got no clue when we’ll see cherries on them.\n\nStrongly recommend career baristas to grow at least one plant from seed to learn from the ground up. It’s fascinating how much you research and pick up just growing the damn things",
    "score": 113,
    "url": "https://reddit.com/r/barista/comments/1ozw0ku/indoor_coffee_plants_cherried/",
    "created_at": "2025-11-17T23:28:26.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1iqku8a",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Long term - career baristas, how are you doing it?",
    "text": "Pretty vague question. I’m 26 and always been in food service. Starbucks Barista, Mom &amp; Pop cafes, Juice Bars, Lavazza. I’ve been doing this full time since 2017. I graduated college but nothing and I mean absolutely nothing attracts me to the 9-5 office corporate life. Currently I work F&amp;B department in a hotel along a high volume tourist destination, i switch between Starbucks, Lavazza, and Banquet serving. This is the most I ever made as a barista making anywhere between $19-$40/hr plus all the corporate benefits. I can honestly be here forever, but off season is so rough I’m reliant on a roommate or partner — if it was consistent year round I would be set. We’re on the beach, we watch the sunrise, everyone is on vacation or retired so it’s pretty chill. I have developed so many relationships with the locals and the snowbirds. \n\nNow for obvious reasons, this is not sustainable long term as cost of living is always rising. So i’m curious for the long term/career  baristas how are you doing it? Other jobs? Strict budgeting? Second jobs? Full time jobs? Roommates? Partners? Promotions? Owning cafes? ",
    "score": 82,
    "url": "https://reddit.com/r/barista/comments/1iqku8a/long_term_career_baristas_how_are_you_doing_it/",
    "created_at": "2025-02-16T05:06:36.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1medbxq",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Almost 40 and back working at Dutch Bros, and I just can't keep up.",
    "text": "This is my fifth time working in coffee, and my second time working at Dutch Bros. I'm from the town Dutch Bros started in, and I used to work there 20 years ago, when it was a much simpler, different company. \n\n My wife and I are struggling to make our mortgage payments, and we have a third kid on the way, and realized that I needed to quit the part-time job I was working from home and go out and get another part-time job that paid better.\n\n I wish I didn't feel so old and slow. The pace that we are required to move at feels almost impossible for me. Our drive-thru line is almost always full, and the customers are demanding, and often show up looking for TikTok drink creations that they want made picture perfect.\n\n Don't get me wrong, I love working in coffee, but I've hit an age where I can't really even have caffeine anymore, I have to limit my sugar, most of my co-workers weren't even alive last time I worked at Dutch Bros, and I just feel ancient and ashamed that I haven't gotten a career started before now.\n \n I'm proud that I'm a present Dad, and I have usually been the one home with my kids. I do 90% of the diaper changes and 100% of the night time wake ups, but working this job is just slowly eroding my self-esteem. I'm worried that it moves at a pace that I just can't keep up with, and I don't want to be fired from it.\n\n Any other elder millennials out there working in coffee, struggling to keep up with the kids?",
    "score": 53,
    "url": "https://reddit.com/r/barista/comments/1medbxq/almost_40_and_back_working_at_dutch_bros_and_i/",
    "created_at": "2025-07-31T20:59:35.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1in036z",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Coffee jobs 70k+ salary?",
    "text": "Being a barista is notoriously humble, to say the least. Has anyone ever made over 70k in coffee? If so, what jobs were they?",
    "score": 48,
    "url": "https://reddit.com/r/barista/comments/1in036z/coffee_jobs_70k_salary/",
    "created_at": "2025-02-11T14:41:54.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1kjdid8",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Avoid working for Alma Cafe London at all cost",
    "text": "Absolutely messed up and rotten management from the top. \n\nYou're expected for so much but you're paid so little, you're expected to overwork and they try to save as much money as they can just to avoid giving staff hours (which again, money). They won't tell you, but their feedback indicates that staff to be a speedy robot to be here and there and be able to do everything at the same time. They keep adding more and more workload and expect you to do more, but unfortunately your salary remains the same, london's lowest, regardless you have the skills for coffee, service and juices all together. \n\nLine manager can insult any staff behind their back only because this person is cynical and arrogant. They will point out everything they don't like and say it's the team's fault.  They could find ways to make your work life feel difficult because they take things personally.  \n\nYou will feel exhausted, frustrated and anxious working in this place. Everyone's exhausted and unhappy. Staff are mostly nice to each other, because we have no other choice but to be kind and united in such a situation. But if anyone had the chance, we'd just run away from this place. Even customers notice staff keep changing, no wonder why. \n",
    "score": 38,
    "url": "https://reddit.com/r/barista/comments/1kjdid8/avoid_working_for_alma_cafe_london_at_all_cost/",
    "created_at": "2025-05-10T15:55:57.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1mczbk5",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "am i making a terrible decision career wise?",
    "text": "i recently turned 22 and i’ve worked in food service since i was 17. i’ve done bartending, serving, and everything pretty much in between besides managing. i’ve dropped out of college not once but twice but due to being confused about what i want to do long-term. i’ve recently become a barista at a local coffee shop and within two months of me being there, my general manager has asked me to become an assistant general manager. it comes with a pretty big pay increase and more steady hours but as of the past two years i’ve consistently wanted to go to cosmology school with dreams of not only becoming a cosmologist but also owning my own coffee shop one day. my parents keep pressuring me to not accept the offer and to keep my “head on track” by enrolling in college but i think this would give me great experience at a job i throughly enjoy and can see expanding my career with. i really want to accept and go through with the offer but am i going to regret not going to school sooner? am i wasting time? to anyone that’s read this thank you so much(^.^)",
    "score": 33,
    "url": "https://reddit.com/r/barista/comments/1mczbk5/am_i_making_a_terrible_decision_career_wise/",
    "created_at": "2025-07-30T06:32:55.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1hze0kt",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "People who have been working in cafes your entire life, how satisfied are you with where you're at?",
    "text": "Pretty much the title. I'm nearly finished with high school and right now I don't really have any desire to pursue further education and I'm considering some kind of career in hospitality. So I'm curious, people who either chose or just kind of ended up in hospo your entire life, are you happy with it? Do you regret not going into other fields, or going to university/finding a job related to a degree you have? Are you able to survive comfortably in your position, or have you needed multiple jobs? Do you have any advice you think is useful? Thanks in advance. 🙏",
    "score": 29,
    "url": "https://reddit.com/r/barista/comments/1hze0kt/people_who_have_been_working_in_cafes_your_entire/",
    "created_at": "2025-01-12T03:46:15.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1ln2bo1",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Burnout… kinda",
    "text": "Does anyone feel like being in the service industry has eliminated any sort of goals you may have had? Recently my mom asked me what my dream career would be and I couldn’t think of anything. Someone asked me what I’d be doing if I wasn’t a barista and I couldn’t come up with an answer. I certainly have aspirations but even now as I’m sitting typing this, I can’t think of what I’d be doing or what i want to do. I certainly don’t want to be a career barista (absolutely nothing wrong with that) bur I seem to have lost all of my goals somewhere in the many years I’ve been doing this. ",
    "score": 27,
    "url": "https://reddit.com/r/barista/comments/1ln2bo1/burnout_kinda/",
    "created_at": "2025-06-29T01:05:01.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1k48fyr",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "I found that I like coffee but I don't like customers (some of them)  :(",
    "text": "I just started my part-time barista career somewhere in Asia for less than 2 weeks. I like coffee a lot. I still remember how excited I was when making the first latte art on my own. And most of the customers are nice and simple. But those who are being picky and mean have make me worn-out. I'm strugglin' right now. Should I keep on? Is this a situation that all baristas had thought about when they started up?",
    "score": 23,
    "url": "https://reddit.com/r/barista/comments/1k48fyr/i_found_that_i_like_coffee_but_i_dont_like/",
    "created_at": "2025-04-21T08:23:00.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1ltwbm9",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "What career can I build from being a barista other than a cafe manager? My job is changing and I feel deflated.",
    "text": "I’ve been in the coffee industry since I was 21- now 27. I recently got a job as a Lead Barista Trainer and thought finally, I’m out of normal hospo and this is my way up the ladder. Stick this out for awhile and then I can move up the company and become head barista trainer or something like that. \n\nThey’ve just announced that the place I work in/train will now just be me and another already trained barista as they want to elevate service which feels like I’m back to square one. I feel dumb for complaining as they’d  be upping the pay, still have consistent Monday-Friday only hours and technically my job would be easier as I wouldn’t be with different level baristas changing on the daily but I just feel trapped as a barista with no growth. \n\nWhat jobs are there related to coffee that aren’t on the floor as such? I’m getting tired but I love coffee but just don’t know how to wiggle out of being a barista. Other jobs that are just regular office jobs are all entry level but don’t pay enough so without any experience in anything else it feels like a trap. \n\nHelp! (Based in the U.K.) ",
    "score": 21,
    "url": "https://reddit.com/r/barista/comments/1ltwbm9/what_career_can_i_build_from_being_a_barista/",
    "created_at": "2025-07-07T14:56:25.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1ligctn",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "barista at a hotel vs barista at a local cafe",
    "text": "I have 6 months of experience as a barista and recently got job offers from two places: a 5-star hotel downtown (about 40 minutes away) and a busy local coffee shop (20 minutes away). The pay difference is only $3, so it’s not a big deal. \nWhich one would be better for my career growth?",
    "score": 18,
    "url": "https://reddit.com/r/barista/comments/1ligctn/barista_at_a_hotel_vs_barista_at_a_local_cafe/",
    "created_at": "2025-06-23T13:17:47.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1p3dfsa",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "managers getting tips...",
    "text": "hello! i work at a cafe where baristas get 80% of the tips and the 20% goes to the bakers (me). The two managers who work in the cafe, 1 of them works as a barista and the other works sometimes baker but not alot, they both get tipped out. They are on salary, not sure how much but enough to talk about getting a house soon. \n\nI find it really unfair especially for how little bakers we have in the cafe (3 including me) :/ does anyone else's managers get tipped out too? They arent the owners by the way, the owners dont work at the cafe ever but the managers do. ",
    "score": 13,
    "url": "https://reddit.com/r/barista/comments/1p3dfsa/managers_getting_tips/",
    "created_at": "2025-11-21T23:10:49.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1hmu94f",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "ideal benefits for coffee shop manager",
    "text": "I work at a very small local shop. i’m the main barista/ manager along side the owner and one other part time employee. i was hired on at about minimum wage with the expectation that as i take on more responsibilities i would get a higher wage. this has happened. I was asked today to think about what sort of salary/benefits goal expectations i have. any thoughts on what i should ask for/ what are industry standards that are common for this role. \n\nthanks!!\n\nedit: I’m not entirely sure what the full scope of responsibility is quite yet. I think the plan is for me to take on training new folks if and when we need more, doing the grocery runs/ ordering, scheduling artists for showings, coordinating retail (we only keep local/ women owned artists), and help coordinate any events either we host or when people rent out the space. Currently I make grocery lists, all food prep including making all syrups in house, make yogurt parfaits and other grab-n-go, make almond milk, bag retail bags of coffee. I’m also the main barista so managing day to day customers and all deep cleaning and usually all of the closing duties are all me. \n\nAlso for experience I was an assistant manager at a bigger chain coffee company(not starbz), and i was a coffee shop super at another local chain for 3 years, so a total of 3.5 years experience in this type of role just nothing this small. \n\nThanks again for everyone’s input it’s been really helpful. ",
    "score": 13,
    "url": "https://reddit.com/r/barista/comments/1hmu94f/ideal_benefits_for_coffee_shop_manager/",
    "created_at": "2024-12-26T18:15:25.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1o98fgm",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Why is it so hard to get a Barista job?",
    "text": "Hi, I'm relatively new to the Barista world, and have always wanted to work as a barista and stick it out for many years. Once I go into a career or so, I also want to keep working as a barista alongside. I have been in food service/hospitality for kind of long now, and I truly love this feild of work. I am searching for a second job and I really want to be a barista. The job market is sadly making it difficult for people to get jobs, and it's hard to support myself and pay rent while making part-time money as a college student.\n\nI work on campus, and I love my job. We also have coffee shops on campus that I had an opportunity to work in, but it would cause me to have to transfer (residential to retail), and I would end up with lower pay and less hours, because the coffee shops here are strict with how much staff can work at a location at a time. I am trying to secure a second job somewhere, because if I transfer in the future, I would even more so need a second job. Right now, I'm staying in my current dining location, which is also really love, and luckily I have permission to occasionally support the coffee shop from time to time. But I've been trying to search for barista jobs near by me, and it's been really hard to get.\n\nI tried really hard on my application, resume, and interview process. But I feel like talking about my minimal coffee experience might be what hinders me, even though I try to explain the restriction campus jobs give to how many hours a student can work in a week. However  off campus, a student can work as much as they want. I might need some advice on how to perform better at interviews and stick out as a good coffee candidate, because I am always willing to learn and I am q very hard worker and enthusiastic person. I also truly enjoy barista work, and I also really enjoy putting my heart into every drink I make for customers, and I have cash handling experience. But it's so hard to truly land a job. Sometimes I'm luckily to land an interview and sometimes I'm not. I'll figure it out but I might need some guidance. \n\nA lot of baristas say that the job is so much harder than it seems and that it takes skill, and I believe that, I really do. I k ow I truly like that type of work and want to pursue it. So, I have two choices. I can either secure myself a second job at another type of work and then transfer to the campus coffee shop, or I would have to keep working where I am and try to secure myself a second job at a coffee job which is very hard to do. I know that the job market in general is hard for everyone but I'm really struggling. But Coffee is amazing work, and I truly love it!\n\nI guess my real question is,\nwhat would make me stick out as a good barista candidate?",
    "score": 13,
    "url": "https://reddit.com/r/barista/comments/1o98fgm/why_is_it_so_hard_to_get_a_barista_job/",
    "created_at": "2025-10-17T18:00:07.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ozygmj",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "What are some barista related things to pursue career wise that aren’t owning a business?",
    "text": "I really struggle with ADHD. Even medicated I don’t think I’d be able to learn the amount I’d need for a business degree let alone uphold the expectations of a functioning business, and I want what I do to be filled with passion and love, not let a team down with my weaknesses. \n\nAny suggestions on an alternative path?\n\nEdit: I do prefer the opportunity to craft hands on. I do love customer service. \n\n- a burnt out Starbucks barista looking for purpose\n",
    "score": 13,
    "url": "https://reddit.com/r/barista/comments/1ozygmj/what_are_some_barista_related_things_to_pursue/",
    "created_at": "2025-11-18T01:14:14.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1lrdrll",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Stuck in a rut",
    "text": "I’ve been a barista both full and part time for the past 5 years, and while coffee is a big thing (with new cafes popping up every week or so)… I think I’m stuck.\n\nIn the past, I’ve had 9-5 jobs (that’s the norm here) and I don’t think I’m suited for that office life so I ended up being back in this industry.\n\nWhile I love being able to interact with customers, passionate coffee lovers, and see how they enjoy coffee… I feel like my skills and development aren’t expanding, and there’s nothing much to learn (from where I am, at least).\n\nI’ve been reflecting on my career lately and I thought I would post it here. How do I… get unstuck?\n\nI’ve been thinking of taking courses, joining workshops but I’m honestly not sure if it’s worth it. I do feel like I can learn a lot more.\n\nIt’s giving me an “impostor syndrome” and I hate it. While everyone is saying that “I make good coffee” I feel like it isn’t enough.\n\nMy goal is to open my own shop one day but with cafes from where I’m from sprouting up everywhere like mushrooms, I’m not sure if it’s viable as the market is getting *very* saturated.\n\nAm I the only one feeling like this?",
    "score": 12,
    "url": "https://reddit.com/r/barista/comments/1lrdrll/stuck_in_a_rut/",
    "created_at": "2025-07-04T08:39:36.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1lunmuo",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Starting out as a barista?",
    "text": "I'm a 20yr old university student who, frankly, hates the course I'm at and want something different for my career. I may have a knack for what I'm studying rn but I really hate it. Coffee is one of the things I'm really passionate about. There's just something about that drink that makes me feel happy or comfortable. I  picked up a book about starting to be a barista back when I was in elementary school (yeah, my caffeine addiction started pretty early) and remembered being very intrigued about owning a coffee shop. Sadly, that book is knowhere to be found now and I've forgotten most of its content. So now, I'm at my study table drinking coffee wondering how should I start my journey as a barista. Aside from applying to a local coffee shop to gain experience, what should I do to start? What tools would I be needing for basic stuffs that I need to practice? What books would help me to get started? I will appreciate all the advice and comments that you guys will give to me.",
    "score": 10,
    "url": "https://reddit.com/r/barista/comments/1lunmuo/starting_out_as_a_barista/",
    "created_at": "2025-07-08T12:45:48.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1kbr9so",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "What Should I Do? part II",
    "text": "What should I do?\n\nShould I just terminate my probationary contract?\n\nSo I recently got hired as a barista. The contract says I have two months of probationary work, but I’ve only been there a week and honestly? It’s been rough.\n\nI actually love my co-baristas. They're cool, helpful in their own way. But the manager? Oh man. She's something else. She was the one who interviewed me, and from Day 1, she hasn’t stopped bragging about how “superior” their coffee shop is compared to others.\n\nLike, on my second day, she asked me how many drinks we served at my old place. I said around 15, and she immediately went, “Ah, that’s why,” with this smug tone like that’s the reason I’m \"too slow\" for their standards. Mind you, I’ve barely had any proper training. I was trying to follow their formula the best I could, but everyone including her kept eyeballing the ingredients instead of using a scale. Then when I did the same? Suddenly it was wrong and I got blamed for it.\n\nBy my third day, I was scheduled to close. My manager started rushing me through inventory, restocking, and deep cleaning all while she was literally waiting to leave so she could go home, since she had to open the next morning. Thing is, no one had actually taken the time to walk me through their closing system. I was piecing it together the best I could. And then get this she just straight up left. I thought I was done, finally, but then she calls me from while i was cleaning to tell me I didn’t shut the machine down properly. Like, seriously?\n\nThen she hits me with, “Weren’t you head barista before? You should already know this.”\n\nI haven’t once shown attitude or acted like I knew better. I’ve just been trying to keep my head down and do the work. I even told her, I know I have experience, but I’m starting from scratch here. Every shop is different, right?\n\nIt’s only been a week, and I already feel drained. I have the option to terminate my probationary contract. I just don't know if it's worth staying for the rest of it or if I should just cut my losses now.\n\nWhat would you do?\n\nUPDATE : \n\nIt's been a month! \n\nI got pissed again yesterday. Things were already okay between me and the manager before I went home. But earlier, before my shift ended, we were discussing the monthly schedule. I had put in a time-off request for my exams, but she said it couldn’t be fully approved like two of the days wouldn’t be granted. Then she asked, \"What’s this every Tuesday and Friday?\" I told her those are my school days, so I’m hoping to have them off this May. Then she said, “That’s not possible.” I replied, Ma’am, I can still come to work those days, but I’ll be late because my class ends at 4 PM.” Her response? That’s not my problem.”\n\nMan, I swear, my blood was boiling. My co-barista heard her say that and looked at me, even did a finger gun gesture. I said, “Looks like I’m leaving earlier than expected.” We already talked about this during my interview that my school days couldn’t be compromised. She even asked for my class schedule. So what’s the point?\n\nIt’s just frustrating we had this conversation during the hiring process. They knew my school schedule. So what was the point of all that if they’re just going to ignore it now?\n\nI'm planning to give them my notice as soon as I get my salary. I’m done with this place.\n",
    "score": 9,
    "url": "https://reddit.com/r/barista/comments/1kbr9so/what_should_i_do_part_ii/",
    "created_at": "2025-04-30T21:00:48.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1njdikj",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Shift lengths changing for college student workers",
    "text": "I'm looking to see if I'm overreacting here!\n\nI'm a senior staff barista (27F) in a very small college town. We have one owner(~40sF) and a staff of about 9. A handful of the baristas are college students. As of late, the length/time of shifts changes weekly for the baristas who have classes. For example, the midshift would always be 7a-1p. Once or twice a week, on a random day, the shift will be changed to 7a-2p or 2:30p. This is very clearly meant to work around the closer (typically a student's) class schedule, but it's never on the same day or asked of the same mid-shift barista. None of these changes happened with the consultation or warning to any other workers. Personally, I'm struggling to keep up with the changing shift lengths and know how long i'm *actually* supposed to be working.\n\nI feel it's also important to note that our owner explicitly prefers having young college women work here rather than any full time or career baristas. I'm one of the oldest members and going on my 6th year here, and the owner has blatantly discouraged me from dedicating more time here because this \"is a transition job, not something someone can make a career from\". Of course this was said after i already climbed some ranks and got a special position working with food in our establishment. \n\n Maybe I'm just bitter about a few things in the shop and projecting it onto any aspect. But i'm curious to see if others think this scheduling thing is rude and inconvenient to non-college student workers. AIO? ",
    "score": 9,
    "url": "https://reddit.com/r/barista/comments/1njdikj/shift_lengths_changing_for_college_student_workers/",
    "created_at": "2025-09-17T13:42:22.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1liv153",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Lifelong Injury",
    "text": "Anyone else ever sustained lifelong damage/ career ending injury from being a barista?\nRecently diagnosed with osteoarthritis in my right DRUJ (wrist joint) from repetitive movement and many work related injuries over the years, and have been forced to leave the industry as a result (I'm right handed so not much I can do to avoid using it)\nI've heard of a few people who have injured rotator cuffs and wrists and other joints of the sort, and it's caused them to leave, but almost want to get a scope for how big the problem is.\nDoes anyone else think that there needs to be more done for injury prevention? Don't get me wrong, I know steps have been taken like the invention of automatic tampers, but I genuinely feel like more baristas need to be taught the importance of looking after their hands and arms and ways to prevent injuries so it doesn't get this far.",
    "score": 9,
    "url": "https://reddit.com/r/barista/comments/1liv153/lifelong_injury/",
    "created_at": "2025-06-23T22:50:58.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1oz4fy1",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Hot water machine",
    "text": "Hey all, I’ve worked at one tea shop(bear with me) my entire barista career. We’ve gone through a hot water every 6-8 months. Just one day the machines will not get above 50C instead of 100C. We do turn it off daily, is this a factor to the problem? It’s running off of city water which is hard water and could be rusting the anode. But we’ve had other issues with water getting into parts it shouldn’t be like the electronic board. \n\nIs this normal? What brand for hot water machine does your coffee shop or tea house use? ",
    "score": 8,
    "url": "https://reddit.com/r/barista/comments/1oz4fy1/hot_water_machine/",
    "created_at": "2025-11-17T02:24:04.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1m5xksd",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "To the coffee educators",
    "text": "Hello friends! What was your path on becoming a barista trainer / coffee educator? \n\nI’ve been a barista for the better part of 10 years now, and I’ve been wanting to be a specialty coffee educator. I currently teach coffee to inmates at a jail facility, but that’s only freelance work and mostly foundational. I’ve gotten really close to a salaried barista trainer position (for a big named company I shall not say), but unfortunately no luck. \n\nI feel these roles are hard to come by. Do I join a company with a clear path for internal growth? Do I join a roastery and go the QA / account manager route? Do I become an Authorized SCA Trainer?  I suppose all of these are valid pathways but I’m curious how everyone else did it!\n\nThanks a bunch!!\n",
    "score": 7,
    "url": "https://reddit.com/r/barista/comments/1m5xksd/to_the_coffee_educators/",
    "created_at": "2025-07-21T22:48:31.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1pn1nao",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "I cannot for the life of me make silky milk",
    "text": "I’ve gotten training both from my boss and a career barista from the company we get coffee from.\n\nAnd I rarely ever get silky milk. It always has little bubbles all over the top and throughout the milk. I’ve tried giving less air, but then it just ends up being really liquidy hot milk - like I might as well have just microwaved it.\n\nSo what I was taught from my boss: Angle the cup a little, starting with a tiny bit of the line of the tip peeking out of the milk, then pull down little by little until the pitcher is too hot to touch. Wait a few seconds - and turn off the machine.\n\nWhat I was taught from the career barista: Angle the cup a little, starting with a tiny bit of the line of the tip peeking out of the milk, then pull down little by little until the pitcher is skin temperature, then push pitcher back up to fully submerge the wand. Tap it out. Twirl. Pour.\n\nEither way I do it, there’s so many little bubbles. I sometimes feel like I get silky milk more when I’m trying to make a cappuccino than when I’m trying to make a latte. Tap it out. Twirl. Pour\n\nAnd this isn’t about the crema - I swirl that before pouring in the milk. The milk itself in the pitcher prior to being poured into the espresso has tiny little bubbles.\n\nAny advice welcome. This is frustrating me so much.",
    "score": 7,
    "url": "https://reddit.com/r/barista/comments/1pn1nao/i_cannot_for_the_life_of_me_make_silky_milk/",
    "created_at": "2025-12-15T07:38:25.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1k5nrp6",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Newly hired barista: need resources",
    "text": "Hi all! I'm looking to see if anyone has any handouts, or PDFs, or YouTube videos recommendations, or anything that can help me in this new journey as a barista. I worked at Starbucks in 2021. I was honestly disappointed because I didn't realize that it was going to be so different than what I saw at my local coffee shops. \n\nNo coffee shop wanted to hire me because I had no actual barista experience. When I mentioned Starbucks I knew it was going to ruin my chances. However, I finally landed a job and would love to persuee this as a Career, I don't care what anyone thinks, I love coffee, it's an art, and I love the passion people put into it. \n\nI would like any tips or resources of any kind. I've tried looking up videos but I also like to read or print out any sheets that will help.  I know it'll be different than when I'm hands on, but I'd like more knowledge coming in so I can show that even though I was at Starbucks, Ive got that passion in me.",
    "score": 7,
    "url": "https://reddit.com/r/barista/comments/1k5nrp6/newly_hired_barista_need_resources/",
    "created_at": "2025-04-23T01:55:51.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1oxbenr",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Baristas Jobs- Needs, Nice-to-haves, etc.",
    "text": "Hi everyone!\n\nI’m finishing up my MBA and developing a plan for a small chain of affordable, accessible, hobby-focused cafés. The concept takes inspiration from Aldi (a lean, simplified menu with solid quality at great prices), Ikea (retail + café synergy), and Patagonia/REI (ethics, community, and employee focus). The first locations would be in the Midwest.\n\nI’d love feedback from baristas, shift leads, and café managers on whether these role expectations and benefits feel realistic.\n\nBaseline commitments:\n- Health insurance, with the company eventually covering employee premiums\n\n- Livable wage (~$18–20/hr + low-pressure tips)\n\n- 3 weeks vacation in years 1–3\n\n- Standard EEO and inclusive hiring practices\n\nNice-to-haves:\n\n- Career development and transparent back-end/business training\n\n- Free shift drink/snack\n\n- 1–2 provided lunches per week\n\nI’m also exploring a small high-school intern program for light café duties, paired with short “micro-classes” on business basics.\n\nOne important philosophy: I want to avoid online ordering and keep the café walk-in only—focused on in-person interaction and rebuilding real community.\n\nWould appreciate any insights on what seems solid or what needs rethinking!",
    "score": 6,
    "url": "https://reddit.com/r/barista/comments/1oxbenr/baristas_jobs_needs_nicetohaves_etc/",
    "created_at": "2025-11-14T23:00:14.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1pgbx3y",
    "subreddit": "barista",
    "soc_codes": [
      "35-3023"
    ],
    "title": "Career Advice Appreciated!",
    "text": "hi everyone! \n\nI’ve been a barista for roughly 5 years, have been a shift lead, and most recently a manager for about a year and am now looking to transition into wholesale work. I’ve been lining up interviews and excited to transition into a different perspective of the coffee world and hope to expand in coffee or into other parts of food &amp; bev world after doing some time in wholesale. Based in NYC. \n\nAny advice you might have about this transition,  navigating office-life after being behind the counter + working the floor, how to meet targets, what can be learned on the job and what can’t be, etc. much appreciated. Extra gratitude to big city perspectives. Hope y’all are taking care this winter! ",
    "score": 6,
    "url": "https://reddit.com/r/barista/comments/1pgbx3y/career_advice_appreciated/",
    "created_at": "2025-12-07T06:55:32.000Z",
    "num_comments": 1
  }
]