[
  {
    "id": "reddit-1m2w99p",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "WARNING to anyone using WeTransfer to send files",
    "text": "WeTransfer have updated their T&amp;Cs, which is a shocking breach of copyright in my opinion - read 6.3 for the full statement, but this is the worrying part:\n\n'You hearby grant us a perpetual, worldwide, non-exclusive, royalty free, transferable, sub-licensable license to use your content'......\n\n'Such license includes the right to reproduce, distribute, modify, prepare derivative works'....\n\nThis is unbelievable! Thought it was worth informing others who use this service.",
    "score": 4161,
    "url": "https://reddit.com/r/Filmmakers/comments/1m2w99p/warning_to_anyone_using_wetransfer_to_send_files/",
    "created_at": "2025-07-18T07:50:03.000Z",
    "num_comments": 403
  },
  {
    "id": "reddit-1l1flvk",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I Quit My Job to make the Japanese Horror of my Nightmares",
    "text": "**I quit my 5-year teaching job three months ago to pursue directing full-time here in Japan.**\n\nA few months back, I shot this fake trailer in Tokyo and put it up on YouTube titled *“This Movie Doesn’t Exist. Here’s the Trailer.”* Made with tax returns, friends, mid-day pizza, and late-night coffee.\n\nMy original goal was to become a trailer editor.  \nBut with no films to cut, I made my own.\n\nAnd it WORKED!\n\nThe trailer hit 66k views. I landed trailer editing jobs.  \nBut then people in the comments kept asking for the real film.\n\nI joked about it not existing. But after 100s of comments, I started to believe it *could*.\n\nNow, we’re turning it into a real film.\n\n**The story:** \n\nA psychological horror about a parasite that lives on a man’s face.  \nThink early 2000s J-horror meets *Perfect Blue* — with a little dry comedy beneath the dread.\n\nI’m the writer, director, costume designer, SFX, and post team — all on a micro-budget.  \nLuckily, I brought on Keita Arai (*Netflix’s City Hunter*) to star, and we’re keeping the production as raw and intimate as the trailer.\n\n**And we’re live on Kickstarter** 👉 [https://www.kickstarter.com/projects/kdwilson/it-doesnt-exist-a-thriller-film](https://www.kickstarter.com/projects/kdwilson/it-doesnt-exist-a-thriller-film)\n\nI’ve learned more about filmmaking in the last 3 months than I did in 5 years of teaching and side jobs.\n\nHoping this community can support — even just by sharing\n\nThanks for reading,  \n— K.D. Wilson",
    "score": 2662,
    "url": "https://reddit.com/r/Filmmakers/comments/1l1flvk/i_quit_my_job_to_make_the_japanese_horror_of_my/",
    "created_at": "2025-06-02T11:29:29.000Z",
    "num_comments": 181
  },
  {
    "id": "reddit-1mp1wpp",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Not paid in 1.5 years as an AD - movie called the Barista",
    "text": "I was the Assistant Director—and at times, even acted as the Line Producer—on the film The Barista, which wrapped in May 2024. I still haven’t been paid.\nWhen I called out the director and producers on social media, they threatened to sue me for “embarrassing” them.\nThe producers and director of the project are:\n\n* Brian Shackelford - Director/producer\n* Joyce Fitzpatrick - Producer\n* Marc Harris - Producer\n* Carolyn Nelson Henry - Producer\n* Vivian Matito - Producer\n* David Skato - Producer\n* Doug Schwab - Producer\n\nI was hired at the very last minute—literally confirmed the day before filming began. All I was told:\nIt would be a 10-day shoot.\nThe script was over 100 pages.\n“Most” cast and crew were confirmed (they weren’t).\nThe crew constantly changed, key roles were filled last-minute, and locations were still being found during the shoot. There was no production designer or production assistants—I did much of that work myself.\n\nWe finished filming in 9 days. After that, they vanished. No communication. No payments. \nCrew members and agents began contacting me about money they were owed.\nThey also broke promises to my friends who helped as PAs, refusing to pay them because they “didn’t have cars.” I drove them to set myself.\nSerious misconduct: An actress had a contract clause requiring an intimacy coordinator. The producers ignored it. \nWhen her agent complained, they dismissed her as “acting out.” She was later injured during a fight scene, and the producers’ response was: “It doesn’t matter, we got the shot.”\n\nI’ve filed a complaint with the California Labor Department and will continue speaking out. I may never get paid, but I won’t stay silent while people like this exploit others.\n\n[Evidence &amp; conversations here](https://drive.google.com/drive/folders/1-IeGCgYQaszmi2spF6o7E_h5Nn69okQK?usp=drive_link)",
    "score": 2286,
    "url": "https://reddit.com/r/Filmmakers/comments/1mp1wpp/not_paid_in_15_years_as_an_ad_movie_called_the/",
    "created_at": "2025-08-13T11:32:11.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1jmqqob",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Reminder: We are not invincible when we film, we can still very much die.",
    "text": "My friend passed away this week and it was completely avoidable. They were out in a storm reccing in the woods and a tree fell over. An amazing filmmaker by all accounts with a career just starting. Noone fought them for safety guidelines and in other sets I've been outcasted for caring too much about the \"what ifs\" and I'm not even the assistant director. \n\nSo the reminder, if the assistant director can't do their fucking job to keep you safe then you have to do it for you. We're making content, it's not the end of the world if it takes an extra day or even worse doesn't get made. But you'll film something the day after as long as you're still here.",
    "score": 1067,
    "url": "https://reddit.com/r/Filmmakers/comments/1jmqqob/reminder_we_are_not_invincible_when_we_film_we/",
    "created_at": "2025-03-29T16:57:34.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1knyvug",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Is Hollywood dying? Yes. Here's why:",
    "text": "Hollywood is built on a foundation of exploitation, censorship, control, and profit-at-all-costs. They couldn't hide it forever and now the shit is visible for everyone to see.\n\nHollywood’s entire structure is based on fucking people over. Whether its distribution deals, studio contracts, or casting, Hollywood fucks anyone not on the inside. They destroy artists, bankrupt studios, steal original materials, are racist as fuuuuuuuuuuuuuuuuckkk and crush indie productions to protect its own stale mediocrity. The “studio system” is designed to keep power consolidated in the hands of a few executives who wouldn't know a good story if it hit them between the eyes.\n\nInstead of championing new ideas, new creators and telling the stories of our time, Hollywood circle-jerks around whats \"safe\"—reboots, sequels, and bland storytelling chosen by committee. Their boardrooms are think tanks for IP asset management. They don't make films; they make content—sterile, focus-grouped, algorithm-churned content. They’re don't create, they repackage.\n\nThey create and protect absolute monsters because they were profitable. From Weinstein to Diddy, Hollywood not only looked the other way—it *actively empowered* them. “Open secrets” are ignored until they become public liabilities. How many careers were ruined? How many victims were silenced to protect weekend box office returns? How many people killed themselves?\n\nIndependent filmmakers are frozen out, underfunded, and treated like amateurs. Hollywood steals their aesthetics and authenticity when those ideas proved lucrative—think Mumblecore, New Black Wave, DIY horror. They take originality, polish it for mass appeal, and sell it back as their own.\n\nHollywood laughed at YouTube, underestimated TikTok, and belittled online creators, and now it's their undoing. DSLR cameras, crowdfunding, streaming platforms, and affordable editing software gave the power to the smaller creators, who don't need studios, don’t need agents, and only need a vision and internet.\n\nWith the exception of the dipshit trump, nothing in existence congratulates itself more for doing less than Hollywood. They hand themselves gold statues for making movies about struggle, justice, and social change—then turn around and blackball those voices in real life. They love to pretend they’re on the cutting edge of progress while maintaining a system that was outdated even in the 70s.\n\nHollywood is dying because it betrayed the medium in favor of market share. It’s dying because it couldn't stop strip-mining its own past for profit. It’s dying because the new generation of storytellers no longer sees it as the dream.\n\nHollywood could have been a cultural legacy for centuries. Instead, it will be remembered as a bloated, elitist machine that finally collapsed under the weight of its own ego, and I don't see a single thing wrong with that.\n\nThe story of Hollywood is the story of America.",
    "score": 929,
    "url": "https://reddit.com/r/Filmmakers/comments/1knyvug/is_hollywood_dying_yes_heres_why/",
    "created_at": "2025-05-16T11:51:05.000Z",
    "num_comments": 253
  },
  {
    "id": "reddit-1i5r2ro",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I am a nobody filmmaker who cast Harvey Keitel in a movie and then got in Forbes. AMA",
    "text": "As a broke nobody who came from nothing and never went to film school, I shot my first-ever film in Cambodia and got a distribution deal with Sony - blew my mind, and opened the door to shooting my second feature and landing a couple names like Arnold Vosloo and Michael Ironside. And  subsequently that got me my third film, LAWS OF MAN, in which I cast and directed Harvey Keitel, Keith Carradine, Dermot Mulroney, and a bunch of others. It released in theaters last week.\n\nForbes came out with a piece on the journey (article attached) which has been a nice counterbalance to the movie getting panned by critics, typical of the highs and lows of this fuckin' rollercoaster of a career. Article here:  \n\n# [Cinema’s Every Man: How Phil Blattenberger Is Reshaping The Industry In His Working Class Image](https://www.forbes.com/sites/joshweiss/2025/01/17/cinemas-every-man-how-phil-blattenberger-is-reshaping-the-industry-in-his-working-class-image/)\n\nI wrote, directed, and produced all three movies. I am offering an AMA if anyone is interested in any part of the journey, especially as it relates to us no-name producers trying to add big name talent, secure financing, getting your ass kicked by the critics, etc. My name is Phil Blattenberger. AMA!",
    "score": 914,
    "url": "https://reddit.com/r/Filmmakers/comments/1i5r2ro/i_am_a_nobody_filmmaker_who_cast_harvey_keitel_in/",
    "created_at": "2025-01-20T14:15:47.000Z",
    "num_comments": 289
  },
  {
    "id": "reddit-1pk0cis",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I made a tiny indie doc… and years later Gus Van Sant made the Hollywood version with Al Pacino.",
    "text": "r/filmmakers **has been with me since around when I started my video career in 2012.** Back then, I was just trying to figure out cameras, storytelling, lighting, editing, etc. This subreddit became a quiet mentor for me. Seeing so many of you share struggles, experiments, failures, and breakthroughs shaped how I approached my own work.\n\nA year later, I dove into creating a documentary about a 1977 hostage crisis in my hometown of Indianapolis. I had no idea what the path would look like. It turned into five years of tracking down people who didn’t want to talk, digging through forgotten archives, restoring footage that was literally falling apart, learning as I went, and piecing together a story that had existed only in fragments.\n\nI wasn’t chasing Hollywood. I just wanted to tell the story as truthfully and completely as I could. Zero budget. No producers. Just a stubborn belief in the project and a lot of late nights wondering if anyone would ever see it.\n\nThen, unexpectedly, people reached out. A screenwriter, Austin Kolodney (who I know is a fellow Redditor, chime in Austin if you want), contacted me. He was scrappy, persistent, and absolutely determined to make a feature film about this story—and honestly, his drive is what pushed the Hollywood version into existence. Without his hustle, *Dead Man’s Wire* wouldn’t have happened the way it did or at all, probably. \n\nAlong the way, I also had an experience with a well‑known director/producer that… let’s just say *did not go well at all*. I won’t get into names or details, but it was one of those classic indie‑filmmaker moments where you realize not every door that opens actually leads anywhere. Hollywood is filled with people who promise big and never deliver. \n\nA few more producers came and went. And thanks to Austin’s great script gaining traction, Werner Herzog signed on, and eventually Gus Van Sant made a feature film based on the same case—*Dead Man’s Wire*, starring Al Pacino and Bill Skarsgård. Somehow, my documentary became the historical foundation the filmmakers looked to while shaping the world of their film. \n\nIt’s surreal. You make something in a room with no guarantees, and years later it becomes part of a major production’s research and reference point.\n\nI’m not posting this as a brag. I’m posting it because I know a lot of us here spend years on projects that feel like they’re going nowhere. We grind, we doubt, we revise, we restart. Most of the work feels invisible. But sometimes the thing you make quietly travels further than you ever expected.\n\nBefore the trailer, I should also mention one more part of the journey: distribution. I went through the festival circuit, then traditional streaming, and now I’m releasing the film on YouTube—each step teaching me how fragile visibility can be for an independent filmmaker. Happy to dig into that if anyone’s curious.\n\nIf you’re curious about the project or want to see how I approached the real story, here’s the trailer.  \nAbsolutely no pressure to watch—just sharing the journey in case it helps someone else pushing through their own project. AMA.\n\n[Trailer](https://youtu.be/gQZMFksVFhU?si=i8YH1ivMZQcJwlIq)",
    "score": 541,
    "url": "https://reddit.com/r/Filmmakers/comments/1pk0cis/i_made_a_tiny_indie_doc_and_years_later_gus_van/",
    "created_at": "2025-12-11T15:29:39.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1kks1xo",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Is the film industry fucked?",
    "text": "I used to get regular work constantly. There were tv shows, features and commercials happening so there was enough to go around. Now trump has announced these %100 tariffs.. am I the only one seeing all the work dry up around me and thinking it’s time to find a real job? What do I even do? I’ve built my career in this industry for 8 years and how is that even transferable to anything else? Feeling pretty low about the future of it all",
    "score": 539,
    "url": "https://reddit.com/r/Filmmakers/comments/1kks1xo/is_the_film_industry_fucked/",
    "created_at": "2025-05-12T13:06:46.000Z",
    "num_comments": 414
  },
  {
    "id": "reddit-1ip6nur",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Streamers are robbing indie filmmakers",
    "text": "I just confirmed with two producers that their films streaming on Amazon Prime are paid 3 cents per 100 hours viewed on the platform.\n\nTHREE CENTS PER HUNDRED HOURS!!\n\nCheck my math, but in order to recoup your budget on a 5-million dollar film, you'd have to rack up over 16 *billion* hours of playback. For a 90-minute film, you could be watched by every single person on planet Earth and still be in the red.\n\nFor comparison, the top-playing content on Netflix in 2023 was Season 1 of the Night Agent (812,100,100 viewing hours). That show would have earned less than $250k from Amazon's pricing model.\n\nThey are spitting in our faces.\n\nMeanwhile, Netflix is paying less for deals while juicing their profit margins. A career producer I know described Netflix as \"the worst buyer he's ever sold to,\" taking months to respond to emails and offering worse deals each year with more strings attached, forcing you to go through distributors who take 20% cuts for doing almost no work...all because...who else are you going to sell to? Amazon?\n\nTruly...who else can indie producers sell to? Are there good buyers out there anywhere? Sales agents and foreign distributors either rip you off or honestly can't recoup past their marketing spend. Streamers have squeezed their business, and indie films can't make money in theaters.\n\nIs it possible for indie films to make money in this market? How?",
    "score": 410,
    "url": "https://reddit.com/r/Filmmakers/comments/1ip6nur/streamers_are_robbing_indie_filmmakers/",
    "created_at": "2025-02-14T09:11:17.000Z",
    "num_comments": 116
  },
  {
    "id": "reddit-1j3wnjf",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "How did Quentin Tarantino actually start his career?",
    "text": "I know he worked at a movie store and studied movies and acting while working. \nI guess my question is, don't you need a budget to make any project decent? Were actors just working for free? Or just getting paid a small amount? Did he happen to have old money that he put to use? This is all I'm trying to wrap my head around when it came to production for his projects. \nI apologize if this a dumb question but im genuinely curious and have recently had a big interest in the film industry. ",
    "score": 400,
    "url": "https://reddit.com/r/Filmmakers/comments/1j3wnjf/how_did_quentin_tarantino_actually_start_his/",
    "created_at": "2025-03-05T06:13:10.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1ofzcdl",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "They say you can’t make a real film with nothing. I just did.",
    "text": "I’m Kyle, a filmmaker from Long Beach, CA.  After years building under El Primo Brand, I just laid the cornerstone for what real indie cinema can look like.\n\nI spent years chasing budgets, crews, and approval until I realized the system I wanted into doesn’t work for filmmakers like us. So I stopped asking. My wife and I drew up a roadmap and made the first brick ourselves. \n\nWe shot a feature film right here in Long Beach. No investors, no middlemen,  just honest contracts, fair terms, and the same city that raised me. The movie was shot for $938, and an iPhone, but the paperwork behind it is stronger than a lot of six-figure deals I’ve seen. Everyone who showed up has ownership in what we built.\n\nPeople twist it when I say you don’t need a crew… what I mean is, stop waiting for everything to be perfect. Build small, build smart, and keep building so you can make a second film, and a career, not just a moment.\n\nThe flick’s called SORRY — “Just when you thought your day couldn’t get any worse, it does.”\n\nIt’s the start of El Primo Brand’s next phase: A home for real indie moviemakers with  unique voices and perspectives looking to get their voices heard and movies seen. \n\nThe industry’s broken. Distribution’s a trap. Everybody’s chasing validation and calling it progress.\nI just wanted to prove you can still build something real with your own two hands.\n\nWatch it, don’t watch it, but if you’ve been sitting on your story, thinking you need more time, more gear, more “yeses”… this is your excuse killer.\n\nMovie + trailer → https://elprimobrand.com \nMore info about El Primo Brand\n → https://elprimobrand.com/wtf\n\nThe reasoning behind only putting the movie on my site, is because I want to show other indie folks what is possible and am going to use this movie as a case study to improve every step moving forward, hopefully. Why not go to my site to catch a flick vs going to Netflix’s site? It comes down to marketing, and that’s where this whole guerrilla plan comes into play. But I have to show it can work before I start reaching out to others to join the guerilla army. With this being said, I also have hit a hurdle with the VOD as I try to send my movie out to people to review, people that don’t have the time for hurdles themselves,  have to put their payment info into Vimeo before the promo codes work which is just so off-putting and a big turn off to a large portion of people I am trying to cold-reach out to.  Annnnyyywayyyyy, with that being said, I had to bend a small amount and get a private link going as well,  but the site shows the bigger mission behind the film, and that’s where the future lives.  So if you don’t want to rent or buy the movie, at the moment..\nThat link is → https://vimeo.com/1130517746?fl=ip&amp;fe=ec  PW is: PRIMO\n\nAsk me anything.  About making a feature for under a grand, raising kids through chaos, or trying to build art that still has a pulse, I’m here for all of it, and I really just want to be the guy you blame making your first movie on. \n\nThanks for your time, \nKyle  🎬\n",
    "score": 335,
    "url": "https://reddit.com/r/Filmmakers/comments/1ofzcdl/they_say_you_cant_make_a_real_film_with_nothing_i/",
    "created_at": "2025-10-25T18:47:45.000Z",
    "num_comments": 210
  },
  {
    "id": "reddit-1p2dylp",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I spent my life savings to make a 35mm short film and the response was lackluster. Why do you think this film failed to make an impact?",
    "text": "Hi my name is Taylor Thompson, I'm a Writer/Director from Sacramento, California. I've been making films for over ten years now, and in an effort to land my first feature film I decided to financially ruin myself to make yet another short film.\n\nThe process of making this film was one of the best chapters of my life. I worked overtime for over a year to save up enough cash to get started, then put the rest on my credit cards. I shot this film three years ago and have just now paid off my debts.\n\nUpon release it was a hit with my friends and local community but despite my best effort the film fell flat in the festival circuit. It was accepted by two festivals that you've probably never heard of. Beyond that it's done little else than gain me a bit of local notoriety. No feature film, no music video offers, no writing jobs.\n\nI love this film, I don't regret a thing, but obviously it was a bad idea to destroy myself financially to do this.\n\nSo my question is, what was my mistake? What about this film may have caused it to fall flat with programmers, and why has it failed to bring me the opportunities i had hoped for? I am preparing a new film now and want to try my best to correct the mistakes i made in the past.\n\n**UPDATE - 11/21**\n\nFirst off thank you so much to everyone who's taken the time to discuss my film and lend their two cents. I was not expecting nearly this much engagement, and I fear I will not have the time to respond to you all. This has been extremely helpful and gave some real clarity on what went right and what went wrong with this one.\n\n**Here is a summary of the points I'm really resonating with so far:**\n\n\\- The film is too long! That has been made very clear, and I do agree with this point. I completed this film last year and with some distance I can see several ways to trim this down. Earlier cuts of this film were actually much longer (around 27 min if i remember correctly) the montage nature of the first half is a result of trying to find out how to simplify things. but nevertheless I was too close and naive to really shave it down to its purest form. This is a lesson I will certainly carry into future works.\n\n\\- The script is bloated and unrefined. I agree with this as well. I wrote this three years ago and have written a few features and a handful of shorts since then. I have grown a lot since i wrote this film and can feel the amateur nature of the script. Had i written the story with a concise hand and stronger arc i think the film would have been much shorter and more impactful.\n\nSome have critiqued the unlikable nature of the leading man, and i disagree that this was a mistake. In fact it's the whole damn point of the character. And personally I do find him likable, certainly abrasive especially in the beginning, but by the end i'm in love with his madness and related to his failure to self reflect, among other things. I know it's not the easiest way to connect with an audience, but I would never dream of changing who Dennis is as a character, and in general find flawed protagonists to be the most interesting people to observe in a film.\n\n\\- I should not have spent so much money on this film. I think this is a fair assessment, especially after going through the three years of financial ruin to recover from this decision. Do i regret it? Not really. Making films is my greatest joy in life and making this film in particular was a peak life experience that has allowed me to evolve as a filmmaker and even more-so evolve as a human being. The experience has gained me a much broader network, ironically most of the friends I have today are people i met through the process of making this film, and I've learned invaluable lessons along the way. That being said, I have vowed not to spend this kind of money on a short film again and plan to strive for greatness on a more humble budget.\n\n\\- \"Shooting on 35mm was a terrible and ego-driven idea\" - Yeah, I think this is a silly take, and have read a heap of asinine opinions on this point. I understand thinking this is what made my film so expensive but you'd be surprised to find that maybe $7k out of the entire $25k budget was spent on film related costs. I was able to get a reduced-cost camera/lens package from Panavision. I purchased the film stock with a student discount (50% off). And my good friend owns a film scanner so that was entirely free. I think it's an obvious truth that film is superior to digital, but clearly this is a hot take these days. Of course there are consequences to the workflow but there are plenty of advantages as well. All the movies that made me into the person i am today were shot on film and if you don't think that modern cinematography has failed to uphold the standard of the past then I think you just have bad taste (there are exceptions of course). But I do believe that shooting on film is an essential ingredient that makes up the magic of movies, and that's the standard I strive for as a filmmaker. Life is short and i'll only be able to make so many movies in my lifespan, this is the thing i love most about being alive and for me this was worth every penny. Obviously i don't think the format makes something automatically good, there are incredible films made on the worst digital cameras you can imagine, quality comes from the story and the vision. I will shoot on film again, but I have never been above shooting digital and have done so many times.\n\n\\- The days of short films breaking out a director are long gone. This is the hardest truth to face, I do agree with this. The industry is not what it was when I was growing up and planning my strategy. Maybe a bit of a cope, but i do think if I had made this film in the 90's the outcome would have been very different. But that's irrelevant, it's a different world, and it's very confusing to determine what the necessary steps are to finding a career as a director. I now know that making another short will not change my life, i will likely do it anyway because i just love doing it. But i have accepted the fact that if I want to direct my first feature then i will simplify have to green light myself and do it on a budget close to what i spent on \"People Person\". Even then incredible directors with incredible films are facing the same struggles I am, failing to make an impact in the modern world. I pray that the film industry has a bright future, but if we are living in the end times then i'll proudly go down with the ship.\n\n**Again, thank you so very much to everyone who has taken the time** **to watch and review the film. This has been illuminating for me in many ways. And I am grateful to be surprised by the generosity of complete strangers. My work is certainly not for everyone, so i am touched to find a few new faces that connected with what we've made. And have learned from those who haven't. Love you all.**\n\nIf you are interested you can find my previous short film \"Foulmouth\" on my Youtube channel [https://www.youtube.com/@aldentay92](https://www.youtube.com/@aldentay92)\n\nAnd follow me on Instagram to keep updated with what I'm making next. [https://www.instagram.com/taylor.alden.thompson/](https://www.instagram.com/taylor.alden.thompson/)",
    "score": 326,
    "url": "https://reddit.com/r/Filmmakers/comments/1p2dylp/i_spent_my_life_savings_to_make_a_35mm_short_film/",
    "created_at": "2025-11-20T20:22:07.000Z",
    "num_comments": 285
  },
  {
    "id": "reddit-1ljrr3a",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I’ve only worked 36 “paid” days in the past 7 months (Crew)",
    "text": "I’m a 29 year old 1st AC (when fortunate DP) based in LA. I’ve been lucky enough to do this full-time since I was 17. I used to be in 600, but had to request an honorable withdrawal two years ago due to inconsistent union work. Most of my career has been supported by non-union DPs, producers, and AC friends who’ve kept me afloat with steady gigs over the years.\n\nBut like a lot of folks this year… it’s been rough. I’ve only worked 36 (paying) days in the past 7 months. Checks aren’t as big or consistent, and for the first time in a long time, my savings are starting to take a hit. I’m starting to stay up late most nights applying to all kinds of “media” related jobs around SoCal and the US.\n\nSo I’m wondering, how are you all finding work right now? Facebook groups? Craigslist? LinkedIn? Discord? Cold emails?\n\nOr are you also considering a career pivot that still pays in the ballpark of our Operator/AC rates? If so, what path did you take? Trades? Tech? Medical? I’ve been strongly considering going the RN or Welders route for something more stable, if anyone’s gone down that road, or any route, I’d love to hear how it’s going.\n\nAny insight, advice, or personal experience would mean a lot. Just trying to figure out the next move and hoping I’m not alone in this. Thanks in advance friends 🤘",
    "score": 311,
    "url": "https://reddit.com/r/Filmmakers/comments/1ljrr3a/ive_only_worked_36_paid_days_in_the_past_7_months/",
    "created_at": "2025-06-25T00:29:57.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1j3dciy",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I want to be a filmmaker",
    "text": "Just want to say it out loud because it sounds crazy. I’m 34, currently living in DC working as a data analyst for a startup (I WFH) and have never filmed anything. I have a completed screenplay that needs some work but I’ve gotten decent feedback so that’s a start. Problem is the thought of making a movie, even a short, sounds crazy. I’m almost embarrassed to tell anyone other that my wife because everyone will think I’m going through some kind of identity crisis (even my wife just kind of dismisses it). I’m not, or at least I don’t feel like I am.\n\nI’ve always gravitated towards writing and other creative pursuits. Studied photography and design in college along with history. I wound up in corporate America because I needed to pay rent and I’ve hated every minute of it. I’ve never excelled at “work” and never could pin down why I hated it so much. Now almost 8 years later I kind of realize maybe I’m just not meant for it. I love movies and have been writing as a hobby for about 10 years now. I understand the financial security of a decent career is not something to just toss aside on a whim so I’m trying to plan it out. \n\nAnyways I’m just taking the first steps and saying it out loud in hopes it will sound less crazy the more I say it. I’m open to any advice but really just wanted to share my dream with internet randos. ",
    "score": 229,
    "url": "https://reddit.com/r/Filmmakers/comments/1j3dciy/i_want_to_be_a_filmmaker/",
    "created_at": "2025-03-04T15:30:13.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1pa5jim",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "The Film Festival Tips Nobody Tells You",
    "text": "After 15+ years of submitting films to festivals (and getting into some big ones), and also directing and programming a film festival for 7 years, as well as programming shorts for 14 film festivals: here’s the strategy I wish someone told me earlier:\n\n**95% of filmmakers submit the** ***wrong*** **film to the** ***wrong*** **festival.**\n\nHere’s the system that finally worked for me:\n\n**1. I stopped thinking “What festivals do I LIKE?”**  \n**I started thinking: “What festivals PROGRAM films LIKE MINE?”**\n\nMost filmmakers carpet-bomb every major festival with a film that was designed for maybe three of them. If you've ver been to Sundance you know EXACTLY what I'm talking about. If you ever see the Sundance Short Blocks you will have your mind-blown on what type of shorts they actually program.\n\n**2. Look at the last 3 years of programming.**  \nIf you can’t see your film fitting into at least 6 films per year, don’t submit.  \nIt's not personal. It’s programming.\n\n**3. “Bigger” does NOT mean “better for your film.”**  \nI’ve had small festivals make a bigger impact on my career than larger ones.  \nSmall = more attention, more community, more networking.\n\n**4. Use the rule of thirds:**\n\n* 1/3 “reach” festivals\n* 1/3 realistic festivals\n* 1/3 guaranteed category-fit festivals\n\n**5. And here’s the part nobody teaches:**  \n**Know exactly how long the shorts blocks are (short films only).**  \nIf they only have 1 hour or so for shorts then your 15 minute short film has a very small chance of getting in. \n\n**Think of it from the Programmers side**: If they program your 15 minute short, then they have to say no to 3 filmmakers who have 5-minute shorts and not give them an opportunity. Or 7 filmmakers who made 2minute shorts. They are not giving people an opportunity in order to program yours. So it better either be 1) Amazing or 2) Cut the damn thing shorter so that you've got a better chance of being programmed.\n\n  \nOne more quick tip: Programmers HATE HATE HATE 2 minutes of credits at the beginning of short films!",
    "score": 212,
    "url": "https://reddit.com/r/Filmmakers/comments/1pa5jim/the_film_festival_tips_nobody_tells_you/",
    "created_at": "2025-11-30T01:24:46.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1k24g16",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Took me till I was 37 to make my first short, ‘Love Hurts’ - an absolute idiot tries to win the heart of a paramedic by getting himself into a series of accidents.",
    "text": "Thought I’d share my first short! I’m 37, and my day job has been in advertising for 15+ years. My ambition has always been to try get into directing, but despite thinking (and talking) about it a lot I've always really struggled to get started in any real sense. In the end I found what I needed was a deadline, so I applied for an evening course in directing at Metfilm London, where the task was to write, produce and direct out own shorts over a few months. Now it’s just off its festival run and despite its many flaws it managed to pick up over 20 selections and even a few awards. \n\nFor anyone struggling to get started, my learning has been to find a way to set yourself a deadline. Whether this is a short course or even just agreeing a date to send a first draft to a friend by, it will help get the first thing made. I’ve found that just finishing something and feeling like I've taken one concrete step in the right direction has been hugely energising.\n\nAt 37, the classic intrusive “most successful directors have already made it by your age” thoughts have also done their best to hold me back, so I’m partly posting this to encourage anyone coming from other careers or people later in life to ignore that bastard of a voice and just get it done! I have to say, watching it on the big screen for the first time felt like a huge fuck you to those thoughts and while I’m still a while away from directing becoming my ‘real job’, it's nice to finally be able to post it (and probably have it get slated by you lovely people).\n\nNow on to the next one!",
    "score": 198,
    "url": "https://reddit.com/r/Filmmakers/comments/1k24g16/took_me_till_i_was_37_to_make_my_first_short_love/",
    "created_at": "2025-04-18T13:04:38.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1k5j5uz",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I feel a lot of shame being a PA/failed my PA career, anyone else?",
    "text": "Graduated college a bit later at 28, was very lucky to get on an indie feature shooting in my college town. Moved to nyc from there, have survived 3 years freelancing as a PA.\n\nI understand it’s an entry level position- to a point. Beyond doing a street lock up, you’re also doing a ton of complicated work for minimum wage.\nFeels like every production tries to squeeze more blood from the stone. \n\n\nI don’t think being a PA is good for me spiritually and emotionally. I hate that you are not really seen as part of the crew, but in service to the crew. Your lunch breaks are seen as optional. You have to take everything. You are rewarded for having no boundaries.  If I feel taken advantage of, but if you try to advocate whatsoever then you’re not called back for the next one. Or I become irritated because of all the little things added up over a career, all the times productions nickels and dimes. You see productions drop hundreds of dollars, you throw your day rate down the drain in boxes of coffee. \n\nIt’s hard for me to run around for 12 hours a day, stress dreams, while people are making 3-4x what I make and watching movies on the truck. These are skilled people, but I feel kinda skilled too. You couldn’t get someone off the street when you’re getting into key PA kind of stuff imo. Obviously I’m starting to become a bitter and resentful person. \n\nMaybe I’m too old for this game- if I was 24 and on my parents health insurance it would be a different story, maybe this would be cute. What’s done me in, \nIs on a non union commercial shoot, you’ll be in line for lunch, and they call last man. WHY? Fucking why? There is no union rules here. It feels fucking disrespectful. \n\nI’ve also failed bc I had no specific goal. I wanted to work in the film industry. I find everything interesting- art, lighting, sound. Do I want to live the life of a grip or whatever? I dunno. Maybe this is the end of the road for me.\n\nWhen people ask me what I do in film, I feel ashamed to say I’m a PA. I’m a stupid worker. I can work very, very hard, like a dog, but I never seem to move up in pay scale. If I was making $400/12 or more I’d be happy to do it. And I’ve not even worked for that many assholes. I dunno man. I’m just starting to find what I like, but I feel beaten down, I’m on like a hair trigger for production bs.\n\nAnyway thanks for listening to my vent. I honestly feel all filmmaking is exploitative due to the current PA system. I know it’s all going down the toilet anyway in the US. ",
    "score": 162,
    "url": "https://reddit.com/r/Filmmakers/comments/1k5j5uz/i_feel_a_lot_of_shame_being_a_pafailed_my_pa/",
    "created_at": "2025-04-22T22:13:08.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1npu6l5",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "How do you let go of a creative career in film hitting your 40s and move on?",
    "text": "I’m in my early 40s, and filmmaking has been my life. I went to grad school for it, moved to the USA to pursue it. For years I followed what seemed like the straightforward path: go to school, do the work, build a career. But for me, it never quite worked out — mainly because I never built the kind of network the industry really depends on, and because I moved around a lot (San Francisco → Los Angeles → San Francisco → New York). The pandemic didn’t help either. I have had the opportunities of great roles and experiences, but couldn't parlay into more opportunities. \n\nLately, I’ve found myself in a tough spot: being an overqualified 40-something doing entry-level jobs like assistant editing or additional editing. In other industries, there’s at least the sense that if you put in the hours, there’s momentum — your experience translates into upward mobility. In film (and maybe the arts more broadly), it often feels like an endless loop of starting over. That’s been making me question whether I can realistically build stability here.\n\nNow I’m at a point where financial survival is more important than creative persistence. I’m seriously considering leaving film behind and shifting into another field. One option I’m exploring is doing an MBA here in New York City as a way to transition into a non-creative, more stable career.\n\nSo my real question is: for those of you who’ve made a major career change in your 40s (especially leaving a creative field like film), how did you navigate it?\n\nHow did you deal with the identity shift and the leftover “pull” of artistic ambitions?\n\nHow did you find stability in a new, non-creative career?\n\nIf you pursued something structured like an MBA, how did that affect your trajectory? (full disclosure I'm considering it now and the advisors of the college I reached out to say it's a great idea but sounds like \"pay that tuition and then you can figure it out\" which oddly reminds to of my MFA years... \n\nIf this resonates with you, I will so appreciate if you chine in with what helped you make peace with moving on?\n\nI’d appreciate any advice or stories. Thank you all so much. Carpe diem\n",
    "score": 134,
    "url": "https://reddit.com/r/Filmmakers/comments/1npu6l5/how_do_you_let_go_of_a_creative_career_in_film/",
    "created_at": "2025-09-25T01:39:19.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1m0uu75",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "There’s So Much Time Left",
    "text": "This may be kind of hippie-ish, but I just want to share a revelation I’ve had. Every day I look at this subreddit and there’s literal children acting like because they haven’t made their film by 18, or didn’t go to film school, or not instantly making their feature, that their filmmaking career is over. I also see a lot of folks more established in their lives losing sleep and more over not making enough, or being successful enough, or not getting into the right festivals.\n\nI’m 23, and I just finished my third festival short, and it just played at a block in my state. It’s only been in two festivals (the second it’s playing at is this Friday in Wisconsin, but I can’t afford the flight). I genuinely went into it thinking I would make something that would propel me into traveling the nation or preparing for my first feature by 25 by now. That didn’t happen. I’m sure that never really happens.\n\nI was in a panel with people in their sixties who grabbed a camera to make a short, some people younger than me who finished their college projects and submitted them, and then folks in their 30s making higher budgeted shorts. Regardless of the final film, I felt I have so much more in common with people making this for the joy than an Orson Welles type or A24’s steadily aging youngest filmmaker ever. This feeling is compounded by a panel I did earlier in the year, where I was asked to speak to the microbudget filmmaking experience. I’ve never made a short for over 7,000, and even then, I know that’s a lot of money to raise. But I know how to make it for less and less.\n\nI know this is a ramble, but I wanted to know what’s helped to keep y’all making films. Is it the dream of success, because right now the joy of filmmaking is keeping me going. My short is a thriller, and I got a huge gasp from the crowd near the climax. That helped me see how much I’ve grown as a director already, and if I’m doing that by 23, I’m excited for all the time I have ahead to get better and better.",
    "score": 117,
    "url": "https://reddit.com/r/Filmmakers/comments/1m0uu75/theres_so_much_time_left/",
    "created_at": "2025-07-15T21:46:49.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1kclcj7",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Filmmakers who left the industry: Where did you go next?",
    "text": "TL;DR - I'm tired of working in film but feel like I have nowhere else to go. Anyone have any experience/ideas?\n\nFull Story:\n\nI worked in the film industry (proper) for about a decade and I'm the type of crazy where I honestly loved every second of it - late nights, lack of sleep, dangerous levels of hubris - all of it. Then I had kids and decided I'd rather be around for them than have all that fun so I took a day job. I'm a \"creative director\" at a shitty little commercial agency (in quotes because in this role there is very little creativity and a lot of run and gun bullshit). On paper it's a pretty good gig. Pay is about half what it would be at a real agency, bosses are shit, work is unfulfilling but whatever, at least I know where my next check is coming from. I've looked at it as resume building if nothing else.\n\nI'm so tired of it though. Being a creative for a career is fucking exhausting. At this point in my life I'd so much rather do something that I don't care about but pays well so I can spend my time with my family and spend my creative energy on my own shit on my own time.\n\nBut where the fuck does someone like me go? I have no actionable skills outside of this work. I have a visual communication degree (lol). I don't have the time or money to go back to school. My only resume entries outside of the industry are service jobs. In some ways I know that I'm lucky but I feel miserable and incredibly stuck.\n\nIs there anyone out there that has successfully transitioned away from the industry smoothly and happily? If so, where did you go, what do you do?",
    "score": 105,
    "url": "https://reddit.com/r/Filmmakers/comments/1kclcj7/filmmakers_who_left_the_industry_where_did_you_go/",
    "created_at": "2025-05-01T22:20:01.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1l2ltht",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I PA’d for free to network, but now they’re asking for my photography work too—how should I handle this?",
    "text": "Hey everyone, looking for some honest feedback here from folks who’ve been around the indie film/photography world.\n\nI just moved to LA and worked as a free Camera PA for a 3-day short film shoot (Sat–Mon, 5/24–5/26) to start making connections. A friend introduced me to the DP and said this is how he got his start, so I went for it.\n\nThe shoot days were long (7:30am–8:30pm or later), and I worked hard—staying on top of gear, helping the DP, Director, 1st and 2nd ACs, doing everything I could to be helpful and positive. No pay, but I saw it as an investment.\n\nAt the end of Day 1, the director asked if I’d bring my stills camera to shoot a poster for the film. Sounded simple—I said sure. They’d already be lighting and directing the actors, so I just needed to shoot some frames and hand off the RAWs. He also asked me to get some BTS shots.\n\nSo Day 2 and 3, I showed up with my camera gear, continued Cam PAing, shot BTS in between tasks, and on Day 3 even started slating all day for the 2nd AC. It was a lot—I was juggling multiple roles.\n\nAfter wrap, I asked for a Google Drive link to upload the RAW poster shots and BTS. A few days later, the producer asked for the BTS by Monday (6/2). I replied that I could send the RAWs for the poster by then, but the BTS would take a little longer—I’d planned to edit them in Lightroom and had paying client work that weekend. They said no problem, totally understood.\n\nThen today, I got another text asking for a timeline on the BTS again, as they’re scheduling an IG post.\n\nHere’s where I’m conflicted:\n\n\t•\tI was the only crew member who wasn’t paid—everyone else was union.\n\n\t•\tI gave them 3 full days + overtime of labor for free (saving them ~$1,100).\n\n\t•\tI also shot BTS + poster stills on my own kit, Canon R6MKII, EF 24-70 2.8, EF 16-35 2.8, black pro mist filter (which I’d usually charge $450–$600 for).\n\n\t•\tNow they’re politely nudging for deliverables, but I am trying to politely explain that I’m doing this as a favor to them, and can’t prioritize them over my actual paying clients. \n\nI really liked the crew. They were all kind, and I want to stay on good terms. But I also don’t want to start my LA career by undervaluing my skills and setting the precedent that I’ll do pro work for free. Especially urgently, when I have an actual job. \n\nHow would you respond in this situation? Has anyone else been here? I just want to politely establish that I can’t rush their photos over my actual paying clients. \n\nEDIT: \n\nThank you so much, everyone, for your insights. \n\nMy conclusion is: the time to discuss money/licensing/usage was the moment the director asked me to bring my kit and shoot. I missed the boat, and it is my responsibility now to respect that. I am going to politely explain I am booked with clients now, and tell them I will have their deliverables in their Google drive by next Monday. \n\nLessons learned!",
    "score": 103,
    "url": "https://reddit.com/r/Filmmakers/comments/1l2ltht/i_pad_for_free_to_network_but_now_theyre_asking/",
    "created_at": "2025-06-03T20:04:01.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1ijsox1",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Just spent an hour filling out the My First Job in Film profile… I can’t apply for any jobs without paying??",
    "text": "Has anyone got anything worthwhile off My First Job in Film? Is it really worth spending £240 over a year to just apply to jobs?",
    "score": 99,
    "url": "https://reddit.com/r/Filmmakers/comments/1ijsox1/just_spent_an_hour_filling_out_the_my_first_job/",
    "created_at": "2025-02-07T11:14:50.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1lxprzn",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Is this what working in the film/TV industry is really like? Overworked and exploited?",
    "text": "Im 18 and i can confidently say for myself that i have a pretty good resume so far. For the past 3 weeks, I've started working in a TV channel, one of the biggest ones in Greece. And at first I considered myself very VERY lucky.\n\nHowever, (I'll get to the point tho right away) the working is HORRIBLE. I was suppose to start working at the start of the month, but they called me in a week before and told me to get some videos to edit just to start off and learn how they operate there. I was like \"sure\" and in my mind I thought it would be for this day only. But nope I worked the whole week. UNPAID WORK. Full hours AND EXTRA. But I was like \"you get something you lose something, its ok\".\n\nThen, I started working there. And I kid you not, from day one, I have worked 10 to 11 hours. PER DAY. 2-3 unpaid extra hours. And not only that, but they've given me work for the weekends AS FUCKING WELL. Not by choice, but because there was a schedule we had to commit to and finish specific amounts of videos a day.\n\nYesterday, I went there, did my work easily, and I had to leave at 6 specifically that day because we made plans with my friends, and I let my boss know from the beginning. At 5pm tho, i got assigned... 5 more videos... (in total one video takes me about 1 hour to make). I told them i dont have time today, and they told me that i could take them home and finish them, and also having told me that ill need to work on Sunday too from home.\n\nIm about to crush out. Im about to cry. And you wanna know the best part? FOR MINIMUM FUCKING WAGE. Nobody informed me about these work hours btw.\n\nHowever, having this TV channel in my biography, and in my career, could be a very good thing in the future. And I have to prove to my dad that I am worthy and will work hard in my life, so he could fund my studying abroad, so I could maybe find work in another country one day. But also having both my parents be proud of me and not having a failure on who quit after 2 weeks.\n\nIs the industry really like that? Is it always like that?",
    "score": 99,
    "url": "https://reddit.com/r/Filmmakers/comments/1lxprzn/is_this_what_working_in_the_filmtv_industry_is/",
    "created_at": "2025-07-12T02:51:13.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1il27kp",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Shot my first feature on an iPhone and now it's on streaming!",
    "text": "I grew up drag racing and in High School raced at Englishtown Raceway park in New Jersey. I was never into filmmaking, I was actually a musician my whole life but when I got my first iPhone I thought this could be a great tool to get this script off my chest. It's called ***Sunday Sunday Sunday*** and I wrote it because it came to me, not because I had any aspirations to be a filmmaker and had no clue what to do with it when I was done. The iPhone was a great learning experience for me, and it taught me a lot of the principles of photography and how to tell a story.\n\nWe had no car in the film after 1975 giving it a period feel without ever getting into when this takes place. With friends, family, a car and a few bucks I socked away we went off on a journey to make this movie. We did pretty well in the film festival circuit taking home 14 wins out of 24 nominations. I would have been happy just getting accepted to one. I wound up getting to go to London which was so incredible, having my film going up against companies like Porche, Lamborghini, and some other big money companies.We didn't win but what a way to really get started.\n\nI used filmic pro to capture everything. It was an amazing extension to what the camera was already capable of and I just started using the black magic version for the sequel we're doing now. Just this year I submitted to FilmHub for distribution and now it's on streaming which is a real trip. It's nice that people can find my work pretty easily and share all the hard work that went into it. It isn't a perfect representation of what I had in my head, but I wouldn't change anything because I walked away with a lot of experience and knowledge I bring with me to my professional career. If you'd like to check it out and shoot me some feedback I'm always open. If you had any questions about the process or anything I'm always happy to help filmmakers who are trying to get that first project off the ground. I know how hard it is, there are more opportunities to give up than there are to keep going usually, but friction starts fires. Thank you for having me in the group. I am already super inspired and learning a lot from all of you.\n\nCurious, I'm working on a sequel and was wondering if any of you have seen any other movies recently shot on an iPhone. I know the new 28 years later was and I'm super excited about that, but I love seeing who else is out there making features on their phones.\n\n[Sunday Sunday Sunday Trailer](https://reddit.com/link/1il27kp/video/z1gsqfb8h0ie1/player)\n\n[https://www.primevideo.com/detail/Sunday-Sunday-Sunday/0G09UHF7O8OGF5FR3KNFX8W5AH](https://www.primevideo.com/detail/Sunday-Sunday-Sunday/0G09UHF7O8OGF5FR3KNFX8W5AH)\n\n  \nWe also did a little Making of! [https://www.youtube.com/watch?v=fGDcM7Gktz8&amp;t=1s](https://www.youtube.com/watch?v=fGDcM7Gktz8&amp;t=1s)",
    "score": 96,
    "url": "https://reddit.com/r/Filmmakers/comments/1il27kp/shot_my_first_feature_on_an_iphone_and_now_its_on/",
    "created_at": "2025-02-09T00:33:58.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1mogbbo",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Rejected from all the major festivals but received a handful of smaller accolades with our Original TV Pilot",
    "text": "I’ve been trying to develop a TV series like this since 2019 \n\nTitle: The Podcast \n\nThe TV Show about two best friends with a terrible podcast. \n\nBrief:  In the aftermath of their first podcast recording - best friends, Nick &amp; Garrett, try to make the most out of getting canceled. While their relationships and careers are at stake, the Podcast could be their ticket to fame. \n\n  \nMe and my writing partner/co-star have been drawn to sitcoms our whole lives. I’ve been working on this Gen Z adulthood, internet satire type of sitcom for a number of years before I eventually got to this format. It’s a fun dynamic because their podcast is a really bad podcast, but it continues to gain popularity by people either loving or getting offended by their crude humor and hot takes. Despite its unhinged humor, The Podcast has a feel good message, emphasizing that being yourself is the best way to achieve success. We have 6 episodes written and ready to shoot for a full season.\n\nFull TV Pilot Link: [https://www.youtube.com/watch?v=qBzAaNQWBlI](https://www.youtube.com/watch?v=qBzAaNQWBlI) ",
    "score": 93,
    "url": "https://reddit.com/r/Filmmakers/comments/1mogbbo/rejected_from_all_the_major_festivals_but/",
    "created_at": "2025-08-12T18:12:46.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1iegqr7",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Connecting with fellow video creatives in Zurich",
    "text": "I‘m Kaitek, a Zurich based videographer. \n\nMy career has too many ADHD detours to list, but I ended up in a place I really like: Working freelance on TV episodes, documentaries, corporate stuff and operating live cameras. My approach is multimedial, using different techniques like Macro, Timelapse, Claymation, 3D animation and tracking, 3D printing etc. I also write for TV and privately on some short movies. \n\nI‘d love to connect to other people in Zurich doing something similar. I never studied film (where people also connect) so I‘m trying it on reddit. \n\nIf anybody around Zurich wants to grab a coffee and talk filmmaking, shoot me a DM. ",
    "score": 84,
    "url": "https://reddit.com/r/Filmmakers/comments/1iegqr7/connecting_with_fellow_video_creatives_in_zurich/",
    "created_at": "2025-01-31T15:03:41.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1p8mwx0",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "I've been working in the industry for five years, yet I still haven't had a single year where I've made more than $23K",
    "text": "Yep. Everyone talks about how all you need is to be patient, work your hardest anyway, keep moving forward, network at events, learn new skills possibly, so on and so forth. But from my experience as a 1st AC, 2nd AC, and data wrangler, nothing has ever truly lead to anything substantial and sustainable enough. Nearly every connection ends with me hearing, “I’ll keep you in mind,” (if I'm lucky enough to not be ghosted) only to never hear back.\n\n**October 2019** began with me freelancing for a Philly rental house, which lead to some local PA work. I never went to film school, but this felt like a good start.\n\n**2020** felt like a non-existent work year for obvious reasons; whatever I had going on came to a halt in March, then slightly picked up with some PA gigs from September to November.\n\n**2021** was an improvement in terms of getting more PA, and eventual AC work. Staff Me Up came in good use (I was never recommended via word-of-mouth, as it’s still mostly the same way today), but work was still too sporadic and piecemeal. \n\n**2022** was easily the most eventful and busy. Despite how I was still a sporadic day-player that pulled in less than $22K since my work nearly flatlined during some months, I gained a lot more experience as an AC and data wrangler. \n\n**2023** had me waiting until May for things to fully pick up. I was *extremely* fortunate to get recommended as a data wrangler on a reality show for about a month and a half (my first and only long-term gig), but afterwards, the second half of the year was mostly a drag. Of course, the whole industry sank quite a bit this year, so I didn't think my circumstance was that unique.\n\n**2024** was still too slow despite some really good months, as I eventually started full-timing at a rental house near DC to spare me from the under-employed stress that freelancing has been for me.\n\n**2025...** after almost a year of working at that rental house, they let me go in September due to financial cutbacks from a lack of revenue. Granted, regardless how it was only $20 an hour (I still picked up some gigs here and there on the side to help), this was the most economically stable year I've had in my whole career. The gigs I secured in October left me with about $1,500, and I'll likely be leaving this month with $600 from the only gig I could find.\n\nI don't want to be someone who just sits around and rants on Reddit, or to come off as someone who doesn’t like working in this business, but fuck... I'm 27 years old, I'm back to living with my family for support, the most stable work I've had so far in this industry still didn't even amount to $20K after tax by the time it was September, and despite gaining more connections and knowing so many people that work in the industry from this last job (and just from being on set so much before that), I'm still just as under-employed as I was before as a freelancer. By the time this year ends, I'd be surprised if I made more that $23K after tax (especially since my rental house hours were cut down for the first three months from a slow season). As much as I usually enjoy the work itself, financially speaking, my career has been a mess.\n\nIt's like these past five years haven't amounted to anything. \n\nI feel like I've done everything I'm supposed to do in terms of networking, yet it usually just doesn't work outside of maybe getting me some low-or-no-paying passion project gigs; I love being able to take them, but I can’t live off of those alone. Maybe I'm never truly at the right place at the right time I guess (not to mention how I almost never get the chance to work locally, or with local crews). For the record, I primarily work within unscripted tv.\n\nIs the industry still just in a bit of a lull right now, or do I just exhibit a case of some pretty bad luck?",
    "score": 80,
    "url": "https://reddit.com/r/Filmmakers/comments/1p8mwx0/ive_been_working_in_the_industry_for_five_years/",
    "created_at": "2025-11-28T05:34:19.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1p95y6i",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Production costs for big TV shows",
    "text": "I finally started watching Severence and stumbled across an article stating that the first season cost $20 million per episode.\n\n[https://www.hollywoodreporter.com/tv/tv-features/ben-stiller-severance-apple-filmmaking-parents-documentary-1236126909/](https://www.hollywoodreporter.com/tv/tv-features/ben-stiller-severance-apple-filmmaking-parents-documentary-1236126909/)\n\nHow?\n\nIt seems like fairly minimal sets.  I assume minimal VFX.  Is like 90% of the cost actor/writer/director salaries or what?\n\nEdit: Follow up question: is $20mil an episode high?  \n\nOr: Is it obvious to you where the money went?",
    "score": 69,
    "url": "https://reddit.com/r/Filmmakers/comments/1p95y6i/production_costs_for_big_tv_shows/",
    "created_at": "2025-11-28T20:59:01.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1icf56u",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "The industry is making me feel hopeless and depressed",
    "text": "I hope I'm not being inconvenient here with this venting, but after many years working in the industry (or trying to) I feel like there's little hope for a future.\n\nI started as a film critic in 2014 and in the next few years began to study filmmaking on my own while working for a YouTube Channel making video essays, writing and editing them. In the next years and ever since I've tried to break into the industry and failed to do so. My objective is to write and direct my own stories, but in the meantime, I've only managed to land shitty jobs: at advertising agencies as a videomaker, at production companies paying low wages and/or late wages, or in-office videomaker for companies. So far, the best job I had was working for Brazil's biggest TV network, though it paid the worst salary of my career and I got the boot three months later because of a layoff.\n\nI've written two feature-length screenplays, one of which only got into the top 10% of the Austin Film Festival but nothing more than that. Sometimes I feel like my work might be subpar but I never got honest portfolio feedback to know if I'm de facto a bad artist or if it's some imposter syndrome. After many years doing this routine, I moved from Brazil to Rome in search of better professional prospects because in my city there weren't a lot of things getting made and the ones that got were mostly by people with political connections who managed to get government money through shady means. I'm trying to get jobs as Video Maker or Video Editor on websites such as Glassdoor or LinkedIn but it's seemingly impossible. In less than a day there are over 100 candidates.\n\n  \ntl;dr: After almost ten years of investing in myself as a filmmaker, I've managed to get little results. I moved to another country in search of better prospects but I still feel my chances are slim despite loving what I do.",
    "score": 35,
    "url": "https://reddit.com/r/Filmmakers/comments/1icf56u/the_industry_is_making_me_feel_hopeless_and/",
    "created_at": "2025-01-28T23:05:13.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1ijv6ec",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Worklife after Film Production?",
    "text": "For those who have left the film industry what are you doing / how did you find a new passion?\n\n2019, 2021, and 2022 were the golden years for me. I made good money, was happy, and felt as if I was building a life that I loved. With the strike and slow down of work after, I'm not sure waiting around for gigs is very sustainable anymore, especially toying with the idea of starting a family.\n\nI have experience working on union shows in the camera department as well as a postproduction history in between my on set gigs. If I've learned anything the last two years it's that I do not like sitting behind a computer full time and I love being active and using my hands.\n\nI feel like I'm at a road block. After working on my resume, talking to a friend who is a vocational therapist, and applying for numerous salaried jobs around my city I have found myself with a part time gig making $15/hr with no benefits.\n\nWhere did you start to find what you're passionate about / how did you find your experience translated to other fields?",
    "score": 14,
    "url": "https://reddit.com/r/Filmmakers/comments/1ijv6ec/worklife_after_film_production/",
    "created_at": "2025-02-07T13:38:30.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1pnd9rr",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Career Pivoting With a BA in Film?",
    "text": "I know it’s sad to see a “I’m selling out” post but shit is real. Life hits hard. \n\nI’ll keep it real - I graduated from Columbia College Chicago about 5 years ago with a BA in Film Production. After working on lots and lots of sets (big, small, union, indie) I realized it was NOT for me. \n\nSince then I’ve been coasting doing freelance and service industry by day but I’m at the point in my life where I’m running out of time to financially prepare for having a family/kids. \n\nHas anyone pivoted to different careers like Advertising or Marketing?\n\nI’m thinking of making a portfolio and applying to some internships to hopefully land a “stable” salaried job. ",
    "score": 13,
    "url": "https://reddit.com/r/Filmmakers/comments/1pnd9rr/career_pivoting_with_a_ba_in_film/",
    "created_at": "2025-12-15T17:24:22.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1im6lm2",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "3 Days in Cannes",
    "text": "Hey! Has anyone applied for 3 Days in Cannes? Did you get a response yet? I’m still waiting to hear if I’ll be accepted, but if I do, is it worth it? I live in Russia, where the euro exchange rate is really high (for context, the average salary here is around 800 euros), tickets are expensive, and the trip is long—around a day. But I’m willing to save up if it’s worth it. Can anyone who’s been there share their experience? Is it as amazing as it sounds?",
    "score": 9,
    "url": "https://reddit.com/r/Filmmakers/comments/1im6lm2/3_days_in_cannes/",
    "created_at": "2025-02-10T13:54:02.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1pofb8n",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "i love cinema but i’m afraid to start filmmaking — where do i begin?",
    "text": "Hello. I wanted to ask those of you who are knowledgeable in the field whether it is possible to film something —a short film, for instance— without any prior experience and without theoretical training.\n\nI’ll give you some context so you can better understand my situation. I’m 26 years old, and the vertigo of feeling that life is passing by without me taking a leap toward what I love most has left me anxious. I watch films constantly —I have since I was 14 or 15 years old. I watch one a day, sometimes two, sometimes three.\n\nI’m Argentine and I work as a teacher; my salary barely allows me to survive. I don’t own any equipment and I have no experience. I’ve never really taken photographs, except for the occasional ones anyone takes since the invention of the smartphone. If I were to buy a camera, it would probably be pointless: my PC isn’t powerful enough, and I know editing requires a computer I don’t have. I’ve even considered buying some kind of Apple device.\n\nBack to the main point: I watch cinema, yes. But I have no idea what an axis of symmetry is, what a dolly zoom is (more or less), or anything about color grading. I’ve never read film theory or studied audiovisual language. I occasionally read essays —mostly philosophy related to cinema— and literature, but not technical or theoretical film texts.\n\nGiven this situation of austerity and lack of formal training, is it reasonable to have ambitions to film something? What do I need? Where should I start? Please be sensible, even if the answer requires some blunt honesty.\n\nI’ve been discussing this issue in therapy for years: why I don’t dare to try. I’m demanding with the films I watch, and my fear is to run into a sad and crude reality where I don’t even know how to turn on a camera’s flash.\n\nI think all I really need is a push.\n\nGreetings from Argentina, and thank you.",
    "score": 9,
    "url": "https://reddit.com/r/Filmmakers/comments/1pofb8n/i_love_cinema_but_im_afraid_to_start_filmmaking/",
    "created_at": "2025-12-16T22:14:09.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1o57y8x",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Stars compensation for significant time over schedule?",
    "text": "This question is inspired from the production problems of Jaws 51 years ago. That film had two mid-A level stars in Roy Scheider and Robert Shaw (Richard Dreyfuss had not yet reached full stride). They signed on for a two month production that lasted 4.5 months. What most likely happened then, and what would happen now? If you sign Chris Evans to $10MM for two months and take 4.5 months, do you have to pay him $20+MM at a straight pro rated salary? Or are stars in for for so much equity that they just suck it up to deliver the product and get to the back end? And back then, if you had two guys that agreed to work 2 months for $250k(?), would they just say, \"sure, I'll stick around another 2.5 months as long as you provide room and board.\" or would their agent say, \"f u, pay us $562k now?\"",
    "score": 7,
    "url": "https://reddit.com/r/Filmmakers/comments/1o57y8x/stars_compensation_for_significant_time_over/",
    "created_at": "2025-10-13T02:35:13.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1j4yycg",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "What role can you hire to take care of your finances?",
    "text": "I'm looking to create a short film but since I don't know the market I'm conscious that people from various roles e.g. cinematographer, actors etc. are going to ask for crazy amounts, especially if they sense ambitious beginners. I was thinking whether it's a good idea to hire a person of trust which is going to have a sole goal: make  sure that the salary negotiations are fair and actual complete them. Perhaps the closest role to this is the producer but I don't think I need the rest that comes with this role.",
    "score": 7,
    "url": "https://reddit.com/r/Filmmakers/comments/1j4yycg/what_role_can_you_hire_to_take_care_of_your/",
    "created_at": "2025-03-06T16:09:12.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1j4wr9m",
    "subreddit": "Filmmakers",
    "soc_codes": [
      "27-4031",
      "27-4032"
    ],
    "title": "Inspiring filmmaker with an idea that may be too big to pull off for my first short film.",
    "text": "ASPIRING filmmaker I meant and now I can’t edit the title.\nI went to film school for a year than dropped out. While in school I had every opportunity to make a short film with free resources like studio space, equipment, and crew. But I didn’t make anything, which I regret. At the time I had no idea what to write, if I had an idea it was too big too pull off for a short film, and was too afraid of making something bad.\nNow I have a story that I’ve worked on for a year. I’m confident enough with it that it could be good, and at this point just being good enough is all I need.\nI wanna shoot a short film in the style of old silent films mostly inspired by George Méliès.\nStory takes place in early 1900s, has a three act structure, three locations, three actors, no dialogue, approximate timing 5-8 minutes.\nThe most important aspects when making would be Cinematography, location, and costume. I know this is gonna cost a lot to make, which I’m willing to pay. I would be willing to spend up to $7000 to make this. Most of the cost would go to location rental, costumes, crew salary, and post production. I wanna make this happen. I’ve worked on a lot of short films as crew, and know the logistics of making a short film. I may be way over my head but this is something that I want to create.\nWhat do you think? Am I crazy for wanting to make something this ambitious for my first film?",
    "score": 5,
    "url": "https://reddit.com/r/Filmmakers/comments/1j4wr9m/inspiring_filmmaker_with_an_idea_that_may_be_too/",
    "created_at": "2025-03-06T14:32:32.000Z",
    "num_comments": 17
  }
]