[
  {
    "id": "reddit-1iuvxc9",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Made my first grab from a structure fire",
    "text": "I’ve been on the job for about 6 years or so, but this was definitely my first time with a grab. We responded to a structure fire at about 5 in the morning, upon arrival house was fully involved and there were no reports to dispatch of someone in the house still. Once parked we had bystanders running towards the unit yelling and pleading that there was a 2 month baby inside the structure still. Now the rest is kind of a blur, I don’t think I’ve ever had so much of an adrenaline dump.. But I suited up the fasted I’ve ever had and made way towards the engulfed mobile home. Bystanders(not sure if the parents or not) stated baby was in the “far right room”. Even tho conditions of structure were defensive, I made entry through front door. I felt I was in there for an eternity.. smoke was full from top to bottom, complete unknown layout of home, couldn’t see a thing. As right hand search was being conducted I felt the crib.. at first I thought the 2 month old baby inside was a doll of how small she was.. I made the grab and made head way to the outside. Engine crew stated I was only inside structure for about 15-20 seconds. Once outside I headed straight for the ambulance with the unresponsive child. Proceeded to initiate care and transport to our ER.. while en route we heard the sweetest, most comforting cry I have ever heard in my life, she was starting to breathe on her own… \n\nGot word back from ER that baby is doing good and it felt so good to hear. Just thought I’d share this story with some fellow FF",
    "score": 10891,
    "url": "https://reddit.com/r/Firefighting/comments/1iuvxc9/made_my_first_grab_from_a_structure_fire/",
    "created_at": "2025-02-21T17:08:48.000Z",
    "num_comments": 488
  },
  {
    "id": "reddit-1lv476b",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "A hot take from a female firefighter to other female firefighters…",
    "text": "Hot take from a woman in the fire service to other woman in the fire service- \nIf you stopped constantly highlighting the fact that you’re a “WOMAN in the fire service” and spent more time keeping your head down grinding and doing your job well, woman would have a much better reputation in the fire service. The way to change the reputation we have is not by making constant “let me prove you wrong” reply videos on TikTok of you doing a dummy drag or ladder throw, but instead it’s you simply working hard with humility and not caring what people say or think. Let your work ethic speak for itself. Setting yourself apart and constantly highlighting that you’re a “woman in the fire service” or “female firefighter” rather than just a “fire fighter” does nothing but further isolate you from the community you are trying to convince the public you belong in. You are actively putting a label on yourself that further divides you from the general fire fighting community. It’s counter active to the constant complaints of “not feeling accepted etc etc” Just be a hardworking, capable and humble firefighter. That’s how you gain the respect and acceptance you’re wanting. If you show you’re able to do the job and do it well, 90% of guys on most departments will love you. ",
    "score": 1115,
    "url": "https://reddit.com/r/Firefighting/comments/1lv476b/a_hot_take_from_a_female_firefighter_to_other/",
    "created_at": "2025-07-08T23:50:22.000Z",
    "num_comments": 248
  },
  {
    "id": "reddit-1ldq26u",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "I got in! Just wanted to say Thanks",
    "text": "I’m a 38/M and I felt the fire service calling a few years ago. I never thought about firefighting, not for one second in my life to be completely honest. Then one day, it kind of popped into my head and I couldn’t get it out. I started watching all the movies, reading books on it, and doing a ton of research. I was listening to “multiple calls” podcast all the time and had about zero tangible knowledge of the trade. \n\nI waited a bout 2 years for my city (NE medium population) to open up applications. This was their first national search (since the residency restrictions were lifted). Around 2k people applied and they only hired about 20 for the upcoming class. \n\nI studied really hard for the written test. I used the city’s study guide, bought a few books, and also downloaded other public department’s Study guides I found online (Columbus, Chicago, &amp; Erie). \n\nI got back in shape. Training every day for the physical test. Weighted vest on the steepest incline, ran a few half marathons, and kept it clean with the dinner table. \n\nI got ranked 10th on the list and felt good about my efforts. Then towards the end of winter I got the call for processing. Now, The Academy starts soon and I’m very excited for my new career. \n\nBasically, I just wanted to say thank you to all the firefighters that share their thoughts and experiences on this page. It’s helped me a lot to understand the theoretical dynamics of the career and day-in-the-life. The kind stuff you can’t find on a website or google. You guys have helped me greatly and I am very thankful.  Thank you! ",
    "score": 470,
    "url": "https://reddit.com/r/Firefighting/comments/1ldq26u/i_got_in_just_wanted_to_say_thanks/",
    "created_at": "2025-06-17T15:25:42.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1o8xl6q",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "A Lawyer asked me to do something that illegal, morally and ethically wrong.",
    "text": "I'm a FF/EMT-B, the other day a friend of mine asked me to meet him for breakfast. When I got there his brother in law was there with him. Long story short this wasn't just a friendly get together. It was a pitch from the lawyer to start giving him the info from people who were involved in MVAs. He wanted everything including faxing him copies of the reports so he can call them to solicit business. He would pay me $100 for each one.\n\nI told him no way in hell and I told him I'm not gonna risk my career for dirt bags like him. I left right after that. ",
    "score": 448,
    "url": "https://reddit.com/r/Firefighting/comments/1o8xl6q/a_lawyer_asked_me_to_do_something_that_illegal/",
    "created_at": "2025-10-17T10:22:39.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1k6b60i",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "My first round of chemo",
    "text": "This will be very briefly about me for background, but it's about you. \n\nI'm retired a little over three years now. Large metro department, so mostly interior structure fires. I was very good about masking up in fires and any smoke exposure, but less so during overhaul/Mop-up (different departments have different names for post-fire work). I kept a full face particulate filter mask in my truck bag for overhaul, but sometimes I outran the air that was coming in and took it off so I could breathe and keep working. Sometimes I forgot it or just didn't go get it when the work began. \n\nI've always been healthy, but a month ago I had some symptoms that got my attention and thankfully I don't ignore such things. Got in to see the doc next day and after an ultrasound a tumor was confirmed.\n\nDx: DLBCL-ABC. That stands for Diffuse, Large B Cell Lymphoma - Activated B Cell type. I caught it at Stage 1 and I'll probably survive this, but my odds are not 100%. My cancer is aggressive, and if I had ignored it I'd be dead in six months. I'm relatively young - mid fifties. \n\nI have no family history of cancer, and I quit smoking a long time ago, almost thirty years. \n\nIt had to be the job. \n\nSo now to you: if you're a line firefighter, obviously don't breathe the smoke. We all know that. But we also know the demands of the job don't always allow for perfect safety habits. Maybe things are different now, but when your supervising officers are former \"smoke-eaters\" you know what they think of your filter masks. And it becomes easy to ignore the little voice in your head for the bigger voice standing behind you watching you work. \n\nDont ignore that little voice. And if you're one of the gold badges reading this, don't do that to your company. Lead by example, but lead. No reason in the world to shame a young rook who's just looking out for their own health. I'm not bitter; I could have told them to eff off, but I didn't. I wanted to be like them. \n\nAnd as for you: if you have an exposure, document it. Sometime down the road you'll be glad you did. There are now legal assumptions in place about firefighting and cancer, but you still have to prove your case, and often the city will fight that assumption. \n\nI've been in a lot of fires over my career but didn't document a single one of them.\n\nLearn from me.",
    "score": 347,
    "url": "https://reddit.com/r/Firefighting/comments/1k6b60i/my_first_round_of_chemo/",
    "created_at": "2025-04-23T21:37:15.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1iadpm1",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "LA tragedy points to need for support of local fire services",
    "text": "\nBy Caitlin Clarkson Pereira\nThe recent images from Los Angeles are both unfathomable and terrifying. Families being told to abandon their cars on evacuation routes to flee on foot and convalescent home residents being pushed down the street in wheelchairs as hot embers fly around them are scenes usually witnessed only in the movies.\n\nBut unfortunately, this is not a movie; it is the reality of sudden, intense, and deadly wildfires.\n\nIt is human nature to attempt to make sense of the destruction, and this is often done by asking questions. Yet in many ways, we already had a spoiler for this ending.\n\nWith a hydrant infrastructure system built for the needs of structure fires and not wildfires, understaffed fire departments, months without rain, and hurricane-force winds, this script was rife with foreshadowing.\n\nSince we cannot control rain or wind, and a restructuring of the entire hydrant system across southern California unfortunately won’t happen quickly, let’s turn the spotlight to an issue much more within our control: firefighters.\n\nEvery element in the profession of firefighting is staff-intensive. Whether it’s dragging a hose through a house to extinguish a fire, tendering water when hydrants aren’t available, or performing CPR concurrently with carrying a cardiac arrest patient down three flights of stairs, it is much harder to be successful without the right number of people to do so.\n\nFor years, there has been news coverage stating that LAFD needs more firefighters. In December, LAFD Chief Kristin Crowley sent a memo to the city stating budget cuts “severely limited the department’s capacity to prepare for, train for, and respond to large-scale emergencies, including wildfires.” Statistics showing their increases in call volume have been reinforcing these pleas.\n\nUnfortunately, this issue reaches far beyond California, as we are seeing the devastating impact of staffing shortages all over the country, including in Connecticut. One tragic example includes a nightmare scene on January 2, 2024, in Somers, when four children were killed while trapped in a house fire. A few weeks later, fire department leadership and Somers Career Firefighters IAFF Local 4284 requested an increase in staffing. Shortly after their request, the first selectman said that town officials hadn’t heard a valid reason to fund new hires in the department.\n\nYet, there actually is a very valid reason as outlined by the fact that the national death rate for single-family and duplex home fires was 38 percent higher in 2023 than it was in 1980.\n\nTraveling about 50 miles south, Southington has also been requesting an increase in staffing. Southington Professional Firefighters IAFF Local 2033 escalated this call for an increase after two members of their department had to call a mayday while fighting a fire on December 26. This scary scenario, where two firefighters were in trouble and staffing levels severely exacerbated the danger, occurred less than two weeks after a fire in an apartment building led to rescues of both civilians and pets.\n\nThe National Fire Protection Association, or NFPA, Standard 1710 has clear guidelines for the number of firefighters needed to respond to specific structure fires. For the Southington apartment building fire, there should have been 28 firefighters on scene within 8 minutes of the first alarm. Southington’s usual staffing is seven firefighters.\n\nIn addition to NFPA 1710, the National Institute of Standards and Technology, or NIST, has done extensive research on the impact the number of firefighters responding to specific hazards not only has on the physical strain experienced by firefighters but also on the efficiency and time needed to extinguish the fire. In short, this means the more firefighters on the fire ground, the faster the fire is out, saving property and creating less dangerous environments for both civilians and firefighters.\n\nWhen an emergency isn’t the focus, we often think fondly of firehouses and fire trucks. Whether it’s because of a childhood field trip to learn about fire safety or watching sparkling trucks pass by during community parades, the fire service provides plentiful opportunities for nostalgia.\n\nBut our affinity for Americana by way of buildings and vehicles is irrelevant when it comes to supporting life-saving responses by the fire service. Firehouses and fire trucks do not put out fires; firefighters do.\n\nThis issue is not only about the appropriate budget allocations for hiring enough firefighters; it’s also about attracting individuals to the profession. Years of pension and benefit erosion, continually being asked to do more with less, the visibility of personal sacrifices and health issues, and constantly increasing call volume not only contribute to burnout for current firefighters, but they make the profession far less attractive to potential new firefighters.\n\nOf course, it’s important to remember sometimes we will not win against Mother Nature. She is the force of all forces, and we are only human, and we do have limits. But the fire service can certainly put up a much better fight if we are more equipped.\n\nThe devastation in California will change thousands—possibly millions—of lives. No one should have to experience the trauma of losing their homes and community, and our hearts break for their new reality.\n\nBut our ability to make tangible change in the fire service is also a reality. For some of us, it’s not too late to rewrite the ending. Our homes—and lives—depend on it.\n\nCaitlin Clarkson Pereira is a professional firefighter and a member of IAFF Local 1426, a mom and the executive director of a nonprofit organization. She lives in Fairfield.\n\n",
    "score": 334,
    "url": "https://reddit.com/r/Firefighting/comments/1iadpm1/la_tragedy_points_to_need_for_support_of_local/",
    "created_at": "2025-01-26T12:49:14.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1hr0sps",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "I got my first fire today! And I hated it. Need advice.",
    "text": "So I’ve been on the trucks about a year now. We don’t get a lot of fires. I’ve had some grass fires and small misc stuff but nothing crazy. But I got my first legit fire today. Got some time on the nozzle, that was fun. Pulled ceiling, that sucked. But while we were in there working I literally started rethinking life choices. \n\nI’ve been in situations where I felt mentally and physically miserable, but was still having fun. Sports, fire academy, triathlons, stuff like that. But today while we were interior I was just straight miserable. I was hot, couldn’t see shit, kept tripping over shit, was having bad trouble getting tools out of my pockets, etc. I just wanted to be anywhere else but interior, which does not bode well for a career in fire fighting lol.\n\nSo I guess I’m just asking if anyone has experienced doubts this deep or knows someone who has and what they did as a solution. Some medics at my department have an unspoken agreement that they only work on the ambulances. I’m getting my medic next year, I’m thinking about talking to my BC about something like that, because I genuinely do fucking love EMS, and that’s 95% of our job so it’s worked out so far. But I’m scared to admit to someone that I may not be the best for this job. I’ve dedicated and sacrificed so much to be here, and now I’m scared it’s been for nothing.\n\nThank yall. Hope yall slayed some dragons tonight, and had fun doing it unlike me haha.\n",
    "score": 279,
    "url": "https://reddit.com/r/Firefighting/comments/1hr0sps/i_got_my_first_fire_today_and_i_hated_it_need/",
    "created_at": "2025-01-01T10:58:23.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1nlhsa8",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "So I saw someone die today",
    "text": "I’m a senior in highschool and was walking home when I saw a woman hit by a car. She was unconscious and loosing an insane amount of blood. Her kid was there but wasn’t hurt but she saw the whole thing. The paramedics arrived soon after and started cpr but I don’t think she lived… How often will I be in situations like this as a firefighter. It’s my dream career and Im willing to see things like this if it means saving lives, but I just wanna know what percent of calls are actually life or death type of situations.",
    "score": 246,
    "url": "https://reddit.com/r/Firefighting/comments/1nlhsa8/so_i_saw_someone_die_today/",
    "created_at": "2025-09-19T22:44:31.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1lsqmlb",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Major change in my Life !! Chase your dream",
    "text": "I (32M) just made a major life change. I was recently hired as a full-time firefighter in my city of around 200,000 people. It was a dream I thought I had to let go of mainly because of my age and the salary I was earning (around $100K), since now I’m starting over at the bottom, making $25/hour. But as the years went by, I realized I no longer enjoyed what I was doing. Mornings were tough, and I was already looking forward to the end of the day as soon as it began.\n\nThanks to two of my friends who encouraged me to apply during the recruitment process, I’m now a firefighter after a year-long journey! I had to get back into the books, study hard, and train after long workdays—but all my efforts paid off. Now, my wife sees a man who’s happy to come home from work!\n\nBelieve in your dreams, even if you think you’re too old—you’re not! We all have different paths, and each one gives you tools along the way. I’m the oldest in my group, but I bring maturity to the team. If you still have doubts, go for it and chase your dream !! #515 ",
    "score": 230,
    "url": "https://reddit.com/r/Firefighting/comments/1lsqmlb/major_change_in_my_life_chase_your_dream/",
    "created_at": "2025-07-06T02:34:55.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1iq41l9",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Wanted to share my success story getting hired by on of the top 10 busiest FD's in the Nation (with previous criminal history) at 30 years old after 5 years of rejections, failure, and not giving up.",
    "text": "I wanted to share my journey in case there's anyone else out there who is getting burnt out or feels like giving up; started academy this past week. \n\nIn 2014 I was an absolute dumbass for lack of a better term. Didn't know my ass from my elbow, didn't have any direction, and was easily impressionable by my peers.  I had just turned 18 and began experimenting in college with drugs, and was caught with cocaine.  This felony charge was later dropped to a misdemeanor, however was still a pretty hefty charge to have on my record at such a young age.  A year later, at 20 years old, I was pulled over for having a BAC of .02.  Although not a DUI if I was of legal drinking age, I was still under 21 so I was arrested. \n\nHaving this background at 20 years old and wanting a career in Fire? Not looking good.   So I knew I needed to make a change.  What did I do? I took accountability and got Sober - 100% Sober from absolutely everything.  Once my head was clear, I knew I wanted to be of service to others, and find a job that paired well with my personality (and ADHD).  I got my EMT-B shortly after getting sober in 2015.   I was granted my state EMS license under probationary status since it was so close to the time of the offense.  Not a good look in backgrounds either to see that you've had a license with discipline, regardless of the circumstances.  \n\nQue my first fire interview in 2016. Massive California department.  I had no idea what to expect, and got a 70% on the panel. Needless to say I never heard back.   Due to how close I was to my past incidents, I began to loose confidence as I couldn't even land a basic EMT job with my EMS license status and criminal record.  At this point, I decided to go back to college.  Took me another 3 years, but was later granted my B.S. in Business.  After working in this field for a while, I could still feel the tug of public service.  I began volunteering with a Wild-land fire crew, and later was hired by a USFS Hotshot Crew where I spent the 2021/2022 fire season.  After this, was finally able to land a job as a 911 EMT in a busy urban California area.  \n\nI was applying left and right to departments.  High Interview Scores, even scoring 100% a few times and still being left to expire on eligibility lists after doing everything right.   On multiple occasions I was not invited to backgrounds after attending a \"pre-investigation\" for backgrounds.  One can assume why that might have been the case.  I was only ever official failed once in backgrounds, and unfortunately now had to report that to all other Departments I wanted to apply too.  \n\nI made the decision in 2022 to begin my plan B Career, as to not keep all my eggs in the Fire basket, but still not give up on pursuing my fire dream.  This way I could utilize my college degree and give myself a bit more financial stability that working private EMS.  I was hired by a defense contractor in 2022 and stayed employed there until the end of 2024 when I finally got my FD Final Offer.  \n\nBelieve it or not, obtaining and maintaining a DoD Security Clearance through my past job was easier than passing fire Backgrounds, as this was granted without any issues.  This may have helped my case in later interviews, as it showed a level of maturity and accountability that departments are keen on. \n\nThen, it finally happened.  Since really jumping back on board with fire interviews and beginning this pursuit in 2020, at least 20 department interviews, eligibility list expirations, and rejections, I was finally offered an out of state recruit position with one of the Top 10 Busiest Departments in the Nation.  I was honest with my investigators about everything, and was able to show them who I am today and what I had learned from my life experience.  \n\nDon't give up.  If this is what you really want, go for it.  Feel free to DM with any questions, Hopefully my journey and experience can help others.   The best department to work for is the one that will hire you.  Don't set your blinders on a specific department or region for that matter, you might need to temper your expectations and expand your search of where you're willing to work.  \n\n  \nTL:DR - Drug Charge / DUI 2014/2015, Sober since then, 20+ Departments applied to, failed backgrounds, Final offer at 30 years old with one of the Top 10 busiest departments in the nation.  Keep it up, don't quit.    ",
    "score": 227,
    "url": "https://reddit.com/r/Firefighting/comments/1iq41l9/wanted_to_share_my_success_story_getting_hired_by/",
    "created_at": "2025-02-15T15:42:32.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1p1fk2k",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "My son at Detroit dirty 30",
    "text": "Mad love to my son at Detroit 30. Never thought this would be his career choice, but proud as hell he chose it. \nLove ya fella!\nSafe passage to all of you brave folks out there! ",
    "score": 217,
    "url": "https://reddit.com/r/Firefighting/comments/1p1fk2k/my_son_at_detroit_dirty_30/",
    "created_at": "2025-11-19T18:28:03.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1ik8mbd",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "“If you’re not constantly working, there’s probably something you’re forgetting to do.”",
    "text": "I was told this by my current captain. I’m a brand new probie but I have about 5 years experience in EMS and I have some issues with this statement.\n\nIt’s not that my captain told me this because I’m a probie, this is the mantra of most of the department. People rarely sit in recliners and you are expected to be either on your feet or working at the computer from 0900 to about 2000. If you think you’re done with all your work, find something to do.\n\nWe’re a transporting department too so I personally think that if we have a little down time, there’s nothing wrong with taking a little siesta after lunch or something so long as you can fit in PT, training, and all your other duties. If you’ve been getting your shit rocked all tour, there should be no problem with watching a little TV with your crew in the day room after morning chores are done.\n\nI think this philosophy of always being busy is another exacerbating factor for potential crew burn out. Again, I understand that I have to put in extra work as a probie and believe me I do. But I’m not sure I want to spend the rest of my working career at a job where they expect me to be busy all day even if there isn’t really work to be done. \n\nWhat do y’all think?",
    "score": 190,
    "url": "https://reddit.com/r/Firefighting/comments/1ik8mbd/if_youre_not_constantly_working_theres_probably/",
    "created_at": "2025-02-07T23:11:28.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1n1fwjc",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "My first Captain was an @HOLE (and he taught me the best lesson of my career)",
    "text": "My first assignment was on an engine with a truck and medic unit.  \nThe Captain was old-school. The Engineer; so lazy the other shifts would tape a $5 bill on the end of the dipstick, knowing he’d never check the oil. They never wanted to leave the station, and bitched about going on calls.\n\nI showed up wide-eyed, eager, ready to learn. By my third shift, I realized I was on my own. The truck crew hated these guys so much they’d leave the station just to avoid them.\n\nSo I trained myself. Pulled hose in the app room, bedded it myself. Ladders, SCBA drills, reps on everything. Six months later, I came out #1 on my test, and those two knuckleheads tried to take credit for it.\n\nBut here’s the thing: the best lesson I got came from that same Captain during my evaluation. He told me:  \n**“Pick your role models carefully, because that’s who you’ll end up like.”**\n\nAhead of his time. Today people say you’re the sum of the five people you spend the most time with. Same truth.\n\nParting wisdom:\n\n* You can survive a bad assignment with the right mindset.\n* People will always try to take credit for what they don't deserve.\n* Sometimes the best lessons come from the worst places.\n\n ***Did you work for one of these guys, or did you learn an unexpected lesson?***",
    "score": 166,
    "url": "https://reddit.com/r/Firefighting/comments/1n1fwjc/my_first_captain_was_an_hole_and_he_taught_me_the/",
    "created_at": "2025-08-27T12:39:37.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1kh2asl",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "To all “new” and aspiring FF",
    "text": "With my area in a hiring frenzy the last 5 years, and influx of new people and station visits I feel there is a topic not often relayed to people looking to get into this career. It’s always “prep” and fitness and interview stuff. The reality of the job isn’t something people truly convey sometimes. What I mean by that is not the dangers or the things we do on a daily basis or the traumatic events we see. I mean how it affects every facet of your life. If you would’ve asked me or came for a visit 10 years ago my tune might be a little different. I say this as a 3rd generation FF. You ask me Now? My department has made me jaded. The culture has made me jaded. Not being home and missing milestone events and holidays, working 120s routinely by force and sleeping 45 minutes a night at the busiest house for years, and realizing every morning you literally didn’t “help” anyone. Maybe 2/100 calls are actually a time where we felt like we did something good. Now I’m riddled with injuries, cancer scares, our city insurance denies every claim and forces you to get a work comp attorney just to cover your herniated disks and almost 80% of people I know that have retired with cancer have had all their claims denied. They are on Fixed incomes now trying to afford an attorney so the prostate cancer they got from 35 years on the floor can get treated. All that to say no one can tell you if it’s worth it. You need to deep dive weigh the pros and cons and truly decide if this is right for your family and you. Because at the end of the day we have an insanely high divorce rate that NO ONE talks about. your family will also be bearing the burden of this career so I tell all young folks coming in, it’s a fantastic career, I’ve afforded a lot of things because of this career and I have a secure paycheck every 2 weeks and no I wouldn’t do a different job unless maybe I was in a country that had free college education. But it isn’t for everyone and your family NEEDS to understand what it is you’re signing them up for. Many people come into this job with either long time girlfriends or married already with children. On paper your wife or partner may think it’s great you’re home 20 days a month if you don’t  work extra. I’ve seen countless divorces, the stupidity of fireman and the “god complex” or fuck boy mentality this culture can create has destroyed families. Yes there are people not divorced that made it the entire way and are still in love, it can happen but it’s rare in this profession. This job can easily consume your identity and can consume your free time and life with the infinite knowledge and urge to be better or whatever your vice is. Reality check, you can be the baddest hardest fireman on earth and fight 3000 fires.. when you retire no one gives a shit. When you’re in a con home or retirement home no one knows who you were and no one cares. Take care of yourself, you get one life and live it how you want to but remember if you’re out here fighting to just show people you’re badass it’s the worst reason to do this job. I’ve watched people spiral into alcoholism, I’ve had multiple coworkers commit suicide seemingly out of the blue. I’ve taught 6 academies just to watch 50% of the class quit on the floor because it’s not what they thought. The culture is slowly changing for the better but at the end of the day no one can tell you or your partner if this is right for you both. If you’re truly having doubts, don’t be the person either that takes someone spot in the academy just to quit in the first week because it isn’t what you thought. I can’t speak to the rest of the country but where I am municipal academies are nothing like college academies. It is harder, it is faster, and if you think just because you took a CPAT or college academy 3 years you’re ready, I’m here to say you aren’t. That  is my TED talk. ",
    "score": 152,
    "url": "https://reddit.com/r/Firefighting/comments/1kh2asl/to_all_new_and_aspiring_ff/",
    "created_at": "2025-05-07T16:52:55.000Z",
    "num_comments": 73
  },
  {
    "id": "reddit-1izcfpk",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "I did it!",
    "text": "After years of volunteering and interviewing, I finally got my first job offer!\n\nWhen I first began my journey to become a firefighter two years ago, I had no idea how to achieve this goal. I figured the best approach was to gain experience by volunteering. After about a year, I earned my FF1, FF2, and Hazmat Operations certifications through a local combination department. During this time, I also became an EMT.\n\nAfter that year, I landed my first seasonal FF/EMT position and began studying and testing for the civil service exam. The first time I took it, I totally bombed it. Feeling discouraged, I sought out better study materials. After three months, I retook the test and earned a strong score, which allowed me to start interviewing with various departments.\n\nI made it to the chief’s interview in my first round of applications but ultimately didn’t receive an offer. Again, feeling underprepared, I looked for ways to improve my interview skills. I took a few courses, did mock interviews, and kept applying to departments across my state. After about five months of applying, traveling, and interviewing, I finally received my first FF/EMT job offer!\n\nIt’s not from a department I see myself at long term, but it’s a step in the right direction—another opportunity to build my skills and resume. Mind you, this is a career change for me in my late 30s.\n\nSo, to all you youngsters out there thinking you don’t have time—you do. And to all of us “old folks,” you’re not too old to start a career in this field.\n\nI’m super excited about this opportunity and happy to answer any questions about the process.\n\nThanks for reading!",
    "score": 150,
    "url": "https://reddit.com/r/Firefighting/comments/1izcfpk/i_did_it/",
    "created_at": "2025-02-27T10:07:04.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1i940wp",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Just got hired!",
    "text": "I just got hired on at the first career department I’ve ever applied to! It’s my hometown, 8 stations, ~100k pop. in TX. I wanted to come on here and thank everyone posting advice for newbies, it made a difference in how I approached the hiring processes!\n\nP.s. I have to go through their municipal academy (I don’t have any certs) and any advice is appreciated!!",
    "score": 145,
    "url": "https://reddit.com/r/Firefighting/comments/1i940wp/just_got_hired/",
    "created_at": "2025-01-24T19:41:17.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1ku4ubi",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Is the firefighter only role becoming obsolete?",
    "text": "I hope this doesn't fall out of the guidelines for posting.  This is not a question about becoming a firefighter.  Im actually NOT a firefighter, but am looking to become one.   I recently spoke at to some firemen at a career day in Northern California and was basically told \"most cities are having a hard time justifying firefighter only roles.  become a paramedic if you want a job.\"   Is this really true?  ",
    "score": 144,
    "url": "https://reddit.com/r/Firefighting/comments/1ku4ubi/is_the_firefighter_only_role_becoming_obsolete/",
    "created_at": "2025-05-24T06:14:19.000Z",
    "num_comments": 134
  },
  {
    "id": "reddit-1mg8sud",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Single FF on first due engine?",
    "text": "Im the only paid FF/PM on my department of 20 volunteers other than the chief. I staff the station opposite of chief. We have a 5 square mile coverage area with a mix of industrial and residential. We have two engines both 1000 gallons on board and we are fortunate to have a good water supply in town. We have a good mix of career/experienced volunteers that will be coming to assist. \nMy workflow is windshield size up, pump gear/water my pump, gear up, strech line nearest to fire, and radio my 360. By that point 2 or 5 guys(hopefully) will be on scene and more not far out with either 2nd due engine. \nAs the first due solo responder what is the priorities/workflows in yalls opinion for confirmed structure fires? I know its not ideal but it's what I signed up for. ",
    "score": 140,
    "url": "https://reddit.com/r/Firefighting/comments/1mg8sud/single_ff_on_first_due_engine/",
    "created_at": "2025-08-03T03:09:23.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1pj7l1x",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "High standard volunteer dept?",
    "text": "I recently just joined my local Vol dept just to fill in some gaps in my daily life, Im a full time guy with 5 years as a career fireman and extremely passionate about the service. I thought I was gonna come in all cocky “I’m gonna teach these guys and thing or 2”. Wrongfully egotistical. Needless to say, I was pleasantly surprised and humbled quick. I’ve seen some rinky dink country vol depts but this one I joined basically staffs stations and has same standards as paid depts with a fairly huge district, badass fleet at the stations too. Most of these guys are career guys, fuckin studs, with only a handful of true volunteers that are go getters. I’ve seen more passion, pride in these guys than my actual job. If I was some joeblow i would think they are a career dept if it wasn’t for the truck stickers. Why won’t these depts just go full paid or hybrid? What’s typically the reason of why they don’t? Have yall seen a vol dept. that operates with such high standards?",
    "score": 136,
    "url": "https://reddit.com/r/Firefighting/comments/1pj7l1x/high_standard_volunteer_dept/",
    "created_at": "2025-12-10T16:49:21.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1ldtkld",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Fire Apparatus Cost Crisis",
    "text": "Hi all,\n\nMy name is Daniel Ruetenik, and I’m a producer with CBS News. I’m currently working on a story focused on the affordability crisis affecting fire apparatus—from aging trucks that departments can’t afford to replace, to equipment shortages, maintenance issues, and the rising costs of new rigs.\n\nI want to hear from departments of all sizes—career, volunteer, combination—who are facing these kinds of challenges or have found innovative solutions. Your stories, struggles, and successes could help shed light on a nationwide issue that deserves more attention.\n\nIf your department is stretched thin when it comes to apparatus or equipment, or has navigated this issue in a unique way, I’d love to connect.\n\nPlease reach out to me directly at ruetenikd@cbsnews.com.\n\nThanks,\n\n— Daniel Ruetenik\n\nCBS News",
    "score": 133,
    "url": "https://reddit.com/r/Firefighting/comments/1ldtkld/fire_apparatus_cost_crisis/",
    "created_at": "2025-06-17T17:39:27.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1pbnas3",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Who here got into the fire service without that “burning passion” from the beginning?",
    "text": "I keep seeing guys who knew they wanted to be firefighters since they were 5 years old—family tradition, obsessed with trucks, the whole “it’s a calling” thing. Which is awesome, but that’s never been me. I’m in my mid 20s currently in the beginning steps of starting to pursue a career in the fire service. \n\nI think the job looks badass (obviously) and I’m also very interested in the medical part of it but honestly what really draws me in was the combo of the pay, benefits, retirement, schedule, job security, and getting to do something physical and meaningful. I respect the hell out of the job and I’m excited about chasing after it, but I don’t have that deep emotional “this is my destiny” feeling a lot of people seem to have. Sometimes I wonder if that’s something I should be feeling. \n\nSo my question is:\nHow many of you are (or know) great firefighters who got in mostly for the career perks and later grew to love the job—or at least found it was still an awesome career even without that childhood dream driving you?\n\nBasically, do you have to be “all-in” passionate from day one to be happy and successful in this job long-term? ",
    "score": 131,
    "url": "https://reddit.com/r/Firefighting/comments/1pbnas3/who_here_got_into_the_fire_service_without_that/",
    "created_at": "2025-12-01T20:07:27.000Z",
    "num_comments": 105
  },
  {
    "id": "reddit-1oqcb05",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Firefighters, what are some things you did / the average non-firefighting person does, that you will never do again since starting your career?",
    "text": "Things like not cleaning out the lint trap, overloading outlets, wearing synthetic clothing near big open flames, etc. ",
    "score": 119,
    "url": "https://reddit.com/r/Firefighting/comments/1oqcb05/firefighters_what_are_some_things_you_did_the/",
    "created_at": "2025-11-06T21:58:22.000Z",
    "num_comments": 192
  },
  {
    "id": "reddit-1jwt29p",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Has it ever crept up on you just how much f*cked up stuff you’ve seen?",
    "text": "I was just on quora and the topic of tailgaters (riding the ass of the person in front of you in a car) came up, and I wrote something about how much I loathe that. I went into all the people I saw killed horribly as a result of some d!ck head who did that exact thing, and I started getting REALLY heated about it. I started typing and telling stories to dissuade people from the activity, and next thing I know, I’m 5 stories deep about dead kids and people that watched their loved ones die with no end to the stories in sight and all but screaming at the keyboard. \n\nIt’s funny because I think I’ve had it pretty chill in my career. And for sure, a lot of people have seen a lot worse than I have... but I think it finally hit me that I’ve actually seen a LOT of fucked up stuff that largely went under the radar. I didn’t think any of it really affected me, and I guess in the beginning of my career, I was at one of the busiest spots in my city for all the intense calls (fires, entrapments, accidents). And now that I’m home more, and at a slower spot for health reasons, I think that stuff is either catching up or I’m just getting the chance to really acknowledge it. \n\nLike wild stuff that I just didn’t think about is starting to pop into my head. And this isn’t some cry for help or anything like that at all. But I do kind of feel like a pussy for getting a worked up about it. But between medical runs of terrible stuff, suicides, suicides where they took out other people, dead kids, dying kids, kids I couldn’t save, or just didn’t make the right move fast enough to save them... I dunno. I just had this weird moment of reflection that slammed into me. I haven’t even been on the job all that long. I’ve got just under 10 years on so again, I know other dudes have seen way worse. I dunno. \n\nI guess my question/discussion is if anyone ever had this moment? When did it happen in your career? I love this job and I’m fine, but it was just something weird.",
    "score": 117,
    "url": "https://reddit.com/r/Firefighting/comments/1jwt29p/has_it_ever_crept_up_on_you_just_how_much_fcked/",
    "created_at": "2025-04-11T15:46:55.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1mpfn6i",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Millionaire Firefighters and their story",
    "text": "I understand you cannot become a millionaire off a firemen’s salary or that we did not sign up for this to become rich. However, those of you that have achieved becoming a millionaire or multi millionaire what did you during your career to accomplish this feat? What habits did you always use and exercise. Or if you left this profession for one and are now a millionaire I would like to hear your story. I currently put money away in a Roth IRA and 457. I also own a rental property, am very curious to hear your responses.",
    "score": 105,
    "url": "https://reddit.com/r/Firefighting/comments/1mpfn6i/millionaire_firefighters_and_their_story/",
    "created_at": "2025-08-13T20:27:47.000Z",
    "num_comments": 118
  },
  {
    "id": "reddit-1m6xsub",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Is the pay actually bad or is it just bad if you have a whole family to support?",
    "text": "I’m a teen going into a program this year for firefighting, then I want to do running start and get my associates in fire science and start a career in firefighting. I always see firefighters talk about how bad pay is, but when I look the yearly salary up (for Washington state at least) it seems pretty good. So is it good or bad?",
    "score": 57,
    "url": "https://reddit.com/r/Firefighting/comments/1m6xsub/is_the_pay_actually_bad_or_is_it_just_bad_if_you/",
    "created_at": "2025-07-23T02:42:51.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1kgmzlu",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "24/72 Schedule, City says they can’t pay us salary rate",
    "text": "Combination (career/part time) IL department. So career guys work 24/72 schedule with debit days every 9 shifts. Because of the schedule we can have 72, 96, or 120 hour paychecks, obviously a big variation. We’ve tried getting the city to just pay us a level rate every 2 weeks regardless of hours. Basically, salary/26 paychecks. They say legally they can’t do that? anyone have any insight? I feel like it’d be easier for everyone involved, easier for us to budget, easier for them to do payroll. Seems like a win/win.\n",
    "score": 49,
    "url": "https://reddit.com/r/Firefighting/comments/1kgmzlu/2472_schedule_city_says_they_cant_pay_us_salary/",
    "created_at": "2025-05-07T02:49:10.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1ih86x4",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "98k a year driver operator?",
    "text": "I was looking at salary data for my city and noticed that a “Driver Operator” with the fire department is making $98k a year. That seems like a lot compared to what I’ve seen elsewhere. Can anyone explain what this role entails? This is for a town in Wisconsin with a population of under 80k people.",
    "score": 43,
    "url": "https://reddit.com/r/Firefighting/comments/1ih86x4/98k_a_year_driver_operator/",
    "created_at": "2025-02-04T03:15:08.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1ialdoq",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Pension",
    "text": "Just curious to see how other departments pension systems work. I'm a firefighter in New Jersey. My city gets 65% of our last years salary (no overtime) after 25 years. If you stay 30 years or longer you get 70% of your last year's salary .  ",
    "score": 43,
    "url": "https://reddit.com/r/Firefighting/comments/1ialdoq/pension/",
    "created_at": "2025-01-26T18:01:36.000Z",
    "num_comments": 153
  },
  {
    "id": "reddit-1mcsee8",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "24/72 work shift schedule",
    "text": "24/48 was the norm for most departments in the state I live until somewhat recently and then quite a few have moved to 48/96 which the firefighters seem to love. Now there is at least one department that may very well be moving to a 24/72 schedule but one of the major trade offs would be a salary freeze for a few years followed by “catch up“ years in which they’ll eventually get back to making the median salary for departments in the state of similar size.\n\nAnyways, I don’t know of any other departments in my state that work this schedule, do any of you know of or work for a department that do work 24 hours on, 72 off?",
    "score": 19,
    "url": "https://reddit.com/r/Firefighting/comments/1mcsee8/2472_work_shift_schedule/",
    "created_at": "2025-07-30T00:32:48.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1p1sgyc",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Salary / Hourly pay. Am I missing something?",
    "text": "I am a FF/PM in Illinois. I love the job and always thought the pay was pretty good. That was until I broke it down hourly. Most departments in my area are salaried, starting between 60k-80k with top outs anywhere from 90k-120k yearly. 24/48hr shifts are the norm so 56 hours a week. When I broke it down to a conventional hourly pay including overtime, 80k yearly is about 24/hr and 120k yearly is about 36/hr. \n\nMost hospital nursing jobs in my area start off upper 30s or low 40s hourly. Hell, Some grocery stores pay up to 25 an hour. \n\nIn theory, if I worked at target for 25/hr and got 16 hours of OT weekly I’d be making over 80k before taxes. \n\nDon’t get me wrong I love the job but am I missing something? \n\nLooking for other perspectives on this. Thanks!\n",
    "score": 18,
    "url": "https://reddit.com/r/Firefighting/comments/1p1sgyc/salary_hourly_pay_am_i_missing_something/",
    "created_at": "2025-11-20T03:16:04.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1ooo943",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Is it difficult being a firefighter?",
    "text": "I’m currently 16, I’ve aspired to be a firefighter for about a year now and was wondering what a day to day basis is like on the job.\n\nHow difficult is it being on the force? Is it mentally challenging? Do you still see your family and friends to your own level of desire? And most of all are you satisfied with your salary.\n\nAny replies would be greatly appreciated.",
    "score": 16,
    "url": "https://reddit.com/r/Firefighting/comments/1ooo943/is_it_difficult_being_a_firefighter/",
    "created_at": "2025-11-05T00:23:33.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1is4rlw",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "How does Fire fighter pay typically work?",
    "text": "I know it can vary, but are firefighters typically paid hourly or salaried? I’ve seen job postings for both, but what’s more common?\n\nAlso, how does overtime usually work? Is it calculated bi-weekly, with anything over 80 hours in a two-week pay period paid at time-and-a-half? Or is it based on a monthly schedule or something else entirely?\n\nI appreciate any insight you can provide, and thanks again for your time!",
    "score": 14,
    "url": "https://reddit.com/r/Firefighting/comments/1is4rlw/how_does_fire_fighter_pay_typically_work/",
    "created_at": "2025-02-18T04:52:22.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1pimayv",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Fire families where the wife works full time, what is it like raising young kids?",
    "text": "My husband and I both want kids, however we cannot survive off of his salary alone if we add to our family of 2. He has his family nearby and they’ll help with child care, but what is the split like with mental load? Ladies, how do you feel having your husband be the primary care taker when hes off of shift? I cant help but feel I would be jealous that he gets to be home with our kids 4 days a week and I ultimately become the secondary caretaker. Does having him home for 4 days and being gone for 2 mess with your kids schedule, and if so, how?  ",
    "score": 12,
    "url": "https://reddit.com/r/Firefighting/comments/1pimayv/fire_families_where_the_wife_works_full_time_what/",
    "created_at": "2025-12-09T23:06:57.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1j2jow5",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Side jobs in healthcare: no-brainer or recipe for burnout?",
    "text": "I am a career firefighter/paramedic and my FD is my absolute work priority that I am passionate about. That said, I have been exploring opportunities for side work as well as further education; mostly in the healthcare field.\n\nI’ve worked a few part-time roles including private ambulance transport, ER tech, and anesthesia assistant at an oral surgery office. They’ve all served as easy side money, but none of them with any opportunity for advancement or salary increase.\n\nSome considerations for me include going back to college for nursing or respiratory therapy. There’s also the paramedic route of critical care, flight medic, etc. I am passionate about medicine and I nerd out on human anatomy and biology—but I worry that doing more medical care on top of a full-time at the fire department will lead to burnout and resentment for the healthcare field. I do have a limited social battery which actually complements EMS well—we’ll treat and transport a patient for no more than an hour before transferring care and moving on.\n\nOutside of exploring healthcare, I know that I struggle with “desk jobs”. There’s always looking at other trades; but I have zero experience in fields such as construction—I’m willing to learn, but this path would also require looking at education/apprenticeships.\n\nJust looking for outside perspectives,  anecdotal experience, and words of wisdom.",
    "score": 9,
    "url": "https://reddit.com/r/Firefighting/comments/1j2jow5/side_jobs_in_healthcare_nobrainer_or_recipe_for/",
    "created_at": "2025-03-03T14:20:16.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1j4d8w7",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "I feel like I am seeing so much misinformation about A Firefighter’s salary .",
    "text": "Hey y’all, I want to become a firefighter and I have put a lot of research into everything I need to know. The one thing I can’t find an answer on is the actual salary I will be getting for being a firefighter and how I can advance that salary further into my career.\n\nI live in LA, specifically Santa Monica which is a pretty populated area. if i joined the Los Angeles Fire department, what would my base pay, (including over time look like), and how can I increase that base pay over time\n\nAlso, I have been hearing online that right now, firefighters are really needed. Is it a competitive job or not really? How long should I expect to get hired after completing all my certifications?",
    "score": 8,
    "url": "https://reddit.com/r/Firefighting/comments/1j4d8w7/i_feel_like_i_am_seeing_so_much_misinformation/",
    "created_at": "2025-03-05T20:37:05.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1ir3qiw",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Salary for CO Medic Departments?",
    "text": "Hey everyone,\n\nI'm currently 19 years old and have grown an interest in working in emergency services since it aligns with my passions for fitness, the study of human physiology and just the desire to help others. I know salary should not be anywhere close to a reason you would choose a job in the field of emergency services, but does anyone know which department pays well to become a medic/firefighter? any insight is appreciated",
    "score": 7,
    "url": "https://reddit.com/r/Firefighting/comments/1ir3qiw/salary_for_co_medic_departments/",
    "created_at": "2025-02-16T21:55:11.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1jhtncf",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Question for Fairfax County Firefighter",
    "text": "Hi,\nI’m considering a career change to a firefighter. I think it could be very rewarding and offer a flexible lifestyle that might work well for me. However, I’m switching from tech so I want to understand the career trajectory and the salary I can expect. I know someone who is a firefighter/EMT as well and he explained some to me but I wanted some more anecdotal insight into the career. I understand that it starts just under or around 70k while in the academy then you make a bit more on the field then if you get a paramedic cert, you can make a little over 100k with the first 2-2.5 years. But where does it go after that? \n\nI know there is the pay scale sheet but it was confusing because it doesn’t account for the full schedule for Fairfax county and the cert and career trajectory.\n\nI also know they have pretty good benefit including the pension system but I’m not sure how much value that adds onto the base salary.\n\nI know this career isn’t about money but I’d still like to have a full understanding of what I can expect since I would be making a big career change from tech which the pay can scale very nicely… I’m not expecting the same but would like to know if it can be comparable or just get a realistic expectation\n\nThank you!\n",
    "score": 6,
    "url": "https://reddit.com/r/Firefighting/comments/1jhtncf/question_for_fairfax_county_firefighter/",
    "created_at": "2025-03-23T07:12:25.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1kd8j50",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Lateral transfer to Portland, ME?",
    "text": "Hello everyone, I am in my late 20’s and a current MA firefighter who lives in Boston. I work for a busy town of around 30k people and my department is 52 FF’s. I have been on for four years. We do not run an ambulance. I have been just thinking about going somewhere a little cheaper to live but maybe working at a bigger department. I love Portland, ME so maybe thats an option? I would be taking a $20k base salary cut. Does anyone have insight to this decision or the Portland Fire Dep? Thank you all in advance.",
    "score": 6,
    "url": "https://reddit.com/r/Firefighting/comments/1kd8j50/lateral_transfer_to_portland_me/",
    "created_at": "2025-05-02T18:44:32.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1nnz4ur",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Is it possible to live on a firefighter salary in Wyoming or Montana?",
    "text": "Looking for a little insight. The wife and I would like to move with pur 17 month old son. We would be moving from Minnesota and have narrowed it down to Wyoming and Montana. My wife is currently a CNA and wants to go to nursing school. Is it possible to support a family on a single salary there? If so, and recommendations on departments?",
    "score": 6,
    "url": "https://reddit.com/r/Firefighting/comments/1nnz4ur/is_it_possible_to_live_on_a_firefighter_salary_in/",
    "created_at": "2025-09-22T21:27:06.000Z",
    "num_comments": 13
  }
]