[
  {
    "id": "reddit-1iuvxc9",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Made my first grab from a structure fire",
    "text": "I’ve been on the job for about 6 years or so, but this was definitely my first time with a grab. We responded to a structure fire at about 5 in the morning, upon arrival house was fully involved and there were no reports to dispatch of someone in the house still. Once parked we had bystanders running towards the unit yelling and pleading that there was a 2 month baby inside the structure still. Now the rest is kind of a blur, I don’t think I’ve ever had so much of an adrenaline dump.. But I suited up the fasted I’ve ever had and made way towards the engulfed mobile home. Bystanders(not sure if the parents or not) stated baby was in the “far right room”. Even tho conditions of structure were defensive, I made entry through front door. I felt I was in there for an eternity.. smoke was full from top to bottom, complete unknown layout of home, couldn’t see a thing. As right hand search was being conducted I felt the crib.. at first I thought the 2 month old baby inside was a doll of how small she was.. I made the grab and made head way to the outside. Engine crew stated I was only inside structure for about 15-20 seconds. Once outside I headed straight for the ambulance with the unresponsive child. Proceeded to initiate care and transport to our ER.. while en route we heard the sweetest, most comforting cry I have ever heard in my life, she was starting to breathe on her own… \n\nGot word back from ER that baby is doing good and it felt so good to hear. Just thought I’d share this story with some fellow FF",
    "score": 10891,
    "url": "https://reddit.com/r/Firefighting/comments/1iuvxc9/made_my_first_grab_from_a_structure_fire/",
    "created_at": "2025-02-21T17:08:48.000Z",
    "num_comments": 488
  },
  {
    "id": "reddit-1i7kni0",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Reasons For Calls",
    "text": "Saw someone ask what all we do besides fire. Here’s a list the shifts add to for dumb calls. It was started a few months ago ",
    "score": 1424,
    "url": "https://reddit.com/r/Firefighting/comments/1i7kni0/reasons_for_calls/",
    "created_at": "2025-01-22T20:11:15.000Z",
    "num_comments": 223
  },
  {
    "id": "reddit-1ldq26u",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "I got in! Just wanted to say Thanks",
    "text": "I’m a 38/M and I felt the fire service calling a few years ago. I never thought about firefighting, not for one second in my life to be completely honest. Then one day, it kind of popped into my head and I couldn’t get it out. I started watching all the movies, reading books on it, and doing a ton of research. I was listening to “multiple calls” podcast all the time and had about zero tangible knowledge of the trade. \n\nI waited a bout 2 years for my city (NE medium population) to open up applications. This was their first national search (since the residency restrictions were lifted). Around 2k people applied and they only hired about 20 for the upcoming class. \n\nI studied really hard for the written test. I used the city’s study guide, bought a few books, and also downloaded other public department’s Study guides I found online (Columbus, Chicago, &amp; Erie). \n\nI got back in shape. Training every day for the physical test. Weighted vest on the steepest incline, ran a few half marathons, and kept it clean with the dinner table. \n\nI got ranked 10th on the list and felt good about my efforts. Then towards the end of winter I got the call for processing. Now, The Academy starts soon and I’m very excited for my new career. \n\nBasically, I just wanted to say thank you to all the firefighters that share their thoughts and experiences on this page. It’s helped me a lot to understand the theoretical dynamics of the career and day-in-the-life. The kind stuff you can’t find on a website or google. You guys have helped me greatly and I am very thankful.  Thank you! ",
    "score": 462,
    "url": "https://reddit.com/r/Firefighting/comments/1ldq26u/i_got_in_just_wanted_to_say_thanks/",
    "created_at": "2025-06-17T15:25:42.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1o8xl6q",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "A Lawyer asked me to do something that illegal, morally and ethically wrong.",
    "text": "I'm a FF/EMT-B, the other day a friend of mine asked me to meet him for breakfast. When I got there his brother in law was there with him. Long story short this wasn't just a friendly get together. It was a pitch from the lawyer to start giving him the info from people who were involved in MVAs. He wanted everything including faxing him copies of the reports so he can call them to solicit business. He would pay me $100 for each one.\n\nI told him no way in hell and I told him I'm not gonna risk my career for dirt bags like him. I left right after that. ",
    "score": 452,
    "url": "https://reddit.com/r/Firefighting/comments/1o8xl6q/a_lawyer_asked_me_to_do_something_that_illegal/",
    "created_at": "2025-10-17T10:22:39.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1lsqmlb",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Major change in my Life !! Chase your dream",
    "text": "I (32M) just made a major life change. I was recently hired as a full-time firefighter in my city of around 200,000 people. It was a dream I thought I had to let go of mainly because of my age and the salary I was earning (around $100K), since now I’m starting over at the bottom, making $25/hour. But as the years went by, I realized I no longer enjoyed what I was doing. Mornings were tough, and I was already looking forward to the end of the day as soon as it began.\n\nThanks to two of my friends who encouraged me to apply during the recruitment process, I’m now a firefighter after a year-long journey! I had to get back into the books, study hard, and train after long workdays—but all my efforts paid off. Now, my wife sees a man who’s happy to come home from work!\n\nBelieve in your dreams, even if you think you’re too old—you’re not! We all have different paths, and each one gives you tools along the way. I’m the oldest in my group, but I bring maturity to the team. If you still have doubts, go for it and chase your dream !! #515 ",
    "score": 225,
    "url": "https://reddit.com/r/Firefighting/comments/1lsqmlb/major_change_in_my_life_chase_your_dream/",
    "created_at": "2025-07-06T02:34:55.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1mpfn6i",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Millionaire Firefighters and their story",
    "text": "I understand you cannot become a millionaire off a firemen’s salary or that we did not sign up for this to become rich. However, those of you that have achieved becoming a millionaire or multi millionaire what did you during your career to accomplish this feat? What habits did you always use and exercise. Or if you left this profession for one and are now a millionaire I would like to hear your story. I currently put money away in a Roth IRA and 457. I also own a rental property, am very curious to hear your responses.",
    "score": 105,
    "url": "https://reddit.com/r/Firefighting/comments/1mpfn6i/millionaire_firefighters_and_their_story/",
    "created_at": "2025-08-13T20:27:47.000Z",
    "num_comments": 118
  },
  {
    "id": "reddit-1m6xsub",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Is the pay actually bad or is it just bad if you have a whole family to support?",
    "text": "I’m a teen going into a program this year for firefighting, then I want to do running start and get my associates in fire science and start a career in firefighting. I always see firefighters talk about how bad pay is, but when I look the yearly salary up (for Washington state at least) it seems pretty good. So is it good or bad?",
    "score": 53,
    "url": "https://reddit.com/r/Firefighting/comments/1m6xsub/is_the_pay_actually_bad_or_is_it_just_bad_if_you/",
    "created_at": "2025-07-23T02:42:51.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1kgmzlu",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "24/72 Schedule, City says they can’t pay us salary rate",
    "text": "Combination (career/part time) IL department. So career guys work 24/72 schedule with debit days every 9 shifts. Because of the schedule we can have 72, 96, or 120 hour paychecks, obviously a big variation. We’ve tried getting the city to just pay us a level rate every 2 weeks regardless of hours. Basically, salary/26 paychecks. They say legally they can’t do that? anyone have any insight? I feel like it’d be easier for everyone involved, easier for us to budget, easier for them to do payroll. Seems like a win/win.\n",
    "score": 51,
    "url": "https://reddit.com/r/Firefighting/comments/1kgmzlu/2472_schedule_city_says_they_cant_pay_us_salary/",
    "created_at": "2025-05-07T02:49:10.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1ih86x4",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "98k a year driver operator?",
    "text": "I was looking at salary data for my city and noticed that a “Driver Operator” with the fire department is making $98k a year. That seems like a lot compared to what I’ve seen elsewhere. Can anyone explain what this role entails? This is for a town in Wisconsin with a population of under 80k people.",
    "score": 45,
    "url": "https://reddit.com/r/Firefighting/comments/1ih86x4/98k_a_year_driver_operator/",
    "created_at": "2025-02-04T03:15:08.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1ialdoq",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Pension",
    "text": "Just curious to see how other departments pension systems work. I'm a firefighter in New Jersey. My city gets 65% of our last years salary (no overtime) after 25 years. If you stay 30 years or longer you get 70% of your last year's salary .  ",
    "score": 42,
    "url": "https://reddit.com/r/Firefighting/comments/1ialdoq/pension/",
    "created_at": "2025-01-26T18:01:36.000Z",
    "num_comments": 153
  },
  {
    "id": "reddit-1mcsee8",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "24/72 work shift schedule",
    "text": "24/48 was the norm for most departments in the state I live until somewhat recently and then quite a few have moved to 48/96 which the firefighters seem to love. Now there is at least one department that may very well be moving to a 24/72 schedule but one of the major trade offs would be a salary freeze for a few years followed by “catch up“ years in which they’ll eventually get back to making the median salary for departments in the state of similar size.\n\nAnyways, I don’t know of any other departments in my state that work this schedule, do any of you know of or work for a department that do work 24 hours on, 72 off?",
    "score": 18,
    "url": "https://reddit.com/r/Firefighting/comments/1mcsee8/2472_work_shift_schedule/",
    "created_at": "2025-07-30T00:32:48.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1p1sgyc",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Salary / Hourly pay. Am I missing something?",
    "text": "I am a FF/PM in Illinois. I love the job and always thought the pay was pretty good. That was until I broke it down hourly. Most departments in my area are salaried, starting between 60k-80k with top outs anywhere from 90k-120k yearly. 24/48hr shifts are the norm so 56 hours a week. When I broke it down to a conventional hourly pay including overtime, 80k yearly is about 24/hr and 120k yearly is about 36/hr. \n\nMost hospital nursing jobs in my area start off upper 30s or low 40s hourly. Hell, Some grocery stores pay up to 25 an hour. \n\nIn theory, if I worked at target for 25/hr and got 16 hours of OT weekly I’d be making over 80k before taxes. \n\nDon’t get me wrong I love the job but am I missing something? \n\nLooking for other perspectives on this. Thanks!\n",
    "score": 17,
    "url": "https://reddit.com/r/Firefighting/comments/1p1sgyc/salary_hourly_pay_am_i_missing_something/",
    "created_at": "2025-11-20T03:16:04.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1ooo943",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Is it difficult being a firefighter?",
    "text": "I’m currently 16, I’ve aspired to be a firefighter for about a year now and was wondering what a day to day basis is like on the job.\n\nHow difficult is it being on the force? Is it mentally challenging? Do you still see your family and friends to your own level of desire? And most of all are you satisfied with your salary.\n\nAny replies would be greatly appreciated.",
    "score": 16,
    "url": "https://reddit.com/r/Firefighting/comments/1ooo943/is_it_difficult_being_a_firefighter/",
    "created_at": "2025-11-05T00:23:33.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1is4rlw",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "How does Fire fighter pay typically work?",
    "text": "I know it can vary, but are firefighters typically paid hourly or salaried? I’ve seen job postings for both, but what’s more common?\n\nAlso, how does overtime usually work? Is it calculated bi-weekly, with anything over 80 hours in a two-week pay period paid at time-and-a-half? Or is it based on a monthly schedule or something else entirely?\n\nI appreciate any insight you can provide, and thanks again for your time!",
    "score": 15,
    "url": "https://reddit.com/r/Firefighting/comments/1is4rlw/how_does_fire_fighter_pay_typically_work/",
    "created_at": "2025-02-18T04:52:22.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1pimayv",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Fire families where the wife works full time, what is it like raising young kids?",
    "text": "My husband and I both want kids, however we cannot survive off of his salary alone if we add to our family of 2. He has his family nearby and they’ll help with child care, but what is the split like with mental load? Ladies, how do you feel having your husband be the primary care taker when hes off of shift? I cant help but feel I would be jealous that he gets to be home with our kids 4 days a week and I ultimately become the secondary caretaker. Does having him home for 4 days and being gone for 2 mess with your kids schedule, and if so, how?  ",
    "score": 13,
    "url": "https://reddit.com/r/Firefighting/comments/1pimayv/fire_families_where_the_wife_works_full_time_what/",
    "created_at": "2025-12-09T23:06:57.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1j4d8w7",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "I feel like I am seeing so much misinformation about A Firefighter’s salary .",
    "text": "Hey y’all, I want to become a firefighter and I have put a lot of research into everything I need to know. The one thing I can’t find an answer on is the actual salary I will be getting for being a firefighter and how I can advance that salary further into my career.\n\nI live in LA, specifically Santa Monica which is a pretty populated area. if i joined the Los Angeles Fire department, what would my base pay, (including over time look like), and how can I increase that base pay over time\n\nAlso, I have been hearing online that right now, firefighters are really needed. Is it a competitive job or not really? How long should I expect to get hired after completing all my certifications?",
    "score": 10,
    "url": "https://reddit.com/r/Firefighting/comments/1j4d8w7/i_feel_like_i_am_seeing_so_much_misinformation/",
    "created_at": "2025-03-05T20:37:05.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1j2jow5",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Side jobs in healthcare: no-brainer or recipe for burnout?",
    "text": "I am a career firefighter/paramedic and my FD is my absolute work priority that I am passionate about. That said, I have been exploring opportunities for side work as well as further education; mostly in the healthcare field.\n\nI’ve worked a few part-time roles including private ambulance transport, ER tech, and anesthesia assistant at an oral surgery office. They’ve all served as easy side money, but none of them with any opportunity for advancement or salary increase.\n\nSome considerations for me include going back to college for nursing or respiratory therapy. There’s also the paramedic route of critical care, flight medic, etc. I am passionate about medicine and I nerd out on human anatomy and biology—but I worry that doing more medical care on top of a full-time at the fire department will lead to burnout and resentment for the healthcare field. I do have a limited social battery which actually complements EMS well—we’ll treat and transport a patient for no more than an hour before transferring care and moving on.\n\nOutside of exploring healthcare, I know that I struggle with “desk jobs”. There’s always looking at other trades; but I have zero experience in fields such as construction—I’m willing to learn, but this path would also require looking at education/apprenticeships.\n\nJust looking for outside perspectives,  anecdotal experience, and words of wisdom.",
    "score": 9,
    "url": "https://reddit.com/r/Firefighting/comments/1j2jow5/side_jobs_in_healthcare_nobrainer_or_recipe_for/",
    "created_at": "2025-03-03T14:20:16.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1jhtncf",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Question for Fairfax County Firefighter",
    "text": "Hi,\nI’m considering a career change to a firefighter. I think it could be very rewarding and offer a flexible lifestyle that might work well for me. However, I’m switching from tech so I want to understand the career trajectory and the salary I can expect. I know someone who is a firefighter/EMT as well and he explained some to me but I wanted some more anecdotal insight into the career. I understand that it starts just under or around 70k while in the academy then you make a bit more on the field then if you get a paramedic cert, you can make a little over 100k with the first 2-2.5 years. But where does it go after that? \n\nI know there is the pay scale sheet but it was confusing because it doesn’t account for the full schedule for Fairfax county and the cert and career trajectory.\n\nI also know they have pretty good benefit including the pension system but I’m not sure how much value that adds onto the base salary.\n\nI know this career isn’t about money but I’d still like to have a full understanding of what I can expect since I would be making a big career change from tech which the pay can scale very nicely… I’m not expecting the same but would like to know if it can be comparable or just get a realistic expectation\n\nThank you!\n",
    "score": 7,
    "url": "https://reddit.com/r/Firefighting/comments/1jhtncf/question_for_fairfax_county_firefighter/",
    "created_at": "2025-03-23T07:12:25.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ir3qiw",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Salary for CO Medic Departments?",
    "text": "Hey everyone,\n\nI'm currently 19 years old and have grown an interest in working in emergency services since it aligns with my passions for fitness, the study of human physiology and just the desire to help others. I know salary should not be anywhere close to a reason you would choose a job in the field of emergency services, but does anyone know which department pays well to become a medic/firefighter? any insight is appreciated",
    "score": 6,
    "url": "https://reddit.com/r/Firefighting/comments/1ir3qiw/salary_for_co_medic_departments/",
    "created_at": "2025-02-16T21:55:11.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1hu28h5",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Texas Firefighter Salary",
    "text": "So im thinking of moving to texas but I was wandering for all the guys in Texas how the firefighter pay is compared to california taking in the price of living etc. Would it be about the same?",
    "score": 6,
    "url": "https://reddit.com/r/Firefighting/comments/1hu28h5/texas_firefighter_salary/",
    "created_at": "2025-01-05T08:54:29.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1kd8j50",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Lateral transfer to Portland, ME?",
    "text": "Hello everyone, I am in my late 20’s and a current MA firefighter who lives in Boston. I work for a busy town of around 30k people and my department is 52 FF’s. I have been on for four years. We do not run an ambulance. I have been just thinking about going somewhere a little cheaper to live but maybe working at a bigger department. I love Portland, ME so maybe thats an option? I would be taking a $20k base salary cut. Does anyone have insight to this decision or the Portland Fire Dep? Thank you all in advance.",
    "score": 5,
    "url": "https://reddit.com/r/Firefighting/comments/1kd8j50/lateral_transfer_to_portland_me/",
    "created_at": "2025-05-02T18:44:32.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1ma72hr",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "How does your agency calculate overtime?",
    "text": "My previous agency on the left side of your check, your base salary, your education pay, any other bonuses tied to certifications, was factored under one single line item so that when your time and a half overtime calculation was factored, it was based on that number.\n\nMy current agency, your base pay, education pay, and any other certifications are separate line items. So when you factor in overtime, it’s solely calculated off your base pay.  \n\nEven some of our neighboring agencies calculate OT like my first apartment did, the one line item.  \n\nRecently, a few departments (Milford - I’ve reached out to their union but no response yet) have been in the news for successfully, suing their cities for backpay and proper calculation of overtime.  I asked our union about it and they stated that it’s being done correctly based on IAFF research as well as legal counsel. \n\nIf anyone knows more I’d appreciate your insights. ",
    "score": 5,
    "url": "https://reddit.com/r/Firefighting/comments/1ma72hr/how_does_your_agency_calculate_overtime/",
    "created_at": "2025-07-26T23:08:04.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1nnz4ur",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Is it possible to live on a firefighter salary in Wyoming or Montana?",
    "text": "Looking for a little insight. The wife and I would like to move with pur 17 month old son. We would be moving from Minnesota and have narrowed it down to Wyoming and Montana. My wife is currently a CNA and wants to go to nursing school. Is it possible to support a family on a single salary there? If so, and recommendations on departments?",
    "score": 5,
    "url": "https://reddit.com/r/Firefighting/comments/1nnz4ur/is_it_possible_to_live_on_a_firefighter_salary_in/",
    "created_at": "2025-09-22T21:27:06.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1klpus9",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Question for Prior service USAF Fire Fighters",
    "text": "First off, thank you for clicking on my post—and for everything you do!\n\nA little background about me: I’m a 28-year-old active duty USAF firefighter, currently serving. I’ve been in for 9 years and have just over a year left. My highest cert is Fire Officer I, and I’ve held that role for about 4 years.\n\nAs most of us in the DoD know, the Air Force is considered the premier branch for firefighting (especially ARFF, which i hate). I love this job. I’ve learned so much and still have the passion to keep going. My only real concern is... experience.\n\nI’d say I’ve been lucky with the calls I’ve been on and the places I’ve served: Mississippi, Honduras, Syria, Kuwait, Korea, Guam, Qatar, Germany. I’ve made a ton of connections—so many that I know I’ll have plenty of opportunities once I’m out of the Air Force.\n\nThat said, the experience we get in DoD firefighting is a FRACTION^2  from what city departments deal with. We’re certified, but I wouldn’t say we’re as qualified. Honestly, it bothers me sometimes to be praised as a firefighter when I know I haven’t faced the same intensity that city guys do.\n\nRight now, I’m standing at a three-way crossroads:\n\nGo city\nGo GS (federal civilian)\nGo contract $$$\n\nYou’d think from the novel above, I’d know which path to take. But I don’t. I’m not afraid of starting from the bottom. Physically, I’m solid—I can handle an academy. Financially, I’ve been disciplined for years, and with whatever disability I get, I can afford to take a lower entry salary if needed.\n\nThe only advice I hear from my peers is “go GS” or “go contract.” No one I know has much perspective on transitioning from DoD firefighting to the civilian side. To some, it seems like a downgrade. I get why—but at the end of the day, I think it just depends on what matters most to you.\n\nI don’t feel fulfilled in the Air Force anymore. It’s been a great run, and I still show up every day and give it my all. But I’m ready for the next chapter. \n\nAny prior service firefighters out there with insight? I’d really appreciate any perspective on this transition.\n\n",
    "score": 4,
    "url": "https://reddit.com/r/Firefighting/comments/1klpus9/question_for_prior_service_usaf_fire_fighters/",
    "created_at": "2025-05-13T16:07:41.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1ou0n6k",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Recomendations for transfer.",
    "text": "Hey everyone! \n\nGunna start this off with some background. I'm 32, been on the job 8 years now with a 30 year retirement and 3 year buy out(25 years left). I've got multiple certs, listed below, and I'm looking at making a change to another state/department with the way my department is currently heading.\n\nCerts:\n1001-I-II\nDriver Operator\nFire instructor I-II\nFire Officer I-II\nHazmat A and O\nHazmat Tech Level 1\nRope Rescue A and O\nWilderness first aid\nFunsar\nAAIR(Active shooter training)\nGTI Trauma response\nNREMT-B\n\nI'm up for promotion whenever the next captains test comes about, but with the way our pay works right now, I'll only be getting an extra .16c per hour for it. Since I'm already passed captain base pay.\n\nI'm exhausted. Our union is constantly fighting the city tooth and nail for anything. We negotiated a contract one year ago that allowed us to get .15c per hour for every 40 hour class we took after a certain date. \n\nNow the city is more of less forcing us out of this contract via \"Admin rights\". They want to offer us a modified stennis salary(based on a 2088 schedule) when we work 3744 hours a year. We're on a 48/48 schedule. With optional Kelly shifts every 21 days. We're allowed(for now) to work them for overtime pay. Which is why I was able to make 78,000 last year. Albeit that was over the course of roughly 4800 hours.\n\nI'm not burning out from the job by any means. I love the job. But this shit is getting old real quick.\n\nI said all that to say this.\n\nAnyone have any recomendations on possible places to apply for?\n\nI'm ultimately looking for a smaller town(roughly 150k population or less) with a decent cost of living(1500 sqft house for around 250k), being able to make around 80,000 a year.\n\nAny advice would be much appreciated!\n\n\n\n",
    "score": 3,
    "url": "https://reddit.com/r/Firefighting/comments/1ou0n6k/recomendations_for_transfer/",
    "created_at": "2025-11-11T04:55:48.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1im8efo",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Is a Fire Protection Technician Diploma Worth It?",
    "text": "**I'm currently in school for a Fire Protection Technician (technical diploma) while also taking Fire 1 and 2 other fire science classes. However, I'm wondering if these extra classes are worth it or if I should just focus on finishing Fire 1. It would give me more free time and save some $.** \n\n**For context:**\n\n* **I already have my EMT certification.**\n* **I'm an intern at a large department and work part-time for a private ambulance service.**\n* **I already have a bachelor's degree from a four-year university.**\n* **Most departments near me only require Fire 1 and EMT—not the full diploma.**\n\n**Given my situation, is getting the technical diploma actually beneficial?**\n\n* **Does it make you more employable?**\n* **Does it affect salary in most departments?**\n* **Would it be helpful for eventually pursuing graduate school (e.g., Emergency Services Management)?**",
    "score": 3,
    "url": "https://reddit.com/r/Firefighting/comments/1im8efo/is_a_fire_protection_technician_diploma_worth_it/",
    "created_at": "2025-02-10T15:15:51.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1my5w5k",
    "subreddit": "Firefighting",
    "soc_codes": [
      "33-2011"
    ],
    "title": "Hello, I need to ask important question about the earning",
    "text": "I am 17 and will graduate in 2 years. I have never been the smartest and don't think I am gonna go to university, so I decided I might as well do something useful for society and become a firefighter. I always admired them.\nBut of course I need to ask about the salary. I know firefighters can earn good money from extra shifts. So can you please tell me in what country do you live and are you happy with your income. Thank you in advance!",
    "score": 2,
    "url": "https://reddit.com/r/Firefighting/comments/1my5w5k/hello_i_need_to_ask_important_question_about_the/",
    "created_at": "2025-08-23T16:25:55.000Z",
    "num_comments": 25
  }
]