[
  {
    "id": "reddit-1p7pefu",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "UPDATE: Paid $3000 for this artificial lawn. Any fixing this?",
    "text": "As many expected, the landscaper never returned to finish the job and blocked my parents, my wife's and my phone numbers. My parents talked to the bank and they're unable to refund or hold the payment because it's already deposited. Unfortunately we're just going to have to move on.\n\nThe night I made the post, I got a message from a local Redditor asking if they could see the lawn in person. Long story short, they're a professional landscaper. They not only took the time to explain everything wrong with the installation (ex: the turf is actually meant for balconies) but also removed and reinstalled the turf free of charge! He declined payment multiple times but had a beer with my father which he really appreciated. I won't post his information on Reddit, but my parents have made posts in all their Facebook groups and we will be recommending him forever.\n\nOriginal Post: [https://www.reddit.com/r/landscaping/comments/1p5y03f/paid\\_3000\\_for\\_this\\_artificial\\_lawn\\_any\\_fixing\\_this/](https://www.reddit.com/r/landscaping/comments/1p5y03f/paid_3000_for_this_artificial_lawn_any_fixing_this/)",
    "score": 45814,
    "url": "https://reddit.com/r/landscaping/comments/1p7pefu/update_paid_3000_for_this_artificial_lawn_any/",
    "created_at": "2025-11-27T01:24:19.000Z",
    "num_comments": 1170
  },
  {
    "id": "reddit-1od8dop",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "My back yard garden after five years of work",
    "text": "I got into gardening like so many others did during Covid and have spent countless hours creating this space. Built a screen porch and tea-house inspired shed along the way. I finally stopped at 37 Japanese maples before I decided that was enough. \n\nSeveral people have asked for progress photos, so I put together an [album with a ton of before and current photos](https://imgur.com/a/xRS2pS3)",
    "score": 18106,
    "url": "https://reddit.com/r/landscaping/comments/1od8dop/my_back_yard_garden_after_five_years_of_work/",
    "created_at": "2025-10-22T13:32:02.000Z",
    "num_comments": 461
  },
  {
    "id": "reddit-1m4pl6u",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Am I overreacting to the start of this pool fill in?",
    "text": "Looking for feedback, suggestions, tips, whatever you got. \n\nContractor started the project yesterday. Looking at it last night, I don’t think there is any way to properly compact the fill at this point because of how they dumped large pieces of concrete in the pool. \n\nI don’t like how the pool was used as a trash pit.\n \nI don’t like that they didn’t do layers of fill and compacting each layer. \n\nI don’t think they cleared enough from the sides of the pool shell so the yard can’t be graded properly. (Hard to see in these pics)\n\nI stopped the project. Contractor says I’m being overly critical. ",
    "score": 13125,
    "url": "https://reddit.com/r/landscaping/comments/1m4pl6u/am_i_overreacting_to_the_start_of_this_pool_fill/",
    "created_at": "2025-07-20T13:58:19.000Z",
    "num_comments": 2036
  },
  {
    "id": "reddit-1mcsy2s",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Dug a hole and put an above ground pool in it, hated it and I am now left with this. Any advice?",
    "text": "The hold has a20ft diameter and is roughly 2 feet deep\nSome friends suggested a fire pit which I like the idea of. I'm new to landscaping and would love to learn some things on this project. \nIs a fire pit possible or should I just buy dirt to fill it back up? ",
    "score": 12979,
    "url": "https://reddit.com/r/landscaping/comments/1mcsy2s/dug_a_hole_and_put_an_above_ground_pool_in_it/",
    "created_at": "2025-07-30T00:58:33.000Z",
    "num_comments": 6728
  },
  {
    "id": "reddit-1otkwl8",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "This is a new one on me.",
    "text": "Was asked to fix this patch on a patio. Thought it would be a tree root from a nearby tree.\n\nTurns out it was a 4 (v4) cylinder petrol engine. Weighed an absolute ton but I managed to drag it out of the hole.\n\nI'll admit it wasn't my best work but I wasn't paid for my best work on this one, but I got it done at the end of the day.\n\nEdit : Turns out I'm 99% sure it's a Ford Essex V4 from a Ford Zephyr from the 1960's which were quite popular in my country once upon a time.",
    "score": 9477,
    "url": "https://reddit.com/r/landscaping/comments/1otkwl8/this_is_a_new_one_on_me/",
    "created_at": "2025-11-10T18:00:18.000Z",
    "num_comments": 566
  },
  {
    "id": "reddit-1l5jd4v",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Mowed our weedy clover lawn into a maze for the kids (and local wildlife!)",
    "text": "Last spring, we planted a lot of clover seed in our yard. It's really taken over, but lots of hardy weeds like to grow up out of it, making yard management quite a chore. To solve this, I decided to mow a maze into the yard. Now, the weeds and clover grow freely on the \"walls\" and mowing the \"paths\" is much less work than mowing the whole yard. It's an insect paradise, and my kids love it!\n\nWe get many different visitors to our yard daily (depending on the season): crows, sparrows, green pheasants, bats, tree frogs, ladybugs, grasshoppers, crickets, dragonflies, praying mantises, butterflies, honeybees, and even a striped snake the other day. My kids have requested several new paths, and I think we're at capacity now. I live in Japan, so no busybody HOAs here.\n\nHonestly, it hasn't been all that much work. The hardest part was last year, getting anything other than tall, spiky weeds to grow. We started with an extremely rocky patch of dirt. I spent several days picking up large rocks and raking up small ones. Then my family and I spent a few fun hours throwing seeds into the air and raking them around. After that, I spent a few weeks watering every day until everything sprouted. But after that, it was a constant battle to keep the weeds down. We're out in the boonies, and the weeds are aggressive. It rained for a couple of weeks straight, and when the yard was finally dry enough to mow, the weeds were already waist-level. So this year, I had to find a way to make peace with them.\n\nMowing the maze shape only took a couple of hours. Since then, maintenance has been easy. I spend a couple of minutes every morning walking the maze to clean up any weeds and clover that have fallen over and blocked the paths. Then, once every week or two, I run the mower down the paths to tidy everything. It takes about 30 minutes. That's it!\n\nI could reduce my work even more by laying down sheeting onto the paths and putting mulch or gravel on top, but I'm thinking of doing a different maze next year, so it's easier to just keep it mowed short for now. Next year, I might put a bit more planning into it; I've been thinking it would be fun to make a circular labyrinth.\n\nI'm using a mixture of white clover (*Trifolium repens*) and red clover (*Trifolium pratense*). This isn't \"micro-clover.\" Many of the clover plants in my yard grow to about 5 or 10 cm and then stop, while others grow much taller. The tallest clover specimens (mostly red clover) are about 80 cm right now. Some of the other weeds are a bit higher. I just let them grow out for diversity.",
    "score": 6086,
    "url": "https://reddit.com/r/landscaping/comments/1l5jd4v/mowed_our_weedy_clover_lawn_into_a_maze_for_the/",
    "created_at": "2025-06-07T12:11:31.000Z",
    "num_comments": 87
  },
  {
    "id": "reddit-1ogeej6",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Discovered a brick pathway on my House.  (Appears to go to my back door and garden area)",
    "text": "After taking down an over grown tree, I discovered a brick pathway that was buried for years. Took me about 3 to 4 hours a day of work for about 5 days to fully uncover it. \n\nAny tips on to better restore it?  (Note: pictures are in order to show my progress as I uncovered it) note: house was built in July of 1923. Been slowly restoring/upgrading it.)\n\nThat pachysandra made it hard to remove and cut back, I wonder if I will discover, more in my back yard, last picture final result (I worked at this til it got dark outside)",
    "score": 5769,
    "url": "https://reddit.com/r/landscaping/comments/1ogeej6/discovered_a_brick_pathway_on_my_house_appears_to/",
    "created_at": "2025-10-26T07:25:27.000Z",
    "num_comments": 270
  },
  {
    "id": "reddit-1ojf7xq",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Update on the buried skid loader.",
    "text": "Unfortunately, the skid loader was deemed a total loss by the insurance company. The quote to repair it was $45,000, while it was valued at $40,500. Insurance has paid for the loss, but only covered the machine itself. My next step is talking to the person responsible and seeing if they will pay the $12,000 that we have racked up in expenses so far. That is lost wages, rentals for the last 2+ months, extraction cost and the cleaning and diagnostic expenses. If he doesn't want to come to an agreement on payment, then I will, unfortunately, have to involve my company lawyer and take him to court over it. Wish me luck!",
    "score": 5080,
    "url": "https://reddit.com/r/landscaping/comments/1ojf7xq/update_on_the_buried_skid_loader/",
    "created_at": "2025-10-29T20:11:44.000Z",
    "num_comments": 385
  },
  {
    "id": "reddit-1knhopy",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Before and after pruning my large Yew in the Japanese \"Niwaki\" style, starting in 2023. I actually don't believe how big of a transformation it's made in only two growing seasons.",
    "text": "I started in summer 2023 by cutting out all the interior growth, cutting back the tops of each, and trimming the low hanging vegetation. Photos here: [https://www.reddit.com/r/landscaping/comments/1b98rvs/pruned\\_my\\_large\\_yew\\_today\\_how\\_did\\_i\\_do/](https://www.reddit.com/r/landscaping/comments/1b98rvs/pruned_my_large_yew_today_how_did_i_do/) \n\nLast spring I used hedge clippers to further get it into the Niwaki style, which translates to garden tree in Japanese. This spring I hardly had to trim it at all! Mission: accomplished, I'd say. ",
    "score": 3958,
    "url": "https://reddit.com/r/landscaping/comments/1knhopy/before_and_after_pruning_my_large_yew_in_the/",
    "created_at": "2025-05-15T19:55:44.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1ld84bj",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Dad’s plants are filling in nicely.  He added some large cobble up top by the sidewalk without consulting me first. Besides for that, I love almost all of it.",
    "text": "Here are some updated photos of my dad’s house. We finished the planting in 2023, so this is about 2 years of growth since it first went in. \n\nI’m a landscape contractor and this one of those projects where I did a little here and a little there with extra time and materials I could scrounge together. \n\nYou can check my post history to get more of the back story on what it looked like before. \n\nStill need to add a railing to the stairs. 😂 \n\n",
    "score": 3744,
    "url": "https://reddit.com/r/landscaping/comments/1ld84bj/dads_plants_are_filling_in_nicely_he_added_some/",
    "created_at": "2025-06-16T23:28:52.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1mdqihv",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Maybe being taken advantage of? $12k invoice I can't pay",
    "text": "I’m a new homeowner and still learning the cost of work &amp; materials. I met a landscaper doing work for nearby homes last year and he did \\~$1200 of work but disappeared after September. He didn't resurface until March with the invoice, which I paid. Early Spring he did some cleanup and in June we agreed to do some weeding, pruning, removing dead brush, trimming, and laying new mulch.\n\nHe asked if I wanted to plant where the dead brush was removed and told me boxwoods would cost $40, he could also include some junipers too. I agreed, we didn't have a contract but had a verbal understanding of approximately what all the work would cost. He showed up with\n\n* 10 Junipers (12\"W x 12\"L)\n* 10 Boxwoods (3 gallon)\n* 2 Spiraeas\n* 4 Hydrangea\n* 2 (I think) Red lace-leaf Japanese maple (\\~30\" height)\n\nLet me start by admitting I’m naive, I do not know the cost of material and assumed everything was relatively cheap based on prior conversations we had. After the work was completed, I repeatedly asked him for receipts and an invoice. After two months of chasing him, he finally gave me the invoice, but no receipts in sight.\n\nAlmost every line on the invoice is marked up\n\n* Labor: Last year he charged me $55/hour per guy but this year he increased it to $60 without telling me. +$370\n* Yard-waste removal: Last year he charged me $100, but this year he charged \\~$300 each for the Spring cleanup and the June work? +$400\n* Mulch: Supposed to be $45/yard plus delivery (I think $100 but even if $130) $1030. +$100\n* Plants: $2550 total from $40 per boxwood. He didn't itemize the individual plants\n* Maples: $1300 each?! They are small, approximately 2 feet in height and I assume are 3 gallon\n\nI went to a nice Nursery &amp; Garden center (not home depot) to get prices for comparably sized plants\n\n* Spiraeas $40-$60ea\n* Junipers (larger &amp; nicer at nursery) $40ea\n* Boxwoods (3gal) $130ea\n* Hydrangea (larger &amp; nicer at nursery) $55ea\n* Red lace-leaf Japanese maple $600-$800ea and 3x larger than what he planted\n* $48/yd of mulch and free delivery for 20 yards\n\nI don't understand how he came up with the plant prices, especially for the maples. Regardless, my first thought was to first ask him to\n\n* Honor what he charged me for similar services last year (labor and yard-waste removal); shouldn't he have told me prices went up?\n* Honor the agreed on cost of mulch\n* Take back the boxwoods and maples, I'll keep the rest as a compromise (and because the relative cost isn't worth the hassle). I could also pay for the removal labor\n\nNot sure how realistic this is, or if he'll just laugh or curse me out. The reality is I never thought the price would climb this high and I simply don't have the money to pay him\n\n* Am I in the wrong? Really feels like he took advantage of my ignorance, I never asked him for most of what he brought\n* Is it reasonable for him to take back what he planted?\n* Should I consult a lawyer before speaking with him?\n\n\n\nNo idea what to do next...",
    "score": 3496,
    "url": "https://reddit.com/r/landscaping/comments/1mdqihv/maybe_being_taken_advantage_of_12k_invoice_i_cant/",
    "created_at": "2025-07-31T03:02:46.000Z",
    "num_comments": 2803
  },
  {
    "id": "reddit-1moqa7w",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Some big patches of grass were dying so my landscaper trimmed the entire lawn down, aerated  it, seeded it and covered it in top soil. Is this right?",
    "text": "So looking at the watering schedule he said it is looking fine but the grass was producing a lot of chaff and neeed aeration. \n\nSomething feels wrong to me. I don’t see how/when it will bounce back. I don’t know why healthy grass is covered in too soil? I don’t understand how there just won’t be dirt in the grass now. Can someone give me some insight or tell me if he screwed up my lawn?",
    "score": 3332,
    "url": "https://reddit.com/r/landscaping/comments/1moqa7w/some_big_patches_of_grass_were_dying_so_my/",
    "created_at": "2025-08-13T00:45:54.000Z",
    "num_comments": 667
  },
  {
    "id": "reddit-1mjpm14",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Backyard retaining wall project - my first big DIY project",
    "text": "\nThis summer I tackled my first major outdoor project: building a 35 foot-long retaining wall to help level out our sloped backyard, manage drainage, and make the space more usable (and better looking). I wanted to share photos and a breakdown of how it all came together\n\n⸻\n\nMaterials and Why I Chose Them\n\t•\tWall Bricks: I used engineered concrete retaining wall blocks. They’re heavy (which helps with stability), interlock well, and were locally available at a decent price.\n\t•\tBackfill: A mix of clean rock and compactable fill dirt to ensure proper drainage and structural support.\n\t•\tLighting: I added six low-voltage cap lights to the top layer for both function and aesthetics. These are wired into a weatherproof transformer with a dusk-to-dawn timer.\n\t•\tTools/Equipment: I rented a skid steer for excavation and hauling, and bought a few new tools I didn’t already own (angle grinder, reciprocating saw, etc.)\n\n⸻\n\nStep-by-Step Build Process\n\t1.\tPlanning + Layout: Measured and marked out the wall line, accounting for slope and height transitions.\n\t2.\tExcavation: Rented a skid steer to dig the wall back and wide enough for the base layer and to move the backfill  materials around. The dug the trench with shovel and pickaxe \n\t3.\tBase Prep: Filled the trench with compacted gravel, checked level obsessively, and laid the first course of bricks. Everything above that relies on this being right.\n\t4.\tStacking the Wall: Layered the wall blocks while backfilling and compacting as I went.\n\t5.\tDrainage: Installed a French drain behind the wall with perforated pipe and clean rock, my big miss here was not installing drain fabric. \n\t6.\tLighting: Drilled conduit holes and ran low-voltage wiring before placing the final row. Connected everything to a transformer near the house. \n\t7.\tFinish Work: Cleaned up, shaped the soil above the wall, and started planting creeping blue star thyme for ground cover.\n\n⸻\n\nBudget\n\t•\tSkid steer rental + delivery: $750\n\t•\tWall blocks: $3,500\n\t•\tBackfill materials: ~$1,000\n\t•\tLighting system (lights, transformer, wiring): $350\n\t•\tTools + Equipment (new purchases only): $450\n\t•\tTotal so far: ~$6050\n\nTimeframe\n\nThe full project took about 3–4 weekends, with evenings during the week for planning, lighting work, and detail cleanup. It’s still a work in progress at this point but happy with the outcome!\n\nYes, I used ChatGPT to help me with this write up. I also used ChatGPT as my project foreman to help along that way! ",
    "score": 3238,
    "url": "https://reddit.com/r/landscaping/comments/1mjpm14/backyard_retaining_wall_project_my_first_big_diy/",
    "created_at": "2025-08-07T03:37:45.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1m21ali",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Why is every landscaper saying they can’t or won’t grind this yew tree stump?",
    "text": "I cut this yew tree down in the spring and have been trying to find someone to grind the stump since. \n\nI thought about renting a 5hp or 15 hp grinder and doing it myself but wanted to check with some local guys first to see if the price was right. \n\nThree companies have said they can’t or won’t. Reasons are:\n- small grinder won’t get it done and the big grinder won’t fit through my 80cm/30in fence gate.\n- Would need to use a chainsaw to slice it up into chunks instead and it wouldn’t be worth it to even make an offer\n\nThese were all real, licensed landscaping companies, so I’m lost.\n\nThe facts:\n- stump diameter = 50cm/20in\n- Townhome with gate through tall bushes. Can’t widen gate without removing huge bushes \n- after stump is removed I just want to put down gravel and a fire steel fire pit",
    "score": 3184,
    "url": "https://reddit.com/r/landscaping/comments/1m21ali/why_is_every_landscaper_saying_they_cant_or_wont/",
    "created_at": "2025-07-17T07:35:21.000Z",
    "num_comments": 1865
  },
  {
    "id": "reddit-1orejv2",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Budget retaining wall",
    "text": "My wife and I want more gardens, so I tiered the little hill in our front yard. It’s my second retaining wall and I’m hoping to do more, so I’m happy to receive feedback. Also, let me know if you have general advice on getting cheap materials. I love a deal, me.\n\n$200 Blocks and delivery (discount at Home Depot a couple years ago - I was planning ahead)\n$240 cap blocks\n$80 non-woven landscaping fabric \n$62 adhesive (x10)\n$100 class 5 gravel ~2 tons (trips - 7)\n$100 3/4” limestone gravel ~2 tons (trips - 6)\n$40 tamper\n$20 sand\n= $842 + so many late nights after the kids’ bedtime",
    "score": 2397,
    "url": "https://reddit.com/r/landscaping/comments/1orejv2/budget_retaining_wall/",
    "created_at": "2025-11-08T03:08:13.000Z",
    "num_comments": 133
  },
  {
    "id": "reddit-1ob6gbb",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Natural Stone Walkway",
    "text": "We bought our house this past winter and I just recently started digging up the front landscaping beds to prep for installing new plants and mulch. To my surprise, there was a ton of stone buried underneath about 4-5 inches of dirt, soil, and landscape fabric. I was cussing the prior owners at first because it made digging everything up 10x harder but once I was finished I knew that I could do something cool with all of the stone. \n\nI decided to make myself a walkway leading to my woodshop. I dug down about 6” by hand, installed geotextile and compacted 57’s. I used #8 limestone as my setting bed. I tried to use as many of the natural shape of the stones as I could but did have to make some cuts here and there in order to make the joint lines relatively uniform. My daughter joined in the fun and helped me mark a couple of the cuts. She found one that looked like a heart so we decided to put it right in the middle of the walkway. \n\nI love how it turned out. I’m still debating on whether to use a permeable polymeric sand or some type of pea gravel for the joints. If I do go with the sand, I will likely use Gator Nitro in the color black. It’s made for joints 1/8”-2” and allows water to penetrate. Also think the black would really make the natural color of the stone pop. ",
    "score": 2162,
    "url": "https://reddit.com/r/landscaping/comments/1ob6gbb/natural_stone_walkway/",
    "created_at": "2025-10-20T00:59:11.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1k51z3q",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "My Grandfather's 30+ year old land he's never touched",
    "text": "Hello everyone, first time visiting this sub because I am not of some serious professional Reddit advice.\n\nI'm 23 years old and I had no idea this property existed until I recently moved to the state where the property is at. I was finally able to check out the property myself in person (had to use a map to find it which was pretty fun) and these were the pics I took, I would've taken more/better pics but there a decent amount of thorns and I was only wearing gym shorts 🤧\n\nNow for the part where you all come in, I want to clear out this land myself (I got permission from the big man), don't want to hire no help, I may have a cousin or one of my brothers help occasionally but realistically I would be doing at least 80% of the work. I currently own 0 tools and I am fully aware and accept this may take multiple years to complete this way, and that's the fun part. I've done some free landscaping for friends and family for free and I've always liked it, every moment in nature is always so peaceful for me, and the satisfaction of completing this goal will be pure bliss for me. Please recommend your favorite axe's, landscaping tools, tips, anything that may help! + If you see something that can definitely be done by hand but easier with machine, give me the done by hand recommendation first please.\n\nTLDR: Gimme the best landscaping tips and advice you got so I can clear all this out one day!",
    "score": 2159,
    "url": "https://reddit.com/r/landscaping/comments/1k51z3q/my_grandfathers_30_year_old_land_hes_never_touched/",
    "created_at": "2025-04-22T09:18:50.000Z",
    "num_comments": 248
  },
  {
    "id": "reddit-1kkfubx",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "How do I make this fire pit usable?",
    "text": "As someone who is not a landscape/fire pit/fire safety/anything outdoors expert, what supplies and steps do I need to take to avoid setting my yard/neighborhood on fire? I don’t need it to be fancy, just something I can safely roast a couple s’mores and weenies over.\n\nEstimated costs would be super helpful so I don’t start a project that I can’t finish on a public school teacher salary lol",
    "score": 12,
    "url": "https://reddit.com/r/landscaping/comments/1kkfubx/how_do_i_make_this_fire_pit_usable/",
    "created_at": "2025-05-12T00:44:35.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1kliug0",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Landscapers- When did you hire an admin?",
    "text": "Hey everybody, I’m a landscape manager at a large nursery. My department does about 400-500k annually in revenue (including COGS) and I’m drowning in paperwork right now. I just got the job a year ago after running my own business for about a year. The breakdown of revenue is about 75% design and installation work, and 25% maintenance work. \n\nI have two full time guys and two part time. I used to set aside 2 days per week to do admin stuff but lately we have been so behind on jobs that I’m working in the field 5 days a week and then doing admin stuff on the weekends. It’s destroying my mental health and affecting my personal life. The thing is I’m salaried so no overtime but I do get a profit sharing bonus every month, but because I am struggling to be organized the margins have gone down. \n\nI just hired someone to schedule appointments and do customer service full time, but\nit seems way too soon since the landscaping department was started by me just under a year ago (before that a contractor did all the landscaping and even then he only did about 60k annually). However, I’m taking weeks to get back to customers because the demand is so high. Should I hire more help or just raise prices?\n\nSo more experienced landscapers, when did you hire your first admin person? How did you find them and how do you keep them motivated? I have only ever lead guys in the field honestly and I’m kind of at a loss for how to even train this girl I just hired. Any tips and advice on how to keep jobs organized would also be greatly appreciated. ",
    "score": 8,
    "url": "https://reddit.com/r/landscaping/comments/1kliug0/landscapers_when_did_you_hire_an_admin/",
    "created_at": "2025-05-13T10:50:09.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1oowy1u",
    "subreddit": "landscaping",
    "soc_codes": [
      "37-3011",
      "37-1012"
    ],
    "title": "Can I explore Landscaping with Learning difficulties ???",
    "text": "Hey legends,  im 28M from Austrlia 🇦🇺 im reaching out today because I'd love to potentially explore the road of Landscaping. Now, I currently work as a Gardener/ Grounds&amp;Maintenance Worker. I can use a ride on mowers, and all the garden machinery/tools. I do Basic weeding but struggle to remember other various plant names. I have some processing difficulties, takes me a few more goes than the average joe to absorb information and get it locked in, if someone's patient enough at first, im all sweet. Im very hands on, love to be outside. Is Landscaping doable with my hiccups? something you lads reckon I'd be able to do??\nAny tips / info / suggestions for me looking to persue this career? Cheers 🫶",
    "score": 6,
    "url": "https://reddit.com/r/landscaping/comments/1oowy1u/can_i_explore_landscaping_with_learning/",
    "created_at": "2025-11-05T07:52:57.000Z",
    "num_comments": 14
  }
]