[
  {
    "id": "reddit-1l2cglr",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Construction equipment left on my property—what do I do?",
    "text": "There’s been construction equipment on my property for months now—looks like a small company, maybe working on fiber lines. They’ve damaged part of the property and I haven’t been able to get in touch with them. It’s definitely not a city crew.\n\nI’m not looking to escalate things legally if I can avoid it, but they’ve basically just dumped their stuff and vanished. Is this something for code enforcement? Police? Is there any chance I can get this resolved without a huge headache?\n\nWould appreciate any advice from folks who’ve dealt with something like this.",
    "score": 17767,
    "url": "https://reddit.com/r/Construction/comments/1l2cglr/construction_equipment_left_on_my_propertywhat_do/",
    "created_at": "2025-06-03T13:52:03.000Z",
    "num_comments": 3930
  },
  {
    "id": "reddit-1hufxs5",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "How did old school ironworkers use the bathroom when they were like 70 stories up, did they just whizz off the side of the building and figure nobody see what they were doing because they were so high up?",
    "text": "",
    "score": 12017,
    "url": "https://reddit.com/r/Construction/comments/1hufxs5/how_did_old_school_ironworkers_use_the_bathroom/",
    "created_at": "2025-01-05T20:09:13.000Z",
    "num_comments": 1124
  },
  {
    "id": "reddit-1lr3u0f",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Electricians what's the point of this?",
    "text": "What's the point of running the wire like this back and forth from side to side of a joist bay.   Is there some sort of benefit to it? \n\nJust saw it on this job im working and curiosity got the best of me like always. ",
    "score": 8531,
    "url": "https://reddit.com/r/Construction/comments/1lr3u0f/electricians_whats_the_point_of_this/",
    "created_at": "2025-07-03T23:17:04.000Z",
    "num_comments": 1114
  },
  {
    "id": "reddit-1lbf376",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Coworker seen it and said, “not professional.” So mission accomplished.",
    "text": "I've heard this saying years ago and just got my wife to make a hard hat sticker of it. ",
    "score": 7487,
    "url": "https://reddit.com/r/Construction/comments/1lbf376/coworker_seen_it_and_said_not_professional_so/",
    "created_at": "2025-06-14T18:09:21.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1j73e5d",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Work Safe. Do it for David.",
    "text": "I post this here every year, and I hope that it impacts at least one person to work safer this week. So, bear with me. \n\nEight years ago today, on a drizzly afternoon, my friend David made a mistake.  The mistake he made was doing something that he knew wasn't safe because it would only take a minute.\n\nDavid and his crew were working on rolling out some geotextile fabric at the bottom of a trench when the roll needed to be cut and removed from the bottom of the trench.  \n\nIt was 4:30, the crew was ready to go home, and it was going to take just a second, so David climbed down into the bottom of the ditch to make a three-foot cut on a piece of fabric.  He turned to the side and tossed the roll upwards.\n\nThe wall of heavy clay soil collapsed burying David up to his neck instantly as his coworkers looked on in horror.  In less than a minute, my friend David Williams was dead.  His coworkers attempted rescue, but the clay soil was saturated, the amount of dirt to be moved was so great, that rescue was impossible.\n\nEvery year on this day I think of my friend David.  And every time I think about taking a shortcut, or doing something unsafe because it will \"just take a minute\" I think of my friend.\n\nWork safe today and every day.  Do it for David.  Do it for yourself.  There is nothing on any job-site that is worth getting hurt on.\n\nHe left behind a wife and six children. And that certainly isn't worth some damn geo fabric.",
    "score": 6585,
    "url": "https://reddit.com/r/Construction/comments/1j73e5d/work_safe_do_it_for_david/",
    "created_at": "2025-03-09T08:38:46.000Z",
    "num_comments": 126
  },
  {
    "id": "reddit-1okz9ge",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Apprentice being tested this week",
    "text": "It's been posted a few times before about having reminders of why you're doing this. I LOVE my job (rare occurrence), I'm almost turned out as a journeyman, and this supports my family very well compared to jobs before. This week I've been tested by somebody who's well known for not being well-liked. Instead of jeapordize my and my family's futures I turned to posts I've seen here before and I just wanted to thank you all for being my spiritual journeymen and journeywomen. ",
    "score": 6506,
    "url": "https://reddit.com/r/Construction/comments/1okz9ge/apprentice_being_tested_this_week/",
    "created_at": "2025-10-31T16:29:43.000Z",
    "num_comments": 139
  },
  {
    "id": "reddit-1kyv3lb",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Quitting alcohol saved my body  and extended my construction career",
    "text": "I’ve been in construction most of my life. Long days, hard work, wear and tear on the body and like a lot of folks in this line of work, I used to drink to take the edge off. For years, alcohol was just part of the routine: end of the day, crack open a beer or 6.  Truth is, drinking is glamorized in our culture especially in the trades. You're tired, you're stressed, you're sore — and you're made to feel like a drink is the reward. But over time, it stopped helping and started hurting.\n\nMy body was breaking down. I had neuropathy in my feet. I was 45 pounds overweight, sluggish, short-tempered, and uninspired.\n\nMy low point? I sat down on a client’s couch after lunch  just to rest for a minute — and fell asleep from pure exhaustion. When I woke up, it was pitch dark, cold, and two cats were asleep on my chest. It was 8 p.m .The anxiety that hit me in that moment was crushing. Thankfully these clients were out of town.\n\nFive years, five months, and 29 days ago, I quit drinking. That decision saved me from alot of physical and emotional pain.\n\nNow, the neuropathy is gone. The weight is gone. I’ve got energy for days. I saved my marriage. Got both my kids through college. I’m still out here building, sharper and stronger than I’ve been in years.\n\nSobriety didn’t just extend my construction career — it saved it. And it gave me back everything I was losing.\n\nI’m not here to lecture anyone. I just want to say this: if you’re thinking about quitting, or wondering if it’s even possible — it is. And it’s worth it. You don’t have to hit rock bottom to make a change. You just need to be ready. ",
    "score": 969,
    "url": "https://reddit.com/r/Construction/comments/1kyv3lb/quitting_alcohol_saved_my_body_and_extended_my/",
    "created_at": "2025-05-30T04:13:06.000Z",
    "num_comments": 171
  },
  {
    "id": "reddit-1mu8fvb",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Hammer vs hand",
    "text": "No surprise i lost lol. Open fracture 10 years into my career and I’ve pretty much avoided most serious injuries outside of a broken rib that happened in a freak accident and some stitches here n there. But let me tell you what, hitting the top of your hand full force with a hammer - I don’t recommend it. Stay safe boys",
    "score": 376,
    "url": "https://reddit.com/r/Construction/comments/1mu8fvb/hammer_vs_hand/",
    "created_at": "2025-08-19T04:17:43.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1lmwr5u",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Found some quality labor recently, not easy to do.",
    "text": "Salary request was a bit steep. But for goldfish crackers, applesauce packets and chocolate-dipped protein bars, I'm not complaining. Osha certainly won't approve of the Crocs, I'll have to get the kid some nice boots.",
    "score": 351,
    "url": "https://reddit.com/r/Construction/comments/1lmwr5u/found_some_quality_labor_recently_not_easy_to_do/",
    "created_at": "2025-06-28T20:37:56.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1k6bo9y",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Company wants 25-30% overhead and profit on jobs? How do I explain to them this is not realistic for construction",
    "text": "I worked with the big boys and usually we aim for 8-10% overhead and profit. I moved to a smaller shop and these are the metrics I am getting graded on.\n\nI already see the writing on the wall and am not comfortable staying here long term.\n\nedit: people think this is a niche sub. no, it's a GC bidding on commercial/public works. Good luck getting anywhere near 25% on public works. I already lined up an interview with Kiewitt. Kiewitt is usually a 2-3 round interview process so I have to just keep my head low for now and collect a paycheck. \n\n\n\nHonestly I don't like abandoning ship, since the salary is good, but it seems to be the way in this situation. They like my performance, and I might have stayed even with these crazy metrics, but too many cracks in the foundation for me to feel safe about their cash flow. Also I found I just miss the stability working for the big boys these past few months.",
    "score": 339,
    "url": "https://reddit.com/r/Construction/comments/1k6bo9y/company_wants_2530_overhead_and_profit_on_jobs/",
    "created_at": "2025-04-23T21:58:59.000Z",
    "num_comments": 232
  },
  {
    "id": "reddit-1j7d7cv",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Those Who Make 200k+ A Year. How?",
    "text": "How did you start your career? What was the job progression like? Any regrets?\n\n( I finish my construction management program this July! )",
    "score": 241,
    "url": "https://reddit.com/r/Construction/comments/1j7d7cv/those_who_make_200k_a_year_how/",
    "created_at": "2025-03-09T17:51:35.000Z",
    "num_comments": 324
  },
  {
    "id": "reddit-1pclfs1",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "The grass may be greener, but it’s turf",
    "text": "Tl;dr - I left construction after 10 years two months ago to try a different career. Completely regret it, and I’m coming back with a new mindset. \n\nI left construction for a few reasons, and as not to bore you guys, here’s the main few. \n\n1. The company I was with was exhausting me and not going in the direction I wanted\n2. Never really knew what other careers were like and wanted to see if I would like it. \n\nNow this sales job on paper is a dream. Really good money, low impact on body and not difficult to learn. \n\nAfter two months in a sales job I learned a few things. I learned that construction is really hard. Not just on your body but also on your mind and character, and is severely underpaid for what we’re doing. \n\nBut here is the catch. After 10 years in the trades, there is nothing that compares to the beauty of walking away from a project you completed, the pride in coming home dirty, and the feeling of being a productive human. In sales there is nothing reward other than a check. If money is your goal I’d recommend it. If feeling content with life and being a badass is more your thing, blue collar all day. \n\nIf anyone is thinking about leaving the trades, I wouldn’t say don’t do it, but really evaluate your goals and wants. Most likely there is a compromise somewhere. \nAnyway I gotta put in some resumes and charge my batteries lol. I’ll see you guys in the field \n",
    "score": 209,
    "url": "https://reddit.com/r/Construction/comments/1pclfs1/the_grass_may_be_greener_but_its_turf/",
    "created_at": "2025-12-02T21:40:56.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1mnikc2",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "What trade makes the most money?",
    "text": "Been looking at the BLS data for construction jobs and it's interesting to see how the pay scales across different trades. Not sure what I was expecting, but I didn't have elevator installers/repairers at the top by that wide a margin.\n\nHere's what the latest data shows for median annual salaries for construction and extraction occupations (2024 data). Curious to see what everyone thinks of these ranges:\n\nElevator installers and repairers: $106,580 \n\nBoilermakers: $73,340 \n\nConstruction/building inspectors: $72,120 \n\nPlumbers, pipefitters, steamfitters: $62,970 \n\nElectricians: $62,350\n\nIronworkers: $61,940 \n\nSheet metal workers: $60,850 \n\nCarpenters: $59,310 \n\nDrywall installers, ceiling tile installers and tapers: $58,800 \n\nConstruction equipment operators: $58,320 \n\nMasonry workers: $56,600\n\nThe job growth projections are all over the place for the next 8 years. Electricians are looking at 11% growth and construction equipment operators at 4% (at or above average), while some trades like boilermakers are projected to decline by about 1%.\n\nThere seem to be tradeoffs with each. Elevator work pays almost double some other trades but requires working in confined spaces. Boilermaker pays well but jobs are declining. Building inspection requires years of experience first. \n\nThe bottom four on the list all cluster around $58k, with carpenters and masonry workers even showing slight declines in job opportunities.\n\nElectricians seem to offer a solid balance of good pay (\\~$60K) with strong job prospects (84,300 new jobs from 2023-33). Plumbing (26,300) and carpentry (also has a good number of openings (38,600) also project a high number of openings over that time. \n\nA big caveat to all of this is how are tariffs/recession/government policies going to impact the validity of these projections. Including data collection itself, apparently.\n\n\\*Edit: For reference, [this is where the data](https://www.nextinsurance.com/blog/highest-paying-construction-jobs/) is from. Looks like the BLS last updated it in mid-April.",
    "score": 154,
    "url": "https://reddit.com/r/Construction/comments/1mnikc2/what_trade_makes_the_most_money/",
    "created_at": "2025-08-11T17:00:06.000Z",
    "num_comments": 171
  },
  {
    "id": "reddit-1isonon",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Any of you still think about a job you did way back earlier in your career when you knew crap and realized later you did it wrong - did anyone notice? Did you ever say anything?",
    "text": "On",
    "score": 151,
    "url": "https://reddit.com/r/Construction/comments/1isonon/any_of_you_still_think_about_a_job_you_did_way/",
    "created_at": "2025-02-18T21:44:21.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1j6zoak",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "My dad runs a rebar installing company but recently cant find work, he only speaks spanish and i want to help.",
    "text": "Sorry for my lack of knowledge in this field, Im a 19 year old man, pursuing a degree in IT with a business minor, my dad came from poverty in Honduras and found success in running a rebar installation company here for the past 20+ years.\n\nrecently there has been a lack of work for him and his workers, he usually gets work from the same contractors or the same contractors recommend him to other people, its been like this for his whole career, he hasn’t been able to find work outside of this circle due to his lack of english, he vented to me about this and knowing english and having experience in running a business myself i would like to help him find work. \n\nThe problem is, i don’t know where to start, how to reach people in this field, who to reach and how to get our name out there, any help would be greatly appreciated.\n\nwe are located in south florida, i can assure you he can do a damn good job.\n",
    "score": 132,
    "url": "https://reddit.com/r/Construction/comments/1j6zoak/my_dad_runs_a_rebar_installing_company_but/",
    "created_at": "2025-03-09T04:29:56.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1pcfkfl",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Turner offer",
    "text": "I hope you’re doing well. I recently accepted an offer with Turner for $78K plus a $3K sign-on bonus, and I had a quick question about compensation. My offer letter mentions overtime pay after 40 hours, but the exact rate won’t be provided until I start. For anyone currently with Turner (or familiar with their structure), could you share what overtime typically looks like for entry-level engineers?\n\nAlso, I wanted to ask about raises. Is there a standard annual increase (like a base 3% merit raise), or is everything strictly performance-based? And for those who’ve been in the role a few years, how long did it take you to move from the high-70s salary range into the $100K range?\n\nAny insight would be appreciated. Thank you in advance.",
    "score": 127,
    "url": "https://reddit.com/r/Construction/comments/1pcfkfl/turner_offer/",
    "created_at": "2025-12-02T18:03:30.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1p48hit",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "“lEaRn A tRaDe”",
    "text": "Can we quit pushing this narrative to, “lEaRn A tRaDe” to individuals searching for careers?  Social media glorifies the trades, and paints this picture that anybody with arms and legs can land a job in it. Yes, the trades are a great way to find steady employment… IF you can actually land a job in the trades. \n\nThe fact of the matter is that in recent years, this narrative has been shoved down Gen Z’s throats to the point where the trades are now oversaturated AF. If you don’t believe me, search for apprentice positions on LinkedIn. Jobs that were posted in less that 24 hours will have 100+ applicants! There may be a shortage of “skilled” tradesmen, but there is absolutely no shortage of tradesmen at all. \n\nGone are the days of landing a trade job green as grass.  You only have three ways to break into the industry: Having previous years of experience, nepotism/knowing someone, or sheer luck. Good luck to all the young’uns out there, the job market is cooked.",
    "score": 119,
    "url": "https://reddit.com/r/Construction/comments/1p48hit/learn_a_trade/",
    "created_at": "2025-11-23T00:15:58.000Z",
    "num_comments": 519
  },
  {
    "id": "reddit-1oy8m08",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "It's not that great",
    "text": "I’m really tired of hearing about how great all the blue-collar and trade jobs are. So here’s my personal experience.\n\nBefore I get into it, I want to shut down the idea that this is about “what you go to college for.” I have two sisters — one graduated with a finance degree and the other majored in theater. They both still have student loans. So this isn’t about college vs no college.\n\nMy career started when I was around 10 or 11 years old. My father was a major property manager in the area for multi-family housing — somewhere around 130 different properties. By the time I was 16, I could remodel a kitchen, re-plumb a bathroom, patch a roof, and add structural support to two floors.\n\nAnd I hated working. I really did. But as I got older and moved up in the industry, I started noticing something: you can always tell the difference between people who worked with their parents to build work ethic and respect for the job, and the ones who didn’t — whether anyone admits it or not.\n\nWhich brings me to what I call my “hiatus” from construction and my first encounter with the industry’s real mentality. I tried to get into trade jobs before I turned 18. Every single one turned me down. The fact that the environment is considered too harsh for someone under 18 should tell you everything you need to know about what this industry is really like.\n\nBut I’m stubborn and I never took no for an answer. Which brings me to another point: if you ever meet someone whose parent owns a company, ask how many other companies they worked for in that same trade. It’s the fastest way to tell whether their parents let them work elsewhere to learn — or whether their parents needed them to show up every day.\n\nSo on my 18th birthday — the literal day I turned 18 — I stopped by a dozen different auto garages because in my mind, fixing cars had to be better than building and maintaining multi-family housing.\n\nFive years later, I earned my ASE Master Certification and two I-CAR Platinum Certifications.\nAnd I found out it was just as f****** bad.\n\nSo I got into ironwork. Got out of multi-family. Started commercial. It was better for a while. During my five years as an automotive tech, I bought a house, got into a long-term relationship with the woman who became my wife, and finally felt stable.\n\nIronwork treated me better financially. I started saving, buying individual stocks — nothing “crypto” or hype, I’m talking 3M and companies like that. Bought land I hoped to retire on. Worked my way up until eventually I became a superintendent. And I’ll say it straight: my early experience working for my dad paid off. It really did.\n\nNow that you know the background, here’s the point:\n\nAll of these industries are terrible — not just for your mental health, but for your physical health. You’d think working in a “critical” field would protect you. It won’t.\n\nI worked for my most recent company for two years. Accomplished a lot. Managed the largest job in their department. Saved them over a quarter million dollars by catching measurement errors and RFI issues. Nothing dramatic — just paying attention and doing my job well.\n\nThen July came. My wife passed away. It was the worst thing that has ever happened to me.\n\nI fell behind at work — of course I did. And within a week I had a write-up from my manager and HR… and then I was fired.\n\nIn one week, I went from being valuable to disposable.\n\nIt made me rethink every job I’ve ever worked and what my entire life has amounted to. The realization that I could be written off in a single week of poor performance hit me harder than anything.\n\nIt’s been almost three months now. My savings are gone. The medical debt I put on credit cards is drowning me. Mortgage, power, water — all catching up. The city fined me for not keeping my grass cut. I’m exhausted. I’m tired of looking for a job and tired of working jobs.\n\nThese careers have taken so much out of me that now, when I finally have free time, I don’t even know what to do with myself. I don’t know what makes me happy anymore.\n\nSo here’s my advice:\nGo to school. Even if your job is boring and miserable and you have debt, at least you won’t wake up every morning feeling thunderstorms in your bones and joints. At least you won’t feel the season change in your muscles. At least your body won’t be used up as currency.\n\nYou’re not choosing safety or higher pay by going into the trades. I bought my house long before the crazy interest rates and insane prices today — and I’m still about to lose it.\n\nI thought being in a “high-demand job with fair pay” would protect me. It didn’t.\n\nAnd I’ve learned something from watching people in trades and from watching my sisters:\nA lot of people in leadership worked because their parents wanted them to — not because they had to.\n\nIf you’re someone who has to work to survive, if you have to get up every day and pick a job to feed yourself and your family, then I’ll tell you the truth:\n\nYou can rebuild a résumé. You can’t rebuild a spine.",
    "score": 104,
    "url": "https://reddit.com/r/Construction/comments/1oy8m08/its_not_that_great/",
    "created_at": "2025-11-16T01:18:02.000Z",
    "num_comments": 73
  },
  {
    "id": "reddit-1j0kygr",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Just a thought, is it time to move away from stick built homes for production builders?",
    "text": "After a little over a decade in the masonry industry, I’ve done my fair share of work for developers who pump out hundreds of residential homes per year. These typically cost the homebuyers $500k or more to get into. Quality is dismal to put it nicely. Between cheap labor and materials, poor planning and questionable design choices, I can’t help but feel like the people buying these are getting duped. Combine that with the average home cost being almost 6x the average salary, this doesn’t seem like a sustainable market. \nNow bring in offsite manufactured housing. This doesn’t necessarily have to be your typical double wide trailer park, but fully customizable, solid built structures. Offsite building eliminates the inefficiency of subcontracted labor, shipping costs, wasted materials and scheduling kerfuffles. Quality control would is more manageable and people wouldn’t be buying shit homes for $500k+. I don’t understand why production developers who are pumping out 300+ new builds per year haven’t gone this route. Throw up a development with this mindset and you’d have quality homes that would be more accessible to the general public. ",
    "score": 96,
    "url": "https://reddit.com/r/Construction/comments/1j0kygr/just_a_thought_is_it_time_to_move_away_from_stick/",
    "created_at": "2025-02-28T23:03:13.000Z",
    "num_comments": 111
  },
  {
    "id": "reddit-1oh2fxu",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Is construction the most under appreciated career?",
    "text": "We all know, despite some trends in kids entering into the trades, nobody would rather be a carpenter then sit at a remote job on a beach for a career..\n\nThe reason why the trades are receiving an uptick is because the white collar jobs are at a downtick.\n\nI've seen every angle of the industry, laborer, carpenter, architect, PM, super, property management, owners rep and developer.\n\nThe money you can make as a plumber, electrician is amazing, yet the cost is often early mornings, a tiring lifestyle, oppose to late mornings and a more 'sedentary' lifestyle.\n\nThe benefits in the industry can often be brutal. Boomer-esque mentality in many companies.\n\nThere are parts of the industry that I love, yet I also know...it's not easy to make a good living at this career. \n\nWhat are your thoughts?",
    "score": 95,
    "url": "https://reddit.com/r/Construction/comments/1oh2fxu/is_construction_the_most_under_appreciated_career/",
    "created_at": "2025-10-27T01:58:53.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1jlcxg4",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "I see your bodies are tired posts.. I see youre getting older and cant do it anymore posts.. to anyone that feels that way and has knowledge and can do maths - try to get in truss design.. its a serious career you cant go to school for and is needed at a lot of places",
    "text": "",
    "score": 84,
    "url": "https://reddit.com/r/Construction/comments/1jlcxg4/i_see_your_bodies_are_tired_posts_i_see_youre/",
    "created_at": "2025-03-27T20:35:03.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1k4pcza",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "How do you take over or “buy” your boss’s business when they retire?",
    "text": "What pathways are there to “take over” or “buy” your employers company in the years leading up to their retirement? \n\nFor context, I’ve been working for a small residential remodeling/renovation company for the last 4 years. The owner (55 yo) has been in business for 12 years and started from scratch as a handyman. We do everything from windows/doors, to decks, to kitchen and baths, but these days half of our business is full remodels and additions. He’s got a great network of wealthy, long term customers and referrals. \n\nI (37yo) am responsible for 98% of the physical carpentry, detail design, and site management of the projects with the help of 1 apprentice. The owner handles all sales, contracts, architects, material ordering, and scheduling of subs. He pays me an above market wage, gives me total freedom over my time, and has been a great mentor. I love my job and the work we do together and I’m confident that in 10 years, we’ll have built a small but highly reputable company. \n\nBut in 10-15ish years from now, he’ll retire and it will the dead-end of my job. I’m trying to get a plan in place for me to continue my career with this business I’ve help to build after his retirement. \n\nI’d like to pitch a long term plan to him that ends with me helping him to continue to grow the business, and eventually take over ownership when he retires. I just have no idea how that would financially or legally work. \n\nIs there a common procedure for this scenario? Do I invest in the business slowly over time? Do I split ownership with him in his retirement? I really don’t have a clue. \n\nAny info, advice or places to start researching would be appreciated!",
    "score": 82,
    "url": "https://reddit.com/r/Construction/comments/1k4pcza/how_do_you_take_over_or_buy_your_bosss_business/",
    "created_at": "2025-04-21T21:35:01.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1keg1bu",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Per BLS statistics, construction managers earn higher salaries than civil engineers. Why do you think that is?",
    "text": "I’m a civil engineer who works in heavy construction. \n\nIn college, engineering was considered a more challenging major than CM. \n\nBut, my construction manager friend makes more than me. He also majored in CE, but pivoted to CM early in his career. I recently showed him a construction manager job announcement from a notable company that offered $130-$160k. He just nodded and said “and you’ll earn every penny.” Maybe the pay is higher because the job is more stressful and demanding? \n\nPlease share your thoughts. ",
    "score": 61,
    "url": "https://reddit.com/r/Construction/comments/1keg1bu/per_bls_statistics_construction_managers_earn/",
    "created_at": "2025-05-04T09:42:38.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1o0tk6l",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Hey everyone I just want to hear everyone's opinion",
    "text": "It’s crazy how backwards the world can be sometimes. Yes—trending careers that require degrees deserve competitive pay, but let’s be real… the hard-working blue-collar jobs are the ones that keep everything running. These are the people building, fixing, and maintaining the world we all rely on daily. Without them, nothing functions. Yet their pay rarely reflects how essential they are. These jobs shouldn’t just be “fairly” paid—they should be top tier, starting at $40+ an hour. It’s time society values real work the way it deserves. 💯👷‍♂️🔧🏗️ \nI'm a heavy equipment operator moving up the ladder just wanna know everyone's inputs because I think we're not paid enough.\n\n\nWHAT DO YOU THINK STARTING PAY SHOULD BE FOR ALL BLUE COLLAR WORKERS? WHAT SHOULD AVERAGE PAY BE? YOU CAN INCLUDE HOURLY OR SALARY\n",
    "score": 59,
    "url": "https://reddit.com/r/Construction/comments/1o0tk6l/hey_everyone_i_just_want_to_hear_everyones_opinion/",
    "created_at": "2025-10-07T22:35:46.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1mn8pf9",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Gambling, drug use, laziness in the industry - an old man's moaning or an epidemic? (UK)",
    "text": "**Background:** My old man has been a general site labourer for 30+ years (laying block, screeding, etc.) in Scotland.\n\nGiven his experience and the nature of the industry, he ends up on lots of sites leading squads of usually younger guys in the mid-20s and 30s.\n\nHe's adamant that drug use and gambling amongst the youth have become hugely apparent over the past few years.\n\nWhen wages land on a Friday, the squad are already calling their dealers for their weekend shenanigans. If they have an idle moment, a lot of the guys are glued to betting apps or crypto trading.\n\nHis other gripe is that the \"younger guys just don't want to work. They're lazy and entitled\".\n\n**Question:** Is drug use and gambling a problem in this industry? Is there a growing trend? Are the youth lazier?\n\n**My own ramble:** I've been a QS for almost 10 years and can say it's not as prevalent in the back office, but the vibe is very much a \"lads\" culture. Sports will always be the talk of the day and, by extension, gambling, but there's practically no downtime in the day to spend glued to a phone, which is different to on-site work.\n\nAs for illicit sniffing, it probably happens in closed circles, in certain boardrooms maybe, but it's more joked about than being a reality.\n\nAs for the opinion that the younger generation is lazy. I reckon we're living through a new phenomenon wherein social media is detrimental to industries that require 'unglamorous' work. Seems unfair to a lot of the youth that they're digging a trench in the freezing rain at 7 am when they're bombarded by constant media showing 'influencers' making money for nothing.\n\nWe can discuss the socio-economic factors at play here, lack of social mobility, low wages, poor education, the still-prevalent class system in the UK, but I'm curious to hear your stories.\n\n**Edit: repost due to incorrect NSFW tag usage. Also, construction is the industry in question. I work in the industry, he works in the industry, you work in the industry. There are studies that show this industry is particularly at risk.**  \n[**https://digitalcommons.calpoly.edu/cgi/viewcontent.cgi?article=1913&amp;context=cmsp**](https://digitalcommons.calpoly.edu/cgi/viewcontent.cgi?article=1913&amp;context=cmsp)",
    "score": 55,
    "url": "https://reddit.com/r/Construction/comments/1mn8pf9/gambling_drug_use_laziness_in_the_industry_an_old/",
    "created_at": "2025-08-11T09:51:01.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1pv3lor",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Has Construction made you financially better off?",
    "text": "Knowing if you start working at 17, and invest the majority of your income and let compound interest go to work,  you will  be ahead of the college graduate who has multiple five figure debt .  And that college graduate may never catch up. \n\nDid starting at 17 help your career out? ",
    "score": 48,
    "url": "https://reddit.com/r/Construction/comments/1pv3lor/has_construction_made_you_financially_better_off/",
    "created_at": "2025-12-25T02:49:43.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1jyt0s9",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "What is the net margin of small and medium construction companies?",
    "text": "What is the net margin of small and medium construction companies? I am referring to the net margin after material costs, salaries, taxes, etc.\"",
    "score": 46,
    "url": "https://reddit.com/r/Construction/comments/1jyt0s9/what_is_the_net_margin_of_small_and_medium/",
    "created_at": "2025-04-14T07:21:40.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1o89k3k",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Kiewit",
    "text": "To all current and former Kiewit employees — I recently received an offer for a Field Engineer position with a starting salary of $90K. I’ll be graduating this December from Purdue University Indianapolis with a degree in Construction Management. I’m really grateful for the opportunity, but I’ll admit I don’t have much hands-on experience yet — especially when it comes to estimating or field work. I’m a little nervous about stepping into a role with such big responsibilities right out of school. For anyone who’s worked at Kiewit or started in a similar position, I’d really appreciate any advice or insight on what to expect, how the learning curve is, and whether you’d recommend accepting the offer. I just want to make sure I’m setting myself up for success as I start my career in construction.",
    "score": 34,
    "url": "https://reddit.com/r/Construction/comments/1o89k3k/kiewit/",
    "created_at": "2025-10-16T15:40:53.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1k5b97l",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Am i being compensated fairly?",
    "text": "Working in SWFL as a super on commercial project around $5m. Getting paid 70 salary with almost no benefits besides a week PTO which seems impossible to use. Hoping to get some clarity if i should be asking for a raise or not. \n\n  \n13yrs exp in construction field ",
    "score": 33,
    "url": "https://reddit.com/r/Construction/comments/1k5b97l/am_i_being_compensated_fairly/",
    "created_at": "2025-04-22T16:53:07.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1hmhbey",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Do you pay sales people a salary or commission only? I used to work for a company that did comission only and i just opened my own i wanna know whats the best approach ",
    "text": "",
    "score": 30,
    "url": "https://reddit.com/r/Construction/comments/1hmhbey/do_you_pay_sales_people_a_salary_or_commission/",
    "created_at": "2024-12-26T05:00:49.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1oqy8tx",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Chinese construction engineer here — happy to connect and answer any questions about the industry in China 🇨🇳👷‍♂️",
    "text": "Hey guys! I’m a civil / geotechnical engineer based in China, been working in the construction field for quite a few years now.\n\nI know a lot of people are curious about what it’s like to work in construction here — how projects are managed, how fast things get built, what materials or standards we use, and what the day-to-day looks like.\n\nI’d love to connect with people in the industry from around the world — project managers, site engineers, architects, designers, or anyone curious about how things are done in China.\n\nFeel free to ask me anything — salaries, work culture, technology, safety, regulations, challenges, you name it. I’ll answer honestly based on what I’ve seen and experienced.\n\nAlways happy to share and learn from others too. Cheers!",
    "score": 29,
    "url": "https://reddit.com/r/Construction/comments/1oqy8tx/chinese_construction_engineer_here_happy_to/",
    "created_at": "2025-11-07T16:00:59.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1pqsuua",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Superintendent moving to DC — which GC is best to work for",
    "text": "Hey all — I’m currently a superintendent with Skanska, but I’m considering relocating to the DC area. I could stay with Skanska but the only option there would be heavy civil work, which isn’t ideal for me.\n\nI’m trying to get a sense of which general contractors in the DC market are worth targeting. In your experience, which GCs are best to work for from a superintendent perspective — especially in terms of:\n\n• Backlog / steady work pipeline \n• Pay + bonus structure \n• Company culture on the field \n\nCurrent salary is 135 base 8 years experience in base build, mix use, dorms, interior fitouts etc, currently working on the mission critical side.\n\nCurrent GC’s I’ve been looking into are Hitt &amp; Turner Construction",
    "score": 23,
    "url": "https://reddit.com/r/Construction/comments/1pqsuua/superintendent_moving_to_dc_which_gc_is_best_to/",
    "created_at": "2025-12-19T18:42:26.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1ikb921",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "County job that pays salary instead of hourly?",
    "text": "Recently interviewed for a Parks Operations Construction/Maintenance job under the County. Essentially encompasses County park &amp; trail maintenance. Went well and sounds like a good opportunity, pension, and benefits. They get you your CDL A &amp; Pesticide applicator license.The only thing that stood out is that it pays salary, so no overtime is paid out.\n\nIf you do work over 40 hours, you earn comp time, which is essentially extra vacation time you can use at a later date. This is in addition to the normal vacation time you earn. Comp time as a concept seems to only be available for government labor jobs that pay salary.\n\nFrom what it seemed like, overtime is generally optional for the role unless it's an emergency. Days may finish early if the weather hits hard. Work for this job also slows down in the winter, so even if you don't hit 40 hours you still get paid for a full 40.\n\nThe managers said that most guys will build up some comp time in the busier months and then will take lots of vacations when it slows down using comp time and normal vacation time.\n\nDoes salary make sense for a job like this?",
    "score": 21,
    "url": "https://reddit.com/r/Construction/comments/1ikb921/county_job_that_pays_salary_instead_of_hourly/",
    "created_at": "2025-02-08T01:13:51.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1oddgl0",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Barnhart Crane and Rigging toxic to the core",
    "text": "\n\nI've tried and tried to get indeed to accept my review of Barnhart Crane but it keeps getting flagged and taken down. I feel like I have a responsibility to put this out somewhere so that nobody makes the mistake I do and works for them if they don't have to.\n\nManagement doesn't care about you unless they know you outside of work. That or you are entertaining in the office and they find you amusing. Hard work isn't recognized. Talking with the field guys they say there is like a dark cloud that encompasses the office and yard of Barnhart. Pretty much every branch is like this from my research \n\nThere is a mean girl type of click I'll call it the good ole boys because this is a group of all little boys. I played what I thought was a good team player role, a very vital role that at the time felt important. But now that I think about it they were just using me. They use hourly employee like mules and there is no clear path of moving up. If you are going into a role pretty much anywhere at Barnhart make sure you negotiate your wage and time off then because there is no room for advancement. You are stuck. You will be sold an idea that you will make more with more responsibility. That is not the case. Good workers that are good as gold in my eyes are looked down on and talked about. Never paid any more money. People that actually care about the company and work hard, there are no incentives.\n\n Being an amazing a guy that comes in early and leaves late does not have value. I worked so hard here some days my body was physically sore all weekend into the next week. But if you are not Union Hourly or if you don't have a good salary I really don't know why you would work there. Salary guys work 50 hours a week and never really get any lower hours. They get 2 weeks PTO maximum, and usually have responsibilities that have them needing to answer the phone while taking said PTO. \n\n Union guys talk a lot about leaving and going somewhere better. Non union hourly guys are the bottom of the barrel. I've witnessed fights, like literal grown men having a bitch fit. I've seen multiple guys quit for better opportunities. I've seen the cancerous idiot who will remain nameless but is kept on because of tenor or being decent at keeping machinery running. I've been close to the room while people bullshit for hours on end and talk shit about everybody and anyone who isn't in that direct room. \n\nThey \"give\" money away like a non profit however if you are smart enough to really follow the money most of that is going to lobbying politicians. They aren't really even helping the community anywhere around where they are based out of. I've seen all the money they take from hard working people that they are employing. They then turn around and give it away to make good on taxes so they don't have to pay as much. \n\n I'm going to tell you the good stuff now just in case you NEED a job, I wouldn't take it but the good things are the work is steady, you learn a lot and figure out a lot about yourself. There is always something to do. You will learn to work well with a lot of different types of people. You will learn how to set up and signal a crane and a construction sight. Signal and run all sorts of construction machinery.\n\n I will say one thing that irritated me more than anything, even more than the 2 days of PTO I was shelled out after being there 15 months. Is that its a culture that rewards the wrong people. Its a place where the problematic, mean, and combative people can continue to work there. Its a place where the guys who stand around in the dispatch office and shoot the breeze can be allowed to do that for hours, I'm not joking hours a week, and not get any repercussions whatsoever. If you want to make your way in a 'Christian\" Company go to chick fil a, Fuck this place, I'll never work there or anywhere like it again ",
    "score": 15,
    "url": "https://reddit.com/r/Construction/comments/1oddgl0/barnhart_crane_and_rigging_toxic_to_the_core/",
    "created_at": "2025-10-22T16:43:19.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1p9h3h4",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "New PE fresh out of college and I'm rethinking my career in management",
    "text": "Hey guys I graduated this spring with a degree in construction management and have been working for a large national GC since this past summer. Roughly 4 months in working full time I'm having second thoughts about this whole management thing. I'm struggling with some aspects of the job and I don't know how much of it I can attribute to just being new to the job. \n\nI'm going to be honest since I'm on a burner but I just feel retarded all the time and I don't think that anyone should count on me. I suck at time management and I feel like every task requires 5 mini tasks that each take time. I don't get much done every day as I overthink everything. I still want to do a good job so I stay late to do the things that I have to get done to a standard that is acceptable. And the thing that fucks me up is that I'm on salary so I get no overtime.\n\nI have no complaints about my project team, they're all actually great and so is my direct supervisor. But I'm tasked with a challenging scope (building envelope) that I actually am just assisting someone else with. In my daily work, I have interactions with my team, subcontractors, architects, owners rep etc where they ask questions and I can't answer anything satisfactorily. Almost every time my answer is \"I am not sure at this time but I can check for you\" because I can't retain information about the scope of work, the meeting we had, or constraints from last week.\n\nI wanna give myself time to at least try, and so I can say that I didn't give up, but I feel pretty stupid all the time at work and I don't like not being paid for staying late. If this doesn't work out I would join the carpenters union.  A new apprentice makes the same as I do now and doesn't have to worry about work when they clock out (unless I'm wrong, and I know about the physicality of the work and dealing with aches/pains).\n\n  \nSo, project managers and carpenters, chime in with your opinion, words of advice, or just tell me to suck it up and stay behind the computer.",
    "score": 13,
    "url": "https://reddit.com/r/Construction/comments/1p9h3h4/new_pe_fresh_out_of_college_and_im_rethinking_my/",
    "created_at": "2025-11-29T05:46:16.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1mm151y",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "How do you find reliable workers?",
    "text": "Hi everyone,\n\nI own a small construction company, we just started, and I’m looking for effective ways to find skilled and reliable workers. I’d love to hear from your experience:\n\n\n\n* Is it better to hire employees on a fixed salary or work with subcontractors?\n* If hiring, is it worth paying higher salaries to attract and keep good workers?\n* What methods or channels do you use to find trustworthy tradespeople?\n* How do you check if a worker is truly skilled before bringing them on a project?\n\n\n\nAny practical tips or personal experiences would be greatly appreciated.\n\n\n\nThanks!",
    "score": 13,
    "url": "https://reddit.com/r/Construction/comments/1mm151y/how_do_you_find_reliable_workers/",
    "created_at": "2025-08-09T21:42:44.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1j8ge7j",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "What can I expect as a superintendent/PM at a larger company?",
    "text": "I left the military approximately 9 months ago leaving behind a fairly strong income as a senior captain. \n\nI interned in coastal georgia as a superintendent for 4 months and took a role as a 1099 superintendent managing projects, sometimes bags on in the field and other times managing subs. \n\nThe company is very small, just me working for the owner and I’m making 60k per year. The job is awesome, my boss is great and he tries to slide me side work and refer my personal company to try and make up for my pay cut. That being said, it was a 40k pay cut and the job has no financial benefits, health insurance, vehicle allowance, etc. The company is on track to break 2 million this year. \n\nI’ve been doing estimates, project management, and client relations which has been super cool. I get to discuss company strategy and I’m helping to build systems. I love this job but it’s not covering all of our bills with my wife being at home with our 1 year old. \n\nWe’ve discussed me going to work for a larger company for the benefits and hopes of increasing my income. \n\nWhat can I expect at a larger company? What would a superintendent expect to make? Prior to this role I was leading 50 plus member teams in the military and doing remodels and renovations in Texas. \n\nI would love to stay at this company but I don’t think he can cover a larger salary and benefits. I will obviously have a conversation with him prior to making a decision because I look to him as a mentor. ",
    "score": 8,
    "url": "https://reddit.com/r/Construction/comments/1j8ge7j/what_can_i_expect_as_a_superintendentpm_at_a/",
    "created_at": "2025-03-11T02:22:19.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1jjn70u",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Currently federal, seeking leaving advice",
    "text": "I am trying to move up in my career and would love any perspectives, please. 28F, 7yrs experience in May, have my EIT, DC metro area, salary $111k (yr 4 GS12) \n\nAll my time has been federal construction management, first as AF civilian and now with GSA PBS. I hadn’t intended to do management over design but I ended up really enjoying it and in particular I like the mission, serving the taxpayer, and helping define requirements, vs grinding in private to compete for jobs. My roles have been project programmer, manager, contracting officer rep and sometimes multiple at once. I do scopes, negotiation, QA, doc management and invoicing, etc. At the AF I was involved in hurricane recovery and managed $100M of demo and temp facility projects. I moved to GSA mainly for geographical personal reasons, but I really like the variety of work and have had major construction (multiple $50M vertical construction) here too but not to that program scale plus smaller renovations and lease fit outs. \n\nI was planning to switch agencies in order to get my GS13 in the fall if unable to move up w GSA by then, but obviously, everything is crazy now. My RIF in the next four months is inevitable. I thought about going back to DOD, but it doesn’t feel guaranteed.\n\nI have an offer on the table with CDM smith to help replace lead pipe in DC. They really liked me and offered 24 hrs after my interview which was a huge confidence booster, and let me negotiate up the PTO to 20 days, it would be $130k and 3% 401k match. Hybrid schedule after a few months. I have to tell them an answer tomorrow. \n\nI had a final round 3 interview today with a non profit hospital system for new major construction. I was really optimistic they would tell me today or tomorrow if I would move forward because they seemed like they wanted people on site soon and had already asked for my references, and that they would match my other offer and it would be 24 days pto and 5% match. But the VP I talked today seemed less optimistic. He wanted someone with more healthcare experience and was planning to make decisions by end of April, and said he really liked my resume but also had some confusing questions on it, and then ALSO told me he wouldn’t give me false hope but to also call/email or “even text” him if my other offer didn’t work out so that we could discuss further. \n\nI like the nonprofit mission and company a lot more, but I feel stressed by these mixed signals and don’t feel like I have time to see how things pan out if I lose both opportunities, so I am leaning towards the first. I like that it’s a national company also. \n\nThe only thing I am quite stressed about is if this is a step “down”, going from building renovations and new builds to a utility infrastructure transformation program. It seems like a major undertaking all together and one I think is important, but is it too simple? Am I going to look like my resume has gotten consistently easier over time? Leading projects to part of a team? \n\nShould I ride out my time at GSA and keep looking? I had a couple other interested people but they said the projects would be for bids down the line. \n\nThanks in advance. ",
    "score": 7,
    "url": "https://reddit.com/r/Construction/comments/1jjn70u/currently_federal_seeking_leaving_advice/",
    "created_at": "2025-03-25T16:15:54.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1n0u72q",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Construction Project Coordinator Salary (Ontario)",
    "text": "I’m currently working as a Construction Project Coordinator for a GC in the GTA, making $62k.\n\nI’ve been in this position for about 2.5 years.\n\nFeeling like I am underpaid or below average.\n\nInterested to hear what others in the industry are making.",
    "score": 6,
    "url": "https://reddit.com/r/Construction/comments/1n0u72q/construction_project_coordinator_salary_ontario/",
    "created_at": "2025-08-26T18:44:28.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1n7mq6p",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Project Engineer salary in Boston after being with the company for 1 year",
    "text": "I joined this mid size GC (50 employee) as a field engineer intern back in July. Worked with them for full year. My pay increased from $23/hr to $30/hr in this tenure. From the beginning under my email I had the title as Project engineer.\nToday I got an offer of 75k to continue with them as a project engineer. Is the number right? Or should I negotiate? I have social anxiety so I would say yes to anything and that's why need your opinion.\n\nMy background:\nBachelor's in architecture degree (non US)\n2 year experience as architect and interior designer on small scale project (non US)\n\nMasters in construction management from Northeastern University, Boston \n\n1 year as field project engineer at the current GC, Boston \n",
    "score": 5,
    "url": "https://reddit.com/r/Construction/comments/1n7mq6p/project_engineer_salary_in_boston_after_being/",
    "created_at": "2025-09-03T18:25:22.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1p2ff8o",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Construction",
    "text": "I’m graduating in May 2026 with two summers of field engineering experience at Whiting-Turner. Right now, I’m at a crossroads with three great opportunities: I’ve received full-time offers from both Kiewit and Turner Construction, and I just completed a strong interview with Balfour Beatty.\n\nKiewit offered $90,000, but I’m hesitant. I’ve heard mixed things about their work culture and relocation expectations, and the offer stated I’d be placed in either Baltimore or rural Pennsylvania, which isn’t ideal for me. I want to stay in the DMV area, where most of my work experience and network are based.\n\nTurner offered $78,000 plus a $3,000 signing bonus, and while I really like the company and the opportunity to stay local, I was expecting a bit more financially — especially with two internships under my belt.\n\nSo now, I’m weighing culture, location, and long-term growth over just salary. I want to make the best decision for my career, stability, and lifestyle.",
    "score": 5,
    "url": "https://reddit.com/r/Construction/comments/1p2ff8o/construction/",
    "created_at": "2025-11-20T21:18:09.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1mtxe9j",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Residential vs Commercial",
    "text": "Hey so I’m going to college this year and I don’t know what to chose residential or commercial construction management. The residential program is only two years and I will have no debt. The commercial is 4 and I will have around 20k dept. And I was looking for some advice and I have a couple questions for u guys. \nWhat do you exactly do as a construction manager?\nSo what was your guys first salary right after college? \nWas is hard to find a job?\nWhat field did u prefer?\nIs it possible to go first residential and then commercial after some time ? \nWhat’s the salary after 4 years of experience? \nHow do you become an PM? \nWhat are the benefits of this position? \n\nI have read some of the old posts regarding something like I just wanted an update about this. \nThank you for your guys time. ",
    "score": 5,
    "url": "https://reddit.com/r/Construction/comments/1mtxe9j/residential_vs_commercial/",
    "created_at": "2025-08-18T20:23:31.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1jy0g6n",
    "subreddit": "Construction",
    "soc_codes": [
      "47-1011",
      "47-2061"
    ],
    "title": "Electrician or pipe fitter",
    "text": "So I’ve been passed the screening for my electrician and pipe fitter unions and am unsure which to pick\n\nI’m in the Kansas City area and would like the one that maximizes potential salary even if more difficult\n\nWhat’s yall opinion on this?",
    "score": 5,
    "url": "https://reddit.com/r/Construction/comments/1jy0g6n/electrician_or_pipe_fitter/",
    "created_at": "2025-04-13T05:25:57.000Z",
    "num_comments": 16
  }
]