[
  {
    "id": "reddit-1hp6gg9",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "In Memory of President Jimmy Carter!",
    "text": "Today, we honor the life and legacy of President Jimmy Carter, a man who dedicated himself to serving his country both in uniform and in public office. Before becoming the 39th President of the United States, Carter served with distinction as a U.S. Navy officer, working on cutting-edge submarine technology and exemplifying the values of duty, honor, and service.\n\nHis military background shaped his lifelong commitment to leadership and service, which he carried into his presidency and humanitarian work. We salute his contributions as a veteran and a leader and extend our heartfelt condolences to his family.\n\nRest in peace, President Carter. Your service to our nation will never be forgotten. 🇺🇸 \n\n#JimmyCarter #Veteran #HonorAndService #presidentcarter ",
    "score": 3523,
    "url": "https://reddit.com/r/Military/comments/1hp6gg9/in_memory_of_president_jimmy_carter/",
    "created_at": "2024-12-29T21:32:38.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1jljfk2",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "What's the deal with Pete Hegseth? Am I the only veteran that recognizes this guy's personality?",
    "text": "Can we have a candid discussion on the type of guy SECDEF Hegseth appears to be? Specifically, I’d like to lead off the conversation around his high bar being mediocrity.\n\n Let’s start with his military career. He was an infantry platoon leader for a time. Then it appears he was tasked at the S-9 (Civil Affairs). Then it appears he volunteered to teach COIN in Kabul. Then IRR. Then ARNG in DC.\n\n Let’s unpack this. He’s an infantry officer. But he didn’t complete Ranger School, Airborne School, or Air Assault School – and he was assigned to the 101^(st). Why not? I spent the vast majority of my time in the Army in the heavy side of things (1AD/1CD/18ABN), and as a medical service officer, I completed both Airborne and Air Assault. I struggled to think of a single infantry officer who I’ve met that hasn’t completed at least one of the three – and I could only think of one.\n\nAny junior officer that’s ever served in a BCT can tell you the #1 captain, if not in command, is the AS3. The lower performing folks are put in charge of made up shops – Civil Affairs being an ‘imaginary’ shop in most battalions. Our battalion’s S-9 was staffed by a never-going-to-get-promoted fat Captain and a SFC with DUI and EO problems. Speaking to former peers, that’s the general consensus – the folks in the ‘made up’ shops are the lowest performers. Why was LT/CPT Hegseth put in that position?\n\nThen it appears that CPT Hegseth volunteered to be an instructor of some sort at the COIN academy in Kabul where he taught one class. Again, these classes are typically taught by post-command Captains/early Majors and Master Sergeants. Why would someone with no real experience in COIN be teaching COIN at a theater level? Why would a Captain be working at theater-level if not to keep him out of trouble or because no one would pick him for their team?\n\nThose are the things we know about. Let’s talk about some things that are missing. His highest level of leadership experience appears to be Platoon Leader. His most impactful job appears to be a battalion-level Civil Affairs OIC/AOIC position. In the civilian world, even FoxNews relegated him to the weekend morning show – the doldrums of TV ratings. He apparently parted ways with the charity(s) with which he was affiliated over some alcohol related incidents – and the charities weren’t terribly impactful either.\n\nAfter reading the signal conversation, it reads like a battalion/brigade battle captain briefing his boss. The granularity of the detail and tick-tock of it make it seem like he’s trying to brief an operational leader – not a group of strategic folks. It’s no wonder there aren’t many people chiming into the conversation – they were likely ignoring it because it just wasn’t being briefed to their level. It’s almost like he was trying to get attention – fishing for compliments on DoD’s actions. I don’t know why, but it just sounds so… junior… so inexperienced.\n\nThis is a guy that reads, on paper, like he aspires to mediocrity. He’s the guy that gets 300 on the PT test, does just enough to get out of writing an OPORD, has his subordinates writing their own NCOERs/OERs, manages to always have rumors of him sleeping around but never gets caught. It’s almost like he’s the guy that likes the idea of being in the military without actually *being* in the military. He’s the guy that volunteers to be rear-D commander, but the decision authority makes him the rear-D XO because he can’t be trusted with responsibility. He's the guy that volunteers to be an infantry officer but doesn't want to do any of the \"hard\" schools.  I feel like I know the personality type, because we’ve all worked with them. I think we all know a Pete Hegseth and none of us would call them \"leadership material.\"\n\nSo what’s the deal? Does no one in DoD at the strategy-level see that this guy is… dangerously meh?\n\nEdit: formatting.\n\nEdit 2:  \nMy inbox asked: what would you expect his career to look like?\n\nFor a 20-year infantry officer in his generation, at bare minimum, I would expect airborne or air assault, and ranger school partnered with a company command.\n\nTo keep him in line with his peers...  \nI would expect battalion and/or brigade S-3/XO/DCO time, a significant assignment on a G/J/C-staff, and battalion command. I would expect some time spent in Vicenza or Bragg and the Pentagon or a MACOM. I would expect CCC and ILE.\n\nTo put him ahead of his peers...  \nI would expect to see some SOC time, multiple successful deployments in UOA in leadership positions, maybe a nominative assignment, White House/Congressional fellowship, or a very deep resume of regiment time.",
    "score": 2712,
    "url": "https://reddit.com/r/Military/comments/1jljfk2/whats_the_deal_with_pete_hegseth_am_i_the_only/",
    "created_at": "2025-03-28T01:19:46.000Z",
    "num_comments": 513
  },
  {
    "id": "reddit-1pki91b",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Meet an American NASA astronaut, physician, U.S. Navy officer, dual designated naval aviator and flight surgeon, and former Navy SEAL",
    "text": "[YT short for TLDR by @kagan.dunlap](https://youtube.com/shorts/nfkGzMrtEh4?si=-S6lkAcrsRCwvB8r)\n\n\nNASA Astronaut Jonny Kim displays traditional matryoshka doll after safe Soyuz\nMS-27 landing in Kazakhstan. He spend 8 months in space aboard the International Space Station. \n\nReturned to earth on December 9, 2025\n\nLCDR Kim enlisted in the Navy as a Seaman recruit after graduating high school in 2002.\n\nAfter completing Hospital Corpsman “A” school training, he reported for Basic Underwater Demolition/SEAL (BUD/S) training in Coronado, CA.\n\nAfter completing his training at Naval Special Warfare, Kim reported to the John F. Kennedy Special Warfare Center and School in Fort Liberty, NC, for the Special Operations Combat Medic Course.\n\nHe was assigned as a Special Warfare Operator to SEAL Team THREE in San Diego and obtained various qualifications, including:\n\nMilitary Freefall Parachutist\n\nAdvanced SCUBA\n\nCombatant Diver (closed circuit rebreather)\n\nNaval Special Warfare Special Reconnaissance Scout and Sniper\n\nand Advanced Special Operations Techniques\n\nKim served as a special operator on more than 100 combat operations in support of Operation Iraqi Freedom.\n\nIn 2012, Petty Officer First Class Kim was commissioned as a naval officer through the Navy’s enlisted-to-officer commissioning program, Seaman to Admiral-21, following graduation from the University of San Diego with a Bachelor’s degree in Mathematics, summa cum laude.\n\nHe obtained his medical degree from Harvard Medical School and completed his internship with the Harvard Affiliated Emergency Medicine Residency at Massachusetts General Hospital and Brigham and Women’s Hospital in Boston, MA.\n\nKim is an Aeromedical Dual Designated (AMDD) Naval Aviator and Flight Surgeon. He completed his primary flight training at Naval Air Station (NAS) Corpus Christi, TX, helicopter advanced flight training at NAS Whiting Field in Milton, FL, and the Naval Flight Surgeon course at the Naval Aerospace Medical Institute at NAS Pensacola, FL.\n\nSpaceflight Experience:\n\nOn April 8, 2025, Kim launched to the International Space Station aboard the Soyuz MS-27 spacecraft, accompanied by Roscosmos cosmonauts Sergey Ryzhikov and Alexey Zubritsky.\n\nHe spent eight months aboard the station as an Expedition 72/73 flight engineer, conducting science experiments and maintaining the space station.\n\nHe returned to Earth on December 9, 2025.\n\nDuring the science expedition, Kim logged 245 days in space, orbiting the Earth 3,920 times and traveling nearly 104 million miles. He saw the arrival of nine visiting spacecraft and the departure of six during his time in orbit.\n\nAwards &amp; Honors:\n\nSilver Star Medal\n\nBronze Star Medal with Combat “V”\n\nNavy and Marine Corps Commendation Medal with Combat “V”\n\nCombat Action Ribbon and various campaign and service awards\n\nCommodore’s List with Distinction, Naval Advanced Flight Training\n\nNaval Special Warfare Medic of the Year\n\nSpecial Operations Medical Association\n\nCommandant’s List, Special Operations Combat Medic Course, Joint Special Operations Medical Training Center (JSOMTC)\n\nSEAL Junior Sailor of the Quarter, SEAL Team THREE\n\nDistinguished Honor Graduate\n\nNavy Hospital Corpsman (HM) “A” School\n\nTillman Scholar, Pat Tillman Foundation\n\nPhi Beta Kappa, Kappa Gamma Pi, and Mortar Board Honor Societies",
    "score": 2232,
    "url": "https://reddit.com/r/Military/comments/1pki91b/meet_an_american_nasa_astronaut_physician_us_navy/",
    "created_at": "2025-12-12T04:02:09.000Z",
    "num_comments": 165
  },
  {
    "id": "reddit-1itmpn4",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "We need to have a discussion about \"lawful orders\"",
    "text": "The US military is now the only part of the federal government that has an obligation to the rule of law as defined by US code, the US constitution, and international law. Officers, especially those that attend the academies, are well versed in the idea of a lawful vs. unlawful order. However, the enlisted are told what constitutes a lawful order, but are given very little information on what constitutes an unlawful order. So let's have a bit of a refresher.\n\nThere are various criteria to a lawful order, but all orders need to follow 3 basic criteria:\n\n* Legal under US law\n* Legal under the US constitution\n* Legal under international law\n\nThese are the 3 masters under which you will be judged if you transmit or perform an unlawful order. Normally, US law and US constitution would be in the same bullet point, as the constitution is the supreme law of the land. However, as I said before, these are unprecedented times. International law is important here as well. The US is a signatory to \\*most\\* of the Geneva Conventions. However, even if a nation is not a signatory to a certain part, you can still be tried under international law for following or transmitting an unlawful order.\n\nSo, for example, there's a group of protesters gathering outside a federal building late at night. The executive would like the crowd to disperse. Here's 4 potential orders that are within the current realm of possibility:\n\n* \"Under the Insurrection Act, I authorize the use of federal troops to assist law enforcement in restoring order, ensuring protection of federal property, and enforcing curfews in accordance with federal and state laws.\"\n\nWhile not exactly well liked, this is certainly legal in the US. It was used in Minneapolis, when the National Guard was used to help police enforce curfews after Floyd was murdered. In this case, anyone caught by the Guard was arrested by the police - they were there to assist, not enforce.\n\n* \"I Order federal troops to conduct arrests of protesters for violating local curfew laws.\"\n\nThis is an unlawful order under federal law (18 U.S.C. § 1385), but not under constitutional or international law. The US military cannot be used as a police force to enforce local, state, or federal laws. It would require an act of congress, not an order from the executive, to make this order legal. You have the **right** and the **duty** to **refuse** this order, and to refuse to **transmit** this order.\n\n* \"Use live ammunition and lethal force to disperse the protesters, regardless of whether they pose a threat.\"\n\nDisregarding federal law, this is a violation of the US constitution, as an unreasonable seizure under the 4th amendment and a deprivation of due process under the 5th amendment. Again, You have the **right** and the **duty** to **refuse** this order, and to refuse to **transmit** this order.\n\n* \"I designate the protesters as terrorists and enemy combatants, and they should be treated as such\"\n\nThis is illegal in many ways, but especially under international law; specifically the fourth Geneva Convention. You have the **right** and the **duty** to **refuse** this order, and to refuse to **transmit** this order.\n\nWhile these scenarios may seem silly, there is a large part of the US population that is genuinely afraid of these outcomes. The US military is the strongest, smartest, and best war fighting force the world has ever seen, and it is our responsibility to hold ourselves to a higher standard than those in charge may hold themselves to.\n\n**\\*\\*this post was written to be apolitical. Let's keep it that way and keep the mods happy.**",
    "score": 2174,
    "url": "https://reddit.com/r/Military/comments/1itmpn4/we_need_to_have_a_discussion_about_lawful_orders/",
    "created_at": "2025-02-20T01:34:05.000Z",
    "num_comments": 336
  },
  {
    "id": "reddit-1i9nii2",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Sec of Defense shouldn't be Political",
    "text": "Hegseth was confirmed 51-50. Every Democrat and 3 Republicans in the Senate voted against Hegseth. VP Vance was required to cast a tie breaking vote. This is extremely unusual. Sec of Defense has traditionally be a bipartisan appointment. \n\nLloyd Astin, who was appointed by Joe Biden received a vote of 93-2, Mark Esper, who was appointed by Trump received 90-8, Gen. Mattis, also by Trump 98-1, and Ash Carter appointed by Obama 93-5. What's just happened with Hegseth is troubling.\n\n In the Trump era it is easy to diminish controversy as just more of the same. This isn't that. Trump 2 previous Sec of Defense picks received overwhelming support in the Senate. Hegseth was forced through on a tight partisan vote where even members of Trump's own party voted \"Nay\". \n\nFrom Academy to Stars it takes senior leadership decades to climb through the rank. Many civilians in DOD already served full careers in uniform and are now decades into their civil service work. DOD has millions of people who have been with it through numerous Presidents. Afghanistan for example persisted through Bush, Obama, and Trump. \n\nInternationally we have serious challenges. Russia in Ukraine, China lurking on Taiwan, Hezbollah &amp; Hamas in battle with Israel, the Fall of Assad in Syria, Iran actively seeking to assassinate Americans, etc. In '26 the U.S. will host the world cup and in '28 the U.S. will host the Olympics. Major world events that will attract terrorists from around the globe. \n\nHegseth is the wrong person for the job. Beyond his personal failings (there are many) his credentials are underwhelming. Hegseth is unqualified based on the absence of any relevant experience. Does anyone here feel more charitable towards Hegseth? Is their something I am missing? ",
    "score": 1802,
    "url": "https://reddit.com/r/Military/comments/1i9nii2/sec_of_defense_shouldnt_be_political/",
    "created_at": "2025-01-25T14:00:21.000Z",
    "num_comments": 376
  },
  {
    "id": "reddit-1p18i7z",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Guy who almost joined military now enjoying career as ICE agent",
    "text": "Lol\n\n\"Ralston never did enlist. Instead, he got certified through an online law enforcement course that came with a free T-shirt and started applying to federal jobs that “required courage but not cardio.”\"\n\n\n\"Those close to Ralston say he talks about the military more than most people who actually served. His Facebook page is filled with American flags, Bible verses, and photos of himself holding large fish. His Instagram profile picture shows him standing in front of a black-and-white flag with a blue stripe through it, captioned, “Some of us still stand for something.”\"\n\n",
    "score": 1279,
    "url": "https://reddit.com/r/Military/comments/1p18i7z/guy_who_almost_joined_military_now_enjoying/",
    "created_at": "2025-11-19T14:03:17.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1ixojo7",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "A plea to our vets, from a VA clinician",
    "text": "I don't really know how to reddit, and don't really ever make any posts, but recent events have me feeling so disappointed I feel the need to say something. From speaking with my veteran patients, I am hopeful there are some that may feel the same way, as well.\n\nAs most of you may be aware of, recent attacks on the federal workforce are having an effect on the VA system. It's almost like bleeding out from the inside. The 1000 employees that recently were laid off is just the tip of the iceberg. A week or two ago supervisors had to report who was within their probationary 2 year period still-- likely aiming to fire/unhire them. Although the frontline clinical staff were spared to some extent for now, they seem to be crippling us by getting rid of our administrative staff and not allowing us to hire any. They serve an essential role in keeping the clinics and hospitals running. Without their work for patient scheduling, supplies/inventory management, upkeep/maintenance, timekeeping, etc., we will eventually crumble.\n\nI spend my days working with my medical team and we barely have any room to eat or have a bathroom break, but seeing you all come in sick and discharging from the hospital feeling better is worth it all. The VA was my dream job since graduating residency and I am blessed and happy to work here. I hope you can empathize with me when I think that an email from OPM asking me to describe what I did last week to be an absolute waste of time. Time that I could be using to care for the vets instead.\n\n**For those of you who are vets who believe in the VA and the care it gives, I implore you to go to your town halls, to call your senators and house representatives, get your voice out there and let people know if you want to see the VA as an essential part of your healthcare. If this post gets even a few of you guys more active to get your voice out and be heard, I'll consider it a success.  I just don't want to see this place go down without a fight.**\n\nEdit: Thank you all for the awards and kind words. Since this post was made, it became official that they've let go 1400 \"probationary\" (i.e. hired within 2 years). These people were \\*indiscriminately\\* fired and was not merit based. They claimed these people were not providing veteran care but there was a joint congressional hearing yesterday (link below) that details doctors and prosthetics staff getting let go at another VA. On top of this, it was estimated that hundreds of vets themselves were let go.  Mike Bost (senator and chairman) seems to be more focused on gaslighting these concerns rather than providing actual answers to why VA staff and namely veterans are being let go. Watch for yourself, its rather infuriating.\n\n[https://www.youtube.com/watch?v=SVj7w3Mzvhk](https://www.youtube.com/watch?v=SVj7w3Mzvhk)",
    "score": 1275,
    "url": "https://reddit.com/r/Veterans/comments/1ixojo7/a_plea_to_our_vets_from_a_va_clinician/",
    "created_at": "2025-02-25T06:26:11.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1nkrklh",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "I didn't kill myself today.",
    "text": "I was up until 4:30 this morning. I was crying all night. I was considering doing 100mph into Lake Caroline today. I was on a delivery route because I lost my job last month and I'm not gonna make rent for October so I'm outta there most likely. The only safe place I've ever had in my life. I have an appointment with a bankruptcy attorney on Monday. As I came around a bend looking for an address a little girl and her mother waved and smiled. I waved back and continued on with my route. I went home and didn't kill myself today. ",
    "score": 1166,
    "url": "https://reddit.com/r/Veterans/comments/1nkrklh/i_didnt_kill_myself_today/",
    "created_at": "2025-09-19T02:25:26.000Z",
    "num_comments": 187
  },
  {
    "id": "reddit-1hplmyb",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Why I believe the veterans clubs are slowly dying.",
    "text": "I know that this topic has been said many times on here. Last evening I was kicked out of the American Legion club in a town because I wrote a email to the board about a manager who I thought could do a better job. I was then pulled back into a back room and strong armed and bullied by a board member and the manager. And eventually kicked out.\n\nI doubt anyone will see this but this is the reason. The old boys club never respecting the Global War on terror vets. You alienate us get drunk and bully us. The legion in general does great work. But a few bad actors are killing it. ",
    "score": 977,
    "url": "https://reddit.com/r/Veterans/comments/1hplmyb/why_i_believe_the_veterans_clubs_are_slowly_dying/",
    "created_at": "2024-12-30T11:52:20.000Z",
    "num_comments": 427
  },
  {
    "id": "reddit-1ivn91t",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "The Country Is Unaware What Went Down Last Night.  WAKE THE HELL UP!!!",
    "text": "This perfectly explains it from VoteVets\n\nTrump and Hegseth started purging senior Military officers that they deem insufficiently loyal. We’ve been talking about this for months, and last night it finally began.\n\nThey started with the Chair of the Joint Chiefs, General CQ Brown. They followed with Chief of Naval Operations Admiral Lisa Franchetti and Air Force Vice Chief of Staff General James Slife.\n\nBut they didn’t stop there.\n\nTrump and Hegseth also purged the Judge Advocates General for the Army, Navy, and Air Force. JAG officers interpret and determine lawful and constitutional orders. Replacing career JAG officers with loyalists is essential to Trump’s overall goal of a Military dedicated not to the Constitution, but to him alone.\n\nTo put it bluntly, our adversaries are popping champagne right now. There is no better outcome for them than the promotion of Trump loyalists over the best and brightest. They know that this move makes our Military weaker.\n\nThe real concern is what comes next. Trump has made his intentions clear. He has openly signaled his intent to ignore the Constitution, he has attacked democratic processes and elections for the better part of a decade, and the actions he and Elon Musk have taken over the last four weeks openly defy longstanding Constitutional order.\n\nThis is a dangerous moment, and we have to be ready for whatever happens.",
    "score": 919,
    "url": "https://reddit.com/r/Military/comments/1ivn91t/the_country_is_unaware_what_went_down_last_night/",
    "created_at": "2025-02-22T16:57:46.000Z",
    "num_comments": 278
  },
  {
    "id": "reddit-1m0ys1h",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "I see a lot of veterans  questioning if they can really go back to school and succeed after so much time away…",
    "text": "I’m 49 and have ADD as well as the standard mental health package gifted to us by our time in the service. I just graduated magna cum laude and am headed on to my Masters and PhD program. You can do it, too, and it feels REALLY good. ",
    "score": 901,
    "url": "https://reddit.com/r/Veterans/comments/1m0ys1h/i_see_a_lot_of_veterans_questioning_if_they_can/",
    "created_at": "2025-07-16T00:39:14.000Z",
    "num_comments": 167
  },
  {
    "id": "reddit-1ktvrtr",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Joined an elite club today.",
    "text": "Doc said I was operating on 1.8% restful sleep. High BP and a good friend finally got me to stop messing around and go get checked out. I lift, run, and eat right. I got lots of stress at work, but nothing I can do about that except KOKO for the next 1,043 days. Docs said that my not sleeping was making my BP high which was making my sleep worse which was making my BP worse and so on. \n\nReally looking forward to seeing what the world looks like on more than 1.8% battery. ",
    "score": 900,
    "url": "https://reddit.com/r/Veterans/comments/1ktvrtr/joined_an_elite_club_today/",
    "created_at": "2025-05-23T21:58:05.000Z",
    "num_comments": 211
  },
  {
    "id": "reddit-1iwu6kb",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Op-ed: Hold Fast: A recently retired senior naval Officer’s take on the recent turmoil in our armed forces.",
    "text": "\nI take my retired privilege again to speak out on issues that are important to me. The views expressed here are my own and increasingly do not reflect the policies of the Navy or the Department of Defense.\n\nOn Friday, two of our nation’s finest military leaders—General Charles Q. Brown and Admiral Lisa Franchetti—were summarily dismissed. These were not pencil-pushing brass; they were proven warfighters, leaders with unshakable dedication to service at the highest levels.\n\nThey were not fired because of job performance. Both had distinguished careers. Under Admiral Franchetti’s leadership, the Navy’s performance in the Red Sea proved that our surface anti-air warfare capabilities are not only effective against scores of asymmetric threats but also that our investment in surface ballistic missile defense was worth every dollar.\n\nSome may point to mishaps under Franchetti’s tenure, but those critics ignore a glaring inconsistency: Why was the Army Chief of Staff not also dismissed, despite overseeing more mishaps with greater loss of life over the same time period? Again, the answer is simple: this was never about job performance.\n\nWe have now entered a new phase of this administration—one that prioritizes ideological purity over competence. It is a purge, a systematic effort to rid the military of those who do not fit the administration’s narrow and dangerous vision of military strength: one that is hyper-masculine, racially homogenous, and blindly obedient.\n\nTo be even more direct—General Brown was dismissed because he is Black and had the audacity to discuss how his blackness led to struggles in his life. Admiral Franchetti was dismissed because she is a woman and had the audacity to speak in support of women’s roles in the modern armed forces.\n\nThe administration’s defenders will argue these leaders were too focused on “DEI, not lethality.” Yet, they conveniently ignore that the Army and Air Force had the exact same diversity programs as the Navy. They ignore that the Army had a higher percentage of transgender service members than the Navy. They ignore that as recently as last fall, the Army Chief of Staff publicly stated, “Without diversity, a homogeneous team of soldiers would lack the resilience, perspective, and growth offered by teammates from different backgrounds.”\n\nAnd yet, he remains while Franchetti is dismissed.\n\n“But they serve at the pleasure of the President, he can decide who he wants!”, is something I’ve heard throughout. That is not what is being questioned here. Nobody denies the President has this right. The real question is, “Why does the president’s pleasure align with racism and misogyny?”  Of the 8 serving joint chiefs, why were only the female and black members dismissed?  Why was the female 3-star general who acts as Chief of Staff for SECDEF fired, but none of the male 3-stars? It doesn’t take a rocket scientist to see the pattern. \n\nFurther, the firing of the top JAG officers is equally disconcerting. As the SECDEF said this morning, he fired them because he didn’t want lawyers who would “attempt to be roadblocks”. This is an abrogation of the rule of law. It is a chilling sign that controversial and possibly illegal activities are forthcoming and the administration does not want lawyers who will stand in the way of their plans  \n\nThese firings mark a turning point. Loyalty is no longer measured by allegiance to the Constitution but to the administration’s ideology. Stray from it, and you risk your career—or worse. That the Administration has nominated for CJCS Air Force Lieutenant General Dan Caine, an under qualified officer in need of a waiver, undercuts the meritocracy argument. That this officer said to President Trump, in Trump’s own words, “I love you, Sir…I would kill for you…” confirms that ideological purity is our new threshold. \n\nThis is not just outrageous; it is immoral. It is un-American.\n\nMany have chosen to resign rather than serve under these conditions. That, of course, is exactly what this administration wants—a strategic purge designed to drive out those who believe in the rule of law and replace them with those who will obey without question.\n\nBut I urge my fellow service members: Do not give them what they want.\n\nWhich brings me to the question I’ve been asked over and over: What do we do?\n\nI have two words for you:\n\nHold. Fast.\n\nRemember your oath. Remember what it means to serve this nation, not a political faction. But be smart. Protect yourselves.\n\nHow to Stay Safe While Standing Your Ground\n\n1. Stay Under the Radar\n\n   •   Avoid public criticism, especially in official channels or on social media. Assume anything you say online can and will be traced back to you. This includes Reddit.  Could people diss out who you are based on what you’ve shared here?\n\n   •   In public, maintain a neutral—or if necessary, mildly supportive—demeanor.\n\n   •   Remove bumper stickers, yard signs, or anything that identifies your political leanings. Your spouse and family should also be cautious about social media.\n\n2. Choose Your Allies Carefully\n\n   •   There are like-minded people in the ranks, but trust must be earned. The walls have ears.\n\n   •   Be discreet in conversations. Small, non-committal statements can help gauge where others stand before you reveal your own views.\n\n3. Document and Observe\n\n   •   The purge of JAG officers and Inspectors General is no coincidence; it is a deliberate attempt to remove oversight and silence whistleblowers.\n\n   •   If you witness illegal actions or corruption, document everything carefully.\n\n   •   If necessary, leak information to trusted external channels—investigative journalists, oversight committees, or trusted Congresspersons.\n\n4. Stay Informed and Resilient\n\n   •   Propaganda thrives in the absence of truth. Read critically and verify information.\n\n   •   Maintain morale by finding purpose in small victories and supporting fellow shipmates.\n\n   •   Stay physically and mentally prepared for the challenges ahead.\n\nThe Line That Must Never Be Crossed\n\nI remain hopeful that we will never reach the point where service members are ordered to carry out unlawful or immoral directives. I pray that our leadership will intervene before that line is crossed.\n\nBut history has shown that hope alone is not enough. If that day ever comes, we will need men and women in uniform who stand for the rule of law, not the rule of fear.\n\nTo them, I say again: Hold fast.",
    "score": 877,
    "url": "https://reddit.com/r/Military/comments/1iwu6kb/oped_hold_fast_a_recently_retired_senior_naval/",
    "created_at": "2025-02-24T04:59:30.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1i6btno",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "PSA to Veterans: Please Stop Bragging About Your Disability.",
    "text": "Edit: Since there seems to be a misunderstanding. I like to state that this happened on Twitter.\n\nEdit 2:Bragging typically involves boasting in a way that tries to elevate oneself, often to make others feel lesser. On the other hand, a discussion is just sharing facts or experiences without that sense of superiority.\n\nHey everyone, I wanted to share something that’s been on my mind after a frustrating (but also kind of hilarious) interaction with a fellow veteran online. I think it’s important we all take a second to think about how we talk about our VA disability compensation, especially in public spaces where civilians are watching.\n\nHere’s what happened:\n\nThis veteran was bragging about getting $3,000 a month for their 90% disability rating (which is already exaggerated because, let’s be real, that number doesn’t add up unless you’ve got a bunch of dependents or extra compensation and they admitted to be single and childless). They were flaunting it like a badge of honor, even saying they didn’t need the money and just save it. Meanwhile, the thread they were commenting on was full of civilians venting about their financial struggles.\n\nWhen I pointed out, as a fellow disabled veteran, that not everyone is as fortunate to receive compensation and that bragging like this only creates resentment, they doubled down. They went on about how they “earned” it and how other veterans who don’t get benefits just need to “try harder.”\n\nHere’s the kicker—they also tried to act like their disability was purely physical, saying, “How do you know it’s mental and not physical?” But their behavior made it painfully obvious. Let’s be honest: if you’re bragging like this and saying you don’t need the money, there’s a good chance your mental health rating is doing the heavy lifting. No one missing a leg or dealing with chronic physical pain is out here saying, “I don’t even need the money.”\n\nLook, I get it—we all handle our disabilities differently, and we’ve earned the benefits we receive. But bragging about it in public spaces is not only tone-deaf—it’s dangerous. Civilians already don’t fully understand the VA system, and seeing this kind of behavior only makes them resent veterans more. It makes us all look bad. Worse, it gives ammo to people pushing for budget cuts to VA programs by reinforcing the idea that “veterans don’t really need it.”\n\nSo here’s my PSA:\n\nDon’t brag about your disability rating or how much money you get.\n\nDon’t say you don’t need it. Even if you’re fortunate enough to save the money, remember that others rely on it to survive.\n\nBe mindful of the context. If you’re in a public thread full of civilians struggling, that’s not the time to flex your benefits.\n\n\nWe owe it to ourselves and to each other to handle these conversations with tact and humility. If you’ve got something to say about your rating, keep it in spaces where it’s relevant and understood—like veteran forums—not in public threads where it just creates hostility.\n\nLet’s not ruin the system for those who genuinely need it.\n\n\n",
    "score": 853,
    "url": "https://reddit.com/r/Veterans/comments/1i6btno/psa_to_veterans_please_stop_bragging_about_your/",
    "created_at": "2025-01-21T05:45:18.000Z",
    "num_comments": 227
  },
  {
    "id": "reddit-1nuv8ib",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "On Pete Hegseth’s incompetence…",
    "text": "Some folks have dropped in my inbox today suggesting that I repost this. It’s seems relevant to more than a few people. Essentially, the SECDEF is in over his head. \n\n\nhttps://www.reddit.com/r/Military/s/AEbQvsIiCy\n\n\nWhat's the deal with Pete Hegseth? Am I the only veteran that recognizes this guy's personality?\n\nCan we have a candid discussion on the type of guy SECDEF Hegseth appears to be? Specifically, I’d like to lead off the conversation around his high bar being mediocrity.\n\n Let’s start with his military career. He was an infantry platoon leader for a time. Then it appears he was tasked at the S-9 (Civil Affairs). Then it appears he volunteered to teach COIN in Kabul. Then IRR. Then ARNG in DC.\n\n Let’s unpack this. He’s an infantry officer. But he didn’t complete Ranger School, Airborne School, or Air Assault School – and he was assigned to the 101^(st). Why not? I spent the vast majority of my time in the Army in the heavy side of things (1AD/1CD/18ABN), and as a medical service officer, I completed both Airborne and Air Assault. I struggled to think of a single infantry officer who I’ve met that hasn’t completed at least one of the three – and I could only think of one.\n\nAny junior officer that’s ever served in a BCT can tell you the #1 captain, if not in command, is the AS3. The lower performing folks are put in charge of made up shops – Civil Affairs being an ‘imaginary’ shop in most battalions. Our battalion’s S-9 was staffed by a never-going-to-get-promoted fat Captain and a SFC with DUI and EO problems. Speaking to former peers, that’s the general consensus – the folks in the ‘made up’ shops are the lowest performers. Why was LT/CPT Hegseth put in that position?\n\nThen it appears that CPT Hegseth volunteered to be an instructor of some sort at the COIN academy in Kabul where he taught one class. Again, these classes are typically taught by post-command Captains/early Majors and Master Sergeants. Why would someone with no real experience in COIN be teaching COIN at a theater level? Why would a Captain be working at theater-level if not to keep him out of trouble or because no one would pick him for their team?\n\nThose are the things we know about. Let’s talk about some things that are missing. His highest level of leadership experience appears to be Platoon Leader. His most impactful job appears to be a battalion-level Civil Affairs OIC/AOIC position. In the civilian world, even FoxNews relegated him to the weekend morning show – the doldrums of TV ratings. He apparently parted ways with the charity(s) with which he was affiliated over some alcohol related incidents – and the charities weren’t terribly impactful either.\n\nAfter reading the signal conversation, it reads like a battalion/brigade battle captain briefing his boss. The granularity of the detail and tick-tock of it make it seem like he’s trying to brief an operational leader – not a group of strategic folks. It’s no wonder there aren’t many people chiming into the conversation – they were likely ignoring it because it just wasn’t being briefed to their level. It’s almost like he was trying to get attention – fishing for compliments on DoD’s actions. I don’t know why, but it just sounds so… junior… so inexperienced.\n\nThis is a guy that reads, on paper, like he aspires to mediocrity. He’s the guy that gets 300 on the PT test, does just enough to get out of writing an OPORD, has his subordinates writing their own NCOERs/OERs, manages to always have rumors of him sleeping around but never gets caught. It’s almost like he’s the guy that likes the idea of being in the military without actually *being* in the military. He’s the guy that volunteers to be rear-D commander, but the decision authority makes him the rear-D XO because he can’t be trusted with responsibility. He's the guy that volunteers to be an infantry officer but doesn't want to do any of the \"hard\" schools.  I feel like I know the personality type, because we’ve all worked with them. I think we all know a Pete Hegseth and none of us would call them \"leadership material.\"\n\nSo what’s the deal? Does no one in DoD at the strategy-level see that this guy is… dangerously meh?\n\nEdit: formatting.\n\nEdit 2:  \nMy inbox asked: what would you expect his career to look like?\n\nFor a 20-year infantry officer in his generation, at bare minimum, I would expect airborne or air assault, and ranger school partnered with a company command.\n\nTo keep him in line with his peers...  \nI would expect battalion and/or brigade S-3/XO/DCO time, a significant assignment on a G/J/C-staff, and battalion command. I would expect some time spent in Vicenza or Bragg and the Pentagon or a MACOM. I would expect CCC and ILE.\n\nTo put him ahead of his peers...  \nI would expect to see some SOC time, multiple successful deployments in UOA in leadership positions, maybe a nominative assignment, White House/Congressional fellowship, or a very deep resume of regiment time.",
    "score": 812,
    "url": "https://reddit.com/r/Military/comments/1nuv8ib/on_pete_hegseths_incompetence/",
    "created_at": "2025-10-01T01:28:51.000Z",
    "num_comments": 246
  },
  {
    "id": "reddit-1pp2svb",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Dating as a rated veteran sucks",
    "text": "Went out on a date last night after 2.5 years of not dating and it reminded me why. I met him at the gym, spoke a few times he asked me out to go dancing last night, which was fun but afterwards we got coffee and went to walk to see the lights and I made a comment about having been overseas nearly 6 months last year with my son and spent Christmas in Iceland, which led to him asking me what I did for a living and I panicked and just said I worked from home which he paused walking and looked at me and said “you do onlyfans?” And I was like “where would you get that from!?” He’s like “look at you, what else does it mean? Insurance? HA.” I got all red and embarrassed and said “no I don’t work I live off my Va disability and my late spouses and take care of our son.” And he started to lecture me on not being honest and how does one just not work etc etc and how lucky it must be to just exist and travel without financial stress…I think the worst part of the date was when he asked how my husband died and I made a joke about how I guess not doing the dishes right away can make a guy snap I guess. He didn’t find it remotely funny but I think it’s because he’s a banker and lacks that dark humor bone. Someone here said something about making an app for us DVs to date lol where is it? Can I download it? Sigh. Any other shitty first dates you guys wanna share? ",
    "score": 797,
    "url": "https://reddit.com/r/Veterans/comments/1pp2svb/dating_as_a_rated_veteran_sucks/",
    "created_at": "2025-12-17T17:40:06.000Z",
    "num_comments": 628
  },
  {
    "id": "reddit-1ipzxla",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "VA Vet Centers - DOGE victim",
    "text": "For those who may not be familiar, VA Vet Centers provide confidential, community-based counseling and support to Veterans, service members, and their families—at no cost. We help with transitioning to civilian life, managing PTSD, and finding a safe space to heal. There are no service-connected disability requirements and no red tape—just support when and where it’s needed.  Many Vet Center staff, like myself, are Veterans. \n\nBut here’s something that isn’t being widely talked about: The VA/DOGE just eliminated all probationary Program Support Assistant (PSA) positions at Vet Centers nationwide.\n\nPSAs are the backbone of Vet Center operations. They are often the first voice a Veteran heard when they called and the first face they saw when they walked through the door. They handled scheduling, administrative support, and kept things running smoothly so that counselors could focus on serving Veterans. Their work made a real difference in the experience Veterans had when seeking help.\n\nNow, with their positions eliminated, Vet Centers are left scrambling to cover these responsibilities. Counselors and other staff—already stretched thin—must now juggle administrative tasks on top of their clinical work. This directly impacts the quality and accessibility of services for Veterans.\n\nIf you or someone you know relies on a Vet Center, be aware that changes like this can affect the experience. And if you believe cutting essential staff from a crucial Veteran support program is a mistake, let your voice be heard. Contact your representatives, share your concerns, and help advocate for the resources Veterans deserve.\n",
    "score": 731,
    "url": "https://reddit.com/r/Veterans/comments/1ipzxla/va_vet_centers_doge_victim/",
    "created_at": "2025-02-15T12:02:33.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1jdq215",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "You don’t look like a Veteran",
    "text": "So I’m a black dude, I used to have long locs(cut em a while back)…I primarily kick it with other vets for obvious reasons…but when we’re out at a bar or whatever and we’re talking about time served just reminiscing about our prime days more of than not some random mf that never served will butt in and say “well you don’t look like a Vet!” So my question to yall…have yall experienced this? And WHAT THE FK DOES A VETERAN LOOK LIKE?! I’m sorry I don’t have a blonde buzz cut with blue fkn eyes…but why is it always the same shit…I never understood this and it pissed me off having served and to have some fuckin goofball utter these words.",
    "score": 729,
    "url": "https://reddit.com/r/Veterans/comments/1jdq215/you_dont_look_like_a_veteran/",
    "created_at": "2025-03-17T22:40:42.000Z",
    "num_comments": 583
  },
  {
    "id": "reddit-1kjc15m",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Stolen Valor - Congressman Cory Mills (FL-7). Career based on lies.",
    "text": "The article (published by NOTUS.org) is free, but requires email to make an account.\n\nMills has a Bronze Star supposedly for savings lives in Iraq at great risk to his own life.  Multiple soldiers have corroborated that Mills fabricated his involvement in the events.\n\nI could find no evidence that Mills ever spent a day in Iraq or Afghanistan while in the Army (1999-2003). Potentially he spent time in a combat zone as a civilian contractor with DynCorp after 2003.\n\nThe House Committee on Ethics has an open investigation since March 27^(th) 2025, but its not clear the scope of the investigation. The stolen valor concerns around Mills have been public for a long time, but this new story May 5^(th) 2025 is the most corroborated accounts in one article.",
    "score": 720,
    "url": "https://reddit.com/r/Military/comments/1kjc15m/stolen_valor_congressman_cory_mills_fl7_career/",
    "created_at": "2025-05-10T14:49:19.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1nqh3k6",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "This is actually how bad the job market really is regardless if you’ve served or not.",
    "text": "Despite having 7-8 years of food service experience which includes my time as a CS in the Navy, it wasn’t even good enough for a part time job at Waffle House. I’m going on 6 months unemployed and I either get ghosted or receive these bullshit emails. I’m under two temp agencies and have not gotten a consistent shift out of either of them. WTH is really going on?",
    "score": 701,
    "url": "https://reddit.com/r/Veterans/comments/1nqh3k6/this_is_actually_how_bad_the_job_market_really_is/",
    "created_at": "2025-09-25T20:06:06.000Z",
    "num_comments": 395
  },
  {
    "id": "reddit-1j4u5ed",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "The VA is what the rest of our nation's health and medical care should be striving for.",
    "text": "In recent months I have dealt with some debilitating physical issues. The VA in White River Junction has been helpful, prompt, and effective. There is nothing in the private insurance system led hospitals that I can say positively compares.\n\nI make that last statement from 30 years of helping folks access and manage their health care. I've been in a lot of very pretty hospitals that line you up, sit you down, and make you wait endless hours. In contrast, that ugly VA plant in WRJ gets one in to the appointment and out. Show up early? No problem - if there's time, there's you.\n\nThe VA is what the rest of our nation's health and medical care should be striving for.",
    "score": 679,
    "url": "https://reddit.com/r/Veterans/comments/1j4u5ed/the_va_is_what_the_rest_of_our_nations_health_and/",
    "created_at": "2025-03-06T12:16:32.000Z",
    "num_comments": 226
  },
  {
    "id": "reddit-1nt329j",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Hey, y'all. We need to take a moment and catch our breath.",
    "text": "Alright ladies, gentlemen, enbies, and Marines.  Gather round and pop a squat.  We need to have a lil heart to heart.  This doesn't apply to most of you, but I'm betting it applies to someone you're acquainted with.\n\nIn the last 24 hours, America has had two separate incidents involving Iraq veterans shooting up civilian targets.  This isn't okay.  \n\nAs of this writing, the motivations of the shooters is unknown, but let's be real, there's absolutely *ZERO* reason for someone to justifiably unload into a crowded civilian structure, but this is especially true of veterans.  We don't farkin kill helpless civilians.  Period.  \n\nQuite the contrary: our purpose is to *protect* civilians from this kind of attacks.  How many of us literally stood as human shields between hostile insurgents and unarmed civilians when we were overseas?  \n\nLook, we all need to stop, take a step back from everything, and take a few deep breaths.  I understand that stress and anxiety levels in the veteran communities are high right now.  There's a lot of uncertainty on the horizon, and a lot of us are definitely feeling the old, familiar weight of the world once again bearing down on our shoulders.  But we need to keep each other accountable.  Reach out to your brothers, sisters, and uncategorized.  Check on your peoples.  Remind them they're loved and that things are still okay and they're not alone.  \n\nNow, more than ever, we need to be unified... especially as the rest of the nation continues to be further divided.  \n\nTake care of yourselves.  Take care of each other.  Find yourselves a little bit of peace this week.  Reach out if you're struggling.  \n\nI love you.  It's gonna be okay.  We can make it through anything so long as we're together.",
    "score": 670,
    "url": "https://reddit.com/r/Veterans/comments/1nt329j/hey_yall_we_need_to_take_a_moment_and_catch_our/",
    "created_at": "2025-09-28T23:34:59.000Z",
    "num_comments": 178
  },
  {
    "id": "reddit-1ifcvf7",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Discussion: I was just told the GI Bill is welfare by a Texan.",
    "text": "For the first time, I experienced discrimination—not because of my skin color or a general dislike of the military, but because someone sees Veterans using the GI Bill as being on welfare. According to them, since we’re \"getting handouts from the government,\" we can’t understand how expensive school is.\n\nI’ve never come across this particular reason to hate on Veterans before.\n\nHave any of you ever experienced wild or unexpected discrimination for being a Veteran?\n\nOr have you been discriminated against before they knew you were a Veteran? ",
    "score": 652,
    "url": "https://reddit.com/r/Veterans/comments/1ifcvf7/discussion_i_was_just_told_the_gi_bill_is_welfare/",
    "created_at": "2025-02-01T18:31:55.000Z",
    "num_comments": 436
  },
  {
    "id": "reddit-1i0ez8f",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Is anyone else living a better life post military service? ",
    "text": "Honestly, I came from very little. I was raised by a single father and born with pretty noticeable disability which led to a childhood of ridicule, torment, and self hatred. After serving in the U.S Army, I left with a sense of honor, confidence, self worth, and pride. I overcame hardships that I never could have thought possible. I was able to use my GI Bill and not only become the first graduate in my family, but I graduated with top honors as well. I've been able to use that degree, and the principles the Army instilled in me, to save lives during the pandemic and almost every day since. I have a quality of life that I never thought possible. It was a lot of hard work, but none of this would have been possible without the military giving me a chance. ",
    "score": 645,
    "url": "https://reddit.com/r/Veterans/comments/1i0ez8f/is_anyone_else_living_a_better_life_post_military/",
    "created_at": "2025-01-13T14:19:54.000Z",
    "num_comments": 255
  },
  {
    "id": "reddit-1isfn02",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "I am thinking about ending it",
    "text": "prior active duty Army. Have been on Reddit for years and have seen many cries for help. I don’t know what this is honestly. I’ve fucked so many things in my life. Married with two boys. There are so many benefits to me leaving it all. They get 7 figures in insurance and don’t have to worry. There will be questions but I’m realizing that I am actively planning for it. Going to an AA meeting today - 3 years sober next month. Don’t know why I posted this.\n\nUpdate\n\nIm not sure how to post an update but here goes. I posted that today and life happened. Got busy at work, busy at home and then I finally got around to catch my breath and saw all of the comments and DMs. You people hit me right in the chest.  So many amazing, stop me in my tracks comments. Thank you. Thank you - from the depths of my soul and for my children.  This is the darkest hole I have ever been in but I did got to an AA meeting today at noon and it was good to speak there. I talked to my sponsor and also texted my best friend.  I’m hopeful that another nights rest and solid meals tomorrow will help square me away more. I’m somewhat out of crisis mode. It was 8 days of a dive bomb into darkness but you all helped me pull up. Thank you and bless you for taking the time out of your lives for me.",
    "score": 613,
    "url": "https://reddit.com/r/Veterans/comments/1isfn02/i_am_thinking_about_ending_it/",
    "created_at": "2025-02-18T15:44:59.000Z",
    "num_comments": 288
  },
  {
    "id": "reddit-1hp6h88",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Jimmy Carter, Navy Veteran and former Commander-In-Chief, passes at 100",
    "text": "(From a News article)\n\nCarter became a submariner in the Navy, where he was spotted by Adm. Hyman Rickover, who is considered the father of the U.S. nuclear submarine program. Rickover selected Carter as an aide and assigned him to Schenectady, New York, where the family relocated while Carter studied reactor technology and nuclear physics at the Union Graduate College. Eventually, Carter would become a senior officer of the USS Seawolf, the United States’ second nuclear submarine.\n\nSpeaking of Rickover in a 1984 CBS’s “60 Minutes,” Carter said, “There were a few times when I hated him, because he demanded more from me than I thought I could deliver.”\n\nCarter appeared set for a stellar military career under Rickover’s tutelage, but in 1953, he left the Navy after the death of his father, returning to Georgia to run the family peanut business.",
    "score": 602,
    "url": "https://reddit.com/r/Veterans/comments/1hp6h88/jimmy_carter_navy_veteran_and_former/",
    "created_at": "2024-12-29T21:33:37.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1o1f7nl",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "So tired of people hating on my benefits",
    "text": "I currently live with my brother and we currently share a 2 bed 2 bath apartment. Due to my VA disability compensation, I agreed to split rent 60/40 with the bonus being I get the master bedroom and covered parking spot. However, my brother keeps saying I should pay more of the rent or bills since my “free” money covers my half of the rent while he needs to dedicate at least 40% of his monthly income to rent alone. \n\nI care for him but also want to tell him that he can still join the army and bust his back. \n\nA family friend named John also often criticizes me for collecting benefits. John is an older man who’s close to collecting social security. John always asks how I’m collecting disability compensation when I’m “clearly not disabled.” I try to explain to him that just cause I’m not in a wheelchair or missing a limb doesn’t mean I’m not hurt or suffering from illness. \n\nJohn claims that “you were just fine a few years ago. So all this stuff suddenly started hurting?” I again try to explain that he’s not with me 24/7 and I’ve dealt with pain, sleep issues and mental issues for years and only started collecting compensation after avoiding it for years. \n\nI then turn it on him and say he’s about to start collecting social security on top of his day job and he says that’s different because he’s “earned” those benefits. \n\nAnd please no snarky “that’s why you keep your benefits to yourself” comments. I realize that now but back then, I didn’t think anyone would’ve offended by me collecting benefits. \n\nSorry fam just venting here. Hope you’re well all. ",
    "score": 592,
    "url": "https://reddit.com/r/Veterans/comments/1o1f7nl/so_tired_of_people_hating_on_my_benefits/",
    "created_at": "2025-10-08T16:23:55.000Z",
    "num_comments": 499
  },
  {
    "id": "reddit-1nv8cht",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Pete Hegseth Is Living the Dream",
    "text": "\"There is a certain kind of Army officer who, after the excitement of company command, finds his career stalled, and who perhaps leaves the service as a major in the National Guard filled with bitterness and resentment. He may then dream of one day being in a position to make all the superior officers who failed to appreciate his leadership qualities, his insight, his sheer fitness stand to attention and hear him lay down the law about what it is to be an officer, and threaten to fire those who do not meet *his* standards. In this respect, and this respect only, on that stage Pete Hegseth was living the dream.\"\n\n  \n[https://www.theatlantic.com/ideas/archive/2025/09/pete-hegseth-quantico/684423/?gift=j1oO8eedRcPJzo3QUxPxQwp2TWdJCRqG95XRiUmYX2Y&amp;utm\\_source=copy-link&amp;utm\\_medium=social&amp;utm\\_campaign=share](https://www.theatlantic.com/ideas/archive/2025/09/pete-hegseth-quantico/684423/?gift=j1oO8eedRcPJzo3QUxPxQwp2TWdJCRqG95XRiUmYX2Y&amp;utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=share)\n\n",
    "score": 585,
    "url": "https://reddit.com/r/Military/comments/1nv8cht/pete_hegseth_is_living_the_dream/",
    "created_at": "2025-10-01T13:33:54.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1nwatlv",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "SecWar's new policies are dangerous",
    "text": "I’m a year into retirement after 20 years in the Navy. The best gift the military gave me was the opportunity to live and work with a true cross-section of America outside of my small hometown. Traveling the world with a diverse and inclusive force set my frame of reference for what this country is, for all its faults and merits. What I see now is the SecWar (is that a thing?) is trying to destroy that for future generations.\n\n# From the transcript ([Source: war.gov](https://www.war.gov/News/Transcripts/Transcript/Article/4318689/secretary-of-war-pete-hegseth-addresses-general-and-flag-officers-at-quantico-v/))\n\n**Universal Clean Shave:**\n\n&gt;*\"If you want a beard, you can join Special Forces. If not, then shave… Telling someone to shave … that's exactly the kind of discrimination we want.\"*\n\nTargets black men. Pseudofolliculitis Barbae (PFB) is a medical condition that affects 45-85% of male African American servicemembers ([Source: Oxford University](https://academic.oup.com/milmed/article/186/1-2/e52/5948064)). I remember when NAVADMIN 071/19 came out, pushing guys to choose between painful laser surgery or getting kicked out. It was described to me as 1,000 rubber bands snapping on the face. The lesions were unsightly.\n\n**Gender Neutral fitness standards:**\n\n&gt;*“Today, at my direction, each service will ensure that every requirement for every combat MOS, for every designated combat arms position returns to the highest male standard only”*\n\nTargets women. The \"highest male standard\" is a Trojan horse for gender-neutral PT standards across the force, which will disproportionately force out women, especially older senior leaders and those returning from maternity leave. In 2016, when the Navy was losing too many experienced sailors, it loosened body fat rules to retain them ([Source: Military Times](https://www.militarytimes.com/news/your-military/2016/03/06/navy-loosens-body-fat-rules-to-retain-sailors/)). If standards get relaxed to keep people in, it can become stricter to boot people out.\n\n**Bad leadership can be excused:**\n\n&gt;“*But you should not pay for earnest mistakes for your entire career. And that's why today, at my direction, we're making changes to the retention of adverse information on personnel records that will allow leaders with forgivable earnest or minor infractions to not be encumbered by those infractions in perpetuity.*”\n\n&gt;*“And that's why today, at my direction, I'm issuing new policies that will overhaul the IG, EO and MEO processes. I call it the no more walking on eggshells policy. We are liberating commanders and NCOs. We are liberating you.”*\n\nEnables shitty leaders. I used to run a first LT division, which essentially became the people dumping ground of the waterfront. About half were women with injuries after giving birth, and the other half were Sailors who were suicidal. A common theme with suicidal people was rape. This “direction” will enable those assholes.\n\n**Sexual Assault:** The DoD's own FY2024 report documented **8,195 reports of sexual assault** ([Source: SAPR.mil](https://www.sapr.mil/reports)).\n\n**Suicide:** The DoD reported **523 service member suicides in 2023** ([Source: war.gov](https://www.war.gov/News/News-Stories/Article/Article/3965617/dod-officials-underscore-long-term-commitment-to-suicide-prevention/)).\n\n**LGBTQ+ Harassment:** LGBTQ+ service members make up only 12% of the force but account for a staggering **43% of all sexual assault victims** ([Source: RAND Corp](https://www.rand.org/pubs/research_reports/RRA1390-1.html)).\n\n**Redefining \"Toxic\":**\n\n&gt;“The definition of toxic has been turned upside down, and we're correcting that. That's why today, at my direction we're undertaking a full review of the department's definitions of so-called toxic leadership, bullying and hazing, to empower leaders to enforce standards without fear of retribution or second-guessing.”\n\nIf the above doesn't work, not re-enlisting will. The end result is a military of white males who are, at best, \"ok\" with their surroundings.\n\n**TLDR:** As a 20-year Navy vet, I believe Sec. Hegseth's new policies are not about basic military standards, but about whitewashing the military IAW Project 2025.",
    "score": 584,
    "url": "https://reddit.com/r/Military/comments/1nwatlv/secwars_new_policies_are_dangerous/",
    "created_at": "2025-10-02T17:52:20.000Z",
    "num_comments": 107
  },
  {
    "id": "reddit-1nmrg1z",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Pentagon takes step toward potentially privatizing commissaries",
    "text": "Commissary officials have taken the first step toward the potential privatization of the military grocery stores, seeking input from the commercial grocery industry on whether they could take over the operation of 178 commissaries across the continental United States, Alaska, Hawaii and Puerto Rico.\n\nThe Defense Commissary Agency released an official Request for Information, or RFI, on sam.gov, the federal government’s contracting site, on Friday. It’s a preliminary step before a Request for Proposals could possibly be issued.\n\n“The purpose of this RFI is to determine whether commercial grocery operators and investment firms are both interested in and capable of assuming commissary operations, with no government subsidy or with a materially reduced subsidy, while preserving the critical military benefit of a 23.7% average savings for authorized patrons,” commissary officials stated in an announcement Friday.\n\nCommissary stores receive more than $1.4 billion annually in taxpayer dollars to cover operational costs, including salaries and other costs, which enables the stores to provide the commissary benefit at a savings to patrons.\n\nThe request is the result of the Defense Department’s April 7 memorandum, which directs all functions that are not inherently governmental to be prioritized for privatization. It specifically cites retail sales and recreation as examples.",
    "score": 535,
    "url": "https://reddit.com/r/Military/comments/1nmrg1z/pentagon_takes_step_toward_potentially/",
    "created_at": "2025-09-21T13:05:12.000Z",
    "num_comments": 156
  },
  {
    "id": "reddit-1owfx89",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Met a real life ‘almost joined’ today",
    "text": "Guy in his 60s came out to give me a quote on garage floor today. Seemed nice were talking he saw my veteran plates and then it began…. How many benefits we get, how he almost joined and how he would have retired in 2002 and since it was before any wars he wouldn’t have deployed and just did his time. When he said how great of a career choice it is for someone with no direction in life and then you’re set up for life, honestly it felt offensive a bit. Tried to tell him a little bit sacrifice involved to get these benefits, but the almost joined of course knew better… anyway I thought these people were kind of made up, like are there really these not self aware individuals? Yeah there are! Not getting my business ! ",
    "score": 526,
    "url": "https://reddit.com/r/Veterans/comments/1owfx89/met_a_real_life_almost_joined_today/",
    "created_at": "2025-11-13T23:02:22.000Z",
    "num_comments": 177
  },
  {
    "id": "reddit-1jhnhod",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "‘Boggles the mind’: US defense department slashes research on emerging threats",
    "text": "Terminated projects include studies on the implications of AI in combat and how extremism spreads online.\n\nWhat are the implications of allowing artificial intelligence (AI) to make critical decisions about life and death in combat? That’s a question that Nicholas Evans, a social scientist at the University of Massachusetts Lowell, was hoping his research could answer — until funding for his grants was cut by the United States Department of Defense (DoD) this month.\n\nThe grants were among 91 social-science studies terminated by the DoD, including many that were part of the flagship Minerva Research Initiative, which supports basic social-science research so as to better understand emerging threats to national security.\n\n“One of the brilliant parts” of Minerva is that it takes “the notion of security broadly,” says Leonardo Villalón, a political scientist who studies the Sahel region in Africa at the University of Florida in Gainesville. Minerva grants fund research on global dynamics such as violence, instability, natural catastrophes, human displacement and migration, he says.\n\nThe defense department stated in a press release that it was “scrapping its social science research portfolio as part of a broader effort to ensure fiscal responsibility and prioritize mission-critical activities”. Termination notices, seen by *Nature*, state that the grants no longer served DoD’s “program goals or agency priorities”.\n\n“The big challenge”, says Evans, “is that there is almost nowhere else in the United States where you can get two and a half million dollars to do social-sciences research, and that limits our ability to get funded.” He and his collaborators received US$5.3 million in research grants in 2021 and 2024, as part of Minerva. With the funding cut, he will lose US$4.3 million.\n\n# National interest\n\nThe Minerva initiative was launched in 2008, and grants are managed by research offices run by the army, air force and navy. A portion of the funds go towards educating students at US military schools and academies in key areas of the social sciences, and many of those grants have also been terminated.\n\nNeil Johnson, a physicist at George Washington University in Washington DC, received termination notices for two grants, each worth about $2.5 million. One of them, close to the end of its five-year term, supported research on how threats, hate and extremism spread through online and offline social networks. The other focused on security threats along national borders.\n\n“The rationale was really weird,” says Johnson. For years, he has participated in calls and briefs at DoD agencies. Among other things, he has advised intelligence officers at military bases of his research findings, from the weaponization of health to gun violence. Now that all stops, he says.\n\nSpending money on military preparedness — on armaments and technology, for example — but not on understanding the nature and causes of potential military conflicts is incredibly short-sighted, says Kathy Baylis, a development economist at the University of California, Santa Barbara. “It kind of boggles the mind,” she says. The Minerva Research Initiative accounts for a fraction of the DoD’s budget. In its 2024 budget request, the department requested $64.3 million for Minerva out of a total budget of $842 billion.\n\nBaylis has also had her Minerva grant terminated. Awarded in 2023, it enabled her to study the effects of climate shocks on food security in sub-Saharan Africa. It was initially guaranteed for three years, with an option of two more. Between the Minerva losses and cuts to grants from the US Agency for International Development, Baylis has lost roughly US$5 million over the past few weeks. Since then, she has been scrounging for money to pay salaries and working out ways to share the limited data that she and her team managed to collect. “They just wasted a whole pile of money that had been spent on research that can no longer be fulfilled,” she says.\n\nVillalón, who was studying the impact of climate hazards on societies in the Sahel, and how those communities were responding to changes, had already spent most of the $1.6 million awarded as a three-year grant in 2022. He and his team had only about $200,000 left over, which would have been used to support data analysis and publication.\n\n# What next?\n\nMany researchers are looking for alternative sources of funding, and some are discussing legal recourse with their universities.\n\nEthan Addicott, an economist at the University of Exeter, UK, whose terminated grant was supporting research on geopolitical tensions that could arise from warming oceans and movement of fish stocks, says students and postdocs recruited for these projects are in danger of losing their jobs as a result of the cut.\n\nThe terminations could also mean that researchers will seek funding from other nations that don’t necessarily have the same national interests as the United States, Addicott says.",
    "score": 421,
    "url": "https://reddit.com/r/Military/comments/1jhnhod/boggles_the_mind_us_defense_department_slashes/",
    "created_at": "2025-03-23T00:57:11.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1i9p6su",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Advice For Pete Hegseth",
    "text": "Atlantic columnist Tom Nichols, a retired Naval War College national security professor and #NeverTrump former Republican, reacts to the confirmation of the grossly unqualified Fox News host as our new SECDEF with some \"advice\" Hegseth will surely not follow. \n\n[America Is Now Counting on You, Pete Hegseth](https://www.theatlantic.com/politics/archive/2025/01/america-is-counting-on-you-pete-hegseth/681469/)\n\nDear Mr. Secretary,\n\nTradition dictates that I begin by congratulating you on your confirmation. You seem like a man who appreciates frankness, and so I will spare you empty decorum: It would be disingenuous of me to deny that I have been opposed to your nomination to lead the Department of Defense from the moment it was announced. But the Senate has voted, and you are now the leader of the most powerful military on the planet.\n\nRather than offer you empty congratulations, I hope you will accept—in the spirit of the love of country that I know we both share—some unsolicited advice. You face unique challenges: You are among the least qualified major Cabinet nominees in modern American history, you have no background in leading a large organization, and you come into office with serious questions about your character and fitness, even from some in your own party. I must tell you that I believe you should have told Donald Trump last fall that you could not, in good conscience, accept his offer.\n\nBut you did accept it, and so I write to you today not as a critic, but as a fellow American. I know—as you do—that your success is essential to the security and safety of our nation, and so all of us with something to offer owe you our best efforts, including our direct and honest views.\n\nI send these thoughts to you without partisanship or ill will: The time for that is over. We live in dangerous times and you cannot fail in your new duties. I have no interest in lecturing you about your personal life, or your reported use of alcohol. I have been through such struggles myself, and I believe that even—perhaps especially—in challenging moments, you will choose to approach your new responsibilities with both physical and intellectual sobriety.\n\nI worked in national security and defense affairs for nearly 40 years, including a quarter-century in which my responsibility was to educate American officers. I do not know how to be a Secretary of Defense, but based on my experience, I have three recommendations for you that I hope will contribute to a successful tenure leading America’s military.\n\nFirst, and most important, I implore you to listen to the men and women working for you who have served our nation. Listening is a sign of strength, Mr. Secretary, not weakness. Every bad senior leader I ever encountered in my career, including generals, admirals, and elected officials, all had the same flaw: Insecurity. They talked and opined and issued orders instead of listening. (From your own military days, you probably remember this expression: *They only had Transmit Mode, no Receive Mode.*) I know you’ve been charged with shaking up the Pentagon, but the dangerous world around us will not put their plans on pause if you get distracted by a superficial domestic culture war.\n\nYou will have the power of decision on almost anything that crosses your path, but you are not omniscient. You are surrounded by a wealth of experience and expertise. Yes, some of the people under you will not be happy about the election or your confirmation, but they respect the terrible burden you’re carrying, and they are there to help you. They share your love of country, and your sense of duty. Their success is your success. They are not the enemy. Hear them out.\n\nSpeaking of enemies, you must contend with the reality that you are entering office with almost no credibility with your opposite numbers in Moscow and Beijing (and elsewhere). I say this not as an insult, but to describe in plain terms the conditions you face abroad. I have long experience with the Russians, in particular, and while they will treat you with formal courtesy, make no mistake: These are hard and dangerous people who will have no respect for a former O-5 and talk-show host. I realize it is an uncomfortable truth, but defensiveness about this will only distract you from the work ahead.\n\nYou must cover a lot of distance with those opponents. Your previous skills as a public commentator will be of no help and in fact will prove counterproductive in such situations. You cannot bully and speechify your way to respect with such people; they are tough in a way that cannot be countered with macho posturing or rants about DEI. The facile charm that worked for you in public life will be a vulnerability in dealing with our enemies, who will seek to exploit every thoughtless word. The combative punditry that works so well on cable television in America might have helped you burn time during your confirmation hearing, but none of that will serve you well in negotiations or discussions with our dedicated foes. (It won’t do you much good talking to our allies, either.)\n\nInstead, you will find that you must rely on people who have been in the rooms you’ve never seen until now. You are not required to take their advice, Mr. Secretary, but when your counterparts call you, your staff will be able to assist you in ways you might not have considered. They can warn you about your opponent’s strategies—and weaknesses—before you even pick up the phone. Your previous career has rewarded bombast and bluster; now you will have to master judiciousness, restraint, and the strategic use of silence.\n\nFinally, I hope that you will leave behind the kind of rhetoric that brought you to prominence. I know that you gained this post by being a loyal soldier for President Trump. The truth is that most Americans—including the Americans who serve in the U.S. military—don’t really care nearly as much as you’d think about the cultural issues that brought you into the Trump administration. You are no longer a pundit or a provocateur: From today, your fellow citizens are trusting you with the lives of their children. (“Thank you for giving us your son,” a general told one of my friends whose boy, like you, went through ROTC. “We’ll take good care of him.”)\n\nThe rest of us are trusting you with all our lives. You could well be the last person to speak to the president before he decides to go to war—or considers using nuclear weapons. Partisan attachments will be meaningless at such moments.\n\nWhen I was barely 30 years old, I advised a Republican senator who was trying to decide whether to support President George H. W. Bush’s 1990 decision to go to war against Iraq in Kuwait. “Am I doing the right thing?” he asked me. At that moment, I felt as if the world had fallen on my shoulders. Nothing else mattered. “Yes, I think so,” I stammered. And then we spent hours in the gloom of a winter afternoon discussing his eventual vote to send young Americans into battle.\n\nYou will face decisions galactically greater than my one small moment with my boss 35 years ago. Some decisions you make will feel small to you, but they will have an impact on hundreds of thousands of people in the military community, and others will live with them long after you’ve left government service. More importantly, some of your answers may have existential consequences for humanity itself. The election and the speeches are over. The lives of millions—or perhaps billions—now depend on things you say that no one but the president might hear.\n\nYou are a man of faith, Mr. Secretary. We have that in common. And so I’ll close with my sincere wish that the Lord keep you and guide you in the days to come.",
    "score": 402,
    "url": "https://reddit.com/r/Military/comments/1i9p6su/advice_for_pete_hegseth/",
    "created_at": "2025-01-25T15:22:23.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1i8oac2",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "The U.S. Military Has Met Its Match: The Fat Gen Z’er",
    "text": "https://preview.redd.it/yxac19xenvee1.png?width=402&amp;format=png&amp;auto=webp&amp;s=537ca4151213b295ef012358222484f46e31886b\n\n**By Francesca Graham**\n\n**Published Nov 30, 2024**\n\nLt Col (Ret) Ryan Sweazey (Retired, Air Force – United States Air Force Academy), President and Founder of the [Walk the Talk Foundation,](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwalkthetalkfoundation%2Eorg%2F&amp;urlhash=daaR&amp;trk=article-ssr-frontend-pulse_little-text-block) authored this article. (Published November 30th, 2024)\n\nCheck out our Podcast, The Star Chamber, on: [Apple](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fpodcasts%2Eapple%2Ecom%2Fus%2Fpodcast%2Fthe-star-chamber%2Fid1782042858&amp;urlhash=Lf5F&amp;trk=article-ssr-frontend-pulse_little-text-block) l [Spotify](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fopen%2Espotify%2Ecom%2Fshow%2F6VaOHHycLS5fu0OAr5mXAJ&amp;urlhash=rpgk&amp;trk=article-ssr-frontend-pulse_little-text-block) l [YouTube](https://www.youtube.com/@TheStarChamberPodcast-q3h?trk=article-ssr-frontend-pulse_little-text-block)\n\nIf I had a nickel for every time in the last year plus that I’ve read how the military attributes many of its recruiting woes to out-of-shape Gen Z, I’d be able to treat myself to a nice steak dinner.  And each time I hear our DoD brain trust lament “woe is us, only X% of America is fit to join,” I must shake my retired head. Allow me this minute to pontificate on the “Great Satan” which is our out-of-shape youth:\n\nRed Flag Rule #1: Don’t Fight the Scenario!  \n\nThis was the first thing briefed at every [Red Flag](https://en.wikipedia.org/wiki/Exercise_Red_Flag?trk=article-ssr-frontend-pulse_little-text-block), an Air Force combat training exercise: fight the adversary, not the ruleset.  In other words, don’t waste time and energy fighting the boundaries that are put in place, instead, focus on fighting and defeating the enemy.  In the guise of this topic, there are some unavoidable facts that the military should not be fighting:\n\n\n\n1. America’s youth is not fit.\n2. America’s youth will likely continue to be less fit.\n3. America’s military must be manned; this is a no-fail mission.\n\n\n\nThis is not rocket surgery here.\n\nAmerica is changing.  Military leaders – you with all your Professional Military Education and your self-labeled “strategic visionary” LinkedIn by-lines – news flash: you have to change with America, you (and your legions of [non-vol’d recruiters](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwww%2Emilitary%2Ecom%2Fdaily-news%2F2023%2F11%2F01%2Farmy-suddenly-and-chaotically-told-hundreds-of-soldiers-they-have-be-recruiters-immediately%2Ehtml&amp;urlhash=ROx3&amp;trk=article-ssr-frontend-pulse_little-text-block)) can’t just impose your will on the nation’s youth (unlike the already-recruited youth you can and do impose your wills on).  In other words, stop fighting the scenario!\n\nThis is not unchartered territory here.\n\nWhen I entered the Air Force to be a pilot, no one asked me how well I could fly a plane.  When Army soldiers enlist, no one asks how well they can shoot a rifle.  Why?  Because the military trains their people to do those things.  So, if I can go from showing up off the street to flying an F-16, is it too much of a leap to expect our military to be able to train our recruits on how to exercise and have a healthy lifestyle?  With that being said, is it really that much of a calamity to have to lower standards for enlisting (insert indignant gasp here)? Despite its shortcomings, the U.S. military’s tactical prowess remains the best in the world, and this is because its training is the best in the world.  We can teach kids who have never flown to be single-seat 5th-Gen fighter pilots; surely, we can teach them how to do a push-up.\n\nAnd while we are on lowering standards…\n\nUpon entering the U.S. Air Force Academy in 1995, the eyesight requirements for me to become a pilot were incredibly strict.  You basically had to be able to see through walls to be “PQ” (pilot qualified).  Fast forward a mere 3 years and a major pilot shortage later and the Academy’s Commandant was nearly ordering people to go to pilot training with all sorts of waivers and relaxed standards being tossed out like candy.  And despite all those concessions, guess what happened?  People went to pilot training and excelled, as they had been all those years before – no jets falling out of the sky, or post-Lasik eyeballs exploding, or any other manifestations from the gloom and doom predictions from the nay-sayers.  So, this talk about adjusting standards to ensure a steady supply of recruits is nothing earth-shattering…we just need to do it…again.\n\n“We are suffering from a healthy economy”\n\nI love that line.  And it is here we get to the supply and demand discussion as it pertains to the military as a career.  In this case, military jobs are what is being supplied.  As for the demand, well, it’s headed down the toilet.  So, let’s say you are one of those out-of-shape Gen Z’ers and you’re considering what you want to do for a living, at least for the next few years.  In your eyes, the military is offering you the ‘privilege’ of perhaps going to war and being killed and/or maimed and/or traumatized.  Further, the military is ‘enticing’ you to forfeit some of your rights as an American while it tries to, and does, infringe on other rights you should have. Whether or not you go to war while in the service, you’re statistically more likely to be [raped or assaulted](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwww%2Eprotectourdefenders%2Ecom%2Ffactsheet%2F&amp;urlhash=LgSI&amp;trk=article-ssr-frontend-pulse_little-text-block) if you are a woman.  And if you do enter into the service, over 17 of you will, during or after your career, [kill yourself each day](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwww%2Ementalhealth%2Eva%2Egov%2Fdocs%2Fdata-sheets%2F2023%2F2023-National-Veteran-Suicide-Prevention-Annual-Report-FINAL-508%2Epdf&amp;urlhash=s8PR&amp;trk=article-ssr-frontend-pulse_little-text-block).  And with all that, what is the military’s ‘sales pitch’ to you: “You need to run faster in order to be considered worthy!”  Is it any wonder why so many kids give the military the middle finger!?  Succinctly put: the military is not creating any demand for their products (jobs). Far from it, in fact.\n\nIf they wanted to get in shape for the military, wouldn’t they?\n\nBut here’s the thing – if Gen Z wanted to work for you, wouldn’t they do what you asked?  I know I don’t think like an 18-year-old (well, mostly), but if someone told me that I had to run around a track 6 times to get the job I wanted, I’d have my ass at the track…and I don’t like running.  But kids aren’t doing that.  Why?  Not because standards are too tough or too high, it’s because they don’t want any part of our once-heralded profession of arms.  I chuckled the other day when I read that the Navy put out a pamphlet on how kids who have not yet enlisted can prepare for passing their PT test.  Cool product, Seamen.  Problem is – it’s not that they don’t want to run, it’s that they don’t want to join.  (I do feel sorry, however, for that sap O-4 staffer that missed his kid’s recital because he had to stay late to put that pamphlet together…I’m sure some O-8 took the credit, though.)\n\nMy friend “Deuce” used to tell me to think of things in extremes to help frame an issue.  So, here’s an extreme: if the military paid an E-1 $10,000,000 (that’s 10 million dollars) a year, how many fat Gen Z’ers would get into shape?  Is it unrealistic to think that many would?  And although that salary is absurd, it serves to convey this point: there is an extrinsic value that everyone places on most everything and entering the military is most definitely included in that calculus.  So, in all this discussion about recruiting woes and fitness and whatnot, how many times have we heard a military senior leader go to the Hill and lobby for higher wages for enlistees?  (And I’m not talking about [piddly-shit raises](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwalkthetalkfoundation%2Eorg%2Fpriorities-priorities-general-flag-officer-promotion-vs-competitive-pay%2F&amp;urlhash=wN2v&amp;trk=article-ssr-frontend-pulse_little-text-block) that can’t even keep pace with inflation, I mean like [actual](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwww%2Ebarrons%2Ecom%2Farticles%2Fpilots-american-airlines-delta-united-pay-3d0f7ba5&amp;urlhash=gRzF&amp;trk=article-ssr-frontend-pulse_little-text-block) [raises](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwww%2Ebarrons%2Ecom%2Farticles%2Fpilots-american-airlines-delta-united-pay-3d0f7ba5&amp;urlhash=gRzF&amp;trk=article-ssr-frontend-pulse_little-text-block).)\n\nCrickets.  \n\nI briefly worked for [Air Force General Mark Kelly](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwww%2Eaf%2Emil%2FAbout-Us%2FBiographies%2FDisplay%2FArticle%2F108818%2Fmark-d-kelly%2F&amp;urlhash=k4IL&amp;trk=article-ssr-frontend-pulse_little-text-block) who would say something to the effect of ‘we’ve relied solely on the patriotism of our military members for far too long.’  Poignant, no?\n\nA(nother) ‘Hearts and Minds’ defeat.\n\nLet’s not mince words here – the recruiting crisis is a conflict that our military is waging…and losing.  It is the easiest conflict we can and will ever fight for we have all the intel at our fingertips.  There is no fog of war, there is no unpredictable adversary…and yet, we are still pretty much getting our asses kicked.  But I don’t accept, and I hope you don’t either, our military’s sulk-in-the-corner response: quibbling about fat kids, or the economy, or BRAC (all the while yammering about how they [aren’t getting promoted fast enough](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwww%2Earmytimes%2Ecom%2Fnews%2Fyour-army%2F2023%2F11%2F14%2Farmy-secretary-fears-mid-career-officer-exodus-amid-promotion-holds%2F&amp;urlhash=sWEQ&amp;trk=article-ssr-frontend-pulse_little-text-block)).  This war doesn’t require a [McChrystal-like spaghetti chart](https://www.linkedin.com/redir/redirect?url=https%3A%2F%2Fwww%2Enytimes%2Ecom%2F2010%2F04%2F27%2Fworld%2F27powerpoint%2Ehtml&amp;urlhash=i8hV&amp;trk=article-ssr-frontend-pulse_little-text-block) to grasp – it’s pretty straightforward and here is the solution to it all:\n\n\n\n1. Compensate your people well.\n2. Treat them and their families well.\n\n\n\nYou do that, and they will do all the sit-ups and ammo-can-lifts you want them to.\n\n\n\n  \n[https://www.linkedin.com/pulse/us-military-has-met-its-match-fat-gen-zer-francesca-graham-st9oe](https://www.linkedin.com/pulse/us-military-has-met-its-match-fat-gen-zer-francesca-graham-st9oe)\n\n",
    "score": 398,
    "url": "https://reddit.com/r/Military/comments/1i8oac2/the_us_military_has_met_its_match_the_fat_gen_zer/",
    "created_at": "2025-01-24T05:26:07.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1n7klzg",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Divorce after retirement. Spouse couldn't adjust.",
    "text": "I retired less than a year ago and I'm getting divorced. My spouse couldn't adjust to me not being active duty anymore. \n\nI had a difficult career while I was in. I drank way too much, I smoked, I was extremely depressed and had suicidal thoughts more than I actually admit out loud. I tried medication and therapy while I was active but they didn't really do much for me then. I was miserable but she was happy. Her and the kids were always taken care of even if I wasn't the best husband and dad in the world.\n\nSince retirement though I've seen a lot of personal growth/improvement. I don't drink any more at all, I quit smoking and the meds and therapy seem to be working. Depression has lessened and no more suicidal thoughts. I picked up gardening and decorative painting as hobbies. I am way more engaged with my kids and I began taking my dogs out more and just things that normal people do. \n\nWhen I started getting better is when things started getting worse. She started demanding more. No matter how hard I worked at being a better person, no matter how much of a better person I became, it was never enough. I asked her to see her own therapist and she refused. She was steadfast that I was the problem and had all the problems. \n\nI managed to convince her to go to marriage counseling because maybe a third party could help me understand what she was trying to communicate. After a initial session we agreed that the counselor was a good fit for us. At that point I also authorized the marriage counselor to talk to my therapist so I could really tackle the problems she thought I had head on.\n\nTurns out that the marriage counselor and my therapist agreed that I was doing really well. Making great progress from who I was to who I am now. The counselor even told her that in session. Counselor suggested that she focus on herself with her own therapy.\n\nI don't think she was expecting to hear that because she really went off the deep end. She started stealing and abusing prescription pills, drained the bank account became verbally abusive to me and started to try to manipulate the kids against me. She then became physically violent to where police were called and she was arrested. \n\nThe marriage counselor, my therapist and my psychiatrist know the story and seem to agree  that my personal improvement after retirement somehow left her feeling some type of way about herself that she couldn't reconcile on her own. They've suggested that she needed me to be the one with the problems so she could feel better about herself, and once she felt exposed she lashed out.\n\nLike the title says, I'm divorcing her now. I'm curious if anybody else has a similar story.\n\nTL:DR Spouse didn't like the person I became after retirement. Getting divorced. Anyone else?\n\n\n\n",
    "score": 367,
    "url": "https://reddit.com/r/Veterans/comments/1n7klzg/divorce_after_retirement_spouse_couldnt_adjust/",
    "created_at": "2025-09-03T17:07:18.000Z",
    "num_comments": 110
  },
  {
    "id": "reddit-1oddr56",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "I feel helpless",
    "text": "USAF SSgt stationed overseas with over 6 years of service. I know I haven't been in that long, but I've seen my share of changes and political turmoil. But I have never felt this helpless and horrified by what is happening politically. I feel powerless as I watch the republic I served and the constitution I swore an oath to get slowly destroyed. I no longer feel any pride or desire to serve, especially under this administration. Has anyone with more experience ever felt this way in their careers? Is this administration unlike any before? I genuinely can't think of any administration in the last 50 or so years that was this blatantly corrupt and tyrannical. Thanks everyone, hope you are all holding up ok.",
    "score": 366,
    "url": "https://reddit.com/r/Military/comments/1oddr56/i_feel_helpless/",
    "created_at": "2025-10-22T16:53:46.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1ppguv5",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Trump announced a $1,776 'Warrior Dividend' for service members tonight. Here is the summary.",
    "text": "Update: Our team just read a memo confirming it is coming from the BAH pool. It’s a supplement to BAH, and even those members not receiving BAH who are eligible will also receive the Warrior Dividend (e.g., members overseas, junior enlisted in barracks, etc.). Members will still receive BAH.\n\nAccording to a senior administration official, the Warrior Dividend is actually a one-time basic allowance for housing stipend already approved by Congress.\n\nHere is the updated article: [https://mybaseguide.com/warrior-dividend](https://mybaseguide.com/warrior-dividend)\n\n\\---  \nJust watched the address. Here is the breakdown of the $1,776 payment announced tonight:\n\n**The Gist**\n\n* **What:** A one-time payment of **$1,776.00**.\n* **Who:** Announced for \"every service member,\" though Guard/Reserve specifics are pending official guidance.\n* **Funding:** Stated to be from surplus tariff revenues.\n* **Timeline:** Trump said checks are \"already heading out,\" but we are waiting on DFAS/Pentagon to confirm actual deposit dates.\n\n**Key Details**\n\n* **Not a Pay Raise:** This is separate from the 2026 pay raise, BAH, or BAS. It does not replace any existing benefits.\n* **Tax Status:** TBD. No official word yet on whether this is tax-free or taxed like a bonus.\n\n**What to watch for next**\n\n* Official DFAS drop date.\n* Clarification on Guard/Reserve eligibility.\n* IRS/DFAS guidance on taxes.",
    "score": 361,
    "url": "https://reddit.com/r/Military/comments/1ppguv5/trump_announced_a_1776_warrior_dividend_for/",
    "created_at": "2025-12-18T03:40:46.000Z",
    "num_comments": 206
  },
  {
    "id": "reddit-1kyftuy",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Completed 2 military basic trainings in under 16 months",
    "text": "Unique experience. I know of many people to serve in multiple branches, and heard of some to serve in every military branch. Might be a little specific, but did I complete 2 basic trainings in a quicker span of time than anyone? Is there any way of verifying? Kind of specific, but I find it interesting. ",
    "score": 347,
    "url": "https://reddit.com/r/Military/comments/1kyftuy/completed_2_military_basic_trainings_in_under_16/",
    "created_at": "2025-05-29T16:52:47.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1lm7r0j",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Good job Pete! You're a good helper!",
    "text": "I wonder how painful it is for career officers to have to listen to this guy, knowing he offers no experience, insight, or perspective.",
    "score": 299,
    "url": "https://reddit.com/r/Military/comments/1lm7r0j/good_job_pete_youre_a_good_helper/",
    "created_at": "2025-06-27T22:59:54.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1nl7gff",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Army cutting 6,500 aviation jobs in overhaul toward drones",
    "text": "The Army is slashing thousands of active duty pilots, flight crews, and helicopter maintenance jobs as the service begins a fundamental pivot towards unmanned drones for modern wars, officials told Task &amp; Purpose.\n\nThe service will begin cutting nearly 6,500 active duty aviation jobs in fiscal years 2026 and 2027 as part of the Army’s broader transformation initiative.\n\nThe Army currently has around 30,000 aviation branch soldiers, but “talent panels” scheduled for October will decide which officers and warrant officers will be retained and which will transfer to a different branch within the Army. The service will also decide whether to hold similar talent panels for its enlisted aviation soldiers, which includes most flight crew and nearly all mechanics and maintenance troops, Army officials said.\n\nThe strategy to cut aviators is a switch from the Army’s efforts to fill out its pilot force less than a decade ago. In 2019, the service offered pay raises and promotion opportunities to meet a warrant officer shortage of almost 700 soldiers.\n\nAs the service reduces its aviation force, Army leaders are doing an ongoing analysis “to determine the appropriate approved excess strength to minimize turbulence,” Russell said. \n\nThe 6,500 cuts are separate from the nearly 4,600 reserve soldiers who are facing cuts, a drawdown reported by Military.com. With those moves, the Army plans to eliminate all Army Reserve helicopter units by the end of the summer.\n\nArmy officials said the Reserve Command is working on its own manpower plan “to address the unique circumstances” for their soldiers.",
    "score": 249,
    "url": "https://reddit.com/r/Military/comments/1nl7gff/army_cutting_6500_aviation_jobs_in_overhaul/",
    "created_at": "2025-09-19T15:58:31.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1n5m8gn",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "I tried.. but I couldn’t keep up.",
    "text": "In January of 2020 I left for basic training. This was just before Covid took hold of the entire world. I was devastated when I learned I wouldn’t see my family on graduation. I went to Fort Lee Virginia where I again grew distraught that I would see my home (New York) was full of dead people coming out of hospitals because of this.. I knew in my heart I would not be seeing my family once again. I started eating more to deal with the stress. I graduated AIT and became a hold over.. shortly after someone in my platoon took their life. It hit hard. I felt similar feelings. I knew I wasn’t doing okay. I had little friendships and people around me noticed that I was mentally struggling and avoided me. Everyday became a battle dealing with the demands and stress of the Army. I didn’t want to seek help because I didn’t have the courage to ask someone to wake up early to walk with me to the mental health clinic. I was then sent to Korea. Separated from everyone I had met and grown to know and live with in the Army. After a month long quarantine I go to my unit where I completely broke down.. I was contemplating buying as many pills as possible and ending it there. But a voice in my heart told me to seek help.. I spent 7 months in Korea constantly being seen by behavioral health. I had a profile that said I can’t use firearms. I felt so useless. So empty and lost. I gained so much weight and began drinking quite a lot that didn’t help me in any way but to feel something other than this misery in my heart. I was admin separated with an honorable discharge.\n\nTo this day I wish it played out differently. I wish I could proudly tell someone I served and I’m a veteran but I feel like a fraud. Like a complete failure everyday. I dream about being in the army still. It was once my determined passion to get in and serve my country.. but I failed when it came time to live it out. \n\nHow is someone like me supposed to leave the past behind me when it was such a defining moment in my life? I’m 25 now (20 when I enlisted) life hasn’t gotten better. The regret and shame still lives with me. I struggle with long term employment and relationships due to my severe anxiety and depression. It’s as if I never had a place in the world let alone the army. \n\nI’m sorry for this rant.. just needed to vent.",
    "score": 231,
    "url": "https://reddit.com/r/Military/comments/1n5m8gn/i_tried_but_i_couldnt_keep_up/",
    "created_at": "2025-09-01T11:31:16.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1pc1fjt",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Handing NCOs spreading wild political misinformation at work",
    "text": "I am on a duty bus right now and two senior NCOs are openly talking about stuff like sharia law being implemented in the United States and other far right talking points that are just objectively false. They are saying it loudly and confidently like it is all established fact.\n\nI am not junior to these guys. I'm almost certainly well senior to them, but I am also not in their direct chain and their talking points are all derived from the President's favorite \"news\" outlets. This is happening in a public work setting where other soldiers are listening.\n\nAt what point is it appropriate to step in and challenge that kind of misinformation when the conversation is not directed at you but is happening in front of everyone. I am not trying to argue politics for fun, but it is frustrating to hear leaders confidently repeat things that are clearly misinformed and that start to blur into prejudice rather than fact..\n\nDo you ignore it. Do you correct it. Do you only step in if it directly affects the mission or the soldiers around you.\n\nGenuinely asking where the line is. Thanks\n\nEdit: I should have known better than to ask a legitimate question on here and not expect people to immediately question my leadership instead of engaging with the actual issue. The question was about how you handle misinformation when it is coming directly from the Commander in Chief, especially in light of how aggressively politically appointed leaders have gone after people for dissenting from the President’s agenda. Everyone acts like they would happily stick their neck out on an anonymous forum, but the reality is very different.\n\nWe have already seen how fast the knives come after the killing of Charlie Kirk and the ensuing witch hunt for anyone posting how Kirk pushed violent and divisive rhetoric. And now the White House is publicly throwing Admiral Bradley under the bus now they're under heavy scrutiny. When leaders are getting publicly blamed and careers are on the line, it is not hard to understand why people are cautious about speaking up. Other federal agencies actively asked for tips from staff to rat on each other for the crime of being anti-Trump. ",
    "score": 225,
    "url": "https://reddit.com/r/Military/comments/1pc1fjt/handing_ncos_spreading_wild_political/",
    "created_at": "2025-12-02T06:33:30.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1ntswrs",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "For Veterans making over $200k: What are you doing now, and would you recommend it?",
    "text": "Hey all,\nI’m curious to hear from fellow vets who have transitioned out of the service and are now making over $200k a year.\n\n- What career path are you in?\n- How did you get into it?\n- Would you recommend it to other veterans?\n- Anything you wish you had known before starting down that path?\n\nI think hearing real experiences could help a lot of us still figuring out our next steps.\n\nThank you!\n\n\nEdit:\nThank you everyone for the incredible responses! I’m honestly blown away by how many fellow veterans took the time to share their stories/advice.\n\nI actually made this post because I’m at a bit of a crossroads and really want to make a change in my life. I’ve been feeling a little down and confused lately, but at the same time I feel like a breakthrough is close. Because of your posts, I’ve been able to narrow things down to three career paths, and I’ll be making a decision soon.\n\nI know money isn’t everything, but I want to be honest how I want my future to look like. Reading all your responses has been inspiring and motivating. It’s a tough period, but I’m hopeful. Thanks again for the positivity and for showing me what’s possible! ",
    "score": 225,
    "url": "https://reddit.com/r/Veterans/comments/1ntswrs/for_veterans_making_over_200k_what_are_you_doing/",
    "created_at": "2025-09-29T20:22:14.000Z",
    "num_comments": 528
  },
  {
    "id": "reddit-1l35wof",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Retirement Rack",
    "text": "Here’s my Retirement Rack minus the badges, foreign awards and other things. \n\nFor everyone posting their military, JROTC, or family member’s uniforms, ribbon racks, medals and shadow boxes please add them to this newly created community called:\n\nr/MilitaryDisplays \n\nHere you can post your uniform, or ribbon rack, or ask what ribbons they are. Display them proudly and add any stories with your post about your career or your family’s career. We’d love to hear it. \n\nWe hope to see more of you vets, current active members, family members, and military enthusiasts join! \n\nThank you.\n\nr/MilitaryDisplays ",
    "score": 218,
    "url": "https://reddit.com/r/Military/comments/1l35wof/retirement_rack/",
    "created_at": "2025-06-04T13:43:16.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1lkl62k",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Upcharging on Food, Selling Booze: The Army's Plan to Privatize Dining",
    "text": "[https://www.military.com/daily-news/2025/06/25/upcharging-food-selling-booze-armys-plan-privatize-dining.html](https://www.military.com/daily-news/2025/06/25/upcharging-food-selling-booze-armys-plan-privatize-dining.html)\n\n\"\"The [Army](https://www.military.com/army) is preparing to overhaul its food service system in a move that could strip away government-run dining facilities and hand operations to private, for-profit companies.\n\nFramed as a modernization effort, the plan could saddle enlisted soldiers, many of whom already struggle with low [pay](https://www.military.com/benefits/military-pay), with even greater costs for meals they are effectively required to buy.\n\nSo-called \"campus-style dining\" has been pitched to lawmakers as a way to incentivize private vendors to create Army dining spaces where soldiers want to eat, with longer hours, a better atmosphere, and additional menu variety.\n\n**Read Next:** [Military Domestic Violence Conviction Skyrocketed After Commanders Were Removed from Process](https://www.military.com/daily-news/investigations-and-features/2025/06/24/military-domestic-violence-convictions-skyrocketed-after-commanders-were-removed-process.html)\n\nBut documents reviewed by [Military.com](http://Military.com) show a system light on guardrails, nutrition standards and financial transparency -- and heavy on opportunities for contractors to upsell alcohol and high-priced extras to a population that has little choice to opt out.\n\nSo far, the Army still hasn't found a contractor to take up the deal. The deadline for contractors to make a pitch is Tuesday.\n\n\"\\[We\\] will leverage industry expertise and incentivize a contractor to operate a facility where soldiers want to dine, with better ambience, additional healthy food options, extended operating hours, and more,\" Lt. Gen. Chris Mohan, the acting head of Army Material Command, told lawmakers during an April hearing on the Defense Department's food operations.\n\nThe pilot program, currently open for bids, covers dining operations at five of the Army's largest installations: Fort Bragg, North Carolina; [Fort Carson](https://www.military.com/base-guide/fort-carson), Colorado; [Fort Stewart](https://www.military.com/base-guide/fort-stewart), Georgia; [Fort Drum](https://www.military.com/base-guide/fort-drum), New York; and [Fort Cavazos](https://www.military.com/base-guide/fort-cavazos), Texas.\n\nUnder the proposal, contractors would run the facilities, cover renovation costs up front, and be allowed to sell premium items such as higher-quality meal options, snacks and booze. They would also share the profits with the Army.\n\nThere are few restrictions on what vendors can sell, and they are exempt from following Army nutritional standards altogether, though the service itself also [frequently skirts its own nutrition rules](https://www.military.com/daily-news/2024/02/29/army-going-all-food-kiosks-base-dining-facilities-struggle.html). The Army has also waived compliance with the Berry Amendment, which requires the military to prioritize U.S.-made products or purchase through the Defense Logistics Agency, which governs oversight and logistics of food products for the Pentagon.\n\nFor many of the troops who would be affected, there is no real choice in the matter.\n\nJunior enlisted service members who live in barracks are automatically charged a Basic Allowance for Subsistence, or BAS, amounting to roughly $460 per month. That money is deducted directly from their paychecks, regardless of how often they eat or what they consume, though the service has been largely [unable to account for how that money is spent](https://www.military.com/daily-news/investigations-and-features/2025/02/14/over-151-million-taken-soldiers-paychecks-food-costs-spent-elsewhere-army.html).\n\nUnder the privatized model, the deductions would continue, but soldiers may find themselves paying out of pocket for items not covered in the contractor's meal package under the \"campus-style dining\" initiative.\n\n\"It's important to stress this is a pilot program; we'll be assessing how this goes,\" Col. Junel Jeffrey, a service spokesperson, told Military.com. \"Regular dining facilities are not being replaced.\"\n\nPhrases such as \"high-quality\" and \"fresh\" are used frequently throughout the solicitation for contracts dictating what the Army expects from potential contractors, though the service never defines what those words actually mean.\n\nThe Defense Department has had mixed success with privatizing some of its major quality-of-life services, such as medical care, housing and military [permanent change of station](https://www.military.com/money/pcs-dity-move/pcs-checklists.html) moves.\n\nIt has looked to private companies to tackle some of the department's largest duties since the early 1990s, giving broader access to privately managed health care to family members and retirees, establishing the privatized military housing program to address shortfalls in family housing and, most recently, awarding a contract to a private joint partnership to run military moves.\n\nFor the most part, companies have invested heavily in their military contracts, providing services and benefits beyond what were offered by the Defense Department when it managed the programs.\n\nBut those efforts have not been without trouble and, in some cases, major scandals.\n\nIn 2018, the Reuters news organization uncovered shoddy construction and workmanship, poor service and inadequate maintenance that [contributed to poor health and safety concerns](https://www.military.com/daily-news/2019/02/13/mold-lead-and-vermin-survey-finds-toxic-conditions-military-housing.html) among military families in privatized housing.\n\nA change in [Tricare](https://www.military.com/benefits/tricare) contractors this year continues to affect military families, who have [faced problems getting medical appointments](https://www.military.com/daily-news/2025/02/05/pentagon-scrambles-fixes-tricare-beneficiaries-western-us-hit-contractor-issues.html) and maintaining their services with private health care providers in a new network managed by TriWest Healthcare Alliance.\n\nAnd as recently as last week, Defense Secretary Pete Hegseth [canceled a $7.2 billion contract to a company hired in 2021 to run the services' permanent change of station moves](https://www.military.com/daily-news/2025/06/20/hegseth-cancels-massive-contract-military-family-moves-pledges-fixes.html). According to the DoD, the company, HomeSafe Alliance, failed to deliver on promises that it would assume management of nearly all of the DoD's domestic moves this year.\n\nPentagon spokesman Sean Parnell said cancellation of the company's contract was \"for cause due to HSA's demonstrated inability to fulfill their obligations and deliver high-quality moves to service members.\"\"",
    "score": 217,
    "url": "https://reddit.com/r/Military/comments/1lkl62k/upcharging_on_food_selling_booze_the_armys_plan/",
    "created_at": "2025-06-25T23:38:07.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1l3k3xg",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Retaliation Against Civilians at US Coast Guard Sector New York — Removals Already in Motion",
    "text": "Posting here because I know a lot of folks in this sub understand how things actually work on the ground — and what crosses the line.\n\nRight now at USCG Sector New York, multiple civilian employees are being targeted for removal. And from everything I’ve seen firsthand, it’s because they spoke up.\n\nHere’s what’s happening:\n\t•\tCivilians who filed EEO complaints are now being processed out.\n\t•\tEmployees who took FMLA leave to get space from hostile environments? Also on the chopping block.\n\t•\tPeople are being marked AWOL for calling out sick even with leave on the books, unless they hand over a doctor’s note — and that’s only being enforced against folks who’ve filed complaints or grievances.\n\nNone of this looks like standard policy enforcement. It looks like retaliation.\n\nThe environment has gotten toxic — and this isn’t just grumbling. It’s stress-related health issues, write-ups, investigations, and removals. It’s real lives and careers being dismantled because people tried to follow the rules and protect themselves.\n\nIf this sounds familiar, or if you’ve dealt with something like this in your command, please speak up. Even anonymously.\n\nThis kind of thing doesn’t stop unless it gets daylight. And once people start talking, it’s harder to bury.\n\n⸻\n\nIf you’re dealing with this kind of retaliation:\n\t•\tDocument everything\n\t\nContact:\n\t•\tOSC (Office of Special Counsel)\n\t•\tDHS OIG\n\t•\tEEOC\n\t•\tYour union, if you’ve got one since the president ended it and our labor relations seems to not know what to do with themselves so they just give management bad information\n\n\n⸻\n\nNot trying to start a witch hunt — just trying to stop careers from being crushed behind closed doors.\n\nWould really appreciate any advice, shared experiences, or even just confirmation this isn’t isolated. If leadership isn’t going to protect civilian employees who follow the law, someone else needs to.\n\n\n",
    "score": 209,
    "url": "https://reddit.com/r/Military/comments/1l3k3xg/retaliation_against_civilians_at_us_coast_guard/",
    "created_at": "2025-06-04T23:13:53.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1hr1y3s",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Has anyone found a career that offers the same amount of time off work as the military?",
    "text": "Retiring in 5 months from the AF.  Despite all the BS we deal with, I feel we get a lot of time off. Perhaps I’m lucky cause I’m AF and I am a nonner (aka office job).  But I’m used to random family days off, 4 day weekends for federal holidays, choosing Xmas or new years “week” off just because.  Going to appointments easily and if it’s at 2pm, I’m done for the day cause I’m not going back. Then to top it off, 30 days annual leave.\n\nNot trolling and not trying to be a prick but that’s a lot of time off especially when I talk to civilian family/friends. So aside from being an entrepreneur making your own hours or working on base as a GS/contractor, what else out there offers a similar perk?",
    "score": 204,
    "url": "https://reddit.com/r/Veterans/comments/1hr1y3s/has_anyone_found_a_career_that_offers_the_same/",
    "created_at": "2025-01-01T12:22:18.000Z",
    "num_comments": 275
  },
  {
    "id": "reddit-1m34epj",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "20yrs erased possibly",
    "text": "I don’t post much, but I’m really not okay right now and needed to reach out somewhere that might understand. I’m hoping this community, full of people who’ve made the same sacrifices, might get where I’m coming from or just give a lending ear. \n\nA week after I hit 20 years of active duty service, I got into trouble. Nothing violent, no one was hurt, but it was enough for my chain of command to take action. I made a mistake just one, a big one, but after 2 decades of serving honorably without a single issue. No Article 15s, no disciplinary record. And now, instead of an approved retirement in December, they’re trying to involuntarily separate me before/after that date.\n\nThat means I’d lose my retirement pay, my health benefits, everything I earned through 20 years of sacrifice. And I can’t lie…it’s wrecking me emotionally.\n\nI feel like my entire identity is being stripped away. I gave my life to the Army…missed holidays, built my entire adult life around serving. And over one mistake, they’re acting like none of that ever mattered. Like I never served/deployed/did BCT DS time. I’ve seen others do far worse (or do the same and just receive art 15/GOMAR) and walk away with less punishment, and it’s hard not to feel like I’m being made into an example. \n\nI’m being treated like I’m some kind of disgrace…like I was never a good Soldier/NCO/SNCO. But I was &amp; still am. And now I sit here with everything I built for 20 years at risk, and no one around me seems to care what that does to someone mentally/emotionally. \n\nI’m not suicidal, but I am struggling. I feel hopeless and somewhat depressed. I never thought this is how my career would end. I just want to know if anyone else has ever been through something like this—or even just understands what it feels like to be discarded after giving everything.\n\nThanks for letting me get this out. Any support, words of wisdom, or just shared experiences would mean more than you know. Thanks. ✅ \n\nEdit for clarity: I won’t be sharing the specific details of my case or situation. The Army is small, and it’s easy to connect the dots with too much information. What I will say is that it’s not a felony, and has nothing to do with sexual assault, EO, fraternization, or adultery. I also didn’t specifically ask for advice on my original post, but thank you to the ones who gave good info! 👏🏼 \n\nTo those who may be quick to judge or leave negative comments: I won’t be engaging. No one is denying accountability….I fully recognize that I made a mistake. In my case, I stopped the scenario once I recognized things were not ok, got in trouble afterwards. To all you perfect ppl out there….I hope you continue your perfect life and stay perfect 😇\n\nWhat I can share is that I’m a female, and both my 1SG and Commander are advocating for the lowest level of punishment possible. They don’t want my retirement or benefits affected. Unfortunately, our new CSM is pushing for the harshest possible outcome. While the BC initially supported a more measured response, it’s unclear if that will hold under pressure.\n\nAs far as anything goes paperwork wise….I’ve received nothing other than a 4856 and a 268, so far. ",
    "score": 192,
    "url": "https://reddit.com/r/Veterans/comments/1m34epj/20yrs_erased_possibly/",
    "created_at": "2025-07-18T14:51:44.000Z",
    "num_comments": 363
  },
  {
    "id": "reddit-1jc2mje",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Just realized I have the LUXURY to do what I want to do because of veteran benefits.",
    "text": "I feel like I've had an epiphany.\n\nI got out of the military a little more than a year ago. When I first got out I was met with many challenges simultaneously - ongoing divorce, my father passed away 1 month into the start of my first semester, and I was trying to transition from the life I had known for the last 7 years into a college student at 30 years old.\n\nI slowly started to realize the degree program at my school was not preparing me for what I wanted to do for a career (too much focus on non-practical job skills that employers do not care about). I started to apply for jobs doing what I did in the Air Force and landed a well paying job (did not finish my degree) and I am now withdrawing from my classes - as I start the job at the beginning of next month.\n\nUnfortunately this job may not be long lasting as I did self-disclose that I tried weed when I got out of the military (wasn't for me at all) so my clearance may be in jeopardy. Originally I was scared to take this job knowing it may not be long lasting and I'd be uprooting myself. But figured I'll ride it out, save up money, and prepare for the worst. Then I came to a realization.\n\nI've always wanted to travel the United States, visiting each state and just taking in the beauty and freedom. I've now decided if this job doesn't work out, I am going to leverage the AMAZING benefits we get and go chase this bucket list item. I am no longer scared. I will drive across the U.S., do my school work for income, and I'll make some supplemental income in other ways (not bloweys at the truck stop lol) if I have to as well. I'll get to spend at most 2 years traveling the U.S., seeing the sights I've always wanted to see, and getting to experience true freedom and I wouldn't be nearly as carefree about it if I didn't have the income coming in from the benefits. \n\nI almost hope that the job doesn't work out now. Not many people have the chance to make income while traveling and receiving an education. I know it's not for everyone, and it may not even be for me. I'll just have to wait and see. \n\n\n\n",
    "score": 192,
    "url": "https://reddit.com/r/Veterans/comments/1jc2mje/just_realized_i_have_the_luxury_to_do_what_i_want/",
    "created_at": "2025-03-15T19:10:56.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1itzyxc",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Today May be the Day I Quit my Job",
    "text": "I work a very stressful career. I'm 100% P&amp;T (70% MH) which unsurprisingly has not reduced ant level of stress or anxiety I have. My specific anxiety is related to atychiphobia which is a direct fear of failure. Basically nothing I do is ever good enough, I push myself 150% and aim for perfection. If it's not achieved I break down. I have developed OCD rituals and tendencies too. \n\nSo my job is literally killing me. \n\nMy wife and I have talked. All of our bills can fit within my VA Disability aside from Food and Spending. Combined we'd bring in about $7800 after tax a month with $4300 from my disability. \n\nToday may be the day I Say I have FU money and spend time with my kids and my family. My oldest is headed out of High School soon. My youngest is in 1st and wants to do sports. My wife will use Chapter 35 and go to school but also get free tuition through Florida. \n\nPray for me 😂",
    "score": 151,
    "url": "https://reddit.com/r/Veterans/comments/1itzyxc/today_may_be_the_day_i_quit_my_job/",
    "created_at": "2025-02-20T14:39:36.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1ijpoi2",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "I f*ing HATE fireworks",
    "text": "My town has a weekend of celebrations coming up. 48 hours of bonfires, drinking, music and fireworks. A LOT of fireworks.\n\nAfter a career in the infantry, I find myself absolutely hating fireworks. I just don't don't see the point of them.\n\nPeople around me don't seem to get it... I'm not sure I do either to be honest.\n\nIs this common among veterans?",
    "score": 147,
    "url": "https://reddit.com/r/Veterans/comments/1ijpoi2/i_fing_hate_fireworks/",
    "created_at": "2025-02-07T07:36:44.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1oe7t1z",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Veterans that didn’t do a full 20, when do you know it was time to get out?",
    "text": "I’ve been in the Army now for almost 7 years, picked up CPT at 4 years and here I am. As a kid I decided i wanted to go into the military and that would be my career, never really considered an alternate route. I went to college at Texas A&amp;M because I had heard they had a\ngood Army ROTC program, which they did. I got branched Military Intelligence and was stationed at Fort Bragg for about 3.5 years. While I was there I immediately got a PL slot and was moved up to XO at the 12 month mark. I split the rest of my time between XO and working as the BDE S3 CUOPS, overall was making a good impression. I get to being a CPT and stayed FORSCOM, this time choosing to got to Fort Hood to be closer to my wife’s work. I was put in 3CR and despite having no S2 experience I ended up rocking that job. I trusted my leadership would take care of me, I was doing a good job because i thought the rest would take care of itself. At 12 months, while in Korea I got rated and HQ with my CDR giving his word that i would get an MQ at 18 months so I could stay in the Army. At 18 months I got a great write up (top 15%, send to resident ILE now) but still an HQ, my CDR neglected to tell me that his profile did not support an MQ. I had stuck with that unit through a lot of crappy times but that really broke my trust and now my career is in jeopardy. That being said I changed unit but I know i’ll experience leaders like that again. I want to be there for my Soldiers but I don’t know if it’s worth stressing my self out and putting strain on my marriage. When did yall know it was time to get out? ",
    "score": 130,
    "url": "https://reddit.com/r/Veterans/comments/1oe7t1z/veterans_that_didnt_do_a_full_20_when_do_you_know/",
    "created_at": "2025-10-23T16:24:05.000Z",
    "num_comments": 400
  },
  {
    "id": "reddit-1jgwh6x",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Has anyone looked back on a long career and feel like they wasted their life",
    "text": "Spent 20 years, feel like it was a waste. Way behind peers now in the civilian sector. Not many hard technical skills, only “leadership” which not many people seem to give a sh@t about. Wars that accomplished nothing. Moving every couple years so no close relationships. Yeah, getting a retirement check is cool, but was it worth it. ",
    "score": 130,
    "url": "https://reddit.com/r/Veterans/comments/1jgwh6x/has_anyone_looked_back_on_a_long_career_and_feel/",
    "created_at": "2025-03-22T00:52:41.000Z",
    "num_comments": 84
  },
  {
    "id": "reddit-1n6uhye",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "What career did you get into after the military?",
    "text": "I’m close to finishing school right now since getting out and still as lost as ever with what I want to do. The thought crossed my mind of going back in as an officer this time (prior enlisted infantry). I miss the deep friendships of the military more than anything and the wild experiences I had while in. I think back on it a lot, even though I hated all the bs and counted down my days til I got out. Curious to hear what career you guys are doing and how much happier, or less happy, are you now compared to being in the military. Maybe it’ll give me some ideas of what to do career wise.",
    "score": 125,
    "url": "https://reddit.com/r/Veterans/comments/1n6uhye/what_career_did_you_get_into_after_the_military/",
    "created_at": "2025-09-02T20:23:46.000Z",
    "num_comments": 301
  },
  {
    "id": "reddit-1mj3tfy",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "What is everyone doing for their career?",
    "text": "30, single, computer science degree, sick of IT and want a change. My company is doing another round of layoffs soon anyways and I want out. I'm too ADD for it and only pursued it because I didn't know what else to do. Now, I'm applying for local and federal law enforcement as that's always something I wanted to do as a kid, but strayed away from after being infantry enlisted and wanting to step away from government. \n\nSeems like jobs are much more scarce nowadays as I look online (even for IT), and wages are not so great. I make just above 6 figures now (median in my state) and taking over a 50% paycut kind of stings, but it's what comes with a career change I guess.",
    "score": 122,
    "url": "https://reddit.com/r/Veterans/comments/1mj3tfy/what_is_everyone_doing_for_their_career/",
    "created_at": "2025-08-06T12:51:10.000Z",
    "num_comments": 367
  },
  {
    "id": "reddit-1lfahsu",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Civil servants called up for military reserve duty entitled to differential pay after Supreme Court decision",
    "text": "Key takeaway:\n\n&gt;The court ruled on April 30 in its [Feliciano v. Department of Transportation decision](https://www.supremecourt.gov/opinions/24pdf/23-861_7lh8.pdf) that military reservists called up to active duty during a national emergency are entitled to the difference between their military and civilian salaries regardless of whether that service was substantially connected to the emergency in question. \n\n&gt;That means federal employees that also serve as military reservists may have new claims on differential pay based on their past active duty service, and the Merit Systems Protection Board, which handles the claims, may soon have more work.",
    "score": 118,
    "url": "https://reddit.com/r/Military/comments/1lfahsu/civil_servants_called_up_for_military_reserve/",
    "created_at": "2025-06-19T13:12:55.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1pfi6ir",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "VETERAN CAREER",
    "text": "Throughout my career, I’ve had the privilege of working alongside veterans from the Navy, Army, Air Force, and beyond. They are wired differently. The discipline instilled in them is unlike anything most people ever experience. One trait that stands out above all is their bias for action. You don’t need to ask them to step in, they simply do. They offer a hand where needed, respond to situations outside their job description, and carry themselves with a readiness that inspires everyone around them.\n\nI often asked them: *Why are you different? Does your service shape who you become in life?*\n\nFast forward to today. I was driving home from an event in the Midwest after a heavy snowstorm with nearly 10 inches had fallen, and the roads were still being cleared. Exhausted, I decided to pull over at a crossroads since the next rest stop was 15 miles away. As I turned, my car suddenly slid out of control and lodged itself in a pile of snow. Thankfully, it wasn’t damaged, but I couldn’t move it no reversing, no turning, no progress.\n\nI switched on my hazard lights and called 911, hoping they could connect me with a local tow company. No luck. The nearest help was at least an hour away. I tried AT&amp;T roadside assistance and my insurance company, but again, no immediate solution. Finally, AT&amp;T called back: a tow truck could come in 75 minutes, 30 miles away, at a cost of $195. By then, I had already been stranded for an hour, with cars passing by and drivers staring but not stopping.\n\nI stepped out to stretch my legs when a truck pulled over. An older man approached and asked if I needed help. I explained the situation and that I’d been waiting for roadside assistance and it would be another hour. He told me to cancel the call. He’d rush home, grab a shovel, and come back to help.\n\nTrue to his word, he returned within 15 minutes, shoveled the snow, and guided me as I reversed and drove forward. With his push, I was free in just two minutes. When I asked what I owed him, he said, “Nothing. I served 25 years as a veteran, and I continue to serve my fellow citizens. You don’t owe me anything.”\n\nI was stunned. He saved me $195 and another hour of waiting. More than that, he reminded me of what I’ve always known: veterans carry their service into every part of their lives. Their instinct to act, to help, and to serve doesn’t end when they leave the military, it becomes who they are. There people like me who appreciate all you veterans do.\n\nTHANKYOU FOR YOUR SERVICE.",
    "score": 118,
    "url": "https://reddit.com/r/Veterans/comments/1pfi6ir/veteran_career/",
    "created_at": "2025-12-06T06:14:56.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1i9mtea",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Junior Officer Wanting Out",
    "text": "Active duty O3E w/12 years in but so burned out I am leaning on separating vice sitting for O4 board.\n\nThe pay is great, benefits on paper can't be beat, but it's not being in control of yourself, lack of purpose, inabilty to do your job, etc...\n\nMy biggest concern is finding comparable salary and I see a lot of JO recruitment agencies...are they legit or scams? \n\nAny pointers?  My biggest reason for staying in has been job security but at this point I'd rather be happier than stuck.\n\nAlso, would transfer to reserves so I don't lose tricare and my retirement, just sucks I would have to stay in past 20 years to get my retirement right away.",
    "score": 114,
    "url": "https://reddit.com/r/Veterans/comments/1i9mtea/junior_officer_wanting_out/",
    "created_at": "2025-01-25T13:21:32.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1i6kmg2",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Divorce Benefitd",
    "text": "If this applies to you as the service member,  look into BIFURCATED DIVORCE! Some states allow it, others don't. Safeguard your benefits, folks. There are people out there OUT TO GET IT. Some of yall cheating abusive do deserve it tho, but not everyone 🤣",
    "score": 87,
    "url": "https://reddit.com/r/Military/comments/1i6kmg2/divorce_benefitd/",
    "created_at": "2025-01-21T15:07:03.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1n2tf3u",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Anyone struggling to not open their mouths and say something that'll get them fired?",
    "text": "I am struggling. I work in the care field as a crisis counselor. I consider myself emotionally intelligent, empathetic, and compassionate, for the most part. However, another part of me still wants to yell at the clients, tell them to unfuck themselves, quit stealing oxygen from the rest of us, and get off my grass.\n\nI do all the things I should be doing—counseling, meds, etc. I'm just tired of talking myself out of jobs. Any advice?\n\n  \nUPDATE: I was notified today that I have been terminated. So, for those suggesting I get out of the care field, I'm looking for new career opportunities! \n\nI have a background in Military Intelligence, Nursing Care, Mental Health, and Case Management.",
    "score": 85,
    "url": "https://reddit.com/r/Veterans/comments/1n2tf3u/anyone_struggling_to_not_open_their_mouths_and/",
    "created_at": "2025-08-29T00:46:47.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1j3pfc9",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "I don't know what to do anymore.",
    "text": "I got out of active duty in 2022 and I cannot find anything that fills me with purpose and joy anymore.  I am in the reserves and I look forward to that every month.  I've asked multiple people in the unit about an AGR or ART position, but there are zero oppurtunities.  I've tried contacting the career development person in the Wing, but haven't got a call back.  I miss it, man.  Everyday just feels like a struggle.  \n\n  \nAfter I got out, I got hired by a major police department in Missouri.  I quit the first day because I just didn't want that discipline type style anymore.  Then worked in a warehouse, quit, office job, quit.  I deployed 6 months later on a volunteer because I hated the civlian life.  After my deployment I got hired by my current employer, a small town PD thinking maybe it would fill a purpose, even though I quit the other department.  I hate this job.\n\n  \nI don't know what to do.  I'm just sad and depressed all the time and doesn't help my home life with my wife.  She knows I love the military, but I don't want to put her through the TDY and deployments again.",
    "score": 80,
    "url": "https://reddit.com/r/Veterans/comments/1j3pfc9/i_dont_know_what_to_do_anymore/",
    "created_at": "2025-03-04T23:52:12.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1n8ev3b",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Folds of Honor changes pledge to donors after investigation found it overstated how much it gives to veterans' families",
    "text": "The veterans’ nonprofit that [tried to build](https://www.tcpalm.com/story/news/local/2024/08/25/group-drops-plan-for-golf-courses-at-jonathan-dickinson-state-park/74925730007/) golf courses in Florida's [Jonathan Dickinson State Park](https://www.tcpalm.com/story/news/local/indian-river-lagoon/2025/01/02/jonathan-dickinson-state-parks-wetlands-plants-among-rarest-in-the-world-ecology-conservation/75916962007/) last summer has changed its pledge to donors after a [TCPalm investigation](https://www.tcpalm.com/story/news/local/2025/03/12/folds-of-honor-jonathan-dickinson-state-park-golf-course-charity-overstates-scholarship-donations/78251513007/) found it had overstated how much money went to charity while spending on salaries, social club dues and a private jet for its CEO.",
    "score": 75,
    "url": "https://reddit.com/r/Military/comments/1n8ev3b/folds_of_honor_changes_pledge_to_donors_after/",
    "created_at": "2025-09-04T16:25:52.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1i2q6n1",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "PSA:  Before getting out of the military",
    "text": "I’d seen questions on and off here about things to do, see, consider before getting out of the military … here’s at least my short list.\n\n1) Medical Stuff\n- Get copies of your medical records\n- Make sure you’ve been seen for absolutely EVERY EVERY problem you have or have had in the military, you want this documented in your medical records.  (Did I say every?)\n- You can now begin to submit information to the VA for a potential claim before getting out — talk with a VSO (Veterans Service Organization) for help with this.  BUT you can do it on your own with enough research.  For most a VSO can be very helpful.  VSO LINK: https://www.va.gov/resources/va-accredited-representative-faqs/\n- Get a copy of your DD 214 and save it somewhere good.  You can download it but some organizations may need the one with the embossed seal.\n- VA Claims —  [Free chatbot](https://www.vadisabilitychat.com) that can help provide guidance on VA Claims.\n\n2) Personal stuff\n- Get copies of your performance reports, those may be helpful when applying for a job in the real world.\n- Letters of recommendation from peers / superiors — these may be helpful in getting a job.  \n- Not sure what you want to do?  https://www.militaryonesource.mil/education-employment/for-service-members/your-career-path-finding-the-right-job/ — find something that you think could interest you and give it a try, you can always switch (you’re not stuck there).  Many companies love hiring military folks, but more for entry level roles since you don’t have the business etc experience.  \n- Education / College?  Many states have free community college.  Or try a 4 year school… or you can do community college then transfer to a 4 year school and graduate just after 2 years.\n- GI Bill Transfers:  If you’re planning to transfer your GIBill to spouse or dependent, do that before you leave.\n\n3) Where to live?\n- Many states have no income tax — that’s like an automatic salary bonus. https://www.investopedia.com/financial-edge/0210/7-states-with-no-income-tax.aspx\n- Many states have additional benefits for veterans who are rated by the VA — the benefits depend on the rating eg: 50%, 100%, etc … benefits could be free hunting/fishing licenses, lower or no real estate taxes, free car tags, even a waiver of sales tax (Oklahoma).\n- Veterans groups — many states and cities have veterans groups for networking and / or help.  Some are non-profits that can help you find direction, jobs, help, etc….\n\nI’m sure there are definitely more.\n\nEDITS:\n- Added GI Bill Transfers\n\n\n",
    "score": 74,
    "url": "https://reddit.com/r/Veterans/comments/1i2q6n1/psa_before_getting_out_of_the_military/",
    "created_at": "2025-01-16T14:31:44.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1n8ek3l",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Folds of Honor changes pledge to donors after TCPalm found it overstated how much it gives to veterans' families",
    "text": "The veterans’ nonprofit that [tried to build](https://www.tcpalm.com/story/news/local/2024/08/25/group-drops-plan-for-golf-courses-at-jonathan-dickinson-state-park/74925730007/) golf courses in Florida's [Jonathan Dickinson State Park](https://www.tcpalm.com/story/news/local/indian-river-lagoon/2025/01/02/jonathan-dickinson-state-parks-wetlands-plants-among-rarest-in-the-world-ecology-conservation/75916962007/) last summer has changed its pledge to donors after a [TCPalm investigation](https://www.tcpalm.com/story/news/local/2025/03/12/folds-of-honor-jonathan-dickinson-state-park-golf-course-charity-overstates-scholarship-donations/78251513007/) found it had overstated how much money went to charity while spending on salaries, social club dues and a private jet for its CEO.",
    "score": 71,
    "url": "https://reddit.com/r/Veterans/comments/1n8ek3l/folds_of_honor_changes_pledge_to_donors_after/",
    "created_at": "2025-09-04T16:14:37.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1k80wg0",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "It's still crazy to me",
    "text": "When I see the retirement, VA disability and the job salary all processing in the bank at once...never taking this for granted.\n",
    "score": 66,
    "url": "https://reddit.com/r/Veterans/comments/1k80wg0/its_still_crazy_to_me/",
    "created_at": "2025-04-26T01:03:40.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1k9hyql",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Slipping the Golden Handcuffs before they get too tight",
    "text": "TL/DR: Recently retired after 20 years, transitioned into the banking industry in corporate America, but thinking about giving it up and living the retired life. I need help getting out of the golden handcuffs. \n\nMy transition out of the military was the smoothest that could've been asked for. My command gave me an entire year and half to prepare. Because of that, I walked into a corporate job with a nice salary on day one of terminal leave. I received 100% disability right away. My retirement and Disability check pays for all household bills and the corporate job check goes majority to saving and the reminder to discretionary spending. \n\nAfter a year of working in corporate America, I'm realizing that the 9-5 is not the life for me. I have made peace with leaving. But the money is good! Without the civilian job, I would have roughly $1,500 leftover monthly for groceries and gas for the family. While this is doable, nothing would be added to savings or investments. I will be using the GI bill soon and that will take the number up to $2,500 leftover monthly. \n\nMy problem is that while I plan to take a few months off and decompress, I have no other outlook for future careers once I decide to get back into the work force. The military gave me the fulfillment I needed and checked that life box. Is this a bad move financially? Anyone have a similar story of living off their military retirement and disability?",
    "score": 41,
    "url": "https://reddit.com/r/Veterans/comments/1k9hyql/slipping_the_golden_handcuffs_before_they_get_too/",
    "created_at": "2025-04-27T23:47:08.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1ncwnvx",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Need advice from veterans. I am struggling after leaving the military",
    "text": "Edit: Thanks to all of you for your words and for your service. Even though we wore different uniforms and served in different countries, I feel connected to you through that military brotherhood. Reading your comments made me feel less alone. We’ve all been through hardship, and it’s good to know that bond still exists, even across borders.\n\n\nHey everyone,\n\nI know this subreddit is mainly for veterans from the U.S., but I could really use some help from people who understand military life.\n\nI joined the Lebanese military at 17 and became a sergeant by 20. I loved serving, but the financial crisis hit hard. My salary went from over $1,200 a month to barely $30. Even after financial aid from other countries, soldiers are only getting around $300–400 now.\n\nI held on for about three more years, but eventually I had to leave. Ever since then, I’ve been struggling. I feel like I lost my identity and purpose when I left the uniform behind. I can’t afford college, and most days I feel like a total failure. The only thing I’ve been able to do recently is take a barbering course, but the guilt still eats at me. I keep thinking about the military every single day, and I can’t shake the feeling that I abandoned not only my career but also the health insurance my family relied on.\n\nI don’t know how to move forward or how to find meaning in civilian life. Has anyone here gone through something similar after leaving the military? How did you cope with the loss of identity and find a new purpose?\n\nAny advice or even just words from people who’ve been through it would mean a lot.\n\nThanks for reading.\n\n\n",
    "score": 30,
    "url": "https://reddit.com/r/Veterans/comments/1ncwnvx/need_advice_from_veterans_i_am_struggling_after/",
    "created_at": "2025-09-09T22:07:20.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1onu9l9",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Struggling to find footing after the military | I’ve done all of the \"things\" I was told to do but I'm still severely underemployed and have no meaningful connections 6 years out of the military",
    "text": "Hey everyone,\n\nI just need to get this out somewhere. Maybe someone’s been through something similar.\n\n**TL;DR:** Got out of the Navy in 2019 → went to college → worked and studied nonstop → finished my degree in 2024 → spent six months unemployed → took a low-paying job just to survive → now I’m a licensed loan officer but still struggling mentally and professionally as I'm not making anything of myself in this profession.\n\n**The longer story:**\n\nI got out of the military in 2019 and immediately enrolled in college in Seattle with a buddy. Things were going well until COVID hit. Suddenly, my engineering classes went fully online. I lost access to teachers, tutors, labs — basically any kind of support system. Isolation hit me hard, and I spiraled. I failed Calculus II and decided to change my major to business.\n\nNot long after, I moved across the country for a private contracting job in New York working under a top-secret clearance. It paid well and went great for about 18 months. When management positions opened up (twice), I made it clear I was ready and capable — but got ignored each time. They hired people who quit within six months both times. So, I decided to leave, finish my business degree, and try to build a better long-term path.\n\nFrom 2022 to early 2024, I was a full-time business student. I sold my house, moved back home to Wichita, KS, and started job hunting in March while finishing my last semester. By June, I had my degree… but still no luck finding work.\n\nSix months later, I’d sent out nearly 200 applications. I got only three callbacks: two were MLM scams and one was a low-paying assistant job at a mortgage company. I took the assistant job because I needed *something* — I was living in my dad’s basement and losing my mind. I got licensed as a loan officer during that time and stayed on as an assistant while I learned the business.\n\nThen my boss started berating women in the office — yelling, screaming, public humiliation-type stuff. I couldn’t stay silent, so I spoke up and, after enough incidents, I quit. I won’t work for someone who treats people like that, no matter the cost. I have my values and my honor — things I will *never* let go of. The military taught me more about how to treat people than anyone else ever has, and I despair at how few people seem to have actual values in the civilian world.\n\nIn January 2025, I joined another company as a loan officer. I knew it’d be tough, but I’m still struggling to gain traction — despite networking, hiring resume writers, working with recruiters, and trying to translate my Navy nuclear background into civilian terms.\n\nNow, 11 months into this job, I’ve realized I’m technically in **debt** to my company because my “base salary” is actually a draw against commissions. And I can’t get sales to close to save my life, which just puts me deeper in the hole each month.\n\nWhat’s worse, I’m another 40-something job applications deep with not a single solid lead on a better or more stable position.\n\nOn top of all this, I’ve been battling severe depression. I actually had to move all my firearms to my dad’s house because I don’t trust myself anymore. If it weren’t for my folks caring about me, I probably wouldn’t still be here.\n\nI haven’t really formed any deep friendships or relationships since getting out. Civilians just… don’t feel the same. In the Navy, even if a shipmate made your life miserable, you knew they’d have your back when things got bad. Out here, it feels like people’s words don’t mean anything. I’m the guy everyone calls when they need a hand, have a crisis, or need someone reliable — but when I need help? Crickets and no-shows.\n\nLately, I’ve been thinking about admitting myself to the VA for inpatient mental health care, even if it would wreck me financially or cost me my house. I’m just tired — tired of feeling like I’ve done everything I’m supposed to and still can’t get my life off the ground. It feels like maybe I wasn’t meant for this world.\n\nI just want a normal life — to meet someone, get married, make enough money to pay my bills, and maybe eat out once in a while. But I can’t even manage that if I can’t find stable employment. And if I’m broke and unstable, how could I ever hope to find a life partner?\n\nIf any of you have been through this transition — how did you make it work?  \nHow did you *actually* take off after the military?  \n\n\n",
    "score": 26,
    "url": "https://reddit.com/r/Veterans/comments/1onu9l9/struggling_to_find_footing_after_the_military_ive/",
    "created_at": "2025-11-04T01:20:59.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1hsz7uv",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Any retired veterans with a masters degree?",
    "text": "Just curious, did you get your masters? Did you find that it helped with your new career? Is the salary worth it? ",
    "score": 19,
    "url": "https://reddit.com/r/Veterans/comments/1hsz7uv/any_retired_veterans_with_a_masters_degree/",
    "created_at": "2025-01-03T22:38:52.000Z",
    "num_comments": 110
  },
  {
    "id": "reddit-1nfirrc",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Veteran with a Master’s working a retail manager job I’m insanely overqualified for. Really just need a good job, but for now prioritize stable resume, push for promotion, or find marginally better/chiller job while waiting for the Big One?",
    "text": "**TLDR: got a retail manager job I’m absurdly overqualified for but took because I desperately needed a paycheck. I want to find an actual good job and it’s probably possible if I apply for a few hundred jobs. For now, should I do what I’m doing and just tune out the stress and apply for jobs, push for promotion so I get a little more cash and look even better on resume, or quit this stressful job and do something chill for same or better money so I’m not all stressed while job hunting?**\n\nI’m working for $16/hr as shift manager for a retail store. I’m a veteran with a Master’s degree I got on the GI Bill, 20+ years of work experience that’s mainly managerial, proficient in three languages.\n\nI had a major mental health setback over five years ago related to my combat service (no involuntary commitment or criminal record, just iffy credit and several years of resume gap). I was un/underemployed for years and took this job just to avoid total poverty. Been here two years, with a 30¢ raise last year. Boss said I’m getting a “better than usual” raise next month and they want to get me Assistant Manager (which I was also told a year ago).\n\nI’ve struggled to focus enough to apply for jobs, and all the work stress doesn’t help because I’m regularly getting called in to cover shifts. I did a couple years ago get focused and apply for lots of jobs and most of the ones that interviewed me were $80k-140k annually. This year I’ve only applied for a few dozen but had a couple really good interviews for around $80k jobs that I’d really enjoy.\n\nThe current retail job is *way* more responsibility and stress than is remotely reasonable for $16/hr. Most of my coworkers are teens, have only a GED, and/or criminal records. Should I:\n\n* just try to tune the stress out and do the minimum and try harder to apply for good jobs? Part of me wants to not make waves so I have 2+ years at my current job on the resume as I apply elsewhere.\n* work extra hard and get Assistant Manager for a little more money and to look good on the resume? And maybe ask them for a clear timeline on getting my own store (about $70k/yr) in case I just never find something better? Maybe even tell them “if I’m not Assistant Manager by 1 Jan, I’ll be sending out resumes”\n* just quit after my 2 year mark and work anything more chill and enjoyable (say bartending or front desk at a museum) so going into the new year I can have less stress and distraction for a job search for a job with a higher salary and more fitting work for my background? But then my resume would show 2 years of retail manager and then say three months of bartender, and with my resume being patchy over the last eight years I’m worried a recent change looks bad.",
    "score": 15,
    "url": "https://reddit.com/r/Veterans/comments/1nfirrc/veteran_with_a_masters_working_a_retail_manager/",
    "created_at": "2025-09-12T23:51:15.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1pk05fd",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Adjusting to civilian work",
    "text": "I’ve been out of the Army almost a year now, and I got insanely lucky to land the job I have. I don’t enjoy it (I went from being a medic to doing corporate work), but I am sticking with it because the benefits of this company are really good, and the work itself is pretty easy (I am an analyst for a bank, so I work a lot with Teams, PowerPoint, and Excel). \n\nI just got my performance review for the year, and my manager was giving me compliment after compliment, and she stopped when she saw that it was making me uncomfortable. I told her I wasn’t used to getting good feedback in this way. Even when my NCOERs were glowing it was not made into a big deal. They just told me to read it, sign it, and go about my day. Does anyone else have the same feelings I do? \n\nI was also given a small raise to my base salary, which is a first for me. I guess I assumed I was stuck at my starting salary until I got some kind of promotion. That was pretty cool to see. ",
    "score": 15,
    "url": "https://reddit.com/r/Veterans/comments/1pk05fd/adjusting_to_civilian_work/",
    "created_at": "2025-12-11T15:21:51.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1lynwyh",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "What career/occupation did you choose after successfully using VR&amp;E?",
    "text": "I hear so many people talk about VR&amp;E and I’ll be the first to say it definitely has its problems. But I’m curious for those of you who graduated using CH. 31 VR&amp;E what career choice did you choose? Do you like it? Salary? What was your experience while using VR&amp;E? ",
    "score": 11,
    "url": "https://reddit.com/r/Veterans/comments/1lynwyh/what_careeroccupation_did_you_choose_after/",
    "created_at": "2025-07-13T08:35:33.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1lm1d23",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Father Served in Navy - Benefits for Nursing Home - Confused.",
    "text": "So my father is 85, Served in the USN on the SS trigger (proudly!), and recently experienced a fall and a bad case of Rhabdomyolysis. Long lonh long story short, he is in a nursing home with physical ailments and what I will call \"dementia\". Lots of confusion, mixed up memories, short term issues, that sorr of thing. We are paying 11k a month for the care, which has been outstanding by the way. I am his POA and have been working non stop since April on many many fronts on his and Mom's behalf. \n\nI applied on his behalf for VA benefits (hard copy, Dad's ID me doesnt work) hoping there was a trickle of benefits to help us pay for this new financial burden. A couple of weeks go by and I get a call from the VA. Dad is in Priority Group 5. He does not have a combat service record, or a combat injury. The VA rep explained that due to his salary (Lets call is $50k per year, pension and SS) he would not qualify, or **I \"think\" thats what he told me**. I was trying to take notes and understand all he was throwing at me. He explained the Priority groups, and gave me some additional resources to consider. \n\nSecond guessing what I heard, I looked into the PG's and there is an income tool you can use to generate possible benefits. That takes you right on to the form we already submitted 10-10ez. Here is what that form claims we might be eleigible for: \n\n* Free VA health care for most types of care (like primary care, outpatient specialty care, and inpatient hospital care)\n* Prescription medicines with copays\n\nIs this correct with what the VA rep told me? I take it from the above he would not qualify for Nusing home assistance. I sent a follow up to the VA rep, but no word back. Thought I would post amongst us non government folks as I dont speak their language. \n\nThanks for reading my post. Bear with my ignorance and confusion. ",
    "score": 11,
    "url": "https://reddit.com/r/Veterans/comments/1lm1d23/father_served_in_navy_benefits_for_nursing_home/",
    "created_at": "2025-06-27T18:31:16.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1lw3oyr",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Army band hypothyroid",
    "text": "I’ve been accepted into one of the US army bands after a successful audition, which I’m extremely thrilled about. However, I do have very mild hypothyroidism, where I take 50mcg of levothyroxine daily. I’ve read that hypothyroidism is a DQ for the armed forces. Would this still be the case in my circumstances? I would be completely heartbroken if I wasn’t able to accept this job, as the benefits and salary are beyond anything I imagined for myself\n",
    "score": 10,
    "url": "https://reddit.com/r/Military/comments/1lw3oyr/army_band_hypothyroid/",
    "created_at": "2025-07-10T04:27:45.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1m9gub7",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Need Help Finding A Job",
    "text": "Going to be separating from the Navy in a couple months. I am an ETV of 5 years, E-5 with 3 NAMs, and have held leadership/supervisor positions. I am a quick learner and have strong patience. My skill sets are work controls (diagrams, tags, procedures, etc.), navigation at sea, low voltage electrical work, standing watch, atmosphere monitoring, and damage control. Obviously, job security and demand are important (Ironic, I know). I would prefer a salary around 100k or 45/hr (before taxes) in order to maintain my current cost of living as I make 70k after taxes. I understand that is quite unrealistic, but trying to narrow my options. I have my G.I. Bill, so getting a degree is an option (would still need a job in the meantime). Would love to hear some ideas or questions to help you help me, lol.\n\nEdit: I do not have any certifications or degrees, but I am willing to get them. I also joined straight out of high school and have no prior job experience. Thanks!\n\nEdit: Once again, I understand 100k isn't just going to fall in my lap. I am hoping you all can help me get a better idea on what I should do, like get a degree in X and pursue a career in X. I also know that NAM's aren't worth anything outside of the military, I pretty much threw that in to show that I am not a POS. Thanks, lol.",
    "score": 8,
    "url": "https://reddit.com/r/Veterans/comments/1m9gub7/need_help_finding_a_job/",
    "created_at": "2025-07-26T01:29:06.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1mf3o0k",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Should I stay or go? Need advice from others who’ve been here.",
    "text": "Hi all. I’m struggling and could use some perspective. I’ve been rated with the VA at the max VA amount and permanent since last fall, and a few months prior I started a new job with the DOI. Also, it took me about 20 years to do my last claim for MST. It was the hardest thing I’ve ever done. \n\nSo at this new job, at first, I was hopeful — a fresh start after leaving a toxic work environment. But lately, I’ve been overwhelmed by constant changes, shifting administration priorities, and the loss of supportive coworkers. I have one left and we’ve become close. However, more and more responsibilities are being placed on me, and it’s really ramping up my anxiety.\n\nI left my last job because of a toxic leader, but now I feel like the chronic stress, unpredictability, and pressure here are triggering my PTSD just as badly — only in a different way. I'm also beginning to realize that regular 9–5 jobs may not be a sustainable path for me. I’ve bounced around jobs a lot, and I’m finally connecting the dots: the structure and stress of traditional work environments just don’t mesh well with how I need to live to stay healthy.\n\nI’ve been seriously considering resigning. I’m was hoping to get RIF’d but nothing has happened yet but we are hearing it’s coming. I’d rather walk away with a severance. \n\nMy spouse fully supports me resigning and thinks I’d be much happier if I did. I have a small side business I’ve wanted to pursue full time — something I could build on my own terms. Financially, I’d be okay. I’ve been living modestly off my GS-12 salary and saving my VA benefits, so the loss of income, while not ideal, isn’t catastrophic.\n\nBut it’s still scary. Giving up the GS-12 pay, the job security, and facing the unknowns — especially with the state of the country right now — is weighing heavily on me.\n\nHas anyone else been in a similar position? How did you know it was time to walk away? Any advice or words of wisdom would be greatly appreciated.\n\n",
    "score": 8,
    "url": "https://reddit.com/r/Veterans/comments/1mf3o0k/should_i_stay_or_go_need_advice_from_others_whove/",
    "created_at": "2025-08-01T18:05:34.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1p0zb4l",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "VR&amp;E While Employed.",
    "text": "Kind of a weird situation. Immediately after getting out I landed into what was supposed to be a short contracting gig, where I heard about VR&amp;E. I was upfront with them about being employed but was able to be approved due to the nature of work being uncertain long term. \n\nNow I’ve finished my degree and they’re asking for additional information about where I’m currently employed, which happens to be the same place due to the contract being extended. \n\nI just want a sanity check - is there any type of risk to acknowledging that I’ve been employed in the field this whole time? Specifically asking because they want my wages, which have been very good for my line of work - to the point that I’m less than fully comfortable disclosing my salary. \n\nAdditionally, they say I’ll still rate EAA even if I’m already employed full time in my target career? Does that track? I’ve seen other posts where people get it while still looking for another job, but if I’m already happy where I am then is that still on the table? \n\nSeems too good to be true and I don’t want to risk triggering some flag that makes them want to recoup the benefits I’ve already received. The degree will absolutely help if this job ever goes away, but I have no intention of searching for another job while my current one is still available. ",
    "score": 7,
    "url": "https://reddit.com/r/Veterans/comments/1p0zb4l/vre_while_employed/",
    "created_at": "2025-11-19T05:37:50.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1o62c2z",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "How do individual combatants handle their factions' ever shifting alliances, and having to ally with former enemies and fight against former allies?",
    "text": "While researching the First and Second Liberian Civil Wars, one aspect that caught my attention was those two wars were the epitome of \"warlord playgrounds.\" Each faction involved was caught up fighting multiple fronts, and were too entangled in their own theaters to capitalize on their enemies' distractions.\n\nFor example, the primary rebel group NPFL in the first civil war was fighting ULIMO-K in one region, ULIMO-J in another, the ironically misnamed Liberian Peace Council (who was responsible for some of the most horrific atrocities in a war that was essentially a \"war crime contest\" spectacle) in yet another, and a myriad of regional militias and minor NPFL dissident factions in others. Likewise, ULIMO-K found itself fighting its sister splinter faction ULIMO-J in one theater, the NPFL in another, and the Lofa Defense Forces in a third front. Lastly, ULIMO-J was battling both ULIMO-K and the NPFL while simultaneously dealing with its own bouts of inter-factional fighting.\n\nThe warring parties also were very fluid and fragile, and were essentially a tangled web of loose alliances. They had a tendency to confederate and balkanize on a whim, and alliances shifted almost on a flip of a coin. On one month, two factions would be allies against a common rival. In the next month, the factions then switch into becoming bitter enemies, while one of them aligns with their former common opponent against their estranged \"ally.\"\n\nAs a more specific example, ULIMO split into two bitterly competing factions ULIMO-J and ULIMO-K early on in the war's midpoint, and spent as much time fighting each other as their main enemy NPFL. In the war's latter stages, ULIMO-J had an internal power struggle that turned bloody. Which gave the then newly formed NPFL and ULIMO-K alliance a pretense to attack ULIMO-J leaders in Monrovia for \"murder charges.\"\n\nThe Sierra Leone Civil War, the conjoined twin of the two Liberian Civil Wars, also had similarly blurred allegiances. One of the most crippling issues the Sierra Leone government faced with the fighting the NPFL allied RUF insurgents was the extreme neglect of its Sierra Leone Army (SLA) regular military. An overwhelming majority of SLA units were stiffed of rations, equipment, and salaries by their superiors.\n\nTo compensate for the lack of pay checks and supplies, thousands of SLA soldiers shedded their uniforms at night and joined RUF rebels in their pillaging sprees, and then retreated back to their posts in the morning. From these literally nightly back and forth defections, the RUF rebels got a hold of a massive stockpile of SLA weapons and uniforms.\n\nWith the systematic backsliding of allegiances, the SLA and RUF almost completely merged with one another. The SLA also disintegrated into a loose collection of gangs from the lack of cohesion and discipline. Rouge SLA units, nicknamed \"sobels\" by the civilian population, were very prone to fighting \"civil wars within a civil war\" with pro-government tribal militias and other rival SLA units. During the Sierra Leone Civil War's midpoint, a sizable faction of SLA dissenters assisted the RUF rebels in their capture of Freetown before they were driven out by the Nigerian army and government loyalists.\n\nThis overall made the Liberian and Sierra Leone Civil Wars a very confusing mess for me to study in depth. Alliances in civil wars such as Bosnia, Afghanistan, Myanmar, Syria, and the Democratic Republic of the Congo were also difficult to research for similar reasons.\n\nHow does your average combatant in these sorts of wars deal with ever changing alliances, and having to fight against former allies alongside former enemies?",
    "score": 6,
    "url": "https://reddit.com/r/Military/comments/1o62c2z/how_do_individual_combatants_handle_their/",
    "created_at": "2025-10-14T01:27:09.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1iehtii",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Should I base my civilian salary expectations on RMC instead of base pay when leaving the military?",
    "text": "The military provides a Regular Military Compensation (RMC) calculator that factors in base pay, housing, allowances, and other benefits. For example, if my base pay is $70,000, my RMC might be closer to $116,000 when everything is factored.\n\nSince this total RMC reflects what it actually costs to maintain my lifestyle in the military, should I be looking for civilian jobs that pay closer to that $116,000 rather than just my base pay? I feel like if I only aimed for jobs around my base pay, I’d take a big hit financially since the military covers so many extra expenses.\n\nFor those who have transitioned out, how did you approach this? Did you target jobs that matched your RMC, or did you adjust your expectations in some way? Any advice would be appreciated!",
    "score": 6,
    "url": "https://reddit.com/r/Veterans/comments/1iehtii/should_i_base_my_civilian_salary_expectations_on/",
    "created_at": "2025-01-31T15:51:41.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1iblq7x",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Advice on exiting with a wife &amp; 2 kids",
    "text": "Title says it all, planning my exit about a year out from now. How did you guys pull it off? This economy is rough and I’ve got two one year olds (Twins).\n\nStarting salary for my career field is about 75k, with lots of room for growth, but it’s damn near impossible to have a family of 4 live off of that nowadays.\n\nAll perspectives are welcome, thanks &amp; cheers! ",
    "score": 6,
    "url": "https://reddit.com/r/Veterans/comments/1iblq7x/advice_on_exiting_with_a_wife_2_kids/",
    "created_at": "2025-01-27T22:12:33.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1pd3i0l",
    "subreddit": "Military",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Advise on choosing a branch for reserves",
    "text": "28M, looking at joining reserves primarily for the health insurance benefit for my self and my family as well as the additional retirement in 20 sum odd years. I currently have a very stable and good career  in Insurnace and am only contemplating reserves as I found my employer will cover the salary difference during training. \n\nOut of high school I had joined the Marines but due to bilateral stress fractures in my tibias I wasn’t able to compete trading and was discharged for healing. Separation Code was JFV1 and ReEntry code RS-3P, so a waiver should not be hard to get. Previously I had a linguistics Intel contract and scored 98 on asvab. Should be able to score pretty similar again. \n\nGiven all the above what are your thoughts or experiences between the National Guard and other Reserve divisions of the branches.  \n\nOpen to advice on MOS’s as well. Given the length of training for Linguistics I likely won’t try for that again. ",
    "score": 5,
    "url": "https://reddit.com/r/Military/comments/1pd3i0l/advise_on_choosing_a_branch_for_reserves/",
    "created_at": "2025-12-03T13:00:23.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1kcbryy",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "FMLA for PTSD?",
    "text": "I have a 50 percent PTSD rating. While my work is not phenomenal, my director is very understanding and I'm salary so we've worked around my issues as much as possible. HOWEVER, I have been having a huge backslide mentally and every day is a struggle lately. I'm missing too much work, I feel emotionally burnt out, I'm making critical errors and I feel like I could snap under the pressure. After having an anxiety attack 20 minutes in this morning, I was ready to run for the door and never look back. A coworker asked about getting FMLA.\n\nHas anyone ever used FMLA for PTSD to take a few weeks away? I don't want to lose my job, but in the interm, I'm not sure what to do. ",
    "score": 5,
    "url": "https://reddit.com/r/Veterans/comments/1kcbryy/fmla_for_ptsd/",
    "created_at": "2025-05-01T15:38:04.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1o6z391",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Life Guidance",
    "text": "Hey everyone,\nI’m 23M and just recently got out of the military after 5 years active duty (logistics). Since getting out, I’ve been focusing on real estate — I currently own 6 rental properties and my long-term goal is to own my own apartment complexes and eventually start a property management/development company.\n\nRight now I’m trying to pick a job that’ll help me reach that goal faster. I want to make more money to keep investing and hopefully scale to 20–25 units in the next 3–5 years before 1031-exchanging into apartments.\n\nHere are my 3 options:\n\n1. GS-12 Government Job (Logistics)\n\t•\t~$92k/year\n\t•\t8–4 schedule, weekends and holidays off\n\t•\tVery stable (annual cost-of-living and step increases)\n\t•\tDownside: I did almost the same thing in the military and hated it — that’s why I got out after 5 years. The only benefit is the stability and consistent paycheck.\n\n2. Property Manager – 200+ Unit New Construction Complex\n\t•\t~$70k/year\n\t•\tSalary, sometimes weekends/overtime\n\t•\tIncludes a real estate license (can sell homes on the side for extra income)\n\t•\tI’d be working directly with the owner/developer — great networking and learning opportunity\n\t•\tThere’s also room to move up in the company: potentially into a District Manager or even VP of Property Management role overseeing multiple complexes\n\t•\tThis job is much more aligned with my long-term goals in real estate\n\n3. Maintenance Supervisor – Same Company\n\t•\t~$70k/year\n\t•\tOverseeing maintenance teams across 1,000+ units\n\t•\tDoesn’t include a real estate license\n\t•\tStill in property management but less aligned with my end goals\n\nAll three have pros and cons — one’s stable but boring, the others are more in line with what I love but come with more risk and less pay up front.\n\nIf your long-term dream was to own and manage apartment complexes, which route would you take?\nWould you go for the stability (GS job) to fund investing faster, or get into the property management world to build experience, network, and move up?\n\nAppreciate any insight — especially from anyone who’s transitioned from the military or scaled up from single-family rentals into apartments.",
    "score": 5,
    "url": "https://reddit.com/r/Veterans/comments/1o6z391/life_guidance/",
    "created_at": "2025-10-15T02:23:51.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1nep9dx",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "VA VR&amp;E for Masters Degree and Undergraduate Prerequisites/Refresher Courses?",
    "text": "Just received notification from my VA Vocational Rehabilitation Counselor (VRC) that I am \"entitled to CH31 VRE benefits.\"\n\nI am scheduled on 10/1 to meet with my counselor to \"move into evaluation and planning status where we will conduct a more in depth exploration into how we can assist you in meeting your vocational goals\"\n\nI am asking for VA VR&amp;E to fund an online or resident masters of science in data science/analytics/AI as well as 27 undergraduate credits (3 semesters) or more recent prerequisites (pre-calculus, calculus, linear algebra, statistics, python programming, and R programming.  I am open to full-time online or resident for both undergraduate and graduate programs.\n\nHere are some relevant stats about my background:\n\n* Retired Army officer with 28 years of combined Active/Reserve/ARNG service\n* 90% VA Service Connected Disability\n* Transferred 35 months of Post 9/11 G.I. Bill benefits to my son who is currently in his senior year of a BS ME program\n* Retained 1 month of Post 9/11 G/I Bill benefits for myself because a was previously advised by a VA counselor that if I have remaining G.I. Bill benefits, I can receive BAH/MHA while attending a VR&amp;E program\n* Currently looking at online and resident MS data science/analytics programs\n* Received undergraduate BA Marketing degree in 1994\n* Have worked last 20 years in tech as consultant, solutions engineer, product manager, technical account manager, and program manager.\n\nI discussed with the VA counselor that over the course of my civilian career I deployed multiple times (5x) which hindered my career progression.  I am now competing for lower paying jobs against younger applicants with more relevant educations and need to retrain and refresh my skills to increase opportunities and salary.  My disabilities limit my ability to work in some office environments.\n\nUltimate goal is to reinvent myself as a data scientist with experience in the IC and DoW, current TS-SCI and target SDVOSB contracts for set asides and subcontracts for data analytics and AI integration/policy/development.\n\nHas anyone ever successfully requested something like this and had it approved?\n\nMost likely the schools where I complete the undergraduate prerequisites and masters degrees will be different.\n\nOnly me, no dependents.  I can live anywhere.  Even considering buying an Airstream and finding a site near a school or a multiple military or civilian RV sites, enroll in online programs, and live nomadically for 3 years.\n\nAny advice, experience, recommendations are appreciated.",
    "score": 5,
    "url": "https://reddit.com/r/Veterans/comments/1nep9dx/va_vre_for_masters_degree_and_undergraduate/",
    "created_at": "2025-09-12T00:33:35.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1oqvluu",
    "subreddit": "Veterans",
    "soc_codes": [
      "55-1011",
      "55-2011",
      "55-3011"
    ],
    "title": "Electrical Rate/MOS Types Looking for Work?",
    "text": "If anyone here is  are interested in living in/near Chicago, Illinois or Milwaukee, Wisconsin  my company is hiring big time out here for Field Service Rep positions involving either Secure Power(Uninterruptable Power Supplies), Power Services(Switchboards, and Square D breakers), and ASCO(ASCO products), \n\nPay(\\~75k starting) and benefits are great. Pay is salary non exempt which means that even on weeks you work less than 40 hours, you will atleast get paid for 40 hours and you have access to overtime(there will be overtime). Any weekend work is automatic overtime regardless of your hours that week. Benefits include company vehicle that you can use for everything but vacation, ability to invest in company stock at significant discount with company match, 6% match 401k, 20 days PTO starting for military to include 9-12 days federal holiday PTO, and 2 flex PTO days each year. all travel related stuff is paid for by company up front. Work is generally located at construction sites or already built professional building and data centers. You will be required to perform install/start ups, commissioning, preventative maintenance, and troubleshooting/repairs. \n\nIf you can confidently talk your way through electrical theory, have great customer service demeanor, and don't mind travel. Click on one of the three links below for the three current job postings available. If you do submit an application, please let me know along with your name so I can have the hiring manager keep an eye out for your name.\n\n  \n[https://careers.se.com/jobs/94873?lang=en-us&amp;previousLocale=en-US](https://careers.se.com/jobs/94873?lang=en-us&amp;previousLocale=en-US)\n\n  \n[https://careers.se.com/jobs/95436?lang=en-us&amp;previousLocale=en-US](https://careers.se.com/jobs/95436?lang=en-us&amp;previousLocale=en-US)\n\n  \n[https://careers.se.com/jobs/94369?lang=en-us&amp;previousLocale=en-US](https://careers.se.com/jobs/94369?lang=en-us&amp;previousLocale=en-US)",
    "score": 5,
    "url": "https://reddit.com/r/Veterans/comments/1oqvluu/electrical_ratemos_types_looking_for_work/",
    "created_at": "2025-11-07T14:18:27.000Z",
    "num_comments": 0
  }
]