[
  {
    "id": "reddit-1p4uhzn",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Found another cool microfault",
    "text": "I walk the beach every night looking for microfaults. I’ve only ever found a few but this one might be my new favorite. I love how they look like irl texture pack glitches ",
    "score": 2667,
    "url": "https://reddit.com/r/geology/comments/1p4uhzn/found_another_cool_microfault/",
    "created_at": "2025-11-23T18:46:47.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1n3tw6e",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Interesting Quartzite Formation in Eastern Brazil",
    "text": "I'm a geologist from Wisconsin and living in Houston that works for a Brazilian mining company.  We quarry natural stone all over Brazil, finish it at our factory in Vitoria, and then sell to people all over the world.  I love rocks and I love my job because I get to see really cool things every day that I've never seen before.\n\nMost of it I can figure out pretty easily but this one has had me stumped for awhile.  Its a quartzite quarry in Cachoeiro, on the coast.  What do you think about the structure here?  Its weird that the veins are so close to the surface - was this intrusion from above?  How would it form such thick structures in the mature rock?  \n\nWould be interested to hear some ideas.  I have a bunch more photos and videos if it's helpful to anyone.",
    "score": 702,
    "url": "https://reddit.com/r/geology/comments/1n3tw6e/interesting_quartzite_formation_in_eastern_brazil/",
    "created_at": "2025-08-30T05:47:50.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1m63j3x",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "I’m a woodworker, not a geologist — this entire board of sinker cypress is sparkling like it’s full of crystals. What am I looking at?",
    "text": "Hey folks — I’m a woodworker who specializes in making... Kazoos.... Well I recently milled a board that completely threw me. I know the board is reclaimed old growth sinker cypress from southern Louisiana and that's about all, I work with it all the time but never seen anything like this.\n\nThis piece sparkles throughout the *entire depth* of the wood. It looks like it’s full of crystals — very fine, embedded, highly reflective — like it was dusted with glitter, but it’s actually inside the grain. You can see the sparkle on the raw surface, and I even took some [microscope footage](https://drive.google.com/file/d/17jDKT7Wx3HeuTRTN7rc-kcOXRqP9S1IS/view?usp=sharing) best I could showing what looks like actual crystalline structures. You'll probably have to download it to see well as the drive video encoding is terrible.\n\nI’ve worked with a lot of swamp wood, but I’ve *never* seen anything like this before. I’m guessing maybe silica? Some kind of mineralization? Is it even possible for a board to take on this much crystal content just from submersion?\n\nI don’t know what to make of it. Any ideas what I’m seeing here? Would love your thoughts.",
    "score": 583,
    "url": "https://reddit.com/r/geology/comments/1m63j3x/im_a_woodworker_not_a_geologist_this_entire_board/",
    "created_at": "2025-07-22T03:26:24.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1p6fjbx",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Zealandia Earth’s Submerged Eighth Continent",
    "text": "Geologists recognize Zealandia as a mostly submerged continent in the southwest Pacific. About 94% of it lies underwater, with only New Zealand, New Caledonia, and a few small islands exposed above sea level.\n\n\n\nZealandia has all the features of a continent: a distinct geological makeup, a thick continental crust, and clear tectonic boundaries separate from Australia. It once formed part of the ancient supercontinent Gondwana before breaking away around 80 million years ago.\n\n\n\nOver time, the crust stretched and thinned, causing most of Zealandia to sink. Today, scientists study it through seafloor mapping, rock sampling, and geophysical surveys, revealing ancient mountain belts and fault systems beneath the ocean.\n\n\n\nThe recognition of Zealandia highlights how much of Earth’s geology is still unexplored, even in the 21st century.\n\n",
    "score": 464,
    "url": "https://reddit.com/r/geology/comments/1p6fjbx/zealandia_earths_submerged_eighth_continent/",
    "created_at": "2025-11-25T15:35:25.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1lffsck",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Older career geologists, have you noticed a shift in how people respond to science? Or has it always been this way?",
    "text": "I'm very early in my geology career, I'm in my 20s and just getting started on my PhD and have very limited experience still so I'm hoping to hear perspectives from more experienced professionals. \n\nOne thing I've observed is a weird level of hostility(?) towards geology from a portion of the general public that I find really bizarre. I enjoy research and reading about what other researcher's are working on. So I follow several social media pages dedicated to sharing new findings in geology/related fields. But when I go to the comment sections I'm always shocked to find that the top comments are from absolute looney tune conspiracy theorists who just shit on whatever was posted. Now I know it's social media and it's not the place I can expect to find a bunch of people super educated in a hyperspecific field, but I am surprised to see how consistently hostile people are over basic science. Or how people believe they know better about a subject they've never studied in their lives than scientists. \n\nSo what I'm wondering, for older geologists who've been in the field for several decades, have you noticed a shift in public perception of geology/distrust in science? Or has it always been this way and social media is just amplifying it?",
    "score": 208,
    "url": "https://reddit.com/r/geology/comments/1lffsck/older_career_geologists_have_you_noticed_a_shift/",
    "created_at": "2025-06-19T16:53:40.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1i3jhwy",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "How many people do you know who majored in geology and never worked as a geologist?",
    "text": "I got my BS in 2017. A surprising number of people I graduated with have never worked as a geologist or worked in a closely related field.\n\nI got my MS in 2019, and I still know a handful of people who graduated with me who don’t work as a geologist or in a closely related field dispute having two degrees in geology.\n\nSome of these people I graduated with for my BS/MS worked in geology for a while and then switched careers. In fact, two of these individuals got their BS and MS in geology, went on to pass the Fundamentals of Geology exam, and then never worked as a geologist. They didn’t even get a job in a related field.\n\nIt kind of boggles my mind. A lot of these people got way better grades than me college, yet I’m the only one who has worked as a geologist since graduating.\n\nI’m taking the PG exam in March and I don’t know a *single* person from my undergraduate or graduate career who has their PG or is preparing to take the PG. So many of them haven’t even taken the FG yet.\n\nHas anyone else noticed this or is this a unique situation? ",
    "score": 101,
    "url": "https://reddit.com/r/geology/comments/1i3jhwy/how_many_people_do_you_know_who_majored_in/",
    "created_at": "2025-01-17T15:56:43.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1piq8go",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Geology major here — what do you guys actually do at work?",
    "text": "I’m curious what your label is, how long it took to get there, and what kind of work you do on a day to day basis. Also do you like it? There’s some more rambling below:\n\nWhat kind of work do you think I would find in the SE US? Construction related consulting, monitoring landfills/chemical plants, groundwater, coal mining maybe?\n\nIt seems like such a versatile degree, and I’m thankful for that. But it means I also don’t know what to expect. Some people go into oil, some do consulting, some work for the forest service, some do mining. I looked in my area and the only geology jobs I could find were for construction sites (they paid $18/hr + wanted a bachelor’s).\n\nI can see the versatility of the degree, but I don’t see many jobs in my area that even want geologists. The ones I did find had McDonald’s-level wages. Is this career highly location dependent?\n\nThanks for reading, and any insight is greatly appreciated.\n\nEdit: thank you for all of the replies! There is a treasure trove of info here and I hope that it can help other students as well. It’s finals week so sorry if I can’t reply to everyone. ",
    "score": 70,
    "url": "https://reddit.com/r/geology/comments/1piq8go/geology_major_here_what_do_you_guys_actually_do/",
    "created_at": "2025-12-10T01:59:29.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1kpg3zl",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "I'm a recently graduated 37-year-old female geologist.",
    "text": "Hello everyone,\n\nI’m currently going through a difficult time in my professional journey, and I would truly appreciate any advice or guidance you can offer.\n\nI’m a 37-year-old Colombian woman, and I graduated with a degree in Geology in 2023. After finishing my studies, I decided to go abroad to improve my English, dedicating a little over a year to that goal. Now that I’ve returned, I’m actively searching for job opportunities in any field related to geology, but unfortunately, I haven’t had any success so far.\n\nThe job market is very limited, especially for recent graduates. At the university where I studied, opportunities are heavily influenced by closed networks, and honestly, I don’t have any professional contacts who can support me.\n\nSometimes I feel frustrated and discouraged, and I even question whether studying this career was the right decision. I worry that my age might be an obstacle, or maybe I just don’t know what to think anymore.\n\nThank you for taking the time to read this. Any advice or help would be deeply appreciated.",
    "score": 63,
    "url": "https://reddit.com/r/geology/comments/1kpg3zl/im_a_recently_graduated_37yearold_female_geologist/",
    "created_at": "2025-05-18T09:35:43.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1o7ij09",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Is 38 too late ?",
    "text": "Im looking at my time line, I might not finish my masters til I'm 36-38 (I'm 32 now, 3 semester away from an associates). I want to study hydrology and work in my home country which has many international companies doing operations, as well as a strong need for better ground water systems. \nI'm wondering if 38 is too late to start a career in this field and A) make stable money and B) have a lasting impact in the industry? \nI understand it takes time to work your way up to a meaningful position/ pay with any company in any industry.... \nI guess I'm wondering if geology/ hydrology is similar to being a pilot somehow, where past a certain age it's simply not worth pursuing as a career ? \nAny thoughts, comments or advice on the matter would be appreciated. ",
    "score": 49,
    "url": "https://reddit.com/r/geology/comments/1o7ij09/is_38_too_late/",
    "created_at": "2025-10-15T18:09:52.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1pcr22q",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "What do geologists do?",
    "text": "I want to know what geologist , do for work work on a day to day basis?\n\nAnd, even though this is more personal question, for the people that have a job in geology: is your salary satisfactory and do you think there are job opportunities out there? \n\nI love geology. I love it so much that I'm thinking of attending a geology college in my country.\n But I'm also scared about my future.\n\nGeology as a whole is , I think, less known in my country, so I'm scared about job opportunities that I might have after finishing school. \n\nSo I'm deciding between going straight into geology, or doing something like civil engineering, since it still contains few subjects related to the ground and soil. ",
    "score": 48,
    "url": "https://reddit.com/r/geology/comments/1pcr22q/what_do_geologists_do/",
    "created_at": "2025-12-03T01:37:51.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1ig0ot2",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Geology at 49?",
    "text": "I’m 49, single mom screaming toward an empty nest. I live in the south but have spent a lot of time the past 10 years in the deserts of Utah, Nevada and California. I feel deeply drawn to those landscapes and in awe of the geology behind them. \n\nAs a later in life career shift (I’m in the nonprofit sector) I want to dive into geology. Financially, I’m fine and not needing to make a lot of money in the field. What I do want is the opportunity to work in the field, hands on. \n\nAre there opportunities to work in the field without a degree? Or maybe while working on a degree? It’s fine if it doesn’t pay a lot, I just want to be out there getting my hands dirty and learning as much as possible. I’m even open to volunteer opportunities if that’s a thing? \n\nThanks in advance everyone! ",
    "score": 46,
    "url": "https://reddit.com/r/geology/comments/1ig0ot2/geology_at_49/",
    "created_at": "2025-02-02T16:15:12.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1mrxhl9",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Geologists of reddit...what is your career?",
    "text": "I'm going to college soon! I'm very passionate about geosciences and geology in general. However, I'm not too familiar with their jobs or their salaries. Is it something you can make a good living out of? ",
    "score": 43,
    "url": "https://reddit.com/r/geology/comments/1mrxhl9/geologists_of_redditwhat_is_your_career/",
    "created_at": "2025-08-16T14:53:02.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1im2lbz",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Content Creators about Geology",
    "text": "Hi there! I'm just starting to learn about Geology, because I love Paleontology but sadly were I live is not an Career option, but I discovered that I can study Geology here, so I'm trying to absorb as much knowledge possible, so I would appreciate if you could name your favorite content Creator about Geology,to know a little more about this subject! Thanks for reading!",
    "score": 33,
    "url": "https://reddit.com/r/geology/comments/1im2lbz/content_creators_about_geology/",
    "created_at": "2025-02-10T09:52:59.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1pmip3z",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Hello Geologists",
    "text": "Hello, my 16 year old son plans on attending Michigan Tech to study geology. He needs to conduct an career  interview with 30 questions for his high school English class, and would like to interview a practicing geologist. Is anyone interested? 😊",
    "score": 31,
    "url": "https://reddit.com/r/geology/comments/1pmip3z/hello_geologists/",
    "created_at": "2025-12-14T16:49:49.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1pkec1x",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "What would you say to someone who is inspired to study geology?",
    "text": "Since I was eight years old, I've been passionate about geology, and my main source of interest has been rocks.\nI've become so interested in it that I've even started exploring other subjects like chemistry and physics. I've always been fascinated by the scientific world, and that's why I want to hear from geology professionals about their experiences. How should I approach it? Is it a demanding degree? Does it require a lot of time? And a question for those who are going to study it and for professionals: Did you choose it for the high salary? Or what is it that truly captivated you about geology?",
    "score": 18,
    "url": "https://reddit.com/r/geology/comments/1pkec1x/what_would_you_say_to_someone_who_is_inspired_to/",
    "created_at": "2025-12-12T00:57:15.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1l2azn0",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Getting Back to a Career",
    "text": "Hi everyone, first time poster. I have my BS in Geology that I received in 2016.  I didn’t pursue a job in my field after graduated because I didn’t know how to go about it and I wasn’t aware of the resources back then to help. \n\nNow, after working in retail and other corporate customer service positions, I want advice on how to get myself back on track. \n\nThe problem is, I have no idea where to start. I’ve thought about taking classes to get a certification in GIS from a local college as a start but I know I need more. Is there a branch of geology I need to pick and focus on? Any certifications/licensing I need to obtain? \n\nAny advice would be greatly appreciated!",
    "score": 14,
    "url": "https://reddit.com/r/geology/comments/1l2azn0/getting_back_to_a_career/",
    "created_at": "2025-06-03T12:47:01.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1o8xmuw",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Don’t know what to do",
    "text": "Hey folks. Some advice needed. I graduated with a BSc in geology in September and have started working for a GIS firm, dealing with non-geological satellite interpretation (agriculture, forestry etc). I thought GIS might’ve been good to get into as I enjoyed it in university and it would be a nice way to hone in on skills. I’m about 4 months in. I suppose the work to me feels a bit soulless. I understood going in that it wouldn’t be geology oriented, just wanted to get my foot in the job sector. \n\nI’m not happy, that’s for certain. I almost feel a bit out of my depth. There’s only one other person in the company from a geology background, everyone else either did GIS degrees or geography degrees. I’m trying my absolute hardest to complete the work but I’m messing up and missing small things and in a way I feel a bit inadequate.  The pay is your average entry level wage. I have always loved geology, ever since I was a wee fella and I miss the hands on, outdoor experience of working as a geologist/ geo scientist. I have previous (internship) experience in geotechnical engineering. \n\nI guess I’m just wondering if any veteran geologists/ people in the industry have any advice? Feeling so deflated and embarrassed that I’m thinking of leaving this job so early into my career. I just want to know if it’s worth looking for another job that’s more geology oriented.  (Sorry for the long spiel!).\n",
    "score": 13,
    "url": "https://reddit.com/r/geology/comments/1o8xmuw/dont_know_what_to_do/",
    "created_at": "2025-10-17T10:25:31.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1lzt566",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "What are some skills/courses one should have for better career in geology other than academics??",
    "text": "I am having summer vacations and i want to utilize properly so that i can have better chances of getting a job. I already started learning python and after that i am planning for gis. I just want to know some other skills and courses which are helpful for both experience and cv.",
    "score": 12,
    "url": "https://reddit.com/r/geology/comments/1lzt566/what_are_some_skillscourses_one_should_have_for/",
    "created_at": "2025-07-14T17:45:10.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1pm3m25",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Jobs",
    "text": "Hello All,\n\nI’m 40 and heading back to college, which is both exciting and a little surreal. I recently started a job as a field technician specializing in locating commercial and residential gas utilities, and it unexpectedly reignited a passion for problem-solving, investigation, and working in the field. That experience pushed me toward pursuing an engineering path, ideally with a geology component, with the long-term goal of working in the Houston, Texas area.\n\nI’m very much a jack-of-all-trades and have spent most of my life in hands-on, real-world work, particularly in rural Texas. I’ve built barns and houses, done finish carpentry and cabinetry, worked as a tradesman, repaired and resold vehicles, and operated independently for several years. I funded culinary school at Le Cordon Bleu while working full time, went on to work as an executive chef in multimillion-dollar restaurants, including Michelin-starred environments, and later funded and opened my own restaurant, which has since closed.\n\nI’m sharing this background to make one thing clear: I’m confident in my ability to complete a B.S. program. I’ve balanced demanding work, high responsibility, and long hours before, and I know how to see difficult, long-term projects through.\n\nMy long-term goal is to earn my Professional Engineer (PE) license. At the same time, I’m being realistic about near-term economics, I need a career path that allows me to earn roughly $100k while working toward licensure in order to afford living in the Houston area. Because of that, I’m focused on majors and roles that support field-heavy work, responsibility early on, and strong demand in energy, infrastructure, and utilities.\n\nWhere I’m still seeking clarity is in solidifying my major. My priorities are to remain connected to field work, continue solving practical, technical problems, and follow a path that combines engineering with geology or subsurface understanding. I’m not looking for the easiest route; I’m looking for the right one.\n\nThanks ",
    "score": 11,
    "url": "https://reddit.com/r/geology/comments/1pm3m25/jobs/",
    "created_at": "2025-12-14T03:05:11.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1krffqj",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "I'm Unsure what to do after my bachelors, I know common question, but any incites helpful.",
    "text": "I am a General Geology major at a smaller sub college one of the big Texas College systems. I find a passion for geology, from the field work which I thrive in, to the memorization and lab work which I understand. I am going into my senior year, and with taking more focused classes. I've found that Geomorphology, Geophysics, Sed strat, and pretty much all of the classes I love. I am a high 3 gpa student and get funding because of it. But I'm very much certain that if I go to grad school, out of state I'd have to take loans which I haven't had to do yet. So Im looking for it in state. This is where the problem arises, Idk what to do after. I could either go off and work here in texas or elsewhere, idk if the job market is good enough for a Gen Geology to start well. My parents live in Switzerland so I could go there and work. Or I could go to grad school for a masters, but im reluctant because I don't have anything I'm super interested in. Mile wide 1 in deep aye. So, I thought about a non thesis masters but in what, and what UNI's offer that. They don't advertise it very well tbh.\n\nOne I've seen is an online GIS masters at a big Texas College. But im taking GIS in the fall to see if thats really something Im interested in.\n\nThis is very much a braindump so I apologize but it's been plaguing me for months.\n\n  \nEdit: Thank you all for giving me such helpful advice, I am currently looking at the Careers available based on the different masters, to help me narrow down what I would like to study, since there really isn't a part of geology I don't like. ",
    "score": 10,
    "url": "https://reddit.com/r/geology/comments/1krffqj/im_unsure_what_to_do_after_my_bachelors_i_know/",
    "created_at": "2025-05-20T20:34:02.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1m5z2r6",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "I just got accepted into University, any advice?",
    "text": "I’m going to study earth sciences and I’m very nervous, I’ve always loved physics, biology and chemistry and I felt like this career is all I wanted but I have never really been into geology before, I just never read a book about it or something so I wanted some advice or if you could tell me anything about your experiences it would be great \nSorry for the long post ",
    "score": 9,
    "url": "https://reddit.com/r/geology/comments/1m5z2r6/i_just_got_accepted_into_university_any_advice/",
    "created_at": "2025-07-21T23:53:32.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1kyncl1",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Advice for getting into Geology/Geography fieldwork as a career.",
    "text": "Hi, Im currently finishing my A levels and am on track to be doing a geography BSC course at Uni. For most of my life I've been hiking and walking in the mountains with the past 5 years having upgraded to mountaineering and climbing.\n\nI want to combine both of my passions for a career in a very field work based role. To add to this i would very much like to work on expedition based fieldwork in more remote areas. I turn 18 soon so i can formally start my ML training despite having spent alot of time on my own, with the scouts and the dofe learning and practicing already.\n\nIm from the Uk and not in a mountainous area so ive really been struggling to find a proper path to my, admittedly, lofty goal. I am definitely a little naive to the effort this takes but Im not willing to give up.\n\nMy current plan is to go to uni in a mountain area (I have my offer already) and build connections in the communities both academically and in my climbing/mountaineering.\n\nAfter that waffle does anyone have any advice? Thanks!",
    "score": 9,
    "url": "https://reddit.com/r/geology/comments/1kyncl1/advice_for_getting_into_geologygeography/",
    "created_at": "2025-05-29T21:53:08.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1jfnjh9",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "BA Geology or BS Geosciences",
    "text": "Hi! I’ll be starting University soon in the US during this Fall term! \n\nI got acceptances from University of Colorado Boulder(CU Boulder) for a Geology Degree (BA), and Geosciences (BS) from University of Arizona(UofA). I’m still trying to figure out which major is better since the BS and BA factor is important to me(I want to go for Master’s in Science someday).\n\nMy counsellor told me that BA Geology from CU Boulder is the better option for my future as it has more of a budget Ivy League status. But I do have some financial restrictions which will make it difficult for my family by the second year(if I attended CU Boulder). My parents did tell me to not look at the financial situation and to pick my university. But I don’t want to burden my family, so I am opting for the BS in Geoscience(UofA) since I did receive a scholarship from them. \n\nSo for my question, \nIs this the right choice to make? Or should I go for a BA Geology program instead of BS Geosciences? Does this decision affect my future that much? \n\nI really want to study in this field because of my love for it. I know that I want to go through a Master’s degree and then a PhD. But will choosing BS Geosciences instead of BA Geology affect my career trajectory badly? \n\n",
    "score": 9,
    "url": "https://reddit.com/r/geology/comments/1jfnjh9/ba_geology_or_bs_geosciences/",
    "created_at": "2025-03-20T12:18:01.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1m4uvkg",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Geography or geology degree",
    "text": "I'm unsure whether to study geology or geography. I've always had an interest in geography, and that was my first choice. I took humanities (geography and history) in high school and liked it very much. That's why I chose geography in the first place.\n\n But I've done some additional research and found that a  geology degree would potentially bring more job opportunities. But geology requires math, chemistry and physics. I don't really have any experience in chemistry or physics, and I also struggle with maths quite a bit, and barely got a B. That's why I chose humanities instead of science in high school.  I've also not had any experience with geology before either, So I'm worried that I'll struggle. \n\nI've done a bit more research into geology and geology careers etc, and the more I research, the more I want to study it. But as mentioned before, I'm really worried I'll struggle. \n\nI'm also going to be studying overseas(in the UK), so it's going to be very expensive so I'm really worried I'll make the wrong choice.",
    "score": 9,
    "url": "https://reddit.com/r/geology/comments/1m4uvkg/geography_or_geology_degree/",
    "created_at": "2025-07-20T17:34:54.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1otfyi3",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Geology / Astrophysics Major",
    "text": "hi, so I’m currently a sophomore in college and Ive been working mainly in the astrophysics field, but I’ve come to realize that physics isn’t really my vibe and doing it in college is really stressful. I’m only taking one math and one physics course this semester and I’m already struggling. course registration for the next semester is this week, and I haven’t figured out what I want to major in, much less my classes. I planned out my classes for astrophysics for the next four years and I’m basically doomed to 4 classes back to back of hard math and physics non stop for the next 2years and it’s not something I can handle. I want something more applied, which is why I turned to geology. I’m interested in fieldwork, applying knowledge, instrumentation, and coding. But honestly everything with astrophysics has been stressing me out, but I’m still interested in space. I’m not sure what I want to do in the future, but I want to create a strong foundation for myself, and that would point towards chemistry or physics as a major right? I haven’t taken a geology class, but I’m  curious as to careers, your experience in the field, what you learn, and how you like it. I want to know if I’m suited to a hard stem background or if I should low-key just go back to psych (which is what I wanted to do originally). please give me advice!",
    "score": 8,
    "url": "https://reddit.com/r/geology/comments/1otfyi3/geology_astrophysics_major/",
    "created_at": "2025-11-10T14:58:26.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1p1lcuz",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Trading Scrubs for Rocks and Fossils",
    "text": "I'm 22 and just coming off a pretty draining stretch in a healthcare setting. Honestly, it felt pretty soul-sucking and the pay wasn't really much better from when I used to work at a gas station. So, I am deciding it might be time to jump into something else I am actually passionate about- geology an paleontology.\n\nEven as a kid I've been pretty obsessed with fossils and dinosaurs. Which I know is a fairly common story among dinosaur lovers. But when it came to start college, people told me that if I went into this, I'd basically be signing up for poverty. On top of that, my siblings all went into healthcare, so everyone assumed I would too which added to the preassure to do the same. But now having some personal experience working in healthcare, I'd rather chase something I love, or at least have a genuine interest in, rather for setting for a job that I'll end up regretting for the rest of life.\n\n\n\nI would love to eventually be on the field and work at dig sights or work within a museum setting, but I am also aware of how niche the field is and how hard is for those to get stable job positions (as far as I've read). As a result I have also been looking into other geology routes besides paleontology and keeping an open mind to other routes.\n\n\n\nMy mental plan for now is to get a BS in Geology then getting a MS/PHD in Paleo in the future, but I'm trying to figure out which is the best way to about it while having some kind of cushion to lay back on if it doesn't work out. A plan \"B\". Which is another reason why I've also been looking into other career routes in geology in case paleontology doesn't work out.\n\n\n\nCurrently though, I'm focusing on schools located in Utah and Arizona since I’ve got family there (which helps with my ability to cover tuition) and will making it easier for myself to move around. Any advice, stories, or food for thought on schools, what to study, or ways to get experience in the field would be super appreciated!",
    "score": 8,
    "url": "https://reddit.com/r/geology/comments/1p1lcuz/trading_scrubs_for_rocks_and_fossils/",
    "created_at": "2025-11-19T22:02:59.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1l30syp",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "French/Spanish/German would be more beneficial in a Geology career",
    "text": "Hi, so I have completed my master's in Geology and am currently applying for PhD positions ( my focus is paleontology) \nBetween this I was thinking I should pick up a foreign language as I plan to move abroad and could benefit my career \nMy current options are French/German/ Spanish \nI am asking with the hopes that professionals in the field could help me make a suitable choice.\nUPDATE: Thank you so much for all your suggestions and comments. I think I'll go with Spanish for now :)",
    "score": 8,
    "url": "https://reddit.com/r/geology/comments/1l30syp/frenchspanishgerman_would_be_more_beneficial_in_a/",
    "created_at": "2025-06-04T09:03:03.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1l3lo75",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "r/environmental_careers 2025 career &amp; salary survey",
    "text": "Hello r/geology , your friends &amp; neighbors over at r/environmental_careers has put together their annual career &amp; salary survey for 2025. Feel free to come over and share your salary &amp; career experience.",
    "score": 7,
    "url": "https://reddit.com/r/geology/comments/1l3lo75/renvironmental_careers_2025_career_salary_survey/",
    "created_at": "2025-06-05T00:28:29.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1oczm11",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Career advice",
    "text": "I’m looking for some guidance on changing my career path. I’m a 27-year-old male, two years out from a degree in Environmental Science and Geography. During school, I completed multiple environmental internships with both the state and my university, and I took a number of geology and math courses.\n\nSince graduating, I’ve worked as a GIS field analyst for a major engineering firm and as an environmental geologist at a smaller firm. Right now, I have an interview coming up for an Assistant Project Manager in Materials Engineering, and I also have an offer for a Staff Geologist position at another engineering firm.\n\nThe thing is, my passion isn’t construction or brownfield sites. I really want to move into exploration geology. I love working in harsh conditions, using my tools, and working hands-on in the field.\n\nMy question is: should I pursue certificates related to oil and gas or exploration geology, or should I go straight for a master’s degree? Since I already have academic and field experience, is it okay if I take some classes online?\n\nI’m feeling pretty lost and any advice is greatly appreciated.",
    "score": 7,
    "url": "https://reddit.com/r/geology/comments/1oczm11/career_advice/",
    "created_at": "2025-10-22T05:16:36.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1jlhh5n",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Looking to get into a Geology Career",
    "text": "So I got my bachelors in Film &amp; TV production, and after working in film for four years, I'm getting increasingly tired of the industry and the people.\n\nI really want a big change and I've been looking into Geology, Urban Planning, or Environmental Engineering.\n\nIs it possible to pursue a Masters in Geology without a bachelors degree that's similar to the subject matter? I would take any pre-req classes needed at a local community college.\n\nOr if anyone has any suggestions for environmental-based careers that require just a certification or no additional degree, let me know!",
    "score": 7,
    "url": "https://reddit.com/r/geology/comments/1jlhh5n/looking_to_get_into_a_geology_career/",
    "created_at": "2025-03-27T23:45:23.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1l4nai0",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Engineer ➡️ Geology",
    "text": "Hello all! I am a geotechnical engineer with my PE license and I was wondering if there is a good career path that includes more geology.\n\n- I’d be VERY interested in doing a research degree in geology. It would be so fascinating to me. I’d love to have advice on good (hopefully funded) school programs. \n\n- is there a good reason to get another degree? My first one was in civil engineering. Do you think it would help in some career path or would I just do like a PhD in geology out of interest / for fun basically? I’d love to be convinced that the geology degree would be “worth it”. \n\nThat’s mostly it. Lmk if there’s some great career that is like some sort of engineering geology or something (I’m not interested in petroleum engineering) I’d just love to know more, cause while I know a lot about the civil engineering job market/ culture/ career paths, I don’t know anything about that for geology. ",
    "score": 6,
    "url": "https://reddit.com/r/geology/comments/1l4nai0/engineer_geology/",
    "created_at": "2025-06-06T08:26:57.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1l5htjm",
    "subreddit": "geology",
    "soc_codes": [
      "19-2042"
    ],
    "title": "Best career path for 1st-year geology student aiming for high-paying offshore job?",
    "text": "Hi all,\n\n  \nI'm a first-year geology student and really motivated to build a career offshore. Either in oil &amp; gas, renewables, or marine geology. I'm also aiming long-term for a high-paying role, so I want to make the right decisions early.\n\nI'd love to hear your input on a few things:\n\n* What’s the best career path for someone like me to eventually get a well-paid offshore job in geology or related roles?\n* Which certifications are actually worth investing in right after school (e.g., BOSIET, HUET, GSK, OGUK, IWCF)?\n* Are certain specializations within geology that i should specialize in (e.g., sedimentology, geophysics, geotechnical) that are more in demand or better paid offshore?\n* Is mud logging still a good entry point, or should I aim for something else like data engineering, marine survey, or well-site geology?\n* What are realistic salaries at different stages of an offshore geology career?\n* How long are usually the rotations?\n\nWould really appreciate hearing from anyone with industry experience. Just trying to map things out early so I can make smart choices and eventually get a solid salary offshore.\n\nThanks in advance!",
    "score": 5,
    "url": "https://reddit.com/r/geology/comments/1l5htjm/best_career_path_for_1styear_geology_student/",
    "created_at": "2025-06-07T10:36:36.000Z",
    "num_comments": 1
  }
]