[
  {
    "id": "reddit-1n7kwao",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "My wife gave me 90 minutes to design our wedding invitation and I think I nailed it.",
    "text": "We tried to do it with one of the many templates available online and but hated all of them, and we had to submit our wedding invitation to the printer before the next day. She was about to go get a massage and  said she didn't care anymore and just wanted it done, so I could do whatever I wanted. I took a \"more is more\" approach and just kept adding birds and outlines until I was satisfied. Minimalism is cowardice. She loved it, and her only note was to add the Chrysler building. All the source photos were taken by me, with the exception of the birds and the picture of us.",
    "score": 10389,
    "url": "https://reddit.com/r/graphic_design/comments/1n7kwao/my_wife_gave_me_90_minutes_to_design_our_wedding/",
    "created_at": "2025-09-03T17:17:59.000Z",
    "num_comments": 266
  },
  {
    "id": "reddit-1l1qcd1",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I asked for a hand drawn sketch and got an AI image instead…",
    "text": "Hi guys. Not sure if I chose the right flair but here it goes. I’ve been working with this graphic designer for 3 years now on and off. She made the branding for my bakery and recently, I decided to launch a new product, which is a box of assorted pastries for school and work, and I asked for a design for the box and another for a card with a hand drawn sketch for the back of the card to be attached to each order of the pastry box. This is basically what I got. I paid around $500 for the whole thing before she started working on it and this image was supposed to be the one on the card. I was stunned at what I received, I thought I was imagining it so I asked my niece who’s also a graphic designer and she also confirmed what I was suspecting. I don’t know how to move forward. I’d like to get a refund but I know she will not accept. I’m just really disappointed that she would think I’m stupid enough to fool with an AI image that I could’ve made myself. Any tips on how I can approach her?",
    "score": 3598,
    "url": "https://reddit.com/r/graphic_design/comments/1l1qcd1/i_asked_for_a_hand_drawn_sketch_and_got_an_ai/",
    "created_at": "2025-06-02T18:55:18.000Z",
    "num_comments": 488
  },
  {
    "id": "reddit-1o2hjfw",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Rate my portfolio /10",
    "text": "LINK: [MitchIvin XP](https://mitchivin.com/)\n\nI've posted this a few times over the course of the year and had mixed feedback most of the time. Now its essentially 'finished' so just curious what you guys think of it now?\n\nIf you have a weird idea for your portfolio or the single page style doesn't feel right to you, try something else - from someone who took the chance, I can't express how worth it it's been.\n\n***-----***\n\nTwelve months ago I applied for a job that could have set me on the path toward my dream role in sports. I made it to the final round but fell short because I relied too heavily on social graphics and lacked experience in video and web.\n\nSince then I’ve spent the last year obsessively building those skills. The last six months were fully dedicated to this portfolio, diving into AI coding tools, trying whatever came to mind, going through countless iterations, refactors, and complete rebuilds until everything felt right.\n\nAlong the way I got plenty of negative feedback. People told me nobody would ever look at something like this, that it was a bad idea, that I should make a simple single page portfolio like everyone else.\n\nBut I didn’t feel like everyone else. I knew that kind of portfolio wouldn’t represent who I am or what I can do, especially this early in my career. So I kept going.\n\nIf you told me a year ago what would be happening today I would have said you were dreaming.\n\nTake criticism, but don’t let people stop you from being yourself. That’s where your real value is.\n\nEDIT: I graduated 2 years ago, Those projects are my best projects aside from the portfolio itself. I'm working on them. I knew they weren't good enough to get me a job which is why I thought i'd do something else to get their attention.",
    "score": 1816,
    "url": "https://reddit.com/r/graphic_design/comments/1o2hjfw/rate_my_portfolio_10/",
    "created_at": "2025-10-09T20:51:48.000Z",
    "num_comments": 594
  },
  {
    "id": "reddit-1jelxhc",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I landed my first six-figure graphic design job with 3 years of experience",
    "text": "A few months ago, I didn’t think I was worth anything near six figures. I’m still inexperienced in many areas that could use improvement, and I still have a lot to learn. But my commitment to creating the most value out of what I do have is what got me here. Being confident in your potential is already half the legwork. When you know you can be better, be better.\n\nI'm sharing a few things I did to help me land a new job. Not all of these may be for you. And not all of them may be the right approach. But maybe it'll help somebody out there just a little.\n\n**APPLYING**\n\n1. Apply within 48 hours of the listing being posted. Your chances of being seen are much higher. I got way more responses and invitations to interview when I applied ASAP. \n2. Take another look at your resume to see what you can do to improve it\n   * Make your resume single column and single page – it’s about making it easy to scan with the eyes.\n   * My resume was simple black and white without any fancy fonts. I found a clean typeface and stuck with it while demonstrating my laser perfect layout and hierarchy skills. It’s not “designed” but you can tell a designer made it.\n   * Include skills even if you’re only a beginner in them. Skills can be taught or improved at a new job.\n   * My biggest challenge was that I didn’t have any metrics in my resume descriptions even though I knew I made an impact at every job I’ve been at. But I did my best to structure each bullet with some variation of a challenge + solution + result formula, even if I didn’t have real numbers to support it.\n3. Write a cover letter. It’s boring and a chore, but I believe anything helps and it can help you stand out. I started with a template cover letter and adjusted it slightly for each job I applied to.\n4. Revamp your portfolio or add a new project!\n   * I opted to do a full revamp which took me about a week, but I can say it was well worth it. Don’t worry about making your portfolio super fancy. The juice is in the content. A website that is simple and easy to navigate is solid. \n   * Mockups! When possible, present your work in mockups. I used a bunch of free mockup templates I found on Behance or other free sites\n   * Make sure your portfolio has a healthy variety of projects. For a while, I only had 4 main projects on my portfolio and it wasn't enough. I decided to create some case study/passion projects to bump myself to 6, and I started hearing back more. In fact, my newer projects were mentioned in my interviews.\n   * You don’t need to include *all* of your past design work. In fact, it’s smarter to present only your best work.\n   * If creating a new project and you don’t know where to start, ask ChatGPT to help you come up with ideas! I also used it for things like made up business names or descriptions. \n   * Have some fun. I included a small easter egg for a niche interest in one of my portfolio projects and one of my interviewers pointed it out! It might not mean much but it can build positive rapport. \n\n**INTERVIEW STAGE**\n\n1. Do some research on the company and learn about recent work they did. Scour their LinkedIn + other social media to learn about them. In doing this, I learned that the company was going through a rebrand – I leveraged this info in my interview and helped position myself as a candidate that could help grow and evolve their brand/work.\n2. Paste the job description into ChatGPT and have it create some sample interview questions for you based on the role AND examples of answers you could give.\n   * PRACTICE YOUR INTERVIEW ANSWERS. I was very much overprepared but it made my interviewing process way more streamlined and feel more natural. \n3. “What makes you stand out from the rest of the candidates/competition?” I practiced this question before the interview and I went all in and nailed it. Of course I don’t know who I’m competing against, but I’m choosing to believe I am the absolute best hire they’ll make. They wanna learn something new about you that they can’t see from your resume or portfolio. Don’t be intimidated–this isn’t about the competition right now. This is about you and what you can do to help them win more business. Here’s what I said: “I’d like to say I’m exceptionally creative, but hopefully you saw that in my portfolio. Instead, I’ll say that I am reliable. I am great at execution and I deliver results when you need them. When somebody needs help, they come to me and they never have to worry about whether or not I can get the job done. That trust that I foster with my teammates makes me the most reliable person on the team. I’m confident I’ll be the most adaptable hire you can make.” I really believe this answer got me the job. And I believe in everything I said in my answer. So don’t just claim your confidence, own it. \n4. Some things you gotta bullshit a little, but sell it like you know what you’re talking about. If you get stuck, shift the discussion towards your eagerness to learn more. “I haven’t done that type of work regularly, but it has always been super rewarding when I have. I understand how important it is to the business and I’m always learning more about what I can do to improve results. I’m excited to learn more about how I could use it effectively in the work we do.” See? That was a whole lot of nothing – but I’ve rinsed and repeated that a few times and it did the job.\n5. Ask questions at the end of the interview. It shows that you’re interested in them and want to work for them. Here are some questions I asked\n   * What about me stood out to you?\n   * What does your team structure and workflow look like?\n   * What’s the value you hope I can bring to the team?\n   * How do you decide which clients and projects to take on?\n   * What’s your favorite thing about working here and then what is one of the bigger challenges you have working in your role?\n   * Bonus: if you can come up with a question based on something they mentioned during the interview, it shows you’re paying attention and interested in learning more. \n6. Be polite. Send a follow up email to thank them for their time. I typically waited 2-3 days to send one. \n\nI know the job market is tough right now. At some point, I even thought about changing careers. But if you believe you’re the best at what you do and you believe in your worth, then you won't give up. I really wasn’t consistent with my applications or the quality of my portfolio or resume at all throughout my journey to find a new job. I wasted a lot of time procrastinating and pitying myself. But I was persistent. I demanded the best of myself each time I came up with something new. I know it’s easy to say now on the other side of the road, but I promise you it will be okay. Give it all you can so you know you didn’t leave anything on the table. Don’t forget to take breaks, stretch, and breathe.\n\nGood luck! \n\n**EDIT:** Wow, I didn't expect this post to get the attention it did. I've received some comments about how this helped boost confidence--I'm humbled and grateful you took the time to read it. I'm happy I could help even just one person.\n\nI've received even more requests for my portfolio as well as doing portfolio reviews. You're welcome to DM me for my portfolio link if you are really interested in seeing it. I still have some reservations cause it's not the best and I certainly need to add more, but somehow I got away with it. Part of being a creative is always wondering if you're worth it. Imposter syndrome is real and I intend on proving I'm worth this job! Know that you are not alone. As for doing private portfolio reviews--I've done a handful now, but I think it'll be even more helpful if you just read through this [extensive portfolio guide](https://www.reddit.com/r/graphic_design/comments/u14sxx/portfolio_advice_for_new_designers/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) posted by u/PlasmicSteve. It pretty much covers everything you need.\n\nFor more context: This is a corporate job in tech in a major US city. I failed to note salary/comp negotiation as part of my process--but that's a whole 'nother challenge and I'm sure you can find better resources for that than here.\n\nI also wanted to reiterate that this is just one experience out of many. I got hundreds of rejections before I got any offers--so there's no way I did everything right. In my heart, design is an art form. But in their pockets, design is a service, so that's just how I approached it in order to get the job. Take what resonates and leave what doesn't. Thank you everyone.",
    "score": 1509,
    "url": "https://reddit.com/r/graphic_design/comments/1jelxhc/i_landed_my_first_sixfigure_graphic_design_job/",
    "created_at": "2025-03-19T01:38:50.000Z",
    "num_comments": 180
  },
  {
    "id": "reddit-1ltt8w3",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I'm so sick of being a designer",
    "text": "Let me preface this by saying that this is 100% a rant post and I don't have peers to speak to this about without it being frowned upon.\n\nI know this is such a well documented way of thinking among people working in the \"creative\" industry but I'm so damn sick of working as a designer. This year I've been in it for 5 years and managed to progress to a senior role working for massive 7-9 figure ecom brands that a lot of people across multiple countries knows well in their respective niches - and I hate every moment of it.\n\nI'm tired of running the same 3 designs through 5 sets of revisions before clients are finally happy with it\n\nI'm tired of sitting in meetings listening to said clients talking about these crazy ideas and providing us with 0 content to produce them\n\nI'm tired of hearing clients call designs disappointing after they fail to tell us what it is that they want and can't answer our questions when we try to figure it out\n\nI'm tired of only receiving feedback 2 weeks after submissions for them to tell me that the feedback needs to be implemented today (After multiple rounds of follow ups) \n\nI'm tired of earning a shitty wage after giving it my all and feeling that all my experience has amounted to so little financial growth.\n\nI'm tired of clients pushing for more AI stuff and when we do they tell us how bad it is and we need to scrap it\n\nI'm tired of their corporate bullshit attitude and lack of human connection\n\nI'm tired of all of the above wasting my time and making me feel like my professional career is worthless.\n\nI'm tired of clients threatening to leave to hire an agency in the Phillipenes on upwork to take over their work and feeling the need to spin on my head to keep them happy to avoid them from leaving. \n\nAnd this is just scratching the surface. \n\nIm so fucking sick of how horrendously bad people are treating us because they perceive our industry to be low skill because of the infinite amount of options out there or their cousin's son is studying design and they'll get them to do it instead\n\nDownvote me or upvote me - I don't care. I just needed to get this out of my system",
    "score": 1335,
    "url": "https://reddit.com/r/graphic_design/comments/1ltt8w3/im_so_sick_of_being_a_designer/",
    "created_at": "2025-07-07T12:46:26.000Z",
    "num_comments": 187
  },
  {
    "id": "reddit-1oim4n4",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I went and made that AI-Poisoning app for image protection I posted recently about. Ghostprints is now live and free for all artists.",
    "text": "Hey everyone,\n\nA while back I posted an idea for a tool to protect your art from AI scrapers and subsequent training. After a lot of work, the app is finished and live. It's called Ghostprints.\n\nI've decided to make it completely free for everyone to use. I'd rather we all have access to protection. There's a donation button on the site to help pay for the hosting and GPU compute costs, but it's not required at all.\n\nThe app is at: https://ghostprints.app\n\nWhat it does is add a \"poison\" to your images. It's mathematically toxic to any AI that tries to train on it and will disrupt their model. It's not a watermark; the protection is embedded in the image's structure, so it's much harder to remove.\n\nI built this for a real artist's workflow. It's a web app for your desktop, not a phone app. It has batch processing so you can protect a bunch of images at once. It also has a \"Stamp\" tool for adding your provenance info to files and a \"Vault\" tool to fully encrypt your master files before you send them to clients.\n\nMost importantly, the whole app is serverless. Your images are never uploaded, saved, or logged anywhere.\nPlease try it out and feel free to share it with anyone you'd like. The more of us who poison their work, the more expensive we make it for them to steal it.\n\nLet me know what you think.\n\nFull disclosure: I am a professional AI engineer for a living now, but before that I had a solid career as musician and producer until it became unviable for similar reasons to what the image artist community is going through. My goal is to help change the AI industry from the inside, hence why I built this tool using everything I've learned\n",
    "score": 1166,
    "url": "https://reddit.com/r/graphic_design/comments/1oim4n4/i_went_and_made_that_aipoisoning_app_for_image/",
    "created_at": "2025-10-28T21:31:55.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1jk8nse",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I feel like I’ve wasted 15 years of my life",
    "text": "I feel like I’ve wasted 15 years of my life, and my career has led me nowhere. At 35, I should be at my peak in terms of earnings and health, yet I’m a nobody. I keep ending up in shitty companies where I’m expected to do everything while getting paid shit. For the past 8 years, I’ve designed pretty much everything. Photoshop, Illustrator, Indesign, After Effect, 3ds Max, Vray, Photography, Social Media, Modeling, Animations, and Simulations - but it is not good enough. \"You should learn more tools like Figma, Blender, and Canva\" - I am tired boss... If I had focused on one thing from the start, I’d be an expert in a specific field by now and making decent money. Unfortunately, the harsh truth is this: if you are good at everything that means you are good at nothing. Now no one is looking for a 35-year-old guy who has done everything (but nothing specific) because they have 100 young, dynamic lads fresh out of college to choose from. If companies looking for someone with 5+ years of experience, they want an expert in the specific field. The competition in the big city is just too strong. I will be honest, I've wasted the last 6 years on depression after my MS diagnosis - it gave me nothing and took a lot. I am stuck working part-time from home when my colleague (who started with me) is making very good money just doing Figma/Photoshop. I don't know how to push my career forward. I am starting to realize that my skills and software knowledge are worth shit and now it is too late. I don't even know what I like to do.",
    "score": 1123,
    "url": "https://reddit.com/r/graphic_design/comments/1jk8nse/i_feel_like_ive_wasted_15_years_of_my_life/",
    "created_at": "2025-03-26T10:32:34.000Z",
    "num_comments": 328
  },
  {
    "id": "reddit-1jwwwsw",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I like Futura and I’m tired of pretending I don’t.",
    "text": "It’s a really nice geometric sans serif that has some of the most interesting history of any typeface. I don’t use it often in work, but I constantly use it for person project. I have made multiple Futura type posters that I hang on my wall. \n\nWhenever other designers ask me what my favorite font is I always say Futura and they always give me funny looks and talk about how it’s over used. \n\nOne person asked “have you ever read ‘Never Use Futura’ by Douglas Thomas?” Yes I have, that’s a major reason why I love it. I asked them if they have read it and they said no. Which is obvious because the point of the book isn’t actually to not use Futura. I swear design professors just indoctrinate students with anti-Futura messaging and bring up that book and then their students carry it on through their entire design careers.  ",
    "score": 871,
    "url": "https://reddit.com/r/graphic_design/comments/1jwwwsw/i_like_futura_and_im_tired_of_pretending_i_dont/",
    "created_at": "2025-04-11T18:27:28.000Z",
    "num_comments": 148
  },
  {
    "id": "reddit-1kj1308",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Can what I make realistically be applied to the Graphic Design field?",
    "text": "I'm 16 years old and have been working with Photoshop for about little above a year now and by no means do I consider myself proficient. That being said, I have always made projects that feel fun and fulfilling for my own sake. I initially began learning with the intent to work in some field of design, however, as I continue making more and more, I realize that the stuff I usually put out is not what I think most people would label as a form of graphic design. Through this, I feel like I have kind of lost some direction in where I actually could be able to apply myself in the real world. I know I'm young and have time, but any help would be appreciated regarding realistic standards and what I should start working on to potentially have a career in this field. Thanks.",
    "score": 676,
    "url": "https://reddit.com/r/graphic_design/comments/1kj1308/can_what_i_make_realistically_be_applied_to_the/",
    "created_at": "2025-05-10T03:39:59.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1ni9sdr",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "AI makes me feel like a fool",
    "text": "When I see AI art, I think of how many countless hours I've spent doing freelance work as a single father to pay the bills, how hard I worked, lost time I could've spent with friends or even my kid because I had to work instead, only to output modest works at best. I think of how far it got me. Then I think of how every other artist worked just as hard, if not harder, just to accomplish a piece or a project. \n\nThen I see all this AI stuff, built on everyone's hard work, and all these losers coming up in popularity and social media clout from the backs of hardworking legitimate artists. It makes me mad. It hurts. It makes me feel stupid for chasing a dream. \n\n\nMy freelance work hasn't been too impacted in income, but I feel like I'm falling off now, destined to become stuck in my ways and fade into irrelevance. I try to pick up new skills but I can't help but feel like I'm losing that edge. It makes me feel like the career I love is at a dead end. I don't want to advance into other roles or positions, I just wanted to be a damn good designer, but it feels like it's slipping from me. I feel like it's foolish to keep trying and just move onto something else.\n\n\nI built my life around this. My family counts on me to feed them with this. I wish my dream wasn't shadowed by stolen valor. I don't know. I just needed somewhere to rant. I'm sad tonight. I don't know what I need to hear, but I just need to let it out that. \n\nWhat do I do?",
    "score": 591,
    "url": "https://reddit.com/r/graphic_design/comments/1ni9sdr/ai_makes_me_feel_like_a_fool/",
    "created_at": "2025-09-16T06:16:31.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1o4vqvp",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "UPDATE: I finally left my underpaid Lead role. Got a 75% raise and validation I was worth even more.",
    "text": "About 3 months ago, I [posted here about being promoted to Creative Lead without a raise.](https://www.reddit.com/r/graphic_design/comments/1lhj8sp/i_joined_as_a_senior_designer_got_promoted_to/)\n\nI worked my ass off at my last job, I have proven myself to unprecedented limits, taking a lot of workload that wasn't even mine, yet I kept delivering for free, never saying no\n\nYet when I asked for a raise or an actual reflection of my responsibilities and role, all I got was delays and empty promises from my spineless manager. \n\nThe final straw was when my manager tried to \"ease\" off my workload by asking me to find a junior designer to handle the workload with me. Then while interviewing some junior designers, I found out they're all getting paid more than me already, and would only join for more (naturally).\n\nI decided that was it and I started applying jobs, and the results were shocking, I got countless interviews, legitimately more than I could count. Not all the offers were great, only 3 matched the salary I was aiming for (what I knew I actually deserved according to market rates this time).\n\nand I got accepted at all 3 with the offers sent to my email pending my signature, I went ahead with one of them. They offered a 75% pay raise (they never knew my actual salary, I only told them what I wanted and it was that).\n\nThe new job has less workload, less chaos and better structure/leadership. The job title is senior and it's the same as my last job without leadership (which honestly was excess work without any recognition/compensation)\n\nHere's the kicker though, In a casual chat, my new manager admitted he had interviewed amazing candidates and had budgeted higher than what I asked for. He literally said I could've asked for 30–40% more on top of the 75% jump and still been within budget. (He had no idea what I used to make, of course.) Although he did mention that I might get a raise soon (which surprised me since it's still so early)\n\nNow I'm a Senior Designer again which is technically a \"demotion\" on paper. but it feels like a promotion in every other way. More balance, better pay, and I’m being seen for what I bring to the table. He even mentioned a potential Lead role down the line, but I'm not in a rush, I still have PTSD from that.\n\nJust wanted to close the loop on my previous post and maybe encourage anyone else stuck in the same situation: If your company won't value you, someone else fucking will. And often, you're worth more than even your best guess.",
    "score": 548,
    "url": "https://reddit.com/r/graphic_design/comments/1o4vqvp/update_i_finally_left_my_underpaid_lead_role_got/",
    "created_at": "2025-10-12T17:52:20.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1meask2",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Say No to 'Short Sample Projects' When Looking For Jobs",
    "text": "While applying for design jobs on Indeed...this was the first time I've ran across this particular 'scam' where it was a real local marketing company posting and then trying to swindle 3 whole designs for 3 very real local businesses for free with a week deadline. All while stating the 'prompts were fictional'.\n\nI only responded this way as I was barely interested in the first place, due to the low salary. However I was curious if they were interested in working together, since they are local to my area and seemed legit. \n\nI've been a professional designer for over 20 years, but even if you're new and desperate, don't fall for this crap. If your portfolio isn't enough for them to showcase your skills, it's not gonna be a real gig. \n\nDon't design for free, unless your donating your time for a good cause. Even then, track your hours and write it off if applicable, or track for personal stats. Promises don't pay the bills, and you can't cash samples at the bank.",
    "score": 537,
    "url": "https://reddit.com/r/graphic_design/comments/1meask2/say_no_to_short_sample_projects_when_looking_for/",
    "created_at": "2025-07-31T19:21:42.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1mwhxba",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "This subreddit is now 99% 'posters' but FYI...",
    "text": "...you'll be lucky if that's 1% of your actual work as a graphic designer. \n\nNo beef against posters. Make them if you can!\n\nI just wonder if a lot of people here think 'poster design' is a viable career for a lot of people. (It's not!)\n\n",
    "score": 505,
    "url": "https://reddit.com/r/graphic_design/comments/1mwhxba/this_subreddit_is_now_99_posters_but_fyi/",
    "created_at": "2025-08-21T17:44:56.000Z",
    "num_comments": 122
  },
  {
    "id": "reddit-1jv5wwo",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Prove Your Worth - Things are about to get WEIRD",
    "text": "Hi friends. \n\nI work in-house for an international home goods manufacturer and retailer. \n\nDue to the massive tariffs that have been levied against most consumer goods exporters, things are about to get bonkers. \n\nVendors overseas are halting taking orders from US customers because they think we will cancel orders before production is complete or not pay for our goods.\n\nThe ripple effect of this will be massive and will affect everyone here. Corporations will be laying folks off and pausing all hiring. The first roles to go are creatives. \n\nThis further supports a lesson I’ve learned over the past several years: YOU HAVE TO PROVE THE ROI FOR YOUR SALARY. Many of us are in positions where it’s not easy to say “I earned this much money for the company.” We don’t have revenue and overhead numbers like sales or production to point to when it comes down to proving our worth. \n\nFigure out how to do this for your role. Figure out actual profits gained from your work. This is not always easy and it takes some creative problem solving. Here are some ways to do this:\n\n- Start tracking your time. If you don’t work for an agency that requires this already, start doing it now. There are spreadsheet templates out there that will tally up these times by task or project or client.\n\n- Find before and after numbers. If you rebranded something, redesigned packaging, changed the brand guides around social media, etc. figure out how you increased profits, social engagement, search ranking, anything. You need metrics to show your contributions.\n\n- If you are working on tasks that are above your pay grade, look into how much that would cost to employ that role. I don’t mean to talk about how you write copy and retouch photos and whatever. You don’t need to complain about all the hats you wear. You need to show that you’re a bargain for what they’re getting. \n\n- Improve efficiency and efficacy across the entire company. Create templates and documents and asset management that saves non-creatives time and money. For instance, if you have created sales collateral for your account managers that have lead to increased revenue, that makes you more than a designer. If you’re creating PPT templates for the executive team that helps them communicate more clearly with investors or clients, that’s a win for your entire business. If you have streamlined brand guidance and asset management, figure out how much time that saved the company. I built a DAM for my company and the clearest success is that nobody asks us where assets are anymore. The metadata is robust and the platform is basically Google for all design, photo, and video assets. Any type of user can navigate it, which cuts the barrier to execution down to nothing. \n\n- Lean into AI. Even if you hate it. We all do. Show that you’ve done research and have improved your process by using all the free tools in front of you. Show that you are that much more powerful than before due to your ability to use cohesive and effective prompts to get the most out of AI. Explain that you’ve learned that these tools are only as good as the input, and you’ve mastered the techniques. Garbage in, garbage out. \n\n\nI’m not usually a doomsday kinda girl, but it’s only been a week and I’m already girding myself for the massive domino effect this is going to have on every industry. \n\nRemember, clients have budgets. Non-profits have donors. Government jobs need funding. These pipelines collapse when things like this happen. \n\nPlease protect yourself and your jobs! We know they need us more than they realize. Show it. ",
    "score": 433,
    "url": "https://reddit.com/r/graphic_design/comments/1jv5wwo/prove_your_worth_things_are_about_to_get_weird/",
    "created_at": "2025-04-09T13:34:23.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1otduko",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I am angry and burnt out and sad",
    "text": "I keep seeing posts like *“Graphic design isn’t dying — it’s evolving! Just adapt and you’ll be fine.”*\n\nBut can we be honest for a moment? Like, CAN WE? I am employed as a graphic designer, but if I were to get fired tomorrow I would never pursue this career ever again.\n\nI don't know about you guys, but besides designing I also like to....live life? You know, chill out with my friends, go hiking, bake, cook. Basic, simple life. Which you cant do if you have to constantly update your freaking portfolio and skills that gets outdated every 6 months!!!\n\nDoesn’t it feel defeating that tools like Canva can now do, in minutes, things we spent months or years learning? That the hours we invested into mastering Photoshop, Illustrator, InDesign ......can suddenly be replaced by a template or an AI prompt? I can't believe I am in the same pool as some random chick who just learned to do Canva and calls herself a graphic designer? How are we even on the same level? After so many years of effort, I feel so defeated man...Like why the F did I even go to University for? \n\nI’m tired. Tired of constantly having to learn new freakin tools just to *stay relevant*. Tired of running on a treadmill that freakin never stops. Tired of being told to “just adapt” while the pay stays the same… or gets worse and you are expected to grow 2 extra pair of hands just to keep up with the insane demands that should have never been our tasks to begin with.\n\nI loved designing. I’ve been in this industry for 7 years. But lately, it feels like throwing pearls to pigs. Everyone can learn Canva, AI tools, even Figma, and clients can’t tell the difference anymore. As long as you are cheap, you are good to go.\n\nI’m overwhelmed. Burned out from keeping up with every new trend, update, and tool. And the painful part? All that effort isn’t even being paid fairly.\n\n  \nI don't know what to do with my professional life anymore....Anyone else wants to quit?\n\n  \n",
    "score": 421,
    "url": "https://reddit.com/r/graphic_design/comments/1otduko/i_am_angry_and_burnt_out_and_sad/",
    "created_at": "2025-11-10T13:32:38.000Z",
    "num_comments": 137
  },
  {
    "id": "reddit-1hvtfu7",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "An Art Director's advice for Graphic Designers looking to move up",
    "text": "As someone who worked as a graphic designer for nearly a decade before making the jump to an art director role, I found the path upward to be convoluted and challenging. In my experience, the career ladder isn't as clearly defined for creatives as it is for some other professions.\n\nWith that in mind, I wanted to put together some tips, resources, and recap the steps I took to become a creative leader in hopes of helping other designers do the same. I've summarized the actionable steps below, as well as put together a long form video for those wanting to do a deeper dive: [https://youtu.be/Tak3wxxtRxY](https://youtu.be/Tak3wxxtRxY)\n\n**The Skills You Need to Become an Art Director:**\n\n* **Creative Vision**\n   * Become a creative vacuum - study art history, pay attention to the world around you, be aware of what competitors are doing, stay up to date on trends and new software, etc. Practice drawing on this wide range of sources to synthesize new ideas for projects.\n* **Leadership**\n   * Pay attention to creative leaders that you respect. How do they speak to people? What systems do they have in place? What makes them successful? Meet with them if you can to pick their brain, or better yet become their mentee if possible.\n* **Communication**\n   * Look for opportunities to speak at all hands meetings, explain your work, grow your design vocabulary, and pitch projects to stakeholders. This is sometimes a forgotten-about skill for designers, but is key for art direction.\n\n**The Steps to Take to Make the Jump:**\n\n* **Talk to Your Manager**\n   * A good manager will be excited to see that you’re driven to grow and will start finding opportunities for you to expand your skillset. You can come up with a plan together that will allow you to dip your toes into things like concept creation, leadership, and pitching - even just starting to sit in on these meetings will be a big help in gaining some real world experience.\n* **Find Small Opportunities to Practice**\n   * For example to gain leadership experience, you can volunteer to take on more responsibility in team projects, mentor other designers at your local AIGA chapter, or convince your company to hire an intern. I actually did all three of these myself when I was a designer and was able to quickly start growing my management skills.\n   * To gain experience thinking strategically, ask to sit in on project planning meetings, request access to wrap reports, and ask to be a part of campaign debriefs. These are low stakes ways for you to start learning the vocabulary, understanding what’s driving successful projects, and seeing what sort of metrics are getting tracked.\n* **Start freelancing**\n   * Working directly with clients allows you to lead a project from start to finish from kick off calls, to goal setting, to forming the full creative vision. Freelance projects will help you grow, get you out of your comfort zone, and earn some extra money to boot.\n   * If you can't find paying clients, volunteer work is a great way to get experience as well. Plus you get to help a cause you're passionate about and feel great doing it.\n* **Update Your Portfolio**\n   * Once you start getting experience leading the creative vision for campaigns, tracking metrics, and leading others, you’ll want to start showcasing those things in your design portfolio.\n   * Be sure to speak to your role in each project, highlight KPIs, and tell a story with each portfolio piece. At the end of the day, the goal of your portfolio is to show people that you can be successful in the role, so be sure to keep that in mind at every step of the way.\n\nHopefully any designers looking to make the jump to art director find this helpful! Let me know if anyone has any other tips of your own or questions about the journey in the comments.",
    "score": 407,
    "url": "https://reddit.com/r/graphic_design/comments/1hvtfu7/an_art_directors_advice_for_graphic_designers/",
    "created_at": "2025-01-07T15:07:48.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1l6pqre",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Want to be a successful Graphic Designer?",
    "text": "Go to art/design school.\n\nMaybe I'm just old and things like youtube weren't really around when I started, but IMO, if you want the best chance at being a successful designer, both from a standpoint of being good at it AND being hirable, go to school.\n\nI bring this up because it seems like a vast quantity of folks posting here are like \"hmmmm... graphic design might be fun. I always liked to draw. My mum said I'm creative. I'll watch some youtube vids and learn how to use Adobe Photoshop. But a whole year later no one will hire me! Or I'm a new freelancer but I can't find clients! 😭😭😭😭😭😭\n\nWhy do you view a career in graphic design differently from something like engineering? Or Finance? Or even a trade like an Electrician? Just because you can download some software? What about composition? Color theory? Basic design concepts like negative space? Typography? Learning how to draw, paint, sculpt, etc? Art history? Design history?\n\nY'all can downvote me as much as you want but I stand by my opinion. There will always be those who are naturally gifted in any field, but most need actual training. Training from those with vastly more experience than you. And also knowledge and experience gained from your peers and being immersed. While in school, look for real-world training opportunities in actual studios/agencies. Whether it be working for a one person studio or a 100 person agency. Whether paid or as an unpaid intern. The important thing is getting real world experience in the field. Once school is done, now you can look for a full time gig. Do this. Work for someone else for at least a few years. Again, the experience you gain in this time will be invaluable. Only then should you even consider going out on your own. And you may not even want to. Me? I never thought this would happen but I've been at the same studio for 25 years now. I'm content enough to let someone else harbor all the stress of finding clients, making payroll every month, paying all the other bills, etc. I like just focusing on being a designer, having insurance and a 401k contribution. But others may love all that other stuff and being their own boss, blah blah blah. I get it. You'll just be far more successful at it learning the ropes under other people first.\n\nAgain, this may not be what some of you want to hear and I'm sure some of you will disagree with me, but I bet there are some of you with a decade or two of experience under your belts who will know where I'm coming from. And in no way am I saying that what I'm suggesting will guarantee a goddamn thing. You may have already gone through all this and are still struggling for any of a myriad of reasons. I'm just trying to wake up some folks and give them a fighting chance.",
    "score": 405,
    "url": "https://reddit.com/r/graphic_design/comments/1l6pqre/want_to_be_a_successful_graphic_designer/",
    "created_at": "2025-06-08T23:13:36.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1kcgojx",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Tips on getting hired from 20+ yr Agency Owner",
    "text": "\\-------- UPDATE May 2nd ---------\n\nCouple of great questions in the comments I wanted to surface.\n\n* It seems my example for outreach is too long. Here's a short version that fits within a connection request message (300 chars) on LinkedIn\n\n*Hi {name}, I hope you don't mind this message. {job title here} is a great opportunity so I'm sure you've had a lot of applicants. I'd love to learn more about {company name}'s needs and if I might be a good fit.  Here's a recent project for reference: https://bit.ly/12345. - Thank you*\n\n(Use a service like Bitly as it is short, but also let's you see if they actually click the link!)\n\n* Networking is more important than just applying to jobs (still apply, but you gotta speak to people)\n* Go to local community events, small business meet-ups, anything with lot's of people and hand out some business cards with a QR code to your portfolio.\n* Resources for Design theory and best practices:  (not hands on application), Books published by a real publisher. Amazon will name the publisher under the description. If there isn't one it is self published. I have friends who have self-published INCREDIBLE books -- but, there are so many that are not good I suggest sticking to traditional. Especially for a topic like design theory, which essentially hasn't gone out of date. The way we do design changes all the time, but the core fundamentals are the same. If you have a library near by, they're also free.\n* Gaps on resume:  I always like hiring freelancers as they're self-starters / motivated / have broader experience. To be safe, I would: \n* \\- Create a company page on LinkedIn (anyone can do it)\n* \\- Name it your name or whatever you use when billing clients\n* \\- Add that company to your job history. Then there is no gap. Add in descriptions of the types of projects you did and ideally success stories of how you helped clients to the company page.  It's pretty common for creatives to bounce between inhouse &lt;&gt; Agency &lt;&gt; Freelancer.\n* Using Gen AI in portfolio: This is a huge topic, but basically, as long as you are not misrepresenting your work it is fine. Hopefully you are not just doing prompt &gt; image &gt; portfolio. BUT if you are generating concepts, ideas, even imagery that is then used as part of a layout or composition, I see no problem with it. Just explain the process. For me it's no different to using stock photography - don't pretend you took the actual stock photo yourself used in the design, AI generated imagery is no different. \n\n  \nFinally, for the job itself. There is no way for me to bulk email all applicants through LinkedIn. I can only do 25 at a time. But, I feel obligated to do so, so this will be my weekend!   \n  \nThis whole experience has made me feel pretty awful tbh. Literally couldn't sleep last night. I have two young daughters who are both very much into art &amp; design and I am encouraging them, but it does give me pause.  \n  \nSo, for all the applicants,  I am offering to answer any Qs they have, or any help I can provide. My agency is small, and can't hire more than a couple at a time, but will do what I can to help. Thanks for the DMs, I'll continue to answer them too. \n\n\\----------- Original Post-----------\n\nYesterday I posted a job on LinkedIn for a Contract Junior Designer. I logged in this morning and to my surprise and honestly horror (I'll explain) I have 1,300 applicants in less than 24 hours.\n\n# 1,300 in less than 24 hours.\n\n**I still can't believe it. So, I am writing this as a guide to everyone out there trying to get their creative career going.**\n\nSo why was I horrified? Well, I knew that people were finding it hard to get hired. In the past, I may have gotten 100+ in 24 hours. But this is like nothing I have ever seen in 20+ years of getting hired and hiring designers.\n\nThe cold, hard truth about getting a job is that you are exponentially more likely to get hired if you know someone that can refer you.\n\nIt's not fair, it sucks, it means talent gets missed, but it is true.\n\nSo, while you need to apply for jobs, the number one priority is networking. Ask around, be shameless, be relentless, BE ANNOYING. You need to speak to as many people as possible.\n\nWith that in mind, here are the best ways to get hired based on my own personal experience.\n\n# You MUST make a killer portfolio.\n\nWhen starting out, this is the hardest, most sole-crushing part.\n\nNOBODY likes making their portfolio. It takes ages, and you will be filled with self-doubt and think you're not good enough. However, your portfolio is the single most important thing when applying for work. Whether full-time, part-time, or freelance, your portfolio is your storefront. Just like you wouldn't walk into a shop with a dilapidated, dated window display with nothing of interest, a hiring manager won't move you to the next step if your portfolio isn't:\n\n* Easy to read and navigate\n* Have beautifully presented examples of your work\n* Have your background and contact info\n\nRecruiters, hiring managers, and business owners will spend just a few seconds on your site until you reach the later rounds. So make damn sure your site presents your work clearly and effectively.\n\nDO NOT over-design your site. Your portfolio should not try and be a portfolio piece. Think of it like an art gallery presenting masterpieces.\n\n**Your portfolio should scream, I am good at the tasks you are hiring for, I am professional, and I get sh\\*t done.**\n\nI highly recommend having a custom domain. They are cheap and easy to set up, just google how. It immediately looks 100x more professional and shows both a commitment to the career and immediately starts your 'Personal brand' off before they even click.\n\nThe same applies to email. Easy, free options available to attach a custom domain to an email inbox. Even if you just fwd all emails to your personal gmail.\n\n# BE SEEN.\n\nDesign a resume like a business document. Because it is. It needs to be 'designed,' but it is not your portfolio.\n\n&gt;The #1 goal of your resume is to get them to view your portfolio.\n\nMake sure you export the PDF without flattening it. You can easily tell if the text is not selectable in the PDF. Every job website uses tech to 'read' the resume. So you need the tools to extract the information easily.\n\nMost often, the first person to review the resume is not the hiring manager and is just checking off boxes.\n\n**Make sure your LinkedIn profile is fully completed!**\n\nAdd content to all sections. Include samples, and most importantly:\n\n&gt;Make sure the skills section has the most relevant keywords for the jobs you are applying to.\n\nThis is what recruiters see in LinkedIn\n\nLinkedIn's recruitment tool has a filter drop-down where the recruiter can select the skills that match the job. Even if you have it on your resume, if it isn't on your LinkedIn profile, it won't pass the first step.\n\nKeep it clean, clear, and professional. You can use colors, but max 2, and do not use a background image. Most importantly, it needs to be readable by both humans and machines!\n\n**You have to do everything you can to stand out.**\n\nOut of the 1,300+ applicants, 10 sent a message to my company page on LinkedIn, and ZERO(!) sent a message directly to the hiring manager.\n\nThis may seem like you're doing the recruiter job for them, but remember, they get literally THOUSANDS of applicants, and might be hiring for multiple roles, maybe even for multiple companies.\n\nSo, you have to make their job easier.\n\nGo to the company's page on LinkedIn (just click on the logo in the job description.) Then click on People and scroll through to find the employees most likely to have input on the role. CDs, senior designers, even owners if it is a small company.\n\nThen send them a message with:\n\n    Hi &lt;persons name&gt;,\n    I hope you don't mind me messaging you directly, but I can appreciate how many applicants you are getting!\n    \n    I have applied for &lt;name of job&gt; at &lt;company name&gt; and wanted to express just how excited I am for the opportunity to learn more about it and if I may be a good fit for this role.\n    \n    Here are some specific examples of work I have done relevant to what you are looking for:\n    - link 1\n    - link 2\n    - link 3\n    I have more samples, so if you would like to see anything more specific, I'd be happy to share.\n    \n    Here's my LinkedIn profile:\n    Here's my resume: link to resume:\n    \n    Regards\n    {your name}\n\nThey more than likely will NOT respond, but you sure as sh\\*t will increase your chances of them even looking at your portfolio from 1 in 1,000 to 1 in pretty damn likely!\n\n**Do this to at least 3 people. It takes 10 minutes.**\n\nThis is the exact method I used when leaving Blip and getting a job at MediaMath. Maybe only 1 in 10 replied, but it resulted in moving to the next stage with more than one.\n\n# Get through to the next round\n\n&gt;The goal of the first date is to get a second date.\n\nAs much as it sucks, you will often be asked to do a project as a part of the process. I personally only do this to my final 3 applicants, and I pay them for their time. But this is not the standard. When I was interviewing at Blip, I was asked to design 3 sets of custom ads.\n\nIMPORTANT:\n\n# I do not recommend doing work for free when doing freelance work.\n\nBut if you are applying for a job, the reality is you have to do everything you can to get to the next step. The worst-case scenario is that you just made another item for your portfolio.\n\nFor my application to Blip, after delivering the designs, the hiring manager replied requesting edits. At the time I though F this, I'm doing this for free and now they want edits!? But, I pushed that aside and did them, and sent an email saying, \"No problem. The updated designs are attached!\"\n\nI found out after getting the job that out of 5 people they did the same thing too, I was the ONLY one that didn't push back. The other 4 all responded, defending their designs.\n\nSo, this is a balance. You DO want to justify the design decisions made, but you will be doing work for other people who are paying you. So, if the client asks, you do it. You can provide recommendations or give your point of view as to why you did it one way or another. But you still must do the edits.\n\nAlso remember, that while we know what works best from a design point of view, the client/manager knows what they need from a business point of view. While the requested edits might seem ridiculous or they will ruin the look, you are only working with the information provided. There may be a very legitimate reason for the requests that you are not privy to.\n\n# The interview\n\nIn one of my first job interviews, the manager told me after I got the job that he nearly didn't hire me because I wore a suit. I found this insane at first, but there is something to it. 'Cultural fit' is as much of a decision as your technical skills. The best advice I can give for interviews is to try and put yourself in THEIR shoes. They need to hire a designer. They are likely stressed, pulled in a million directions. But, they also know that they will have to manage this person and work with them every day. You spend more time with co-workers than friends or family. So, do your research before the interview. If it is a recruiter setting up the interview, ask them questions. They WANT you to get hired because that's how they themselves get paid!\n\nYou want to walk into that room or Zoom call, knowing everything you can about the company and the other person in the room. This is as simple as reading the profiles on LinkedIn and spending 30 minutes reviewing the company website.\n\n**I can't tell you how many times I have been interviewing designers who have no idea what the company does!**\n\n**You are going to be spending 40+ hours a week working for a company you know nothing about? Instant red flag.**\n\nFeed their ego. It sucks, and don't be weird about it, but saying things like:\n\n*\"I loved the design of X\" or \"I was reading about how {company name} just did {something from their news articles on website}, that's awesome!\"*\n\nThis shows you have done your homework and, I promise you, sets you apart from the majority of applicants.\n\nEven with everything going on, the old-school approaches still work. They showcase a level of maturity and sophistication.\n\nIf it's in person, give a polite but firm handshake. If you see a photo of something clearly important to them, ask about it. People love talking about themselves, and it reduces their stress levels. Another thing candidates don't realize is that the hiring managers themselves are often very nervous! You'd be surprised to know just how many people hate hiring staff because of this.\n\nWhen I moved to NY, I went through the whole Visa process, and after a few years, I was eligible to apply for a Green Card. One of the most important parts is a face-to-face interview with a USCIS person. They are there to question you and make sure that what you have said on your application is all true. They have the power to decline your green card on the spot. You can appeal, but as you can imagine, it is a nerve-wracking interview. I was in the waiting room when I saw a woman walking out crying, and the admin explained the appeals process. H-O-L-Y sugar balls that spooked me.\n\nThen, while I could still hear the sobs, \"*You're next, this way please.*\"\n\nI walked into the room and immediately saw a photo of a young person in Uniform and a photo of a fighter jet. It took me a moment to build the courage, but after we got started, I said, \"I'm sorry to ask, but is that a family member? My uncle was in the Air Force in England.\" (He wasn't. He was an electrician for the Navy.) His demeanor changed completely, and he proudly told me about his son. He became like a different person, and most of the allotted time, HE was doing the talking.\n\nSo, to summarize, the goal of the interview is to of course answer the questions they have to prove you know your stuff, but also to get them comfortable with you.\n\n# Follow up\n\nAnd after the interview, send a thank you email. It takes 30 seconds. Is it old fashioned? Yes. Have I known hiring managers that wouldn't hire someone that didn't send a thank you? More than you'd believe.\n\nCompetition is high. Do everything you can to stand out in a polite and professional way. Do your homework and make them want to work with you!\n\nI have more, but this is already 10x longer than I planned. If you have any specific questions I'd be more than happy to answer them.\n\n# GOOD LUCK!",
    "score": 365,
    "url": "https://reddit.com/r/graphic_design/comments/1kcgojx/tips_on_getting_hired_from_20_yr_agency_owner/",
    "created_at": "2025-05-01T19:00:25.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1pgocyh",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "10 Lessons I Learned in 10 Years of Graphic Design (Hope it Helps Someone Starting Out)",
    "text": "Hey everyone,  \nI’ve been working as a graphic designer for the past 10+ years - mostly branding, packaging, corporate identity, and social media design.\n\nThought I’d share **10 lessons** that genuinely changed the way I work. Maybe it helps someone starting out.\n\n**1. Don’t Start Designing Without a Clear Brief**\n\nA beautiful design can still fail if you don’t understand goals, audience, emotion, and constraints.\n\n**2. The Client Isn’t Buying a Logo - They’re Buying Confidence**\n\nPeople want clarity, direction, and a sense that their brand will look professional.\n\n**3. Simplicity Wins 90% of the Time**\n\nRemoving elements usually improves the work.  \nClarity &gt; decoration.\n\n**4. Typography Is 50% of Good Design**\n\nIf your fonts are wrong, nothing else can save it.\n\n**5. White Space Is a Power Tool, Not Empty Space**\n\nGood spacing instantly makes a design feel modern and premium.\n\n**6. Your First Idea Is Almost Never the Best**\n\nSketch, explore variations, push ideas further.\n\n**7. Feedback Is Not an Attack - It’s Data**\n\nLearn to filter what’s useful and ignore what isn’t.\n\n**8. Good Design Takes Time - Rushing Always Shows**\n\nEven “simple” work requires thinking, refining, adjusting.\n\n**9. Consistency Builds Brands More Than Creativity**\n\nA good brand isn’t flashy - it’s aligned.\n\n**10. Never Stop Learning - Trends Change Fast**\n\nDesign tools, visual culture, and brands evolve constantly.  \nCuriosity keeps you relevant.\n\nIf you’re a beginner or someone considering design as a career, hope this helped.  \nHappy to answer questions or discuss more about design process, branding, or packaging.",
    "score": 361,
    "url": "https://reddit.com/r/graphic_design/comments/1pgocyh/10_lessons_i_learned_in_10_years_of_graphic/",
    "created_at": "2025-12-07T17:41:22.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1iavzq1",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Have no desire to spend personal time outside of work getting better at design anymore",
    "text": "I don’t know if it’s because of what I anticipate will happen to our industry with the development of AI, the job market, this sub…. I’ve lost all passion for design, and don’t see it as a stable career choice anymore, my motivation to up skill in my spare time is nill, which arguably is the thing that MAY keep me employed if I ever were to lose/leave my job. \n\nI spent years learning certain things now easily replicated by AI. I personally don’t want to lose more years learning new things (UX/UI, etc.) only to risk it being a waste of time. I’d rather enjoy that time with loved ones, at the gym, learning new hobbies, etc. \n\nI feel guilty though, and also quite stuck, at a job I don’t really love but know is the highest paying design job I’ll find. Golden handcuffs, really. Once I leave here, that’s it for me in the graphic design world. \n\nDoes anyone else share this feeling? The desire to chase this career path has just died. I have no idea what to do career-wise at this point (32). The problem I see being a designer, when working in-house anyway, is if you’re not spending spare time learning new things and developing, you’re not staying relevant. Where most other careers, that’s not the case. My other coworkers don’t have to learn new things off work time, they learn everything they need to know for their roles in most organizations, at the job. They’ll stay hireable in the market no matter what. A marketing ops manager is a marketing ops manager, a salesman is a salesman, etc. ",
    "score": 360,
    "url": "https://reddit.com/r/graphic_design/comments/1iavzq1/have_no_desire_to_spend_personal_time_outside_of/",
    "created_at": "2025-01-27T01:14:54.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1ldqgfa",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Can we have a salary transparency post? It would be so useful to so many of us lurking :)",
    "text": "I know a ton of us are fresh grads or just laid off and looking for work, deciding if the career is right for them, watching salaries change on a weekly basis, feeling underpaid, etc.\n\nIf you're comfortable, share your title, experience, sector (if you can), vaugue location, and salary.\n\nI feel like the salaries I've been seeing on my job hunt are just unsustainable, and I'm so curious what others are experiencing around the world!\n\nI'll go first: Graphic Designer, 5 years experience, 75k + annual bonus, tech, in the US!",
    "score": 305,
    "url": "https://reddit.com/r/graphic_design/comments/1ldqgfa/can_we_have_a_salary_transparency_post_it_would/",
    "created_at": "2025-06-17T15:41:11.000Z",
    "num_comments": 400
  },
  {
    "id": "reddit-1ivf4if",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "PSA: There is still demand for graphic designers",
    "text": "TL;DR: a thread for designers to share any positive current experiences within the industry\n\nI see daily posts on here, of people looking to leave the industry, people unsure about entering the industry and a lot of discussion around how graphic designers are simply not in demand anymore due to AI tools and Canva.\n\nI’m sure this is reflective of people’s own experiences, but I do want to say I don’t think it’s representative of the whole industry and often feels a bit doom-and-gloom.\n\nI work as an in-house graphic design manager at a d2c brand, leading 3 other graphic designers. We sit within marketing, amongst a flourishing creative team that seems to be ever growing with retouchers, video editors, photographers. Our team is considered business critical within marketing, as we create collateral (and end product) for a multitude of different touch points and channels. At peak periods we even take on freelancers, despite having 4 active designers.\n\nThe salaries are excellent, as are the job benefits, and overtime is minimal for the team. I know other designers in industry, both at agencies or in-house and they too seem to have a similar positive outlook.\n\nI’m sharing all this to let people know there is currently still plenty of demand for graphic designers, as long as you enter the right industry or right company, which place a heavy focus on creative marketing.",
    "score": 276,
    "url": "https://reddit.com/r/graphic_design/comments/1ivf4if/psa_there_is_still_demand_for_graphic_designers/",
    "created_at": "2025-02-22T09:34:22.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1kjmkmv",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "How do you actually get to a $100k+ salary as a graphic designer?",
    "text": "Hey folks — I’m a mid-career graphic designer with solid experience in branding, UI/UX, print, and a little motion work. I’ve worked both in-house and freelance. I’m currently making decent money, but I’m trying to understand how designers actually make that leap to six figures.\n\nFor those of you who are there (or on the way), how did you do it?\nWas it:\n\t•\tGoing deep into UX/UI or product design?\n\t•\tWorking at a big tech company or agency?\n\t•\tGoing freelance/starting your own studio?\n\t•\tSpecializing in something high-value (packaging, 3D, brand strategy, etc)?\n\t•\tGetting into leadership roles like creative director or design manager?\n\nI’d love to hear your paths, tips, and even mistakes. I know location matters too — I’m curious how folks in different cities or remote roles make it work.\n\nThanks in advance!\n",
    "score": 273,
    "url": "https://reddit.com/r/graphic_design/comments/1kjmkmv/how_do_you_actually_get_to_a_100k_salary_as_a/",
    "created_at": "2025-05-10T22:50:54.000Z",
    "num_comments": 192
  },
  {
    "id": "reddit-1lcfc9o",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "This has to be a joke .-.",
    "text": "I'm on the job hunt, and wow, there really isn't much out there right now. But this specifically is WILD.\n\nFull time (yes 40 hours) for 1500 a month? Reposted an hour ago and 100+ people applied? 3D rendering AND general graphic design AND interior design? 5 years experience?\n\nNew (and current) designers: PLEASE do not stoop to this level, this is straight highway robbery.",
    "score": 259,
    "url": "https://reddit.com/r/graphic_design/comments/1lcfc9o/this_has_to_be_a_joke/",
    "created_at": "2025-06-16T00:27:19.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1irj7vg",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I was looking for a job, and then I found a job.... and heaven knows I'm miserable now.",
    "text": "[ Senior Product and Packaging Designer specialising in Licensed Apparel and Hardgoods ] TLDR at the bottom. \n\nI want to preface this with the fact that I understand that this is a good problem to have... but, it *is* a problem I have and would love some advice. \n\nI recently spent the last 4 months job hunting and had nearly hit 100 applications with no real success. A few 'call backs', a couple of interviews but nothing solid. It was also over Christmas so it was the worst time to be looking. \n\nI have been freelancing full-time for the past 5 years but really needed something more reliable again and have certain criteria and salary I needed to match, to well, survive. \n\nA few weeks back however I approached an ex-employer (who employed me in my first ever real design role) who were advertising a new Senior Role.  \nI applied. Interviewed.... aaaaand *got* the job. Rad!   \n\nI couldn't be happier that I was 'coming home' to bring my near 15 years of experience *back* to the place that started it all. Beyond excited...... however.... for some reason, since taking this role, I have been approached by multiple *other*  employers for roles that I had previously applied for over the past 4 months. One of them contacted me today.... *3 months* later! \n\nSo, I have a \"good problem\"..... I now have 2 other job opportunities that both on apperances look pretty incredible over the job I just took. I haven't interviewed with either of them *yet* but we are currently arranging times to at least meet and talk in person about what the opportunities hold. One of them I am especially interested in, and they seem incredibly interested in me. My current role also has me on a 6 month probation that either of us can walk on within a days notice.... so, that *does* help.  \n\nSo..... do I stay with a smaller company who have.... \n- taken a chance on me before   \n- kick started my whole career  \n- taken a chance on me again    \n- pay is high for the company (but not the industry)     \n- opportunity to train staff  \n- give me work I don't hate  \n- no over time hours   \nAlthough...     \n- strong cultural differences   \n- no work from home   \n- compulsory interstate travel   \n- industrial area  \n- pay is my lowest 'survival rate'  \n- commute is an hour+  \n\nOR... do I take a chance with a new job offer, that has.....  \n- an incredible existing client list   \n- an international presence    \n- beach-side office   \n- a possibly much higher pay rate   \n- seemingly positive staff  \n- confrontingly good designers to work with    \n- work I *love* to do  \nAlthough... \n- commute is an hour++    \n- over time hours seem likely   \n- imposter syndrome will kick in, hard   \n\nI feel like I am considering breaking up with an ex that took me back because another girl said she has a crush on me. :/ It feels gross.... but the opportunity for life progression is hard to ignore.\n\nI'd really appreciate any advice fellow designers.  \nThanks in advance.  \n\n---------------------------------------------------------------------------------------  \n\nTLDR: I just accepted a job returning to an old workplace that took a chance on me but have since had better offers from other more exciting employers.  \nWhat would *you* do? ...stay? or go? ",
    "score": 231,
    "url": "https://reddit.com/r/graphic_design/comments/1irj7vg/i_was_looking_for_a_job_and_then_i_found_a_job/",
    "created_at": "2025-02-17T12:56:40.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1kepu04",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I'm so tired of corporate thinking that it's a graphic designer's job to edit videos and create motion graphics",
    "text": "It's been a year since I became a graphic designer. This is my first job out of graduation. And I feel so unappreciated in this company. I've been creating motion graphics for their advertisements and promotional campaigns, but I've never gotten a commendation while my peers (not designers) are getting awards for their work. I reviewed the job description of my position when I first applied and it was mainly focused on graphic design. Not video editing and motion graphics, which is majority of what I've been doing even before I was regularized.\n\nAnd I'm confident in the quality of my motion graphics and videos, but all I get from my client is different versions of \"good job\", \"the team loved this\", and \"\\[name\\] really loved your work on this one.\" What really irked me this time is that my client called the animated advertisements I did for our current campaign as one of their best ones so far (they didn't tell me directly, they told that to my fellow graphic designer). Like if you've been enjoying my animations, why don't you give me a proper commendation? Something with a certificate? That's the least they can do, especially because animation and video editing are areas that are outside of my job description but that's what I've been doing since I started.\n\nI brought this up with my boss. I told him that the name of my position needed to change because I'd been getting assigned to more animation-related tasks despite the face that \"graphic designer\" was my title. But months later, it's still \"graphic designer\" and a small increase in my salary. On top of this, I also found it unfair that my fellow graphic designer (who came five months before me) was only assigned to static graphics before his regularization but he received a commendation for that, while I've been juggling between static graphics, video editing, and motion graphics tasks and still hadn't gotten a single commendation from them. I just don't get it :((\n\nI'd be happy to keep this title and my initial salary if my responsibilities stayed within creating static graphics as graphic designers should be, but that's the opposite of what's happening. I'm doing the tasks of two different jobs that some people receive a higher salary for. I'm leaving this place before the end of the year. I just can't do it right now as I'm still saving up and adding more to my portfolio. \n\nDoes anybody have a similar experience?",
    "score": 229,
    "url": "https://reddit.com/r/graphic_design/comments/1kepu04/im_so_tired_of_corporate_thinking_that_its_a/",
    "created_at": "2025-05-04T17:50:30.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1iuwylb",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "It feels impossible to get a design job right now",
    "text": "Hi all. I wanted to reach out and get some different perspectives on this (and vent a little, I guess). Apologies for the length of this post. I’m just so thoroughly frustrated by all of this…\n\n\n\nMy fiance is a graphic designer who’s been in the industry for over 15 years. We worked together at the same small company for 3 years, where he was their only graphic designer and I was (and still am) an illustrator. He left to go work as a designer at another company for a much better salary, but unfortunately, in August 2024, he was laid off completely unexpectedly after just two months at that job.\n\nHe has been unable to find work since. His position with our former employer has also already been filled, so that option is no longer available.\n\nHe’s been applying for any kind of senior graphic designer, regular graphic designer, or art director position (as well as low-paying jobs outside the field) and he must’ve applied to hundreds of listings by now. 99% of them have been either rejections or ghosting.\n\nHe was asked to work as a freelancer for someone in the industry, but the guy that “hired” him seems to have just fallen off the face of the Earth because we heard anything from him since September.\n\nHe also has two recruiters working with him, one who’s a general recruiter and another through Creative Circle. They reviewed his resume and portfolio and, after being told to adjust some minor details, told him everything looked good, but said they didn’t have any work available for him right now. The CC recruiter told him specifically “We’ll need to see how this new presidency will affect the job market” (we’re in the US, btw).\n\nHe’s also been reaching out to friends, family members, former coworkers, contacts in the industry, etc. to network and they either have no leads or are unable to get him a job at the company they work for due to anti-nepotism policies in place at their organization (which is ironic to me… because his last place of employment had nepotism running rampant and was probably part of why he was let go).\n\nHe did finally get an interview for a graphic designer position that he was more than qualified for. But while the interview went well, they asked him to create a sample advertisement for them as part of the hiring process.\n\nAs an illustrator myself, I am very skeptical of companies essentially asking for free work like that, but what other choice does he have after 7 months of job hunting? He completed the assignment for them within the time frame they asked (and I think he did a very good job at it).\n\nHe submitted it to them, but now it’s been about two weeks later and there is still no response from this company. Nothing. He seems to have been completely ghosted. We’ve checked their website to see if they used his work and thankfully, they haven’t so far, but man. Did that feel like a huge waste and a scam.\n\n\n\nI guess the TL;DR is… what is happening with this job market? Is anyone else having this hard of a time finding work in graphic design? I feel so awful for my fiance and I don’t know what more I can do for him. I’ve already exhausted all of my networking options for him as well and still nothing.\n\nAre we doing something wrong or is the market just really that bad right now?",
    "score": 225,
    "url": "https://reddit.com/r/graphic_design/comments/1iuwylb/it_feels_impossible_to_get_a_design_job_right_now/",
    "created_at": "2025-02-21T17:50:08.000Z",
    "num_comments": 136
  },
  {
    "id": "reddit-1llj2z1",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "A great first job for aspiring designers nobody talks about",
    "text": "I work at a UPS Store as their graphic designer and it’s honestly a great job to start out with if you’re looking for a future graphic design career.\n\nI did get very lucky that I have a great manager, but every store is run independently so my experiences might not be exactly the same as other stores.\n\nI do a lot of typical retail work too it’s not just design, but what I’ve done has given me a lot of experience working professionally. \n\nIt’s given me a great baseline of what to expect and how to conduct myself professionally. Designing, talking with clients, making calls / emails, formatting files, cutting, large format printing, book binding, etc, all amazing stuff to put on your resume. The jobs I get aren’t always the most interesting, but like I said, still great experience to have.\n\nI personally don’t make commission since our store owner kinda sucks, but I’ve heard a lot of other stores do give commission or higher salaries for their designers. Some customers tip too! Your clients will also depend on your location, some stores just get more design work than others.\n\nTypically someone will email us or just walk with a question or task. It’s then my job to price that out, design or format what’s necessary, then place an order or print and cut what they need. I’ve formatted documents, made large posters, spiral bound books, stapled booklets, flyers, menus, etc. And a lot of business cards.\n\nSince my manager is chill I also get to work on freelance / personal work on the computer when we aren’t busy which is great. The experience and skills I’ve learned are incredibly applicable to future jobs, and the best part is once I graduate college I’ll be able to add to my resume that I already have 3 years of experience as a paid graphic designer.\n\nLiterally just walk into your local UPS store, even Fedex maybe i’m not sure, and ask if they need a graphic designer. It’s not the most glamorous design job ever, but I love what I do and the skills i’ve gained!",
    "score": 202,
    "url": "https://reddit.com/r/graphic_design/comments/1llj2z1/a_great_first_job_for_aspiring_designers_nobody/",
    "created_at": "2025-06-27T02:50:12.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1p5mw0d",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Where are all the good designers looking for jobs?",
    "text": "I’m trying to hire a mid-level to senior designer, and I know this topic has probably been beaten to death already, but my candidate pool has been rough. Most applicants don’t include a portfolio or any real design work. Of those that do, half of the submissions are illustrator portraits or low-quality illustrations. It’s draining my time and my sanity.\n\nThe salary is competitive, I'm not asking for 20 different skills.\n\nFor those of you who hire designers regularly, what are your tips for finding strong talent? Where are you posting your job listings? Any advice is greatly appreciated!",
    "score": 161,
    "url": "https://reddit.com/r/graphic_design/comments/1p5mw0d/where_are_all_the_good_designers_looking_for_jobs/",
    "created_at": "2025-11-24T17:14:43.000Z",
    "num_comments": 141
  },
  {
    "id": "reddit-1joblhq",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "15 months out of work - Feeling very hopeless",
    "text": "I've been a corporate graphic designer/lead designer/design manager for 19 years. I'd call myself a generalist because I've always filled whatever niche was needed: print, websites, logos, video, trade shows... I've done it all and I've done it well. I'm confident in my abilities, or at least I was. My last salary was slightly over $100k.  \n  \nIn December 2023 I was laid off along with the whole Marketing department due to typical cost-cutting bullshit. I've been applying constantly since then with remarkably little luck. I've had a dozen or so phone interviews, but not a single in-person or other advanced interview. I've sent out literally thousands of applications. I've never had trouble like this.\n\nI've tried using AI tools to tailor my resume to individual job postings, but the process became quite onerous and never really showed much in the way of results. I still see a fair number of corporate jobs being posted, but they all have hundreds of applicants.\n\nI'm at the end of my rope.",
    "score": 155,
    "url": "https://reddit.com/r/graphic_design/comments/1joblhq/15_months_out_of_work_feeling_very_hopeless/",
    "created_at": "2025-03-31T19:21:15.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1p34uyw",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Should I give up my dream job offer to prioritize grieving?",
    "text": "TW: illness, death.\n\nI’m a 24 yo-old GD from South Africa. 3½ weeks ago I found my father after he passed from cancer. I’ve barely been able to keep it together since.\n\nHe was born in Europe (let’s say Scotland), and I’m flying there at the end of Jan for the burial of his ashes. My first time going.\n\nI’ve always wanted to move there, and it was my dad’s wish too. SA’s crime is extreme, I live paycheck to paycheck on a “fantastic” salary, and infrastructure is unreliable. I haven't booked a return ticket, and started exploring jobs there.\n\nOne agency I applied to aligned with my passions and felt like a perfect cultural fit. Despite grieving, I grafted and sent a very strong application, and heard back. After many emails, two video calls, and a salary discussion later, we have set a date after I land to meet the team and seal the deal.\n\nI still can't believe it. Cost of living there is double, but I've asked for 3.5x my current salary, and they bit. I did NOT expect this to work out. \n\nI should be excited, but I’m terrified. In one month I lost my dad, went through a breakup, and cut contact with my bipolar mom. I've lost 7kg and relive my dad's death through nightmares. I don't know how I still show up.\n\nI feel empty and unsure I’m emotionally equipped to move countries. It's a good change, but a HUGE one. What if I break down far from home? It went from “what do I have to lose?” to “oh shit, it’s actually happening” so fast.\n\nShould I take the opportunity, or hold back until I feel more mentally prepared and hope another opportunity like this will come again?",
    "score": 144,
    "url": "https://reddit.com/r/graphic_design/comments/1p34uyw/should_i_give_up_my_dream_job_offer_to_prioritize/",
    "created_at": "2025-11-21T17:33:19.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1k9xcid",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Am I insane or is the job market for graphic design hard as hell?",
    "text": "I’m a graphic designer and I’ve been in the industry for about five years now. I’ve designed everything from a social media posts to a billboard in an airport to app mockups for entertainment companies. I’ve done it all and do it well and really love this industry very much. \n\nI’ve been applying for more senior roles and I’m finding it very hard to find something. I’ve only been doing it for about a month and now and I plan on giving myself about a year to find something that is as great as a job I have now but pays me more. \n\nHowever, it just seems like everyone is denying my application for roles that I meet or even surpass in some instances. Maybe it could be the salary that I’m requesting or maybe it’s a specific area of expertise they’re looking for but all in all, the jobs I’m applying for are the same. I thought it was me and had my resume professionally reviewed and I’ve also had my portfolio reviewed by two art directors that I know and appreciate (one having 10 years of experience in one having 25). I guess what’s confusing me is not how long it’s taking me to find something but the amount of rejections that I’m getting. \n\nIs anyone else applying for jobs in the market currently and getting a lot of rejection even though you’re qualified? \n\nI know this may not be related, but I know that employers in any fields are being very careful with their money, especially with things happening politically, but I guess I want some opinions other than my own. \n\nEdit: I appreciate the early comments very much! I do want to specify that I currently am a marketing manager and don’t mind taking on roles that include more than just design. I definitely understand that I’m gonna need more than experiencing graphic design so I am very well-versed in like website building on Squarespace (hoping to try webflow soon), basic html/css, social and marketing campaign strategies, email design, and also have a project management certification for PMI. Just wanted to iterate that I wear a lot of hats and don’t mind doing so. ",
    "score": 143,
    "url": "https://reddit.com/r/graphic_design/comments/1k9xcid/am_i_insane_or_is_the_job_market_for_graphic/",
    "created_at": "2025-04-28T14:47:17.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1kfz29b",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Client work tanking, AI, and the economy. My thoughts.",
    "text": "I'm reading what you guys are saying in another post about AI not taking anyone's job if you're even slightly above average, and that if you're suffering from job loss, you're likely churning out slop.\n\nI hear you, but I urge you not to get too cocky.\n\nI'm online-friends with several design entrepreneurs on social media through which we talk semi-regularly (through DMs, slack channels, etc). Last year, one of said friends – an extremely talented woman producing some top notch work – confided in me and alluded to her business essentially tanking. Let's call her Dana. In previous years, there was so much work that Dana was able to niche down to a hyper-targeted client, the type she most enjoyed working with. If I were to give you an example, it'd be something like...black female skin care entrepreneurs. Clients booked for months on end in a niche just like that. Now, that's no longer a possibility. Even in a \"I'll take what I can get\" market, the only reason she hasn't lost everything is the fact that her spouse is picking up the slack.\n\nI feel bad about this now, but because my business was still doing great last year, I assumed she was doing something wrong on the business end. I was of course still kind, but I gave her some advice, and I'm not surprised she low key appeared to find most of it unhelpful.\n\nThen, while I didn't hear from him about this, I noticed another friend – let's call him Kevin – started looking real desperate on Instagram. Every day, posts essentially begging people to connect him with clients. It was pretty clear things had gotten bad, and I couldn't believe it because Kevin is an extraordinarily talented illustrator and brand designer. I'm not just saying that to make my point. He's exceptional.\n\nNow, mid-2025, and I find myself in the same boat. Due to having seen at least two extremely talented people struggle this way, I don't feel quite convinced that my work is \"slop.\" I don't necessarily expect anyone here to believe what I'm saying, but I know it's not. I'm not going to go into all of the reasons I know that's the case because I don't have anything to prove, but suffice to say I've gotten some pretty amazing feedback.\n\nIt used to be that most of my jobs were just people inquiring from my profiles in places like Behance, for example. That, and the fact that I had 2-3 longterm clients who had regular work for me at any given time. But once in a while, if I had a slow month, I knew I could always go on Upwork and find a job *that day* to supplement my income. It wasn't an issue. And it wasn't just little jobs; it was things like $2-4k+ for a short PowerPoint or something.\n\nNow, I can fill out endless amounts of applications, and maybe 1% of them will even get looked at (Upwork tells you when a proposal is viewed). This is also the case even when I cut my typical hourly rate way down to match what they say they want to pay. Not only that, but I noticed my longterm clients cutting back. The clients list on their own website getting shorter. My supervisor at one of the firms getting sacked; my assignments ending as a result. Got on a call with the Director of Marketing...he said they're saving money and he's been throwing some PDFs together in Canva. Their developers phucked up their website, it needs work, yet they're not changing it. Sometimes, I go back to jobs on Upwork I've applied for just to see who ended up getting hired. It's always some person willing to do the job for less than what a babysitter makes.\n\nLooking around, there appear to be two kinds of people who think AI (or Canva, or whatever) isn't a problem: 1) people with office jobs where it would take a lot more to get sacked (because you work in a place that can afford to pay you a full-time salary as opposed to one-off assignments), so you're safe – for now, and 2) people who are self-employed and cocky because it hasn't hit them yet (this was me in 2024, so just a few months ago). Now...it suddenly hit like a brick. Self-employment is always up and down, so when it first started slowing down, I just thought it was part of the cycle. But...it stayed down.\n\nFrom what I can see, it is mostly self-employed designers that are feeling this first, because we're the most likely to be working with start-ups that are bootstrapping. Either that, or even established companies who aren't interested in hiring an in-house design team, thus are looking to save money by hiring a designer for one-off assignments. Those types of clients are the ones who are most likely to pay for Gamma to make their \"good enough\" presentation instead of paying me $2-4k, now that they no longer have to.\n\nAnd the ones who are still paying human designer freelancers....They want everything for less. 90% of the jobs are a couple of hundred dollars, and we're all left fighting for those scraps like dogs.\n\nDon't get too cocky, y'all. I'm working my ass of to update my portfolio, and for the first time, even considering getting a \"safe(r)\" office job. But even if I do that, I'm wondering if I'll always be hustling trying to stay one step ahead of these machines. Longterm, I'm considering a different career altogether, even though I have really enjoyed being creative.\n\n\"But we'll still need people to operate AI\" is not a valid argument. If much of what you're doing is handling AI, you can work the job of at least 3 people. You'll be expected to be a graphic designer, marking director, copywriter, videographer, motion designer, developer, and more. And even if you're willing to be all of that, because there will be fewer jobs, you'll be competing with more people. Most people will inevitably be left behind because the numbers just don't add up.\n\n\"You won't be replaced if your work is good\" is also not a valid argument, because most clients just want \"good enough.\" I can't believe the things I've seen when scrolling through business and startup subs (but also, I can). Most business owners honest to god think what we do is stupid and that \"any idiot\" can do it. If a person with little knowledge and no taste can pay $8 to a machine to spit out a logo and a random color scheme + business card, they're going to do that. And they are.\n\nIf you're still feeling safe...you've been warned! But it's getting to be the Hunger Games out there. I'm telling you. Get a back up plan. And least start making templates to sell or something, so that you have a foot in the \"cheaper option\" economy.",
    "score": 140,
    "url": "https://reddit.com/r/graphic_design/comments/1kfz29b/client_work_tanking_ai_and_the_economy_my_thoughts/",
    "created_at": "2025-05-06T08:01:47.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1jeey3w",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I just started a new agency job as a designer, and I’m terrible at it",
    "text": "I’m 32 years old with around 5 years of experience (?). For context, I didn’t study design. I graduated in journalism and later did a master’s in digital marketing. I’ve always liked design, making videos, and playing around with Photoshop back in high school just out of curiosity.\n\nMy first job (as an intern) was in the marketing department of a university. After nine months, they offered me a permanent contract. At first, I helped with blog writing, but they quickly realized I could edit and put together videos with good taste, and I had a decent grasp of design. So, they moved me to a designer role for social media campaigns. I stayed there for three years, but eventually, being an in-house job, I got bored. More than anything, I realized that even though I participated in campaign ideation and made key design decisions for the company, I didn’t really know how to do much beyond social media content.\n\nSo, I decided to put together a small portfolio and start job hunting. Within a month, I landed a job as a designer at a marketing agency. This agency was about 60% focused on web design and maintenance. At first, I was completely lost—I barely knew how to use Illustrator or most other programs. But, weirdly enough, I learned really fast how to design high-quality websites in Adobe XD. After two years, I had learned to use almost the entire Adobe suite (except for InDesign, since my job barely required it). But they gave me almost all the web design work. All the branding, print design, and layout work was handled by a senior colleague, so I barely touched that type of work.\n\nFor that same reason, after two years, I started feeling stuck again—like I wasn’t learning enough. I left that job (lack of salary raises was also a factor), and three weeks ago, I started working at the biggest advertising agency in my city.\n\nAnd that brings us to today. These past three weeks have been absolute hell for me. Even though I was honest about my portfolio and skill set in my interview, all the tasks they’ve given me are in areas I don’t master: magazine layouts in InDesign, coming up with campaign concepts using AI, designing branding for conferences and dressing event spaces, etc. Even the type of work I used to be good at is now coming out poorly. I’m slow, my work isn’t high quality, and I’m making mistakes in almost everything I do—especially anything that isn’t digital.\n\nMy bosses have been very supportive. I spoke to my creative director last week and told her I felt like I wasn’t meeting the required level and that maybe I wasn’t the kind of designer they needed. She told me to relax, that it’s still early, and that I just need time to adapt. But I feel like this isn’t just about time—it’s about me not being prepared. I’m completely lost, and I’m really struggling.\n\nSorry if my English isn’t good enough, it’s not my native language. I’d really appreciate any advice or if anyone has gone through a similar experience and how they managed to turn things around. I feel like I screwed up by leaving my last job.\n\nHas anyone been in a similar situation? How did you manage to improve and catch up? Any specific resources or strategies that helped you?",
    "score": 123,
    "url": "https://reddit.com/r/graphic_design/comments/1jeey3w/i_just_started_a_new_agency_job_as_a_designer_and/",
    "created_at": "2025-03-18T20:25:32.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1mqsrbo",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "This job just isnt worth it",
    "text": "So have been in this industry now for five years, and have enjoyed the job very much but got fired from my previous job this spring and man, the competition for the few jobs that are out there is insane.\n\nLast interview I had I was one of 20 candidates out of 600 application for that position. And the salary for these jobs are a joke compared to what my friends earn working as teachers and with tech etc. (Live in Sweden so teachers earn fairly well here)\n\nAnd with AI I strongly believe there will be even fewer jobs in 5-10 years. It just isnt worth it to fight tooth and nail for a job which will earn me just slightly more than working at a grocery store. I mean sure its fun, and if I you feel this is your life passion then I can understand, but for me its more just a job like any other.\n\nHave also explored UI and webdesign and other skills that a designer can build upon, but seriously those jobs are just as scarce as graphic designer Jobs. And webdesign is def one of those skills that can very easily be automated by AI.\n\nAnyway just wanted to ventilate, maybe some of you can relate to my experience.",
    "score": 118,
    "url": "https://reddit.com/r/graphic_design/comments/1mqsrbo/this_job_just_isnt_worth_it/",
    "created_at": "2025-08-15T09:27:29.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1j6ik7l",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "Unpopular opinion: if applying for a marketing-heavy job, don’t use this sub for salary expectations",
    "text": "Too often in this sub do I see job postings shared that list 20+ bullets of what a successful applicant may do (over the course of a year), and many comment that that role should fetch a salary over $100,000. In my experience, those salaries are not accurate and will likely lead to more rejections if asked for in an interview. \n\nDetermining an appropriate salary involves lots of factors, and often is geographically related. This is where asking the right questions in important in an interview. ",
    "score": 114,
    "url": "https://reddit.com/r/graphic_design/comments/1j6ik7l/unpopular_opinion_if_applying_for_a/",
    "created_at": "2025-03-08T14:41:56.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1ifcigc",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "The first 10 years of my career",
    "text": "I finished design school in May 2014, so I just hit the ten year anniversary not long ago. \n\nI learned of graphic design from my girlfriend at the time (now my wife), she was very involved in the arts so she knew of all these things I did not. I liked doodling in class but I was never much of an artist. I didn’t really know what design was but decided f*ck it I’ll give it a try. \n\nI didn’t know it at the time, but at one of the schools I applied, the teachers reviewing portfolios were on strike. They let everyone in. This was the only school that gave me an offer letter. There’s a very high chance under normal circumstances I wouldn’t have been let in. I didn’t know what I was doing and my work was really bad. \n\nBut in school, I fell in love with design. The history, the craftsmanship, the act of making things was so exciting to me. I felt like I’d found my calling. But I didn’t know what hard work was yet. And I thought I was better than I was because I was just cruising by at that point. \n\nSo I finish school and I cannot get a job. I applied everywhere, crickets. I had to take a factory job to pay the bills and kept trying and trying with applications to no avail. For 3 years. \n\nI had one freelance client which was a company that a family friend worked at and I had some experience from that. But overall my portfolio was bad and my outlook was getting bad. I felt like it was impossible to break into the industry. \n\nSo what I did to get out, take courses and made lots of self initiated work to build up my skills and portfolio. I improved my resume and website. And started applying again. Finally I got my first design job! It was part time at a local magazine. Made just barely above minimum wage. I stayed there a few months to collect experience. And rather quickly moved to a new full time job. They did merch and apparel for the auto industry. This was my job for 6 years. In that time my salary went from 32k to 55k per year. \n\nThis is where most of my experience came from. My earnings were fine, I was happy with that. The work was fine. But management was awful. They treated staff poorly and were very toxic. I knew I needed out but it was very difficult to find a new job again. I went back to my old tactics of spamming resumes on LinkedIn and indeed and all the job boards. It wasn’t working. \n\nSo I started posting work online. And meeting people and befriending them and building my network. It was mostly through Twitter but you could use any platform. It took a lot of work and patience but eventually I started finding some clients. Slowly I got busier and busier. To the point where I could finally quit my job. \n\nNow I am working with clients I love and earning pretty good money. I can work from home and see my family more. I am happy with my career choice. \n\nI wanted to share this as I see a lot of newer designers worried about their futures, and I know the worlds changed a lot since I started but I hope this brings some optimism about the potential you have with some hard work and networking. \n\nFeel free to ask any questions or advice I’d be happy to help if I can. Wish you all a long and prosperous career :) \n",
    "score": 109,
    "url": "https://reddit.com/r/graphic_design/comments/1ifcigc/the_first_10_years_of_my_career/",
    "created_at": "2025-02-01T18:16:24.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1i0wl5b",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "I HATE MY JOB",
    "text": "I am Brazilian, and I work as a designer in a large multinational consulting company. The job is entirely different from what I expected. I chose a career in advertising precisely because I wanted to work with creativity, but I find myself stuck in something that has nothing to do with advertising. I'm in a completely boxed-in corporate environment — a rigid system trying to seem cool, filled with rules, bureaucracy, pressure, tight deadlines, overwhelming demand, and everything done in PowerPoint.\n\nMost of what is required of me involves designing slide presentations used for B2B proposals, training sessions for existing clients, internal presentations, and so on.\n\nIn my previous job as a social media designer at a small startup, I was very happy creatively and with the type of tasks I handled — creating concepts, copy, and designs for the company’s posts, with a lot of creative freedom, working with Photoshop, and doing the type of design I enjoy. The issue there was the salary and benefits — I practically had to pay to work because they didn’t even cover transportation costs.\n\nNow, I’m well-paid, have good benefits, and work remotely, but I feel extremely unhappy every time I’m tasked with creating a presentation of over 200 slides to be completed in less than a week. Even though I do my best, I still feel it doesn’t turn out as expected or get done in time (I’m not exaggerating about the number of slides and deadlines; this is actually common).\n\nIs it possible to combine the best of both worlds, or is this just a naïve childhood dream? Have any of you been in a similar situation? If so, how did you adapt? Did you simply learn to deal with the frustration and sadness, or were you able to find your dream job? What kind of role should I be looking for to get closer to that dream job?",
    "score": 82,
    "url": "https://reddit.com/r/graphic_design/comments/1i0wl5b/i_hate_my_job/",
    "created_at": "2025-01-14T03:11:47.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1noab0i",
    "subreddit": "graphic_design",
    "soc_codes": [
      "27-1024"
    ],
    "title": "My boss wants me to do 72 designs per month in order to \"hit target\" and get incentives.",
    "text": "The question is actually for my boyfriend, and we both work in design and illustration. He recently got into a company that pays him the bare minimum, a fresh grad salary, and he has 3 years experience in design already. The job market here is bad and this is a confirmed job since it was recommended through connections, so he just went for it.\n\nIt ended up being terrible, he's the only in-house designer in a small but rapidly expanding company. All the design work goes to him and he's being pushed to finish graphics every single day. But that's besides the point, he recently heard from the social media manager that the boss expects him to pump out 72 designs in a month to reach an incentive goal. Am I crazy or is that an insane expectation? He doesn't just pump out graphics, he also has to do endless revisions, different versions and options for every design. This is just madness. He usually works on visuals like schedules, social media postings, advertisements, video thumbnails, flyers, brochures, mascot designs, posters, physical billboards, banners, illustrations, etc. He also basically had to build the branding from scratch since he had nothing to work off, and he had to make a bunch of ad templates for other branches of the company to use. He also made a makeshift CI guide because they had none but he was given no time to even make a proper one. All of these had deadlines average of 4 hours to finish. Most of the time he has to research for references/moodboards and write his own copies too (and then they tell him to change a billion things lol)\n\nHe also heard that the videographer/editor would have to edit 48 videos a month in order to get his incentive. That sounds even crazier to me because he doesn't only edit the videos, he has to film and direct them too. Not to mention all the audio work. \n\nBut the good thing is my boyfriend has already sent in his resignation letter, and has to finish up another 2 weeks and he's good to leave. I just wanted to hear everyone's thoughts on this, and maybe get some validation from y'all because 72 designs a month is insanity to me.\n\nEdit: Everyone is assuming he resigned because of the whole 72 designs thing, he didn't. He resigned because of multiple reasons, there are so many red flags in the company, such as disrespectful bosses that get mad at you for not doing work on public holidays, very low pay, too much company politics, bad management, constant last minute works (they assign work at 6pm and expect you to finish it at night), insincere in contract (cunningly add in that you gotta work on Sunday at the end of the contract when it is not stated in the offer letter), bad time management, they also spam called him on a holiday demanding changes in the designs. These are just a few from the top of my head.",
    "score": 80,
    "url": "https://reddit.com/r/graphic_design/comments/1noab0i/my_boss_wants_me_to_do_72_designs_per_month_in/",
    "created_at": "2025-09-23T06:43:51.000Z",
    "num_comments": 62
  }
]