[
  {
    "id": "reddit-1jt3kf5",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "My newest favorite work! Do you like it? 🩷",
    "text": "I'm a vivid specialist but I live in a conservative area, so I don't always get good chances to create full rainbow designs. 🥰",
    "score": 3086,
    "url": "https://reddit.com/r/Hair/comments/1jt3kf5/my_newest_favorite_work_do_you_like_it/",
    "created_at": "2025-04-06T20:24:01.000Z",
    "num_comments": 169
  },
  {
    "id": "reddit-1pefcf4",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "Update. It's me, the cat lady. I chopped it all off and I love it!",
    "text": "I did it! \n\n\nI can't figure out how to link my prior post but thank you all for the advice and encouragement to do the big chop. I love it! It's so fun and light! I can't wait to figure our how to style it! ",
    "score": 2901,
    "url": "https://reddit.com/r/Hair/comments/1pefcf4/update_its_me_the_cat_lady_i_chopped_it_all_off/",
    "created_at": "2025-12-04T23:29:35.000Z",
    "num_comments": 262
  },
  {
    "id": "reddit-1o4ynhm",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "I immediately took it out.",
    "text": "So I'm attending a wedding and needed to get my hair done. I looked up a place with promising reviews and made an appointment. While booking, I told them I have very thin and fine hair. I NEVER style my hair because I don't know how to or what to do with it. I simply wanted it up and out of my face because I'll be chasing after my toddler while at the wedding. I brought some inspo pics and was really open to other suggestions that would work with my hair. First he tried to \"build\" volume on top but it went flat within 10 min. I spoke up during the service and I was basically told there was nothing more he could do. I ended up coming home and washing my hair instantly. I want to leave a review but at the same time I don't feel like it's worth it. ",
    "score": 2610,
    "url": "https://reddit.com/r/Hair/comments/1o4ynhm/i_immediately_took_it_out/",
    "created_at": "2025-10-12T19:43:46.000Z",
    "num_comments": 407
  },
  {
    "id": "reddit-1onje9z",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "2 and half year hair transformation",
    "text": "A really good cut, followed by changes such as:\n\n-much gentler hair brushing\n-only brushing when needing\n-no more brushing wet hair\n-satin pillow case\n-no more sleeping on it wet\n-drying with microfiber towel. \n-total change in diet, being conscious of the amount of nutrition I'm giving my body\n-cut down alcohol consumption to maybe once or twice a month. \n-quit smoking \n-consistent trims for about a year (every month-3 months)\n-didn't color it for at least a year \n-oil!! Everyday. My favorites have been oribe gold dust oil, but I switched over to argan for a bit and now jojoba. I'm loving jojoba!!!\n-I only wash it 1-2 times a week.  ",
    "score": 1292,
    "url": "https://reddit.com/r/Hair/comments/1onje9z/2_and_half_year_hair_transformation/",
    "created_at": "2025-11-03T18:16:41.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1laffw3",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "Is $800 for my hair a highway robbery!?! Need advice",
    "text": "\nI have low shoulder length/ mid back fine thin  hair. Went to my stylist for the last 3 years. When I met her, she worked in a barber shop in a basement barber/salon in Houston and helped me “rehab” my damaged hair. A wizard if you will. She now works in a gorgeous salon and thriving (trying to be a tik tok star as well). Very skilled with color, airtouch, blonding) \n\nI have stayed loyal to her and even paid for her to come do my wedding makeup/ hair in vegas ($300 + hotel + flight). I moved out of the city and drive over an hour now because she’s the only one I trust. \n\nTypically I get a gloss or no color (I have natural dark brown hair). A cut and style and pay between $150-$300 depending on if I get a conditioning treatment etc \n\nThis week I got some highlights and went bronde. She made it more dense on ends &amp; front w a money piece. She used olaplex and did a wow deep conditioner treatment. I helped her make tik toks and was at the salon from 10a (she was late) to about 4pm\n\nShe said NOTHING about the cost. Here is my bill\n\nAirtouch, deep conditioner, olaplex, trim &amp; style \n\n= $700 \n\nGoldilocks shampoo &amp; serum (I needed these so that’s fine) \n\n= $100\n\nTip = $100\n\nSo I dropped a band on this fcking haircut. I didn’t say a word and left because I didn’t feel like fighting and it was a good job. \n\nI would have HAPPILY PAID $500 but fucking $700??? \n\nIs this normal????? Or do I need to find a new stylist. All of my friends yelled at me (also one is a stylist in Dallas)\n\nI will say the quality is top notch. I look so natural and gorgeous. But I’d rather put that money in my high yield savings account and be plain and boring. \n\nThanks for your advice!!!! \n",
    "score": 876,
    "url": "https://reddit.com/r/Hair/comments/1laffw3/is_800_for_my_hair_a_highway_robbery_need_advice/",
    "created_at": "2025-06-13T13:05:52.000Z",
    "num_comments": 659
  },
  {
    "id": "reddit-1nnfwqv",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "My hair stylist, who I have been seeing for the past 2 years, recently told me the extensions I paid her for belonged to a dead client",
    "text": "I was sitting in the salon chair, my hair stylist just beginning to put my extensions back in when she started to laugh a little. She looked over at one of her staff and said\n\n“Should we tell her?”\n“About what?”\n“About the hair.”\n\nShe began to laugh more, then proceeded to mention the first time I came to her salon. I was in a hair emergency sort of situation. The last salon I went to had put my extensions in with black thread- I have thin, bleach blonde hair. It looked horrible- but since I am terrified of confrontation- I left and went someplace else, hoping someone could help me. \n\nAnd she did! She had just so happened to have a pair of blonde extensions that matched my shade perfectly. She said a client of hers no longer wanted to wear extensions, so they gave them to her to try and sell. She told me normally these extensions are 400, but since they were used before, she would only charge me 100. I took the deal- and was absolutely AMAZED at the results. My hair had never looked better. I continued to go to this same salon for the last 2 years, at least once a month, my most recent time just a week ago. \n\nThat’s when she told me that the hair extensions she gave me- that I paid for- actually belonged to a client of hers that died. She said the client left her extensions there to be treated, but unfortunately had passed before ever getting them back.\n\nShe had a little giggle fit with the staff when she admitted to this, clearly all of them in on the whole thing. It felt kind of… icky? One of her clients had died, and she thought it would be okay to sell them to another client? This client paid for this hair with their own money. This was not something that belonged to the salon.\n\nNot only have I been wearing hair extensions that belonged to somebody else, but this person had actually died- and the money I paid for them didn’t even go to the family or any funeral costs or even flowers or even just giving them the hair back! I feel so disgusted and cheated- and I feel disgusted for the family as well, since I feel the only right thing to do would have been to contact them. ",
    "score": 628,
    "url": "https://reddit.com/r/Hair/comments/1nnfwqv/my_hair_stylist_who_i_have_been_seeing_for_the/",
    "created_at": "2025-09-22T07:20:50.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1ns0uev",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "am I right in asking for a refund?",
    "text": "let me start by saying i’ve worn weft extensions for 8 years and have never had an experience like this. I am also NOT the client that is never happy with their result. even if i’m not happy with the color I book again and just ask for something different next time. \n\nLast Wednesday (3 days ago) I went to a new salon because I needed to buy new hair, and the stylist i was seeing quoted me $4,400 for JUST new extensions from a brand that isn’t even the best quality in my opinion based on my previous experience with it. I asked for an itemized cost breakdown and she came back telling me she was able to get the cost to $3,080 and still didn’t give me a cost break down. i felt like i couldn’t trust her, and honestly never really loved her color work, so we parted ways. I found a new girl, did a consultation, ordered new hair, and that’s who did the hair in the pictures. \n\nHere’s my issues:\n- the ends have already slipped from the beads. it’s only been 3 days. \n- the 2 rows are sewn SO close together i can’t even get a pinky finger in between them.\n- the color of my natural hair is almost grey while the extensions are more warm bright in color\n- the bottom row is so close to the nape of my neck it hurts to even touch/lift it, and isn’t covered by my natural hair.\n- the individual strands of hair that make up each row are separating?? this has never happened to me\n- honestly my scalp is so irritated beyond the usual new extension tension that I KNOW it’s doing damage to my hair. \n- that blend is not good, right??\n\nSo here’s where i need help. The stylist told me if i have any issues with placement to just call and she’ll redo them for free. after seeing what has happened, i honestly just think it is out of her skill set to redo these, and i wouldn’t even feel comfortable being in her chair again. \n\nI feel it’s important for me to note that this was probably the cheapest i’ve ever gotten my hair done for. cheap for extensions and blonding, because i’m used to paying around $2000 total for new hair and install cut color. she was the owner of the salon though, in a pretty prevalent area, so i thought she must be good enough to own her own. \n\nI have so much respect for service workers, I don’t want to sound like an asshole. but is this an appropriate situation to ask for a refund? also i have an event tomorrow, i would appreciate any tips on how to style it so its hidden please. \n \n\n",
    "score": 574,
    "url": "https://reddit.com/r/Hair/comments/1ns0uev/am_i_right_in_asking_for_a_refund/",
    "created_at": "2025-09-27T17:21:12.000Z",
    "num_comments": 292
  },
  {
    "id": "reddit-1m2r383",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "My stylist gave me layers!",
    "text": "I went for a routine trim and my stylist knows I love to wear my hair with a lot of body/curls. So she surprised me with layers! I’m actually so happy. Sorry about the order of the photos, not sure how to change it. ",
    "score": 552,
    "url": "https://reddit.com/r/Hair/comments/1m2r383/my_stylist_gave_me_layers/",
    "created_at": "2025-07-18T02:53:37.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1pe0n0n",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "professional stylist ruined my hoodie",
    "text": "TLDR; do I tell my stylist she ruined my hoodie?\n\nyesterday I got my roots touched up. as my stylist was rinsing the bleach out of my hair, my back started getting really wet. she had on the cape of course, as well as a towel over that. but the towel was quickly soaked through.\n\nI didn’t think too much of it; I got home and changed, hung up my hoodie to dry (since it had soaked through the cape/towel). I then left my apartment for evening plans, and when I came back I noticed my hoodie was covered in bleach.\n\nmy question: do I say anything to my stylist? what do I say if I do? is it my own fault for wearing something that could’ve gotten ruined (even tho this has never happened to me at a professional salon before)? i’m pretty upset because this is one of my favorite hoodies 😔\n\nand if anyone knows anyway to make the hoodie look wearable again it would be appreciated lol",
    "score": 514,
    "url": "https://reddit.com/r/Hair/comments/1pe0n0n/professional_stylist_ruined_my_hoodie/",
    "created_at": "2025-12-04T13:56:28.000Z",
    "num_comments": 264
  },
  {
    "id": "reddit-1lm5vds",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "Update: After unpopular opinion, I still went for a pixie. And I love it!",
    "text": "Following the motto of \"Do it Fat\" and getting the haircut despite it usually only being featured on tiny people. \n\nTurns out, I can still look super cute with this look even though my body is a different shape than it was a decade ago when I tried it last time. \n\nTL;DR - do what you want and trust the style guidance of an honest and experienced hair stylist. ",
    "score": 485,
    "url": "https://reddit.com/r/Hair/comments/1lm5vds/update_after_unpopular_opinion_i_still_went_for_a/",
    "created_at": "2025-06-27T21:38:18.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1oyd5kh",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "Am i crazy for assuming that my hair would be serviced for free?",
    "text": "(psa - all identities and identifying information have been hidden and i don’t mean this stylist any harm) For context, I wouldn’t have ever booked w them on my own because of an unsatisfactory first experience with this stylist, and the fact that they’re newer and little inexperienced. I will say he did a WAYYY BETTER job this time and I am glad to see his progress, but my hair is very curly, long, and thick, therefore, very hard and time consuming to style and requires a lot of skill, that’s why I didn’t think I would be an ideal client for them and never really considered rebooking. I think my mistake was thinking that the offer still stood weeks later, but I mean they left it up to me to book whenever and said the they service would be on them. They didn’t mention any prices during our session or set any expectation that this was paid session, not to mention that their suite wasn’t even completely set up yet. I think a free service is not crazy when you walk into what I walked into, items scattered on the floor, not cleaned properly between clients (i.e. cut hair still on the chair) and their wash sink being in the unfinished and sketch basement of the suite building. And to top it all off they were goneeee 🍃when i got there lol, like i could care less if you smoke or not, but time and place, how do you expect to build a business with no type of professionalism towards your own establishment. Also I mentioned I have very curly hair, my texture is comparable to 3a/b hair, so still a softer pattern, this context is important because he said I could choose any style I want. I just asked for pin straight hair and trim on the edges, he did not make it pin straight and instead did big waves, because he didn’t know how to work with my hair, and also did not trim it, after assuring me I could ask for whatever I wanted. Lastly, everything was well before this part, but he put a thick wax/pomade in my roots to make my hair lay flat, iykyk, but this type of product is usually used for wigs or i believe more coiler textured hair, MY HAIR TEXTURE IS TOO SOFT FOR THIS SORT OF STYLING, and now my roots are greasy and flat and I’m going to have to wash my hair and redo it myself. I understand their time should be valued but I think that it should’ve been communicated better as a business owner and not allow me to LITERALLY WALK OUT without clarifying lol, I will pay them nonetheless bc I am not one to try n skip a tab, NEVER!! I just would’ve preferably spent my money elsewhere had I known better, what do you guys think, am I entitled for expecting this service to be free today? ",
    "score": 473,
    "url": "https://reddit.com/r/Hair/comments/1oyd5kh/am_i_crazy_for_assuming_that_my_hair_would_be/",
    "created_at": "2025-11-16T05:09:49.000Z",
    "num_comments": 190
  },
  {
    "id": "reddit-1hqe4d8",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "Hairdresser didn’t bleach my hair enough for my ombré",
    "text": "So don’t get me wrong - I think my hairdresser did a great color job (it looks good), but it’s not what I asked for as I really wanted the ends to be as close to platinum blonde as possible.\n\nI’m hesitant to go back to the same stylist (he was far away and kinda dismissed my concerns) - would another stylist be able to fix it and only just work on the ends? If so, how long should I wait before going to see one?\n\nFirst picture is what I have now and second picture is what I asked for.",
    "score": 406,
    "url": "https://reddit.com/r/Hair/comments/1hqe4d8/hairdresser_didnt_bleach_my_hair_enough_for_my/",
    "created_at": "2024-12-31T12:54:20.000Z",
    "num_comments": 175
  },
  {
    "id": "reddit-1lg6svf",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "Perm by professional stylists, 3 hours ago i left the salon, is this normal?",
    "text": "As i said, its been around 3 hours. This is in order of time each 30 minutes or so. Like its losing its spring and curl fast like is this normal or does this mean i wasted £180. First time having a perm obviously but im wondering whether its normal for them to go wavey instead and do they bounce back after a couple days? Anyone know anything about it? Im confused even though im aware of how perming works",
    "score": 403,
    "url": "https://reddit.com/r/Hair/comments/1lg6svf/perm_by_professional_stylists_3_hours_ago_i_left/",
    "created_at": "2025-06-20T15:26:09.000Z",
    "num_comments": 281
  },
  {
    "id": "reddit-1itrmmt",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "Am I overreacting?",
    "text": "1) Before (what she had to work with) \n\n2) Reference and after\n\n3) The highlights. Discrepancy in the roots. One side is uniform and even whereas the other is a mess. \n\n4) The back \n\n5) Right side \n\n6) Left side\n\n7)Cat tax\n\n\nI like to preface this by saying that I wear glasses and I couldn't really see what she was doing most of the time until the very end. \n\nInstead of cutting my hair with scissors she was hacking at it with clippers. I thought she was going really fast and when she did use scissors it was super fast.\n\nI've had short hair before but it was brown so I wanted to try it with blonde and as you can see my reference is all blonde and what I ended up with is basically a bowl cut with brown underneath.\n\nShe asked me if I wanted it tapered in the back. And I honestly should have asked what she means by that because I didn't quite know I just wanted the picture. I'm not happy with the back. But the front and sides is what is worse. TBH SHE DIDN'T EVEN SHOW ME THE BACK. It took me hours to realize that. She was avoiding showing me the back of my head. \n\nWhat I asked for is nothing like what I got at all. I wanted all blonde and part way through she said you know I can't make that part blonde because it's really short. I didn't want her to do anything that she didn't feel comfortable with so I just kind of went with it. I don't really know what.wouldve been a good way to handle that. \n\nHalfway through she got a phone call and it sounded like a client who wanted an appointment right away and she was asking her are you sure because last night it sounded like it was okay and now you're saying that you wanted an appointment right now. My husband has a theory that this phone call was maybe a redo because it sounds like it was an appointment from yesterday and all of a sudden she wants another one today or something this is just speculation. \n\nThe lady sounded fine with waiting but after that it was a totally different tone and she seemed like she wanted to rush through this. \n\nThe vibe is totally off the whole time like her music kept cutting out.  I had to work at 12:00 so she was panicking because she said that she didn't want me to be late but like that's on me and my boss was okay with that I texted her.  \n\nI didn't appreciate her snide remarks she said in a mean tone you have so many cowlicks back here, it's not my fault. And then she kept saying, you have a lot of hair over and over again like, I understand that's why I'm trying to get a haircut.\n\nAt one point, she was just about to do the highlights and she said how do you like that length and I said I wanted a bit shorter so she put it a bit shorter and then she didn't ask me if that was a good length or styling or anything she just started with the highlights like oh okay that was your one and only chance. \n\nShe was asking about styling and she was saying something like do you usually style your hair and I was thinking like day-to-day so I said no I usually don't style my hair so I guess she took that as she didn't need to style my hair for today. She literally just blow dry my hair and combed it I think she put a little bit of product in it but she didn't ask if I wanted anything else.\n\nWhen I got to work I was a little bit rushed into work so I didn't think too hard about my hair and I didn't get a good chance to look at it. I got home I was trying to style it a little bit after taking a shower and as I was combing it back I noticed that the dye job was not good. \n\nI also noticed that there is absolutely no blending between layers it's just like a harsh line between where the top blonde is and the bottom Brown and the line isn't even straight or nice looking it's super jagged and not well done.\n\nI just want to know should I do a refund should I ask if she can do more blonde on it is this fixable should I go back to her? I don't feel comfortable going back to her at this point I do have another stylist that I want to try out that I used to go to. Is this fixable how do you suggest that I should go about this? \n\n",
    "score": 380,
    "url": "https://reddit.com/r/Hair/comments/1itrmmt/am_i_overreacting/",
    "created_at": "2025-02-20T06:00:24.000Z",
    "num_comments": 260
  },
  {
    "id": "reddit-1kob7bd",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "What to do about gaslighting hairdresser?",
    "text": "Been getting hair extensions for 3 years, tapes for 7 months. Went to a diff salon to get them refitted recently and omg...agony. Not tension. Agony. The tapes were so tight to my scalp that I could even more or flip them. It was like a helmet of tape on my head. \n\nI told the hairdresser about it and she just deflected and said it was \"normal\" and to wait. I went back to my of stylist for removal but when they saw them they refused. They said way too tight to my scalp. Way too little hair in the wefts and said they fear that if they try remove them now I will have bald patches left. \n\nWent to another well regarded salon in my city, they said the very same. So I had to reiterate again to the one who did it that they were so painful and I need them out. They were getting more sore by the day. \n\nShe absolutely gaslit me the whole time saying \"well there's no irritation on your scalp so I don't get how they're hurting there's no evidence?\", tried to say it was smy scalp that was the issue, tried to say your scalp gets more sensitive in Summer (lmao) started pulling at the tapes going \"they're not too close because I can move them\" she was REEFING the scalp off me doing this and I told her that but somehow...still my scalp's fault. My scalp that has been perfect with the extensions for years and literally the day before she refitted them. \n\nShe also made clear that she wants to look at them and doesn't want me to go to another stylist even at her salon....obviously so nobody would see what the hell she had done. Obviously kept my money but I didn't ask for it back. \n\nThe removal was yesterday and my scalp is still so painful at the sides where the worst culprits were. By the way, I'm already someone with super fine hair that I'm very conscious of, which she knows. I actually have spent so much time and energy and moneu REGROWING my hair with oral Minoxidil and spironolactone. \n\nWhat do I even do here? Just let it be? I'm worried more hair is gonna come out of my head in the interim since it's obviously inflamed. ",
    "score": 212,
    "url": "https://reddit.com/r/Hair/comments/1kob7bd/what_to_do_about_gaslighting_hairdresser/",
    "created_at": "2025-05-16T20:38:01.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1lgukmm",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "Took the plunge and ditched my platinum blonde",
    "text": "I’ve had platinum blonde hair for YEARS now and honestly I loved it, but I couldn’t take the breakage anymore. I have naturally curly/fine hair so it was dwindling away to nothing lol. \n\nThe first photo was taken this past winter and the second is from a couple days ago! I think I’m super happy with it but it’s just so strange going from white hair, to having some dimension and warmth. I worked with my amazing hair stylist and she added lots of lowlights and did a beige blonde toner.\n\nI’m finally taking proper care of my hair and if I’m being honest, that’s my priority for the first time ever in my life. Also full disclosure, I obviously have hair extensions because my natural hair won’t grow much past my collarbones without breaking off lol. ",
    "score": 204,
    "url": "https://reddit.com/r/Hair/comments/1lgukmm/took_the_plunge_and_ditched_my_platinum_blonde/",
    "created_at": "2025-06-21T11:40:59.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1ifngh7",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "My Plea to all you Professionals....",
    "text": "I have been searching for a new hair stylist for a few months now. I google salons - read the bios and (hopefully) click on their Instagram link so I can look at photos of their work. I swear every damn page is just photo after photo of beachy waves and various shades of blond highlights. While I can appreciate your coloring skills I'm looking to see your cutting skills. I feel like it's easier to fix a bad color job than a bad cut. If I'm about to trust a stranger to take scissors to my hair then I would really like to see examples of your work.\n\nI'm begging you all to please add a little variety to your pages especially for us shorter hair and non blond girlies. And can we please be done with the beach waves lol)  Please and thank you. ",
    "score": 200,
    "url": "https://reddit.com/r/Hair/comments/1ifngh7/my_plea_to_all_you_professionals/",
    "created_at": "2025-02-02T02:51:14.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1i1w8iq",
    "subreddit": "Hair",
    "soc_codes": [
      "39-5012"
    ],
    "title": "A hairstylist damaged my mom's hair and gave her burns. Is this an acceptable result?",
    "text": "\n\nLong rant ahead—skip to the bottom for the TL;DR\n\n\nMy mom had highlighted hair and decided she wanted an all-over platinum blonde color. I know this is a big transformation and can be a complicated process, but the hairstylist assured her she could do it. Before the appointment, I told my mom to ask the stylist about the technique she would use, especially if she'd be using foils and leaving the already blonde sections untouched to avoid over-bleaching and damage. The stylist promised that’s exactly what she’d do, so my mom went ahead with the appointment.\n\nHowever, when my mom got her hair done, the stylist ended up doing the complete opposite of what she promised. Instead of using foils and leaving the blonde hair behind, she bleached ALL of my mom's hair in the open air, including the already lightened parts. This caused major damage and the tone was way off from what my mom wanted. Instead of a bright creamy blonde, the stylist toned her hair to a gray-silver shade, probably trying to mask the brassiness. She even left the toner on her hair for 40 minutes.\n\nOn top of that, my mom’s scalp was on fire the entire time, and the stylist told her that the stinging was “normal.” My mom even ended up with some minor scalp burns and more severe burns on her neck.\n\nNow, my mom’s hair is a mess. Some parts are brassy gold, others are gray, and the previously highlighted sections are damaged and porous from the over-bleaching. She was so excited to go blonde, but now she’s left with a color she didn’t want and hair that’s clearly been over-processed.\n\nI feel really bad for her because she’s so sweet and trusting, and I don’t think she deserves this. She didn’t say anything to the stylist when she was done because she’s just not the type to make a fuss, but I feel like this is unacceptable. Should she ask for a refund? Or is this just me overreacting? Any advice would be really appreciated, especially from anyone who’s had a similar experience or from hairstylists themselves.\n\n\n\n\nTL;DR: My mom wanted to go platinum blonde and was promised proper technique (foils, avoiding over-processing), but the stylist bleached all of her hair in the open air, over-processed it, and toned it gray instead of the bright blonde she wanted. Her scalp and neck got burned, and her hair is a brassy, damaged uneven mess. Should she ask for a refund? Sorry for the low quality pics \n\n\n\n",
    "score": 165,
    "url": "https://reddit.com/r/Hair/comments/1i1w8iq/a_hairstylist_damaged_my_moms_hair_and_gave_her/",
    "created_at": "2025-01-15T12:24:06.000Z",
    "num_comments": 34
  }
]