[
  {
    "id": "reddit-1iawlhr",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Any other women in the field?!",
    "text": "I am the future owner of my grandfathers 40+ years hvac business. I’m 22, in school and getting on the job training. I love this field and the people in it ! ",
    "score": 6907,
    "url": "https://reddit.com/r/HVAC/comments/1iawlhr/any_other_women_in_the_field/",
    "created_at": "2025-01-27T01:45:23.000Z",
    "num_comments": 415
  },
  {
    "id": "reddit-1lpki5q",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "We are going to kill a private equity shop tomorrow.",
    "text": "Both of my installers and I got a call from the CEO of a large, local (but not private-equity) hvac company today and he is offering a full benefits package and much higher wages to all 3 of us. This will result in my PE-owned shop getting shut down and I couldnt be happier. I have never been so antagonized by an employer. They repeatedly threatened to shut us down and now we get the last laugh. They will get sued by customers that don't get the fall service they prepaid for, and I will snipe basically the whole customer base. \n\nGet wrecked, you incompetent, greedy, business-destroying assholes. \n\n***update: all 3 of us accepted the offer and are starting in about 2 and a half weeks. I put my 2 weeks in, other 2 guys are putting theirs in tomorrow when they have time. Cashing out my last vaca day tomorrow.\n\n",
    "score": 1176,
    "url": "https://reddit.com/r/HVAC/comments/1lpki5q/we_are_going_to_kill_a_private_equity_shop/",
    "created_at": "2025-07-02T02:29:24.000Z",
    "num_comments": 160
  },
  {
    "id": "reddit-1meh0no",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "What's up with the previous generation of technicians?",
    "text": "Edit: We're at the point where even more of you knucle draggers think this is a real post. It's satire. A joke. Chill the fuck out.\n\nOkay so like… storytime. I (19M, slay technician) just graduated from tech school, right? Straight A’s, best in class, teacher literally said I was the only one who knew how to reboot the damn HVAC logic controller without crying. So I’m feeling confident. Resume polished. Hair gelled. Anxiety semi-contained. I'm ready to enter the workforce like a functioning adult.\n\nBig mistake.\n\nI go into this interview and the guy interviewing me is built like he played D-line in 1987 and hasn’t emotionally processed a single event since then. He gives off “I yell at traffic for fun” energy. Like… chill, Mark. It’s 2025.\n\nAnyway, I tell him I’m looking for $40/hour because, idk, I have student loans, rent, and I’m literally worth it. I coded an entire diagnostic tool as my capstone. I'm him.\n\nBro looks at me like I asked to date his daughter and borrow his truck in the same sentence.\n\nThen I mention I’m not doing on-call or weekends or overtime because anxiety is real and if I don't set boundaries I’ll spiral and end up in a corner eating drywall. I thought this was a safe space? Apparently not. Mark short-circuited. Man looked like someone told him the Packers were moving to Brooklyn.\n\nHe deadass asks me what the benefit of hiring me is if I can’t work overtime. Like sir… how about skill? Talent? Gen Z intuition with smart tech and emotional nuance?\n\nAnd then—get this—he says “The best tech in your class was the one teaching it.” ??? Okay. First of all, Mr. Jenkins couldn't tell the difference between a USB and a Twix bar until I showed him. Don't even.\n\nTHEN HE CALLS ME A CREAM PUFF. 😭😭😭\n\nLike sir… what year is it? Is this a Dickens novel? Are we solving HVAC issues with coal and trauma?? No fr tho I thought he was gonna challenge me to a duel and call it a “man test.” I genuinely feared for my soy-based endocrine system.\n\nAnyway, I left. Gonna go work for a start-up with nap pods and kombucha on tap. Hope Mark enjoys being mad at clouds.\n\n(If you made it this far, please take a deep breath and realize this is a shitpost)",
    "score": 981,
    "url": "https://reddit.com/r/HVAC/comments/1meh0no/whats_up_with_the_previous_generation_of/",
    "created_at": "2025-07-31T23:32:59.000Z",
    "num_comments": 188
  },
  {
    "id": "reddit-1iiqu1d",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Never again",
    "text": "I did a buddy a favor and installed a new 5 ton R-32 condensing unit and evap and relocated with new line set for $6000.  I told him his ductwork is trash and needs to be replaced.  It's a 4 bedroom 3 bath ranch house, so it's long.  I told him if he buys materials for $1800, I'll demo and install all new for $2400.  So $4200 for all new ductwork, tee wyes, dampers, flex, installation out the door.  He said he needed to talk to his wife because it's a lot of money.  He just called and told me if I do the install for $1000, he'll let me do it because they don't want to go over $9000 for everything.\n\nI said wow, you'll let do it for $1000?  I told him he can go fuck himself for free.  Now you can pay someone else and see what their prices are.  When this is over, you'll know who the true friend was between us ",
    "score": 774,
    "url": "https://reddit.com/r/HVAC/comments/1iiqu1d/never_again/",
    "created_at": "2025-02-06T01:30:19.000Z",
    "num_comments": 155
  },
  {
    "id": "reddit-1iz4xhh",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "I didn't realize how much I ACTUALLY made as a resi tech!",
    "text": "I accidentally asked for a raise that was promised to me 2 service managers ago, thank fuck i kept the paper trail with emails.\n\nSitting down with the big honchos showed i have a less than 4% callback rate, but i don't turnover enough. \n\nWhy would you clean a flame sensor as a curtesy and not charge for it on top of the $100 preventive maintenance fee?\n\nMy bad, sorry, I'm too busy fixing other peoples misquoted repairs. \n\nIt makes it hard to convince the customer we're a great company to service everything in their house, let alone me fixing the fuckoff catastrophe we installed 10 years ago.\n\nI shut the fuck up when i was wrong\n\nI was wrong!\n\nI make $18 an hour\n\nI was wrong!\n\nWith my dental, health, and other costs i am, DUHHHH clueless about, i make $25 an hour!\n\nOh shit, i didn't know!\n\nYeah, those pizza parties aren't free, \n\nYou drinking work provided coffee has been noticed, \n\nWe itemized every flush in the shop, and the water bill skyrockets the second your overpaid ass hits the toilet seat. \n\nThats basically stealing.\n\nNote to consultants that convince companies to turn private equity:\n\nGo fuck yourself \n\n",
    "score": 736,
    "url": "https://reddit.com/r/HVAC/comments/1iz4xhh/i_didnt_realize_how_much_i_actually_made_as_a/",
    "created_at": "2025-02-27T02:10:48.000Z",
    "num_comments": 150
  },
  {
    "id": "reddit-1mecof6",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "What's up with the new generation of technicians?",
    "text": "I don't know if the older guys have noticed like I have is that new technicians coming into the field are nothing like technicians from 20 years ago.  I'm not saying all of them, but there is a good chunk that are just soft.\n\nI interviewed a guy today, but this happens every couple interviews, that just graduated from school and are asking for $40 an hour because \"I put in my time at school\" and he actually believes he's worth it.  He's 19 and I told him the schedule and he said he doesn't do on call, overtime, or weekends because it causes him anxiety and when he starts getting stressed, his generational anxiety could land him in the hospital.  Like what the actual fuck is happening??\n\nIf I told my boss that 30 years ago, he would slap the shit out of me and tell me to knock it off.  I looked at him and asked if he was serious and he told me yes.  Then I asked him what would benefit me hiring him if he's on the edge of a breakdown if I make him work an hour overtime?  He said I would get the best technician in his class and I laughed at him and said the best technician in your class was standing in front of the class teaching.  \n\nI probably shouldn't have called him a cream puff because I'm sure he's going to run to his therapist and sue me, but fuck.  What the hell is happening.  Is anyone else seeing this?\n\n\nEDIT:\n\nI think there's a little confusion about the point I was trying to make.  I just posted what the guy said during the interview.  Somehow people read it as I'm an asshole to my guys and demand they work overtime, weekends, and rotation.\n\nThat's not how my company works.  I realized a long time ago that treating my guys with respect and paying them well creates a job they look forward to coming too.  My guys are like my family and the first 3 guys I hired in 2010, still work for me.\n\nI just thought this kid was a little demanding with the $40 an hour.  BUT, I do pay new guys right out of school $25 to $30 an hour and I pay my regular guys $50 to $70 an hour.\n\nIt makes zero sense to run a company where people hate coming to work.  Did I bust my ass before I opened my company, yes I did.  So do I require my technicians to kill their body for a paycheck?  No.  First thing I bought when I opened my company was a crane.  Not for huge lifts, but for package units and compressors.  Then I sent my guys to school to learn how to use it.\n\nMy company is what it is because of my employees, not because of me.  I want my guys to want to come to work, not stress them out so much they want to quit.  That would defeat they purpose of having employees if the all quit ",
    "score": 658,
    "url": "https://reddit.com/r/HVAC/comments/1mecof6/whats_up_with_the_new_generation_of_technicians/",
    "created_at": "2025-07-31T20:34:13.000Z",
    "num_comments": 364
  },
  {
    "id": "reddit-1i7tg3j",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "I made a $300,000 mistake",
    "text": "THIS POST IS FOR THE YOUNG PEOPLE WHO HAVE MADE MISTAKES AT THEIR JOBS! \n\nOn January the 16 my lead tech and I (1 year in commercial)  were having issues with a building over heating. At this site I work at, we have 3 air handlers. 1 with a hydronic coil, and 2 ahu with no hydronic coils, they use the coils in the VAV/FPB to heat the spaces. That’s how the building was designed. I was myself and wanted to try and cool off the 1st foor, and with it being 30 some degrees outside, I would open the economizer on the 1st floor AHU. I set automation to open the OAD (outdoor air damper) but the actuator wasn’t moving. So I manually opened the damper to allow cool air to come through. Over the weekend, the temperatures fell below freezing and Monday there was 2 hydronic reheat coils that burst on the VAVs. Bathrooms, classrooms on the first and lower level got drenched. I was informed the next day by my coworkers about the situation. I did some digging and realized it was my mistake. I told my two bosses and they weren’t heavily concerned but told me that I’m only doing PMs from now on. Tho my lead HVAC tech informed me that my direct boss was throwing me under the bus to the contractors that were fixing the units. Both the boss and contractors shit talking about me. \n\nI feel awful, if I get fired it’s understandable but if I get written up, I just have to keep my head down and realign myself. \n\nIn the end we all make mistakes, some big, some small but overall it’s about how you deal with it afterwords. ",
    "score": 653,
    "url": "https://reddit.com/r/HVAC/comments/1i7tg3j/i_made_a_300000_mistake/",
    "created_at": "2025-01-23T02:46:06.000Z",
    "num_comments": 170
  },
  {
    "id": "reddit-1kr5hx4",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Anyone else get the self diagnosing customers?",
    "text": "I work at a small mom and pop. Our office lady has been there for about 20 years. She thinks she knows HVAC when she really doesn't. She got a call from a customer asking for service because the t-stat was blank. Instead of putting them on the schedule she said it's most likely a bad t-stat and told them to go out and but a new one. \n\nA little while later she calls me, the only service guy, to call them because they are having trouble installing the t-stat. I reluctantly call and get an old couple that are both taking on the phone with me and arguing with each other. They also won't answer my questions or can't follow simple instructions. So i say I can't help over the phone and we will get them scheduled. \n\nI'm really annoyed with our office lady. Because it's almost never the t-stat that's failed. It's a power issue. Plus the customer is annoyed because they did all this crap for nothing and now I get to go deal with it.",
    "score": 637,
    "url": "https://reddit.com/r/HVAC/comments/1kr5hx4/anyone_else_get_the_self_diagnosing_customers/",
    "created_at": "2025-05-20T13:56:22.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1kfc60q",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "I may have to teach you. But I don't have to like you.",
    "text": "Lost the apprentice lotto on our most recent hire. He worked for an HVAC company for 3 years as an install. Then did his own handyman business for 7 years. Occasional gas furnace installs. \n\nI'm thinking dope he knows at least a little and knows how to work. He knows nothing. Not even thermostat wiring. I showed him how to wire a Honeywell EIM board. After showing him he asks why don't we put the wire here? Cause the manual says to put it here... Yeah but what happens if we put it there? It won't work or it will short. I don't want to find out. \n\nI'm in my 30s. He's in his 40s. It's already a weird dynamic for me to be teaching him. To his credit. He tries to learn though he is a bit slow on the pickup. But I'm already doing what I can to get away from this guy. \n\nOut of the blue he asked me if I believed the world was round. When I said yes and asked him the same question because it begs the question. He said he doesn't know what to believe and then spent the next 15 minutes trying to convince me the world was flat. He's also shown me a 10-year complete collection of his adult magazines. The famous brand everybody knows with the bunny. He points out every possible flaw on a job to a customer. Including wrinkles to the tape around the unit in the crawl space. Or even saying the thermostat we just mounted isn't level. I had already checked it with a level and it was good. Him and the customer were staring at it for like 10 minutes. Trying to figure out if it was level or not. When customers ask him questions he can't say I don't know he just rambles. And half the time ends up spouting bullshit.",
    "score": 511,
    "url": "https://reddit.com/r/HVAC/comments/1kfc60q/i_may_have_to_teach_you_but_i_dont_have_to_like/",
    "created_at": "2025-05-05T13:52:57.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1oejfg0",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Rookie mistake on a “no heat” call",
    "text": "So the other day I went to a no-heat call and diagnosed a faulty gas valve. The furnace was about 20 years old, so I recommended replacing it instead of dumping money into it. The homeowner agreed since it made more sense long term.\n\nFast forward to today we went and installed a brand new furnace. My boss went to another job, so it was just me and another tech finishing everything up. After connecting everything, we realized we weren’t getting any gas. Checked the shutoff all good. The other tech asked if I turned off the gas at the meter, I said no but went to check anyway… and sure enough, the gas meter was locked. 🤦‍♂️\n\nSo yeah… that explains the “bad gas valve.” I know, dumb rookie mistake. I’ve been doing HVAC for about 9 months now, still learning every day.\n\nWhen we finished, I called my boss and he asked how the furnace job went. I told him everything’s good, we finished, but there was a slight problem. He’s like, “What happened?” I told him we weren’t getting gas, and he goes, “Don’t tell me the gas meter was locked.” I said, “Yeah…” and he’s like, “Oh shit, let me call you back.”\n\nFifteen minutes later he calls me and says the homeowner was pissed — and he ended up giving them the furnace for free and ate the cost. 😬\n\nHope you guys get a good laugh from my dumbass mistake. Lesson learned the hard way!",
    "score": 494,
    "url": "https://reddit.com/r/HVAC/comments/1oejfg0/rookie_mistake_on_a_no_heat_call/",
    "created_at": "2025-10-24T00:10:48.000Z",
    "num_comments": 253
  },
  {
    "id": "reddit-1iwn8t2",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Here We Go Again",
    "text": "Got a request for a second opinion on a 4 ton package unit on the roof of a residence.  Customer had this company come out and tell her that her heat exchanger was cracked and he had to condem the unit and red tag it.  He showed her pictures of the heat exchanger and there were definitely holes in it.  This companies quote to replace was $21,000.  Unit, crane, permits, new roof jack and plenums into the attic.  \n\nAnytime this companies name is brought up, it's usually because of the shady shit they do.  I get on the roof and strip the unit to see the exchanger and the thing looks brand new.  I look at the pictures, and it's not even the same unit.  They scared the customer, red tagged her unit, and gave her a completely unrealistic bid.  \n\nThis time it wasn't an elderly person on a fixed income like last time, but they still left this family with no heating for 3 days knowing that the only thing actually wrong with the unit was the pressure switch failed.\n\nThese companies need to stop trying to bury people in debt so owners can go on vacations and technicians get their precious commission.  I might start a page and outing these companies and invite other technicians to give me their best stories of these crooked fucking companies putting profits above being decent human beings.  Maybe it could become a place where people can find honest technicians that want your business for life and not that one big payday ",
    "score": 385,
    "url": "https://reddit.com/r/HVAC/comments/1iwn8t2/here_we_go_again/",
    "created_at": "2025-02-23T23:03:31.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1m7oo0n",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "This made finding the leak much faster.",
    "text": "New customer, 6 months.  Called 10pm yesterday.  We don’t do late night calls.  7 am was the best we could offer.  He called someone else.  Jump to 8ish this morning,  first person quoted too high. He can’t afford it. Please come and fix it.  Icm working 2 blocks away and have 2 installs.  Told him after lunch. Nope no good calls someone else.  1pm, second company refused to repair.  I don’t blame them.  It’s too old and beach damaged.  We’re down to wiring and programming.  We’ll be there as soon as we can.   Dude called another company!  They sent 4 guys and the owners son.  I / we beat them to the job by moments.  I hope they bill the guy too.  We have enough going on to bid us against each other.  we don’t need the hassle. Stay sane out there my brothers. ",
    "score": 372,
    "url": "https://reddit.com/r/HVAC/comments/1m7oo0n/this_made_finding_the_leak_much_faster/",
    "created_at": "2025-07-23T23:26:22.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1mkllaf",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "What’s up with these HVAC contractors?",
    "text": "I had an interview with an owner of mid-sized HVAC company (appeared to be Gen X or a Boomer) because I was considering switching my career into the trades and getting licensed.\n(A little background: I’m 25 y/o currently in civil engineering, finished school, and have about four years of work experience.)\n\nThe owner had a mechanical engineering degree and was using that to try to sway me into joining his company. I explained to him when I was 13 and starting high school, I spent every summer working with my dad installing HVAC units everything from 10-ton package units to 5-ton split systems, pancake units, mini-splits, and even a handful of water systems.\n\nAfter sitting with him for over an hour and explaining how these systems work (refrigerant, capacitors, metering devices, coils, blowers, fans, etc.) he offered me… wait for it… $15/hour.\n\nI left that lunch so fast lol. \n\nShoutout to all the Gen Z folks trying to get into trades don’t take trash from nobody know your worth.\n\nEdit:\n\nIn the state of Florida, any engineering degree is considered a construction-related degree, which allows me to obtain a license with just one year of experience or 2,000 hours of work.",
    "score": 316,
    "url": "https://reddit.com/r/HVAC/comments/1mkllaf/whats_up_with_these_hvac_contractors/",
    "created_at": "2025-08-08T04:20:31.000Z",
    "num_comments": 187
  },
  {
    "id": "reddit-1okdes2",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Man, some days this job destroys my confidence that I am a competent technician.",
    "text": "Working for a small company I feel like I let them down. I care a lot and I need to disconnect my emotions from the job. I find my failures are so hard to overcome, and it seems they snowball on me. I swear some days the universe is just out to get us techs. Just getting it out tho, I know it’s been said before and I have no one else to talk it over with. That’s all.",
    "score": 221,
    "url": "https://reddit.com/r/HVAC/comments/1okdes2/man_some_days_this_job_destroys_my_confidence/",
    "created_at": "2025-10-30T22:15:57.000Z",
    "num_comments": 118
  },
  {
    "id": "reddit-1k14k8t",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Just left my first HVAC job because I refuse to be groomed into a sleezy sales technician",
    "text": "All throughout my life I'm met plenty of honest trades workers. Eventually I decided to join the trades and turns out I enjoy HVAC work. Freshly out of school, greener than grass I was offered a job at relatively big company in my area. Without hesitation I took the offer and got a start on my career. \nNot sure when sales technicians replaced service technicians but boy oh boy I was shocked with how little we were encouraged to solve the actual problem. The only training I received from the company was sales tactics and how to condem systems. I got into the trades because Im a social person and enjoy helping by providing good service. \nWell now I'm starting off at a Ma n Pop shop where everyone seems to be legitimate service techs (so far) and I'm actually getting an apprenticeship style training. That first job was good exposure and I definitely had to hit the ground running. Sales training helped me have those uncomfortable conversations with some customers but in the end I guess that part of the industry doesn't align with my morals. I understand sales is what grows business and revenue. Commercial is great but residential is more my thing. Helping someone and feeling good about. Maybe I'm crazy but I'm sure there's still tons of $$$ to be made through honest work \n\nTLDR: Left my first HVAC job because ridiculous up selling and premature condemning doesn't feel ethical. Found a new company that seems more focused on quality over quantity. ",
    "score": 192,
    "url": "https://reddit.com/r/HVAC/comments/1k14k8t/just_left_my_first_hvac_job_because_i_refuse_to/",
    "created_at": "2025-04-17T04:41:01.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1n8lcr9",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "TIL I am not physically capable of doing the job and im kinda devastated",
    "text": "Ive just gotten into the field from school, really enjoyed the trade and learning from it and was excited to make this my career.\n\nI started a job as commercial maintenance technician this week, yesterday i ran a single call with my training lead where it was just a routing maintenance on an RTU, i didnt bring a water bottle with me and honestly didnt prepare myself enough, and got dehydrated at which point the guy told me to go in the van and cool off.\n\nToday I tried to avoid that by drinking more than day before and of, but I still over exerted myself and even though I wanted to keep pushing I was once again sent to the van, afterwards I was let go due to safety concerns and I understand why, its just kinda devastating.\n\nI had worked in the heat before but it had been a while since that point and overestimated my capabilities. Honestly dont really know how I can recondition myself or if this isnt it for me even though I enjoy it.",
    "score": 192,
    "url": "https://reddit.com/r/HVAC/comments/1n8lcr9/til_i_am_not_physically_capable_of_doing_the_job/",
    "created_at": "2025-09-04T20:32:43.000Z",
    "num_comments": 263
  },
  {
    "id": "reddit-1nvdiol",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "The master technician",
    "text": "Before I started here, there was a technician with about 30 years of “experience,” at least from what he said. I got this job through a referral right out of college. My first day went smoothly, but on the second day he came in for his last paycheck. He was ranting about being the best technician and calling the boss a noob, then left me with around 30 units that weren’t in good shape.\n\nFrom what I’ve seen, most of the problems came from him cutting corners. He’d replace parts unnecessarily, call compressors bad when they weren’t, put filters in wrong, close vents, never clean the A-coils, and never bother with the ductwork. On top of that, he’d spend hours on lunch or even sleep in his car during the day.",
    "score": 187,
    "url": "https://reddit.com/r/HVAC/comments/1nvdiol/the_master_technician/",
    "created_at": "2025-10-01T16:49:17.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1os1ssg",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "New to the trade need some help",
    "text": "Im new as in I got my Universal Epa 608 license online and will be starting a job as a maintenance technician within the next few weeks, was given this list of tools that I'll need for the job, was told to get all of level 1 before starting and the rest I'll get as I go, is there anything missing from the list that would be important? Or anything here that really isn't necessary? Ive already got all of level one with the multimeter being a field piece sc260 and the gauge being a lichamp one from Amazon ",
    "score": 161,
    "url": "https://reddit.com/r/HVAC/comments/1os1ssg/new_to_the_trade_need_some_help/",
    "created_at": "2025-11-08T22:00:21.000Z",
    "num_comments": 230
  },
  {
    "id": "reddit-1mshht6",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "I made something to help me deligate and deal with constant helper turnover",
    "text": "Centra FL HVAC contractor, installer and technician of 10 years here. I primarily work with one helper and work for local companies that either can't get to it or prefer my work, on difficult or complicated jobs, compared to their guys. I have recently had some trouble getting helpers to be reliable even though I pay $18-25hr depending on skill/transportation. It seems everyone would rather randomly turn up on a Tuesday and ghost me after weeks or months of reliable work instead 😮‍💨 *Exhausted sigh* anywayyyyys this list started because I'm tired of having to break my train of thought and remind/remember what my helper or myself needs to do next. I kinda blasted through this in a couple hours while relaxing on my first day off in 3 weeks. Please feel free to tear it up lol I'm looking for any and all advice. Either having to do with this list or anything else about this amazing trade that I love",
    "score": 154,
    "url": "https://reddit.com/r/HVAC/comments/1mshht6/i_made_something_to_help_me_deligate_and_deal/",
    "created_at": "2025-08-17T04:30:45.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1pjfoyu",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Looked like a fool today",
    "text": "Coworker diagnosed a bad gas valve and ignition board on a package unit. I was sent out to do the repair. Thought it was weird to have both of those issues at the same time so I decided to double check his work. \n\nPrior technician claimed the ignition board was not sending the voltage to the gas valve. I was able to confirm 24 volts going to the gas valve and was able to eliminate the ignition board as the issue. And didn't change that out. \n\nWent to check the gas. Found that when the gas valve was receiving voltage no gas was coming out naturally. Checked gas pressure prior to the gas valve and it was at 3.5 in WC. This is where I messed up. In my head I was looking for there is either gas or there is not. When I saw 3.5 I thought hmm that slow but at least there's gas there. Went ahead and changed out the gas valve. \n\nSure enough, after changing the gas valve it didn't work. Rechecked gas pressure and now I have 0 on both sides of the gas valve. The 3.5 I was reading was likely residual gas that I then let out after changing the gas valve hence why I was reading zero now. Turns out the business forgot to call the utility company to turn their gas back on after shutting it off for the summer. They forgot they had done that and we didn't catch it.",
    "score": 148,
    "url": "https://reddit.com/r/HVAC/comments/1pjfoyu/looked_like_a_fool_today/",
    "created_at": "2025-12-10T21:50:59.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1lzpose",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Why do some of the technicians out there treat parts guys so poorly?",
    "text": "Parts guy here. Been in the industry for a little over a decade. Started out doing commercial HVAC for about 6 years. Moved on to parts/sales and I've been here the past 4 years. \n\nI understand that it can be incredibly stressful out in the field, especially during summer. What I cannot understand though is why some of the people in this industry treat parts guys so poorly. Just had a fella from a company I won't name come into my parts house (you've all been to one I just won't say which one I work for) and ask for a control board for an RTU unit. The parts list showed three different options for control boards (ignition, main UCB, and an optional bacnet board) that the unit has. I asked him which one it was and the guy flys off the handle and says \"You parts guys all have no idea what you're doing. Every parts house I go into is damned useless. I can get this shit on Amazon for cheaper anyway!\" Then he stormed out. Personally, I don't want his business anyway. He can stay out if that's how he treats everyone. \n\nI understand this is an isolated incident but the general attitude towards the parts guys in this industry just seems to be negative overall. We may represent the manufacturer that you have a problem with but you must understand that we can only do what we are allowed to do. We don't want to lose our jobs just like you don't. We can only take pricing down on certain things and we can only answer so many phone calls at a time.\n\n All I ask is that next time you're in a parts house, please, cut us some slack. It's rough for us too. ",
    "score": 140,
    "url": "https://reddit.com/r/HVAC/comments/1lzpose/why_do_some_of_the_technicians_out_there_treat/",
    "created_at": "2025-07-14T15:37:54.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1nrwl7q",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Hang in there fellas, it gets better",
    "text": "I’ve walked a really odd path in this trade. I started out in commercial at an amazing company. I stayed there for over 2 years but felt like I was never going to progress if I was just a filter and belt changer. I watched my buddies in residential be promoted to service technicians after 2 years in maintenance and got a bit jealous. I left my nice cushy company to go to another commercial company for $1 more per hour. Bad move. They fired my mom my first day in the field. I finished up the call that I was on and turned in the keys to my van. I was there for 4 days. Finding another job in HVAC with my experience level was extremely difficult. I had just moved out of my parents and in with my fiance at the time that I quit that job. It took 3 months of rigorously applying to all sorts of different positions. I even tried to become a cook at Chili’s and Applebee’s just to have some sort of income and end the constant fighting between myself and my future wife. I got into resi after 3 months of applying that was seemingly never going to end. Resi wasn’t bad but the company I work for is one of those PE companies that we talk so much about. They wanted me selling the top option to each customer. I’m a terrible salesman and on top of mistakes that I’ve made on calls (being new to actually maintaining units, not just changing filters and belts) a few days before Christmas 2024 I left the gas plug out of a furnace after taking a gas pressure reading and it completely charred the inside of the furnace. My manager told me to sit at home for a few days while he figured out what to do with me. I ended up getting written up and almost fired. They told me I could join their duct cleaning team or “part ways as friends”. Man I was completely defeated. I still needed a job so I accepted. I got as good as I possibly could at duct cleanings and got revenue flowing on the duct cleaning side. Only ethical selling— completely necessary repairs. My manager keeps asking me to go back into maintenance now and I won’t accept. No way will I be playing their reindeer games again. For nearly the past year of being a duct cleaner I’ve been upping my knowledge within the trade and I’m really impressed by the amount of growth I’ve been able to achieve just by pushing myself harder and more consistently. Now I’ve got job offers like this one that nearly made me tear up after all the hard times I’ve seen in this trade. My current crap employer pays me $18/ hour and doesn’t respect my time or knowledge/ experience. Big mistake. I’m way more comfortable with HVAC equipment now and I’m going to make one of my future employers happy to have me. Rant over. Sorry for the word vomit. This trade means a lot to me and I take pride in my work. This job offer that I just received a few days ago makes all the hard times worth it.\n\nTLDR: not every employer is going to treat you like dirt. Take your career into your own hands and push yourself when you’re at home, instead of scrolling Facebook take the time to learn something new in your field. It pays off MASSIVELY. Almost a $10/ pay raise from where I’m at and a bump in title. Not even union. My union interview is on Monday 29th",
    "score": 109,
    "url": "https://reddit.com/r/HVAC/comments/1nrwl7q/hang_in_there_fellas_it_gets_better/",
    "created_at": "2025-09-27T14:26:03.000Z",
    "num_comments": 104
  },
  {
    "id": "reddit-1i56bev",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Any rule of thumb for charging?",
    "text": "Hi guys\n\nI'm still kinda new in the trade so still learning the basics. Sometimes in my spare time I tag along with some technicians I know to learn more. Yesterday another tech and I went for a compressor change out on a R404a system which was a two door freezer for cakes (identical to the one you see in the pic), where the \"shelves\" are actually function as evaporator. The freezer label said it takes 640 grams (23.57 oz) of refrigerant.\n\nWe changed the compressor out and as well as the filter and really cleaned the condenser coil. The system has a capillary tube and no receiver.\n\nI still haven't got my own scale and his was left at his workshop so after pulling vaccum and making sure there's no leaks, I started chaging gas carefully (I did so as a liquid) and the system had one service port only (on the compressor itself). I charged slowly and could see the pressure on the gauge. I stopped when it stayed at 2 Bar (29 PSI) and the turned the sysem on. \n\nI have swapped several compressors and I was taught that when charging witout a scale, I should keep charging gradually till suction line close to the compressor starts getting really cold till is frosty or a layer of frost appears on it.\n\nBut this time I noticed two things, first, the condenser fans (two fans) were blowing cold air instead warm air. Second, the inside of the freezer wasn't getting cold at all, not one bit. \n\nI decided to keep charging very carefully (liquid through low side). The problem is I had no idea how much I was charging. Discharge line right at the compressor eventually reached 42C (108 F), and return line next to it, stayed at 16C (60F) and the low side pressure was 2.5 Bar (36 PSI) which pretty much the pressure for temperature needed in the evaporator when everything is unning smoothly. But again, no cold whatsoever inside the freezer, the shelves (two sets of evaporators) were warm and after two hours they got even warmer.\n\nIt was late so we shut off the system and lef cause the owners had to leave. I was convinced the refrigerant was not reaching the evporators due to something being clogged, perhaps the capilary tube or even the new filter.  The other tech thought that maybe the 1/4 line we brazed (on either side of the filter) was clogged due to poor brazing (this has happened to him in the past on an AC) \n\nToday he went back to the bakery and realized nothing was clogged and that the system had barely any refrigerant in it. He pulled vaccum, charged the right amount (this time using his scale) and the freezer started pulling down temperature in few minutes and is running great. \n\nI know this comes down to experiernce but how do I know I'm not overcharging when I'm doing it with no scale? For some older systems there's no info on it so charging by weight is impossible so relying on superheat may be the only option left. But I'm baffled that all refrigerant I charged (liquid refigerant) went \"missing\" into the system. Also, how am I supposed to charge liquid when there's no liquid receiver and no service port on the high side ir liquid line? I know there's vaporizers out there but haven't got one yet. \n\nThe other tech tells me that he's been charging R404a as gas for years and everything is fine. He's an old school guy. I did insist that refrigerants such as 404a gotta be charged as liquid only, but insisted that I could of damaged the compressor, which is also true.\n\nDo you guys have a rule of thumb when it comes to charging with no scale? How do you make sure you're not overcharging? Also, with no vaporizer, how can I charge liquid in a system like that when there's no service port on the high side and no receiver? Maybe I should have installed one myself prior to charging? \n",
    "score": 107,
    "url": "https://reddit.com/r/HVAC/comments/1i56bev/any_rule_of_thumb_for_charging/",
    "created_at": "2025-01-19T19:13:35.000Z",
    "num_comments": 208
  },
  {
    "id": "reddit-1m5xmpm",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "Future of the trade",
    "text": "I'm quickly getting discouraged with the direction that manufacturers are pushing us technicians.\n\nCalled ABB tech support today and was told they no longer offer technical assistance for a drive that was discontinued only a couple of years ago. The next call had a 19xr Centrifugal. Carrier said they no longer offer technical support on equipment over 10 years old for chillers. Trying to get a hold of Trane tech support being told to call the local branch, they direct us to another state. Who directs us back. Then being told they can't help us?? So then we have to reach out to the salesman we order parts from asking if he can help and he submits a ticket for us.\n\nCalling multiple different OEM manufacturers giving my information and being called 1-3 days later consistently if I get a call back. For equipment that I've flown to their state for, paid 1500-2800 dollars for a week long class and still struggling to get a hold of support. Having to call the instructors and then them doing a favor and helping us get in touch with the right people.\n\nBrand new large tonnage equipment we sold to the customer and are certified in. Being forced to have OEM come in and do the start ups then trying to sell service contracts locking them in for 5+years. Customers who've been our account for 20 years.\n\nA manufacturers moving away from gateway pluggins to the new dongle plug-in which they said they won't sell to us you have to be a technician and I used to work for them. Then having a ton of service menus you cannot access for repairs or make changes to the equipment unless you're an employee.\n\nAnother saying they won't sell us the license to plug in and work on equipment even though we're certified. The customer calling who owns the equipment asking if they can buy it and being told no.\n\nTons of manufacturers moving to proprietary parts that we can only get from them. Generic things like motors.\n\nEquipment being far less serviceable so that you just replace parts instead of giving the option for repair.\n\nWe start up new equipment almost everyday and the amount of issues coming straight from factory. Being told the boiler doesn't leave until all satisfies have been wired and the boiler shows up without safeties wired and missing half the wiring for low voltage.\n\nI could go on and on. It's getting harder to be a tech when it seems every week we are hitting roadblocks that we have to find a work around for.\n\nMy coworkers and friends who work for competitors are experiencing the same issues. I've had a lot of friends leave the trade in the last 5 years due to the increasing headache. Customers are becoming frustrated with all of us. Even the OEM guys I know want to work on other OEM equipment. Not just their brand.\n\nI'm curious what the trade will be like in 10 years, but I think the direction we're heading in the pursuit of profit is wrong. We should have the right to repair and the customer should be able to choose who's service they want to use. Not be strong armed into this manufacturer because their the only ones who have the password.\n",
    "score": 99,
    "url": "https://reddit.com/r/HVAC/comments/1m5xmpm/future_of_the_trade/",
    "created_at": "2025-07-21T22:50:44.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1pabp2s",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "This Job Finally Motivated Me To Buy Gloves",
    "text": "This one was a doozy, a callback from the week prior where another technician removed a dead mouse from the inducer and called it a day. Came back because now the system was short-cycling.\n\nFound the inducer sloshing water, after checking things out the horrible truth of the matter came out. A second or possibly even a third mouse had actually gotten into the inducer, managed to climb through it and into the secondary water-box. There the second mouse either scurried around for hours and hours and then eventually tried to squeeze down the drain-trap out the side. Unfortunately it couldn't squeeze enough and got stuck just after the elbow out the side of the system. \n\nWhat that left me with was a bunch of rotten smelling mouse-soup, complete with cloudy-brown mouse-broth in the drain lines. I think it might have been three mice total as I found at least one bone in that soup.. \n\nCutting the drain pvc and screwing the trap off I took it out to my truck and blew in every orifice with 300psi of nitrogen. Eventually a soggy dead mouse launched out and hit me in the shoulder. \n\n  \nYuck. ",
    "score": 96,
    "url": "https://reddit.com/r/HVAC/comments/1pabp2s/this_job_finally_motivated_me_to_buy_gloves/",
    "created_at": "2025-11-30T06:49:55.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1i1hnk8",
    "subreddit": "HVAC",
    "soc_codes": [
      "49-9021"
    ],
    "title": "I bought this book to teach myself from scratch. Advice? (Read more)",
    "text": "I am currently in the military and plan to retire in about 2 years. I want to be an HVAV technician after retirement. I plan to go to school for HVACR but I wanted to get a head start and teach myself what I can. Do you think it’s a good idea? Am I wasting my time? I think learning now will make the school easier and make my transition into the career much smoother. Any advice is appreciated. ",
    "score": 91,
    "url": "https://reddit.com/r/HVAC/comments/1i1hnk8/i_bought_this_book_to_teach_myself_from_scratch/",
    "created_at": "2025-01-14T21:57:44.000Z",
    "num_comments": 93
  }
]