[
  {
    "id": "reddit-1ns3563",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "I witnessed a Driver lose his life last night",
    "text": "I was delivering a load last night at a Walmart DC. And while waiting outside for my paperwork witnessed a tragic accident. Another driver had just stepped out of his rig to head to check in. When he was struck by another truck who didn't see him. It was dark and the lighting was poor. They brought the driver who hit the other guy over to where I was waiting and he just collapsed and began sobbing and screaming that he was Sorry. I watched them perform CPR on the other guy for over 30 minutes. Before unfortunately calling him on the scene. They then taped off the area around him and left him lying there on the asphalt wrapped in a white sheet. It was very hard to witness and I wish there was more that could have been done. I don't know the driver's name who lost his life but he was somebody's family. And I just hope is that peace wherever he is.  Please remember to be safe out here. And take the extra time to be aware of all your surroundings.\n\nI'm still trying to process everything that happened and wrote a short tribute to the driver to honor his memory.\n\nFor the driver whose name I never knew,\nbut whose life touched mine all the same.\n\nTonight, I witnessed your last journey—\nnot as a stranger, but as another traveler on the road,\nworking, surviving, making your way through this world.\nMay you be remembered not for your final moments,\nbut for all the miles you traveled, the people you loved,\nthe life you lived.\n\nMay your family find peace.\nMay those who witnessed remember your humanity.\n\nRest easy, driver.\nYour journey’s done, your wheels are still.\nWe’ll take it from here. I will carry your memory with me.",
    "score": 1930,
    "url": "https://reddit.com/r/Truckers/comments/1ns3563/i_witnessed_a_driver_lose_his_life_last_night/",
    "created_at": "2025-09-27T18:53:18.000Z",
    "num_comments": 261
  },
  {
    "id": "reddit-1lxo8a0",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Lost my job. Fight it or enjoy rest of my life not behind bars?",
    "text": "While hauling during another typical day, a lady randomly walks across I-95. Couldn't stop in time and no where to veer off. Told to fight it but already enjoying having a personal life again... Be safe out there guys, it could all end in a blink of an eye!",
    "score": 1905,
    "url": "https://reddit.com/r/Truckers/comments/1lxo8a0/lost_my_job_fight_it_or_enjoy_rest_of_my_life_not/",
    "created_at": "2025-07-12T01:31:16.000Z",
    "num_comments": 714
  },
  {
    "id": "reddit-1n72eot",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Recruiter for CR england left me stranded in Salt lake City",
    "text": "so they bussed me here from Denver , Colorado. I'm supposed to be going to orentation tomorrow. I've been here 30 minutes calling every 10 minutes with no answer. He told me he was gonna. why my a lyft and he left me here. The sun is setting and i'm frustrated and already regretting my choice. I already have my CDL but no experience and i'm supposed to start a refresher course tomorrow. Not sure what to do at this point. i'm just here stuck. ",
    "score": 1611,
    "url": "https://reddit.com/r/Truckers/comments/1n72eot/recruiter_for_cr_england_left_me_stranded_in_salt/",
    "created_at": "2025-09-03T01:59:42.000Z",
    "num_comments": 340
  },
  {
    "id": "reddit-1jctzaa",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Arkansas is apparently stopping drivers to test their competentcy with the English language.",
    "text": "English Checks Have Begun in Arkansas.\n\n- They’re stopping ALL drivers\n- Everyone is handed a piece of paper\n- They must read it out loud\n- They must also write what they’re told to write\n\n“I was actually witnessing people in handcuffs that had been pulled in. I was like, what's going on? He goes, we've come across now that if you cannot read or write in English, that it's a $5,000 fine.\n\nAnd if you have a company in Arkansas that employs people that can't read or write in English, it's a $10,000 fine paid on the spot.\n\nIf you cannot pay it, you're automatically arrested and lose your license”\n\nWe need this in EVERY \n\n@WallStreetApes\n\n\n\n(Note: CDL holders must be able to read and write in English)\nstate!!https://www.ecfr.gov/current/title-49/subtitle-B/chapter-III/subchapter-B/part-391/subpart-B/section-391.11\n\n",
    "score": 976,
    "url": "https://reddit.com/r/Truckers/comments/1jctzaa/arkansas_is_apparently_stopping_drivers_to_test/",
    "created_at": "2025-03-16T19:48:24.000Z",
    "num_comments": 552
  },
  {
    "id": "reddit-1iby0sj",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Thank you drivers of reddit",
    "text": "Just wanted to thank this thread and drivers that gave their input about this industry. Before i got my license i researched the best route to go. I ended up doing food service straight out of CDL school, grinded that out for 15 months and finally got hired doing my goal position which is fuel. Without the information posted on this group i wouldn't be where i am today. So for thank you and stay safe!",
    "score": 821,
    "url": "https://reddit.com/r/Truckers/comments/1iby0sj/thank_you_drivers_of_reddit/",
    "created_at": "2025-01-28T09:43:29.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1hvq45p",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Most surreal moment of my career.",
    "text": "Have you ever had a moment while driving that just felt like an absolute fever dream?\n\nI just did tonight.\n\nDrunk dude blew a stop sign, ran straight into the side of my DOT bumper as I was passing.\n\nI watched in my side mirror as he ripped most of the front end off his vehicle, and while I was pulling over just drove off into the darkness.\n\nI go back to check on him and he’s gone, but employees of the store that it happened by are outside picking up debris off the road and a witness pulls over to corroborate my story to the cops.\n\nBefore the cops showed up the driver of the car stumbles up out of nowhere complaining that I just totaled his vehicle.  We are all asking if he’s okay but could tell something was off.  Cops show up shortly after he did.\n\nOne takes me aside to get my info/story while the other goes with the drunk dude.  As the officer is checking over my registration he looks up and says “oh shit, they’re fighting!” And runs off.\n\nThe drunk dude had starting brawling with the other officer.  As I look up the drunk guy is down the road a bit from where we just were and being taken to the ground.\n\nShortly after what I can only assume the whole towns department rolls up and I knew my night had just gotten that much longer already.\n\nHad to fill out a witness statement form and wait another hour as they finished the reports before being cut loose.  I still have no clue where he ditched his vehicle at.\n\n\nTLDR:  Drunk guy blows stop sign, uses my DOT bumper to remove the front end of his car.  drunk guy flees scene, returns on foot, and shortly after cops arrive starts fighting them.\n\nI was basically pinching myself the whole time trying to see if I was dreaming.\n\nAnyone else have any crazy stories?\n\n",
    "score": 804,
    "url": "https://reddit.com/r/Truckers/comments/1hvq45p/most_surreal_moment_of_my_career/",
    "created_at": "2025-01-07T12:14:51.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1n76h53",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "PSA for Non-Reefers",
    "text": "Please stop shutting off our refrigerator when you think we’re asleep. I have a very loud alarm that I transfer trailer to trailer for events like this. I wake up every time. \n\nAside that fact, we carry expensive food products, chemicals, and so on. Sometimes those chemicals are refrigerated to keep them from destroying the parking lot due to their corrosive behaviors, some are unstable and may be more than a melted trailer. \n\nYes, the engine is louder and more obnoxious than a typical idle. I try to park away from everyone, but that didn’t stop one of you at the Greater I-55 truck stop. By the way, you were on camera, the whole time. I watched you walk around your truck and turn off the trailer, which is in the least one felony considering this load is worth more than both of our trailers. \n\nStay safe out there, to the rest of the drivers out here.\n\nEdit: We handled things through his company and my own. He will be fired after his return, and the incident has already been added to his DAC report. Part of me feels a bit bad, because he is supposedly less than 3 months on the road. Officially ending his career before it had hardly started. Otherwise, don’t do anything stupid to others’ trucks or trailers. ",
    "score": 669,
    "url": "https://reddit.com/r/Truckers/comments/1n76h53/psa_for_nonreefers/",
    "created_at": "2025-09-03T05:31:16.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1jtnhjt",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Been waiting for the day I could post this! First gig, first rig!",
    "text": "Started CDL school in October 2024 doing night classes. Got my CDL in December. Just finished my first 4 weeks with a trainer! Time to go solo for 4 weeks before meeting my next trainer to do 4 weeks of west coast training. 2020 Cascadia.",
    "score": 577,
    "url": "https://reddit.com/r/Truckers/comments/1jtnhjt/been_waiting_for_the_day_i_could_post_this_first/",
    "created_at": "2025-04-07T15:05:57.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1jt0lc4",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Tablet gave me a weigh station bypass, still got pulled over and accused of \"running the scale\"",
    "text": "Title says it all, I drive for a mega, Drivewyze gave me the green bypass so I passed the weigh station, a couple miles down the road a state trooper pulls me over and says that they have had all bypass off for at least 45 minutes and that I ran the scale. I had an empty trailer and passed the level 3 inspection, but the trooper still gave me some sort of citation, I have had 0 infractions up to this point, been driving for 10 months and was looking to get to a year experience to shoot for a local job.\n\nHow do I fight this? My company said they are going to get I.T. to look at the issue this week, but if their records don't have the bypass logged, is it just my word against theirs? will this citation be an issue for my career moving forward? I am unsure what my next move is.\n\n  \nEDIT: I found the drivewyze log, says bypass, thank you all for the info on the logs, now I am going to see how to clear my name so to speak lol.",
    "score": 453,
    "url": "https://reddit.com/r/Truckers/comments/1jt0lc4/tablet_gave_me_a_weigh_station_bypass_still_got/",
    "created_at": "2025-04-06T18:16:14.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1pginyk",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "WHY DO SOME OF Y’ALL TURN THE TRUCK STOP CHECKOUT INTO A 30-MINUTE SIDE QUEST???",
    "text": "\nBro. I’m not trying to be dramatic but WHY is it ALWAYS one cashier at peak hours and WHY is the one person in front of me acting like they just unlocked a new questline in Skyrim???\n\nI just watched a grown man:\n\nForget his pump number\n\nWalk back outside to check\n\nCome back in\n\nDecide he actually wanted DEF\n\nThen remembered he also wanted to use points\n\nThen the card declined\n\nThen he switched cards\n\nThen asked about a receipt from LAST WEEK\n\n\nMeanwhile there’s 12 of us in line just trying to grab a coffee and a hot dog before our clock nukes our whole day.\n\nI swear some drivers hit the register like:\n“Yeah let me refuel three trucks, solve my loyalty rewards, negotiate peace in the Middle East, and maybe grab a roller dog while I’m at it.”\n\nAnd the cashier? SOLO. Just out here fighting for their life. No backup. No reinforcements. Just vibes and a barcode scanner.\n\nLike damn man — have your pump number ready, have your card ready, have your life together for 45 seconds. This is not the time for memory loss and financial planning.\n\nTruck stop checkout should be: ✅ Beep\n✅ Pay\n✅ Get out\n\nNot: ❌ Beep\n❌ Confusion\n❌ Side quest\n❌ Flashback episode\n❌ Manager called\n❌ Time dilation\n\nIf you take more than 90 seconds at the counter during rush hour, I’m mentally revoking your CDL. 😤\n\nEnd rant. I’m going back to my truck before I lose it over a taquito.\n\n\n",
    "score": 427,
    "url": "https://reddit.com/r/Truckers/comments/1pginyk/why_do_some_of_yall_turn_the_truck_stop_checkout/",
    "created_at": "2025-12-07T13:43:17.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1nbu60k",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Warning for the younger drivers",
    "text": "Don't make the same mistake I did.  Keep up with your health.  I was diagnosed diabetic in 2000, 4 years into my career.  I didn't take care of it for many years,  only dieting down just before physical time to keep my med card.  Now,  at 50 years old,  I've developed 3 complications of diabetes that are career enders. Take your health seriously.  There are ways to be healthy in this job,  it just might not be as convenient.  It's more convenient than having to look your wife and kids in the eyes and tell them you have no idea what you're going to do now.  ",
    "score": 421,
    "url": "https://reddit.com/r/Truckers/comments/1nbu60k/warning_for_the_younger_drivers/",
    "created_at": "2025-09-08T17:32:03.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1nbzk13",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Being a trucker has been one of my worst decisions in life.",
    "text": "I just want to be clear on one thing, I am not hating on truckers nor am I trying to talk anyone out of obtaining their CDL and becoming one. This is just my personal experience that I feel like venting about. \n\nI am 29. I have been driving for 4 years now. When going to school it was an opportunity given to me by the company I work for. They paid for everything. Personally for me it was just my opportunity to make more money. I really had no interest in driving. \n\nThe route I was given has a very early AM start time. I go to bed pretty much mid day and wake up at night. This I thought I would get used to. 4 years in and it is still very hard to fall asleep. Especially in an apartment. Yet I am so tired all day, even when I’m home I’m just so tired that fighting a nap is grueling. Bed time is just hard. \n\nWith my route, just driving to my first destination and back is 8h. I often am doing 12-13h shifts. Leaving me little time after work to decompress and enjoy myself. And with the time I do have I am too tired to do anything social or active. And if I wasn’t too tired to be social I still can’t because all of my friends are working at this time. They don’t get off work until after I’ve gone to sleep. \n\nAt work, I can’t do anything besides drive. I try to listen to podcasts and music, however I listen to so much of the two I don’t even know what to listen to anymore. Music turns into just noise and podcasts get muted in my brain when I am focusing on the road. \n\nI feel alone, all the time. Maybe once a month I’ll go out camping with friends. But that’s about all the socialization I get besides sometimes hopping on video games when not otherwise busy. Every once in a blue moon I will go out on a date but remind myself how am I supposed to have the time and energy for a relationship when I hardly find time and energy for myself? \n\nI don’t even need to explain to you guys diet. It seems like one of the larger talking points here. I eat for convenience or don’t eat at all. I gain and lose weight all the time. Just depends on the months eating habits. But of course it’s mostly gain. Energy drinks and hot food at the gas stations. Not that I’ve ever actively eaten the healthiest to be honest. But I used to be quite active and weight was pretty steady for many years before. \n\nI never knew what depression was, until I about 4 years ago. That truck feels like a prison. I hate getting in that thing. It feels like every day I am kicking myself for choosing this. I feel like I can’t escape. I of course can, but easier said than done. Everything in this is a decision I’ve made and can make decisions to change it. I know this is all on me. But I feel so stuck mentally and physically. \n\nUpdate: Wow, I could not have expected this many replies. My post was not immediately accepted because of the account requirements of the sub. In all honesty, I was expecting a lot of negative comments from super truckers (few of you in here lol). It’s very nice to see so many who feel/have felt the same. And thank you everyone for the advice and kind words. \n\nThings I will reiterate and clear up:\n\nI FULLY acknowledge I put myself here and can get myself out. \n\nI do of course have goals. I want to own a house, get married some day, have children, retire at a decent age. But no I did not get my CDL with and entry and exit plan. I went with the flow for the money. And the money is quite literally double what I made before. Though this is mostly due to all the overtime. \n\nI am aware of the many opportunities in the CDL world. I just feel like driving as a whole is not for me, and if I leave then I want to do something else entirely. However life style inflation is real (again I am aware, this is a me problem). I am actively working on debloating my life financially and living more minimally. I do spend a lot of money on the small things I enjoy because I’ve been in a cycle of telling myself I deserve it. That being said I do have a savings account, but nothing to comfortably take a large pay cut at this moment. I am working towards being able to comfortably take a pay cut. \n\nI work for a small company who takes very good care of me. I am the top earner as far as drivers go. They do not ever hassle me and they’ve done me favors I will forever be grateful for. I do not feel I owe them my life, however it’s hard to leave something like this no matter how much the job itself pulls me under. \n\nI will make replies to comments later today. Thank you everyone. This is pushing me to do something better and take bigger steps to being more financially stable so that I can be happier. I am very grateful for all of you. I couldn’t have expected the positivity. ",
    "score": 396,
    "url": "https://reddit.com/r/Truckers/comments/1nbzk13/being_a_trucker_has_been_one_of_my_worst/",
    "created_at": "2025-09-08T20:53:30.000Z",
    "num_comments": 223
  },
  {
    "id": "reddit-1l2razx",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "CDL school blows my mind",
    "text": "I am going through this school for a major carrier. and they made us cram 30 chapters worth of material into 2.5 days. some very important material was glossed over with and when I tried to ask questions I was told to \"stop slowing the process down\" I genuinely feel like I haven't had nearly enough time to retain anything. \n\nOur instructor literally said \"we don't have time to slow down for slow learners here's the answer sheet\" \n\n\"The state requires we watch you take the tests but doesn't say anything about giving you the answers\" \n\nOn top of that! We still had roughly 30%! of the class fail the tests even after being given a cheat sheet? How is that even remotely possible \n\nThe range testing was an absolute joke. people got passed here that shouldn't have even been able to operate an electric scooter let alone and 80k lb missile\n\nI'm afraid to say what carrier this was for but I'm willing to bet most people here probably already know considering how swiftly they put us through \n\n ",
    "score": 370,
    "url": "https://reddit.com/r/Truckers/comments/1l2razx/cdl_school_blows_my_mind/",
    "created_at": "2025-06-03T23:53:57.000Z",
    "num_comments": 190
  },
  {
    "id": "reddit-1ipj583",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "I think I’m done",
    "text": "Woke up today and decided to turn in the keys. \nI made 531 bucks after 6 days of driving and 2k miles. I’m supposed to have a 1k guaranteed but naturally the companies always come up with some bs stipulation. For me it was be on the shit box ready from 12:01am Sunday night/Monday morning to Friday at 11:59pm if they route me home Friday and I go home at 3pm instead of sitting and waiting around til 11:59pm I don’t get my guaranteed 1k.  \n\nYea I probably picked the wrong company but after but after 6 years of driving I’m tired of this lifestyle. Living in a shit box 5-10 days making an average of 15 an hour and maybe a few weeks here and there making about 20 an hour. \n\nI know people say find the right company but I honestly don’t think there is one. It’s just how long can you survive and how willing are you going to let companies take advantage of you. Even when I was home daily I was making less and still working 14 or more hours a day. \n\nThere’s no life in this industry. I get that it’s a lifestyle and I managed it for 6 years, I get it’s a strange job hours/work wise, but it’s just cus the office side chooses to not to. \n\nI’m just so over the mental and physical stress this job/career has left me with. ",
    "score": 366,
    "url": "https://reddit.com/r/Truckers/comments/1ipj583/i_think_im_done/",
    "created_at": "2025-02-14T19:45:49.000Z",
    "num_comments": 298
  },
  {
    "id": "reddit-1m5bsxw",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Trainers, Stop Rushing Your Students",
    "text": "I’m at a Walmart and I noticed a young dude go from one door to the next. As I was backing into my door he stopped and stood there and when I got done backing he came up to me and asked me how I did it. Come to find out he’s been on his trainers truck for 2 weeks and the trainer is giving him shit for not knowing how to perfectly back yet. He said he has to pull up a few times and he’s not confident because he’s not getting enough backing opportunities and the trainer expects him to know how to do it because it’s been 2 weeks. We all learn at different paces and I’ve seen guys who’ve been out here for years that have trouble backing into spaces sometimes. This is a Walmart so you know there’s tons of space but imagine what’s gonna happen when he gets somewhere with limited space. This guy should be backing every time that truck needs to go in reverse and practicing at the end of every shift. I told him to get a new trainer. I hit 2 years yesterday and I remember how terrible my trainer was. Some stuff you learn as you go, backing being one of them but this is a dangerous job and the last thing a trainee needs is to feel as though they’re being rushed to learn how to handle the vehicle. We all started somewhere and trainers need to remember that when they have trainees careers in their hands. \n\nTLDR: Stop rushing your trainees and remember where you started. ",
    "score": 362,
    "url": "https://reddit.com/r/Truckers/comments/1m5bsxw/trainers_stop_rushing_your_students/",
    "created_at": "2025-07-21T06:46:48.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1lsodm1",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Do I have to be o/o to drive one of these rigs",
    "text": "I’m a month into driving otr with my cdl and man I never was into trucks like how I am now. Everytime I see these type of trucks on the road I start foaming and plus during my school training I practiced in a manual and I’m just not feeling these automatics man it’s just not as fun. Are they companies they have these trucks in there inventory or while I have to get my own ?",
    "score": 361,
    "url": "https://reddit.com/r/Truckers/comments/1lsodm1/do_i_have_to_be_oo_to_drive_one_of_these_rigs/",
    "created_at": "2025-07-06T00:32:19.000Z",
    "num_comments": 128
  },
  {
    "id": "reddit-1oxx34h",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Walmart Truckers, What's It Like Being the Pimps of the Trucking World?",
    "text": "Exactly what the title says. I've worked for Walmart in various positions and it was always eh.. Not a career position but not bad either. However, recently becoming an OTR trucker I found out trucking for Walmart is the end all be all lifer position making 100k or more a year. What's it like? Do y'all walk into the Loves in your furcoats and rhinestoned cowboy hats and just buy out all the hot wings? What're the $80 Lot Lizards like? No but, seriously, how is it? Because the only negative thing I've heard so far is slipseating.\n\nEdit: Im not breaking 50k where I am currently and have never made more than that. Anyone who makes more than 90k to me is a damn unicorn, okay lol the post was mostly satire. Thank to everyone who gave advice and dropped company names, though y'all are heroes, and me and mine appreciate ya.",
    "score": 352,
    "url": "https://reddit.com/r/Truckers/comments/1oxx34h/walmart_truckers_whats_it_like_being_the_pimps_of/",
    "created_at": "2025-11-15T17:10:59.000Z",
    "num_comments": 229
  },
  {
    "id": "reddit-1nzi8kr",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Do drivers that make $1,200 - $2,000 weekly, only do so because they work 70 or more hours a week?",
    "text": "I just blew $70 on a DOT physical and was preparing to get my CDL permit after 3 weeks of studying the manual. I started doing more research into trucking and read that the money comes from the excessive hours rather than the pay rate. What appears like $34/hr is more like 17/hr.\n\nI'm an idiot for not researching everything before blowing $70. Can anyone here convince me things aren't this bad? If not I'm searching for another career.",
    "score": 282,
    "url": "https://reddit.com/r/Truckers/comments/1nzi8kr/do_drivers_that_make_1200_2000_weekly_only_do_so/",
    "created_at": "2025-10-06T12:53:38.000Z",
    "num_comments": 475
  },
  {
    "id": "reddit-1oriml2",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Female trucker severely beaten by fellow driver in Pennsylvania road rage incident",
    "text": "Some of y’all need to take a chill pill, literally, or change your career path. If you’re a rager and can’t control your emotions please try find another occupation and more importantly, please seek therapy. ",
    "score": 278,
    "url": "https://reddit.com/r/Truckers/comments/1oriml2/female_trucker_severely_beaten_by_fellow_driver/",
    "created_at": "2025-11-08T06:48:55.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1mh0nf6",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Anyone leaving?",
    "text": "I just updated my resume and I am excited at the thought of leaving this industry after 4 years. I am HazMat Tanker and I feel like overall it just doesn't pay like it should. Waiting for a slot to open up at my friends place of work this month in the maintenance/energy sector. I'm tired of the road. Tired of being treated subhuman at shippers/receivers during idiot-box season. Tired of the lack of common sense and common courtesy. It's sad that professionalism in the industry has died hard. I'm looking forward to being home everyday and having a career with growth. Just wasn't sure if anyone else is in the process or was thinking about it. God speed to everyone sticking with it, I do appreciate your sacrifices. ",
    "score": 258,
    "url": "https://reddit.com/r/Truckers/comments/1mh0nf6/anyone_leaving/",
    "created_at": "2025-08-04T01:39:28.000Z",
    "num_comments": 183
  },
  {
    "id": "reddit-1pdxifm",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Don’t let pride hurt your career",
    "text": "I was delivering to CoreMark in Springfield, Ohio this morning. You have to wait until 5:50 am for them to open the gate.\n\nThere were three trucks waiting, I was the third. All three trucks maneuvered and parked in the tight lot. You go in and check in before getting a door.\n\nI made it to the door before the second driver. As I’m waiting to give the receiver my paperwork, the second driver says, “I was the second trailer, I’m next”. I said, “excuse me, what do you mean, you didn’t get to the door before me”? \n\nHe proceeds to cut in front of me and then gets told his appointment wasn’t until 10 am and to come back. Karma strikes in my favor. \n\nI’m 52, I’m not about to get into a fight or an argument with another grown man over something insignificant like this.\n\nEdit: no I didn’t rush to the entrance, no I didn’t see this guy behind me",
    "score": 257,
    "url": "https://reddit.com/r/Truckers/comments/1pdxifm/dont_let_pride_hurt_your_career/",
    "created_at": "2025-12-04T11:20:36.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1om0nb8",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Just a friendly tip from an experienced driver:",
    "text": "If its your first year running cross country, make sure you get proper footwear. The fuel islands and sidewalks will be hazardous, and you know these shippers/receivers aren't going out of their way to make your life easier by clearing ice off their pavement.\n\nIve slipped and fell a couple of times in my career and id rather you guys not live with the nagging tailbone and hip pain like I have. Get a good pair of hiking boots with slip resistant soles, and dont be afraid of wearing the shoe cleats/chains if its really bad out there. ",
    "score": 230,
    "url": "https://reddit.com/r/Truckers/comments/1om0nb8/just_a_friendly_tip_from_an_experienced_driver/",
    "created_at": "2025-11-01T22:14:06.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1ndw16m",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Damn...",
    "text": "So I logged into an old Gmail account from back before I started driving OTR. Back then, I had a regular 9-5 with a nice little weekly routine all mapped out on Google Calendar. I guess I never logged out, because suddenly I started getting notifications for stuff I would’ve been doing.\n\nStuff like:\n\n“Game night”\n“Dinner with the so-and-sos”\n“Date night”\n\nBro… nothing like being 1,200 miles from home and your phone casually reminds you that past-you was supposed to be eating wings with friends tonight.\n\nI don’t regret this career. But damn, that was an unexpected little gut punch.",
    "score": 222,
    "url": "https://reddit.com/r/Truckers/comments/1ndw16m/damn/",
    "created_at": "2025-09-11T01:25:57.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1oxtrst",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "messed up bad , how long will this affect me, am i able to get another job ?",
    "text": "hit a corner and broke a fire hydrant and reported it to my employer and called the police on myself. Wasn't sure what else to do, i'm 3 weeks in so i'm still a rookie , so i know i messed up. I just wanna know how this will affect me i didn't get a citation but they did make a report. I wanna know how long this will affect me and if i have a chance at getting another job right now i work for a training company (western express). I wanted to leave after 6 months to go someplace that pays better but now idk if that's going to be an option. I just wanna know what i have to look forward do and if i just messed up my trucking career before it even started for real. ",
    "score": 220,
    "url": "https://reddit.com/r/Truckers/comments/1oxtrst/messed_up_bad_how_long_will_this_affect_me_am_i/",
    "created_at": "2025-11-15T14:58:49.000Z",
    "num_comments": 133
  },
  {
    "id": "reddit-1m5stho",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Anyone dread they're stuck in this until the end?",
    "text": "Been talking with my brother and dad about switching to a more physical career to better take care of my health and also pay bills. Of course at 42, they think my personality and physical ability are too weak and trucking is where I'm doomed to stay. I feel there's no way to really retire from this and that lateral moves to different companies won't mean or change a thing.\n\n\nAs far as what I want to do in life, I don't have any answer for that either. Felt like I was too dumb for white collar work and too physically weak for heavy blue collar work.\n\n\nExistential dread as I get old. Yet I still see other much older drivers still plodding along out there like the 70s/80s never ended. Of course I don't identify with those old heads either. Don't care for alcohol or chasing women.\n\n\nFeels like I'm just on autopilot. Run the loads as best as I can and then go to sleep.",
    "score": 214,
    "url": "https://reddit.com/r/Truckers/comments/1m5stho/anyone_dread_theyre_stuck_in_this_until_the_end/",
    "created_at": "2025-07-21T19:42:42.000Z",
    "num_comments": 378
  },
  {
    "id": "reddit-1ki1e7k",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Drivers - buy a dash cam today. No more procrastination. Do it on your reset. Do it on your 30 minute break. Do it on home time. Just buy one. They are pretty cheap. Even if your company has a cam installed, buy a personal one anyway. It will save your ass, your job, and even your career.",
    "text": "Buying your own will allow you to access the footage without going through the BS your company or the authorities might put you through.  How many times have you seen 4-wheelers or other trucks make dumb-ass maneuvers that cause you to break hard, swerve, or hit another vehicle only to see it was not your fault?  Without the dash cam, you would have zero evidence to back up your innocence.",
    "score": 192,
    "url": "https://reddit.com/r/Truckers/comments/1ki1e7k/drivers_buy_a_dash_cam_today_no_more/",
    "created_at": "2025-05-08T21:12:07.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1pmwyte",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Walmart driver end of the year pay…",
    "text": "Hey drivers. Figured I’d post my salary for this year and maybe hope answer some questions for people googling Walmart drivers. I’m on 5/2 5/3 schedule (5 days on 2 days off 5 days on 3 days off) I work in the North East out of a grocery dc. I’ve been at Walmart for 2 years now and I really like it. Being on a 5/2 5/3 schedule means I work less than other drivers \n\n(example 5/2 schedule I would work 2 days less a month than them but I have off 2 extra days which is really nice but I can’t extend a day a week which usually gives a bonus of at least 175 dollars in my area since I share 2 trucks with 2 other drivers.)\n\nSome of you may ask how slip seating is and I don’t have an issue with it. We keep the truck very clean and we use the microwaves, phone holders, etc that we all bought and have no issues. \n\nI want to say a couple things about this years pay. I had off for 6 weeks for my sons birth and was making 1000 less a pay check. (Walmart gives this time off as parental leave fully paid based on your average day pay ADP and my ADP was a lot less then.) The final thing I want to say is if I was on a 5/2 schedule I can expect realistically to make an extra $10,000 without extending.  That being said it all depends on the individual drivers work ethic. \n\nI really hope this may have helped someone googling out there.",
    "score": 135,
    "url": "https://reddit.com/r/Truckers/comments/1pmwyte/walmart_driver_end_of_the_year_pay/",
    "created_at": "2025-12-15T03:11:54.000Z",
    "num_comments": 107
  },
  {
    "id": "reddit-1ph65h6",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Does anyone feel like there’s a lot of delusion when it comes to what truckers are paid? Along with the industry being overrated?",
    "text": "I’m not just talking about recruiters or job ads exaggerating pay, that part’s obvious. I mean the public perception and even what people in the industry tell each other. There’s this narrative that everyone breaks six figures after a few years, but based on the folks I’ve met and the discussions in this sub, very few actually hit that number.\n\nAccording to the Bureau of Labor Statistics, the median salary is around $57k, which honestly feels low, but still gives a better picture than the hype. I made about $70k my first year, but that was doing flatbed, which definitely pays more than van/reefer. Even now, I’m on a dedicated drop-and-hook account at 70¢ per mile running Portland to Boise/Sacramento, and I average roughly $1,500 a week before tax, about $78k a year. I don’t see many positions with earning potential much higher than that, especially not for dedicated work that’s drop-and-hook.\n\nIt seems like a lot of the bigger money is in local work. Being an owner-operator can obviously be big money too. Not complaining, just an observation. There’s a ton of misconceptions and way too much hype about this line of work. That hype is a whole different rabbit hole too. I enjoy what I do for the most part, but yeah… it’s definitely overrated compared to how people talk about it. Especially in regards to people making the switch from white collar jobs (not that I’ve ever had a white collar job though). \n\nKinda second guessing my career choice a bit too as I’m sure we all day at some point lol but I certainly could just be thinking the grass is greener on the other side of the pasture. \n",
    "score": 69,
    "url": "https://reddit.com/r/Truckers/comments/1ph65h6/does_anyone_feel_like_theres_a_lot_of_delusion/",
    "created_at": "2025-12-08T07:15:26.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1mab5n8",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "After 5 Long Years, It's Finally Gone",
    "text": "Way back in 2020, I thought I could be slick and get away with smoking with my friends off the clock of my cushy local job. Never before or at work and only at home as my way to relax and unwind after a long day. I didn't drink or do anything else so in my mind I figured as long as long as I never got hurt or hurt somebody or got in an accident I would be fine. Wishful thinking of a young idiot, I know. When it came time that I needed to find new employment, due to no longer being able to tolerate my management and some of my co-workers, I promptly quit smoking for a good 2 months, took OTC drug tests until they came back clean, and started putting in applications. I thought I was good to go. Little did I know, however, thay the tests you take from DOT are a lot more sensitive than the ones you can buy at a store. They popped me with 0.18 micrograms of THC still left in my system after 10 weeks of being clean. I later found that the tests I was buying for myself only showed positive down to 0.5 micrograms, whereas the DOT tests can detect down to 0.15, and I'd screwed myself. I'd already quit my other job, not that they'd take me back, and now I've not only lost my CDL but the new job I was depending on making a smooth transition into as well. Needless to say it was a very rough self-inflicted period of my life.\n\nI had to pay over $1,000 for a SAP (Substance Abuse Professional) and take about 15 hours of classes to reinstate my CDL, followed by almost 3 years of regular drug testing that I also had to pay for while being observed by the doctor for every single one of them. I also became borderline unhirable despite over half a decade of experience, despite having a squeaky clean record aside from this drug violation. The only jobs I could get have been OTR jobs with small companies that've run me to death because they know I can't go just anywhere. Forced dispatch on some of the worst loads you could ever imagine. Paying me far less than what I'm worth at my experience level. Pressuring me to run past my clocks or use multiple log books when I don't want to (I've stood my ground on this twice before and have lost jobs because of it). Just truly terrible awful awful management. The company I'm with now has been a godsend compared to the guys I drove for in my first 3 years after the violation. They treat me well and i feel respected enough, but still, I hate being OTR and it's been miserable knowing I live in a city where local work is abundant that pays equal or more than my salary but no company would touch me with a 10ft pole, and rightly so. It's been rough, and it's entirely on me.\n\n\nWell, as of today, those 5 years of hell come to an end. My record finally stands clean and I'm free to start applying to jobs that keep me home and come off the road for good, and I couldn't be happier. \n\nI wanted to share this story as a cautionary tale for those career drivers that try to skirt the system. That think they won't get caught. Believe me, my friend, it will catch up to you and you will pay for it. FMCSA and the insurance companies take these drug violations extremely seriously and if you want to be in this industry then I'm sorry but you HAVE to stay clean. If you can't do that, then you're probably better off in some other field. \n\nI've already put in 10+ applications for local jobs in my area and I really can't put into words just how relieved I feel to be getting out of this truck soon. Thank you all for letting me share my story and my excitement with you as I put my past and stupid mistakes behind me and look forward to a brighter future for myself and my family. ",
    "score": 29,
    "url": "https://reddit.com/r/Truckers/comments/1mab5n8/after_5_long_years_its_finally_gone/",
    "created_at": "2025-07-27T02:32:47.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1p6q4wd",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Werner or J.B hunt?",
    "text": "Hey all, I am a crossroad I got an offer from werner to be on a Home Depot local account with an average salary of 53,000 a year. I worked werner before as OTR driver and they weren’t terrible left on goof terms, but I don’t know much about their Home Depot account. All I know is it’s night shift M-F from 5pm to 2-3am. Now J.B. hunt offered me a local account as well with a salary of 62,000 a year their shift is also M-F only working the 3rd Saturday of every month and their shift time is 2pm to 1am. I don’t know much about J.B. hunt but I don’t know which is better? Anyone got any experience in those or advice?",
    "score": 25,
    "url": "https://reddit.com/r/Truckers/comments/1p6q4wd/werner_or_jb_hunt/",
    "created_at": "2025-11-25T22:09:25.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1meey4x",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Let me know what you think",
    "text": "60x11=660 assuming you're making 60cpm that's $396 a day. (You can only drive 11 hours a day) \nNow let's take hourly\n35 an hour times 11 is 385 \nIf you're an OTR truck driver you're driving around 11 hours a day with truck load freight you're making 2772 a week. If you are hourly you'll be making 3,342 (because overtime) \nin my opinion cents per mile is a scam. us truckers don't get paid fairly. We do work a lot for free. Filling up gas? Free. Pre trip inspection? Free. Literally not driving? Free. It's a scam. It's basically the equivalent to being salary except way more unpredictable. You laugh at your boss when they ask you to be salary but you'll happily accept CPM. If they made truckers hourly we'd have much more income especially with on duty time. Because we can work up to 14 hours a day. It's fucked up how we're treated and we deserve better. They keep us at CPM because they don't want to pay us OT. they're literally taking advantage of us and you scoff and laugh at people who think otherwise. AND we don't get to be home to see our kids grow, see our girlfriends, wife's, family. You name it and we aren't there for it. It's just a mega scam. I went through a trucking school and I plan to finish and honor this year contract but immediately after I'll be switching to an hourly trucking job that doesn't and can't take advantage of my pay and I'll be home too.\n(Yes I know some companies may offer more or less CPM/hourly. And I know some companies pay a flat docking rate and may offer some incentives/bonuses but so do some hourly jobs too.) This is all in general ",
    "score": 16,
    "url": "https://reddit.com/r/Truckers/comments/1meey4x/let_me_know_what_you_think/",
    "created_at": "2025-07-31T22:03:58.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1mueu5y",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Need help convincing the wife this is a good idea.",
    "text": "I'm an experienced driver. I for 7 years OTR. I've been local for the last 12. \n\nA buddy of mine offered me a job. And I'm highly interested but need to talk to the wife. \n\nDetails as follows: \n\nPay - $450 per day. \nDouble pay if drive more than 450 miles a a day. Triple if more than 600 miles. \n\n$100 to get vehicle washed. \n\n$50 per diem and stay in hotels nightly. \n\nHis checks are $2600-4200 weekly. This is all W2 employment. I've known him 7 out 8 years and have 100% trust in him. \n\nThe down side, it's typically long time out. He left in June and won't be back until late October. \n\nThe next part is May 2026 to September 2026. \n\nMy relationship is solid, we have a home together and two cats. I'm making it with my current job.  I don't have a ton of money but I'm stable. \n\nThis new job, I can make my yearly salary in 4 months and then take another job in the off season. \n\nShe's worried about stability, and being gone for that long. I brought it up yesterday and she didn't shut it down immediately, instead saying if it's what I want. \n\nSo I'm looking forward to hearing stories from seasoned drivers, wives, etc  I need to make sure my relationship doesnt fall apart. That's a priority. ",
    "score": 14,
    "url": "https://reddit.com/r/Truckers/comments/1mueu5y/need_help_convincing_the_wife_this_is_a_good_idea/",
    "created_at": "2025-08-19T10:41:12.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1ieaf12",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Can any of you CRST road warriors attest to this?",
    "text": "Looking to increase earning potential after I finish my rookie year (licensed last month). Is there a catch to these salaries? Thanks bros and broettes and stay safe out there!😎 ",
    "score": 14,
    "url": "https://reddit.com/r/Truckers/comments/1ieaf12/can_any_of_you_crst_road_warriors_attest_to_this/",
    "created_at": "2025-01-31T08:35:38.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1l7354c",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Sometimes you have to pull the trigger first",
    "text": "A company will try and convince you to stay but it’s only a distraction for them to find a replacement. They will terminate you and boy is it hard to explain that when you’re looking for work. My advice if things seem a little sketchy like for example: poor employee retention and contractors getting more work it’s time to leave. Especially if you make a big check and your boss says “you broke the bank” but yet he has the money to pay double for the contractors coming there? It’s probably time to start looking elsewhere. He doesn’t care about his drivers and it’s another reason why most people quit at my company. They want you to work for nothing just to satisfy their finances especially if it’s a small company I can guarantee every family member in that office is on a fixed salary.  ",
    "score": 11,
    "url": "https://reddit.com/r/Truckers/comments/1l7354c/sometimes_you_have_to_pull_the_trigger_first/",
    "created_at": "2025-06-09T12:10:36.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1hp25vc",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Ytd pay",
    "text": "Just finished my 2nd year driving.  Home weekly and salary.bonus every quarter. Would be more if I had started at the 1st of the year but I started 24 Jan. ",
    "score": 10,
    "url": "https://reddit.com/r/Truckers/comments/1hp25vc/ytd_pay/",
    "created_at": "2024-12-29T18:23:26.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1p4onus",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Da Fuck?",
    "text": "I got this Email through Indeed.  My filter for job searches was minimum $30 an hour.  Is this company on crack?  .50 for reefer work?  Home Bi-weekly?  Holy hell.",
    "score": 8,
    "url": "https://reddit.com/r/Truckers/comments/1p4onus/da_fuck/",
    "created_at": "2025-11-23T14:55:43.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1ovd4mx",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Car hauling with carvana",
    "text": "So I’m basically doing side quests now in an attempt to complete my bucket list for trucking. \n\nI’ve done van, tanker, livestock, flatbed, end dump, 13 axle heavy haul, and currently a CDL instructor.\n\nI’ve always wanted to be able to check car hauling off the list. Carvana is setting me up with an interview. I’ve tried to research them but most of the reviews are old from when the drivers made salary and 4 day weeks and as far as I know, they did away with that. Does anybody work there now that can provide feedback?\n\nOr should I look into other companies such is United Roads or USAL?",
    "score": 7,
    "url": "https://reddit.com/r/Truckers/comments/1ovd4mx/car_hauling_with_carvana/",
    "created_at": "2025-11-12T18:26:47.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1lh7uc3",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "Would You Rather",
    "text": "Flatbed driver work... self loading and some tarping...\n\nWould you rather get paid a 7-10K$ and drive a sleeper cab and stay in twuck 24/7 20days a cycle OR would you rather get paid 7-10K$ less and get 150$/day per diem for hotel/food (as a car hauler) lifestyle???? Lets say that magic number is 55k$ salary.... so one way is 52-57 and the other way is about 47-50 BUT with the hotels and food daily and clearly more hometime",
    "score": 5,
    "url": "https://reddit.com/r/Truckers/comments/1lh7uc3/would_you_rather/",
    "created_at": "2025-06-21T21:52:42.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1k852ls",
    "subreddit": "Truckers",
    "soc_codes": [
      "53-3032"
    ],
    "title": "New guy getting conflicting messages the more I research",
    "text": "Hello everyone, new to the sub, and new to the industry.\n\nI'm currently doing my OTR training for Werner, I lucked out and got a pretty cool trainer doing the Dollar General route around Texas/OK/Arkansas.\n\nOnce I'm done training I'll be starting the Dollar Tree Western Flex account. I'll be getting hourly pay, CPM, and a modest trailer unload rate. These all combined, they told me my weekly pay would be about 1500 pre-tax, for a yearly salary of about 77k (pre-tax).\n\nNow I'm not naive enough to believe them and understand that it will likely be in 68k range as that's the scale they advertised for the job when I took it (68-77k).\n\nMy question is, after doing a lot of reddit searching, I'm seeing tons of people talking about \"fuck trucking they lie and you'll really be making 700-800 a week\" and it's got me a little nervous. This is a major lifestyle change and if that's the \"actual pay\" then I'm not sure how sustainable this will be. I've got a kid to take care of. So is that really what I can expect on the Dollar Tree account, western flex? 800 a week? I'm getting 750 a week just for training so it's hard to believe that I'd only be making $50 more per week once the real work starts.",
    "score": 5,
    "url": "https://reddit.com/r/Truckers/comments/1k852ls/new_guy_getting_conflicting_messages_the_more_i/",
    "created_at": "2025-04-26T04:57:05.000Z",
    "num_comments": 46
  }
]