[
  {
    "id": "reddit-1n29s7z",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Hospital finally confirmed what’s been making us sick… and it was my dishwasher 🤢",
    "text": "I literally get sick just writing this down.\n\nMy 7yo and 5yo have been struggling with this weird persistent stomach bug for months now. At first, I simply wrote it off as \"school germs.\" But then my mom (who comes over on a regular basis) was sent to urgent care after a weekend visit here, and even I started to feel funny.\n\nWe finally went to the hospital last week and the doctor straight-up asked if we’d checked our dishwasher. Apparently, dishwashers are prime breeding grounds for mold, fungus, and bacteria and yes, that could absolutely cause recurring stomach issues.\n\nI went home, grabbed a flashlight, opened the filter and rubber gaskets, and my stomach turned. Mold all over. That stinky smell I had been in denial about suddenly made sick sense. I feel conned by my own \"favorite appliance\" I thought I could rely on to keep my family safe.\n\nSo here I am desperate:\n???? What is the best cleaner (store bought or natural) to nuke this stuff?\n???? Is baking soda/vinegar actually strong enough, or do I need something medical-grade?\n???? Do you have any advice on how to make it never get this bad again?\n\nMountain-high piles of dishes every day are not humanly possible for me, and I can't afford to have my kids or parents fall ill from my kitchen again.\n\nDid anyone else go through the same? What worked for you?",
    "score": 16477,
    "url": "https://reddit.com/r/Appliances/comments/1n29s7z/hospital_finally_confirmed_whats_been_making_us/",
    "created_at": "2025-08-28T11:34:26.000Z",
    "num_comments": 2254
  },
  {
    "id": "reddit-1no89k6",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Are there no decent refrigerators left in this cruel world?",
    "text": "Yes I’m being dramatic…but also I’m so lost on what refrigerator to purchase! Obviously everything will have some bad reviews. \n\nTLDR: We have 2 refrigerators. Our main fridge broke recently. The other one is very basic bottom of the line, pretty small, works but we need filtered water and an ice maker. Need help or advice finding a new one! \n\n\nThis is the situation: \n\nWe’ve had our French door, water dispenser on the outside, whirlpool fridge for about 5.5 years. Now it won’t stop beeping and whatever the issue, I hear they only last 5-7 years anyways. Thankfully we have a backup fridge that is basic and usually holds drinks. Right now it’s holding everything and hanging in there. \n\nWe want to buy a new fridge that has a water dispenser and an ice maker. My dream fridge would be the GE cafe or Bosch 800 series. Those sadly are out of budget right now. My lowest that I kind of liked was two Hisense fridge that are ~$1500. That’s a better price point, but I keep seeing nightmare customer service stories and someone’s whole door fell off. The in between I liked was the GE profile, but saw a couple reviews of the pitcher leaking or overflowing. I really liked this one but it’s about $2600 and I’d really like to be under that. My worry is if I go with the cheaper, it might be “you get what you pay for” situation. Does anyone have any advice or actually own the fridges in the pictures?? I’d love to hear your experiences with whichever fridge you have (the good, the bad, the ugly). TIA!! ",
    "score": 2567,
    "url": "https://reddit.com/r/Appliances/comments/1no89k6/are_there_no_decent_refrigerators_left_in_this/",
    "created_at": "2025-09-23T04:41:15.000Z",
    "num_comments": 1030
  },
  {
    "id": "reddit-1ncsue5",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "UPDATE: Why is my dishwasher so splotchy and brown?",
    "text": "Original post: https://www.reddit.com/r/Appliances/comments/1naa4ji/why_is_my_dishwasher_so_splotchy_and_brown/\n\nIt's both amusing and embarrassing that my splotchy dishwasher got so much traction 😭. Thank you all who gave me helpful tips, and a laugh. Definitely kind of gross, but I swear it wasn't mold!\n\nAdmittedly though, I got a bit overwhelmed by all the responses that I just hopped in my car, went to the nearest grocery store, and bought some big box dishwasher cleaner pods. The top ingredient was critic acid, which gave me hope for those who said you need something acidic to combat hard water (which was definitely at least part of the problem). I popped it in on an empty dishwasher and waited...\n\nYOU GUYS. I WAS NOT READY FOR THE INSANE BEFORE AND AFTER. I swear these photos are real, no I did not go out to get a new dishwasher lol. The stains and hard water build up came off in a SINGLE wash. Even the baskets got all cleaned up without scrubbing. My jaw dropped to the floor when I opened it. These photos are literally from when I opened it. Citric acid is the lifesaver!\n\nCrazy!\n\nEdit: People get upset when I mention a brand, people get upset when I don't! Lol. So I used the Cascade platinum dishwasher cleaner on an empty cycle once.\nNow, I'm trying to use up the rest of my normal plant based dishwashing pods along with a tablespoon of citric acid in the pre-wash. Seems to be holding up very well!\n\nPeople get obsessed with knowing what brand or product to buy, but it's important to me (teacher lol) that we are critical thinkers and discover what ingredient(s) help rather than the brand. I had hard water, and something acidic broke down the build up, which is why the cleaner (which primarily was citric acid) worked.\n\nHappy cleaning everyone ✨",
    "score": 2347,
    "url": "https://reddit.com/r/Appliances/comments/1ncsue5/update_why_is_my_dishwasher_so_splotchy_and_brown/",
    "created_at": "2025-09-09T19:40:38.000Z",
    "num_comments": 141
  },
  {
    "id": "reddit-1nln6f2",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "LG washer door acting like it’s about to fly off",
    "text": "My washer was fine like 2 wks ago and all of a sudden the door has started making this really loud banging sound and looks as if it’s gonna come unlatched and spew soap everywhere. I haven’t moved the washer, and I never have super heavy loads or anything in it. The load in the video is literally just some sheets and nothing on top or touching the washer besides the floor. I live in an apartment with maintenance, so there’s kind of a limit to what I can do. I just wanna know if this is smth serious to call maintenance or if it’s just a tightening the screw sort of thing. Any help would be appreciated!! ",
    "score": 1469,
    "url": "https://reddit.com/r/Appliances/comments/1nln6f2/lg_washer_door_acting_like_its_about_to_fly_off/",
    "created_at": "2025-09-20T03:02:37.000Z",
    "num_comments": 311
  },
  {
    "id": "reddit-1mbdw2m",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Never buying a KitchenAid dishwasher again.",
    "text": "I bought a house with a new KitchenAid dishwasher and the thing has been the worst appliance I have ever dealt with.  Currently working on convincing my wife to go with Bosch.  Any other recommendations?",
    "score": 1453,
    "url": "https://reddit.com/r/Appliances/comments/1mbdw2m/never_buying_a_kitchenaid_dishwasher_again/",
    "created_at": "2025-07-28T11:41:47.000Z",
    "num_comments": 386
  },
  {
    "id": "reddit-1npinn0",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "I have made the best purchase of my life.",
    "text": "I looked it up, dishwashers are appliances, do counter-top dishwashers count for this subreddit? I hope so.\n\nMy aunt recommended this to me, and my god, I haven't had a full set of clean dishes in months. I always just rewashed the same cutlery/plates over and over because of work, college (I'm 19) and I'm lazy.\n\nGod, I sound so much like my dad it's crazy.\n\n(I've never owned/saw any type of dishwasher before in my life, in person, until this point.)",
    "score": 1391,
    "url": "https://reddit.com/r/Appliances/comments/1npinn0/i_have_made_the_best_purchase_of_my_life/",
    "created_at": "2025-09-24T17:38:27.000Z",
    "num_comments": 158
  },
  {
    "id": "reddit-1m12iif",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Never buy Samsung appliances. Ever. NO MATTER HOW GOOD THE DEAL IS.",
    "text": "In 2020 I bought a full set of brand new Samsung appliances for my condo. It wasn’t my first choice, but the delivery for the first set I purchased kept getting delayed because of the pandemic, and eventually I got so fed up (I was using a mini fridge and cooking my kids’ dinners with a camping stove) that I said “fuck it” and asked Home Depot what they could deliver by the end of the week. Samsung was my only option. My mom warned me about Samsung and said I should wait, but I didn’t listen. The only appliance I haven’t had issues with is the dryer. \n\nThe washer motor randomly broke during a spin cycle last month and the appliance guy said it was beyond repair. Unfortunately they no longer make a washer that is stackable with that dryer model, so I had to buy a whole new set. (Went with GE this time.) \n\nEvery time there is a water shut-off in our condo, the dishwasher stops working. All the lights blink like crazy and it keeps trying to drain noisily for days even though there is no water inside, and it will not run a cycle. The last few times this happened it eventually went back to normal after a few days, but it’s been almost a week and it seems like I’m going to need a new dishwasher now too.\n\nThe ice maker on the refrigerator stopped working the second time I changed the water filter. Samsung was able to honor the warranty and said they couldn’t fix it so they just paid me back for the fridge, but like…seriously? This happened a year after purchase. \n\nAll of the knobs on my oven cracked and broke off after about two years. Getting the real deal replacements was prohibitively expensive (like $75 per knob) so we bought some knock offs that don’t reflect the dual burner feature. \n\nThe amount of time, money, and stress that I have spent on these stupid appliances enrages me. I’ll never purchase another Samsung ANYTHING as long as I live. ",
    "score": 1251,
    "url": "https://reddit.com/r/Appliances/comments/1m12iif/never_buy_samsung_appliances_ever_no_matter_how/",
    "created_at": "2025-07-16T03:41:49.000Z",
    "num_comments": 320
  },
  {
    "id": "reddit-1pps1v7",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "You pay a premium for less gadgetry, but it's worth it.",
    "text": "I replaced a 10-year-old Samsung gas range for several reasons, including gimmicky features and settings that never made sense and often got in the way of basic cooking tasks. So I searched for a nice range with limited technology. I landed on a Wolf GR304, which was installed this week. It's fantastic in so many ways, but it fascinates me how feature-free it is. Not even a clock or timer. If you want less technology in a range, you have to go either really cheap, or really expensive. ",
    "score": 1148,
    "url": "https://reddit.com/r/Appliances/comments/1pps1v7/you_pay_a_premium_for_less_gadgetry_but_its_worth/",
    "created_at": "2025-12-18T14:23:16.000Z",
    "num_comments": 262
  },
  {
    "id": "reddit-1pjzbqz",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Help with dating a refrigerator",
    "text": "Hello!\n\nI hope it is okay to post this here and if not maybe yall can figure out where is best. \n\nMy husband and I are proud owners of this market place garage fridge and I’ve been attempting to find out how old it is. We bought it this past summer and it works great! \n\nI looked up the serial number and I believe it’s from 1988 but can anyone certify that for me?? Thanks guys and gals!",
    "score": 972,
    "url": "https://reddit.com/r/Appliances/comments/1pjzbqz/help_with_dating_a_refrigerator/",
    "created_at": "2025-12-11T14:48:14.000Z",
    "num_comments": 676
  },
  {
    "id": "reddit-1kiwm7c",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "I've now joined the never buying another Samsung Appliance Club.",
    "text": "Recently bought a new Samsung refrigerator after Lowe's gave us a credit after our older Samsung fridge about 5-6 years (rare for them to last that long from what I'm told) old finally started having issues. \n\nNeedless to say this is the worst customer service experience I have ever had. Here's what happened. \n\nOur new Samsung refrigerator came and the one that was ordered was the 32 cu ft 3-door French door refrigerator. All was well and everything was installed. However after a 24 hours I noticed the ice maker wasn't working like it was supposed to. While yes this may seem minor to some people but for me when almost (since the Lowe's credit was used) paying full price for something I expect everything to work properly. I called Samsung and let them know about the issue. Since this was a day one issue it was well within the manufacturer warranty. \n\nA full month goes by and I would say probably 10 or 11 technicians have came by to replace parts that have already been replaced by them. At this point I'm getting frustrated even me making repeated calls telling Samsung the issue is not getting fixed and I need a replacement now! Even at this point the technicians are frustrated. One even telling Samsung that the fridge is not repairable (almost yelling at them). One technician even let me know that they actually don't get paid until something actually gets fixed. So these technicians repeatedly coming to my house just to not get paid is understandable to why they are frustrated as well. Finally after about a month and 10 days. Samsung finally gave in and gave me a credit to buy something off of their website. I did that yesterday and today was delivery day. \n\nAnd guess what...\n\nThey deliver the wrong fridge. Same type of model but not even the right size. At this point I refused delivery. I sighed pretty hard once I saw that fridge come off the truck and noticed that it wasn't even the right size. \n\nAt this point I'm pretty certain that I will not buy any more Samsung appliances from here on out.\n\n(1st picture: older fridge that is having ice maker issues and is actually the right size)\n\n(2nd picture: wrong size fridge outside after it came off the truck)",
    "score": 813,
    "url": "https://reddit.com/r/Appliances/comments/1kiwm7c/ive_now_joined_the_never_buying_another_samsung/",
    "created_at": "2025-05-09T23:39:00.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1nqb4wz",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Roach in the screen of my oven clock… am I screwed?",
    "text": "For reference, I live in an apartment complex that is supposed to be “Luxury”, according to them. The complex itself was built probably 10 years or less ago, so fairly new. They do regular pest control once every like 6 months where they come in and spray chemicals around our unit and building to deter pests. But, I woke up this morning and to my surprise, noticed a roach moving around behind the screen of my oven clock! I am a very clean and tidy person, I don’t leave dishes in the sink for longer than a day, I sweep and vacuum 1-2x a week and wipe down my counters and appliances almost daily. \n\nI did some research and found people saying that the entire stove is likely infested (eek) and that I should have management replace the stove due to this. I also read that if they’re German cockroaches, they’re nearly impossible to get rid of and if you try to move the stove or dissemble it, they will scatter everywhere and cause an even bigger issue.\n\nMy question is, is all of this accurate? And should I be pushing for a new stove to be installed? Also, could my other appliances be at risk of infestation (Fridge, microwave, dishwasher, Keurig, etc?) I am a female in my mid 20’s so I don’t have much knowledge in this realm and have no idea what to do, and I don’t want to get taken advantage of or brushed off by our management. \n\nI also have 2 cats, and I’m not sure what’s safe to do around them.\n\nAny advice is appreciated!!!!",
    "score": 742,
    "url": "https://reddit.com/r/Appliances/comments/1nqb4wz/roach_in_the_screen_of_my_oven_clock_am_i_screwed/",
    "created_at": "2025-09-25T16:18:09.000Z",
    "num_comments": 130
  },
  {
    "id": "reddit-1lvpts0",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Used up the entire budget on the washer, had to cheap out on the dryer",
    "text": "Took delivery of my new washer/dryer last week. I was gonna do the TC5/DC5 combo but I started doing some reading on here and consulting with some handyman friends, turns out basic dryer tech hasn’t changed in like 60 years, so most of these dryers are basically the same thing and they’re super easy to work on if necessary, which I’m not afraid of doing myself if I have a good YouTube video showing me The Way. \n\nI decided I didn’t care about having a matching set, so I bought a cheapo Whirlpool WED4950HW dryer to pair with the fancy schmancy TC5 washer and saved myself $800. ",
    "score": 702,
    "url": "https://reddit.com/r/Appliances/comments/1lvpts0/used_up_the_entire_budget_on_the_washer_had_to/",
    "created_at": "2025-07-09T18:08:22.000Z",
    "num_comments": 211
  },
  {
    "id": "reddit-1nzqxsm",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "washer/dryer combo sucks?",
    "text": "my parents got this washer/dryer combo machine from GE less then a year ago but we’ve been having problems with it. clothes constantly come out wet, even with smaller loads. it says there’s a clog and we’ve called the manufacturer (cleaned the area they told us to and it’s still saying clogged) and we just can’t figure out how to get it to dry our clothes properly. there’s also barely anything in the lint trap after using it which is weird cause we have 4 shedding dogs. \n\nif anyone knows where the clog might be or tips to get it to work, it would be much appreciated!\n\nTLDR: i’m dumb and can’t figure out how to dry clothes 😭",
    "score": 539,
    "url": "https://reddit.com/r/Appliances/comments/1nzqxsm/washerdryer_combo_sucks/",
    "created_at": "2025-10-06T18:21:33.000Z",
    "num_comments": 199
  },
  {
    "id": "reddit-1o3ffkw",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "KitchenAid refuses warranty service on 10 month old refrigerator",
    "text": "Help needed. I purchased a KitchenAid 3 door refrigerator (model number KRFC704FPS06) on November 13, 2024. This appliance is covered by a 1 year parts and labor warranty. This unit is less than 11 months old and the freezer began failing intermittently resulting in spoiled meat, melted ice cream and thawed ice packs. I purchased a bluetooth freezer thermometer to monitor the fluctuations in temp and documented everything, including the melted ice cream. \n\nKitchenAid was called (after being on hold for over an hour) and they sent a contracted repair guy to look at it. When he showed up, the freezer was working properly (remember, this problem is intermittent). He called KitchenAid’s tech line, pushed some buttons to reset the fridge, told me everything is fixed and left. A week later, same thing happens. Nothing was fixed.\n\nI called KitchenAid back, told them the freezer is still not working. To my frustration, they have it documented to be working as designed and the company refuses to service it even though it is under warranty. I asked to escalate this. I was told they would call me back with 4 hours. They never called.\n\nI have attached some of my evidence for everyone to review.If anyone has recommendations, please advise. ",
    "score": 521,
    "url": "https://reddit.com/r/Appliances/comments/1o3ffkw/kitchenaid_refuses_warranty_service_on_10_month/",
    "created_at": "2025-10-10T22:45:05.000Z",
    "num_comments": 214
  },
  {
    "id": "reddit-1nbukh1",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "I just shattered my stovetop and need advice on how to fix it.",
    "text": "I was pulling something hot out of the microwave above it and dropped the bowl right through the stovetop. It was an accident but it is my landlords appliance. I don’t know if I should tell him or just fix it myself. I’m not sure if he’d make me pay for repairs or not as it was an accident but I’m nervous to tell him. \n\nJust so I can get an idea of how to fix it, I’m looking for advice from appliance mechanics or technicians or anyone who has had a similar experience. The oven is a Whirlpool WFE320M0JS1. I think I can replace just the stovetop without having to get a new oven entirely with part W10696529. Does my oven and this part look compatible to y’all? \n\nI also noticed the ceramic (heat inductor I think?) part that was under the glass has cracked on the sides but not the bottom. Will I also need to replace this part? I think this is the right one if so the part is W11517959. Let me know if you have any advice on how to fix. I will attach pictures.",
    "score": 419,
    "url": "https://reddit.com/r/Appliances/comments/1nbukh1/i_just_shattered_my_stovetop_and_need_advice_on/",
    "created_at": "2025-09-08T17:46:41.000Z",
    "num_comments": 182
  },
  {
    "id": "reddit-1knkk4v",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Be wary of Costco's Memorial Day sale on appliances",
    "text": "Our dryer kicked the bucket last Thursday, and my handyman quoted $400–$500 to fix it (control module issue). After thinking it over, we figured it made more sense to replace the whole set rather than patch up an old unit. We debated whether to wait for Memorial Day sales, but I decided to just go for it since Costco has that awesome 30-day price adjustment policy.\n\nOn Friday (5/9), I bought this LG black washer/dryer set with storage pedestals from Costco: [LG 5.0 cu. ft. Mega Capacity Smart Front Load Washer with TurboWash 360 and 7.4 cu. ft. ELECTRIC Dryer with AI Sensor Dry and TurboSteam | Costco](https://www.costco.com/lg-50-cu-ft-mega-capacity-smart-front-load-washer-with-turbowash-360-and-74-cu-ft-electric-dryer-with-ai-sensor-dry-and-turbosteam.product.4000260490.html)\n\nThe subtotal came to $2,700 and after various discounts (Spend &amp; Save and Costco Direct) totaling $650, the final price was **$2,050** (plus tax). Today, 5/15, I received an email announcing their Memorial Day sale was starting, so I went and found the set I purchased and added it to my cart to see how much cheaper it would come out to.\n\nLo and behold, to my surprise and shock, the subtotal after discounts is coming out to **$2,800**. Based off what I can see, they bumped the base price of the washer and dryer by $150 each, upped the pedestal price by $20 each, and the total discount is now only $150 instead of the $650 I got just six days ago.\n\nAs far as I can tell, I got an amazing deal by pulling the trigger 6 days before their official \"Memorial Day Sale\" started. The same set costs $750 more during their sale.\n\nMy breakdown:\n\nhttps://preview.redd.it/0n82ewyqo01f1.png?width=731&amp;format=png&amp;auto=webp&amp;s=4b599c259755588c9d39379ece4aa9892a3cb3a9\n\nAnd what I see today during their sale:\n\nhttps://preview.redd.it/rhy3rvqro01f1.png?width=1411&amp;format=png&amp;auto=webp&amp;s=d875e152462b70effaf74e87269847b85b74731c\n\n",
    "score": 349,
    "url": "https://reddit.com/r/Appliances/comments/1knkk4v/be_wary_of_costcos_memorial_day_sale_on_appliances/",
    "created_at": "2025-05-15T21:54:25.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1ns13vf",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Fridgidaire products are hot garbage",
    "text": "Hello, I needed somewhere to blow off some steam. Its well known that appliances are getting somewhat worse with time. However Frigidaire is making a mad dash to see how terrible of a product they can make before consumers stop buying there stuff. Woke up this morning on a Saturday to my family's Fridgidaire gallery's condenser fan not blowing, and the compressor making noise trying to keep up. Low and behold the plastic front wheels shatter the second weight is put on them. 2000$ new Fridge is about a year old. A couple months ago neighbors throw out 550$ brand-new over the range microwave. Take microwave and diagnose. Blown fuse, replace, door interlock blows fuse, look at door interlock, seems perfect plastic is not cracked. Micro switch just does not stick out far enough to avoid coming out before other switch, blowing fuse. Nothing broken, came from factory like that. Fixed with a literal 30 second 3d print and some glue. Cant sell the microwave as that fix will not last forever. Cant use it as I dont have a place to put it and it does not work on counters. Frigidaire just replaces with a new one leaving behind 50 pounds of ewaste. Probably no one will read this but I just really have to get this off of my chest and vent somewhere. I work hard for too little pay just to come home and be slapped in the face by crappy appliances that cost a months salary. Do not buy fridgidaire if you can help it. Quality is just not there.",
    "score": 13,
    "url": "https://reddit.com/r/Appliances/comments/1ns13vf/fridgidaire_products_are_hot_garbage/",
    "created_at": "2025-09-27T17:31:35.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1i8y7bf",
    "subreddit": "Appliances",
    "soc_codes": [
      "49-9031"
    ],
    "title": "Washing machine for dummies",
    "text": "I am in the market for a new washing machine. I know I want a top loader. But I have some random questions and please don’t judge me 😂 \n\nWhat is the benefit of not having an agitator? Is it just the ability to hold more clothes? \n\nI have a top loader now without an agitator (a Samsung that is rusting and flaking off after only 8 years) and the water does not start going until after the cycle has started. I wish the water would start first and I could add the soap directly to it, I just feel like it washes better that way and no detergent stains. Mine is a HE, is that why it doesn’t pre-fill? \n\nI feel like I’m stuck on wanting it to pre fill but I also feel like from my searches they just don’t do that anymore, is that right? \n\nI’m on a septic system so would HE be better and I just need to get over not having a pre filled washer? \n\nI also need one that I can wash a king size comforter in. \n\nIf you’ve read this far, bless you. I’m a grown woman with children, a career, a home etc yet picking out a washing machine feels like the most adult decision I’ve ever made. ",
    "score": 8,
    "url": "https://reddit.com/r/Appliances/comments/1i8y7bf/washing_machine_for_dummies/",
    "created_at": "2025-01-24T15:38:46.000Z",
    "num_comments": 20
  }
]