[
  {
    "id": "reddit-1mps033",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Caught a remote hire secretly working six full-time jobs",
    "text": "I don’t even know where to start with this one, but I need your advice here...\n\nWe hired this guy for a senior engineering role. Great portfolio, nailed the interviews, references checked out. Within two months, I start getting little whispers from his manager that “something’s off.” He’s missing standups, dodging video calls, pushing deadlines, but always has some perfectly reasonable excuse.\n\nFast-forward to last week, we find out he’s not just overemployed, he’s a damn legend of it. Six full-time remote jobs. Six. Including two of our direct competitors. All paying six figures. When we confronted him with this, he didn’t even try to deny it. He said he’d “systematized” his life to handle multiple roles and didn’t see why we’d care as long as he delivered. The thing is that what made us sus is that he wasn’t delivering. The man was running a personal B2B subscription service and we were just one of his clients.\n\nNow leadership wants to implement mandatory camera-on policies, track keystrokes, and basically nuke what was left of our trust in remote flexibility… all because one guy decided to LARP as a one-man outsourcing firm.\n\nI’m honestly torn between being furious, impressed, and terrified of how many others are doing this without getting caught. Six jobs! How is that even logistically possible without cloning yourself?",
    "score": 7211,
    "url": "https://reddit.com/r/recruiting/comments/1mps033/caught_a_remote_hire_secretly_working_six/",
    "created_at": "2025-08-14T05:43:52.000Z",
    "num_comments": 660
  },
  {
    "id": "reddit-1jz253k",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Candidate got stuck in chair during interview - Security were called to help him out and it’s caused a whole ordeal",
    "text": "Screened a candidate, let’s call him Fred, over a video call for an IT support role. Not the most dynamic but he was polite, friendly and had a great resume. The role required some niche technical expertise that they had too. I shared the resume with the client who wanted to interview them.\n\nAbout 10 minutes before the interview was due to end, I got a a call from the internal HR manager, who sternly asked “did you meet Fred in person?”. I was honest and explained that I hadn’t, but that we met over video and I enjoyed the call on a personal level.\n\nHer response “well if you’d met Fred then you never would have shared his resume - the interview finished ten minutes ago and he is still in the chair, squeezed in tight. It’s a regular sized chair. He is clearly not in the physical condition required to interview”. Basically he was overweight and unfortunately gotten stuck in the hot seat.\n\nShe went on to explain how it took two security guards to help him out of the chair and then out of the building as it was happening. \n\nOn the one hand I felt bad at first for not meeting him, as I could have relayed he may need a larger chair. In hindsight however, they should be able to accommodate a larger human, and the HR lady was unacceptably / unprofessionally rude. \n\nThis was back in my agency days and I hugely regret not calling the company out. \n\nEDIT: \n\nOkay this blew up, so I wanted to answer some FAQs in the post. \n\n- It was a non-physical IT role with a regulation focus.\n\n- I was in recruitment agency at the time, hiring as a third party for a finance company. I regret not calling them out.\n\n- Some people seem to think this was a virtual interview and that they sent security to the candidate’s house. It was an in-person interview.\n\n- The HR person had been in the industry for 4 decades.\n\n- Local law does prohibit this.\n\nFinally I would like to add that Reddit gets a fairly bad name in the mainstream, but 99% of responses here are incredibly kind to Fred. I find that heartening and I will think of these responses whenever I have a moral work dilemma. ",
    "score": 6229,
    "url": "https://reddit.com/r/recruiting/comments/1jz253k/candidate_got_stuck_in_chair_during_interview/",
    "created_at": "2025-04-14T15:47:26.000Z",
    "num_comments": 205
  },
  {
    "id": "reddit-1lvn993",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Boomer hiring manager accidentally emailed insulting feedback directly to candidate, not me",
    "text": "We're here to vent, right? Venting is OK? \\[cracks knuckles\\]\n\nJust had one of my hiring managers interview someone for a sales role. I thought he was fine, he passed my phone screen. I guess the HM didn't like his personality and wrote me up a fairly brutal, detailed takedown of what he didn't like about the candidate. More focused on personality and 'affect' than anything solid. I would describe the email as 'insulting' and 'over the top'. 'Pass because he's not a personality/culture fit' would have been sufficient.\n\nExcept, oops, we had a Boomer Outlook moment and he managed to email this to the candidate directly, not me. Now the candidate's really, really mad and forwarded this to the whole executive team. There's talk that this email is going to be posted online and Glassdoor and somehow an attorney might get involved, etc. etc. Incredible things are happening. Great job everyone",
    "score": 3656,
    "url": "https://reddit.com/r/recruiting/comments/1lvn993/boomer_hiring_manager_accidentally_emailed/",
    "created_at": "2025-07-09T16:28:55.000Z",
    "num_comments": 251
  },
  {
    "id": "reddit-1o6hb0e",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Company won’t negotiate with unicorn candidate at all after long interview process.",
    "text": "I am so frustrated! I’m new to recruiting and feel like I’m failing. After a several month interview process, the perfect candidate who they loved declined the offer because they are unwilling to budge at all and it was a sizable pay-cut for the candidate. Candidate was still interested if they were willing to come up even a little bit within the posted range, but nope. \n\nNow they want to repost the position and I’m just exhausted as it feels like a waste of everyone’s time. Is anyone else seeing this happen more often? It just seems irrational to restart the whole process over a couple thousand dollars to get likely not a perfect fit candidate in the end. Should I be prepared to have candidates asking about the failed search or not in this market?",
    "score": 3201,
    "url": "https://reddit.com/r/recruiting/comments/1o6hb0e/company_wont_negotiate_with_unicorn_candidate_at/",
    "created_at": "2025-10-14T14:38:52.000Z",
    "num_comments": 205
  },
  {
    "id": "reddit-1n0yysn",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Candidate rejected due to high school grades",
    "text": "I’m nearing a breaking point, had to come here to vent. Moments after I submitted a candidate yesterday (who, incidentally, went to Stanford), I get feedback that their high school grades “aren’t impressive.” This candidate has a fairly impressive career even as a new college graduate and ticks every single other box. But she listed her grades on LinkedIn (don’t ask me why) and it shows ONE singular B. I threw my hands up and logged off for the day. \n\n\nEdit: As an update for anyone interested, I politely told the client that I don’t think I’m the right talent partner for this project. I also told the candidate that they went in another direction and on a separate note, suggested that she remove her grades from LinkedIn. She didn’t acknowledge my email but she did remove the grades (a net win, whatever). ",
    "score": 2971,
    "url": "https://reddit.com/r/recruiting/comments/1n0yysn/candidate_rejected_due_to_high_school_grades/",
    "created_at": "2025-08-26T21:47:57.000Z",
    "num_comments": 444
  },
  {
    "id": "reddit-1potj30",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Company lowballed unicorn candidate",
    "text": "I've been an agency recruiter for 5 months. I was given this role my first week on the job and was told that it was urgent to fill and the company was desperate. I am the third recruiter on my team to work on the position- the other two had given up and passed it to me.\n\nThe client has been a nightmare to work with. They are the leading company in their field and literally a household name, and they think it's everyone's dream to work with them.\n\nThey have rejected so many high quality candidates over tiny details, splitting hairs without even speaking with the candidates once. The ones they are interested in, they drag out the interviewing process for months, take weeks to schedule interviews. They went on vacation for 3 weeks back in October , when they announced this to me in September I told them not to wait until after then to schedule interviews with the candidates and their response was literally \"we expect them to be available when we get back\"!!! As if the candidates aren't applying to other jobs at the same time!\n\nAfter losing candidate after candidate after candidate due to long gaps in between scheduling interviews, including one at the offer stage, they finally got the memo and started to move faster with the candidates.\n\n I sent them a great candidate who is overqualified for the position but down to work for them because she appreciates the name brand of the company. She has moved along in the process for the past two months in good spirits, wowed them with her presentation and take-home assignment, has done everything right. \n\nWe got to the final stage and the client asked me to remind them what her salary expectations are and I gave them the number.\n\nCandidate gets her salary offer today, and..... They lowballed her and offered her 10% less than what she asked for. Mind you, the number she requested originally, was within their salary range for the position!\n\nCandidate calls me upset and not understanding why she was offered less. She's already taking a pay cut for this job due to the name brand. \n\nHow could they finally reach the end of SUCH a long process, almost half a year, in which other candidates have dropped out time and time again due to their inaction including one who had already received a salary offer from them. How could they fuck this up now...\n\nThe candidate is going to decline if they don't give her what she asked for.\n\nI asked my manager and she said that as recruiters we don't get involved with salary negotiations. \n\nHad to vent. Wwyd?\n\nUpdate: The candidate declined the offer this morning. I called her to tell her she deserved better, and promised her we would work on finding her something else. She thanked me profusely. No hard feelings. I forwarded her CV to my team and told them to keep an eye out for opportunities for her.\n\nI told my manager that I think we should stop working with the client and laid out all of my reasons. I said I have \"friends\" (all of you) who work for other recruitment agencies and all of them said that if they had a client like this one their company would have fired them a long time ago. I said that if we aren't going to fire them then we need to have a serious meeting with them and lay out OUR expectations of THEM. I said I will not continue recruiting for this role until that happens. My manager said she understood where I was coming from and will see what we can do. \n\nThanks everyone for the feedback, probably wouldn't have been confident enough to say something so direct without your encouragement.\n",
    "score": 2728,
    "url": "https://reddit.com/r/recruiting/comments/1potj30/company_lowballed_unicorn_candidate/",
    "created_at": "2025-12-17T10:46:38.000Z",
    "num_comments": 450
  },
  {
    "id": "reddit-1nno6ei",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Just had a big meeting with a few clients - they are moving away from H1bs",
    "text": "\n\nWas on a call with a few clients that we work with hiring tech staff. One of the big things they mentioned in the meeting was the change that the trump administration just did last Friday. \n\nWhile they retracted most if not all of the executive order, our clients are extremely uneasy with the current administration's extreame unpredictability with h1bs and hiring US citizens. \n\nBecause of this they have mentioned that starting today they are shifting away from H1bs and moving to hiring US citizens. They have given several staff that are on H1bs a 3 months timeline to find another job as their roles will be filled with US citizens. There are still some H1bs that will be allowed to stay but these are highly skilled and senior technical staff that we are assuming will be able to cover the 100k or whatever rate the Trump admin requests.\n\nThey even told us that they will not prioritize talent mainly from H1Bs and will shift towards hiring US citizens immediately. Any H1bs we send them may not even be looked at or immediately rejected.\n\nWe think this shift will be quietly happening across all sectors in IT in the USA. \n\nEdit: cost = 80k for a h1b + 100k = $180k cost versus 130k for the same role as a citizen. That's what I mean by cost. The employers have to choose between paying 180k for a h1b or 130k for citizen.\n\nEdit2: I'm going to stop commenting. It seems like either side are downvoting my comments since one side likes it and the other side doesn't. ",
    "score": 2157,
    "url": "https://reddit.com/r/recruiting/comments/1nno6ei/just_had_a_big_meeting_with_a_few_clients_they/",
    "created_at": "2025-09-22T14:35:28.000Z",
    "num_comments": 386
  },
  {
    "id": "reddit-1nhx4x6",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Pretty sure I had my first North Korean candidates for a remote job today",
    "text": "Background, I've been in tech recruiting for a while now. So yes yes I know all about the C2C/hotlist guys with their 'employer' and so on, nothing new there. But two job applicants today, for a 100% remote job:\n\n* Had very American white guy names (one was 'Randy Palmer') but had thick accents\n* Again, as I've been in tech for a while, nothing new about candidates with thick accents to me. But these guys/their resumes claimed that they had earned their Bachelor's here in the US- no mention of a foreign university. (One said he went to 'Arizona State University' in Seattle WA lol). Obviously I cannot just ask them about this directly, but I gave them a few chances ('so did you go to school anywhere else too?') with no response\n* Claimed they worked at great companies (Google, Airbnb), but would accept unrealistically low salaries\n* Unusually vague about what exactly they claimed to do at Google/Airbnb. I know what real software engineers sound like\n* Were super-eager to get ahold of me. I know software engineers lol, none of them are so eager to talk to a recruiter that they ping him 3 times in an hour on LinkedIn or call my cell directly\n* One LI profile was created last month. But 'Randy Palmer''s profile is 7 years old\n\nI've heard this is the classic playbook for North Koreans to work remotely. Even if they're not from NK, it's some kind of weird scam. I pinged my RPS account manager that they were suspicious and- shocker- haven't heard anything back. Stay classy LinkedIn",
    "score": 1786,
    "url": "https://reddit.com/r/recruiting/comments/1nhx4x6/pretty_sure_i_had_my_first_north_korean/",
    "created_at": "2025-09-15T20:27:03.000Z",
    "num_comments": 167
  },
  {
    "id": "reddit-1n2s22u",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "VP Candidate Wants to Wear Jeans to Interview: Update",
    "text": "Summary: VP candidate let me know two days ahead of their panel interview with execs that they didn’t have business attire with them since they would be driving back from helping a family member after surgery, and would be wearing jeans and sneakers. He also didn’t want to obtain anything nicer to wear. \n\nI called the President the next day. They weren’t thrilled, but thanked me for letting them know, and said they’d have to figure out how to frame this to one of the EVPs in particular. \n\nI spoke with the candidate the evening before the interview and he was checked in at a hotel in town and ready to meet everyone. He texted after saying he enjoyed the conversation and was feeling hopeful. \n\nThe one EVP dinged him on not presenting professionally with attire and attitude and said he came off overly arrogant. I haven’t heard the final decision from the President yet. \n\nA few notes:\nYes, I am intimidated by the President here. \n\nI try to prep my candidates the best I can to give them the greatest chance at success.  We are old-school in a lot of ways and some execs start from a “no” mentality. \n\nThe candidate knew about the interview well in advance of driving down to take care of a relative recovering from surgery. Nothing was planned last-minute. He was still home when scheduling the interview. \n\nI’m internal and paid a salary. I get no extra money for hires. I’m more focused on candidate experience and HM service since money isn’t in the equation. \n\nSo that’s it. Thank you to everyone who gave advance for me to get out of my head and just talk to the President. I’ve been here for over 10 years and never had something like this happen. Another experience in the books. ",
    "score": 1535,
    "url": "https://reddit.com/r/recruiting/comments/1n2s22u/vp_candidate_wants_to_wear_jeans_to_interview/",
    "created_at": "2025-08-28T23:45:09.000Z",
    "num_comments": 413
  },
  {
    "id": "reddit-1o5w834",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Starting January 2026, it will be illegal for an employer to ghost a candidate. [Canada]",
    "text": "\\- If you’ve had a formal interview, the employer must contact you about your application status within 45 days.\n\n\\- All job postings must include pay range, disclose if AI is being used in any process of the application process, whether it's a real job that will hire a candidate within the next year or a talent pool job,\n\nEmployers/HR face penalties of up to 100,000 per application.\n\nATS applications now have to store this data in a way that can't be deleted except by an executive or director of the company for up to 3 years for auditing purposes. The executive would be liable. There is a bill in California that will do the same thing as well.",
    "score": 1429,
    "url": "https://reddit.com/r/humanresources/comments/1o5w834/starting_january_2026_it_will_be_illegal_for_an/",
    "created_at": "2025-10-13T21:04:52.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1icxlxr",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "I am sorry to say this but applicants who require H1B visa sponsorship are mediocre",
    "text": "Right now I don't look at resumes from applicants on H1B or require sponsorship. Their work experience tend to be all over the place and a bit sketchy or when they have great experience from \"top companies\" they can't elaborate on anything they mentioned on their resumes. I would rather to take an American recent graduate or someone with little experience over an H1B applicants with 10 years experience on paper.",
    "score": 1250,
    "url": "https://reddit.com/r/recruiting/comments/1icxlxr/i_am_sorry_to_say_this_but_applicants_who_require/",
    "created_at": "2025-01-29T16:21:26.000Z",
    "num_comments": 458
  },
  {
    "id": "reddit-1mi8vnz",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Just pitched a 4‑day work week to my boss. Here's how it went. [N/A]",
    "text": "I finally did it. After months and months of quietly collecting data on productivity, burnout, and retention, I pitched the idea of a 4‑day work week to my boss yesterday.\n\nThe good news: He did not immediately shoot it down. He actually admitted that the constant turnover and exhaustion on our team is costing us more than we realize. I showed him a few case studies (like what Buffer and Kickstarter shared when they tested 4‑day weeks) and even tied it to some of our own internal data. He was impressed.\n\nThe bad news: He is worried about coverage and output. His biggest concern is that cutting one day will mean scrambling the other four, or worse, missing key deadlines. He asked me point‑blank how we would measure success if we piloted this.\n\nThat’s where it got interesting. I mentioned how we already use tools like Workday, Klearskill, and Deal to track everything from recruitment metrics to CV analysis and onboarding time. If we can measure efficiency so closely with tech already, why can’t we apply that same mindset to tracking a shorter work week? He seemed surprised by that framing.\n\nWe left the meeting with a “bring me a plan” response, which I am counting as a small win.\n\nFor those of you in HR or leadership, I have some questions. \n\n1. Have you successfully implemented a 4‑day week or even proposed one?\n\n2. How did you handle pushback on coverage and productivity?\n\n3. What metrics did you track to prove it worked?\n\n4. Did it actually help with retention and burnout, or did it create new problems?\n\nI feel like this is a conversation a lot of us are going to have in the next few years, especially with AI and automation freeing up more time. \n\nCurious to hear your experiences! Please share. ",
    "score": 907,
    "url": "https://reddit.com/r/humanresources/comments/1mi8vnz/just_pitched_a_4day_work_week_to_my_boss_heres/",
    "created_at": "2025-08-05T13:14:24.000Z",
    "num_comments": 159
  },
  {
    "id": "reddit-1jdyeib",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "GOT A NEW JOB WITH A 53% RAISE! [CA]",
    "text": "Eeeeeeek! Am so excited! \n\nI have been at my first HR job for 2 years. \n\nI don’t know if you all remember my last post in February about my heart-wrenching rejection from a job that I really wanted. 😭\n\nAt my current job, I am paid $22 an hour and no growth opportunities. Been feeling pretty stuck. This new job is paying me a yearly salary of $70,000 plus a 10% discretionary bonus of my annual base salary. Although, the job is non-exempt which is fine which gives me opportunity for overtime. Has medical, dental, 401k and a gym stipend. Plus, weekly lunches provided, a great view of the city and a cafe downstairs! \n\nMy future direct manager explains how that HR has a seat in the table and there are promotion and growth opportunities based on my performance. After observance of the culture dynamic, everyone was pretty friendly for those that I interacted with. \n\nI start in April. \n\nYAY! \n\nUpdate 3/20: Putting in my two week’s notice this Friday! Am so nervous!! \n\n\n",
    "score": 839,
    "url": "https://reddit.com/r/humanresources/comments/1jdyeib/got_a_new_job_with_a_53_raise_ca/",
    "created_at": "2025-03-18T06:03:49.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1kd3z63",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "$55k",
    "text": "I'm a corporate recruiter who has been out of work since Jan. 1st. Had a screening just now for a role which did not have the salary listed in the JD. She tells me at the end of the call that it's $55k (major metro area, higher COL). I have nine years experience and a Master's. I asked if she felt this was a fair salary for my experience. She said lots of folks with my same background are accepting of this pay. Just what the hell is this market right now? I can make at least $60k/yr waiting tables. I'm so, so tired. Just looking to commiserate.",
    "score": 765,
    "url": "https://reddit.com/r/recruiting/comments/1kd3z63/55k/",
    "created_at": "2025-05-02T15:35:27.000Z",
    "num_comments": 159
  },
  {
    "id": "reddit-1noofdl",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Hygiene conversation took a turn [N/A]",
    "text": "I'm an HR Director with 25 years of experience. I've finessed a respectable and succinct conversation when I need to address an employee hygiene issue. I've had this conversation more than once, no qualms about having it. I had this chat with an EE a few week ago. I never go by just my observations, I listen for what other staff are saying. Two who worked in the same unit raised concern about it, and I experienced myself. Then the direct supervisor approached me about it. So I had the chat, they were surprised but received it much better than most would.  I always give the afternoon off after that talk-- (b/c who wants to sit at work replaying that in their head..).  Planned to follow up, but was hoping for an organic interaction vs. an awkward 'hey, how's the hygiene thing going' phone call. Well EE sends me an email. It runs down the conversation we had accurately, **but**... \\[to summarize\\] *they did their own investigation, talked to their peers, patients, supervisor. No one agrees there is an odor concern. Says there is no factual basis for the concern I raised and says the matter is unsubstantiated.* \n\nWow...really?? I love how the notion is single handedly &amp; confidently dismissed like there is an authority to even do so.  (BTW- I had followed up w/ the supervisor who said the BO has since improved). I can steer the conversation back on track, but geez--- just when you think you've experienced it all.  \n",
    "score": 732,
    "url": "https://reddit.com/r/humanresources/comments/1noofdl/hygiene_conversation_took_a_turn_na/",
    "created_at": "2025-09-23T17:56:29.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1mi2cgu",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Don’t add just anyone on LinkedIn - Crazy person emailed my company’s exec team to complain about me",
    "text": "I manage a team of 7 at a $30b tech company in the Bay Area. Title pretty much sums it up. I accepted an invite from someone who expressed interest in my company. 99% of the time it’s someone who isn’t a fit but out of courtesy I’ll tell them to apply and we’ll reach out if they’re a fit. They proceeded to blast me with message after message which I ignored, but I ended up blocking them after 2 months due to spam.\n\nHe ended up emailing our entire exec team with this long email stating how despicable it was for me to do that, that I should be fired, I’m not a good representation of the company, he’ll tell all 30,000 people in his network that I’m awful, etc. He attached  screen shots and emails he allegedly sent to me that I never got because he got my email wrong. All bad. \n\nAm I screwed? I’m pretty sure the exec team is aware this guy is nuts but it sucks having my name associated with this kind of behavior to C suite. I’m choosing not to respond and letting my manager (head of TA) deal with it. ",
    "score": 584,
    "url": "https://reddit.com/r/recruiting/comments/1mi2cgu/dont_add_just_anyone_on_linkedin_crazy_person/",
    "created_at": "2025-08-05T07:06:47.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1oqvzo0",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Sharing a Win [N/A]",
    "text": "A few months back, Payroll flagged that one of our support team members had used their company credit card for a personal expense and asked me (Sr. HRBP) to put together a repayment agreement.\n\nTurns out, I don’t actually support that group, so I passed it to the HRBP who does but asked for the context. The “personal expense” was a car insurance payment. Not a vacation, not shopping, not something frivolous — car insurance.\n\nThat hit me hard. These support team members are some of the hardest-working, most underpaid employees in the building, and if someone’s resorting to using a company card to cover a basic life expense, that’s a sign of a bigger problem. So I recommended that the HRBP reframe the conversation with the VP and consider that maybe this wasn’t about discipline, but about pay equity and support.\n\nWell, I just learned that the team is getting promotions and pay increases. I’m keeping quiet, letting the HRBP who supports that group have the spotlight (they did the legwork and carried it forward), but deep down, I’m taking this as a quiet win for doing what HR should do: looking at people with empathy and acting on it.\n\nJust wanted to share with this group. Sometimes the right nudge in the right moment can really change something.\n\nHope you all have a great Friday and an even better weekend. Go find your own quiet win out there!",
    "score": 550,
    "url": "https://reddit.com/r/humanresources/comments/1oqvzo0/sharing_a_win_na/",
    "created_at": "2025-11-07T14:33:49.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1n50dxd",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Every time I open LinkedIn Recruiter I lose brain cells",
    "text": "Every time I log into LinkedIn Recruiter I feel like I’m being mugged by Microsoft with a smile. The damn thing is $10k+ a year and for what? Outdated profiles, broken filters, and InMail response rates that make cold calling in 2003 look good.\n\nSearch is a joke. You want a backend engineer with Python and Kubernetes? Congrats, here are 300 customer success managers, a dentist, and three people who haven’t touched their profiles since 2016. Boolean barely works, filters contradict each other, and half the “matches” don’t even live in the right country.\n\nThen you send an InMail. If you’re lucky, maybe 1 in 5 responds. Most devs don’t even read them anymore because their inbox is just wall-to-wall spam from every recruiter on earth. LinkedIn trained an entire generation of engineers to auto-ignore us. They literally think we’re all scammers.\n\nAnd the worst part? We keep paying. Because you have to. It’s the DMV of recruiting. Everyone hates it, but if you want access to candidates, you stand in line, pay the fee, and suffer.\n\nHonestly, if another platform ever manages to crack passive tech candidates at scale, LinkedIn is cooked. But until then, it’s a monopoly we all resent feeding.\n\nSorry, had to let it all out. ",
    "score": 538,
    "url": "https://reddit.com/r/recruiting/comments/1n50dxd/every_time_i_open_linkedin_recruiter_i_lose_brain/",
    "created_at": "2025-08-31T17:17:55.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1nxapg9",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "These AI recruitment companies are pissing me off",
    "text": "Y’all, I am DONE with these so-called “AI recruiter” tools. What the hell are they even doing?\n\nI’ve been recruiting for over 13 years and I swear, every new product demo makes my skin boil. \n\nNone of them seem to understand how recruiting actually works.  “save time with AI,”  sure,  by having a bot ask generic questions so I can spend the SAME amount of time watching the videos after. How tf is that saving me anything?\n\nRecruiting is about people, not just filtering candidates. I’m willing to bet most of these companies have never actually even *talked*  to one.\n\nAm I missing something here, or are we all seeing the same bullshit?",
    "score": 529,
    "url": "https://reddit.com/r/recruiting/comments/1nxapg9/these_ai_recruitment_companies_are_pissing_me_off/",
    "created_at": "2025-10-03T20:46:33.000Z",
    "num_comments": 106
  },
  {
    "id": "reddit-1o7drib",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "I thought I handled a termination professionally, employee says it was a frat meeting [N/A]",
    "text": "Hey all,\nI’m in HR and recently helped facilitate a termination for an employee who had ongoing performance issues. There had been a lot of documented feedback, multiple one-on-ones with her manager, and even vendor complaints about her performance. The decision wasn’t sudden or out of nowhere.\n\nIn the actual meeting, it was me (HR), her manager, and the department director — all men. The employee is a woman. The meeting was calm, private, and professional. No one raised their voice or said anything inappropriate. We explained the decision, thanked her for her contributions, and gave her time to ask questions.\n\nAfterward, she filed a grievance saying the meeting was intimidating and insensitive because she was the only woman in the room. She said HR should get training to avoid that kind of situation in the future.\n\nI honestly didn’t think about the gender dynamic beforehand — I just made sure the right people were present from a process standpoint (manager, director, HR). But now I’m wondering if I missed something.\n\nDo you think there’s merit in her complaint? Should I have tried to include another female HR rep, or is this more about how it felt to her rather than something we did wrong?\n\nCurious how others in HR would see this — and if you’d do anything differently in the future.",
    "score": 510,
    "url": "https://reddit.com/r/humanresources/comments/1o7drib/i_thought_i_handled_a_termination_professionally/",
    "created_at": "2025-10-15T15:14:18.000Z",
    "num_comments": 313
  },
  {
    "id": "reddit-1ll8aqf",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Sharing salary progression [CA]",
    "text": "Hi! I am curious about other’s salary progression in the HR field. Attaching mine as a photo, and for context, I have moved around various industries, but am currently an HRBP in tech. I have ~6 years of experience and live in the Bay Area. Any thoughts? Does anyone feel like I could be shooting for a lot more for my next role/promotion or am I pretty in line with peers at a similar level of experience? Thanks! ",
    "score": 508,
    "url": "https://reddit.com/r/humanresources/comments/1ll8aqf/sharing_salary_progression_ca/",
    "created_at": "2025-06-26T18:51:16.000Z",
    "num_comments": 199
  },
  {
    "id": "reddit-1ic4duz",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Trump Pauses Federal Grants [n/a]",
    "text": "Today - the President of the United States created an order pausing all grant money and federal funds. Damning non-profits.\n\nBOY has today been a lot of responding to that order and quelling uncertainty in employee population at our Not For Profit almost exclusively funded by federal grants. The conversation has been re-framing it around the timeline given and focusing on our mission.\n\nThere's a lot of uncertainty for non profits in general (like the one where I work) that rely on these funds and it's just maddening to read quote:\n\n*\"Federal agencies must temporarily pause all activities related to obligation or disbursement of all Federal financial assistance, and other relevant agency activities that may be implicated by the executive orders, including, but not limited to, financial assistance for foreign aid, nongovernmental organizations, DEI, woke gender ideology, and the green new deal.\"*\n\nAs an OFFICIAL MEMO. Fucking \"green new deal\" \"woke gender ideology\" sure is a good way to witch hunt \\*check notes\\* CHARITIES.\n\nJust another fun day in HR under this new administration.  I'm sorry for bringing a political post here but I needed to rant about this where other HR professionals can talk about this.\n\n  \nUpdate - we have to furlough our entire part-time staff and all the people who run the after-school programs we run and operate.  It'll buy us some time but woof this has been a day from hell ",
    "score": 506,
    "url": "https://reddit.com/r/humanresources/comments/1ic4duz/trump_pauses_federal_grants_na/",
    "created_at": "2025-01-28T15:42:12.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1noh7z3",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Mentally preparing for an ugly termination [N/A]",
    "text": "UPDATE: Everything went smoothly. Our lawyer was part of the discussion and she tore apart all efforts from the ex-leader to BS/lie during the discussion. We believe they saw it coming, as there were notably fewer things to pack up from their office and some personal items had already been removed. \n\nWe met with their team afterwards and we're confident they'd already been texted as nobody seemed surprised.  \n\nWe expect some legal follow up, but we're prepared. And we expect some reputation/PR headaches because of this person's reach within our industry. We might lose some business.\n\nOverall, it went as well as expected. We're not out of the woods yet, as we essentially have to rebuild the department and cobble along until we're fully functional again, but I know once the dust settles, we'll all feel better because we can now all communicate openly and freely without fear. \n\nThe worst part of it was after the fact, hearing from some employees who fear retaliation, and in one case, being harmed physically, which had never been reported before. So awful to have to feel that way with somebody who claims to be your mentor. \n\nThank you all for your support/suggestions; this was an impressive (and greatly appreciated) show of solidarity within our community. \n\n- - - - - - - - - - -\n\nThis is just a \"get it off my chest\" post.\n\nI'm the HRD for a small medical company. After months of investigations and dancing around the challenges of disciplining the only person who does their specific job (which is highly-specialized, life-saving work), we've finally gathered solid evidence of misconduct and will terminate our most senior/tenured employee. \n\nI've been doing this stuff for a long time and terms always suck but are generally routine, but this one has me quite nervous! This person is a bully to many people, including me, and a master manipulator. They know how to cut deep, and they revel in it. I know we'll handle this like champs, as always, but I'm dreading how they're going to act before we get them out the door. \n\nDespite looking forward to not working with this jerk again, I haven't been this nervous about a term in forever - it reminds me what a psychological hold this kind of behavior can have on people and how insidious it is when people like them take advantage that. \n\nBut today's the day we do the tough stuff, and tomorrow we'll sort out the fallout, which we know will be significant, and then we'll all learn what it feels like to walk without eggshells for the first time in years. \n\nPlease send good juju into the universe today!",
    "score": 482,
    "url": "https://reddit.com/r/humanresources/comments/1noh7z3/mentally_preparing_for_an_ugly_termination_na/",
    "created_at": "2025-09-23T13:20:44.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1oe8him",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "I'm Tired of Interviewing People Who Are Great at Applying for Jobs, But Terrible at Doing Them.[N/A]",
    "text": "Has anyone else hit the wall where you realize you've mastered filtering for keywords, but you can't filter for basic competence, emotional intelligence, or how someone handles pressure?\n\n​My 5 biggest weekly frustrations are all tied to this problem:\n​The 4.0 GPA candidate who has the perfect resume, but as soon as you ask an open-ended, non-textbook question, they freeze. We wasted 4 rounds of interviews to discover they have 0 EQ.\n\n​The one who has the skills, but we should have seen the red flags in their initial written communication tone. How do you assess a candidate's potential to be a toxic colleague before they're on-site?\n\n​The candidate who knows how to format a resume with 20 keywords to beat the parser, but the reality is they only used 2 of those technologies once. The tool we have makes the problem worse.\n\n​The one who passes pre-screens, only to crumble in the technical or behavioral assessment. I wish I had a low-stakes, automated way to see how they handle a simple 30-minute stress test upfront.\n\n​I'm ready to stop optimizing for \"Skill X\" on a profile and start optimizing for \"Will thrive under pressure and not be an a**hole.\" \n\nCV clean-up is necessary, but this soft-skill assessment gap is the single most expensive time-sink in the entire hiring process.",
    "score": 472,
    "url": "https://reddit.com/r/humanresources/comments/1oe8him/im_tired_of_interviewing_people_who_are_great_at/",
    "created_at": "2025-10-23T16:50:12.000Z",
    "num_comments": 180
  },
  {
    "id": "reddit-1iz5y1k",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "This is our job market folks… [n/a]",
    "text": "Rejection letter I received for a role I applied for less than a week ago at a mid sized tech company. Over 3k applied for 1 HRBP gig. Good luck to everyone looking for work ❤️",
    "score": 469,
    "url": "https://reddit.com/r/humanresources/comments/1iz5y1k/this_is_our_job_market_folks_na/",
    "created_at": "2025-02-27T03:02:49.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1k7sq02",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "My CEO announced a “work from anywhere” policy. Help [WA]",
    "text": "My company just instated a 4 day return to office mandate. To make this more attractive, we are including a “three weeks remote working” provision in the policy to allow employees the flexibility to work remotely up to three full weeks per year. This is great for meeting personal obligations, holiday periods, etc.\n\nHowever, the issue is that in the communication sent by the CEO announcing the new RTO mandate, he called our remote working provision “work from anywhere”.\n\nNow, we are getting requests from employees to work from various countries outside of their home country. We have a process in place for these requests which includes consulting with our Payroll and Tax teams, but they’re now spending a lot of time on researching tax obligations.\n\nWe worked with our immigration lawyers on adding a statement to our policy that stipulates the company will not sponsor visas for personal travel that includes remote work and that personal immigration obligations are the responsibility of the employees.\n\nWe floated the idea of limiting remote work to countries in which we have established offices (~20 countries), but this idea was not well-received by stakeholders. This would limit a lot of European remote work for our European employees.\n\nOur company is pretty risk-averse, so we cannot take a “don’t tell us we don’t care” stance on this.\n\nNo, I don’t know WTF the CEO and Comms team was thinking when they decided “work from anywhere” was the right term to use.\n\nHow do other companies manage work from anywhere policies?? Help!!\n\n ",
    "score": 442,
    "url": "https://reddit.com/r/humanresources/comments/1k7sq02/my_ceo_announced_a_work_from_anywhere_policy_help/",
    "created_at": "2025-04-25T18:51:24.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1ijg0ls",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Is there a greater relief? (for fun) [N/A]",
    "text": "As a seasoned HR professional, you've been there. Perhaps you're there now. If you're just starting off, you will undoubtedly be there. \n\nYou get the call. Potentially email. The dreaded employee pop in, unplanned. Worst, they called your boss first. It's a complaint. An issue. Something they noticed on their paycheck. And they want an answer. The topic can vary slightly but they're really all the same. \"I didn't sign up for dependent care FSA, I have no dependents!\" \"I haven't changed my tax withholding in years!\" \"I would never do that!\" An error has been uncovered and they're looking at you. \n\nA wave of panic overcomes you. Did you royally eff up? Did something change in your ERP system and you didn't catch it? Did you incorrectly change the wrong employee's information? You look in your system and verify what they're seeing. But how, just how did we get here?\n\nYou play it cool, calm and collected on the surface as your \"oh sh*t\" barometer rises internally and self-doubt creeps in. You know the outcome of this situation lies in your record retention abilities. And really, how much confidence do you have in that? You're questioning all of it now.\n\nIf you're old school, you go to the file cabinet. New school, your checking your electronic records. It becomes your number one priority bc suddenly you can't focus on anything else. You frantically search, thumbing through papers or clicking through records for what seems an eternity but is merely moments.\n\nFinally you pause. There. It's there. In dry ink on that sweet, sweet paper or electronically showing the change was made by the employee. It's got the date, it's got the information. It's the thing they claimed they \"never did\" but there it is. It was them. It was all them. And you my friend are a records retention savant. You breathe a sigh of relief.\n\nYou've got the receipts. The proof. And it's time to recuse yourself of any trivial error they dare to insinuate you are capable of. This is HR and it's not your first rodeo. You live to see another day. ",
    "score": 386,
    "url": "https://reddit.com/r/humanresources/comments/1ijg0ls/is_there_a_greater_relief_for_fun_na/",
    "created_at": "2025-02-06T22:53:37.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1jaf41y",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Just got laid off today as a corporate recruiter",
    "text": "I'm still in shock but I got laid off today from my corporate recritment job because recritment needs had decreased so they don't need me anymore. I wasn't expecting this as I just had my performance review 2 days ago, got praised and a significant salary bump. I don't know what to do. \n\nEdit: Thank you for all the support. I don't have the mental capacity to reply to each one but I really appreciate you taking the time to comment, emphatise and make suggestions. \n\nThis was my dream job, and I thought I was going to be there for a long time. The job market at my country is shit, and I struggle to find job adverts. Finally, I hope everyone in my position good luck, I hope everything turns out for the better and stay strong! ",
    "score": 360,
    "url": "https://reddit.com/r/recruiting/comments/1jaf41y/just_got_laid_off_today_as_a_corporate_recruiter/",
    "created_at": "2025-03-13T15:49:00.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1miu768",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "AI in an Interview Today",
    "text": "I’ve been a recruiter for a long time and had a wild experience today. \n\nI was doing a video recruiter screen today for a Senior Director role at a tech company and the candidate was absolutely using AI to create responses to my questions and then reading them. \n\nThe call started like any other… and then… \n\nHe answered the tell-me-about-your-experience-as-it-relates-to-the-role question with a script and at first I thought he was reading from his resume, cover letter, or maybe that he prepped something because he was nervous. Fair enough, I appreciate a nice prep. \n\nAnd then every question I asked him sounded like an AI answer trained on his experience. The answers were vague and general but had random accomplishments (increased revenue by 20%), I could see his eyes moving across the screen, and his tone and inflection was as if he was doing a presentation rather than answering a question. Right after I asked each question, he’d be a little conversational, reiterate the question and his eyes wouldn’t be moving. Then, I presume, the AI answer would start coming in. It was a weird experience, especially for someone at this level.. and they were a referral. \n\nAnyone else have an experience like this? \n",
    "score": 341,
    "url": "https://reddit.com/r/recruiting/comments/1miu768/ai_in_an_interview_today/",
    "created_at": "2025-08-06T03:36:17.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1lxmeze",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "I quit today. No notice. 8 weeks into my role and I was burned out. I I initially applied to an HR Manager job despite my HR Director level experience and having an MBA. My role was undervalued. [NJ] in [unites states]",
    "text": "\nI applied for an HR Manager role and at time of offer they changed it to HR coordinator offering less than I asked and gave me $80k despite my 12years HR experience and MBA.\nI started this HR role 8 weeks ago with the impression that I’d be managing systems, tech transitions, and streamlining processes. They told me ADP PEO would handle most of the heavy HR lifting, and my role would focus about 60% on technology and process optimization.\n\nThat was a lie.\n\nFrom day one, it felt like I was walking into a burning building. The company had no real HR structure, no systems in place, and zero documentation. I wasn’t just setting up tech—I was buried in everything: payroll issues, compliance gaps, benefits enrollment chaos, I-9s for 300+ employees, EEO reporting, onboarding, terminations, and fielding every single people problem from 4 hotels, 2 restaurants, and a retail business all at once.\n\nI didn’t even have a key to the office. The long tenured Administrative assistant would turn the light offs and say time to go.\n\nEvery week, I was drowning in work with no boundaries, taking calls on Saturdays, working through lunch, trying to fix years of dysfunction without support. I was the only HR person for multiple businesses and was still expected to clean up their internal mess, answer all staff questions, AND get ADP PEO working smoothly.\n\nWhen I finally spoke up about the workload not matching the original offer or title, they brushed it off. The CEO asked why I didn’t say something sooner—but the truth is, there was just too much to fix and too little honesty in how they presented the job.\n\nIt became emotionally exhausting. I had 250 unread emails I couldn’t keep up with. One employee outright said in an email that he wouldn’t respond to me, and no one checked him. The stress was affecting my health. I felt like I was constantly failing, even though I was doing the work of three people.\n\nToday, I quit. I walked away with no new job lined up. And now I’m sitting here wondering… did I make the right choice?\n\n36 retail wireless locations, 4 hotels, and 2 restaurants ",
    "score": 335,
    "url": "https://reddit.com/r/humanresources/comments/1lxmeze/i_quit_today_no_notice_8_weeks_into_my_role_and_i/",
    "created_at": "2025-07-12T00:02:01.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1klmldg",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "SHRM’s internal email to employees [N/A]",
    "text": "Using a throwaway since I used to work here. SHRM’s a mess and this is proof. If anyone is still taking HR advice from them, why? This internal email is proof that they’ve gone off the deep end. It was sent to all staff yesterday. ",
    "score": 327,
    "url": "https://reddit.com/r/humanresources/comments/1klmldg/shrms_internal_email_to_employees_na/",
    "created_at": "2025-05-13T13:57:12.000Z",
    "num_comments": 257
  },
  {
    "id": "reddit-1mq292a",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Anyone else notice a rise in lower paying HR positions hitting the job market? [TN]",
    "text": "I've never seen so many HR Coordinator or HR Generalist postings, and the salary is typically very low around $40k-$50k.\n\nSomething tells me I'd be doing the same work as ER or HRBPs for half the pay.",
    "score": 321,
    "url": "https://reddit.com/r/humanresources/comments/1mq292a/anyone_else_notice_a_rise_in_lower_paying_hr/",
    "created_at": "2025-08-14T14:28:28.000Z",
    "num_comments": 107
  },
  {
    "id": "reddit-1id7axl",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "SHRM DEI Webinar &amp; the Future of my SHRM-SCP Cert [n/a]",
    "text": "Like many of you, I’ve been following the discussions around SHRM’s recent webinar on DEI and executive orders (attended it myself). After really digesting their stance, I’ve decided to formally rescind my SHRM-SCP certification and no longer associate with SHRM.\n\nI recognize that some may see this as performative or a small act that won’t move the needle—but for me, this is about principle. I don’t want my name tied to an organization that is actively shifting away from true DEI commitments. My HR team has also aligned on no longer using SHRM resources and is moving toward frameworks that better support equity-driven HR practices.\n\nI don’t know if SHRM will care, and I don’t expect my decision alone to change anything. But this is the only response that feels right to me. If nothing else, it makes clear—at least to myself and those around me—where I stand.\n\nIf anyone else is considering taking a stand, I encourage you to email SHRM at certification@shrm.org to request removal from their certification records.\n\nI hope my fellow HR professionals are taking care of themselves. The past two weeks have been some of the heaviest I’ve experienced in this field since the early days of COVID.",
    "score": 321,
    "url": "https://reddit.com/r/humanresources/comments/1id7axl/shrm_dei_webinar_the_future_of_my_shrmscp_cert_na/",
    "created_at": "2025-01-29T22:59:28.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1nc28ew",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Employee Refusing to Relocate [CA]",
    "text": "Hi everyone\n\nLast year, we hired an employee and in the offer addendum, we offered her a $30,000 relocation bonus with terms for her to relocate by August 2025. While she did sign this and received the relocation bonus, she is now refusing to relocate. \n\nHas she been working remotely this whole time? Yes. Can the job be done remotely? Yes. But did she sign an agreement and received the relocation bonus? Also yes.\n\nHas anyone gone through anything similar before? Do we give her another 60 or 90 days to relocate with a new agreement? Is there a point where we move to separation? (Her performance hasn't been great overall but she has been in role for only 1 year)",
    "score": 315,
    "url": "https://reddit.com/r/humanresources/comments/1nc28ew/employee_refusing_to_relocate_ca/",
    "created_at": "2025-09-08T22:41:19.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1lk7z4a",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Why do people accept a job and then just not do onboarding?",
    "text": "I had 3 offers accepted a week or two ago. One crushed onboarding and credentialing in under a week and is cleared already (and he's retiree age). The other 2 have not even logged in or made any attempt to do it. Why is it so often such a pain to convince people to do paperwork? Minor annoyance but makes you nervous\n\nUPDATE: 2 out of 3 have completed OB now! The 3rd has logged in but still not touched forms. ",
    "score": 307,
    "url": "https://reddit.com/r/recruiting/comments/1lk7z4a/why_do_people_accept_a_job_and_then_just_not_do/",
    "created_at": "2025-06-25T15:00:01.000Z",
    "num_comments": 185
  },
  {
    "id": "reddit-1klmy88",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "The Problem is hiring managers",
    "text": "I want out of this industry so badly sometimes. \n\nI have worked at company for 3 years and I have to recruiting for super niche unicorn candidates with below average salaries for senior engineer and manager roles. We still reject people because they don’t have 100% of requirements even though I have to source for every single candidate we interview \n\nIt just sucks and I wonder if I should start looking full time for another position. And yes I have tried talking to managers about what they are looking for, they basically told me to get fucked m😆🤣\n\nThis is more of a bitch fest on my part, thanks for coming to my rant ",
    "score": 288,
    "url": "https://reddit.com/r/recruiting/comments/1klmy88/the_problem_is_hiring_managers/",
    "created_at": "2025-05-13T14:12:05.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1nkks8w",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Job Huggers",
    "text": "Okay this is mostly a rant. “Job hugging” is the new catch phrase lately. I get it. Stay where it’s “safe”. \n\nThe problem is, even though the job market is slow, the hiring managers for the positions that are open only want unicorns. Unicorns is nothing new. They’ve always wanted unicorns. However, typically, most hiring managers will budge on either salary or requirements after some time. I’ve worked roles in the last year where the hiring manager simply will not budge—they sit on roles 6+ months waiting for the unicorn.. and in some cases, they’re still waiting. \n\nWhat gives?? They say they can’t find talent, but there *is* talent. They may not be a unicorn, but maybe a flying horse will have to do. It’s so frustrating as a recruiter and for quality candidates. ",
    "score": 271,
    "url": "https://reddit.com/r/recruiting/comments/1nkks8w/job_huggers/",
    "created_at": "2025-09-18T21:21:57.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1k5je11",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "I can’t wait until the USA gov. enact the law to require ALL job postings, no matter the state it’s posted in, to add salary ranges on the posting.",
    "text": "I need the rest of the states to follow the lead of the states that already has. ",
    "score": 254,
    "url": "https://reddit.com/r/recruiting/comments/1k5je11/i_cant_wait_until_the_usa_gov_enact_the_law_to/",
    "created_at": "2025-04-22T22:23:11.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1ntug6y",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Explaining to candidates: range ≠ automatic max offer",
    "text": "Ranges like $120k–$150k are set with internal equity in mind. But where your offer lands inside that range still depends on a few things: your experience, how closely your skills match the role, how you perform in interviews, and pay parity with people already doing similar work. We can go higher for exceptional fits, but most offers cluster around the midpoint to stay fair across the team.”\n\n**TL;DR:** Salary ranges ≠ guaranteed top pay. They flex on exp/skills.",
    "score": 236,
    "url": "https://reddit.com/r/recruiting/comments/1ntug6y/explaining_to_candidates_range_automatic_max_offer/",
    "created_at": "2025-09-29T21:20:44.000Z",
    "num_comments": 156
  },
  {
    "id": "reddit-1meh699",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "The “new” assessment my CEO wants me to start giving candidates. Am I insane for thinking this is bullshit?",
    "text": "I have “new” in parenthesis because this concept was supposedly invented 20 years ago and hasn’t been updated since. \n\nYou do 4 pages of ranking heinous concepts like murder, torture, slavery, and burning a heretic at the stake, and then it spits out a 10 page, completely personality-based report of some of the most aggressive and in-depth descriptions of a person’s personality and work style you can imagine. The owner of the company told us straight up that it weighs negatives much heavier than positives, so the results tend to focus on perceived red flags more than what the candidate could bring to the table. \n\nDoes anyone here have experience with these? Am I wrong in being uncomfortable administering this to candidates and it being used as a decision-making tool? ",
    "score": 233,
    "url": "https://reddit.com/r/recruiting/comments/1meh699/the_new_assessment_my_ceo_wants_me_to_start/",
    "created_at": "2025-07-31T23:40:06.000Z",
    "num_comments": 166
  },
  {
    "id": "reddit-1ph6qhq",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "AI recruiting is going nowhere",
    "text": "Dear all founders building recruiting products,\n\nI’m a corporate recruiter with over 15 years of experience, and I’m honestly fed up with watching AI recruiting tools race to the worst possible version of this job. [This thread ](https://www.reddit.com/r/recruiting/comments/1p4mcaz/comment/nsscblp/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button)is a perfect example... founder shows up pumped about a “powerful sourcing tool” where you paste a JD, get hundreds of candidates in 30 seconds, with AI summaries, AI resume review, AI outreach, AI follow ups, all the buzzwords. And I had to say it there and I’ll say it again here: the bottleneck has never been finding profiles. Any half competent recruiter can already find plenty of “qualified” people. \n\nThe real problem is getting the right people to actually reply in a way that does not wreck your brand or annoy the hell out of them. When tools crank up search volume and automate outreach, all they really do is make bad behavior faster and easier. You end up with slightly more targeted spam, just wrapped in nicer UI.\n\nWhat actually makes hiring hard is the candidate side, not the company side. Active talent is fine, but the people companies really want are mostly passive and off the market quickly. If those people are not living on your platform, engaging with it for reasons beyond “I need a job,” your fancy AI is basically generating scores and summaries on top of the same shallow pool everyone else is hitting. You get the worst mix of job boards (no intent), LinkedIn (everyone chasing the same profiles), and generic outreach tools (more automated sequences, lower response rates, candidates tuning everything out). \n\nThe only players that stand a chance are the ones with real, ongoing engagement with candidates and some actual trust: they show up daily for content, community, learning, whatever, and recruiting is built on top of that. That is why I mentioned things like LinkedIn and daily.dev in that thread. They at least have a shot because they start from where candidates already are. There are probably other examples out there... but you get my point.\n\nFounders keep pitching “more candidates, faster” and “AI outreach at scale” like it is a feature, but from where I sit it is the exact opposite of what this space needs. Every time another tool makes it easier to blast out slightly customized AI messages to a bigger list, response rates go down for everyone, including the people trying to do this well. Candidates trust recruiters less, inboxes get noisier, and employer brands look more desperate. \n\nSo yeah, I’m defnitely ranting, but here is the ask - if your big recruiting idea is basically “find more people and hit them harder,” please stop. Build for trust, consent, and candidate-side value first, or do something else entirely. We do not need another AI-powered email cannon pretending it is fixing hiring.",
    "score": 229,
    "url": "https://reddit.com/r/recruiting/comments/1ph6qhq/ai_recruiting_is_going_nowhere/",
    "created_at": "2025-12-08T07:53:48.000Z",
    "num_comments": 131
  },
  {
    "id": "reddit-1i6phqi",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Executive Orders from the White House",
    "text": "You guys. Have you read this? This is incredible. \n\nhttps://www.whitehouse.gov/presidential-actions/2025/01/reforming-the-federal-hiring-process-and-restoring-merit-to-government-service/\n\nThe US government, under recommendations from DOGE, is going to solve the problems of HR and recruiting!\n\nThe lede was really buried here, with all the DEI news. They are going to get new tools, develop data driven processes, and get all hiring under 80 days. And prioritize patriotic hires.\n\nThere is not a popcorn bucket big enough to watch how this plays out. 🤣",
    "score": 229,
    "url": "https://reddit.com/r/recruiting/comments/1i6phqi/executive_orders_from_the_white_house/",
    "created_at": "2025-01-21T18:30:28.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1m90cw5",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Career Advice for Kristin Cabot from Astronomer or Coldplaygate [N/A]",
    "text": "Kristin Cabot resigned from Astronomer. Looking at her LinkedIn profile before it was taken down, she had quit a successful career. \n\nA lot of people think the CEO Andy Byron will easily be able to find another job again. \n\nHowever most people think Kristin career is dead and she will never be able to work in HR again. I think this is true as well.   \n\nIf you could give Kristin career advice to get back to work, what would you recommend? ",
    "score": 220,
    "url": "https://reddit.com/r/humanresources/comments/1m90cw5/career_advice_for_kristin_cabot_from_astronomer/",
    "created_at": "2025-07-25T14:17:10.000Z",
    "num_comments": 190
  },
  {
    "id": "reddit-1htr9pf",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Reason #3456 why I hate being a recruiter...",
    "text": "Received this from a person who was rejected in Application Review stage, no interviews conducted, no prior communications. He received a note the role has been filled. \n\nWhat kind of person says this? I know the market is rough right now, but like, I'm a human being? Wtf? \n\nUsually I let these roll off my back, but this one struck me as uniquely rude. \n\nI guess this is just a vent since I can't respond to him the way I'd really like to, and I'm a one person department so no coworkers to share the pain with. ",
    "score": 215,
    "url": "https://reddit.com/r/recruiting/comments/1htr9pf/reason_3456_why_i_hate_being_a_recruiter/",
    "created_at": "2025-01-04T23:14:26.000Z",
    "num_comments": 292
  },
  {
    "id": "reddit-1o7ktz2",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "I’ve been recruiting developers for 20 years and here are my secret hacks",
    "text": "I’ve been recruiting developers for two decades.\nI’ve sent thousands of emails, been ignored more times than I can count, and learned the hard way that developers aren’t like anyone else you recruit.\n\nThey don’t care about “competitive salaries,” they don’t want to “hop on a quick call,” and they can smell fake enthusiasm from across the internet.\n\nHere’s what I think I figured out.\n\n1. Learn just enough to not sound clueless.\nYou don’t need to code, but you do need to understand the difference between Java and JavaScript.\nYou need to know what frameworks actually do, and that “full stack” isn’t a personality trait.\nSpend one weekend reading beginner articles. It will save you hundreds of wasted conversations.\n\n2. Stop invading GitHub and Stack Overflow.\nThose are developer temples. They don’t want recruiters showing up there.\nIf you start “networking” in Stack Overflow comments, you’re not being clever - you’re being exiled.\n\n3. Go where you can actually learn from developers.\nYou don’t have to be technical to listen.\nPlaces like daily.dev and Hashnode are full of developers talking about what excites them, what frustrates them, and what they value in their work.\nLurk quietly. Read what they post. You’ll understand more about developer motivation in a week than any “technical recruiting course” will ever teach you.\n\n4. Be transparent. Always.\nStop hiding behind “competitive salary.”\nDevelopers appreciate straight talk…  about pay, about process, about company culture.\nEven if the range isn’t huge, honesty gets you respect. Vague gets you ghosted.\n\n\n5. Developers aren’t anti-recruiter. They’re anti-bullshit.\nOnce I stopped trying to “sell” roles and started having actual conversations, everything changed.\nAsk about what they’re building. Ask what they care about in a codebase.\nDon’t pretend to know everything just be curious.\n\nThe truth is, if you want to recruit developers effectively, you have to live where they live even if those spaces aren’t built for you.\n\nAnd if you can understand that, you’ll never need another sourcing hack again.",
    "score": 213,
    "url": "https://reddit.com/r/recruiting/comments/1o7ktz2/ive_been_recruiting_developers_for_20_years_and/",
    "created_at": "2025-10-15T19:35:20.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1n1abnv",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Changed my entire LinkedIn to Severance (Lumon Industries) as HR. [N/A]",
    "text": "I think it’s happened. Application #5,000 since my first layoff in ‘22. I have had roles here and there. I got really into Severance as an HR Consultant as it’s an interesting concept for late stage capitalism. I’m also fed up with my whole work history being advertised to recruiters or snoopy people. \n\nSo I decided with my free will to change my ENTIRE work history to reflect my positions over the last 15 years to Lumon language. So I am accurate on WHAT I did (just longer words) and changed titles to reflect what Lumon would put. I reposted with thoughts on Lumon’s actual LinkedIn page. Eventually (next week) I will add case studies to show my skills and how I think in relation to me working “at Lumon”.\n\nEither the person visiting my profile (linked from the resume which showcases the company I have worked for) will get the reference or be confused and jump down the rabbit hole. This is either the dumbest or most impressive thing I’ve done in my career. Either way, I’ve stopped caring because this job market is awful and I need a laugh so now I’m an Unsevered &amp; Severed Worker Capital Manager at Lumon. 🪄\n\nAt the very least, I’m doing something different and hopefully it showcases my humor. Plus I already changed my company email style to reply like I work at Lumon. I am interested in what this group thinks about this, did I destroy a 10 year work experience or did I do something that sets me apart in a good way? \n\nI’ll report back after 2 weeks, a month and quarterly. I’m not changing it back either, just gonna add on to it continuously. ",
    "score": 209,
    "url": "https://reddit.com/r/humanresources/comments/1n1abnv/changed_my_entire_linkedin_to_severance_lumon/",
    "created_at": "2025-08-27T07:15:04.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1mpxg91",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "How I Finally Nailed My Interviews",
    "text": "I've bombed more interviews than I'd like to admit awkward silences, vague answers, rambling, you name it. But after months of trial and error (and a lot of research), I finally got the hang of it. Here’s what I did.\n\nChannel your nerves into energy. Instead of trying to \"calm down,\" I'd use that adrenaline. Before every interview, I'd do a power pose for 5 minutes (yes, really) and repeat: \"This is excitement, not fear.\" It might sound cheesy, but this mental reframe is what kept me from freezing up.\n\nControl the post-answer panic. After you finish your answer, stop talking. Seriously. I used to ramble and would inadvertently undermine myself. Now, I count to three in my head before asking, \"Would you like me to elaborate?\" This gives the interviewer a sense of control and makes you seem collaborative.\n\nDebrief immediately.\n\nThe biggest lesson? Interviews are a skill, not a lottery. Treat it like a muscle work it consistently, and you'll get stronger.\n\nUpdate: I found another post talking about the same topic. I felt that the topic is common and that people need more advice on it.\n\n post Link : [https://www.reddit.com/r/interviewhammer/comments/1jz6pzt/want\\_to\\_pass\\_your\\_interview\\_interview\\_hammer/](https://www.reddit.com/r/interviewhammer/comments/1jz6pzt/want_to_pass_your_interview_interview_hammer/)\n\nAnd my final advice is, don't treat an opportunity as if it's the last opportunity of your life. On the contrary, even if you lose it, have faith that the right opportunity hasn't come yet and that the place that rejected you is not your place.",
    "score": 198,
    "url": "https://reddit.com/r/recruiting/comments/1mpxg91/how_i_finally_nailed_my_interviews/",
    "created_at": "2025-08-14T11:02:52.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1nxhthg",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "CEO Salary [N/A]",
    "text": "CEO Salary (N/A)\n\nI am the head of HR for a smaller company that grosses around 10 million a year. \n\nWe have 75 employees and my CEO who is also the founder and sole owner has been taking a salary of roughly 570 a week and is barely above minimum wage. He’s just about the lowest paid person in the company. \n\nHe is intending to start an employee stock program and feels he needs to make a legit salary but felt a conflict of interest deciding himself so he came to me.\n\nBecause he’s the sole owner and we have fairly thin margins it would seem a profit share doesn’t make a lot of sense. \n\nI don’t even know where to start but have found this community to be helpful. ",
    "score": 156,
    "url": "https://reddit.com/r/humanresources/comments/1nxhthg/ceo_salary_na/",
    "created_at": "2025-10-04T02:06:09.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1p851do",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Termination Emotional Roller Coaster [OH]",
    "text": "Well…it’s finally happened to me. I was terminated from my dream job on Monday. \n\nI have been in HR in some capacity for about 5 years, and was promoted VERY quickly when I took my most recent job in December of last year. Went from HR Generalist to HR Manager in 2 weeks, then promoted again about 5 months later. I was making more money than I’d ever made in my life, got into law school that the company was going to help pay for, and was making a real difference at my two sites. Corp HR called me when they needed help with things, I was on multiple project teams and felt true purpose in my career. \n\nAnd now it’s gone. \n\nBeing that Ohio is an at-will state, I got a very vague reason for termination. Mistakes were made by multiple people, and at the end of the day it’s easier to replace an HR Manager than someone higher up. \n\nI have had dozens of employees and supervisors reach out to me completely shocked and upset at the termination. I know I’m good at my job, but the feelings of inadequacies are running rampant. I was completely blind sighted and am kind of heart broken. I know I have to push forward and find the next thing, but I’m just struggling mentally. Knowing I’m going to go see my entire family in a few hours for Thanksgiving and will have work repeatedly brought up is giving me mini panic attacks. \n\nI’m not asking for anyone to fix it, but any advice would be appreciated. I feel really alone right now and it’s really difficult. I worked like 60 hours a week and gave my heart and soul to that place. Just sucks. \n\nThanks for listening, and Happy Thanksgiving if you celebrate. \n\nEdited to add: Happy to share that I accepted an offer this morning, have completed onboarding paperwork, and start Monday! Appreciate everyone’s support!",
    "score": 150,
    "url": "https://reddit.com/r/humanresources/comments/1p851do/termination_emotional_roller_coaster_oh/",
    "created_at": "2025-11-27T15:31:19.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1l2nuha",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Feeling burnt out in HR and second guessing my career choice. Anyone else? [n/a]",
    "text": " I need to vent and get some perspective. I’ve been working in HR in a manufacturing environment for quite some time, and I’m starting to really dislike it. I’m seriously questioning if this career is for me anymore, and I’d love to hear how others in similar roles cope or if you’ve made a switch.\n\nIt feels like HR is stuck in a no-win situation. Corporate always gets their way, employees are perpetually unhappy, and no one embraces change. People complain that systems, policies, or equipment are outdated, but when we try to update things? Cue the backlash. It’s like I’m constantly walking a tightrope, and no matter what I do, it’s never right.\n\nFor example:\n•  We raise pay, but it’s “not enough.”\n•  We give out appreciation gifts, and they’re called “cheesy” or “cheap.”\n•  We order food for staff, and somehow it’s still not enough or the wrong kind.\n•  We roll out a new policy, hold meetings, send emails, post announcements—yet employees claim they “didn’t know” and somehow it’s HR’s fault.\n\nManagers are no better. There’s zero praise, but they’re lightning-fast to point out what you did wrong or “could’ve done better.” They’re defensive, quick to blame HR, and love throwing us under the bus to save face. And don’t get me started on the newer generation of workers—entitled attitudes and lack of accountability make me dread what the future holds.\n\nTo top it off, we’re expected to be available at all times. I’m just over it. I feel like I’m pouring energy into a black hole with no appreciation or progress to show for it.\n\nSo, those of you in HR (especially in \nmanufacturing or similar industries), how do you deal with this? Is this similar to others experience ? Has anyone successfully pivoted to a different career path from HR, and if so, what did you move to? I’m starting to think this isn’t worth the stress, but I don’t know where to go from here. Any advice or stories would be super helpful. Thanks!",
    "score": 149,
    "url": "https://reddit.com/r/humanresources/comments/1l2nuha/feeling_burnt_out_in_hr_and_second_guessing_my/",
    "created_at": "2025-06-03T21:23:31.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1iziuvw",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "We're hiring: Senior HRBP (mod approved) [N/A]",
    "text": "Hi friends,\n\nSenior Recruiter here. I reached out to the mods to ask permission to make this post, which they gave.\n\nMy company, a mid-size (but fast-growing) firm in the industrial supply chain industry, has created a new role for a **fully remote Senior HR Business Partner**. I've been on this sub for a while, and get a lot of value from it, so I thought I would see if any of my colleagues/peers are looking and might be a good fit for the role.\n\nI'm thinking the best way to reach out to me is by sending me a private message here on Reddit. We can then coordinate email addresses and chatting from there.\n\nI'd like to maintain a bit of personal anonymity in this posting so I won't include the full JD (I can send that later of course). But here is the specific experience we're looking for:\n\n✅ **Strategic HR Leadership** – Working with **VPs and above on workforce planning, leadership development, and culture transformation**.\n\n✅ **Talent Management &amp; Development** – Running **succession planning, talent reviews, and performance management** (e.g., 9-box, talent mobility).\n\n✅ **Organizational Design &amp; Change Management** – Partnering with leadership on **organizational transformations, restructuring, or M&amp;A-related HR initiatives**.\n\n✅ **Data-Driven HR Decision Making** – Using **HR metrics and KPIs** to drive talent strategy, engagement, and retention.\n\n✅ **Collaboration with Centers of Excellence (COEs)** – Partnering with **Talent Acquisition, Compensation, Learning &amp; Development, and DEI teams**.\n\nBenefits are solid, and salary is fluid for the right person - but will be around the low to mid $100s.\n\nThere are a lot of talented, experience HRBPs out there who have focused more on the process/benefits/legal side of HR, but that's not what we're searching for here. We need someone with solid strategic people/org/talent/workforce experience.\n\nHope that makes sense. I'll try to answer questions in the comments, but best to reach out to me directly if you're interested. Thanks all!",
    "score": 144,
    "url": "https://reddit.com/r/humanresources/comments/1iziuvw/were_hiring_senior_hrbp_mod_approved_na/",
    "created_at": "2025-02-27T15:49:40.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1m3gmwu",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "What’s a piece of career advice you didn’t understand at first… but now totally get? [N/A]",
    "text": "Now that I’m a bit deeper into my role, I’m realizing how much of this job (and honestly, adulthood in general) involves learning lessons the hard way or finally understanding things people told you years ago.\n\ni.e.: *“It’s better to ask questions than to pretend you know.”* Took me forever to accept that one and now I live by it.\n\nCurious to hear yours. What advice didn’t click until later on in your career?",
    "score": 134,
    "url": "https://reddit.com/r/humanresources/comments/1m3gmwu/whats_a_piece_of_career_advice_you_didnt/",
    "created_at": "2025-07-18T22:58:46.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1ibnuqa",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Is the HR field getting extremely competitive? Unemployed for too long. [N/A]",
    "text": "Hi everyone! \n\nI’ve been job searching for over 5 months now actively. I got laid off. I’ve been laid off twice since graduating ( with my HR degree). The amount of rejections I’ve gotten over the past year is so disheartening. I’ve been interviewing non stop, applying non stop. I’m getting job interviews but then just getting rejection after rejection after rejection. I have great experience working at big tech firms out of college &amp; I’ve been told I am good at HR. I am trying my best. I am early career still and just want someone to give me a chance. But I feel I’ve hit my breaking point. I don’t think I can continue like this any longer, I don’t understand why HR has become so competitive? I can’t even land contract entry level roles. I’m watching people in my life progress in their careers and easily get jobs while I’ve been laid off twice already &amp; can’t get a new role at all. \n\nGenuinely wondering if I’m alone? Is this something only I’m going through? I’m considering switching career paths entirely. ",
    "score": 132,
    "url": "https://reddit.com/r/humanresources/comments/1ibnuqa/is_the_hr_field_getting_extremely_competitive/",
    "created_at": "2025-01-27T23:43:51.000Z",
    "num_comments": 180
  },
  {
    "id": "reddit-1jqvwh4",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Human Resources here is a nightmare [CA]",
    "text": "I just wanted to say that working in Human Resources in California is an absolute nightmare. It seems like every single employee and their mother will sue. I have had 3 cases we have been dealing with this year alone which all get settled by insurance since its cheaper than having a litigation. One employee we are currently dealing with the is type of person who is offended by absolutely everything. I have already warned my boss about her, and let him know we should figure a way to push her out. She is currently writing a list of all the employees who have discriminated against her. All of her claims of discrimination have been usually about conversations she has overhead two employees having such as \"you know how I bro, the Mexican way\". I am about done with this career. ",
    "score": 128,
    "url": "https://reddit.com/r/humanresources/comments/1jqvwh4/human_resources_here_is_a_nightmare_ca/",
    "created_at": "2025-04-03T22:13:17.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1j80v15",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "When the Grass Isn't Greener: My HRBP Interview Horror Story [United States]",
    "text": "For anyone job hunting—whether you’re unemployed or looking to leave your current role—let this be a reminder: **not every opportunity is worth taking.**\n\nI recently interviewed for what seemed like a **great** HRBP role. The company employs both trade workers and corporate employees, and my first interview with their HR consultant (acting as their current HR POC) went fantastic. The role sounded promising, and I thought I had found something solid. Then came the second interview… and it quickly became one of the worst interviews I’ve ever had.\n\nInstead of focusing on my qualifications, the hiring manager spent most of the conversation listing her concerns about hiring me: *“The 30-minute drive through the tunnel—you’re looking for a new role because you’re moving, but this commute isn’t right around the corner either.”* And then: *“You haven’t worked with trade workers before, and they can be really difficult. For example, I just got an email with the subject line ‘JAIL’ and no other information from the manager. We’ve been trying to get more details for two days and still haven’t gotten a response.”*\n\nBut the real kicker? She then started telling me about how the last HR person left because the workload was too much, and didn’t like that she asked so many questions (due to being analytical and numbers driven) and relied heavily on spreadsheets.\n\nShe even admitted: *“I don’t want to be on any HR emails. I don’t want to touch HR. I don’t know HR, which is why we’d be hiring you.”* Oh, and when I shared an example of how I led a benefits brokerage switch at my current company (to find a more data-driven provider (and trying to tie that into her comment about being analytical and into numbers)), she **asked me for the names and contact info** of my brokers… just in case they wanted to switch too. 🚩🚩🚩\n\nThe job was advertised as an **HRBP role**, but in reality, it’s an **HR team of one** with zero support. It was also advertised as fully remote, but I found out today that it’s actually in-office **2-3 times a week**, with required travel to worksites across **three states every quarter**. On top of that, they’re currently dealing with a **Paylocity reconciliation nightmare** because financial calculations are off.\n\n**The salary range? $89K-$110K.** But trust me—it’s *not worth the headache.*\n\nThe interview ended with her saying: *“I’m going to schedule the next round interview for Wednesday, which is a panel interview. But I’m going to say this in a non-HR way—I want you to think about the two concerns I listed and see if you really want this role, because this will be very different for you. The last thing I want is for someone to come onboard, realize this isn’t what they expected, and then leave.”*\n\nIf you’re actively looking for a job, **don’t let the paycheck or title fool you.** Not every opportunity is the right one, and some roles can do **more harm than good** for your career. I walked into this process thinking I’d found something great… but by the end of that second interview, I knew I had dodged a bullet.\n\nHR pros—what’s the worst interview experience *you’ve* had? Or have you ever been blindsided by a role that sounded amazing at first?",
    "score": 127,
    "url": "https://reddit.com/r/humanresources/comments/1j80v15/when_the_grass_isnt_greener_my_hrbp_interview/",
    "created_at": "2025-03-10T15:11:22.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1l96xid",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Senior HR folks: What trends or certifications are actually worth focusing on in 2025? [MD]",
    "text": "Looking to gather some insight from experienced HR professionals on where the field is headed this year.\n\nA few patterns I've noticed keep coming up in job posts — especially for higher-comp roles ($90k+):\n\n• Strong preference for Workday experience\n\n• Increased demand for total rewards/benefits professionals\n\nWould love your take on:\n\n1. What functional areas in HR are most in demand right now?\n\n2. Are generalist roles losing ground to more specialized tracks (like comp/benefits or HRIS)?\n\n3. What certifications (besides SHRM/PHR) are actually helping people stay competitive, especially early career or people new to the HR industry. \n\n4. What tools, skills, or trends are essential to stay relevant in 2025 and beyond? \n\nNot looking for a personal evaluation — just trying to get a pulse from people deeper in the field. Appreciate any insight you’re willing to share!",
    "score": 121,
    "url": "https://reddit.com/r/humanresources/comments/1l96xid/senior_hr_folks_what_trends_or_certifications_are/",
    "created_at": "2025-06-11T23:00:56.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1jb2m69",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Former Recruiter with some Advice for Those Looking for Work",
    "text": "Like many recruiters, I’ve been through the ups and downs of the industry—three layoffs later, I knew I needed a change. But I didn’t want to throw away nearly two decades of experience in both agency and corporate recruiting. I wanted something that still allowed me to help people get jobs, work with employers on hiring strategies, and make an impact in the world of work.\n\nThat’s when I discovered workforce development within economic development organizations—a sector that desperately needs talent strategy expertise. Now, instead of filling individual roles, I work on building entire talent pipelines, advising major employers on recruitment best practices, and developing strategies to retain workers in local economies. I still leverage my recruiting skills every day, just on a broader scale.\n\nHere’s why recruiters should consider pivoting into this space:\n\t1.\tThe Need is Huge – One of the biggest pain points for economic development organizations is talent attraction and retention. They often lack people with direct hiring experience who understand how companies truly operate. Your expertise is highly valuable in helping cities, regions, and states solve workforce challenges.\n\t2.\tYou Still Get to Help People Get Hired – Instead of working on one-off roles, you’ll be designing long-term strategies to connect people with jobs and create sustainable career pathways.\n\t3.\tYou Can Influence Employer Practices – Many employers struggle with outdated hiring methods, poor candidate experiences, and retention issues. In workforce development, you can advise them on better recruitment strategies, DEI hiring, and how to treat employees right—impacting thousands instead of just one hire at a time.\n\t4.\tIt’s a Stable and Meaningful Career Path – Unlike corporate recruiting, where hiring freezes and layoffs are common, workforce development roles are often publicly funded or backed by major economic initiatives, providing stability while making a real difference.\n\nIf you’re a recruiter looking for your next move, check out roles in workforce development, talent strategy, or economic development organizations. Your experience is needed more than ever.\n\nHappy to answer questions for anyone curious about this path.",
    "score": 120,
    "url": "https://reddit.com/r/recruiting/comments/1jb2m69/former_recruiter_with_some_advice_for_those/",
    "created_at": "2025-03-14T12:21:43.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1koksyn",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Accepted New Job Offer! Wrapping Up my 9-Month Adventure [IL]",
    "text": "Hi Everyone!\n\nI just accepted a new role and wanted to share my experience trying to find a job in this market in the Greater Chicago Area. Sorry for the long post in advance; TL;DR at the bottom.\n\nIn September 2024, I decided it was time for a change from my HRIS L&amp;D role. Over 6.5 years with the company, I progressed from HR Assistant (non-exempt) to HR Associate (exempt, with expanded responsibilities and a salary adjustment), and eventually to HRIS L&amp;D Specialist—where I led projects in system implementations, integrations, reporting, and more; however, at this point I was not being given further opportunities to grow; changes in management also turned for the worse - my time was up, it was time to go.\n\nHaving been looking for 3 months already, I had a good idea of how tough the HR market is. I was really close to an offer for HRIS Specialist end of October, however after receiving a verbal agreement, I got a call from the recruiter saying that due to recent budget meeting, the company decided not to move forward with a full-time role, but they could offer me a 12-month contract with potential for full time next year. I declined, as I did not want to be in a contract role, while I was still employed full time (oh, the irony!!!)\n\nI was laid off beginning of December 2024. Received a laughable severance package with 2 months of pay and eligibility for unemployment - 8-month time frame to find a new role.\n\nIn a normal market, around 75% fit/compatibility between the job description and your experience could land you an interview. Understanding the market a little better now, I knew I needed to focus on roles that fit at least 90-95% - this left me with HR Generalist roles, or much more preferred HRIS Management.\n\nHR Generalist roles were a long shot (with little recruiting and ER experience), but I did find few good fits and even landed a few interviews.\n\nI had much better luck with HRIS Specialist roles, however I soon found out that my extensive experience with ADP was becoming a hurdle - majority of posts looking for HRIS roles look for either UKG, Workday, or Dayforce with 2/3+ years of experience (who knew such a big player as ADP has been falling so much out of favor in the industry). My saving grace was familiarity with project management and implementations of various systems (LMS, ATS, reporting, etc.) and flexibility learning all of them.\n\nI kept applying in the morning, after coming back from the gym around noon, and usually checked around around dinner time. With over 100 applicants withing an hour posting, I had to make sure I submitted my application as early as possible (I mainly used LinkedIn for my search, so I could see how many people applied). There were good weeks where I applied to 5-6 posts (yea, I realize that seems like nothing, but I really wanted to focus on the 90-95% fit), to weeks where I literally applied to none - those weeks were the most discouraging.\n\nBut February came, and I connected with a recruiter after seeing a post for HRIS Specialist that felt like a perfect fit (they even used ADP - wow!!). Phone screen, then 1st interview with the team at the company, then (not so quickly) on-site meeting with Hiring Manager - everything was going well and they invited me for a meeting with CHRO. Upon the meeting with CHRO, the hiring team told me in no uncertain terms \"You are our guy, we want to bring you on - meeting with CHRO is just a formality\". Discussion with CHRO went well, and I was told to look out for an email within a week after approvals go through. 1st week - nothing; 2nd week nothing; beginning of the 3rd week, after I sent emails about still being interested in the role, I got a call from the recruiter telling me that the CHRO decided to move the role to IT.\n\nI was devastated.\n\n1st - the verbal agreement; 2nd - at this point jobs were really drying up, especially in HRIS space; 3rd - I was interviewing for another role at non-profit, and even though I didn't think it would have been a good fit, I was also passed for that role.\n\nAfter being so excited for the company and the role, 99% certainty that you will land the job - back to square one.\n\nGetting back into the groove was hard and my application rate fell as the time moved on. Time was ticking and prospect were low. I started working with more recruiters (those can be hit or miss, often it just seems like they talk to you to work toward their quotas, not help you find a job) and started looking at contract jobs. I also started applying to roles that I was way overqualified for - HR Assistants and Coordinators (I feel like those jobs are even harded to land, because employers know you will be looking for a higher pay and they don't want to hire someone who may leave soon, if they find something better; they want a newbie).\n\nFinally, mid-March came and another role for HRIS Specialist that was a little outside of my commute range showed up, but I needed to broaden my net. Reached out directly to the job poster (love LinkedIn for giving me that contact information), shared my resume, and a week after we connected for a phone screen. Then 1st interview with Hiring Manager - recruiter sent me an email with what to expect for the call, and I NAILED it. About 2 weeks after, I was scheduled for 2 panel interviews - this one was a bit tougher, but all the questions landed really nice and I was ready for them. Another 2 weeks and the recruiter reached out to schedule me for a final, on-site, interview. Again, I was very happy with the recruiter, as he sent me an email with what to expect and areas to improve - biggest help and I cannot be more grateful for it.\n\nThe final interview was on Monday. Thursday evening I received a call from the recruiter letting me know that he is happy to say that I am being offered the role. Verbal agreement for now, again. Being burned twice before, I was cautiously optimistic and didn't want to get too excited before I see something in writing. But it came - I got the offer; more than that, it was top of their pay range for this role. \n\nI spent some time on the phone with the recruiter, and I really wanted to know what separated me from other candidates. 1) Experience with systems, project management, and implementations, 2) Fit with the team. Turns out I was their top candidate from the get go.\n\nAs I am writing this, I signed the offer, passed the reference check, and the background check. Starting mid-June. I have one more month to actually enjoy myself while on unemployment.\n\nSearch lasting September 2024 through May 2025. 131 applications and it feels like just as many rejections.\n\nI do not have any groundbreaking take-aways from this search. This process is not something I want to go through again any time soon. The reason why I wrote this all out is, partially, because I am slowly decompressing from the stress of it all, but also because I feel for everyone in a similar situation.\n\n\n\nI do, however, have few points that I can share with everyone:\n\n\\- Pay range for HRIS Specialist roles around Chicago will be anywhere between 70-90k (thanks to the new law in IL requiring to post the pay range)  \n\\- Recruiting process will take a long time in this market - 1 to 2 months from first contact to offer letter  \n\\- Recruiters can be a resource, but it's 50/50  \n\\- LinkedIn was a great tool in my search; filter job search for posts in the last 24 hours and check at least twice a day to be one of the first to apply  \n\\- If using LinkedIn, reach out directly to the recruiter or job poster if their information is included with the job  \n\\- A lot of the jobs on the market are \"hidden\"; meaning you have to go directly to the employer's career site and check what is available there. It takes a lot more effort but can be worth it.\n\n\n\nTL;DR: Started looking for a job in September 2024; Laid off in December; 2 verbal offer letters were rescinded; accepted HRIS Specialist Role in May, and starting in June; job market BAD.",
    "score": 116,
    "url": "https://reddit.com/r/humanresources/comments/1koksyn/accepted_new_job_offer_wrapping_up_my_9month/",
    "created_at": "2025-05-17T04:44:56.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1lgsj0i",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Advice for young people in HR [N/A]",
    "text": "I started my HR journey pretty early during uni, and I’m now about two years out. I’ve been lucky (and also worked hard) to get to a solid position with a salary I’m proud of — especially for my age. But here’s the thing… I’m not sure if I’ve progressed too quickly or if I simply don’t love HR, but I find myself fluctuating between two extremes:\n\n- One day I’m super motivated, wanting to pursue a Masters and dreaming about climbing the ladder and eventually becoming a HR Manager.\n\n- The next day I feel completely lost, meaningless, overwhelmed, or like I don’t belong in HR. \n\n- Some days I feel like an imposter, and others I question whether I even want to stay in this field long-term.\n\nAnd then there’s the classic “HR is the most hated department” sentiment that makes you feel like you’re useless.\n\nI want to ask those who have advanced in their HR Careers: \n1. What advice would you give to someone young in their HR career who’s still finding their way?\n\n2. How do you stay motivated, grow in your role, and figure out if HR is truly the right fit?",
    "score": 113,
    "url": "https://reddit.com/r/humanresources/comments/1lgsj0i/advice_for_young_people_in_hr_na/",
    "created_at": "2025-06-21T09:27:14.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1m5u7as",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "How to communicate with employee that they won't get a raise they asked for [N/A]",
    "text": "Had an employee ask for a raise. Basically went to salary.com and saw that it has her job title making 100k+ a year. Which I tried telling her can be misleading. We work in non profit world and she knows wages won't be that high. \n\nWe already pay her hourly because her role requires a lot of hours. No one would stay in it. She is the highest paid manager in our organization. She wants an extra $4 an hour.\n\nBut either way, I ran it by out executive director and nope, nothing will be given. \n\nWhat is the best way to break the news to someone that is respectful. I know I can talk about not being in budget but I want to make sure I deliver it in way that is reasonable and doesn't sound like I am making shit up. \n\nThis is commonly a touchy subject. Any advice when delivering news like this?\n\nUpdate- thank you for those of you that offered helpful actionable advice. I had a pleasant conversation with her and we were both respectful. She may decide to leave in the near future or not. Either way, that will be my problem and my organization's problem to figure out. Either way, it was out of my control to make the increase. \n\nI wish I had phrased my post differently. I was being a bit hyperbolic saying no one wants this job. We have had several managers over the years. Some did better than others. One did a fairly good job but decided to sleep with one of her direct reports. \n\nFor the record, I know my organization pays poorly. Every agency in the area, like ours, pay poorly. Many have shut down. I have very little to no control over wages or setting the budget. \n\nIf you all want to help, write your senator and congress people to support increases to Medicaid reimbursements. \n\nMy organization helps clients with mental and developmental disabilities live independently. Some have family and guardians that financially support them. Many do not. Either way, we are paid through Medicaid to support them. Just to give an example, our clients receive funds for food and certain basic goods such soap, shampoo, laundry detergent, etc. The amount adds up to roughly $3 a day, for three meals and their basic goods for the month. So the agency eats a lot of cost in that regard unless a lot food is donated. \n\nMedicaid increased their reimbursement rates for the first time in around 10 years roughly two years ago. It helped, wages have increased quite a bit in the last several years, but are still low. We are working on ways to make organizational changes to help increase wages. \n\n\n\n",
    "score": 111,
    "url": "https://reddit.com/r/humanresources/comments/1m5u7as/how_to_communicate_with_employee_that_they_wont/",
    "created_at": "2025-07-21T20:34:42.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1nxtt6t",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Best benefits at your company? [N/A]",
    "text": " We’ve talked about salary progression time and time again in this subreddit. I want to hear about the best or your favorite benefits at your current employer.\n\nI’ll start:\n- 12% 401(k) match\n- Weekly PTO accrual\n- $100/mo lifestyle spending account",
    "score": 111,
    "url": "https://reddit.com/r/humanresources/comments/1nxtt6t/best_benefits_at_your_company_na/",
    "created_at": "2025-10-04T13:19:43.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1kl6r4e",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "After 17 years in HR, I am done. [CA]",
    "text": "I’m going back to school to pursue a career change. For the past few years, I’ve worked in nonprofit HR, and while I’ve gained a lot of experience, I’m completely burned out and uninspired. I’ve become the organization’s catch-all—anything that doesn’t clearly belong to someone else ends up on my plate. It’s stifling, and the ongoing funding issues tied to the current administration have left me in a career holding pattern with no clear path forward.\n\nWhen our Executive Director left, I stepped up to fill the gap for the past 16 months. While I’m compensated fairly for the my field, the workload is unsustainable. HR in a small team means being involved in every department, which makes it impossible to focus or grow. I’ve stopped learning and feel stuck.\n\nMy manager(board president) seems to think assigning me more tasks—mostly busy work—helps, but it’s only building resentment. I’ve spent the last year constantly rewriting job descriptions as roles continue to shift, and with the board directly overseeing staff, I’ve essentially become a glorified assistant to the president and treasurer. While my role is critical, it’s also limiting. There’s no room for me to evolve, and I can’t see that changing anytime soon.",
    "score": 110,
    "url": "https://reddit.com/r/humanresources/comments/1kl6r4e/after_17_years_in_hr_i_am_done_ca/",
    "created_at": "2025-05-12T23:02:38.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1kn8zmb",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Staffing is Not Social Work",
    "text": "Just a rant that I’m sure a lot of my fellow staffing recruiters and recruiting managers can relate to. Something that really annoys me is when candidates waltz into my office thinking we owe them a job or we work to find them a job, no matter how shitty their experience may be or how underqualified they are. I’m not a social worker or even a career coach, and I am certainly not here to fix your life and your poor choices. I work to serve my client and provide them with quality. I’m not sure why people feel so entitled to a job when they walk into a staffing agency and have the audacity to mouth off when we politely tell them we don’t have anything that matches their experience. It feels great to help people out who deserve it, but I can’t say I feel bad for the ones with an attitude and 0 skills. I think one of the biggest things I’ve learned in my career is that not everyone can be helped 🤷🏻‍♀️",
    "score": 110,
    "url": "https://reddit.com/r/recruiting/comments/1kn8zmb/staffing_is_not_social_work/",
    "created_at": "2025-05-15T14:02:13.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1kxnvh4",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Since the HR Job Market Sucks So Bad... [N/A][Stupid/Sarcastic/Just for Fun]",
    "text": "I have seen a few posts for folks asking for advice on making a career change to HR - welcome! Happy to have you in the field! However, I know a lot of us who are a little more seasoned are looking for new gigs and finding that the market is ROUGH. So I thought - what are some jobs we can take our transferrable HR skills into?? Some initial ideas:  \n  \n**Corporate Fan Fiction Writer:** I have many great ideas about how we should run this business, but the executive board isn't listening to me - but maybe Wattpad will!  \n  \n**Actual Animal Herder:** We've been herding cats for years, why not cows? Yes, this job is usually filled by a dog but not hiring me just because I am not a dog is SURELY disparate impact!\n\n**Cult Recruiter:** Not that diff if you've worked in big tech!\n\nObviously this is all stupid and sarcastic, but it's also keeping me from going insane while getting endless rejection emails. Would love to hear your thoughts - and everyone out there looking for their next HR role, keep your head up!",
    "score": 105,
    "url": "https://reddit.com/r/humanresources/comments/1kxnvh4/since_the_hr_job_market_sucks_so_bad/",
    "created_at": "2025-05-28T18:00:25.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1k334ne",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Apart from Chat GPT what are some good AI Tools that HRBP can utilize for all the HR lifecycle activities apart from Recruitment? [N/A]",
    "text": "Hey guys!!\n\nThe last couple of years or so in my career I’ve been using ChatGPT for a bunch of things and it’s been really helpful — but I’m also curious to explore other free or low-cost AI tools out there that HRBPs like me can use (apart from recruitment). In areas such as Performance management, Compensation, Talent management, Employee engagement &amp; Change management etc.\n\nWould really appreciate your suggestions if you guys have come across any such tools.",
    "score": 102,
    "url": "https://reddit.com/r/humanresources/comments/1k334ne/apart_from_chat_gpt_what_are_some_good_ai_tools/",
    "created_at": "2025-04-19T18:38:29.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1o6he56",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "My company just started covering external career training, how other HR teams handle this [N/A]",
    "text": "I work in HR at a mid-sized company, and we recently launched a program where employees can take online courses or degree programs completely paid for by the company, as long as it’s even loosely tied to their role or career growth, we're using a company called Guild. We’ve been talking a lot about retention and internal mobility lately, so this felt like a practical step in that direction.\n\nI’ve been helping coordinate the rollout setting up approval workflows, making sure managers understand what counts as “career-relevant,” and tracking engagement. What’s surprised me is how many employees have jumped on it right away. We’ve had people from operations enrolling in management courses, IT staff taking cybersecurity certificates, and even some warehouse employees starting business degrees.\n\nIt’s honestly one of the more rewarding HR initiatives I’ve worked on in a while. It feels like we’re not just hiring and replacing people but actually helping them grow into their next role.\n\nI’m curious  do other HR teams here offer something similar, like tuition assistance, paid certification programs, or structured learning benefits and how they handle it. I personally feel like even if you're an experienced HR you still need a training as a refresher (a refresher course?).",
    "score": 102,
    "url": "https://reddit.com/r/humanresources/comments/1o6he56/my_company_just_started_covering_external_career/",
    "created_at": "2025-10-14T14:42:18.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1ihrwbx",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "[NY] 2 employees overpaid since 2023",
    "text": "How would YOU handle this? Just discovered that 2 employees were paid double since 2023.\n\nThey're Sales- while in training they get a $70k salary, then when on their own it's $35k, since they'll be earning commissions.\n\nTheir titles were changed at the time but not their pay, so they've been getting the $70k since.  \n\nI'm aware of the legal guidelines, but I'd like to hear how your company would handle this otherwise- we will likely forgive and forget 2023 and start from last year.\n\nAlso, I'd love to hear if you have anything in place that would have caught this. The pay is relatively low so it wasn't noticeable in our systems with 400 employees.  I feel like we spend so much time going over payroll items and we have a lot of checks in place, but we're not sure how we can be alerted to such a scenario in the future.",
    "score": 97,
    "url": "https://reddit.com/r/humanresources/comments/1ihrwbx/ny_2_employees_overpaid_since_2023/",
    "created_at": "2025-02-04T20:41:33.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1kihy8u",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "How is posting salary ranges working for everyone?",
    "text": "My company started publicly posting salary ranges for all our jobs about 6 months ago, and for the most part it's been great. One hiccup we keep seeing though, is maintaining internal equity and still bringing on happy new hires. I'm going to change exact numbers in the following example, but something we're going through right now is the following:\n\nRole was posted as 70-90K\n\nFinalist was selected\n\nFinalist has 3 years of experience\n\nEmployee at the company in a similar role has 6 years of experience, makes 80K\n\nFor internal equity purposes, leadership is pushing to offer the new hire 70-75K\n\nI don't foresee a huge problem here, it's just always kind of a bummer for candidates to feel like they're being low-balled at the last minute. My question to you all is - do you have some sort of internal system for getting out ahead of this? Like identifying peers at the top and bottom of the range as part of the intake so there are no surprises at the end? I'm trying to think of the most efficient way to do this.\n\nNo mean answers, please. I'm asking this question in good faith and genuinely trying to do the right thing by everyone involved. Looking to see how others in this situation have handled similar.",
    "score": 97,
    "url": "https://reddit.com/r/recruiting/comments/1kihy8u/how_is_posting_salary_ranges_working_for_everyone/",
    "created_at": "2025-05-09T13:02:39.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1onxyyn",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Hard-Learned HR Lessons [N/A]",
    "text": "TIFU by oversharing salary market data (I’m an HRBP) with a senior director. I realized I was being too transparent but only after the damage was done. This sr director was pissed and involved  his VP, then the CTO. It all happened so fast I didn’t even get a chance to explain. My manager and I had a really good constructive conversation about it, so lesson learned. But it didn’t stop the CTO lecturing me in a group setting. Completely uncalled for but still, ugh. \n\nWhat are your hard-learned HR lessons so I can feel better about mine??",
    "score": 94,
    "url": "https://reddit.com/r/humanresources/comments/1onxyyn/hardlearned_hr_lessons_na/",
    "created_at": "2025-11-04T04:17:41.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1pkzfay",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Job Market [N/A]",
    "text": "Folks. I can’t even. I just had a recruiter reach out with a role that is so bananas, I’m laughing (and crying). \n\nIn person, either Boston or NYC a min of 3 days.\nMust have significant employment law, payroll and compensation, and employee relations experience in both the US and the UK.. \nThey want someone with deep organizational development and L&amp;D experience. \nBy the way, you’d also be the de facto Office Manager: responsible for keeping the offices organized, well stocked and you’re managing office suppliers and furniture, etc. \nFinally, you get to be a party planner too! Fun! \n\nAll for the very competitive salary of $75k per year.\n\nJust ping me for a referral! 😅",
    "score": 90,
    "url": "https://reddit.com/r/humanresources/comments/1pkzfay/job_market_na/",
    "created_at": "2025-12-12T18:32:52.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1piyqqi",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "My boss complains I can’t hire… but the salaries are a joke.",
    "text": "Recently I’ve been trying to hire for a position… and honestly, it’s been a disaster. My boss just blamed me for this more than once. But come on, the salaries he’s offering are super low. I found someone’s willing to take the pay, but he complains they’re not skilled enough. But the actually good one, well… the salaries they want are too high for him. Basically, it’s impossible to win.\nHas anyone else worked somewhere where hiring felt literally impossible? How did you handle it?",
    "score": 88,
    "url": "https://reddit.com/r/recruiting/comments/1piyqqi/my_boss_complains_i_cant_hire_but_the_salaries/",
    "created_at": "2025-12-10T09:56:24.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1otlfjv",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Can someone explain to me what is considered \"being strategic\" in HR means? [NY]",
    "text": "I've had several interviews now that basically end because I'm not \"strategic\" enough. Unfortunately the company I'm at is a rigid Asian company where they basically have the Asian office make all the decisions and they are just trickled down to our office in the US so not only me but even my managers in the US have little say to make changes. The company is also downsizing so I don't even have the OPTION to be strategic because everything will be responded with \"the parent company has no money\". So now I'm applying to these HRBP jobs and they are making it seem like my 17 years in HR is the equivalent of mopping toilets in a school bathroom.\n\nI've tried to spin strategic stuff by mentioning some improvements I've done to the HR department like\n\n1. Implementing digital time &amp; attendance system (cause this company was using paper time sheets for 30 years)\n2. Taking over as an HR department of one after my HR director boss ragequit (I don't say ragequit but that's basically what it was)\n3. Researching salary surveys and creating reports to try to make sure we are comparable in our salary offerings (even though the company has 0 intention to pay people properly)\n4. Negotiating benefits with our brokers to make sure that they align with our culture and our staff in terms of what's easier and more seamless for them to use (since a lot of them don't speak English well.)\n\nNone of this is what anyone I have spoken to considers strategic. I don't understand where to even go from here. The worst part is some of these interviewers are telling me \"well maybe down the line you'll get more strategic experience in a few years....\". I won't. I have been at this company for 14 years. They will not change that's why I am trying to leave. It feels really insulting and at this point I'm at my wits end on what \"being strategic\" even means.\n\nI was under the impression when you join a company, you will find out what they are looking for and get to know their culture and ways and from there you'd plan and see how to strategize in filling in gaps or improving things as you go. I thought making \"big financial decisions\" for the company is for like VP/CEO level roles not some HRBP?? Just want some advice. I know the job market sucks but I'm running into this issue a lot and I feel completely lost.",
    "score": 84,
    "url": "https://reddit.com/r/humanresources/comments/1otlfjv/can_someone_explain_to_me_what_is_considered/",
    "created_at": "2025-11-10T18:19:03.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1mnoisq",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Finally got an offer for a role I’m excited about AND seems to be a great company, but salary was SO SO low [United States]",
    "text": "I left my last role in March due to moving (got married). Live in Virginia. I’ve turned down three offers so far, and I finally got one I was really excited about. Don’t yell at me for turning down the previous offers - they were all because of hostile-seeming work environments or bait-and-switch situations on offers, titles, or salary.\nI’ve basically spent the last six years in Human Resources as a generalist/manager, and I want to make the switch to HR technology. I applied for a role at a benefits brokerage and got an offer for an HRIS Technology Specialist position - essentially building HR technology platforms for internal teams and meeting with clients to go over integrations for the benefits technology.\n\nI was making $90,000 in my last role, and I made it clear when I applied that my previous salary was $90,000 a year. Honestly, I expected that if I got an offer from this company, it would be in the $75–$80k range. Instead, I get a call from their HR person today, and they tell me they’d love to have me on board and really enjoyed our conversations, but then they offered $65,000 a year.\n\nI’m really torn because I loved the place and the people I interviewed with, but that much of a salary cut feels like it would set me back in my career. I also feel like the job market is really tight, and maybe I should just take something, even if it means making that much less. Based on my interview experiences since being unemployed, it feels like the healthiest work environments are paying the least—or you have to get into a large corporation to get the higher salaries. And if you want a decent salary at a healthy workplace, they seem to be lowballing candidates.\n\nI don’t even understand why they’d offer $65,000 when they knew I was making $90k base plus $5–10k in bonuses. I feel like if I keep turning down positions, I’m not going to find anything, and I’ll be unemployed even longer. But I also don’t want to look like a job hopper , taking this position now and then leaving a few months later.\n\nThoughts? Should I take it?\n\nEDIT: I countered $75,000. The countered $65,000, profit sharing, and $10,000 signing bonus. I have accepted the offer (though still disappointed where I landed). But plan to take everyone’s advice and to keep looking. Thanks for everyone’s input. ",
    "score": 83,
    "url": "https://reddit.com/r/humanresources/comments/1mnoisq/finally_got_an_offer_for_a_role_im_excited_about/",
    "created_at": "2025-08-11T20:40:26.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1nll7vo",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "What’s the fastest way to good money in HR? [N/A]",
    "text": "I just started my HR career as an HR assistant, and I’m wondering what the most efficient route to making good money is in HR. I took a huge pay cut when moving into HR, but it was what I wanted, so I felt it was worth it. I know I can’t just snap my fingers and make six figures, but I’m wondering what the best path to a higher end salary would be in this field. ",
    "score": 79,
    "url": "https://reddit.com/r/humanresources/comments/1nll7vo/whats_the_fastest_way_to_good_money_in_hr_na/",
    "created_at": "2025-09-20T01:23:34.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1iqqx8m",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "The feeling of defeat after a job rejection [CA]",
    "text": "Made the mistake of getting too attached to a HR Generalist job that I interviewed for. Nice benefits, 60% raise from my current salary, bonuses, potential for promotions and seems like a great workplace culture. \n\nWhen I saw the automatic rejection email, I was gutted and had to bawl my eyes out in the work bathroom. I really thought this was it. I got a second email from the recruiter personally saying the HR team thanks me immensely for my time and how it was a tight race. The “tight race” made me cry even more! \n\nThat was last Wednesday. Cried it all out since, picked myself back up, reflected on what I can improve on and applied to more jobs since than. \n\nI keep all my rejection emails in a separate inbox folder as a reminder of how far I have come. :’) \n\n\n",
    "score": 78,
    "url": "https://reddit.com/r/humanresources/comments/1iqqx8m/the_feeling_of_defeat_after_a_job_rejection_ca/",
    "created_at": "2025-02-16T12:11:19.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1lb97g7",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Help me bust the ATS/AI myth",
    "text": "Agency owner and specialty (tech) recruiter here.  Is it just me or is the most dangerous myth in the talent market right now that recruiters aren't even reading resumes, it's just AI and ATS automation that's selecting candidates to move forward?\n\nI feel like this is being perpetuated by people peddling resume writing services, career coaching, and courses on how to \"beat\" the ATS.\n\nMaybe it's because I'm old school and am behind the times, or perhaps because I tend to work highly specialized searches, but are any recruiters here actually blindly using their ATS or AI-recommended matches and leaving it at that? I'll glance at the recommended lists, sure, but I find that the quality I'm looking for is not usually within the superficial keyword matches, and the AI isn't robust enough yet to make the inferences I need (such as company stage, size, industry relatability, or even past employers).\n\nI'm just done trying to convince people that if they're getting rejected it's usually a human (save for those big things like undesirable geography or salaries outside of the prescribed range).\n\nThoughts? ",
    "score": 77,
    "url": "https://reddit.com/r/recruiting/comments/1lb97g7/help_me_bust_the_atsai_myth/",
    "created_at": "2025-06-14T13:52:04.000Z",
    "num_comments": 153
  },
  {
    "id": "reddit-1omsglh",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "What’s your favorite area of HR to work in? [N/A]",
    "text": "Hey all! Just curious to know what area of HR you absolutely love working in and why? I’ll start. I love Compensation because I love analyzing job descriptions and matching the correct salary to the role.",
    "score": 70,
    "url": "https://reddit.com/r/humanresources/comments/1omsglh/whats_your_favorite_area_of_hr_to_work_in_na/",
    "created_at": "2025-11-02T20:49:04.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1kddm9r",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Fired [oh]",
    "text": "I got fired today. I was hired 4 months ago, I fixed the PTO policies, updated the handbook, hired &amp; fired dozens of people, corrected ADP pay configurations, stabilized the company and was replaced by the generalist for 25K less a year. I only worked there 4 months, how do I even get into an interview or explain that I was hired to be used &amp; replaced? For context the company was cutting cost and had me replace the CFO &amp; COS a couple weeks ago for 1/2 their salaries. ",
    "score": 69,
    "url": "https://reddit.com/r/humanresources/comments/1kddm9r/fired_oh/",
    "created_at": "2025-05-02T22:23:16.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1muin2m",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Do you ever regret choosing HR as your career path? Have you faced challenges like stagnant growth or hitting a salary plateau? [N/A]",
    "text": "From what I’ve seen, HR isn’t really a highly paid profession. Many people start their careers in HR with pretty low salaries, and only a few are lucky enough to get a decent start. But even then, the salary often plateaus after a point and growth seems to stagnate compared to other fields like marketing, software development, or engineering/tech, where the trajectory is usually much steeper.\n\nDo you ever regret picking HR as your career? Do you feel that if you had gone into another profession, your salary and career growth would have scaled much faster?",
    "score": 69,
    "url": "https://reddit.com/r/humanresources/comments/1muin2m/do_you_ever_regret_choosing_hr_as_your_career/",
    "created_at": "2025-08-19T13:35:59.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1lneoo9",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Employee resisting changing from salary to hourly [USA]",
    "text": "250 EE private company in MA. I have an employee who was classified incorrectly as exempt and has been paid salaried. They punch the time clock and work consistently mid-30’s in weekly hours so no risk for having to backpay OT.  The employee is not happy about this, to say the least, but I’m trying to determine if there’s any liability/risk.\n\nThe other complication is the salary amount was based off of expected 45 hour work week, not 40. The employee is arguing the conversion should be based of 40 hours as it would significantly increase their new hourly rate.\n\n",
    "score": 68,
    "url": "https://reddit.com/r/humanresources/comments/1lneoo9/employee_resisting_changing_from_salary_to_hourly/",
    "created_at": "2025-06-29T13:27:50.000Z",
    "num_comments": 87
  },
  {
    "id": "reddit-1ljqky6",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Do you now or will you require future visa sponsorship?",
    "text": "I recruit and source for a multi-industry manufacturing company, anything from implantable medical devices to circuit boards for the military to friendly AI customer service robots and smart cars.\n\nSince one of our divisions is a government contractor supply chain, we have to abide by civil contractor regulations, background screenings, ITAR, et cetera, for our defense and aerospace positions at certain DAS sites. We cannot hire those seeking sponsorship or here in visas, it freaking sucks but it’s a regulation. \n\nLately I’ve had an influx of candidates marking the titled question as “No” when they are either seeking or already on a visa (either school sponsored or employer sponsored). Time after time I apologize, disposition them and mark them for non-DAS contact only. Today I had 15 screenings, all 15 I had to decline for this reason. My last one of the day as I was apologizing and referring him to our career’s page for which sites support sponsorship, he drops this dozy on me: “My advisor told me and some other students to put down that we don’t need sponsorship.”\n\nMe: “I’m confused. Your advisor told you to lie? On a job application? That requires a background check?”\n\nCandidate: “Yes. Because of the way things are going.”\n\nMe: “Most companies don’t take being lied to about things as serious as visa sponsorship lightly. I understand the climate is unprecedented but lying is never a good idea.”\n\nAnyone else experiencing this? How are you handling it? How does your company post if they do not sponsor external visa candidates? My company does sponsorship for internal international candidates for non-DAS sites but my DAS sites are strictly US citizen  only but I cannot put that in the job description when I post it to the public. ",
    "score": 67,
    "url": "https://reddit.com/r/recruiting/comments/1ljqky6/do_you_now_or_will_you_require_future_visa/",
    "created_at": "2025-06-24T23:35:47.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1o03fi5",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Is this normal in HR? [USA]",
    "text": "I started a new position in the healthcare industry, as an HR specialist. The pay is good (70k) but I am stressed all the time, work 10-11 hour days and I barely take my lunch. \n\nIts crazy. \n\nIn a single day I have like 10 things to do, and at most I get to do 3 or 4, because things like these happen: \n\n1-manager is contantly asking following up with other items, assigns other tasks, or forwards me emails from employees or managers and expects immediate response. \n2-sudden meetings\n3-sudden terminations that need to be processed asap \n4-I discover something unusual in the system and need to figure out how to do it \n\nI could put 12 hour days and I know I still would be behind, and I will still miss things and my manager will be upset about it. 1 month and 3 weeks into this position and I am already very tired. \n\nIs this something that has to do with how I manage my work-life balance? Is this something that you get used to over time? My workplace is just horrible? \n\nMy boss is a 59 year old lady, works 12 hour days, is stressed all the time, and she herself has complained about the company.\n\nLast week I worked 60 hours to get ahead of projects and catch up with other items. And to me, given that I am not even two months in, its just crazy, but again, Ive been in HR for 3 years, maybe this is normal once you are in a salaried position? \n\nPlease advise\n\n",
    "score": 65,
    "url": "https://reddit.com/r/humanresources/comments/1o03fi5/is_this_normal_in_hr_usa/",
    "created_at": "2025-10-07T02:57:13.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1kg83tt",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "2025 Recruiter Salary Thread",
    "text": "Post your salary align with total comp, years of experience, industry, location, onsite/hybrid/remote and in house or agency",
    "score": 62,
    "url": "https://reddit.com/r/recruiting/comments/1kg83tt/2025_recruiter_salary_thread/",
    "created_at": "2025-05-06T15:58:08.000Z",
    "num_comments": 179
  },
  {
    "id": "reddit-1mtt1x4",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Did I completely ruin my career? [NY]",
    "text": "I'm sorry this is long. Been in Human Resources for about 18 years now but only at 2 companies. First company was about 3 years until layoff and now at my current company for 15. The reason I stayed so long is because it's been comfortable, pretty low stress and my previous company boss was super toxic which kinda gave me minor PTSD and fear that if I left my current job I'd land in another abusive environment so I just...stayed.\n\nI meant to leave back in 2020 but then covid happened and my boss ragequit (due to our company's insanely low salary and lack of promotions because all top management positions are held by rotational staff from the parent company in another country.) I got promoted to HR Manager and pretty much been sitting at that rate ever since. Our annual increases are less than 1% but with my husband's salary combined it paid the bills so I just said whatever....until my husband got laid off a year ago and still has not found a job.\n\nSo now I began looking for a job that actually pays me what I am worth (I am earning like 73k as a manager in NYC which is absolute garbage for this COL area btw.) Unfortunately job market tanked and I am struggling to figure out where to go from where I am. I am an HR department of one in a very small office (less than 40 people) spread across 3 states and I also process payroll, do the annual benefits OE, and I'm even stuck doing stupid benefit billing paper invoices because our accounting system was trapped in 1985 (until the accounting director also ragequit this year and now they are finally moving to a modern system but the move will take a while.)\n\nWhen I search for jobs everyone wants Workday (I only have experience in ADP WFN), or they want you to have supervised a team of people (I'm an IC and never supervised anyone). A lot of my work is very generalist centric and a lot of it is very transactional/people support rather than strategic...and I cannot find positions that seem to fit that niche. Everything is either hyper specific (Compensation, specific system I never used ie Workday, Oracle, Rippling) or requires you to have been a manager of a huge team/overseeing 1000s of employees. I try to apply to small startups but they also refuse to look at me because no experience scaling a startup either.\n\n**So my question is where do I go from here? Am I completely screwed?** I have my SHRM-CP but that doesn't seem to mean anything anymore. I've gotten a few screenings/interviews but never beyond that but I am aware the job market is crazy competitive right now.\n\nThe worst part is my parent company recently had a sexual harassment lawsuit and they had a massive management overhaul. However apparently one of the guys involved got demoted 4 positions down and now the parent company wants to send him to the US office on a tourist visa since he's ineligible for a work visa after his massive demotion...and they want to use our US office budget to house him for like 5k a month?? Yet they claim they don't have the money to pay us liveable wages. Our executive assistant is making 35k and she's pretty pissed about this too. All of us want out at this point lol.\n\n**Tl;DR I stayed at a transactional Generalist HR job for too long and my career got stalled and now I am not sure where to go in terms of progression. I'm in the media industry (which is also tanking right now.)**\n\n**Edit:** Thank you everyone for the kind comments, I didn't expect to get so many. I will keep trying and applying and maybe bending the truth about my titles for the jobs below my level.🥴",
    "score": 59,
    "url": "https://reddit.com/r/humanresources/comments/1mtt1x4/did_i_completely_ruin_my_career_ny/",
    "created_at": "2025-08-18T17:45:39.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1oygjfe",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Can recruiting get any worse?",
    "text": "I just have to air this rant out... Most tools in recruiting are fighting the wrong battle. Everyone is chasing “better features,” faster search, smarter filters, more AI. None of it fixes the real bottleneck. The real bottleneck is trust, and nobody seems willing to talk about it.\n\nAs a technical recruiter, I see the same pattern everywhere. Candidates don’t respond because they assume messages are automated. They assume the role is vague. They assume the company isn’t serious. They assume I’ll ghost them at the first sign of friction. And frankly, they assume all this because the industry trained them to think this way.\n\nSearch was never the hard part. Outreach is the hard part. Getting people to care is the hard part. And right now every new tool on the market, especially the AI ones, is making the situation worse. More automated email blasts. More generic pitches. More fake personalization. More noise. It’s a race to the bottom disguised as innovation.\n\nLinkedIn could have solved this years ago. They had the network, the usage, the data, the position. But they optimized for everything except trust. Endless automation, engagement farming, irrelevant recommendations, inbox spam. Now candidates assume every recruiter message is a bot until proven otherwise, which is a pretty bleak baseline for a conversation that’s supposed to change someone’s career.\n\nThe irony is that the only way out is not another tool promising “10x outreach,” but something much simpler, a space where engineers already feel safe, where they feel respected, where they don’t assume the worst by default. A platform that earned trust for reasons completely unrelated to recruiting, and now has the chance to actually use that trust the right way instead of extracting it.\n\nAnd here’s the part nobody says out loud. If a platform wants to fix recruiting, it has to be designed to prevent the exact behaviors that broke trust in the first place. No ghosting. No bait and switch. No dark patterns. No mass-blast outreach pretending to be human. No features that encourage treating candidates like leads in a funnel.\n\nRecruiting doesn’t need a smarter spam cannon. It needs a place where developers and recruiters actually believe each other again. That’s the only path forward. The next platform that gets this right won’t win because it’s better. It will win because it’s different in the only way that matters which is getting people to trust each other again.",
    "score": 59,
    "url": "https://reddit.com/r/recruiting/comments/1oygjfe/can_recruiting_get_any_worse/",
    "created_at": "2025-11-16T08:32:47.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1kqw6gt",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "2025 HR Generalist Salaries [CA]",
    "text": "hi everyone!\n\ngiven this horrendous job market, i was wondering what salaries you are all are seeing / making as an HR generalist currently in CA?\n\ni got a job offer (after 1.5 years of applying 😮‍💨) for a remote hr generalist role and i know it’s low (70k) but i need a full time position with benefits and it’s remote so i am going to take it. i’ll try to negotiate but i don’t want to risk losing the offer since i am sure they have plenty of backup candidates.\n\neverything is expensive right now, i’ve almost landed 6 figure jobs, and this salary isn’t exactly life changing but it’s stability  - finally! but am i being low balled? 🙃\n\n\n",
    "score": 58,
    "url": "https://reddit.com/r/humanresources/comments/1kqw6gt/2025_hr_generalist_salaries_ca/",
    "created_at": "2025-05-20T04:23:42.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1izlr28",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "I’m Struggling Getting Back to Candidates",
    "text": "I’m over worked I know that too many openings and a company that stays down my neck on metrics. When I do get back to candidates most are nice but some make life a living hell that makes me wish I didn’t get back to any of them. Recently I’ve been the recruiter I never wanted to become in ghosting people even candidates I want to move forward with I leave on hold for longer than they should because I have references, or qualifying calls or in meetings, or career fairs. I’m venting but any advice people have. I’m already stressed out and looking to get out of recruiting. It’s been a decade and I’ve now become one of the bad ones. ",
    "score": 58,
    "url": "https://reddit.com/r/recruiting/comments/1izlr28/im_struggling_getting_back_to_candidates/",
    "created_at": "2025-02-27T17:48:20.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1n5zbet",
    "subreddit": "humanresources",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Am I an underpaid HR Director? [N/A]",
    "text": "Hey fellow HR pros, I need a reality check.\n\nI'm a senior HR leader (10+ YOE, several as a department head/Director) who pivoted from the for-profit tech world to a non-profit a couple of years ago. I was hired as the sole HR person for a ~200 employee org in a HCOL city. The role was sold to me as strategic and low-volume, a chance to build something meaningful.\n\nTurns out it never was. It's a high-volume, transactional nightmare. The culture is an employee relations dumpster fire, almost entirely due to a layer of front-line managers with zero leadership skills. My entire job has become reactive. I'm putting in 55-60+ hour weeks doing damage control, cleaning up messes, and mediating the most petty conflicts. My work-life balance is nonexistent, and it's taking a serious toll on my family and my mental health. I’ve not taken vacation in years.\n\nProfessionally, I'm completely stagnant. There's no growth path, and my \"strategic\" role is just being the sole firefighter at a chemical plant with a leaky garden hose.\n\nTo top it all off, the pay is insulting for the workload and stress. I'm earning a low six-figure salary, which is less than I made in tech six years ago. When I break it down to an hourly rate, it's just depressing.\n\nAm I crazy for sticking this out, hoping it will somehow get better? Or do I need to polish my resume and speed run my way out of here? THE ONLY BENEFIT IS I’M REMOTE. That’s all.\n\nAppreciate any perspective you can offer.\n\nEdit: I’ve reflected on what everyone said and I thank you for your perspective, this community is amazing. Confirming that I’m not crazy, that there’s something really wrong here, is both terrifying and a motivator. I guess I need to polish my resume and jump into consulting again or get another company job. Thank you!",
    "score": 55,
    "url": "https://reddit.com/r/humanresources/comments/1n5zbet/am_i_an_underpaid_hr_director_na/",
    "created_at": "2025-09-01T20:10:10.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1l2koz4",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Any idea where these resumes are coming from?",
    "text": "Somewhat recently the company I work at has been inundated with applicants whose resumes all follow the exact same style and format. More often than not these people are applying sales openings but not always. Almost always though, these applicants are not a fit for the role they are applying to. Also, quite often they are looking to pretty high salaries (150K+). I feel like they are coming from some sort of mass applying resource, but I am not familiar with the resources out there enough to know. I am hoping people's info isn't just being spammed out to companies, but I would not doubt it if that is what is happening. \n\nWe have seen some very strange things with some of these resumes as well, including one that listed our company as their current employer. They do not work for us and it didn't look like they were trying to be clever with it. Looking at their LinkedIn, it was somewhat similar to the resume but the LinkedIn profile looked more accurate to the person's actual experience (more specific employment dates). In a several other cases the resumes have had VERY similar or nearly identical Professional Summaries. \n\nIn the rare cases where a candidate is actually a fit for the role they applied to, the candidate has yet to respond to a request to interview. I actually wish they would so that I could ask them directly about their application but alas I have no such luck. \n\n  \nI have attached an example resume and blanked out all the candidate personal information. Please let me know if anyone has any insight or experience with this.",
    "score": 50,
    "url": "https://reddit.com/r/recruiting/comments/1l2koz4/any_idea_where_these_resumes_are_coming_from/",
    "created_at": "2025-06-03T19:20:46.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1n691vf",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Is Recruitment Truly a Dead End Career?",
    "text": "Newer to this subreddit, but noticing a lot of negativity around the future of recruitment and talent acquisition (primarily around the rise of AI). While I think that companies are going to get to a point where we need fewer butts in seat to do work given the introduction of AI, I personally think it removes a lot of nuance and strategic stakeholder management from our jobs to say that we can be completely automated away. I also have to imagine that more AI means more accusations of bias and discrimination. But maybe that's because I'm trying to justify what I've spent the last 7 years doing lol. \n\nBut I'm curious to hear: \n\n\\-Do you enjoy being a recruiter? Do you plan on staying a recruiter?   \n\\-Do you feel like you see a clear path for growth in your future? If so, what is it? If not, why? ",
    "score": 47,
    "url": "https://reddit.com/r/recruiting/comments/1n691vf/is_recruitment_truly_a_dead_end_career/",
    "created_at": "2025-09-02T03:28:15.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1pdi2h5",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Students on F1 visa either lying or their AI glitch during application.",
    "text": "My job descriptions are very specific with a screening question about US Citizenship. We can only recruit US citizens based on our contracts. I posted a few Early Career roles (masters level) and received tons of applications from recent graduates, all saying they are US citizens. However, when I start doing screening calls, I found they are not. I am at the point of rejecting all applicants with foreign Bachelor's degrees?",
    "score": 47,
    "url": "https://reddit.com/r/recruiting/comments/1pdi2h5/students_on_f1_visa_either_lying_or_their_ai/",
    "created_at": "2025-12-03T22:06:55.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1kwvm22",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Just need to vent",
    "text": "I’ve been working professionally in my career now for going on 10 years. With that said, I’ve gotten used to how much of a grind recruiting can be however I just need to quickly vent about GEN Z candidates who I’ve been speaking with lately. These are candidates who started college post Covid, so I understand the world was in a weird place but the lack of professionalism, lack of communication skills, lack of everything is really making me loathe getting on the phone with them. \nI don’t say this lightly but I DREAD these conversations. And I need candidates and the jobs filled,  but I am holding their hands to the finish line. It’s just exhausting. End rant. ",
    "score": 44,
    "url": "https://reddit.com/r/recruiting/comments/1kwvm22/just_need_to_vent/",
    "created_at": "2025-05-27T18:59:32.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1p6d4rs",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Just read that neurologists are the most in-demand profession in the US with 73% growth. Can anyone explain why?",
    "text": "I recently read an article about the top professions in the US for 2026. [https://blog.signalhire.com/the-top-20-in-demand-jobs-in-the-usa-right-now-salaries-growth-how-to-get-hired/](https://blog.signalhire.com/the-top-20-in-demand-jobs-in-the-usa-right-now-salaries-growth-how-to-get-hired/) \n\nTech jobs are there, of course - software developers, data scientists, cybersecurity specialists. All the usual suspects with good salaries and steady growth. But further down in the article, there was a table showing growth trends by profession, and neurologists are at the top with 73%! Seventy-three percent! For comparison - software developers and data scientists are growing at around 25-35%. What surprised me is that everyone's talking about AI replacing tons of jobs, but medicine, especially neurology, is showing such explosive growth. And it makes sense when you think about it - AI definitely can't replace a doctor. It might learn to diagnose things from scans, but working with patients, making complex decisions, considering individual characteristics - that still requires a real specialist. Obviously the population is aging, Alzheimer's and dementia cases are increasing, plus there are post-COVID neurological issues. But such a huge jump in demand over just a few years is really significant. At the same time, becoming a neurologist takes 12+ years of education. How are they even planning to close such a gap? Maybe someone works in medicine or has dealt with this issue? Is this a real shortage of specialists? ",
    "score": 41,
    "url": "https://reddit.com/r/recruiting/comments/1p6d4rs/just_read_that_neurologists_are_the_most_indemand/",
    "created_at": "2025-11-25T13:59:27.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1ien8y6",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Actual AI Candidate, Maybe My First One",
    "text": "I just had the weirdest damn phone screen so far in my career. I got a resume for an SWE, one of the few times we've had to hire one in recent years. The guy's resume read like he was working on our systems but via a contractor, so I forwarded it to the head of engineering to see if that was a vendor/contractor he knew of, and he didn't. I'm guessing it was just an AI rewrite of a resume. I *did* schedule a call with the candidate because why not?\n\nI'm not convinced I was actually speaking to a real person. The voice sounded generated, which is hard to say because the 'speaker' had an accent that could also contribute to having different emphasis, pronunciations, inflections, etc., but it sounded extremely robotic, and *all* the answers were completely devoid of the details in the recent experience on the resume, which you would think would be the go-to stuff to mention because it was basically 100% on the nose, and the speaker also managed to lace every answer with keywords from our job posting in full complete sentences, no natural pauses or redirects of their train of thought, etc.\n\nI was going to confront them about writing in their resume that they implied they worked for us as a contractor, but I wanted off the phone, so I just confirmed the position is 100% onsite and 'they' said they wanted remote, and I ended the call.\n\nVery disconerting to have potentially spoken with some damn robot. Even more disconcerting because the name of the 'candidate' was a name very similar in spelling to that of someone rather famous, the victim of a horrific attack and murder, that I mentioned recently in a comment on LinkedIn in some general discussion of the state of the U.S. currently. So that coincidence plus the nature of it seems like it may have even been targeted.\n\nAll told, I'm glad I have identify theft protection and insurance. Who knows what the hell that just was.\n\nAnyone else experience something like this? Not just a fake resume or interview, like someone getting 'help' from Google or ChatGPT, but a fully generated voice? Because that is what it sounded like, an audio based chatbot.",
    "score": 35,
    "url": "https://reddit.com/r/recruiting/comments/1ien8y6/actual_ai_candidate_maybe_my_first_one/",
    "created_at": "2025-01-31T19:37:46.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1mbtjej",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Is the job market recovering for people in Recruitment &amp; Talent?",
    "text": "Was hoping for some advice: currently an in-house recruiter at a tech company, been here about 6 years, survived all our COVID and AI related layoffs, being paid a very decent salary. But I'm getting to that point where I feel like it's time to look for something new. Just not seeing growth, department's getting chaotic, and I don't feel like I'm being given the opportunities to work on what excites me.\n\nBut is it smart to take the risk of jumping to another position, or is it smarter to be unhappy but stay at a company that hasn't laid me off? I'm so scared of seeing so many colleagues unemployed for months, seeing layoffs shutter tech companies, and now AI is starting to threaten jobs. I'm worried about the health of the job market for recruiters and whether or not actively job seeking is going to be the worst mistake I make. But at the same time, I feel my career stagnating.\n\nDo you feel the recruitment job market is recovering? Would you be job searching in this job market right now if you were already employed?\n\nEDIT: Appreciate the comments and advice! I've been feeling very conflicted so unbiased opinions have been very appreciated. ",
    "score": 31,
    "url": "https://reddit.com/r/recruiting/comments/1mbtjej/is_the_job_market_recovering_for_people_in/",
    "created_at": "2025-07-28T21:51:01.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1p5ed1u",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Anyone else suddenly getting zero response on LinkedIn/Emails?",
    "text": "After 11 years building a desk in a niche engineering space for life sciences, I got headhunted to a new company. \n\nI have always been risk averse and a somewhat negative person so my big fear was making a big move and it being a disaster.\n\nI am moving to California to continue my career in the same space/niche etc.\n\nNow, I am 3 weeks in and I have received zero response from people to the point where I am questioning my sanity. \n\nFor example, I usually hover around 25-30% inmail response rate, have done for a decade, but on Friday spent a couple of hours on a campaign recently to send tailored, non-AI inmails to industry focused people. Came in today from a warning I have never seen before saying my response rate is below 5% and if this continues I will be barred from sending inmails. \n\nWhat is shocking is that I am using templates/structures that has always gotten responses, even when declining/not interested. \n\nThese are all now just pending. \n\nSame with email, sent hundreds of emails in the last three weeks, all tailored, all different structures but I have received ZERO response. \n\nI am losing my mind - anyone else in the same boat?",
    "score": 31,
    "url": "https://reddit.com/r/recruiting/comments/1p5ed1u/anyone_else_suddenly_getting_zero_response_on/",
    "created_at": "2025-11-24T11:13:27.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1n0udjz",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Recruiter Appreciation Post",
    "text": "I'm a \\*sensitive\\* recruiter, one who feels things deeply. My therapist says I'm an empath. I truly love our industry and it hurts me to see so many recruiters out of work. I love this industry so much, I founded my own little recruiting firm, and I mod this and other forums for our industry. I'm playing around on Claude to come up with a meaningful post that I can put on Linkedin about Labor Day. I like Labor Day because it's a holiday that honors the American worker. Who is more in tune with American workers than us? Here is what Claude came up with about our industry, I hope you can take something good from it: \n\n&gt;  \nThe staffing and recruiting industry serves as a vital bridge connecting talented individuals with meaningful opportunities, embodying the very spirit of Labor Day by facilitating the workforce that drives America's economic engine. We're the matchmakers of the working world, helping people find not just jobs, but careers where they can contribute their skills and passion to building something greater than themselves.\n\n&gt;Every placement we make represents someone's livelihood, their ability to support their family, and their opportunity to grow professionally, which makes our work deeply tied to the essence of what Labor Day celebrates. We don't just fill positions; we help create the workforce that keeps hospitals running, schools teaching, infrastructure functioning, and businesses thriving across every sector of the economy.\n\n&gt;In many ways, recruiters and staffing professionals are the unsung heroes of the labor movement, working behind the scenes to ensure that companies have the talent they need and that workers find places where their contributions are valued. We witness firsthand the dedication, skill, and work ethic that defines the American workforce, and we have the privilege of being part of each person's career journey and professional growth.",
    "score": 28,
    "url": "https://reddit.com/r/recruiting/comments/1n0udjz/recruiter_appreciation_post/",
    "created_at": "2025-08-26T18:51:22.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1p4pyoj",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "AI resume",
    "text": "Quick question. My company has been trying to fill a director level position for 6 months. Recently learned that the recruiter assigned to this is automatically declining any resume she thinks was crafted with AI. Apparently there’s a specific type of bullet point that is typically only AI generated..?\n\nMy question is - is this unusual? I can’t see how using AI to build your resume would be much different than using a pre-made template. The candidate still has to have ‘done’ the career experience, still has to have told the program what to enter…\n\nThis position has received over 400 applicants (I know the majority are probably unqualified) but still no hits?\n\nTIA :)",
    "score": 28,
    "url": "https://reddit.com/r/recruiting/comments/1p4pyoj/ai_resume/",
    "created_at": "2025-11-23T15:48:33.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1o1exbp",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "How to cope with bringing in a bad hire",
    "text": "I recently started my career as a recruiter fresh out of college. I work for a very small agency- a nonprofit to be exact. We offer services to adults with developmental disabilities. Our biggest need is residential staff. These are entry-level (admittedly low-paid) workers who do direct care tasks for these individuals. \n\nMy agency has me doing these interviews independently - no hiring manager is involved. I source, screen, do one virtual interview, and hire. When I started the role we didn’t even have a screening process—the recruitment processes changed and now I do one screen and one virtual interview. Not the best process because I do it all on my own and it really isn’t super in-depth. The problem is that our need level right now is so high. \n\nHires have actually decreased since I started. 4-5 people were getting hired per week when my boss (HR Manager) did these interviews. I get about 3-4 every other week nowadays. And you’re probably wondering- why do people leave so often? Well, I’d guess it would be due to pay, better offer elsewhere, or being mandated (forced to stay) too often because of lack of staff. I am more strict- I try to focus more on fit, adding interview questions, and be more selective than my boss had been. \n\nWell, turns out one of my new hires from a month ago that did training recently was screaming the “r” word and being extremely rude to leadership. I feel a sense of responsibility for that and her behavior. I don’t know how exactly to cope with the guilt — I thought my screening process was effective *enough* (certainly not perfect— if it were perfect, the program would be doing the interviews and not myself from HR). \n\nAny advice moving forward? How do you deal with a new hire that ends up being awful? Especially considering I’m the only one lets them in. ",
    "score": 26,
    "url": "https://reddit.com/r/recruiting/comments/1o1exbp/how_to_cope_with_bringing_in_a_bad_hire/",
    "created_at": "2025-10-08T16:13:11.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1pcdhpa",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Hiring freeze, is this the beginning of the end?",
    "text": "I was just told yesterday we are in a hiring freeze and to halt all recruiting. I was assured that there’s no talks of layoffs and that we can pivot to project work. I’m the only recruiter in a non profit agency. This is making me feel very uncertain. Should I begin looking for new work or am I jumping the gun too quickly? This is the first time this has happened to me in my career, which I feel lucky, but I’m terrified. Any advice is greatly appreciated!\n\nEdit: Thank you all for the comments and advice! I’ve only been in this company for 6 months so I’m worried how it’s going to also look on my resume, and I enjoy it for the most part. Sigh, I don’t want to have to start all over again proving myself, interviewing, ugh, just the market we’re in unfortunately. ",
    "score": 24,
    "url": "https://reddit.com/r/recruiting/comments/1pcdhpa/hiring_freeze_is_this_the_beginning_of_the_end/",
    "created_at": "2025-12-02T16:48:52.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1oqadhp",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Burned out by Startup TA culture?",
    "text": "Hey everyone,\nI really need to check if other people in TA have been through this, because I am starting to feel like I am the only one.\n\nI have been in TA for about four years. Two years in a scaleup, which was challenging but manageable, and two years in startups, which honestly drained me. I recently moved to a new startup and instead of feeling excited, I feel this weird sense of impending doom. Like I will never be happy in this environment no matter how hard I try.\n\nI hit all my targets. I carried the function. I was supposed to bring structure and build processes. But my boss, who has zero experience in TA and is the same age as me, keeps building all the processes himself. This was supposed to be my project and my growth opportunity. Instead I felt blocked, sidelined and treated like I cannot be trusted to own my own job. I have zero growth, I moved there to build, but I ended up being junior executor. \n\nOn top of that:\n\n• Hiring managers do not want to interview\n• They reject candidates for reasons like “too old” or “I do not like the picture”\n• I screen 15 to 20 candidates and then everything gets stuck because managers do not reply\n• I work 10 to 11 hour days for a salary that does not match the workload\n• No matter how well I perform it always feels like I need to do more, be better, push harder, I NEVER get a good feedback despite hitting my targets.\n\nIt is getting to me emotionally. I genuinely feel like something is wrong with me and like I will never find a TA environment that feels healthy or stable. I know this is dramatic but the burnout is real and the constant chaos makes me feel like I can never relax or feel proud of myself.\n\nHas anyone else dealt with this type of situation? A boss who knows nothing about TA but takes over everything (usually chief ops I guess?)? Hiring managers who do not respect the process? The feeling that you are always failing even when you hit your targets?\n\nDid you stay and set boundaries?\nDid you move to a more classic or corporate company?\nDid anything actually get better?\n\nI am not trying to fight my boss. I just want to grow and feel like my expertise matters. Right now I feel stuck and very alone in this.\n\nAny advice would mean a lot.\n\nIf it helps, I’m F, 27, but I have been working full time since those 5 years - no internships, just real work.\n",
    "score": 22,
    "url": "https://reddit.com/r/recruiting/comments/1oqadhp/burned_out_by_startup_ta_culture/",
    "created_at": "2025-11-06T20:44:34.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1l2n909",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Anyone else struggling with the nursing shortage + unrealistic client expectations combo?",
    "text": "Healthcare recruiting has always been tough, but lately I'm hitting a wall with nursing positions. I've got hospital clients asking for RNs with 5+ years experience, specialty certifications, AND they want them to start at rates that were competitive... 3 years ago.\n\nMeanwhile, the candidates I'm finding either:\n\n* Have realistic salary expectations but are getting 3-4 competing offers\n* Are fresh grads willing to work for less but don't meet the experience requirements\n* Have the experience but want remote/hybrid options that most hospitals won't budge on\n\nI spent 2 hours yesterday explaining to a client why their ICU position has been open for 4 months. They want a unicorn at horse prices.\n\nAnyone else dealing with this disconnect? How are you managing client expectations while still filling roles? Starting to feel like I need to become a therapist for hiring managers on top of everything else.",
    "score": 18,
    "url": "https://reddit.com/r/recruiting/comments/1l2n909/anyone_else_struggling_with_the_nursing_shortage/",
    "created_at": "2025-06-03T20:59:41.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1jhpsg5",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "Challenges With Large Applicant Volume",
    "text": "Over recent years, the number of applicants has drastically increased. The majority of these are unqualified and don't meet the basic requirements, making it challenging to quickly identify those worthy of moving forward. **I'm curious to hear how others are working around this challenge to quickly identify top applicants.**\n\nI've found that the main resource we use (ATS's) lack the functionality to solve this problem directly. For those that haven't found a solution. **What do you think could help directly tackle the issue?** For example, are more filters to identify skills, experience, or specific requirements like quickly identifying legal status, salary expectations, etc.?",
    "score": 18,
    "url": "https://reddit.com/r/recruiting/comments/1jhpsg5/challenges_with_large_applicant_volume/",
    "created_at": "2025-03-23T03:02:04.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1jbhtq8",
    "subreddit": "recruiting",
    "soc_codes": [
      "13-1071",
      "13-1151"
    ],
    "title": "I can’t tolerate the pressure",
    "text": "I have 2 positions to fill and client has been very specific about the industries the candidates must come from, the salary doesn’t match. I know this is going to be a hard process, I’m stressing.\n\nI honestly sometimes think recruiting isn’t for me, I don’t know what to do. I work in an agency, is it better in house? I hate specialized positions so much, I don’t dislike headhunting, it’s just that it’s such an awful feeling not knowing where to look for anymore, not knowing where to get candidates from and feeling desperate.\n\nI’m sorry, I just wanted to vent\n\nThis is my first real recruiting position for corporate roles, before this I was in high volume recruiting which I didn’t like because of the pressure and hard time finding candidates, and as generalist where I did some recruiting for corporate roles but was not my main responsibility.\n\nWhat’s worse is that I always wanted to be a recruiter, I really like interviewing, I just hate not knowing where to get candidates.",
    "score": 17,
    "url": "https://reddit.com/r/recruiting/comments/1jbhtq8/i_cant_tolerate_the_pressure/",
    "created_at": "2025-03-14T23:42:29.000Z",
    "num_comments": 37
  }
]