[
  {
    "id": "reddit-1kky3fw",
    "subreddit": "qualitycontrol",
    "soc_codes": [
      "51-9061"
    ],
    "title": "Working in QA/QC? (non it)",
    "text": "Hello, I've been working in the QA/QC domain for real life products \"global brands\" for big regional and global integrators, mostly promotional items - hence the complexity and variety of the products. (non-it) The biggest problem for me is educating suppliers on current European regulations, which sucks honestly because they've changed 3 times in the last 6-8 years. It's not completely possible to learn every directive EU implements and EUDR/FSC new requirements while still maintaining the cost and price for the client. \n\nI've had goods skyrocket in price if you need to import into China due to certificates on electricals. One of my employers was so crazy they made stuff in China, imported it into Europe, then sold it back to China. It was Made in China - but did not have a costly certificate for China, we just had to take off the market 5 pieces and test them for China while getting a lot of declarations for the already passed tests. That's just insane and I'm having a hard time agreeing with my counterparts in other executive positions, I have to take decisions which are respected by half of people who are glad to be safe from future complaints while having to \"semi-argue\" with laboratories that over charge you for shit. I already know that they are making up prices since forever based on nothing and I challenge them just to meet the demands of the procurement. It's gotten very unstable lately. \n\n  \nWhy doesn't the European Union aligns itself on 1 QA/QC regulation for products and they need this individuality still?\n\nDo you work in this domain? What are the biggest issues you stumble upon? What are the best tools you use? (besides excel and half-assed internal systems)\n\nTell me your story if you will. ",
    "score": 5,
    "url": "https://reddit.com/r/qualitycontrol/comments/1kky3fw/working_in_qaqc_non_it/",
    "created_at": "2025-05-12T17:14:22.000Z",
    "num_comments": 0
  }
]