[
  {
    "id": "reddit-1kyrm72",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "New Home Bathroom Remodel",
    "text": "Hi everybody,\n\nI’m hoping to get some opinions on a bathroom remodel in our just purchased first home. I’ve asked chatgpt to render the two options as I’m in a creative/practical conundrum on which direction to go. Advice or a clear winner in your opinion would be awesome!\n\nConstraints/Considerations:\n1. We refinished the cast iron tub professionally, but it’s a longer than standard 66”. This is making it difficult to find a glass slider tub door. 30” standard depth though.\n2. We purchased tile and it’s the 2.5”x8” Bedrosians Cloe in green. We’re gonna lay it stacked vertically.\n3. Rough plumbing has been completed and the final fixtures will be Delta’s champagne bronze (spout, handheld, and shower head with a separate diverter valve above the mixing valve).\n4. Total bathroom size is 60ish square feet so not huge.\n5. We’re installing a niche on the wall to the right.\n6. Vanity will eventually be a light natural wood finish.\n\nPic 1: original tub surround before demo.\nPic 2: chatgpt generated version if we kept the walls as is. Ignore the toilet and cgi weirdness of the fixtures. Niche should be on the short wall to the right.\nPic 3: We add an arch to the tub entry. Same cgi issues as above. Note - Adding an arch would take a little more time, but allow us to fit a standard 60” door in the opening with wall bump outs on both sides.\n\nI welcome all feedback.\n",
    "score": 11304,
    "url": "https://reddit.com/r/InteriorDesign/comments/1kyrm72/new_home_bathroom_remodel/",
    "created_at": "2025-05-30T01:12:50.000Z",
    "num_comments": 533
  },
  {
    "id": "reddit-1k5xykp",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "We finally wrapped up all the bathrooms in our cabin reno—each one has its own little personality and I’m kinda in love",
    "text": "We wanted to keep the natural wood as the grounding element throughout, but still let each bathroom speak its own language. Think of it as “wood-paneled chaos—but make it curated.” 😅\n\n• One went pink and scalloped\n\n• One leaned retro with avocado green and pedestal sinks \n\n• One’s got that golden mustard tile and brutalist sink (total wildcard lol)\n\n• And one stayed classic with neutrals and warm tile, letting the light from that window do alll the talking\n\n\n\nWould love to hear which one’s your fave or if we went too hard with the wood paneling 😂\n\nHappy to share paint colors, tile sources, or regrets if anyone’s planning something similar!",
    "score": 4318,
    "url": "https://reddit.com/r/InteriorDesign/comments/1k5xykp/we_finally_wrapped_up_all_the_bathrooms_in_our/",
    "created_at": "2025-04-23T12:30:52.000Z",
    "num_comments": 126
  },
  {
    "id": "reddit-1i2geky",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Is it a crime to cover this fireplace? ",
    "text": "I’ve wanted to change this fireplace since we moved into our 70’s house. I’ve had several people comment that it’d be a crime to change it, so I’m looking for a few more opinions before I dive in. \n\nFor context, the bones of the house are Mediterranean with a courtyard, arched doorways, red tile roof, red tile floors being finished, dark beams, etc. The ceiling wood colors and this fireplace are feeling more log cabin than Mediterranean to me. (Love log cabin, but not the vibe for this house). \n\nMy overall vision is to darken the stain on the ceiling wood, replace the door with arched to match the rest of the room, skim coat the walls / paint “Greek villa,” and figure out what to do about the fan/boob light situation. \n\nPhoto 1: current fireplace\nPhoto 2: inspo texture \nPhoto 3: other side of room if it helps at all ",
    "score": 2632,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i2geky/is_it_a_crime_to_cover_this_fireplace/",
    "created_at": "2025-01-16T03:59:44.000Z",
    "num_comments": 841
  },
  {
    "id": "reddit-1lo4s4a",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Floor to ceiling bookcase or not? 3.2M high ceilings",
    "text": "We’re about to renovate a flat we’re buying\n\nNormally I prefer shelving etc to be floor to ceiling as I hate having a ‘dust collector’ gap. However we are lucky to have 3.2M high ceilings so I’m wondering if it would look weird or be complicated to have floor to ceiling.\n\nThoughts?\n\nTo add we will be removing the door and having just an opening, as well as moving radiator position.\n\n",
    "score": 2267,
    "url": "https://reddit.com/r/InteriorDesign/comments/1lo4s4a/floor_to_ceiling_bookcase_or_not_32m_high_ceilings/",
    "created_at": "2025-06-30T11:11:24.000Z",
    "num_comments": 505
  },
  {
    "id": "reddit-1lmw7mk",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Tile store gave me the wrong grout color. I didn’t double check before giving it to my contractor. How cooked am I?",
    "text": "Walked in on my Contractor just as he was finishing up the shower walls, only to realize that the grout I was given was much darker than what I thought I purchased.  \n\nThankfully, he hadn’t done the floor yet, so I was able to purchase the intended color for that.  \n\nI don’t “hate” the final result, but I definitely don’t like it, especially since I attempted to meticulously plan every detail of this. \n\nI’ll still take feedback. If the heat is strong enough, I might consider the added expense of having the grout removed and replaced.   That said, this is only my guest bathroom, so perhaps I should just live with it.   ",
    "score": 1561,
    "url": "https://reddit.com/r/InteriorDesign/comments/1lmw7mk/tile_store_gave_me_the_wrong_grout_color_i_didnt/",
    "created_at": "2025-06-28T20:13:40.000Z",
    "num_comments": 876
  },
  {
    "id": "reddit-1le1cgz",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "We worked with a contractor to design our dream bathroom! What do you think?",
    "text": "We worked with a local contractor in Seattle to design and build our dream bathroom. What do you guys think of the result? ",
    "score": 1488,
    "url": "https://reddit.com/r/InteriorDesign/comments/1le1cgz/we_worked_with_a_contractor_to_design_our_dream/",
    "created_at": "2025-06-17T22:49:14.000Z",
    "num_comments": 319
  },
  {
    "id": "reddit-1meww1u",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Ok let’s try this again!  How did I do with my bathroom remodel?",
    "text": "So a few days ago I posed this very question and got absolutely roasted for many different reasons.  https://www.reddit.com/r/InteriorDesign/s/HhHueZ6o3L\n\nI took all constructive criticism to heart and applied them accordingly.  First, I did lighten the paint color above the wainscoting. Second, I added some shelving, artwork and accessories.  Lastly, since many commented that the pictures looked almost black and white, I did play with the exposure of the photos in order to more accurately represent the true colors that are at play here.\n\nI think the only thing I’m going to look to add at this point as a towel ring in the right hand corner below the sconce.\n\nSo anyway, this is my shot at redemption!  All comments welcome.  Pics are after/before.",
    "score": 1322,
    "url": "https://reddit.com/r/InteriorDesign/comments/1meww1u/ok_lets_try_this_again_how_did_i_do_with_my/",
    "created_at": "2025-08-01T13:44:46.000Z",
    "num_comments": 269
  },
  {
    "id": "reddit-1ks6bc2",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Before and After Kitchen Remodel",
    "text": "So proud of how my kitchen turned out, with RTA cabinets and Taj Mahal quartzite.  I did most of the work myself and hired a sub counter and there for some parts. I also got some steep discounts on appliances with work and found the zellige tile on Facebook marketplace for $75!! I think it looks like a million bucks on a marketplace budget. \n\nMy butlers pantry is the next big project to tackle :)))\n\nI’m thinking of going a little more fun with the colors in the pantry - green cabinets with black honed granite, or white/wood with green or pink quartz or quartzite. What combos have you done, and any suggestions for what might match the kitchen without exactly matching the kitchen. ",
    "score": 1263,
    "url": "https://reddit.com/r/InteriorDesign/comments/1ks6bc2/before_and_after_kitchen_remodel/",
    "created_at": "2025-05-21T19:11:35.000Z",
    "num_comments": 281
  },
  {
    "id": "reddit-1lcz4rk",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Living room feels unfinished. What would you recommend for final touches?",
    "text": "Hi, we are just about done furnishing our living room, but it doesn’t feel as complete as we thought it would. We will add some art work where the green tape is this weekend, but I think the room still feels pretty unfinished. Appreciate any recommendations for last minute touches! Thank you!!",
    "score": 1067,
    "url": "https://reddit.com/r/InteriorDesign/comments/1lcz4rk/living_room_feels_unfinished_what_would_you/",
    "created_at": "2025-06-16T17:33:15.000Z",
    "num_comments": 808
  },
  {
    "id": "reddit-1mpo12d",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Disagreement on layout... Help!",
    "text": "This living room is a work in progress.. we are getting a different tv stand and adding more decor soon. Right now my roommate and I are having a difference in opinions for the layout of this space.  \n\nPhotos 1/2/3 are roommates idea- which he swears is the best way so the TV is far enough from the sofa. I do like that you can see the TV from the kitchen. My problem is the TINY walkway to get to the sofa, to me the room feels so closed off.. i'm just not drawn to sit in the living room with this layout! \n\nPhotos 4/5/6 are my idea- which I love because it blocks less of the windows and in my opinion it opens up the room more. Roommate dislikes this idea because he feels the TV is way too close to the sofa. I measured and the distance for both is around 10 feet, so i'm not sure what to do. I realize we are both a bit stubborn with this :) \n\nAny advice for what we should do? Please help! ",
    "score": 1057,
    "url": "https://reddit.com/r/InteriorDesign/comments/1mpo12d/disagreement_on_layout_help/",
    "created_at": "2025-08-14T02:17:45.000Z",
    "num_comments": 1187
  },
  {
    "id": "reddit-1l4wcqk",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Daybed in living room?",
    "text": "How do we feel about this daybed in my living room? \n\nMy goal is to create a comfortable place to read by the fireplace but I also don’t want to overwhelm the room. I feel like it’s just big enough for something but not big enough for an entire additional seating area. I’ll be honest, the day bed is a little bigger than I was imagining for the space but the price was right compared to a lot of other pieces I was considering and I feel like it might be short and airy enough to work. However, I also don’t want it to look like there’s just a bed in the middle of my room. Any other critique welcome as well! We are still a work in progress. \n\nI do still have an ottoman coming in for in between the couches.  Please ignore my dinning room table stacked 2 feet high with laundry 🙃",
    "score": 799,
    "url": "https://reddit.com/r/InteriorDesign/comments/1l4wcqk/daybed_in_living_room/",
    "created_at": "2025-06-06T16:11:40.000Z",
    "num_comments": 142
  },
  {
    "id": "reddit-1jv6hf0",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "[Update!] Work in progress still, but we painted our living room pink!",
    "text": "I posted awhile ago asking for thoughts on wall color for this room, which was painted a dark grey with black trim. We ended up painting the walls with SW Intimate White which is a very very very light pink. We also took down the horrible brown plastic slatted blinds. I am taking my time looking for a rug but intend to get one. The metal shelves were an exciting find - we thought we would build wooden open shelving but as we went on we realized we were craving a difference in texture and color in the room so opened our minds to other materials - and we absolutely love the character they bring to the room. We are also still sourcing unique details like outlet covers and arranging art. \n\nWe still really need lighting on the side of the room by the fireplace and i’d love your thoughts on what that could look like.  \n\n\nOriginal post: https://www.reddit.com/r/InteriorDesign/s/PzaD8QNfuy",
    "score": 761,
    "url": "https://reddit.com/r/InteriorDesign/comments/1jv6hf0/update_work_in_progress_still_but_we_painted_our/",
    "created_at": "2025-04-09T14:00:17.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1ljpmxd",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Guest bathroom makeover critique?",
    "text": "Guest bathroom makeover critique?\n\nFirst time home buyer who discovered a bathroom leak necessitating subfloor replacement, which quickly turned into a whole bathroom makeover. Everything I’ve learned about bathroom remodels &amp; interior design has been in the last 2 weeks, but I need to finalize choices in a few days (so please excuse the dumb questions). Please help me with what I don’t know?\n\nInfo: This bathroom has no windows or natural light, which is a big consideration. Dimensions are 10’ 1” L x 6” W x 8’ 1” H. Standard size alcove tub to be replaced with something similar. \n\nDetails/Things I’d Like Opinions On:\n- *Color Scheme*: Green paneled walls (Jojoba by BM) and a white-ish shower tile with warm undertones. Will this look bad without natural light?\n\n- *Wall paneling*: What is the best way to achieve this? Can I use regular wood panels or should they be specifically for bathrooms? \n\n- *Tub Surround Tile*: Going large format for ease of cleanliness. Good/bad idea? Anything to know?\n\n- *Floating vs Freestanding Vanity*: Leaning towards freestanding for storage and cost considerations, but the bathroom is small and I’ve read that floating makes the room feel bigger. Pros/cons here? Also, does the wood color in the mood board match the color scheme?\n\n- *Checkerboard floor tile*: Chosen for visual interest (originally I designed a tub surround with saturated mosaic tile and this replaces that). Thoughts?\n\n- *Lighting*: What type of lighting will I need to achieve a warm/cozy but functional aesthetic? Currently there is no light above the shower so that will need to be added, can add other lights while I’m at it. I want to do sconce lights on the walls for the vanity. \n\nPicture 1 is the bathroom before move in; #2 is my mood board with some choices for the remodel; #3 is a to-scale render done in Planner5d. \n\nAny other general ideas, tips, or “FYI’s” are greatly appreciated! \n",
    "score": 588,
    "url": "https://reddit.com/r/InteriorDesign/comments/1ljpmxd/guest_bathroom_makeover_critique/",
    "created_at": "2025-06-24T22:54:50.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1lsp6cm",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "🚫 Interior Decor vs. Interior Design – Clarifying What Belongs Here",
    "text": "Hi everyone! 👋\n\nWe’ve seen a lot of confusion lately about what types of posts are allowed in this subreddit, so we wanted to clarify the difference between interior design and interior decoration, and help guide what kinds of posts are appropriate here.\n\n🛋️ What’s the Difference?\n\nInterior Design is a professional discipline that involves the planning, layout, functionality, and structural aspects of a space. It often includes things like:\n\n•\tSpatial planning  \n•\tArchitectural elements (like built-ins, ceiling design, flooring)  \n•\tADA compliance and building codes  \n•\tFurniture layout for traffic flow  \n•\tMaterial selection for durability and performance  \n•\tIntegration with HVAC, lighting, and plumbing  \n•\tCustom cabinetry, millwork, and fixed finishes\n\nInterior design considers how a space functions and feels, not just how it looks.\n\n⸻\n\nInterior Decoration, on the other hand, is about aesthetic enhancements to an existing space. This includes: •\tChoosing paint colors  \n•\tSelecting curtains or drapery  \n•\tPicking out throw pillows, rugs, and accessories  \n•\tWall art and picture hanging or floating shelf hanging  \nNote about shelving: Custom built-in shelves do not apply here.   \n•\tStyling a coffee table or shelf  \n•\tChoosing specifically tile color or flooring color options.\n\nWhile decorating is a valuable part of making a space feel personal, it is not the focus of this subreddit.\n\n⸻\n\n✅ Examples of Interior Design posts we welcome:  \n•\t“What’s the best layout for a 400 sq ft studio to include a bedroom and office zone?”  \n•\t“How can I incorporate built-in storage into a mid-century modern living room?”  \n•\t“What’s the right height to install sconces over a built-in banquette?”  \n•\t“I’m renovating my kitchen—how do I lay it out to meet code and optimize workflow?”  \n•\t“Can someone critique my commercial office space plan for flow and accessibility?”\n\n❌ Examples of Interior Decoration posts that we remove:  \n•\t“Which curtains should I use in my bedroom?”  \n•\t“Help me pick throw pillows for my new sofa.”  \n•\t“Does this gallery wall layout look okay?”  \n•\t“Should I hang this mirror above the fireplace?”  \n•\t“What wall color matches this rug?”  \n•\t“What color flooring would look good in this space?”  \n•\t“What color backsplash would work well with my cabinets?”\n\n⸻\n\nWe created this community to support deeper conversations around interior design as a discipline. For decor-related questions, there are many wonderful subreddits better suited to those conversations, such as r/HomeDecorating, r/InteriorDecorating, or r/HomeImprovement.\n\nAlternatively you can use our partners at [roomcure.com](http://roomcure.com) and use code: REDDIT15 for 15% off your order.\n\nThanks for helping us keep this subreddit focused and valuable to those practicing, studying, or deeply interested in the field of interior design.\n\n– Mod Team 🎨🧱📐",
    "score": 402,
    "url": "https://reddit.com/r/InteriorDesign/comments/1lsp6cm/interior_decor_vs_interior_design_clarifying_what/",
    "created_at": "2025-07-06T01:14:30.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1kq3rdd",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Should I tile the ceiling of my shower?",
    "text": "I frequently see the ceilings of showers left untiled however, I really like the idea of bringing the tiling all the way up to cover the full interior. I can imagine some might find it a bit claustrophobic being enclosed in a monotone printed space which is something I’m taking into account. \n\nBut I was wondering if there any pros or cons I wasn’t thinking of? Excluding cost. \n\nI’ve included some photos of both, with and without tiles on the ceiling. ",
    "score": 399,
    "url": "https://reddit.com/r/InteriorDesign/comments/1kq3rdd/should_i_tile_the_ceiling_of_my_shower/",
    "created_at": "2025-05-19T05:12:28.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1lft3j2",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Difficult Living Room Layout",
    "text": "I am trying to layout my living room and I am having a hard time. It’s an odd layout.\n\nWe have tried is pulling the couch a bit further away from fire place and putting the tv above the fire place but the tv was too far and to high.\n\nNow we moved the tv to be on the wall across from windows (see photos) and it feels cozier but the space in front of the couch seems crowded and I don’t know how to use the area across from fire place. I was thinking maybe doing a library wall but then there is the windows there. Also I am debating on hanging the tv but not sure what to put under the tv since whatever I put there will block the build in shelf next to the fire place.\n\nWe did buy this couch and love how comfy it is and I like how the colors of the rug work with the room but I am down to replace anything else.\n\nWe will be removing the huge radiator by the windows next summer so there will be that space that I am not sure what do.\n\nAll in all, I love interior design and thinking of how to make my home feel mine, cozy and unique but this room stunted me and I want to ask if anyone has any ideas on how rearrange it to highlight its great features but also make it functional.",
    "score": 151,
    "url": "https://reddit.com/r/InteriorDesign/comments/1lft3j2/difficult_living_room_layout/",
    "created_at": "2025-06-20T02:41:15.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1p5my5f",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "My dad bought a new home and tried decorating it himself I want to help make it beautiful. Advice?",
    "text": "My father (65M) just purchased his second home, and I couldn’t be prouder. I (20M) watched his first house get taken away during a messy divorce with my mom. She kept the home, he kept me. He has taken care of me alone for the past eight years while working 60 hours a week and still showing up for every important event in my life. I couldn’t ask for a better dad.\n\nWe rented a house near my school for many years before he finally decided he could afford to buy again. Unfortunately, he bought the house right as I moved away to college, so I wasn’t able to help him decorate. Coming back for Thanksgiving break, I could see he put in a lot of effort to make the place feel homely for us, and he’s very proud of the work he’s done.\n\nBut with how busy he is, he ended up buying furniture and decor that don’t really work together, a lot of mismatched colors, styles, and spacing. He’s even mentioned he doesn’t know much about decorating and just buys things he thinks might look good, but they tend to clash.\n\nI really want to help him make the place look as nice as he deserves, but I’m not skilled in interior design either. With Black Friday coming up, this seems like a perfect time to upgrade some furniture or even look into hiring a decorator. He also doesn’t really invite friends over, and I think it’s because he’s embarrassed about the interior. I want to change that for him.\n\nI’ll include pictures of the rooms. Any advice on decorating styles, room layouts, or where to start would be greatly appreciated.\n\n(especially the single chair area he wants to put a dining room table there)",
    "score": 139,
    "url": "https://reddit.com/r/InteriorDesign/comments/1p5my5f/my_dad_bought_a_new_home_and_tried_decorating_it/",
    "created_at": "2025-11-24T17:16:43.000Z",
    "num_comments": 91
  },
  {
    "id": "reddit-1m8g1ve",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "For designers speccing \"luxury\" lighting: please look a little closer",
    "text": "I used to work for a well-known Long Island-based lighting brand that markets itself as ultra-high-end: hand-finished brass, minimalist silhouettes, long lead times, and lots of \"artisanal\" and “handmade” language. If you’ve ever browsed the Pinterests of celebrity designers or boutique hotels, you’ve seen their work.\n\nBut behind the indie-luxury branding, there’s a much darker reality that is a time bomb in terms of it eventually coming to light in a very public and very negative way. And interior designers are often the ones getting duped the most.\n\nHere’s what I saw firsthand:\n* The way leadership talks to employees is outright abusive. I’ve seen internal Slack messages that, if leaked, would go viral instantly, they're that cruel and unhinged.\nIf those ever hit social media, it wouldn’t just be a PR issue for them. Clients would want those $10K fixtures out of their homes, and designers who spec’d them would be scrambling to distance themselves. No one wants to be associated with a brand that mocks its own customers and treats people like garbage behind the scenes.\n* They can’t retain skilled laborers because of the unsafe and toxic environment they’ve created. As a result, their already somewhat high lead times (often 16+ weeks) routinely stretch into months beyond that.\n* If you email for an update, they will purposely delay the response. I was explicitly told to let certain emails “sit a while” to buy time. They’ve made withholding communication part of the process. I’ve seen some workers get yelled at for responding to clients who were just simply concerned about their very delayed and very expensive order.\n* You are getting deprioritized. A lot. If you’re not seen as worthy or on their internal “favorites” list, your order gets bumped down. Again and again to the point of being months late. They’ll also bump you to have fixtures made for their own house. Meanwhile, others get rushed orders, upgraded finishes, and nonstop attention. \n* Finish quality depends entirely on how important you are. You might think, duh, of course. Clients who often spend more get extra QC, and rushed production - not much of a surprise, still sad to witness. Lesser-known designers or residential clients often get fixtures that are scratched, unevenly patina’d, or slightly warped. They then try to cover up actual damage by reminding the client that it’s a handmade product when I’ve seen other companies make things by hand and not try to use that as an excuse. These errors go out the door without hesitation. They also love blaming it on the people receiving the order, when they know their fixtures can barely go from the fabrication room to the shipping room without being scratched.\n* Over the years I’ve seen prices go up, but the quality of the metal they are sourcing go down. They also outsource more finishing now than ever and still want to pretend it’s all handmade in-house. One of their fixtures is literally made out of wooden serving bowls and it costs them almost nothing to make it, but they slap a $10,000 price tag on it and then make you wait 8 months for it.\n* Clients and trade partners are openly mocked internally. This is the thing that upset me the most to see. Designers who simply ask for status updates are dismissed as “needy” when they’ve paid thousands of dollars for their orders. It’s kind of their right to know where it is when they need it for a project. I once saw a Slack thread where the whole team mocked a designer for spiraling over their delayed hallway sconce. There’s zero respect for the people keeping their business afloat.\n* Employees are expected to lie. I was told to say things were “mid-production” when they had either been sitting in the shop for weeks untouched or had already failed QC and were waiting to be reworked. \n\nThey sell the image of thoughtful, soulful, homegrown craftsmanship, but behind the scenes, it’s all ego, manipulation, and contempt for the very people they market to.\n\nIf you care about quality, and how your clients are treated, look a little deeper before speccing. Beautiful photos don’t always mean a beautiful process. I don’t expect anyone in the interior design community to care about the ethics of what’s happening here, but I do at least expect some to maybe care about this stuff coming to light (lol) in a few years and clients not wanting to be associated with having their fixtures around. \n\nNot naming names, I don’t think I have to, but if your $9,000 brass dome light has taken 24 weeks and no one responds to your emails? It might be them.\n\nEdited for typos!",
    "score": 136,
    "url": "https://reddit.com/r/InteriorDesign/comments/1m8g1ve/for_designers_speccing_luxury_lighting_please/",
    "created_at": "2025-07-24T20:55:30.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1l36mmp",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Kitchen backsplash - granite or tiles?",
    "text": "I'm adding furniture in a new apartment and hired an architect part time to make an interior design project and render to make it easier for us. I cannot work with them anymore so I'm trying to make some changes. \nAfter much back and forth, we're settled on navy blue and signal white kitchen. They've set the kitchen with granite countertop(white/slight blue) but also same granite on the backsplash. Their renders are not good quality but as it is it looks a bit boring so I'm thinking to have the backsplash with small white tiles, I visualized using AI as in attached image, what are your thoughts, is it outdated?\n\nIt is less expensive too, the kitchen is not small.\nSince I'm totally new to this, I don't want to make any basic mistakes.\n",
    "score": 113,
    "url": "https://reddit.com/r/InteriorDesign/comments/1l36mmp/kitchen_backsplash_granite_or_tiles/",
    "created_at": "2025-06-04T14:13:43.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1i6ucpw",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Will working at Restoration Hardware/West Elm or even Home Depot ruin my career?",
    "text": "I was recently laid off (right before Christmas, how fun!) from a firm I really loved, and found out the same day that I'm pregnant. I'm due in August and I'm actively looking for a new job. I want to work before having my baby and will return to the workforce afterwards too.\n\nBeing that the economy seems to be down-turning and it's a really hard time of year to find a job, I'm getting desperate to find something before I start to look pregnant. I see job ads for \"kitchen and bath designers\" at Home Depot and \"interior design consultants\" at Restoration Hardware, West Elm, etc. and I'm considering taking one of these jobs, as much as I don't want to. There's nothing wrong with those jobs, don't get me wrong, but it is a step down for my career. I have my MFA in interior architecture and have worked at two different firms since graduating, and these jobs would obviously be more retail based.\n\nHowever, I simply cannot afford to not work and I also don't want a huge 9-10 month gap on my resume if I just continued to not work until I have the baby and then 2 months after. What should I do? Will one of these jobs ruin my career trajectory? I have worked very hard to change careers and go back to school, and never expected to get laid off and I'm really scrambling. My backup plan is to be a substitute elementary school teacher but I really don't want to do that.",
    "score": 112,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i6ucpw/will_working_at_restoration_hardwarewest_elm_or/",
    "created_at": "2025-01-21T21:49:16.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1nyza9s",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Where should I put the Couch and TV in my huge living room",
    "text": "I just bought a condo with a huge, bright (due to skylights) living room. I really want an area where guests can all sit and chat, but also something functional where I can watch tv/play video games - but I don't know where to put the tv and couch. The two complicating factors are the two pillars in the middle of the room as well as the fact that the hallway to the kitchen and the door to the bedroom are in the middle of the wall, chopping up the usable space.\n\nIt's currently essentially a blank canvas. I have aphantasia (the inability to visualize images in my head), and so I predictably struggle with interior design. A little about me - I'm a 35 year old male musician who lives alone, and also am into mixology and cocktail making. If anyone has any ideas about how I can use this beautiful space (and especially where to put the couch and tv), that would be super helpful. I'm even open to recommendations about colors and decor. Thanks in advance!\n\nNote: The last image shows my best guess at where a couch would make the most sense. However, the couch is not real. I used augmented reality through a feature on the Room and Board website",
    "score": 94,
    "url": "https://reddit.com/r/InteriorDesign/comments/1nyza9s/where_should_i_put_the_couch_and_tv_in_my_huge/",
    "created_at": "2025-10-05T20:33:40.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1pgrm61",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Advice on adding doors to archway while preserving natural light?",
    "text": "Hi, we recently purchased a row home. On the second floor there is a windowed bedroom area at the front of the house connected to a den/TV room that otherwise only has a small window towards the back for natural light.\n\nWe are balancing two conflicting aims- add privacy to this bedroom area but not overly darken the den/TV room.\n\nAny thoughts/suggestions for finding the balance?\n\nWe were thinking some sort of French/double door situation under the arch with or without glass transom/sidelights, etc. We are not sure where to potentially source doors, whether to consider installing antique/salvaged doors, whether to go for clear or frosted/stained glass, etc.\n\nAnother concern is for potential future resale value- would parents with young kids typically  steer away from interior glass doors for safety reasons, especially if they are clearly antique doors? This is simply a guest room for us, and we'd want to be careful about making decisions that could hamper selling the house when the time comes.\n\nAny opinions/ideas appreciated. Attached are a couple of different angles on the space plus some antique type doors we came across at a local antique shop. \n\nRelevant dimensions- interior width of arch approx 7.5 ft. Interior height of arch approx 7.5 feet. Interior width of room approx 11.5 ft.\n\n\nThanks so much!",
    "score": 91,
    "url": "https://reddit.com/r/InteriorDesign/comments/1pgrm61/advice_on_adding_doors_to_archway_while/",
    "created_at": "2025-12-07T19:45:43.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1mptcql",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Working on 60k budget for Condo Renos, Am I Off Here?",
    "text": "The pictures reflect what the condo I just purchased currently looks like vs potential final looks im going for. Goal is to have a very bright woody feel so the space's lack of natural light is remedied a bit.\n\nCurrent issue I have is\n\n\\- Current Kitchen floor doesnt feel like it compliments the kitchen im hoping to build.  \n\\- That the dark floor in the living room is nice but im not sure if its a good fit for kitchen im going for(the pieces are connected)\n\nI am seeing the reno company next week to discuss plans but im curious if the if the look im going for is even possible with the current floors &amp; if not, what would you recommend? Remove living room floor, kitchen floor, bother or something else? My concern is that since the pieces are connected, (LR + Kitchen) how do you effectively transition interior design from one piece to the next without having a jarring effect visually.\n\nIm open to all input. Thank you\n\n",
    "score": 65,
    "url": "https://reddit.com/r/InteriorDesign/comments/1mptcql/working_on_60k_budget_for_condo_renos_am_i_off/",
    "created_at": "2025-08-14T07:00:55.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1kv3kq6",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "What interior design rule just doesn't work for you?",
    "text": "Lately, I have been kinda into some architects's and interior designer's YouTube channels. I have also bought a few books on the topic of interior design.\n\nOne thing I noticed is that, for some very basic rules of thumb, so to say, I'm somewhat \"atypical\". Like, when it comes to what makes people feel calm or at ease or good from a biological and/or psychological pov.\n\nExample: Lots of light. Nooks. What \"cozy\" means. A video's host will show two examples A and B, where A is darker, moodier, or really open in terms of space, or with really high ceilings. And B is with a warm sunny atmosphere, more enclosed areas, lower ceilings etc. And then they ask what feels better to you and the \"right\" answer would be B and I'm like: nooo?! :D\n\nLol, so, I'm obviously a sucker for dark \"moody\" interiors. I like airy spaces, but I don't want it to be all sunny and warm. Gimme dark greens and dark woods and anthracite walls. Basically, make me feel like I'm lost in some mountain forest. And do not give me some cave feeling at all, please.\n\nSo, I'm curious, and I also don't want to feel like a complete weirdo, so I hope this is something other people noticed for themselves, too:  \n**What is something that is generally said to be true in interior design to make you feel a certain way and you found this particular \"rule\" just doesn't work for you?** :)",
    "score": 60,
    "url": "https://reddit.com/r/InteriorDesign/comments/1kv3kq6/what_interior_design_rule_just_doesnt_work_for_you/",
    "created_at": "2025-05-25T14:15:23.000Z",
    "num_comments": 183
  },
  {
    "id": "reddit-1jxw2n0",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "What I wanted vs what I got",
    "text": "Update: I spoke with the project manager from the firm and they stand behind the work and think they delivered a quality product. If you’re in Denver CO, Inside Stories are a group to avoid!\n\nI've been working with an interior designer and paid them almost $5k to design and space plan several rooms in my house. They met with me to discuss preferences and I spent hours pulling inspiration images. I even completed a quiz about colors, finishes, fabrics, patterns I liked or did not want to see. I recently met with them to get the completed designs and was so disappointed. So many of my preferences were completely ignored and now I have designs I won't be using. Any interior designers have feedback on how I could have communicated better?\n\n[Living room inspiration](https://preview.redd.it/tu18zh873mue1.jpg?width=869&amp;format=pjpg&amp;auto=webp&amp;s=7e57e149f30f775d8cb866ff089f7ed989b90128)\n\n[Living room design](https://preview.redd.it/giyptzkg3mue1.jpg?width=934&amp;format=pjpg&amp;auto=webp&amp;s=425e91b418b2e942d8531679ad5946c033ed305c)\n\n[Living room design](https://preview.redd.it/rdypxzkg3mue1.jpg?width=899&amp;format=pjpg&amp;auto=webp&amp;s=780bef6b38356a20d0fa78aea22b8a60a14aae52)\n\n[Bedroom inspiration](https://preview.redd.it/5omnak3q3mue1.jpg?width=864&amp;format=pjpg&amp;auto=webp&amp;s=e25a813dc4e7b3f40cc8f14b51530c2534ab7303)\n\n[Bedroom design](https://preview.redd.it/yadtjh3q3mue1.jpg?width=884&amp;format=pjpg&amp;auto=webp&amp;s=f6e6287edf2753febd8dbac064dc77456e9f9ae8)",
    "score": 56,
    "url": "https://reddit.com/r/InteriorDesign/comments/1jxw2n0/what_i_wanted_vs_what_i_got/",
    "created_at": "2025-04-13T01:02:09.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1l2rfk8",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Keeping wood stairs stained dark and hardwood floors refinished in light natural sealant. Bad idea?",
    "text": "We are getting some work done on new house before we move in including refinishing hardwood floors and replacing tile by bottom of steps. Initially we thought we would stain floors back to original dark walnut color but after seeing them sanded we loved how much lighter they are. Now we want to just seal them and keep them light and natural looking. The question now is what should we do with the stairs. \n\nWould it look bad to keep stairs dark stained how they currently are but floors light? My thinking is it will match trim and baseboard so should work but interior design is completely out of my wheelhouse so I wanted to get a sanity check. What do you think?\n\nFirst 2 pics are original stairs and floor. 3rd pic is currently sanded floors and 4th pic is how the floors should look with natural sealant",
    "score": 51,
    "url": "https://reddit.com/r/InteriorDesign/comments/1l2rfk8/keeping_wood_stairs_stained_dark_and_hardwood/",
    "created_at": "2025-06-04T00:00:03.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1jw735e",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Interior design experts, which open concept kitchen &amp; living room layout is better?",
    "text": "I am moving into a new home which has an open concept kitchen and living room. I am struggling with how to position my tv and couch due to the fireplace being on the shorter portion of the living room wall.\n\n  \nOptions:\n\n1. Put TV above fireplace and couch against the length of the wall. I hate TVs being too high or having to watch tv off center, so I will probably get something like a mantel mount to bring the tv closer to eye level and tilt towards the couch.\n\n2. Put TV against length of wall and the couch in the middle with the kitchen to its back. I am not sure if this breaks any \"rules\" of open space being behind the couch.\n\n  \nI have attached two pictures showcasing both options.\n\n  \nWould love to hear your thoughts!",
    "score": 43,
    "url": "https://reddit.com/r/InteriorDesign/comments/1jw735e/interior_design_experts_which_open_concept/",
    "created_at": "2025-04-10T19:54:37.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1kvw66l",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "New Revised Ruleset Taking Effect Today.",
    "text": "Hello Everyone!\n\nIt's been a while since we revised rules. With these consolidated rules, we understand that consolidating rules for a large community is a balancing act between clarity, comprehensiveness, and ease of understanding/enforcement. Below you will find the new rules that take effect today. Consolidated, more clear, and provides room for us to be a bit more lenient.\n\n**Rule 1: Post with Purpose: Share Your Design Process &amp; Specific Questions.**\n\n* This sub is for Interior Design (spatial planning, function, cohesive aesthetics), not just decoration. ALL posts seeking advice MUST include: 1) Your own initial thoughts, ideas, and/or what you've tried. 2) Clear photos of YOUR space. 3) Specific questions related to your design challenge. We don't identify products/styles; discuss design purpose. Low-effort posts (\"Help me design this room?\") or posts missing these elements will be removed. Inspirational images require designer credit &amp; discussion points.\n\n**Rule 2: Quality Content &amp; Formatting: Clear Visuals, Safe Links.**\n\n* Ensure your posts are clear and easy for others to understand. Provide multiple relevant images (various angles, swatches, sketches). Single-image posts are discouraged. User-created (non-AI) renderings of your own space must be flaired \"User Render.\" Upload images directly to Reddit or use Imgur. No URL shorteners (e.g., bit.ly, amzn.to, pin.it) or suspicious links. AI-generated images are NOT permitted in posts or comments.\n\n**Rule 3: No Spam, Solicitation, or Unauthorized Self-Promotion.**\n\n* This community is for authentic discussion and advice, not for advertising or traffic generation. All forms of spam, unsolicited self-promotion (including excessive linking to social media/blogs), or off-topic commercial content are strictly prohibited. This will result in an immediate, permanent ban. Active, contributing members should consult our Design Services thread and Reddit's self-promotion guidelines *before* any promotional activity.\n\n**Rule 4: Maintain Respect &amp; Constructive Dialogue.**\n\n* A positive and respectful atmosphere is mandatory. Constructive criticism focused on design principles is welcome. However, personal attacks, rudeness, dismissive attitudes, bashing (of users, their spaces, tastes, budgets, vendors, or companies), gatekeeping, or excessive negativity are not tolerated. Violations will result in an immediate, permanent ban without warning. Be better, be supportive.\n\n**Rule 5: Focus on Real Spaces: No Identification Requests or Vague Style Queries.**\n\n* To maintain a focus on actionable design advice for users' own projects, we do not allow posts asking solely for the identification of furniture, accessories, or specific design styles (e.g., \"What style is this room?\"). Instead, frame your questions around understanding the *purpose* or *application* of design elements within a specific context.\n\nIn addition to this, we have removed the short title automod requirement where we set a specific title length to increase the quality of that post. This has been removed completely. \n\nWe also adjusted the account age restriction. Accounts less than 30 days old, or less than 10 comment karma will not be allowed. This is to prevent any spam posts, or repeat-offender posts. \n\nIf you have any questions about these rules, please feel free to submit a question via modmail.  \nThank you for keeping the community genuine and of good quality posts!\n\n&lt;3 Mods.",
    "score": 42,
    "url": "https://reddit.com/r/InteriorDesign/comments/1kvw66l/new_revised_ruleset_taking_effect_today/",
    "created_at": "2025-05-26T14:45:50.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1kd2asl",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Would you all remove all columns? Just two inside columns? None?",
    "text": "Bought a new house, wife hates these columns. I don’t HATE them, I think they kinda give Caesar’s Palace which I’m down with, and I think they do a good job separating spaces. I’m wondering what you all think? A compromise might be removing the two interior columns of each set? They’re non load bearing obviously. Thoughts? I’ll also be replacing the window treatments with something more modern and all light fixtures. Any help would be appreciated! ",
    "score": 42,
    "url": "https://reddit.com/r/InteriorDesign/comments/1kd2asl/would_you_all_remove_all_columns_just_two_inside/",
    "created_at": "2025-05-02T14:26:58.000Z",
    "num_comments": 155
  },
  {
    "id": "reddit-1op8p1k",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "what does your \"dream kitchen\" actually look like?",
    "text": "I often think about what my \"dream kitchen\" would be like and I've realized that it's just combinations of kitchens throughout my life that I've liked. The U-shape with peninsula island from my childhood; the no-slam drawers of my previous kitchen; the flow of the kitchen at my mom's house. Things like that.\n\nBut mostly, I think about all of the kitchens I've been in that I've hated for one reason or another: My best friend's kitchen that looked great but functionally was a mess; the speckled off-grey granite counters of that one house I rented with some friends in my 20s that never looked clean; the lack of space the moment a second person arrived in my previous kitchen; the list goes on.\n\nI look at a lot of remodel/renovating/interior design subs, and still i see a whole lot of kitchens that are so easy to pick apart- both functionally and aesthetically.\n\nAesthetics obviously comes down to personal taste after a while, but a functional kitchen seems pretty straight forward.\n\nSo, if you give equal weight to both function &amp; form, what is your \"dream kitchen?\" That is, what is the best kitchen out there that you've seen?",
    "score": 36,
    "url": "https://reddit.com/r/InteriorDesign/comments/1op8p1k/what_does_your_dream_kitchen_actually_look_like/",
    "created_at": "2025-11-05T17:11:11.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1i6rblw",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Looking to switch careers and pursue Interior Design",
    "text": "I've recently had a chance to reflect on my career path, and am determined to pursue a career in interior design. I have a BS in Biology and Fine Art. I've practiced a lot of drawing and realistic rendering and definitely see this as a plus that I'd like to showcase in my careeer, too! I have always had the locigal/analytical mixed with the creative in my brain. My experience is pretty widespread: cancer research, art (private lessons and selling my own work, mainly large scale paintings and drawings) community development (long form informative content/engagement), business management (all aspects: financial, store set up \\[my favorite part\\], team management), and visual strategy/storytelling.\n\nI've been reading a bit and watching videos on YT about ID 101 and how others entered this career, and I don't feel the draw to go back to school. I'm interested in residential design as well as landscape design, as I'm a trained herbalist and have a passion for growing healing, beautiful plants! Another reason I'm averse to schooling is because i'm truly a practical learner and work better when I'm mentored and working/shadowing in the real world. \n\nMy fiancee and I have also been planning a reno for our bathroom, and I figured this would be a really great place to start and test the waters for this next step in my ID career. I'm planning on developing hand-drawn and 3d modeled floorplans for our renovation, as well as moodboards and other things (very open to suggestions!!) that an interior designer may provide to a client. I'd really like to include this in my resume to local interior designers, so when I go in to either request an internship or shadowing opportunity they feel that I'm serious about this major career change. \n\n  \nI guess I'm really just seeking some advice on whether or not this is a good idea, and any other advice on pursuing interior design :) I want to reach out to local designers sooner rather than later so I can share my interest and see if shadowing or interning is a possibility, but on the other hand I want something to give them that shows I'm in it for the long haul and serious about pursuing this career. so... Should I cold call around, or have a project on hand to showcase my drafting skill and dedication? Also, should I have some mockups to show my drawing/color skills, or anything else in my portfolio that may strengthen my applications?\n\nthank you all so much in advance - sorry for the long post - I'm so excited for this next step in my life!!!! ",
    "score": 22,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i6rblw/looking_to_switch_careers_and_pursue_interior/",
    "created_at": "2025-01-21T19:44:44.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1i0hwzy",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "How do I support my daughter's interest in interior design?",
    "text": "My daughter is 17 and fairly recently discovered a passion for interior design. She'd like to explore it as a career, but I'm not entirely sure what I can do to encourage and support her.\n\nOne thing is that she would like to tour some interior design schools in New York. Is that something I can just schedule directly with the schools if so, any recommendations? ",
    "score": 21,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i0hwzy/how_do_i_support_my_daughters_interest_in/",
    "created_at": "2025-01-13T16:31:12.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1i62wto",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Career advice for Autistic designer",
    "text": "I’m looking for advice as a burnt out interior designer on whether I should commit to a career change or explore other roles in the industry. \n\nI have a bachelors in Interior design and have worked in the industry for 5 years. My first job was in an ultra high end residential firm. The projects were amazing and I worked with a lot of incredible architects and craftsmen for high quality custom homes. While I found it super rewarding, I found the comprehensive scope, work load, and high pressures from the clients to be incredibly stressful. Eventually I had a big burnout that led me to pursue a more commercial-focused role in an Architecture firm that specialized in mostly multi-family, but also medical/dental clinics, assisted living, and some one off residential projects. While it was less demanding in some ways, I was still finding myself overwhelmed by the overall scope of the work, the number of different people/projects I was responsible for coordinating with, tight deadlines, etc. and yet again ended up hitting another major burnout. \n\nWhen I say I was burnt out, I am talking stress levels through the roof, constant migraines, melting down in hysterical fits of sobbing, loss of cognitive function, and so much more. It was truly crippling. Come to find out while in therapy for my abysmal mental health, I am actually a high-masking autistic, and probably also inattentive-type ADHD. Learning that has really clarified most of my struggles and stress I experienced as professional designer. I realized the broad scope and many hats that a designer in a firm environment has to wear, the fast pace, changing deadlines, constant multi-tasking are not compatible with the way my brain works. \n\nI have since quit my job and taken some time to focus on my mental health, recover from burnout, and trying to reframe my life to work better for my autistic needs. I have been exploring different career options, but wanted to get other designers opinions on if it would be possible to find a role within the industry with a more narrow scope and more structure, repetition and routine. I excel most when I am able to focus my entire attention on a limited number of tasks/projects at once with minimal task-switching/i teruptions, but the work I output is super detailed and high quality. I was wondering if I were to find a design consultant role with a home-builder that mainly focuses solely on meeting with clients to select materials and associated documentation, if that would be a better fit? Is that actually as low stress as it sounds on paper? Are there actually jobs like that? Are there any other more niche roles that those in the industry that could be less overwhelming to someone on the spectrum? Is this a problem that could be solved by finding the right company that would be willing to work to accommodate my autistic needs? Or is this really just a fast paced, high demand industry that doesn’t suit someone like me? Any advice from those in the industry would be appreciated and if there are any other autistic designers out there, I’d love to hear your experiences ",
    "score": 14,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i62wto/career_advice_for_autistic_designer/",
    "created_at": "2025-01-20T22:21:26.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1i6680w",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Is Pursuing a BFA in Interior Design Worth It?",
    "text": "Hi! I’m 25 and working toward finishing my bachelor’s degree. I currently have an associate’s in Fashion Merchandising and was pursuing a Business of Fashion degree. After some time in corporate fashion roles, I’ve decided to shift towards more creative work, particularly interior design, which has always interested me. I’ve been looking into online BFA Interior Design programs, but I’ve seen mixed opinions—some say it’s not worth it, while others think it is.\nI’m also considering whether it might be better to finish my degree in business administration and then pursue an interior design certification instead. Many job listings I’ve seen require backgrounds in architecture or interior design, so I’m a bit uncertain about which path to take?\nAny advice or insights into this career would be greatly appreciated! Thanks! ",
    "score": 12,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i6680w/is_pursuing_a_bfa_in_interior_design_worth_it/",
    "created_at": "2025-01-21T00:48:05.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1jo45rm",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Starting a career in design/reno - NYC",
    "text": "I am a 25 year old working in corporate finance in NYC looking to branch int om y creative side and start learning the fundamentals of interior design/exterior design/space planning/etc.. My dream one day is to own a design and renovation business for residential and commercial spaces. Where do you suggest I start, take classes, network, etc? Thank you!",
    "score": 10,
    "url": "https://reddit.com/r/InteriorDesign/comments/1jo45rm/starting_a_career_in_designreno_nyc/",
    "created_at": "2025-03-31T14:13:03.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1jh8tyz",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Needing Advice on Interior Design Career, What’s Next?",
    "text": "Hi, I’ve been doing interior design now for 14 years. I love design and am studying for the NCIDQ. \nIn my career I’ve done some commercial and currently doing residential design. I’ve always worked for a firm, with a couple small (very small) side projects. \nBut I need help understanding what my next step is. I am a senior designer at a small firm (3 people) but I don’t lead any projects. I’m basically a junior designer / assistant to the owner. I want more and I feel like 14 years experience is a good place to start going on my own? I feel that will be the only way I can really lead a project. I feel like I also want to do more exciting and creative work and currently I am not getting that.\nWondering where other designers were in their career at 14 years and if I need to be patient.  \nWhat are your thoughts on my thoughts? 😀\n\n\nAlso, since I don’t have any work showing my personal style, I was thinking of making projects for my portfolio / website that show MY style and dream client’s style. ",
    "score": 9,
    "url": "https://reddit.com/r/InteriorDesign/comments/1jh8tyz/needing_advice_on_interior_design_career_whats/",
    "created_at": "2025-03-22T13:48:24.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1i1hh5l",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "HS sister interested in interior design",
    "text": "My little sister is a sophomore in high school, and has expressed interest in pursuing interior design once she graduates.\n\nThis field is completely foreign to me, and I’d like to see how I can possibly help her. Are there any extracurricular/after-school ways she can explore interior design? What would a career path for an interior designer look like?",
    "score": 9,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i1hh5l/hs_sister_interested_in_interior_design/",
    "created_at": "2025-01-14T21:50:15.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1i1e760",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Master Degree Programs for a Bachelor of Fine Arts Degree in Interior Design?",
    "text": "\nHi everyone,  \n\nI have a Bachelor of Fine Arts in Interior Design and am considering going back to school to pursue a master’s degree. I’m hoping to expand my career opportunities and possibly shift into a more specialized field or explore new industries altogether.  \n\nMy experience includes kitchen and bath design (5 yrs.) However, I feel like my current earning potential is limited, and I’m unsure if staying within Interior Design or pivoting to something related (like UX/UI design, environmental design, or even business) would be more worthwhile.  \n\nI’ve been thinking that an MBA might be the way to go if I want to start my own business or pursue other pathways after I pursue my kitchen and bath certification (CKBD) and the NCIDQ exam. \n\nFor those with a similar background:  \n- What master’s degree programs did you pursue, and how did they impact your career?  \n- Are there programs that align well with an Interior Design degree but branch into higher-paying fields or more growth potential?  \n- Any advice on deciding between sticking with Interior Design versus transitioning to another field?  \n\nI’d love to hear your thoughts, experiences, or recommendations. Thanks in advance!  ",
    "score": 8,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i1e760/master_degree_programs_for_a_bachelor_of_fine/",
    "created_at": "2025-01-14T19:27:29.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1j97f60",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Commercial Interior Designer Salary",
    "text": "I have 11+ years of commercial design experience and recently passed my NCIDQ certification. If you are a commercial designer, what salary would you anticipate making in the Midwest? Or what did you receive for passing your certification and becoming licensed? \n\nAlso- if anyone is an ASID member with access to download reports, please PM me. Thanks! ",
    "score": 7,
    "url": "https://reddit.com/r/InteriorDesign/comments/1j97f60/commercial_interior_designer_salary/",
    "created_at": "2025-03-12T01:21:10.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1injpyy",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Did I Make a Mistake",
    "text": "Hi, \nI don’t know if this is just going to drown in the endless cute photos of houses and Inspo but I kind of really need some advice from some pro interior designers. I’ve been interning/working at a company for a while now and I can’t tell if it’s the company or if it’s the career that’s making me regret choosing interior design as my major. I really love it but at this point, I’m just drowning in stress all the time and it could be because it’s just me and the owner and I have basically entry-level experience and I’m being asked to do what I think is a lot more than that. I don’t know if I should just keep trying elsewhere, but of course where I am it’s literally impossible to get into, anything. I don’t know. Maybe there’s some professionals that can say that this is how it starts and then it gets better. Any advice is appreciated.",
    "score": 7,
    "url": "https://reddit.com/r/InteriorDesign/comments/1injpyy/did_i_make_a_mistake/",
    "created_at": "2025-02-12T05:25:13.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1i58u1j",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "Job change from analyst to interior design?",
    "text": "Hello!\n\nI am currently an analyst with a high paying job. I've been working in the industry for 15 years. Downside is, I'm sick of it and need a career change.  \n\nI love designing spaces from the layouts to color and texture. I specifically love designing spaces children's spaces. \n\nSo my question is: how would I make this change. Do I need to go back to school? I have a BS in mathematics and MS in statistics. Can I learn in my own and then apply to jobs? How unusual would be a for a 37 year old to go to design school? Is it very difficult getting a job once you've gone through school? ",
    "score": 6,
    "url": "https://reddit.com/r/InteriorDesign/comments/1i58u1j/job_change_from_analyst_to_interior_design/",
    "created_at": "2025-01-19T20:57:09.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1lz0zts",
    "subreddit": "InteriorDesign",
    "soc_codes": [
      "27-1025"
    ],
    "title": "please help me layout my 22.6sqm studio unit.",
    "text": "i'm really excited to live independently and the opportunity came after graduation. i decided to review for board exams in a different city but i will also have to work on the weekdays so i can sustain myself (my parents are paying for the condo unit).\n\nhence, i will also need to buy and build my new space from the ground up from my entry level salary since it is only bare finish with only a sink, toilet, and shower. to prepare for this, i looked for a free website which will help me plan the layout. please note that i am not in any way knowledgeable in the art of interior designing. i simply put what i had in mind to help with visualization (and goal-setting!)\n\nmy non negotiables:\n1.\t⁠a study area which will also double as my gaming setup\n2.\t⁠kitchen big enough to cook for one\n3.\t⁠maximize natural lighting from the window, hence i placed my vanity beside it for my daily makeup\n4.\t⁠table &amp; chair near the door to take shoes off and place impt things coz im very forgetful\n5.\t⁠a partition between the bedroom and kitchen (the closet acts like one)\n\ni would gladly appreciate any help, opinion, and criticisms i can get! thank you so much in advance.",
    "score": 5,
    "url": "https://reddit.com/r/InteriorDesign/comments/1lz0zts/please_help_me_layout_my_226sqm_studio_unit/",
    "created_at": "2025-07-13T19:08:37.000Z",
    "num_comments": 10
  }
]