[
  {
    "id": "reddit-1i992xf",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "My offer was just rescinded because of the hiring freeze.",
    "text": "I wanted to serve my country. I was willing to do it for free. I was willing to move to a completely different part of the country to do so. Yet the federal government apparently has no use for me.\n\nIf you voted for this then you are to blame and I hope that whenever any of your classmates goes through what I went through today that it eats you up inside.\n\nEdit: thank you for all the support everyone. I’m trying to keep my head up high, but it just really sucks. This job was my dream. Guess I just have to get back to work and start applying to some new places. Maybe I’ll try a judicial internship.\n\nAlso, just to clear things up because I see a lot of questions, 1. The position was with a US Attorney’s office. 2. They made it clear in the email that they were shutting down the internship program for the summer, so even once the hiring freeze ends it doesn’t seem like they’ll reopen it. 3. The ironic part is that I was going to be in the drug trafficking prosecution division 😭 so much for preventing drugs coming across the border ig.",
    "score": 3959,
    "url": "https://reddit.com/r/LawSchool/comments/1i992xf/my_offer_was_just_rescinded_because_of_the_hiring/",
    "created_at": "2025-01-24T23:21:02.000Z",
    "num_comments": 492
  },
  {
    "id": "reddit-1n8mkt3",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "It is a privilege to be a law student",
    "text": "Some of y’all need a bit of a reality check. Yes, law school is hard, yes it costs a lot for most people. As a 1L who was formerly working full-time, being a law student beats the heck out of my former job any day. I get to sit in a classroom and learned from renowned professors? I get to be part of a community of people and make friends? Seriously, for people who don’t like the case-reading and briefing and organizational skills that law school requires — why are you doing this in the first place?! Especially in such a crazy cycle, I feel blessed to be a 1L at a good school (not T-14, but still awesome). It really is such a privilege to make learning your full-time occupation.",
    "score": 2570,
    "url": "https://reddit.com/r/LawSchool/comments/1n8mkt3/it_is_a_privilege_to_be_a_law_student/",
    "created_at": "2025-09-04T21:20:38.000Z",
    "num_comments": 240
  },
  {
    "id": "reddit-1i6nejf",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "trump induced crash out",
    "text": "maybe this is dramatic, but i can't help but wake up today wondering why i'm studying law. why am i dedicating myself to studying this thing that clearly doesn't really mean anything? between the special counsel report and trump's executive order ending (??) birthright citizenship in violation of the 14th amendment, it all feels so pointless.\n\ni know that having educated lawyers is important to be able to fight the good fight, it's just hard to stay motivated. i hope that i'm not alone.\n\n\\*\\*edit: i used crash out as hyperbole. i'm not actually considering a career change, just venting my frustration",
    "score": 2186,
    "url": "https://reddit.com/r/LawSchool/comments/1i6nejf/trump_induced_crash_out/",
    "created_at": "2025-01-21T17:05:54.000Z",
    "num_comments": 487
  },
  {
    "id": "reddit-1jgx33w",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Hey, I just quit Skadden over the collapse of rule of law. AMA.",
    "text": "A lot of law students have reached out in a variety of ways about how to help fight the fascism of it all while still in school. I'd rather consolidate here and have those answers come out where y'all can share them.\n\nYou are right to be scared, but should not feel hopeless or helpless. I'll answer for a few hours but it may be sporadic as I have a few tabs open and a lot of texts to reply to ha.\n\n\\*Logging off, thanks!",
    "score": 1896,
    "url": "https://reddit.com/r/LawSchool/comments/1jgx33w/hey_i_just_quit_skadden_over_the_collapse_of_rule/",
    "created_at": "2025-03-22T01:23:12.000Z",
    "num_comments": 310
  },
  {
    "id": "reddit-1k8i7jp",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Being a lawyer kicks ass.",
    "text": "I woke up this morning feeling grateful to have ended up in this profession. Since most of you are currently in the midst of or have just finished finals, I wanted to post some words of encouragement. I hated law school, but I love being a lawyer. I genuinely have a hard time imagining a better job. Like all jobs, there are parts of the legal profession that are unpleasant, but so much of it is genuinely fun. It's a job where you get to learn new things every day, to write and hone the skill of writing well, and (sometimes) to help people who need your help. Plus, if you (like me) have a competitive streak, it provides a structured setting in which you get to be competitive.  It. Fucking. Rules. \n\nI spent most of law school worried that I had made a terrible mistake. I'm thrilled that I did not. Being a lawyer kicks ass. If you're currently hating law school, hang in there. Being a lawyer is worth it. ",
    "score": 1781,
    "url": "https://reddit.com/r/LawSchool/comments/1k8i7jp/being_a_lawyer_kicks_ass/",
    "created_at": "2025-04-26T17:23:36.000Z",
    "num_comments": 174
  },
  {
    "id": "reddit-1oiqeae",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "My partner is dying",
    "text": "Not even halfway through 2L and my partner is being admitted to hospice care. I'm so tired. \n\nHe got diagnosed last semester and I decided to power through. My grades were surprisingly stellar; I think I needed the distraction. But now I'm distraught. I snapped at a classmate today because he was humble bragging about doing well on our midterm even though he works full time. He's a dick but it wasn't a good look regardless. I've been revisiting the idea of a leave of absence but I'm afraid it will fuck everything up. I'm poised to be on law review eboard, i have a midlaw job lined up that I'm really excited about so i want to keep moving forward but i also want to sleep for three months. \n\nI guess I'm just venting to people who understand the unique timeline of law school \n\nEditing to update: my partner passed less than a week after I made this post. I spent (almost) every second by his side, and my school has been incredibly understanding and supportive. Thanks to everyone here who has been supportive as well.",
    "score": 1668,
    "url": "https://reddit.com/r/LawSchool/comments/1oiqeae/my_partner_is_dying/",
    "created_at": "2025-10-29T00:28:36.000Z",
    "num_comments": 247
  },
  {
    "id": "reddit-1iaxlwl",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Learning about the realities of immigration law has absolutely broken me.",
    "text": "The amount of nonrefoulment violations, the cost of obtaining citizenship, the human rights abuses, the lack of oversight, the lack of rights incoming migrants have, the blatant corruption, the separation of families, the sheer amount of money in taxpayer dollars that is spent on deportations, the treatment of migrants in ICE facilities, the deaths... \n\n  \nI always knew it was bad. Now I know the specifics and now I get to watch it get worse. \n\nEdit: really wild how I said the system is broken, people are actively dying as a result, and that makes me sad and some people are really angry at me for expressing that. It’s one thing if you’re against people entering the country illegally. You’re entitled to your own opinion, but if you want illegal immigration to end and you actively have no desire to fix the system and you don’t feel any empathy towards people fleeing violence, then I genuinely don’t know what to tell you. I do not know how to tell you that you should care about other people. ",
    "score": 1522,
    "url": "https://reddit.com/r/LawSchool/comments/1iaxlwl/learning_about_the_realities_of_immigration_law/",
    "created_at": "2025-01-27T02:37:25.000Z",
    "num_comments": 219
  },
  {
    "id": "reddit-1i7mrev",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "DOJ Honors Revoked",
    "text": "Just got this email. I am beyond devastated. This was my dream career.\n\nhttps://preview.redd.it/ew2kcel37mee1.png?width=1250&amp;format=png&amp;auto=webp&amp;s=498dbfc3e91d28f0fef551fc9bc00580ab3430f4",
    "score": 1496,
    "url": "https://reddit.com/r/LawSchool/comments/1i7mrev/doj_honors_revoked/",
    "created_at": "2025-01-22T21:39:09.000Z",
    "num_comments": 272
  },
  {
    "id": "reddit-1i2xgbm",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "If you're stressed about grades, please remember that some government agency you've never even thought about would be lucky to have you and they will treat you so well",
    "text": "To all the law students feeling stressed about grades or the cutthroat job market, let me introduce you to the underrated magic of government work. \n\nOf course the paycheck isn't *Big Law* level, but oh boy, let me tell you... My life is fabulous. I get a PENSION (yes, they still exist) and loan forgiveness after 10 years. I feel like every three weeks I am blindsided by a holiday the government observes but I had completely forgotten about. So many surprise vacations. Monday is a holiday and for some reason, in this office, that means I can work from home on Tuesday if I feel like it.\n\nAnd the vibe? Tremendous. Everyone is nice, and *no one is stressed*. I’ve got one coworker who swings by my desk daily just to shoot the shit for 45 minutes. Another coworker walked by today and said, “It’s too cold in here, I’m thinking about going home,” and everyone just nodded in solidarity like, “Yeah, you should.”\n\nNow, will I ever be able to afford a house? Probably not. But you know what? I also will never work more than 37 hours a week or touch my laptop on Presidents’ Day. At my corporate job before law school, they told me to keep my files more organized so I'd be easier to replace if I got hit by a bus. I'm never going back you guys. I'm poor but I've never been happier.",
    "score": 1495,
    "url": "https://reddit.com/r/LawSchool/comments/1i2xgbm/if_youre_stressed_about_grades_please_remember/",
    "created_at": "2025-01-16T19:44:27.000Z",
    "num_comments": 150
  },
  {
    "id": "reddit-1nby810",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Being in law school is so cool",
    "text": "Genuinely like. I have a moment everyday where I’m at the library and I just stop and think about how cool it is I get to go to law school. Like it’s an insane privilege to be able to attend not just school but professional school?? Yes law school is hard and a lot of studying but for those of you struggling I highly encourage you to take a moment and just remind yourself how cool it is and how lucky you are to have had a life where you got the opportunity to go to school and study. Having access to this education truly is one of the coolest feelings ever ",
    "score": 1462,
    "url": "https://reddit.com/r/LawSchool/comments/1nby810/being_in_law_school_is_so_cool/",
    "created_at": "2025-09-08T20:02:44.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1i7vttg",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Big Law is Actually Insane",
    "text": "I cannot believe firms are giving kids who just graduated college and have never had a job in their life a summer associate position just because of their grades. There are people with years of work experience in law school, but kids who haven’t worked a day in their life will get in just because of the grades. Actually nuts",
    "score": 1324,
    "url": "https://reddit.com/r/LawSchool/comments/1i7vttg/big_law_is_actually_insane/",
    "created_at": "2025-01-23T04:55:29.000Z",
    "num_comments": 336
  },
  {
    "id": "reddit-1jz7nr9",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Anyone else spiralling over the Abrego Garcia case?",
    "text": "I should be working on my ULWR, but now I frankly can't help but worry whether there will be even the pretense of a functional constitution by the time I take the bar. I took out a small house worth of loans to do this job, and now it seems like there is no legal recourse left for violations of due process. What possible means do we have to turn this around?",
    "score": 1289,
    "url": "https://reddit.com/r/LawSchool/comments/1jz7nr9/anyone_else_spiralling_over_the_abrego_garcia_case/",
    "created_at": "2025-04-14T19:29:33.000Z",
    "num_comments": 207
  },
  {
    "id": "reddit-1irqqu8",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "I’m Dropping Out of Law School",
    "text": "# I'M DONE\n\nI moved from New York to the South for law school. Gave up my job in Manhattan. Left behind an apartment in Jersey City (an apartment that I really liked). Left my friends. Spent months on applications, letters of rec, LSAT prep—all for a good scholarship and a shot at this path.\n\nBut I’ve made my decision. I’m dropping out. And honestly? I’m excited, terrified, relieved, disappointed, happy, grieving.\n\nAfter a year of studying the law, I know this isn’t for me. Make no mistake—I love to read, I love to write (my undergrad major was in writing), but legal materials are rarely creative or intellectually stimulating for me. I also went in with the naive expectation that law school would be an environment for deep, philosophical conversations about justice and society. Instead, I’ve found the majority of my peers more consumed with chasing money, status, and prestige. Aside from that nonsense, I've learned that law school is inherently practical. It’s much less about the philosophy of law—what initially interested me—and more comparable to barber school… but for lawyers.\n\nOh well... lesson learned.\n\n# EXAMS\n\nThe most arbitrary, stressful, high-stakes assessments I’ve encountered in law school are the exams. And truthfully, as a 26-year-old man, I simply cannot deal with the stress of them. The idea that a semester’s worth of learning and understanding comes down to a three-hour, do-or-die exam is absurd to me.\n\nMy undergrad was project-based—built on the idea that creativity takes time and that deep thinking and analysis can’t be rushed. That is not law school.\n\nLaw school exams reward speed, memorization, and a cutthroat, adversarial approach to everything. And I’m not competitive. I’m not adversarial. I have no interest in competing with anyone. The pressure to get everything right, to spot every issue, to perfectly structure every argument in a time crunch—it’s exhausting and, frankly, unnecessary. The competitive nature of it all doesn’t inspire me; it just drains me.\n\n# MY CLASSMATES\n\nI’ve met some decent people, but the overall culture feels disingenuous. Many are fixated on prestige, prestige, and more prestige. Conversations rarely revolve around the *why* of law—only the *what*: What firm will hire them? What’s the median salary? What’s the ranking of their summer job? It’s all so transactional.\n\n# THE PRICE\n\nDon't even get me started on the cost of law school. My sister is a teacher in Atlanta at a good school—she makes roughly the same, salary and benefits included, than the average lawyer in Georgia (according to Glassdoor). I have no clue how so many small firm, “bacon and eggs” attorneys are managing to pay back six-figure loans on such below-average salaries. To that point, I have no clue how law schools justify the price of tuition. While some lawyers do make $250k+, it is rare--and (in my opinion) likely soul-sucking work.\n\n# BEING A LAWYER\n\nThe more I think about it, the more I realize—the lifestyle of a lawyer is not for me. I’m not interested in standing in a courtroom arguing with opposing counsel, nor am I interested in sitting in an office for hours, buried in dense legal material. The idea of spending years of my life locked into a rigid, demanding career path just doesn’t appeal to me.\n\nI want to write. I want to travel. I want to experience life, not spend it grinding away for billable hours or stressing over cases that will never feel personally fulfilling. Law is all-consuming—it demands your time, your energy, and, in many ways, your identity. And I refuse to sell my soul to it. I want a life that feels expansive, not one that shrinks me into a role that I never truly wanted. I guess I'm glad that I learned this lesson now, instead of 15 years down the road.\n\n# FINAL THOUGHTS\n\nEven though law school didn’t end up being my path, I have nothing but appreciation for the people in this sub who helped me along the way. You all have been there for me through LSAT prep, applications, and the ups and downs of 1L year. Thank you.\n\nIt hasn’t been all bad. Mostly just monotonous. But at least I’ve learned one thing for sure: **I do not want to be a lawyer.**",
    "score": 1134,
    "url": "https://reddit.com/r/LawSchool/comments/1irqqu8/im_dropping_out_of_law_school/",
    "created_at": "2025-02-17T18:23:35.000Z",
    "num_comments": 308
  },
  {
    "id": "reddit-1kawy72",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "‘You, As Law Students, Have a Choice’: Berkeley Dean Says to Eye Whether Firms Fought Executive Orders or ‘Capitulated’",
    "text": "[From a panel on Monday:](https://www.law.com/therecorder/2025/04/28/-you-as-law-students-have-a-choice-berkeley-dean-says-to-eye-whether-firms-fought-executive-orders-or-capitulated/)\n\n&gt;“I think partners and attorneys at these firms are going to have to make their individual choice regarding whether they're willing to continue to practice at a place that's … not standing up to attacks on the Constitution,” \\[Dean Chemerinsky\\] said. “You, as law students, have a choice to make: if you think you're going to a law firm, one of the criteria—maybe the criteria—to use to decide is whether you want to go to law firms that fought that or law firms that capitulated.”\n\n&gt;The dean said he was asked about potentially barring firms who have negotiated deals with the administration from conducting interviews for job candidates using the school’s career services office, but he demurred.\n\n&gt;“I'm not comfortable doing that because I don't want to take opportunities away from our students and punish our students on account of my views,” he said. But, he told students, “I think each of you are agents who will decide where you want to go work.” He said that it would be completely appropriate if law students, individually or collectively, decided not to interview with firms that negotiated deals with the administration.\n\n&gt;“If you get thousands of law students from the top 14 law schools,” to send that message en masse, Chemerinsky said, “that could be a very important message.”",
    "score": 948,
    "url": "https://reddit.com/r/LawSchool/comments/1kawy72/you_as_law_students_have_a_choice_berkeley_dean/",
    "created_at": "2025-04-29T19:42:10.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1ipo8or",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Treating your classmates poorly will come back to haunt you.",
    "text": "Law students fail to recognize the legal community is small. People might forget the words you used, but they won't forget how you made them feel. Being a dick to someone now closes doors for you.\n\n(Edit) The popularity of this post should stand as a warning: if you treat your classmates poorly, it will come back to you. Maybe not today. Perhaps not even this month. But people remember -- and they won't forget. You will suffer the consequences of your malfeasance. Think about lateraling, clerking, partner promotions, bar admission, going in-house, and more. Lots of opportunities for people to influence your career.\n\n“You own everything that happened to you. Tell your stories. If people wanted you to write warmly about them, they should have behaved better.” ― Anne Lamott, [Bird by Bird](https://www.goodreads.com/work/quotes/841198)",
    "score": 828,
    "url": "https://reddit.com/r/LawSchool/comments/1ipo8or/treating_your_classmates_poorly_will_come_back_to/",
    "created_at": "2025-02-14T23:34:18.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1jdwsuu",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Biglaw is so disgusting to me, that i feel disconnected from my peers",
    "text": "*rant*\n\ni literally cannot fathom wanting to do something so dull, so meaningless, so soul crushing. \n\nIve talked to dozens of alum who work as young associates for big law firms and none of them do anything substantive. The most interesting thing I’ve heard is assisting in a deposition, but half of them are still waiting on a chance to do that. I talked to a second year associate last week and he said he did 10 hours of doc review for 8 days straight in preparation for trial.\n\nNo one argues that their job is meaningful or fulfilling. No one has a particular passion for their biglaw job. I mean, how could they? All you do is help the rich get richer, and businesses do better business. Sure, they might have passion for their paycheck, but  they never have any intrinsic motivation.\n\nEveryone’s work life balance is far from ideal. Associates are simply content with knowing they’ll have to cancel plans last minute if they get an email from a partner, or that they’ll have to get out of bed in the middle of the night if a partner needs something. Free time is limited and always in jeopardy of being cut at the will of the partners.\n\nNothing about this life is glamorous or appealing, other than the salary, of course. But like, is this really enough? You literally don’t have a life for years, then you burn out and exit.\n\nI have the grades for biglaw, and my school has biglaw connections, i just dont see any appeal. My peers think im weird for not trying to work for a firm. only 15% of my class is first gen so its not like these people need the money either. I never talk abt this at school because i dont want to shit on people’s career aspirations but i genuinely feel alienated",
    "score": 747,
    "url": "https://reddit.com/r/LawSchool/comments/1jdwsuu/biglaw_is_so_disgusting_to_me_that_i_feel/",
    "created_at": "2025-03-18T04:16:09.000Z",
    "num_comments": 294
  },
  {
    "id": "reddit-1jvlhhr",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "some of the worst people I've met are in law school",
    "text": "I've seen many posts complaining about the nature of law students on this subreddit in the past. And I've always thought they were a bit whiny. My general thoughts were, \"Yes, people are difficult sometimes, and law school selects for some of the more difficult people, but overall people in school are ALRIGHT.\" I also chalked up some of the bad behavior I had seen to collective anxiety during 1L. Stress brings out people's bad traits. And I had also made so many good friends that it felt unfair to characterize law students, at large, negatively. \n\nBut now as a 2L, I can honestly say that the worst people I have ever met are in law school. I have never been around so many people so privileged, yet so insecure. So arrogant yet so brittle. Allegedly smart--at least based on my school's entrance criteria--but just so stupid and intellectual incurious. \n\nStill, I could forgive all that. What I can't stand is the meanness, the casual dishonesty, the wanton willingness to diminish others' reputation. Some people here gossip and conduct character assassinations to a scale I've just never seen. People ostracize and belittle others based on small slights.\n\nAnd if any KJDs think it's maybe just a feature of being around people your age--it's not! I was fortunate to have a good deal of work experience between undergrad and law school, and most of my coworkers were 20 somethings like me. We all got along! We would go to drinks, have fun, sometimes hang out on weekends. There was drama, surely, but nothing as toxic as I've seen in Law School. There was an understanding of how colleagues should behave with each other, and a general effort to maintain a collegial environment. This is less like a professional school and more like middle school.\n\nTo be very clear, I don't think that law students, in general, are like this. A good 70% are just lovely, amazing, people, some of the best you'll ever meet. But there is a psychopathic minority which have really set the tone for the majority of my law school career, who create toxic social dynamics that everyone else just has to live in.\n\nI know plenty of you know what I'm talking about. I guess I just wanted to vent, and to ask others, what the hell can we do to fix it? How can we improve the culture of this profession? How can we do a better job of filtering out some of these psychos?",
    "score": 695,
    "url": "https://reddit.com/r/LawSchool/comments/1jvlhhr/some_of_the_worst_people_ive_met_are_in_law_school/",
    "created_at": "2025-04-10T00:46:31.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1ku1w6n",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Got the Email that I have been Academically Dismissed Today",
    "text": "I'm not going to waste too much time telling my story. All I have to say is if you're reading this, make sure your mental health is okay before you enter law school. I was going through a severe depression my first semester(dealing with self-esteem issues related to my disability and I had also had a breakup a few months prior) and my grades suffered. Even though my grades slightly improved this semester, I couldn't bring it up to the GPA requirement this time around. The pressure I had being on academic probation was a lot and it definitely affected me getting good sleep and probably hurt my grades.\n\nIt's disappointing when I look back at how hard I worked studying for the LSAT and how hard I worked to save up financially, but right now I'm just focusing on improving my mental health for whatever comes next in the future. Once again, if you're reading this and on the fence about entering, just know you can defer for a year in most cases. Pushing through a depression in this environment is not easy at all.\n\nEdit: Thanks everyone for the supportive comments. I'd just like to say I'm feeling fine and not emotionally distraught over what happened because I sensed it was coming, but now that it's here, it does feel a bit surreal. I did also have a career in a separate field before I entered, so money wise I will be okay. Once again, appreciate all the kind words!",
    "score": 676,
    "url": "https://reddit.com/r/LawSchool/comments/1ku1w6n/got_the_email_that_i_have_been_academically/",
    "created_at": "2025-05-24T03:12:32.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1je3acc",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Is all the \"DEI\" stuff making anybody else super depressed?",
    "text": "Im sorry to even get political but just needed to vent. Im a minority and with all the talk about DEI from the current administration, my already low confidence and crippling imposter syndrome has gotten even worse. I just want to go through my life like everybody else and work towards being part of this career, but everything is just attributed to me being here because of DEI. I find myself working harder than many of my peers because I just want to prove that I actually belong. However, with all that is going on politically, I am constantly reminded that I don't belong, and it sometimes makes me wish I just chose a different path in life. Im just thinking about how when my firm gets investigated, they are going to have to turn over all my data to the DOJ, who is in turn gonna say that merely hiring me was an act of discrimination. I just can't win.\n\nSorry, just really feeling down.",
    "score": 587,
    "url": "https://reddit.com/r/LawSchool/comments/1je3acc/is_all_the_dei_stuff_making_anybody_else_super/",
    "created_at": "2025-03-18T12:01:20.000Z",
    "num_comments": 178
  },
  {
    "id": "reddit-1iwnegf",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Why does everyone have a stick up their ass?",
    "text": "Sorry for the crass title, but I'm a 3L at what I'll call a top 20 law school for the sake of anonymity. Over the course of my law school career, I've noticed that a lot of people in law school take everything far too seriously, consider even the most innocuous rule infractions to be horrific, and are overall just so uptight. \n\nWhen I interact with my friends outside of law school (which seems to be something not very many of my classmates seem to have...), they're not like this at all. These are friends I went to undergrad with or just happened to meet somehow as an adult (I’m 26 for context). And the thing is, they're all working professionals with good careers, so it's not like they're all lazy rebels that contrast heavily with the oh so virtuous law students; they're just normal and laidback to a reasonable degree. \n\nIs it because law school is full of the overachievers and \"smart kids\" from college/high school? Except I and some of my classmates aren't like this at all, so what gives? \n\nSorry if this is mean-spirited and obnoxious; I just needed to rant lol.",
    "score": 564,
    "url": "https://reddit.com/r/LawSchool/comments/1iwnegf/why_does_everyone_have_a_stick_up_their_ass/",
    "created_at": "2025-02-23T23:10:39.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1j1cu0y",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "The California Bar Exam Disaster is a Symptom of a Much Deeper Crisis",
    "text": "The frustration, anxiety, and sense of betrayal surrounding this week’s bar exam debacle are entirely justified. The California Bar Exam is one of the most defining moments in a future lawyer’s career, yet the State Bar of California has once again failed the very people it claims to serve.\n\nBut here’s what they don’t want you to realize—this isn’t just about one disastrous exam administration. This is part of a long-standing pattern of secrecy, mismanagement, and a lack of accountability that has quietly shaped the legal profession for years.\n\nThe State Bar of California operates with almost no meaningful external oversight, allowing it to control the narrative whenever it faces serious failures. The result is a system where those in power minimize public scrutiny, delay accountability, and quietly move on without making real changes.\n\nThis isn’t about one bad exam cycle. This is a pattern. The same entity that disciplines attorneys also controls bar admissions, regulates law schools, and dictates who gets to practice law. When an institution holds that much power with no real checks, failures don’t lead to reform—they lead to cover-ups. And because the State Bar has the resources to outlast its critics, most people who are harmed by its actions either give up or never get heard in the first place.\n\nThe real issue isn’t just incompetence. It’s the culture of impunity. The bar exam meltdown is just the latest example of what happens when an institution is allowed to police itself. The State Bar controls every part of the legal pipeline, from education to discipline, yet it answers to no independent body that can step in when it fails. That’s why failures don’t get investigated, records don’t get turned over, and procedural misconduct gets buried under legal technicalities.\n\nThe silence isn’t an accident—it’s strategy. The longer they stall, the more they count on outrage fading. They know that public memory is short, and they are banking on people moving on. But this time, the cracks are showing. More people are speaking out, more evidence is surfacing, and they are running out of ways to contain it.\n\nThis only disappears if people let it. The more attention this gets, the more pressure builds—not just for an apology or some vague promise to “do better,” but for real oversight and real accountability. That’s what they actually fear. Because once that starts, they lose control of the narrative, and for the first time, they don’t get to decide who answers for what they’ve done.",
    "score": 471,
    "url": "https://reddit.com/r/LawSchool/comments/1j1cu0y/the_california_bar_exam_disaster_is_a_symptom_of/",
    "created_at": "2025-03-01T23:25:05.000Z",
    "num_comments": 134
  },
  {
    "id": "reddit-1ielwvz",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Somebody, somewhere might think I’m a DEI hire. Let’s talk about it.",
    "text": "I’ve now been an attorney for close to 10 years and can unfortunately no longer call myself a baby lawyer in good conscience. (I do take solace in the fact that clients still think I look incredibly young.) However, when I was closer to the start of my career, and hired at the firm I’m presently at, with all this talk of DEI, I am now starting to wonder if somewhere, somebody that I beat out of a job thought I was a DEI hire. \n\nI work for a leftist organization in a big CA city. DEI is a big value at our company, though it wasn’t at the time of my hiring. I know the entire story of my hiring decision because I later became close to my boss who informed me of all this. \n\nI had about 2.5 years of experience in applicant workers’ compensation and was going against one other candidate, who was a former public defender, with about 10 years of experience. He’s a white man and I’m a queer woman. The job we were applying for involved assisting people with mental health issues. My mother and stepfather both had mental health issues, my stepfather also had a developmental delay (they’re both passed, reason for past tense), and I’d had to navigate the healthcare system on their behalf all my life. I don’t know if he had this experience. \n\nIn terms of experience, there was no question that this man was leagues ahead of me. My boss strongly considered him as a candidate because he could walk on and do the job without any training. But in his interview, he said that he believed that no matter what, a judge always made the right decision. \n\nI can tell you that’s not true. I’ve seen so many unfair and harmful decisions, it’s horrific. \n\nWhen they were debating who to hire, my colleague told my boss that we can always train somebody, but what you cannot teach is passion. You can’t force somebody to care about the clients. You can’t force people to stay at the job. I’ve now been at that that for close to 6 and a half years because I genuinely love my job. Not many people can say that, let alone many lawyers. \n\nAt the time I was hired, I also was applying for a workers’ compensation position at another applicant firm and I didn’t have a great deal of settlement experience since my former boss always wanted to personally handle it. The head of the company told me that was fine to train me, it was harder to find somebody “you wanted to have a beer with.” \n\nThe entire purpose of DEI is to ensure that the **most qualified person** for your team is hired because, due to historical (and current) bigotry, those avenues were unavailable. The team has various needs. I’ve been on multiple hiring committees and we’ve **never** just hired unqualified people because they *happened to be* a POC, queer, disabled, and/or a woman. I’m so tired of people complaining and pretending this is reality. It’s not. You just got beat out because somebody had something extra. I’ve seen stories of folks who claim to be equally qualified as another candidate, but they then expected to get the job. Why would you have this expectation if you’re already aware you’re equally qualified? Why would the job naturally be yours?? Curious. \n\nYou never know what has been said in the interview that has given you an edge over your competitors, but I’ve found that not being a jerk and giving a damn has been pretty great for my career, and who’ve I’ve chosen to hire. ",
    "score": 437,
    "url": "https://reddit.com/r/LawSchool/comments/1ielwvz/somebody_somewhere_might_think_im_a_dei_hire_lets/",
    "created_at": "2025-01-31T18:42:01.000Z",
    "num_comments": 163
  },
  {
    "id": "reddit-1ndf59s",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "T10 3L. Wish I'd never even applied to law school",
    "text": "**EDIT because people might not be reading to the end here**:  \n**YES, I am in the bottom third of my class. YES, I am probably lazy and a liar and whatever. YES, it is all my fault, I understand now. Thank you. you're right, this would never have happened to you because you were much better and smarter than me, and it's my fault. Oh my god. I understand that. I get it. I'm the big fuckup. No one else in the one year since 2L OCI has told me that, and I have never thought that before. You're blowing my mind here when you tell me I am stupid and lazy. If you are going to message me to say any of this, you've been beat to the punch.**\n\nI'm just tired, man. I wish someone would have told me that the T14 are rich kids' playgrounds, and I should never even have tried to match them in the first place.\n\nI'm going to be graduating with 250K in loans. I failed to get into a firm for my 2L summer. Only managed to get a non-firm job that isn't public interest, so I can't even rely on public interest loan forgiveness to help with payments. I've done the math. 90K private salary with 250K loans? I'm just done. I'm finished. Before anyone starts on me for being a \"KJD\", I'm young, but I worked before law school. I've lived comfortably on 40k a year--but not with three digits of loans weighing me down.\n\nIt's ridiculous how much I failed to do what was expected of me in law school. I chose this school because it had a very robust program in the one field I'm extremely interested in. Academically, I'm happy. My GPA is about a 3.0, but I loved having the opportunity to learn from my professors and really dig into this niche. The problem is that it's gotten me nowhere. I didn't really make friends because I lived so far from campus for monetary reasons, and I guess I've always been weak socially. I didn't \"network\". I still have no fucking clue what that is. My GPA wasn't good enough to get me into any firm--not even biglaw. ANY firm. I screwed up. I'm financially, socially, and academically screwed.\n\nThere were so many small things I just didn't \"get\". The secret language of interviews (thanks a fucking lot, career services, for telling me my interviewing skills were great). How much the financial advantage matters. How much the social advantage of being in that rich white world matters! Or just being able to call your parents and ask for advice. My parents don't know a thing about how higher education works in this country. Even if they did, I got DISOWNED (gay) two months before my 1L year. So that was just awesome. And then my boyfriend broke up with me because of the stress of law school making me really unhappy.\n\nI know that's just random personal drama but god. The year before law school I had a family, only 40k undergrad debt, a relationship, and hope for my future. I'm going to graduate law school with nothing but 250k debt, a psychotic roommate I only stay with because the rent is absurdly cheap for the area, and a job I'm not even happy with, because it was whatever scraps I managed to scrounge up after OCI fucked me up the ass (not in a nice way). I shouldn't have come. That's all I can think. The best schools can stay with the rich kids. I should have just aimed lower in life. I was never meant to win.\n\nEDIT:  \nThanks for all the career advice, everyone. I suppose I was being melodramatic. I know I have options. I've obviously got issues going on outside of the basic loans vs. salary equation, I was just being a little whiney about how hard it is to do as well as others who take advantages and support for absolute granted and then seem confused by your failure. Call your mom if you can, I guess.",
    "score": 432,
    "url": "https://reddit.com/r/LawSchool/comments/1ndf59s/t10_3l_wish_id_never_even_applied_to_law_school/",
    "created_at": "2025-09-10T14:05:45.000Z",
    "num_comments": 161
  },
  {
    "id": "reddit-1j8o051",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Reminder for 1L’s: your legal writing class does not reflect actual real-world legal writing",
    "text": "I struggled a bit in legal writing as a 1L and did not enjoy it at all. I thought it was because maybe I’m a weak legal writer, but as an old and wise 3L with ~3 solid years of continuous work experience/internships (law firm work, judicial internships, etc.), I can confidently tell you that the way your legal writing professor is making you write does not really resemble the way actual lawyers write in practice. Here are some unrealistic things your legal writing professor likely focuses on:\n\n——Hyper-fixation on Bluebook rules. While it’s valuable to learn the basic Bluebook forms, the granular detail that legal writing professors demand is ridiculous in practice. I remember being docked points on my brief because I improperly did not italicize the period after Id. (Always italicize it if you were curious). In reality, this isn’t even something visible to the human eyeball and lawyers/judges/clerks do not care at all. \n\nMore importantly, many judges (especially state court judges) don’t even know the bluebook that well or simply don’t care. I’ll never forget when I proofread a draft for the federal judge I interned for, and when I scanned every inch of it for 3 hours looking for an error, I found an obscure bluebook rule that he wasn’t following. I told him and he agreed with me but simply said “Good find but I like it better my way.” If your citation makes clear what source you’re referencing such that the reader can find it themself on westlaw, it’s generally fine in practice. This is coming from a law review nerd who has wasted countless hours in the depths of the Bluebook, and the bottom line is that it really doesn’t matter that much.\n\n——Unrealistic Writing Assignments. This may vary by school, but in my legal writing class, we wrote a research memo and an appellate brief. Even for those of you who become litigators, the % of you who will become *appellate litigators* is vanishingly small. Most litigators never get above the trial court level, and writing motions and pleadings will comprise 99% of your legal writing. \n\nEven a research memo is not a very routine task at most firms, at least not to the extent of the the super rigid and professional structure your professor is likely requiring you to use. Most research-related assignments are handled with an email exchange, like a partner or judge emailing you something like “research xyz and if it applies to this case” and you reply to their email with the research in bullet points. For very big fancy assignments, maybe you draft something in full prose in a word document. But generally, lawyers and judges have no time for formal bullshit. They want you to cut directly to the relevant point and anything else is superfluous and a waste of time. \n\n——Overly Rigid Structure. Whatever stupid version of IRAC/CREAC/CRECAC etc. your professor wants you to use is a pointless exercise and does not apply to normal legal writing. In real life, you can essentially structure your piece of writing however you want for maximum persuasive effect. Yes there are some required elements in various types of legal documents, but it’s mostly up to your judgement and creativity. Pleadings are highly formulaic and don’t fit into the ABC acronym your professor wants you to use, while motions and briefs are more like pieces of art, with each requiring its own subjective touch and organizational structure to achieve maximum effect. \n\nIf you want an example of real legal writing, go read an actual appellate brief from a real case in your circuit, or maybe a SCOTUS brief. They tend to be unique and flowing pieces that don’t take a specific regurgitated format from case to case. I knew a partner who just enjoyed starting some of his motions in limine with dramatic sentences like, “Trial beckons.” because he liked the dramatic effect. Real legal writing is a creative and almost artistic process, and the bottom line is that if your piece of writing has a logical flow and is comprehensible, the various acronym structures don’t matter, and requiring strict adherence to them stifles creativity and persuasiveness.\n\n——Artificial Isolation. At least in my class, any type of collaboration or outside assistance was a huge academic integrity violation. But in practice, any substantive piece of legal writing is generally a team effort. A partner may have a motion to file, and assign one associate some research tasks, and have another associate draft it, then make their own changes or integrate their own research, then have several other people proofread and cite check, etc. When I interned for a federal judge, every clerk and intern in chambers proofread a draft before it went on the docket. \n\nMore importantly, if you’re perplexed by a substantive issue about your piece of writing, you typically just ask someone you work with or whoever assigned you the matter for their guidance on the issue. Legal writing, particularly in big substantive forms like dispositive motions or appellate briefs, is a highly collaborative process that reflects input from numerous individuals. The artificial isolation your professor imposes on you does not resemble reality, and you shouldn’t expect it to be your writing environment for the rest of your career.\n\nSo if you hate your legal writing class or aren’t doing well, just remember that it doesn’t really resemble real life. In practice, you have much more freedom over your writing, and the granular details matter much less. You can be creative and persuasive and bold without being scared of straying outside the bounds of IRAC/CREAC/CRECAC etc. 1L legal writing is really kind of a silly class.",
    "score": 393,
    "url": "https://reddit.com/r/LawSchool/comments/1j8o051/reminder_for_1ls_your_legal_writing_class_does/",
    "created_at": "2025-03-11T10:53:48.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1ksvtii",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Didn't even get a screener after hooking up with partner at recruiting event.",
    "text": "So my school had its spring job fair. It was a swanky enough fête, hosting alumni of the school from approximately 75 law firms, as well as state and federal agencies and local PI organizations, in one of the larger and more refined halls on campus. Two hours of rapidly introducing yourself, being showered with pens, folders, and other such trinkets, and moving to the next table. In this organized chaos, I ended up having a wonderful conversation with a newly-minded partner from a firm's office in my target city. She'd gone there straight from law school a decade ago and now leads that office's summer associate program.\n\nAfter the event, a good number of us students end up at the same dive bar that's fueled debauchery at our school for since times immemorial, accompanied by some alumni, including her, looking to relive the past. We talk again, and at the end of the night she invites me back to the very nice hotel her firm has put her up in. She was blonde, intelligent, and assertive, which checks all of my boxes, and I needed to refresh my supply of complimentary travel-sized toiletries, so I went. Fade to black.\n\nThe next day we got up, showered together, and talked for the appropriate amount of time over a continental breakfast. She did mention she was in the city for one more night, but a buddy of mine had hockey tickets so I told her I wouldn't be free. Nevertheless she said she'd keep an eye out for my file.\n\nApplications soon open up for next year's summer associate positions, and I sent one in to her firm, ranking her office as my top choice. I arose this morning only to find an automated email sent at 9:00 am sharp. It informed me that they had many qualified candidates, only a finite number of screener slots, and ended with well-wishes on my summer internship search.\n\nAnyway, I'm bummed about this. It's a V20 firm that is well-regard in the specific practice area I want to be in, and that practice is based out of my target city. My career office indicated students with my GPA normally get offered a screener with them, and it's been a tough application season in general. I figured I would have had a foot in the door with this firm, but sadly it seems I didn't.\n\nI guess I'm reaching out for support and advice. Has this happened to anyone else? How do I bounce back?",
    "score": 351,
    "url": "https://reddit.com/r/LawSchool/comments/1ksvtii/didnt_even_get_a_screener_after_hooking_up_with/",
    "created_at": "2025-05-22T16:57:53.000Z",
    "num_comments": 118
  },
  {
    "id": "reddit-1ltjgbv",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "A cautionary tale from the other side.",
    "text": "Just graduated *magna cum laude* from a T40, unemployed and seeking employment. I wanted to highlight the importance of understanding probability, and to caution people who might put too much stock into numbers. I also thought it might be a good contrast from the countless stories and anecdotes you hear on Reddit about folks who either did poorly in law school or went to a \"lower-tier\" law school and still managed to get a great job.\n\nI hustled for great grades (CALI'd five classes), I networked my ass off (formed so many great and genuine connections), did all the extracurriculars I could (EiC of my school's flagship journal, moot court quarterfinalist, president of my affinity group) refined my interviewing skills with my career office, applied broadly (200+) as early as applications opened, just to end up completely striking out both summers (grateful to have been a research assistant both summers), now jobless and doing bar prep while trying not to think about the crippling debt I'm in.\n\nPeople sometimes forget that even from HYS, every year there are more than a dozen graduates who are unemployed and seeking employment. Every single year, everybody thinks \"that'll never be me,\" and yet every single year, without fail, even HYS students fall into these situations.\n\nReading this, you are going to think, like countless others before you, that being a top student with all these accolades on my resume from a decent law program is enviable. You are going to think that it is some freak anomaly that I am unemployed, that I have  made some major mistake in terms of interviewing or red flags in my background that would give a rational explanation. You might even think this whole post gives you enough insight to judge my personality and determine that is the cause.\n\nI'm not going to just sit here and feel sorry for myself. I acknowledge that what I have worked for and earned puts me at an \"advantage\" in terms of increasing my likelihood of finding a job compared to countless other unemployed law grads less fortunate than I. But right now, those folks and I are making the exact same goose egg in terms of income, and relying on my \"advantage\" or on the fact that \"you're definitely a competitive applicant!\" has done me absolutely no favors in the past three years. \n\nA law school pal told me at lunch the other day that my story is valuable to tell others, to help you all consider the numbers for the people they represent. Even the most prestigious programs in the country have a contingent of folks who are now in crippling debt and zero income, months after graduation. It is foolhardy (and incorrect) to assume that all of us are automatically deserving of such a fate, or that we have had poor academic performance. In the current environment where debt is even more uncertain and unsustainable, I caution those who believe excelling in a top program is a \"guarantee\" of anything besides spending your money and time.",
    "score": 349,
    "url": "https://reddit.com/r/LawSchool/comments/1ltjgbv/a_cautionary_tale_from_the_other_side/",
    "created_at": "2025-07-07T03:02:02.000Z",
    "num_comments": 214
  },
  {
    "id": "reddit-1hpai27",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Love of my life said he’s not moving with me post-graduation",
    "text": "We have been together for 5 amazing years. Good communication, compatible personalities, similar goals. We have been long-distance while we’re both in grad school, with the expectation we’ll move in and start our lives together after we graduate. Then last night he told me that he wants to stay close to home and the state where I attend school is too far. He also knows I have clerkship goals and need mobility for that, and was emphatic that he does not want me giving up career ambitions to stay closer to him. But… I am not sure I can commit to an unknown number of years being apart. My world is shattered and I feel more lost than I ever have. Do I look for jobs close to him? Stay together and hope it works out? Make a clean break and focus on more distant opportunities? And I thought waiting for grades would be the worst part of my break.",
    "score": 305,
    "url": "https://reddit.com/r/LawSchool/comments/1hpai27/love_of_my_life_said_hes_not_moving_with_me/",
    "created_at": "2024-12-30T00:38:02.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1memega",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Big Law hiring in the year of our lord 2025",
    "text": "Hello incoming law students. I go to law school, I made a great choice and love it. Big Law hiring sucks ass, here’s what you can expect.\n\nMy classmate got a 3.9 his first semester and received a 1L/2L offer at Kirkland in January. He was done with hiring for all of law school before I had my first interview. If you nail it first semester and have a resume that biglaw likes, you win almost immediately. \n\nThe rest of us plebs spent spring semester scrambling for a job. The moment that job was secure, slap it on the resume and send your 2L apps by May. \n\nEvery single one of us had an interview of some kind during finals. Questions included “I know it’s silly because you haven’t started yet, but what are you looking forward to at your internship this summer?” I personally enjoyed complementing a firms pro bono efforts to associates counting down the minutes until their LinkedIn says ‘3 year anniversary’ and praying that in-house recruiters will start emailing with work that matches their first year salary.\n\nThe result of that precious time taken away from studying? Either an offer by the end of the week or all quiet on the recruiting front for 6 weeks. \n\nShortly after write-on, in early June, another round of “pre-OCI” with biglaw firms looking to hire a few more candidates max. I was one of the blessed few who got off the bus at this point.\n\nBy the time OCI strikes, around now, biglaw is 90+ percent full. Then the regional firms get to talk to students with bolted on smiles who have had 6 months to refine their “why I went to law school” answer. \n\nWhen it’s good it’s great, when it’s bad it’s awful. ",
    "score": 279,
    "url": "https://reddit.com/r/LawSchool/comments/1memega/big_law_hiring_in_the_year_of_our_lord_2025/",
    "created_at": "2025-08-01T03:53:30.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1m9dw0q",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Stuck at a horrible law school, should I drop out?",
    "text": "I just finished my first year at the scam that is New England Law Boston. They offered me a 80% scholarship as long as I maintained a 2.5 which sounds easy enough until you find out their grading curve is set at 2.7. No idea how that is legal. The entire institution is a joke and essentially serves as a money laundering scheme. Only 56% of their graduates were able to get \"full time legal\" employment, with the median salary being 65,000. Should I drop out? I have eight years of great legal experience, a political science degree, and I've dedicated my entire 20s to the goal of being an attorney but I feel this school will stain my resume forever. Has anyone transferred from a law program to a masters? I'm a first gen, and I never thought I would ever be in this situation so I'm  in need of  serious guidance. My dream has always been to be an attorney but I'm painfully unhappy at this school. So unhappy, I worry I have no future. For reference, my admission stats were a 3.0 Gpa (I worked full time during), a 157 LSAT, and a competitive resume. I was accepted to other institutions but my idiot self fell for the scholarship and now I'm trapped.\n\n\\*EDIT\\* I should add, I did not lose my scholarship! (The living loans are still not cute), however, 80 students were academically dismissed this year, and 60 students lost their scholarships. Point is, this school is on its way out, and is this an institution I want on my resume the rest of my life. ",
    "score": 254,
    "url": "https://reddit.com/r/LawSchool/comments/1m9dw0q/stuck_at_a_horrible_law_school_should_i_drop_out/",
    "created_at": "2025-07-25T23:11:12.000Z",
    "num_comments": 307
  },
  {
    "id": "reddit-1mq7x6p",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Tips for 1Ls from a Recent Graduate",
    "text": "Hello 1Ls, welcome to law school. In order to make the upcoming 3-year hazing process a little easier for you, I'm going to let you know a few of the tips and tricks I found that worked well for me. \n\n\n### Health Care\n\nMany of you will by now have seen that your school wants to charge an obscene amount of money for your student healthcare plan. You do not need to pay this. All you need to do is show that you have some form of alternative coverage, and then fill out the waiver form for the school's healthcare. In many, not all but many states, graduate students with no income (i.e., you) are eligible for medicaid. Medicaid is not great, but it is free or very low cost, and unless you are chronically ill or otherwise plan on having to see the doctor regularly, it will more than suffice for your needs. Being on medicaid saved me about $4000 a year in law school. \n\n### Bar Prep\n\nIt's way too early to think about the bar exam, but it's not too early to start thinking about bar prep. After graduating law school you *will* need to take some kind of bar prep program in order to pass the bar exam. I'm not going to tell you which one is best, but I *am* going to tell you that you can get bar prep for free/very low cost. Both Themis and Barbri, the two largest bar prep companies, get law students to \"table\" for them. This is a very, very low-impact \"job\" that you are permitted to do even if your law school does not allow you to work your 1L year. Google \"[Themis/Barbri] rep [your law school]\" and email them and ask if they have a tabling position open. It generally requires 1 hour a week or 1 hour every other week during the semester of sitting at a table and letting other students grab free books. If you do this for all three years, you will get free bar prep from the company at the end of it. If you do it for 2 years you get 2/3rds off, 1 year 1/3rd off. I tabled for three years, and got Themis for free. This saved me about $2000 in exchange for about 36 total hours of work. Absolutely worth it. \n\n###Studying\n\nFigure out how you learn, and study that way. Do not fall for the trap of the law school influencer who posts tiktoks about spending 25 hours a day 8 days a week in the library. If you learn best by reading, read the readings twice. If you learn best by writing, write your notes again. Figure out what works for you and do that. \n\nI also strongly recommend finding a quiet location that you can study in without distractions. One hour of serious effort in a quiet place is worth four hours of on-again off-again doomscrolling/studying/doomscrolling/studying. \n\n\n###Networking\n\nYour law school administration/career office has probably by now told you how important networking is, but I am equally sure they have not told you what the hell networking is or how to do it. There are two forms of networking. Active and passive. Active networking for law students is very easy. Find a practice area you want to learn about, go on LinkedIn, and search for alumni of your school that work in that area. Message them and say:\n\n&gt; Hi my name is [your name] and I'm a 1L at [your school]. I'm very interested in [practice area] and was hoping I could ask you a few questions about what it's like working there. I'm generally available at [dates/times] if you're open to a quick phone/zoom call. Thank you very much for your time!\n\nThis has been *extremely* productive for me, and I have every reason to believe it will be equally productive for you. Note, you should *not* do this with the expectation that you'll get a job offer at the firm of the attorney you're messaging. That's not what this is about. This is about establishing that you are a bright, inquisitive, eager young law student with an interest in practice. \n\nPassive networking is equally simple. Go to the events your law school puts on, wear a suit, and smile and make nice with the people there. You are *not* going to ask them about a job, you are going to ask them about what it's like to practice, about their hobbies, etc. etc. Again, the purpose is to show you are a bright eager young law student with an interest in practice. \n\n\n### Reputation\n\nIf your career office is any good they told you/will tell you this during orientation. If they have not/will not, here it is. Law is a *very* small field, especially once you find the area you want to practice in. Everybody knows everybody else, and if they don't know them personally, they know someone who knows them. Your reputation as a lawyer starts the first day of law school. Be kind, be courteous, be helpful, do not under any circumstances be a douchebag. You are a professional adult. You are not a high schooler. Everyone remembers the guy/gal who was a dick in law school, and one day someone you went to law school with *will* be in a position to give you an opportunity. Do not give them a reason to suggest you be turned down. \n\nPlease do not misconstrue me. I am not saying be a doormat. Sometimes you will rub someone the wrong way, and there's nothing you can do about that. I'm not saying turtle up and be terrified of putting a toe out of line for the next three years. I *am* saying that what you do will be remembered by your peers, and you will be working with these people for the rest of your life. Act accordingly. \n\n###Quimbee\n\nIf you have not heard of Quimbee already, I'm sure you'll hear about it soon. Quimbee is a fantastic *supplement* for 1Ls.  I found it incredibly helpful, I paid for it for two years, and I consider that money very well spent. It is not, I repeat *not*, a substitute for doing the readings. Not yet anyway. You will get to the point where watching the Quimbee video is sufficient for your purposes. You're not there yet, and you won't be until at least your second semester. Do your readings, because that is the only way to learn how to read an opinion, and that is an absolutely vital skill for law students and attorneys both. \n\n###Outlining\n\nYou've probably heard the term \"outlining\" by now, and if you're anything like me you're wondering what the fuck that means and why it's so important. Outlining means creating a study guide. I have no idea why it's called outlining instead of \"creating a study guide\" but that's what it is. If you're smart (hint hint) you will be taking notes during class, and those will form the core of your outline. Do not stress outlining until about Thanksgiving. Once Thanksgiving rolls around, it's time to switch into finals-mode, which means making an outline. \n\nTo make an effective outline, you have to know what works for you for studying. But to make a basic outline, you take your notes from your semester (you did take notes right?) and you condense them down somewhat. Then you do what works for you. You re-write your outline, you make flash-cards from your outline, whatever. \n\n###Edit 1: Do A Clinic\n\nNow, I will concede that my clinic experience (which ROCKED) may not have been the norm. Some clinics are probably not great, there are a hundred and ninety whatever accredited law schools in the country. Some will have bad clinical programs. So ask around and make sure it's worth it, but I *promise* you that if you are on the fence, it's worth it. If your law school does not require a clinic to graduate, make time to do one anyway. No I do not mean an externship, no I do not mean a summer associate gig, I mean do a *clinic* through your *law school*.\n\nYou will never, ever, ever in your life get the same kind of hands-on attention from an actual practicing attorney as you will through doing a clinic. If you are doing an externship, or working as a summer associate, you will not get the one-on-one time that is all but guaranteed if you do a clinic. This is where you will start to learn how to actually practice law before you go out and actually start practicing law. \n\nIt is also hands down the most rewarding thing you can do in law school on a personal level. You will represent an indigent client from your community, and that is a powerful, powerful thing.  \n\n---\n\nAlright I think that's about all I've got, if you have questions let me know and I'll try to answer them.",
    "score": 246,
    "url": "https://reddit.com/r/LawSchool/comments/1mq7x6p/tips_for_1ls_from_a_recent_graduate/",
    "created_at": "2025-08-14T17:53:58.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1n3jsxq",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "FINALLY got a job offer!!!!!",
    "text": "\nLaw school job searching was literally hell, made me suicidal, ruined my life, etc. Genuinely thought it was over and I finally got an offer at a place with good people, interesting work, great benefits, six figure salary, etc. So glad to finally be able to say that all of that work paid off (even though it still took way too long lol). If anyone’s seen my posts, then you know how shitty of a time I was having, and I’m sooooo happy that this has finally come to an end and I can start my career! \n\nEDIT: Also, weird coincidence, the antidepressants that I was prescribed specifically because I got so depressed over job searching, ran out today lol. ",
    "score": 243,
    "url": "https://reddit.com/r/LawSchool/comments/1n3jsxq/finally_got_a_job_offer/",
    "created_at": "2025-08-29T21:28:36.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1lpjkue",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "How do you make peace with being average?",
    "text": "I, like a lot of people, came to law school believing that I would be exceptional and go into big law and make 250k a year and handle the workload no matter what and etc and etc.\n\nTurns out, no so luck. Mental illness and just a core lack of focus had their way with me and here we are. I knew it was possible. I'm not screwed, I'm at a good school and beased on a spreadsheet a classmate made I'm going to probably make about $90k, which coincidentally is the salary at a job I'm waiting to hear back from in an exurb of 55k people. I got a full ride, so total debt will probably be like $60k. Maybe this won't work out and it'll be less, but maybe it will.\n\nOkay. Okay. Okay. I should be happy with this, but I'm not. I guess (like a lot of law students) I just always envisioned myself and bigger and better. I didn't really see myself as average and I guess I am.\n\nI'm not tearing myself to pieces, but I'm kind of bummed. I don't know. I feel disappointed and sad and I guess I had all these kind of ridiculous dreams that aren't going to happen.\n\nAnyway, does anyone have any recommendations on how to make peace with this?\n\nAppreciate you all.",
    "score": 197,
    "url": "https://reddit.com/r/LawSchool/comments/1lpjkue/how_do_you_make_peace_with_being_average/",
    "created_at": "2025-07-02T01:42:42.000Z",
    "num_comments": 98
  },
  {
    "id": "reddit-1oy76tk",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Anyone else feel like they would happily do biglaw for 40hours/week for a prorated salary?",
    "text": "Yes, I understand that this wouldn’t actually work and biglaw firms would never do this, etc etc (for one thing, part of what you’re getting paid for is being flexible with your time and working lots of hours when needed). I’m just saying, biglaw actually seems pretty interesting to me. I like dealing with complex problems and I enjoy legal research. I just don’t like either of those things enough to make them my whole life, no matter how much I get paid. If I could get paid a prorated salary to do biglaw work but for just 40 hours/week, I’d do it in a heartbeat. Even assuming an average biglaw associate works 80 hours/week 52 weeks out of the year, 40hr/50 weeks would come out to $108k starting, which is still a decent income! And if you assume a more realistic biglaw associate workload of 60hr/50 weeks, the prorated salary comes out to $149k starting. I would be totally happy with an income like that, even more so if it kept going up per the Cravath scale! But I do not want to work insane hours and so to public interest I go 🫡 ",
    "score": 132,
    "url": "https://reddit.com/r/LawSchool/comments/1oy76tk/anyone_else_feel_like_they_would_happily_do/",
    "created_at": "2025-11-16T00:13:05.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1hz3ag4",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "List of JD Advantage Jobs with good salaries and growth opportunities",
    "text": "Random post, throwaway. \n\nTLDR: lots of opportunities to use your JD to qualify you for jobs with great career paths. The JD helps open the door, the interview and relevant experience is how you get in.\n\n  \n1. Contract Management / Contract Administrator / Contract specialist / Contract Analyst / Contract Negotiator\n\nTons of opportunities to do transactional work redlining agreements, negotiating (sometimes with opposing counsel) with oversight/approval from Legal. Pretty much all industries but highly recommend looking at Tech companies. If you get lucky, some will promote you to Counsel positions (Commercial Counsel, Contracts Counsel..) or with enough Contracts experience, you may be lucky enough to move to another company directly as Counsel.\n\n2. Compliance Analyst / Compliance Associate / Compliance Manager / Compliance Specialist / Compliance Officer\n\nObviously popular in banking but also exists in tech. Joining one of the Big4 Accounting firms is also a great way to get experience and move to the client side. I've  seem some folks go Big4 Accounting Compliance &gt; Biglaw \n\n3. Privacy Program Manager / Privacy Compliance Manager / Privacy Analyst \n\nThis ones a bit challenging because it requires actual privacy experience but I wouldn't rule it out in your search. \n\n4. Sales, yes, Sales at Legal Tech companies\n\nSales is pretty damn lucrative and can provide a fantastic lifestyle with amazing comp. Tons of legal tech companies are sprouting out everyday and they need smart people with a legal background that can sell. This is also a great opportunity to jump over to the business side. Plenty of folks in Sales jump over to marketing, operations, product, etc.. Focus on Legal Tech companies as they are hiring sales folks all the time. IF sales is not your thing, you can transition more towards the product side and become a product specialist / expert. \n\n5. Graduate School - Again? Yes, only if it makes sense for you.\n\nGetting an MBA is 1000000x easier than a JD. The GMAT (unless you can't do basic algebra) is 10000x easier than the LSAT. Getting into a top 50, yes 50 program can set you up for success as long as you do your due diligence. Here's how to pick a good MBA program: EMPLOYMENT REPORT. A good MBA program will post their employment stats EVERY YEAR and you'll be suprised, the average salary at top 50 program will be 100k+, some 120-130+ STARTING. This is done through campus recruiting. Check what companies are hiring from their employment report and make sure they have a solid campus recruiting program. This option is great if you want to completely pivot as the MBA program will be a sign to employers that you want to get rid of the JD and do something new. \n\nDo this ONLY if it makes sense financially. With a decent GMAT score you may be able to get a full scholarship. THIS IS FOR FULL TIME PROGRAMS ONLY, Part-Time MBA programs are for professionals that likely want to stay at their existing jobs.\n\n  \nMe: MBA at a top40 program &gt; 190k out of school, went to law school part time and got a JD advantage job during my 3rd year making more money. My teammates are all former lawyers or law school graduates. \n\nDon't be afraid to take that first JD Advantage job even if it doesn't pay six figures, there are plenty of growth opportunities.\n\n  \nBonus: Learn to use LinkedIn. ",
    "score": 81,
    "url": "https://reddit.com/r/LawSchool/comments/1hz3ag4/list_of_jd_advantage_jobs_with_good_salaries_and/",
    "created_at": "2025-01-11T19:11:13.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1ktnc9n",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "For those of you who graduated without a job but are now practicing attorneys, what has your salary trajectory been?",
    "text": "\nJust graduated without a job lined up and have been incredibly stressed about this non-stop for the past 2 years. Looking for some general idea of what to expect for the future. Any advice is welcome! \n\nEx: “First job $X, second job $X, …, now $X. [practice area] [location (HCOL/LCOL)] [any other info you want to provide]”\n\nPlease only provide that info if you *graduated without a job*! \n\nThanks!",
    "score": 68,
    "url": "https://reddit.com/r/LawSchool/comments/1ktnc9n/for_those_of_you_who_graduated_without_a_job_but/",
    "created_at": "2025-05-23T16:05:39.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1onsfi8",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "To anyone struggling with the job search…",
    "text": "I’ve seen a few of those posts of people being stressed about jobs, and as someone who probably had the worst job searching experience at my school, I wanted to give some advice and encouragement now that I made it to the other side (certainly not unscathed, but alive and happy): \n\nI went to a T20 where pretty much everyone who wanted BL (“BL” to me just means V100/AmLaw100, idk what the true definition is and I don’t really care that much) got it. Going into law school, I didn’t know what big law was, I didn’t know what OCI was, and I didn’t even know I was supposed to have a summer job until March of my 1L year.\n\nI didn’t have a job lined up either summer until summer had actually started. Was told I was a great interviewer and was constantly networking and getting positive feedback. I was super confident in my abilities, felt like I could hold conversations about the subject matter, and actively stayed on top of what was going on in the relevant fields. I did everything I was supposed to do, and it was genuinely soul-crushing to have the outcome that I did for so long.\n\nAll of my classmates who wanted them seemed to have BL jobs lined up. After finding out about this as a 1L, I became *obsessed* with it (despite the fact that I had literally never even heard of BL until like a week before lmao) and wasted most of my time networking and applying to these jobs for absolutely no payoff whatsoever. Ended up becoming extremely depressed and suicidal over my lack of job prospects, eventually got on medication which helped immensely and also just gave up on the job search until I graduated. Passively applied to stuff over the summer, got an interview with a firm that seemed like a good fit, got the job soon after, and things have been good. Not BL salary by any means— I make about half of that but also have a pretty consistent 8-5 schedule and my work is mostly interesting without being overly stressful. We work alongside big firms all the time, and many people at my firm have moved to or from big law.\n\nSomething that I really wish was talked about during law school is that you can move to a BL firm later in your career if you really want to. It seemed like the consensus in law school was that if you don’t get an SA position, you’ll never get that job ever and it’s over for you or whatever. That’s not true at all. There are openings all the time in BL, and plenty of people who went to lower ranked schools or didn’t get an SA job or whatever land those jobs. Lots of other people decide they don’t want BL anyway and stay where they’re at or move somewhere else.\n\nIn law school, the job search struggle was the end of the world for me. I basically just shut down completely and stopped hanging out with people, going to events, etc. because I just felt like a failure and was too ashamed of my outcome to even talk to anyone out of fear that I would have to admit that I didn’t have anything lined up. \n\nA few months out of law school, and it doesn’t really matter. If I decide I want it that bad, I’m sure it’ll be possible to get one of those jobs. But based on everything I’ve heard about the WLB, the money isn’t worth it for me, and maybe I dodged a bullet.\n\nIf you’re in the position I was in, here are some things that might help: \n\n1: If you are noticing a substantial decline in your mental health, get on antidepressants (or whatever meds you need). I almost killed myself. I was a shell of the person I used to be for 2 years and barely hanging on. It doesn’t fix everything, but it will help. One of my biggest regrets in law school was not getting help sooner and assuming that I would just get better. I only got worse until getting on meds. I’m fine now that the thing causing my depression is gone, but I cannot recommend seeking out psychiatric help enough. Nobody thinks you’re weak for getting help. \n\n2: Spend less time networking to get a job and more time networking to meet people and make connections. If you don’t have a job, it’s really unlikely that you’re going to meet with someone for 15 minutes and get handed your dream offer. I was always reading these stories about people who had this happen to them, but realistically, that is not the usual outcome. Don’t count on that happening. Don’t go to networking events either (they’re useless) and instead just email like five people every week asking for a quick chat. The goal should be to hit it off with one or two of them enough that they’ll vouch for you if you get an interview at their firm or even just let you know if their firm is hiring in case it’s not posted on your school’s job board. Networking events are just one lawyer at a table with like 8 law students desperately trying to prove that they want a job more than everyone else. If you *do* want to go to one of those events, focus on finding someone who you have similarities with outside of work. Any law student is capable of working one of these jobs, but not all of them are interesting and fun to be around. Focus on being the latter. \n\n3: Look at your resume and ask yourself if you’d hire you if you were in the shoes of a potential employer. We all think we’re qualified, and honestly, most law students probably are qualified to get these positions, but there are too many applicants. So ignore the stuff about yourself that isn’t on your resume and focus on what people can see— do you look like an outstanding candidate? If not, what’s missing, and what can you do? Re-write some of your current stuff (within reason) to match up with what your “perfect” resume might look like. Tl;dr: Lie on your resume. Everyone’s doing it, just be able to back it up. \n\n4: Accept that you may not get a job until after you graduate. This is probably the hardest part. I went to a school where pretty much everyone who wanted BL seemed to get it and everyone but me was planning Bar trips and getting ready to move into fancy new apartments and whatnot. It was awful being surrounded by all that while literally being a complete failure. I didn’t even go to my own graduation because I couldn’t handle the prospect of being asked my plans and having to admit that there weren’t any. But realistically, someone’s going to be in that position. It sucks. But it makes you resilient and grounded once you’re finally out of that shitty situation. Sometimes you didn’t do anything wrong, and things just don’t work out. But hyperfixating on it all year isn’t going to help— there’s some quote that’s something along the lines of “worrying is just suffering twice” and it’s very true. I lost so much of my life to worrying and it didn’t get me anywhere. Frantically emailing and networking and crashing out over this didn’t get me a job.\n\nI remember scrolling for hours on here finding those posts about people randomly getting their dream job as a 3L, but I didn’t really see much from the people who graduated jobless. So here I am to let you know that even if the *worst* outcome happens to you, it’ll actually probably be okay eventually. \n\nI know how awful it is, truly. The job search genuinely almost killed me and made years of my life that should’ve been full of making friends and exploring my interests the most miserable, soul-sucking time of my life. It’s fucked up how law schools start orientation with talking about mental health and how law students are more depressed than any other grad students and all that and then they actively contribute to completely fucking up your mental health. 🙄\n\n(I distinctly remember being in that part of orientation thinking that I’d be the *last* person that would happen to… That’s what I get, I guess.) \n\nBut despite all that, I made it out alive, and if I survived the horrific mental state I was in, so will you. ",
    "score": 29,
    "url": "https://reddit.com/r/LawSchool/comments/1onsfi8/to_anyone_struggling_with_the_job_search/",
    "created_at": "2025-11-04T00:00:21.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1mqmtfs",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Decent salary for 2000 billable?",
    "text": "What’s a decent salary for an entry level position with a 2000 billable req? Not big law. CA. COL is high but job is remote so location is flexible.",
    "score": 22,
    "url": "https://reddit.com/r/LawSchool/comments/1mqmtfs/decent_salary_for_2000_billable/",
    "created_at": "2025-08-15T03:56:06.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1onhf70",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Does your first-year salary line up with your school's NALP reports?",
    "text": "Title. If your school posts its NALP data publicly, does your starting salary fall in line with the medians on your school's report? I'm curious!",
    "score": 21,
    "url": "https://reddit.com/r/LawSchool/comments/1onhf70/does_your_firstyear_salary_line_up_with_your/",
    "created_at": "2025-11-03T17:06:39.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1m7ltb9",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Career expectations?",
    "text": "Hey all. Rising 2L here at a T-25. After a very poor 1L, I’m near the bottom 25% of my class. I think I officially struck out at BigLaw as the last firm hiring just closed their applications in my market. What can I expect my career to be like in terms of possible next summer internships, as well as full time employment. If anyone can also contribute salary expectations. That would be great too! Thanks. ",
    "score": 10,
    "url": "https://reddit.com/r/LawSchool/comments/1m7ltb9/career_expectations/",
    "created_at": "2025-07-23T21:28:30.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1m1kqp5",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "JAG vs. Private Practice",
    "text": "I am fortunate to be able to use my GI bill, so my only debt will be for cost of living expenses.  I will have 10 years prior service - so starting pay including BAH would be roughly $119k, bumping up to about $135k after 12 months back in (approximation based on middling BAH rates w/dep, BAH rates depend on geographic location). I work alongside JAGs now, so I know what to expect as far as work life balance, pay, duties, etc., and I believe I will enjoy the role. \n\nI'm going to be attending a T30 school. Not necessarily seeking Biglaw, but I am interested in the possibility of being in the civilian workforce. I'm also trying to keep in mind salary expectations.  I know exactly what I'll make in the military, and what salary progression would look like throughout the remainder of my career.  Ideally, I'd like to get a job with somewhat comparable pay. I know, I know, \"just rejoin, you only have 10 years til retirement.\" Yes, that is true.  But 10 years can be a long time! And I have two kids. So the idea of not having to relocate, change schools, etc., every couple of years sounds nice. \n\nGoing to law school is a big shift in my career, and a big part of me also feels like it would be a good time to permanently make the shift from military to civilian life.  Like a lot of folks, I have no idea of the scope and variety of opportunities await on the other side of law school, or if I will enjoy working at a firm, but I do have the luxury of being able to compare it to my military experience.  Working in private practice sounds oddly exciting and scary at the same time. While I plan to use my time and internships during law school to help me figure out this decision, I feel like my timeline for making this decision is shrinking due to the changes in biglaw hiring (which i suspect may also affect midlaw firm hiring timelines). \n\nI will be in the reserves during school, so I will have the opportunity to earn a military retirement either way.  My gut instinct is telling me to just see where I stand after my fall 1L grades come out and see what opportunities are realistic.  If I realize that I'm more interested in finishing my military service as a JAG, then I could always apply during 2L/3L. \n\n  \nI would appreciate any insight or advice! I'm clearly overthinking this.",
    "score": 10,
    "url": "https://reddit.com/r/LawSchool/comments/1m1kqp5/jag_vs_private_practice/",
    "created_at": "2025-07-16T18:39:23.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1l9p7uo",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "What are starting salaries for private practice non-big law?",
    "text": "After lots of career research and job applications/interviews (and offers), I have a good feel for the starting salaries for Big Law and (local, state, and federal) government.  However, I honestly still have not figured out what the private (non Big Law) salaries are.  The only indication that I get is that insurance defense pays something like $90K to start in an average cost of living place.\n\nDoes anyone have indicators of what private small and medium firms pay to start (and mid- and end-career)?  Of course certain Mid Law and boutique firms will pay close to, or more than, Big Law; I am not talking about those places.",
    "score": 9,
    "url": "https://reddit.com/r/LawSchool/comments/1l9p7uo/what_are_starting_salaries_for_private_practice/",
    "created_at": "2025-06-12T15:22:45.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1lftdl2",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "I’m curious to know what you do. What’s your area of the country? What was your undergraduate major? And if you remember, what was your starting salary?",
    "text": "Hey everyone! I’m a rising 3L here, currently working in a very niche area of law this summer. However, I don’t think it’s my cup of tea. I have a background in biology and have been considering taking the patent bar. I’d love to hear your thoughts. What do you do? Do you enjoy it? Would you change your career path?",
    "score": 8,
    "url": "https://reddit.com/r/LawSchool/comments/1lftdl2/im_curious_to_know_what_you_do_whats_your_area_of/",
    "created_at": "2025-06-20T02:56:11.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1lpci6v",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Fair Pay for a Post-Grad Law Clerk",
    "text": "I am a recent law school grad (May 2025), and working as a law clerk until I take the bar in February. I'm looking for another law clerk position in family law (love my current place but it's a solo practitioner who doesn't have enough hours for me). I'm currently making $23/hr, is it reasonable to ask for at least $25/hr at a mid-size firm? I have over 2y of experience in family law, both assisting a family court judge and at my current firm. I know I do good work, and I have great letters of rec, but my grades weren't the best and I don't want to be presumptuous and ruin opportunities for myself. I have no relatives in law and am still trying to figure out what is appropriate and expected by talking to attorneys, but I thought would ask on here too. The starting attorney salary in family law where I am is around $80k-$110k according to career services. Thanks in advance for any perspectives and advice!",
    "score": 8,
    "url": "https://reddit.com/r/LawSchool/comments/1lpci6v/fair_pay_for_a_postgrad_law_clerk/",
    "created_at": "2025-07-01T20:28:43.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1hn3q00",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "My job wants me to work pre and post bar?",
    "text": "I recently got offered a \"post bar\" position at the firm where I did my 2L summer internship. Which is great and all, but when I went in to accept the position IRL, the main guy told me he wanted me to start end of May and we could push it to June. He made it seem like it was a part time position before the bar, and full time after the bar. But they're paying me salary before the bar.... like in the pre-bar period he was saying I could leave early for bar prep classes and they would try to not give me so much work that I'd be drowning, but like if the work needed to be done they'd want me to come in on a Saturday or whatever. and im like hmmm that definitely sounds like a full time position but just not a M-F 9-5, you know??\n\nidkkk maybe im stressing for no reason,  but is this normal or has anyone heard of this? Im assuming they havent hired a 3L out of law school in foreverrr, which is why it feels a little unstructured. I was thinking they'd say like \"oh 2 weeks before the bar you will be studying and not expected to work\" and like \"oh after the bar you need at least a week off\" but they didnt say that... Im sure I could bring up needing a break when the time comes (??lmfao) but let me know if yall know anything about this kind of arrangement and if its good/bad/they think im a superhero/theyre plotting on my downfall. thanks in advanceee ",
    "score": 8,
    "url": "https://reddit.com/r/LawSchool/comments/1hn3q00/my_job_wants_me_to_work_pre_and_post_bar/",
    "created_at": "2024-12-27T01:37:26.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1nr2vn8",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Recent Grads",
    "text": "I know a lot of newer attorneys are having trouble finding entry level positions, so I wanted to throw out that my firm's NY office is hiring a junior litigation associate for work in NY, NJ, and PA. Any of the admissions would be helpful and they'd help get your other admissions. Salary 90k-100k. Hybrid work. Flex PTO. Student Debt Repayment each month. Shoot me a message if you're interested. \n\nThere is also a position in NJ looking for 1 yr exp. or another NY position looking for 3 yr exp.\n\nTook me 6 months to find a job when I was looking, so I get the struggle! ",
    "score": 7,
    "url": "https://reddit.com/r/LawSchool/comments/1nr2vn8/recent_grads/",
    "created_at": "2025-09-26T14:30:34.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1ivbowp",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Exhausted from the Pressure and Environment",
    "text": "I normally don't post but this is something I feel like I need to get off my mind. I am severely struggling with law school. I have been so violently depressed, despite doing everything I can to mitigate the stress. I try to take care of myself, go to therapy, work out, and try to sleep the full eight hours (I'll admit that I am failing at this time to time). \n\nSo for some context, I am a 1L in my spring semester. Recently, one of my parents (well familial father figure) died suddenly over Christmas. I didn't do very well in terms of grades last semester and have mourned it but came back this semester to do better (and before anyone says it, I am not planning to take a gap semester and have thought it over significantly).\n\nI've met with professors to try and figure out what I did wrong about exams and have been studying non stop. Though I feel excited at this new semester, I feel sick to my stomach every day. \n\nI am a low income person of color who has been on my own for a while. Despite having plenty of friends and community at school and outside of it, I have never felt so alone. I have my friends who are so incredible and supportive outside of law school, but there's only so much they can do to make me feel supported when I go into that building. I am  experiencing so much racism and \"otherness\" in my day to do. The casual micro aggressions, and often times just blatant comments. On top of that, it's the exhaustion of watching my very privileged classmates not get what they think they deserve (a big law job or some other prestigious position) and experience disappointment for the first time in their lives.\n\nI'm very friendly with everyone in my year (I'd say well liked) and people often confide in me about their struggles with law school. I don't mind offering an ear or just offering words of encouragement. I think often though I feel myself limited on the ability to continuously extend compassion and grace when the grievances they air usually stem from an insecurity surrounding their ability to do well. It kind of just makes me think, \"Damn if you're worried, should I feel fucked? You had straight A's\"\n\nI'm not even phased by failure, rejection, or just straight up the lack of opportunities anymore. I know this is a part of life and I welcome the challenge to just do better. However, these constant interactions (many unsolicited because of the forced proximity with my classmates) have been making me feel insecure. Getting an education is the greatest honor of my life and I feel grateful every day to be here. However, I feel the pressure to be perfect socially, academically, and with my career. Having not done well academically I don't know how to distinguish myself. Everyone keeps telling me that it'll be impossible to get any kind of job with a significant salary, but I don't even know if BigLaw was what I wanted anyways. It just feels like I'm being told to accept the fact that I shouldn't expect much for myself which is sad.\n\nSometimes I just wonder what I'm doing. I don't care about belonging, the system wasn't made for me anyways. However, I wish I could just feel some hope. I don't know if this even makes sense I just wanted to share. ",
    "score": 7,
    "url": "https://reddit.com/r/LawSchool/comments/1ivbowp/exhausted_from_the_pressure_and_environment/",
    "created_at": "2025-02-22T05:37:49.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1mbr7tr",
    "subreddit": "LawSchool",
    "soc_codes": [
      "23-1011"
    ],
    "title": "Is Going for an LLM in Taxation worth it if my firm is offering to pay for it?",
    "text": "I am currently at a small Estate Planning/Tax Boutique Firm as a 2L Summer Associate. They offered me a full-time position post-grad and offered to pay for my LLM. I am interested in tax law, and I genuinely like the firm I’m at currently. Is the LLM worth it? It would be approximately 2 years post-graduation if I were to do it part time.\n\nUpdate: I’m going to accept the offer. I just got a formal offer letter today. They offered me a really good salary (not big law salary but great for a small firm), individual health/dental benefits, 401k, and I only have to commit to working at the firm for three years. There’s no billable requirement and I may get a bonus depending on the hours I do bill/firm profitability. I would do the LLM part time while working.",
    "score": 6,
    "url": "https://reddit.com/r/LawSchool/comments/1mbr7tr/is_going_for_an_llm_in_taxation_worth_it_if_my/",
    "created_at": "2025-07-28T20:21:41.000Z",
    "num_comments": 14
  }
]