[
  {
    "id": "reddit-1oqi4t2",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "This industry is getting out of control.",
    "text": "There was a mechanic that flips cars, does wholesale cars, that used to use me for keys quite often, for about a year and a half to two years. He hasn’t called me in a couple months, like three or four months, so I figured either his business wasn’t doing good, either, you know, he found someone cheaper than me, or he just didn’t want to use me anymore, and I couldn’t exactly tell why.\n\nBut I just had him call me, and he goes, “Hey man, I need help for a 2023 Dodge Ram 3500. I need a key for it. I need help.” I go, “Okay.” I give him my price, and he goes on the phone, “No man, like I need help programming the key,” and I’m like, “What do you mean?”\n\nAnd he goes, “I’m at a car lot,” and then he gives me the name of the car lot, which is another lot that I work with and get business from, and he says, “I’m trying to program a key using everyone’s favorite programmer (I’m sure you can figure it out) and a certain bypass cable, and it isn’t working. Can you help me out and tell me why?”\n\nAnd then he proceeds to tell me that he purchased this equipment and this key from a local key supplier in my town that legally isn’t allowed to sell this equipment or inventory to people that aren’t licensed locksmiths in my state. So, this guy is doing work illegally, and the supplier is selling these tools and inventory illegally.\n\nOf course, I was pissed, and everyone with a brain, or everyone that knows this work, knows you need Witech for newer Mopar vehicles, and he didn’t know that, and now that car lot is calling me because they couldn’t figure it out.\n\nBut this industry is getting ridiculous. People running around doing work like this, unlicensed, uninsured, undercutting everyone. It’s really agitating. I’ve even been debating learning a different trade or finding a separate line of work and selling my business altogether. ",
    "score": 98,
    "url": "https://reddit.com/r/Locksmith/comments/1oqi4t2/this_industry_is_getting_out_of_control/",
    "created_at": "2025-11-07T02:08:41.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1nixaiq",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "🚨 PSA to fellow locksmith techs: consider carrying protection on the job",
    "text": "Last month I had a scary encounter after programming 2 keys for an F-250 - the customer stabbed me and drove off with the vehicle. Thankfully I survived, but it made me realize how vulnerable we are out in the field.\n\nWe meet people in random locations, often late at night, with no backup. I honestly believe every locksmith technician should look into getting their concealed carry license and carrying legally for self-defense.\n\nI just want to put this out there to remind others: be careful, stay aware of your surroundings, and don’t take your safety for granted.\n\nStay safe out there, everyone.",
    "score": 92,
    "url": "https://reddit.com/r/Locksmith/comments/1nixaiq/psa_to_fellow_locksmith_techs_consider_carrying/",
    "created_at": "2025-09-16T23:28:34.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1lg9oe0",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "Non-Locksmiths: Please Don’t Be That Guy!",
    "text": "Shout out to the customers that call us out for one little thing then proceed to ask us to work on every door on the property!\n\nJust a friendly reminder that most of us have busy schedules and can’t hang around and be your personal door repairman all day! Please mention in your call that you have multiple issues so we can schedule for it! That is all.",
    "score": 65,
    "url": "https://reddit.com/r/Locksmith/comments/1lg9oe0/nonlocksmiths_please_dont_be_that_guy/",
    "created_at": "2025-06-20T17:21:56.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1p6tx48",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "I’ve started fighting back the scammers",
    "text": "Lately when I have time I call the known scam call centers in my city and have them send their bait and switch scammers out. Usually when I’m eating lunch or at the bar at the end of the day. They come out and call me and I say “oh don’t worry I’m on the way I’ll be there to meet you in 20 minutes!” It’s great lol I’ve been making them come and wait for me for almost 2 hours at some points. I’ll continue to do so as I’m definitely pissing them off ",
    "score": 60,
    "url": "https://reddit.com/r/Locksmith/comments/1p6tx48/ive_started_fighting_back_the_scammers/",
    "created_at": "2025-11-26T00:51:26.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1itj6a4",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "Let’s talk about salaries. Please read description",
    "text": "I’d like to start a healthy discussion with other American locksmiths about our salaries as I wouldn’t know generally how much a locksmith should be making with my experience or skills. I have been working residential, commercial and some automotive for 5 years now. I would say I have drastically improved my skills on the commercial side within the last 2 years. I work for a small business which is ran by my boss and I’m the only technician and we are only mobile. I get paid $25 an hour and get 22% commission, with the option to work 6 days. All business expenses are paid for  with a company card. I have health insurance and can request time off but I don’t have pto. I also get $6k yearly bonus that is not taxed. I’m making $80k gross per year. I live in HCOL area. Why I wanted to spark this conversation is because I’ve seen some people on the sub saying they get 30-40% commission and the don’t mention any other specifics about their pay but they usually will think that it’s not enough and I’m here thinking “30% isn’t enough or fair” seems like way more then fair but again I’m not sure what the majority of technicians are getting paid and what skills or experience they have. ",
    "score": 18,
    "url": "https://reddit.com/r/Locksmith/comments/1itj6a4/lets_talk_about_salaries_please_read_description/",
    "created_at": "2025-02-19T22:52:26.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1iozo2y",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "When people say “isn’t that lock-picking set illegal?” Do you use it nefariously?",
    "text": "No. I would lose my career. Criminals bust locks they don’t tend to pick them. A bolt cutter, a hammer, a drill, even a rock is a much faster way in. You don’t need security clearance to obtain any of the above and they will get in much faster. I also am wearing a shirt that says I’m a locksmith, with business cards saying I’m a locksmith, that have a number to my company confirming I am a locksmith. So unless I’m lurking around in a dark ally, picking locks without a call, there is no reason to think conclude my picks are for anything other than my profession. Why is this confusing to most people?\n\nEdit; I’ve realized this is a Vancouver Canada, problem. This city is terrible. Do not make it your next vacation destination. ",
    "score": 16,
    "url": "https://reddit.com/r/Locksmith/comments/1iozo2y/when_people_say_isnt_that_lockpicking_set_illegal/",
    "created_at": "2025-02-14T01:54:07.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1mcm5kd",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "Good deal?",
    "text": "I recently got a job as a locksmith and I was just wondering about industry standards. What's a typical work schedule for a locksmith? Do you work on call more than 60 hours a week? Do you typically make salary plus commission? Just trying to understand my employment opportunity better!",
    "score": 11,
    "url": "https://reddit.com/r/Locksmith/comments/1mcm5kd/good_deal/",
    "created_at": "2025-07-29T20:12:38.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1m5z73x",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "Becoming a locksmith - is this a good path?",
    "text": "I'm an OTR trucker and frankly I hate it. I'm inheriting a good chunk of money, not enough to retire in Belize but enough to pay off basically all my debts and keep me fed and housed for maybe a year or so. I've been interested in this field since basically forever, and it seems like this would be a good opportunity to switch careers. \n\nALOA has a basic training class coming up in October, and that seems to me like a reasonable step forward. I have really good mechanical aptitude and I only 70% suck with a pick, I'd probably do alright without the training as an apprentice so the formal training might not really be necessary. Maybe. I get the feeling that learning on the job is much better than a classroom but that doesn't mean the classroom doesn't have its benefits, especially when it comes to credibility. \n\nWhat are your thoughts on this? Should I just pull the trigger or are there better ways forward? ",
    "score": 11,
    "url": "https://reddit.com/r/Locksmith/comments/1m5z73x/becoming_a_locksmith_is_this_a_good_path/",
    "created_at": "2025-07-21T23:59:02.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1j8axmh",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "Can you have a regular schedule working as a locksmith/ technician?",
    "text": "I'm considering a career as a locksmith and am working if its possible to maintain a regular work schedule in this trade? Mon-Fri 9-5 a reality or a fantasy? I wouldn't mind the occasional weekend shift but I've heard there can be some pretty unusual working hours as a locksmith?",
    "score": 8,
    "url": "https://reddit.com/r/Locksmith/comments/1j8axmh/can_you_have_a_regular_schedule_working_as_a/",
    "created_at": "2025-03-10T22:09:16.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1ko6riy",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "Best Practices for Finding and Hiring Locksmith Employees?",
    "text": "I'm in a weird spot with my locksmith business, so I apologize in advance if this is a bit wordy. Any advice you have for me is greatly appreciated...  \n  \nI needed to quickly get out of a toxic environment in an office job, so I started training with a locksmith friend on site over the weekends for approximately six months. My education was limited, but the time came abruptly for me to leave, and I had a newborn to care for.   \n  \nI quickly started up my locksmith business and got to work with the limited knowledge I have out of my little hatchback. It was a lot of trial by fire (I'm sure you're all familiar with that stress), but I was making ends meet and kept us financially safe.   \n  \nAs it turned out, my honesty and integrity was very attractive to clients (thanks Israeli scammers!), so my business grew exponentially year over year. Now I want to enroll to get a proper education and expand the services I offer, but being owner-operated has me stuck because I don't want to close up shop while I'm away for training, and honestly, at my age, it's getting difficult to do it all on my own. I want to make moves to find people I can trust to do the work for me as I go to school to improve my skillset, and maybe even step away entirely and let my employees run the show one day. \n\nAll that said, my gameplan looks like this...   \n\n1. Hire and train a locksmith for overnight simple lockouts to see if customers like him and see if he is self motivated enough to eventually assist me in taking jobs during the day.\n2. Hire a full time locksmith to do the jobs I don't have the skillset for yet so I can offer those services, but also have an in-house mentor as I expand on my own education.\n\n  \nThis gameplan leaves me with the following questions for you...\n\n1. For the overnight lockouts hire, I would train him myself. Where do you think would be a good place to find potential locksmiths to hire? I have already thought to post on my socials, but I'm wondering if there are places locksmiths prefer to go to find companies that are hiring? If you have employees, where did you find them?\n2. Do you think it's a good idea to hire a locksmith that has a skills I don't have yet? Has anyone here done that? I would assume hiring someone with more knowledge than the owner could create friction, frustration or a clash of egos. Has anyone here done something like this? Did it work out for you?\n3. What does salary look like for you? I was thinking of doing a \"share the wealth\" policy by splitting profits with my employees 50/50 to keep them motivated, happy and engaged.\n4. Do you have any other advice to lend as I go through the journey of expansion?  \n\n",
    "score": 7,
    "url": "https://reddit.com/r/Locksmith/comments/1ko6riy/best_practices_for_finding_and_hiring_locksmith/",
    "created_at": "2025-05-16T17:32:48.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1m8jcwv",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "Wanting to become locksmith",
    "text": "I recently was offered an early retirement at work that I'm considering taking. I'm young enough to start another career, and I'm considering becoming a locksmith, but don't know where to start.  I assume there's a school, but for whatever reason i don't seem to find any around me (Oklahoma City). Any re3commendations? Online schools?",
    "score": 5,
    "url": "https://reddit.com/r/Locksmith/comments/1m8jcwv/wanting_to_become_locksmith/",
    "created_at": "2025-07-24T23:13:32.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1jsddxd",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "genuine question",
    "text": "someone i know just got a job as a locksmith and I don't really know if it's legitimate or not? they have to meet with someone to drop off the money where they will get a percentage of, they're solely commission (this part I'm not too weirded out by), and they can apparently name their own price. they just got this job a couple of weeks ago and says they can make 80k, and makes $500-$1000 a week. I know NOTHING about locksmithing as a career, is this the norm? it sounds so bizarre to me and i don't want them to get screwed over.",
    "score": 5,
    "url": "https://reddit.com/r/Locksmith/comments/1jsddxd/genuine_question/",
    "created_at": "2025-04-05T20:52:55.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1m6zm5m",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "ALOA - How did it go?",
    "text": "I’m interested in hearing from anyone who has attended prior ALOA locksmith trainings. I will be registering for the Fundamentals of Locksmithing class. \n\nHow useful was the training in beginning your career? Was there a networking component or opportunities? Anything you wished you knew prior to attending? \n\nHelpful info is helpful and thanks in advance for any advice or experience you want to share. ",
    "score": 5,
    "url": "https://reddit.com/r/Locksmith/comments/1m6zm5m/aloa_how_did_it_go/",
    "created_at": "2025-07-23T04:15:15.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1iei6xi",
    "subreddit": "Locksmith",
    "soc_codes": [
      "49-9094"
    ],
    "title": "Apprenticeship or education?",
    "text": "Hi guys! Had a question about getting started. \nI'm in my early thirties, looking for a career shift that could potentially lead to my own business. I've gotten pretty good as an amateur at picking basic tumblers, and Ive read a couple of locksmithing books - I feel like this could be a fun industry to break into. Plus, I live in a state where licensing is very accessible. \n\nRight now, I work in an office and while I don't make very much money, I'm making quite a bit more than I would as a locksmithing apprentice. I live in a pretty high cost area, so my question is this: \n\nShould I quit my office job and try getting a low paying apprenticeship? Or does it make more sense to keep my current position and try to learn locksmithing through education (college classes, YouTube, etc etc)? How long do apprenticeships usually span in order to have the knowledge to start striking out on your own? I'm not expecting to make any money at the beginning either way, and I understand paying your dues, but a man's gotta eat and I'm just crossing all my t's. \n\nThanks!",
    "score": 5,
    "url": "https://reddit.com/r/Locksmith/comments/1iei6xi/apprenticeship_or_education/",
    "created_at": "2025-01-31T16:07:26.000Z",
    "num_comments": 11
  }
]