[
  {
    "id": "reddit-1ns4qsr",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Rubik's Cube- Manually machined from aluminum, fully functional",
    "text": "Hi everyone, thought I'd share a passion project of mine that I did over this summer. I'm a college student who learned the basics of machining for my manufacturing class, and I thought I'd use my college's makers' space to make something really memorable.\n\nDisclaimer: I didn't create the original design myself- the idea and drawings were adapted from this website: [https://lulabs.net/machining/ss-cube/](https://lulabs.net/machining/ss-cube/)\n\nHowever, I did need to do a substantial amount of adjustment to the original plan to suit my needs. I ended up making it out of aluminum, mostly because, as the website points out, a steel cube is way to heavy to be easily solvable.\n\nMaterials used:\n\n\\-4' of 1\"x1\" square 6061 stock\n\n\\-1' of 3/8\" rod 6061 stock\n\n\\-6 4/40 screws\n\n\\-6 small compression springs, max load of 1-2 pounds\n\nLet's go through the basic process. First up are the \"plans\" I used throughout- they ended up looking pretty insane. The best part of solo projects is that your plans only have to make sense to you. The cube consists of:\n\n\\- a six-sided core with tapped holes.\n\n\\- six stems with one small through hole and one larger blind hole as well as external threads. This stem traps a spring-loaded screw, which presses the whole cube together while allowing it to rotate freely.\n\n\\-six face centers, with curved inside faces and a blind, tapped hole for the stems.\n\n\\-eight corner pieces\n\n\\-twelve edge pieces. The edge and corner pieces have straight cuts as well as circular cuts, which was probably the biggest problem I had to solve.\n\nFirst up, cutting parts to size and squaring them up. This was easily the most tedious part of the whole project- the whole thing is really cool and I'd recommend it to anyone who has the skills, tools, and time, but there's no getting around the fact that squaring up 27 parts really sucks.\n\nNext, the stems. These were unexpectedly difficult- it's really hard to precisely machine a part that's only half an inch long in a lathe designed for parts that are multiple feet long. I also had trouble getting the threads straight, which is part of why I had to redo some of the stems.\n\nThe 7th pictures is of the face centers, after they've been given the circular cut to make the internal curved surface. I ended up using a boring bar for all the circular cuts- it was a little scary running a cutting tool at a 1.5\" diameter and 1750 rpm, but all went well.\n\nThe next two pictures are drilling and tapping holes in order to put together the stem-face center assembly. Again, getting straight threads was a challenge, and probably was the biggest contributor to wonkiness in the final product. Notice the hole on the exposed side of the stems- that's where the end of the 4-40 screw will go through.\n\nThe 10th pictures is of the core- dialing in such a tiny part on a large 4-jaw chuck was extremely frustrating, but it ended up working shockingly well.\n\nNext up, the corners and edges. First, they get rectangular cuts with an endmill. This was where the most material was taken off. To finish them off, the circular cuts with the boring bar. The corners get 3 circular cuts each, and the edges get 4 each.\n\nIn the 13th picture, you can start to see how the cube works mechanically- each edge and corner piece is designed to be able to slide freely past the others while being pressed against them. The face center is able to rotate freely, and the edges and corners are brought along for the ride.\n\nAfter all the parts were \"done\", there was a lengthy amount of finishing. Picture 14 shows the middle of the process, after I had used a file to chamfer the internal edges and remove sharp corners that interfered with turning. At this point, the cube had been fully assembled many times but this was the first time it actually behaved like a rubik's cube.\n\nNext, every external edge needed a chamfer, both to prevent people from cutting themselves, and to make it look more like a professional rubik's cube. I did that with some V blocks and an endmill.\n\nI went back and forth on the final look of the cube- I wanted the fact that it was made out of metal to be front and center, so painting it to look like the real thing was out of the question. Some people suggested anodizing it, but you can't really anodize just one face of a part. So I decided to engrave shapes in each face, and paint those shapes. That way, the cube has familiar colors while also preserving the bare metal look (and being solvable while blindfolded!)\n\nThe trouble with this, though, is that the engraving process I used was very susceptible to mistakes. I just used a ball-tipped endmill and cut about 7 thou deep. This looked great when it was done perfectly, but if any part of the setup wasn't flat, then the engraving in question was too shallow and narrow in some places, and too deep and wide in others. A few of them turned out that way... unfortunate, but not really fixable without making a new part.\n\nThen, finishing. I used a scotch-brite buffing wheel, which was much faster than sandpaper, and allowed me to easily align all the surface finish grains in one direction for extra style. I had to be choosy about which nicks and pits to try to buff out, because the engravings were so shallow that I risked making them look weird by taking off too much material. The freshly buffed cube (assembled and disassembled) are shown in pictures 16 and 17.\n\nLastly, painting. I used acrylic, which actually worked really well- when I got the water-paint ratio right, the surface tension of the water allowed the paint to fill up the slot easily without running over or sloshing around. To protect the paint, I also sprayed the whole thing with a clear coat.\n\nAnd that's it! The finished cube is shown in more detail in the last two pictures. You may be wondering, how well does it work? The answer is, about the same as an official rubik's brand. So totally serviceable, but by no means viable for a speedcuber.\n\nIt took a lot of work (at least 50 hours, probably more than 100), but I had a blast doing it. I know a lot more about machining now than I did a few months ago, and it was a much better use of my summer free time than playing video games and reading books.\n\nEdit: Here's a link to a video of me solving the cube, so you can get a sense of how well it turns.\n\n[https://www.reddit.com/r/Cubers/comments/1nsct6a/by\\_popular\\_demand\\_heres\\_a\\_video\\_of\\_me\\_solving\\_the/](https://www.reddit.com/r/Cubers/comments/1nsct6a/by_popular_demand_heres_a_video_of_me_solving_the/)",
    "score": 3651,
    "url": "https://reddit.com/r/Machinists/comments/1ns4qsr/rubiks_cube_manually_machined_from_aluminum_fully/",
    "created_at": "2025-09-27T19:59:16.000Z",
    "num_comments": 108
  },
  {
    "id": "reddit-1jwy4l7",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Inches vs Millimetres — What’s the Standard in Your Shop?",
    "text": "Alright machinist hive mind, riddle me this: how many of you are still knee-deep in inches, and how many of you have entered the enlightened world of millimetres?\n\nI’m genuinely curious — especially you lot over in the States. Do you actually choose to work in inches, or is it just whatever lands on your bench that day? Like, do you wake up and think, “Ah yes, today feels like a 1/64 kind of day”?\n\nHere in the UK, we officially use millimetres, but let’s not kid ourselves — it’s a Frankenstein’s monster of metric and imperial. Threads in inches, measurements in mm, tools from who-knows-where. It’s like a bad rom-com where neither system really commits.\n\nFrom what I gather, the EU is strictly millimetres (good for them), and I’m assuming Japan doesn’t entertain our imperial nonsense at all.\n\nSo what’s it like in your corner of the world? Do you stick to one system? Bounce between both and hope for the best? Ever completely borked a job because someone forgot to convert, or missed it totally? \n\nGenuinely curious what it’s like in your shops. ",
    "score": 2789,
    "url": "https://reddit.com/r/Machinists/comments/1jwy4l7/inches_vs_millimetres_whats_the_standard_in_your/",
    "created_at": "2025-04-11T19:18:55.000Z",
    "num_comments": 518
  },
  {
    "id": "reddit-1kyktkv",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Spent 3 days making a 2 axis machine to save 3 hours at the drill press",
    "text": "Now I can place as many holes as I want at whatever spacing I want and they ll all be in a nice straight line! Using these for irrigation and aquaculture spray bars. ",
    "score": 2563,
    "url": "https://reddit.com/r/Machinists/comments/1kyktkv/spent_3_days_making_a_2_axis_machine_to_save_3/",
    "created_at": "2025-05-29T20:09:53.000Z",
    "num_comments": 97
  },
  {
    "id": "reddit-1me5zt7",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Cycling from the Top of Alaska to the Bottom of Argentina and Found A Machinist in Chilean Antarctica to Rebuild This Shattered Spindle",
    "text": "I’ve been cycling from Alaska to Argentina [Prudhoe Bay to Ushuaia]. After my third and final Chilean border crossing in Torres del Paine, my bike’s drivetrain had developed a drunk wobble – never a good sign – but outlasted the next 40 miles to Puerto Natales.\n \nWhen a mechanic there unlocked the cassette, we heard a metallic jangle of splintered pieces hitting the floor. It wasn’t an eje [axle], but his best approximation between languages was “el corazón del hub.” I’d yet to learn the Spanish word for “spindle.”\n \nIt didn’t make sense that such a specific interior component could shatter while the rest of its housing remained intact. We dug through a few talleres and tool sheds across town to find Jorge, a friendly machinist who thought he could fabricate a replica from raw materials. There were several new words to learn here as well. I’d worked with a soldador [welder] back on the Peru Great Divide, but never a herrero [blacksmith]. It took three tries, but Jorge’s replacement fit as hoped the next morning.\n \nAnother 150 miles to Punta Arenas, riding through sunsets and sleeping wherever possible. I camped in an abandoned garage one night for shelter from the wind, then used my bike as a stepladder to climb through the rear window of an empty refugio.\n \nA weathered face, a familiar wilderness, pockmarked with fishing huts and scraggy tundra. I’d forgotten all these colors, the same figgy sapphires and sage mosses from my highest mountain passes, like an old shadow that turned left when I went right.\n \n“Of all the things I wondered about on this land, I wondered the hardest about the seduction of certain geographies that feel like home — not by story or blood but merely by their forms and colors. How our perceptions are our only internal map of the world, how there are places that claim you and places that warn you away. How you can fall in love with the light.” - Ellen Meloy, The Anthropology of Turquoise",
    "score": 2475,
    "url": "https://reddit.com/r/Machinists/comments/1me5zt7/cycling_from_the_top_of_alaska_to_the_bottom_of/",
    "created_at": "2025-07-31T16:19:49.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1izg19n",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Connecting Rod",
    "text": "I machine a lot of large connecting rods for the oil industry. This rod started off as a forged rectangular block of steel and was profile machined to a “rough casting” before the finish work began. Tape measure for scale….",
    "score": 2140,
    "url": "https://reddit.com/r/Machinists/comments/1izg19n/connecting_rod/",
    "created_at": "2025-02-27T13:41:01.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1ltzjef",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Spent the morning chopping up stainless to then find out it's the wrong size",
    "text": "I was setting up a job on CNC and we were running 200 parts off, we have a CNC saw at our place so I got the material for the job and set that running and didn't think anything of it.\n\nWent to program the machine and set up all the tooling. I got one of the parts off the saw and was setting the part postition and something felt off but it didn't think anything of it.\n\nTook a face mill to it and when I went to look at it I knew it was wrong.\n\nI initially thought I went to deep but then when I checked the stock found it was 1\" 1/8 instead of 1\" 1/2 \n\nSo we were missing just under 10mm to begin with\n\nAnyway ended up having to chuck the lot, luckily hadn't got to far down the next bar and waste a morning.\n\nWhat's the worst situation of having to throw a bunch of material away you've had?",
    "score": 1884,
    "url": "https://reddit.com/r/Machinists/comments/1ltzjef/spent_the_morning_chopping_up_stainless_to_then/",
    "created_at": "2025-07-07T16:59:15.000Z",
    "num_comments": 132
  },
  {
    "id": "reddit-1lbizlr",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Just got graduated in machining school.",
    "text": "I just fineshed my 2 year (free) course, and, and got two prizes! The best student in the school and a mitutoyo prize (Gives me a set of calipers) that is one for the best student in the machining course and one for the maintenance course.\n\nThe first pic is our final project, it took a little less than a year, all made by us, on manual and cnc machines.\n\nThe second pic are the parts that I made in the on the cnc machines, I programed, prepared and operated 10/12, (I didn't make the plastic handle and the bass bushings) And I ended up making all the cnc mill parts because, nobody cared to do then, or they just couldn't, on I and one friend got to really learn the basics of a cnc mill, and I could make pretty much any part that the teachers asked, so thats the main reason that I got the prizes. \n\nOur class had 26 of the 32 that started, And there ware a handful of students that actually wanted to be there.\n\nI got to learn a lot, but there is much, much, more to be learned, I want to follow the metalwoking career, and I am looking for my first job, at least as a setup guy, or as aprentice one, but I would be happy with pretty much anything, as I'm still in high school (finishes in december). Wish me luck guys!",
    "score": 1215,
    "url": "https://reddit.com/r/Machinists/comments/1lbizlr/just_got_graduated_in_machining_school/",
    "created_at": "2025-06-14T20:59:55.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1nkatch",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "No, we can't do this job it's to big.... But what if we........",
    "text": "We move the cnc to the main workshop. Have the crane support the otherside (it weighs ~1600kg my machine ways ~1500kg). Turn down the acceleration of the machine and move the crane together with the machine. And mill it with a parallel toolpath so the x axis doesn't have to move fast. I only needed the estop twice.",
    "score": 1174,
    "url": "https://reddit.com/r/Machinists/comments/1nkatch/no_we_cant_do_this_job_its_to_big_but_what_if_we/",
    "created_at": "2025-09-18T15:06:53.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1jj74tv",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Yeah, I was a bit overly dramatic...",
    "text": "I am the whiny little guy that made that overly self deprecating post about not smoking weed as a machinist.\n\nI have gotten over the hump of not smoking any more and I honestly feel great. I never realized how much free time I had since I stopped. Where I would just smoke and watch YouTube videos or mindless play COD until I passed out. \n\nI didn't use fake piss, I used the Qcarbo, drank water and cranberry juice like mad and took B vitamins and ate ramen for the sodium and passed. \n\nI don't plan to smoke again. \n\nI'll miss it, but I like being paid a healthy wage at a job I've always dreamed of. \n\nPlease feel free to razz me all you want, I deserve it, lol. But hey, I did it! \n\nI wanted to say THANK YOU to this subreddit for just making me realize that it wasn't the end of my career, or that I wasn't alone in my situation. \n\nI can't wait to start my new job and work with other machinists that are doing what I ve always dreamt of doing! \n\nThank you all once again!! ❤️",
    "score": 1104,
    "url": "https://reddit.com/r/Machinists/comments/1jj74tv/yeah_i_was_a_bit_overly_dramatic/",
    "created_at": "2025-03-25T00:49:36.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1ll3izs",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "I'm so bored at work that I made this",
    "text": "I got asked to run a coworker's machine while he was out. We only run one shift so we tend to think of them as our personal machine rather than a company resource to be utilized by all. ",
    "score": 872,
    "url": "https://reddit.com/r/Machinists/comments/1ll3izs/im_so_bored_at_work_that_i_made_this/",
    "created_at": "2025-06-26T15:46:43.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1ki6yhr",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Don’t challenge me to a pinewood derby, I’ll cheat every time",
    "text": "Asked to create a pinewood derby car out of aluminum for my career and technology class. ( I’m the instructor). So I used fusion 360 and created something cool that my students loved. ",
    "score": 669,
    "url": "https://reddit.com/r/Machinists/comments/1ki6yhr/dont_challenge_me_to_a_pinewood_derby_ill_cheat/",
    "created_at": "2025-05-09T01:39:00.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1luteap",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Programming isn‘t stressfull at all lol",
    "text": "This is exactly how I feel after a 10-12hrs working day. 😂\n\nI‘m programming for mold making and also operating my machine (DMF300), getting tools and workpieces ready and the usual stuff about machining. Sometimes I really feel like I aged 20 years in 5 years at Programming lol 😂\n\nI think I‘m not the only one? At least the programmers I know experience similiar things. Pressure, getting spindletime down, people from executive floor that have Zero clue about CNC but think it could be done faster. Well fuck you - the most of your programmers Are already at their limit. ",
    "score": 546,
    "url": "https://reddit.com/r/Machinists/comments/1luteap/programming_isnt_stressfull_at_all_lol/",
    "created_at": "2025-07-08T16:38:50.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1i5ez9d",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "A Story",
    "text": "Almost 20 years ago I was and engineering intern at a small sporting goods manufacturer and was excited to be designing my first new product. When I was finished I sent a part down to the machine shop to prototype. It was a mess. Square corners, fillets EVERYWHERE, you name it I'm sure this train wreck of a part had it. \n\nPretty quickly I got a visit from the guy running the machine shop who came into my broom closet and patiently explained everything that made this part impossible and a giant pain in the ass to make. I listened to all his advice and the next day had a brand new shiny model for him to machine. A week later after he MANUALLY programmed the g-code he brought the part to me, only to discover the part was 10 times smaller than it should actually be because I saved the dxf in the wrong scale. We had a good laugh because even though it was jacked it just looked comical. \n\nFast forward a decade, he had taught me how to machine, I had taught him CAD, and we were a great team cranking out prototypes and products at lightning speed. We both kept one of those original prototypes on our desks as fancy paper weights. \n\nFast forward another decade, I'd moved on to another company, but we still talked regularly and he would help me out machining some parts when I got overloaded. He'd give me shit about wondering if I could hold +/- 1/4 inch and I'd give him shit about running all his programs at 5% rapid. \n\nI got a call from a friend today telling me he'd passed away. His name was Rick Stansky and he was a husband, father, veteran, and a good friend. \n\n If you've made it this far, all I ask is the next time a green engineer sends you the impossible, instead of rolling your eyes go have a conversation. Rick changed my career and life for the better and I'll miss him. Thanks for reading. ",
    "score": 545,
    "url": "https://reddit.com/r/Machinists/comments/1i5ez9d/a_story/",
    "created_at": "2025-01-20T01:38:21.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1jffzcx",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Please don’t make the same mistake I did — a machinist’s warning about weed and your future.",
    "text": "Throwaway account for obvious reasons. \n\nI’ve debated posting this, but if it helps even one person, it’s worth it.\n\nI just wanted to take a moment to vent a little and, more importantly, maybe warn anyone who's new or even thinking about coming into this field.\n\nIf you're serious about making machining a career, please stop smoking weed.\n\nI’ve been a machinist for a long time — bouncing between small mom-and-pop shops, barely scraping by, wondering if I’d ever make it past dead-end jobs and meager paychecks. For years, I never thought I’d break out of that cycle. It felt like dream jobs were for other people, not me.\n\nBut recently… against all odds, I landed an opportunity. A real dream job. The kind of place I never thought I’d have a shot at. I was over the moon, my family was proud, but \nsomething hit me harder than anything else: my father was proud. Truly, unmistakably proud. I’ve spent so many years trying to reach that moment, trying to make him see that I was worth something. \nAnd there it was. That one moment felt like everything I’d ever worked for.\n\nBut here’s the part where I've ruined all of my life's work: because of my habit — smoking weed regularly for years — I won’t even get to set foot in that shop. \nThere’s a drug test, and I know I won’t pass. I’ve stopped smoking completely for two weeks now, ever since I found out I was being considered. I’ve been doing everything I can — water, cranberry juice, exercise — but it’s not enough. I’ve taken home tests, and I’m still coming up positive.\n\nAnd I’m not here to blame anyone else. I know it’s my fault. No excuses. I made the choice to smoke, thinking it wouldn't catch up to me because, honestly, I didn’t think I’d ever get a shot at something better.\n\nI just want to share this so no one else in the trade has to make this same mistake. You might not think you’ll ever “make it” to the big shops, or the great opportunities. But you might — and when that door finally opens, the last thing you want is to lose it over something like this.\n\nThat said, I’m not giving up. Seeing what’s possible lit a fire under me. I’ve quit smoking for good, and I’m determined to stay clean and keep working toward something even better. I want to make sure when the next opportunity comes, I’ll be ready.\n\nIf you’re younger, or just starting out, I hope you’ll take this to heart. Don’t let something like this hold you back from what you’re capable of achieving.\n\nStay sharp, stay focused. You’ve got a bright future — don’t sabotage yours like I did. ",
    "score": 328,
    "url": "https://reddit.com/r/Machinists/comments/1jffzcx/please_dont_make_the_same_mistake_i_did_a/",
    "created_at": "2025-03-20T03:34:02.000Z",
    "num_comments": 347
  },
  {
    "id": "reddit-1hr5mpy",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "All who cut metal for a living",
    "text": "Started the brand new year off as well as any of us that remove metal for a career could and would hope for.\n\nSwing around to plant me feet and hurl my ass out of bed. \n\nAfter lying awake ignoring the morning piss for 20 mins.\n\nThen land my foot right on this MF’r.\n\nMy first thought after investigating is.\nWell this chip looks a bit more torn than cut and the color isn’t quite what I’d like to see.\n\nI should slow down the RPM and kick up the feed.\n\n\n\n",
    "score": 307,
    "url": "https://reddit.com/r/Machinists/comments/1hr5mpy/all_who_cut_metal_for_a_living/",
    "created_at": "2025-01-01T15:57:06.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1l8rk0s",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Being a \"good/hard worker\" just gets you more work",
    "text": "A lesson I learned over my 10 years in this trade so far is that there is no amount of \"Going the extra mile\" you can do to get paid better than the guy who just shows up for the paycheck and nothing else. I've seen plenty of people on here argue the same point.\n\nI'm sure there *are* some shops out there that have a decent competitive salary system that works in this way, but I've never encountered one (I've worked in 3 different shops so it's not like I'm speaking from an echo chamber)\n\nWhen I was new at my current job I was given advice on Day 1 from the oldtimers to not try to do more than what's in my job description. Of course I ignored them and thought I knew better (protip to young guys: you probably don't).\n\nYou'll get a mouthfull of praise and thank you's from management and that's where it ends. Even if you think you're doing the right thing by sticking your neck out for the company and helping improve operational flow and job times, all it's going to do is get *you* a bigger schedule each week while the guy next to you just stays on his one machine and/or takes three times longer than you to finish the same piece.",
    "score": 306,
    "url": "https://reddit.com/r/Machinists/comments/1l8rk0s/being_a_goodhard_worker_just_gets_you_more_work/",
    "created_at": "2025-06-11T12:36:53.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1n14mp7",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "P.T.O. in this trade is absolutely garbage",
    "text": "I don't know if it's just cause I'm American and maybe it's better in other places, but 10-12 days per year of all-inclusive PTO in a skilled trade is one of the primary reasons I want to get out of this trade eventually after being in it for a decade.\n\nCatch a bad cold? Got covid or a flu? There goes at least 1/3rd of your vacation days for the year, just so you can lay at home in bed miserable. I've worked in 5 shops and not a single one of them had a sick day policy separate from PTO. What's worse is if you try to say \"well just don't pay me!\" to try and save your actual paid time off hours for better use, they tell you too bad bucko. I don't know why this concept is so hard to understand for CEO's/management either, if I get sick or have a family emergency and don't want to use my paid hours, what's the harm to YOUR wallet for not paying me for a day? It's not like this stuff comes up often. I'm not getting sick every month, I'm not having a death in the family every other week. These things are rare but they do happen to everyone.\n\nThe increments I've seen are also a total joke. 8hrs a month for your first 1-5 yrs, and then 8.66hrs for 6-9 yrs, 9.5 for 10+ yrs, and so on. What the F is that? My brother works from home as a marketing researcher 6 hours a day and gets 5 weeks off a year. His wife does marketing for a food industry brand and also works from home and gets about the same amount of time off.\n\nThis trade is not a sustainable lifestyle. I know there are good shops out there and they are hard to find. But each passing year I really begin to question my career choice desperately.",
    "score": 262,
    "url": "https://reddit.com/r/Machinists/comments/1n14mp7/pto_in_this_trade_is_absolutely_garbage/",
    "created_at": "2025-08-27T01:59:33.000Z",
    "num_comments": 172
  },
  {
    "id": "reddit-1ioaehs",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "This job is crazy man",
    "text": "I've been doing this for 10 years now. You'll be running parts for like a month that you've done a million times. Get lulled into a sense of familiarity and boredom, then you go to switch things up, forget one little value you don't pay enough attention to because it's whatever 99% of the time and boom crash just like that you went from 0 to 100 in a second. I had my hand on the rapid, i was watching the distance to go, but one stupid little fucking value like a needle in a haystack. You should know it, but its like you cant think of everything all at once all the time at the snap of a finger. It's wild. It was a relatively minor crash, extra part no harm done but fuck it bothers me and I can't deny it's fucking stressful. I feel like this career takes a special kind of person to not go crazy sometimes. Add on top of that the long hours and the pay that's decent but you think should probably better... Anyways this is my post crash vent post.",
    "score": 259,
    "url": "https://reddit.com/r/Machinists/comments/1ioaehs/this_job_is_crazy_man/",
    "created_at": "2025-02-13T03:52:27.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1mfxd3f",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Are metal 3D printer operators considered machinists?",
    "text": "I have some questions regarding job opportunities, lifestyle, career progression, etc. Just wanted to make sure I'm on the right subreddit. \n\nIf not, any suggestions where I should post? ",
    "score": 244,
    "url": "https://reddit.com/r/Machinists/comments/1mfxd3f/are_metal_3d_printer_operators_considered/",
    "created_at": "2025-08-02T18:17:04.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1osvymy",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Anybody else sick of this?",
    "text": "Is anybody else just sick of this trade? We're pretty highly skilled people in multiple disciplines. From trigonometry to geometry to engineering to programming. We work on multi million dollar machines and parts. The smallest mistake can wreck a machine and a million dollar part. All the while we try and talk sense into managers that never worked on a machine a day in their life and get talked down to. The work is either feast or famine. We don't have unions anymore so the smallest mistake can leave you looking for a new job and how you're going to pay your mortgage next month. We get paid like trash for the amount that we need to know. We trash our bodies the same as any other trade. It's not unthinkable that you could get killed or get cancer from breathing in this trash all day everyday. These companies are losing people hand over fist they think we're replaceable and any idiot off the street can do it because we just press the green button and make it look easy in their eyes. I'm about 15 years in now it's one of the only things I've ever known career wise and I'm just tired. I'm actively doing my best to go back to school and get that engineering degree but I just can't with this shit anymore. Is it just me? It very well could be that I'm just problem but I feel like if I started this 30-40 years ago things would be different. Am I alone in feeling this way? I wonder. ",
    "score": 188,
    "url": "https://reddit.com/r/Machinists/comments/1osvymy/anybody_else_sick_of_this/",
    "created_at": "2025-11-09T21:53:28.000Z",
    "num_comments": 177
  },
  {
    "id": "reddit-1kxm743",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Really considering leaving the Trade",
    "text": "Hey all I’ve been a machinist for well over a decade and I think I’ve hit my breaking point. I feel like I’m making less now than 5 years ago, the politics of a large part of the profession is consumed by right wing wackjobs, and since I got into my 30’s my body feels like it can barely do the work. I’m sick of coming home completely covered in grease and reeking like old, nasty coolant, and my back and shoulders being shot from being hunched over a lathe all day. I’m just completely over all the bullshit this job entails. Useless office staff, incompetent management, just fucking everything. So. My question for the Sub is what career could I even pivot to? This is all I know how to do, so I’m at a loss.\n\n\nEdit: Ok so I guess I should have added some details. I’m primarily a cnc guy, and the shop I’m at has me learning how to run the manual lathe and fuck off huge manual boring mill. I’m entirely self/shop taught, so I’ve got some weird gaps in my knowledge base. I know enough programming to get by, but I’ve never taken a class on it. I left my last shop so I could finally get on day shift after 12 years and not have to deal with the headache of living in IL and working in MO come tax season.  This was almost a year ago, and I’ve been to 3 shops since. The first straight up lied to me about a whole bunch of stuff and was unsafe as hell, the 2nd let me go the Friday before I hit 90 days and was trying to force me into a lower paying operator role before that. The place I’m at now was an ok pay bump, and I’m learning a whole lot. The problem isn’t the money, the shop, management or anything like that. The guy I work for has been awesome so far even. \n\nIt feels like I wake up every day feeling worse about this profession and I can’t deal with it for another 30 years. You could pay me $40 an hour and I would still feel the same way every morning.",
    "score": 139,
    "url": "https://reddit.com/r/Machinists/comments/1kxm743/really_considering_leaving_the_trade/",
    "created_at": "2025-05-28T16:54:19.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1kwk1fc",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Here’s what being a Machinist in Germany is like, how is it in the US?",
    "text": "While I am from the US all my machining experience is in Germany. \n\nBasically I want to know if what I experience here will be similar to the US.\n\nExamples:\nI work 4 10s, 6 am - 4:45 pm with a 15 minute breakfast and 30 minute lunch break that I am NOT allowed to skip under any circumstances.\n\nAnything that requires a bandaid or more needs to be documented as as injury.\n\nI have 24 paid vacation days per year. 16 of them are used when the company is closed in the summer and for Christmas the other 8 I choose.\n\nI work salary, is it more common to get hourly or flat rate in the US? \n\nEverything we do is Manual mill / manual lathe but with CAD technical drawings.\nI learned CNC in my vocational school but don’t use it too often. Is CNC and CAM the industry standard in the US or is much still done manually? I think that’s a bit more specific to my company but I’m curious how many of you guys still do it manually? 95% of my experience is manual. \n\nSalary for my experience level is around 40k per year with full health and dental. \n\nI have no idea how to use American measurements anymore I’ve only used metric everywhere I worked. (I was a mechanic at Mercedes in the USA) Does anyone use metric in the States? \n\nAre certifications important in the US? I have a few German certifications because without them you’re not allowed to work here. I remember being a mechanic with no certification, and that is appalling to German people. How could I work without a certification? How could I know what I was doing? \n\n\nThanks in advance!\n\n",
    "score": 130,
    "url": "https://reddit.com/r/Machinists/comments/1kwk1fc/heres_what_being_a_machinist_in_germany_is_like/",
    "created_at": "2025-05-27T10:39:58.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1lxa0wu",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "CNC Operator Job Offer Denmark 🇩🇰",
    "text": "CNC Operator with MasterCam Experience – Denmark 🇩🇰\n\nWe are currently looking for experienced CNC operators with solid skills in MasterCam.\n\n* English language – mandatory\n\n* Long-term project based in Denmark\n\n* Relocation support for you and your family, with full assistance from the Danish employing company\n\n* Alternatively, a rotational system is also available\n\nSalary: 200-300 DKK/h \n\n📩 To apply, please send your CV to: daniel@zenite.dk",
    "score": 115,
    "url": "https://reddit.com/r/Machinists/comments/1lxa0wu/cnc_operator_job_offer_denmark/",
    "created_at": "2025-07-11T15:35:28.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1oxb9aw",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Mic help",
    "text": "Before I type anything, I am not a machinest, yet. About to change careers. Accomplished everything ive wanted to do in my current career (carpenter).\n\nI've used precision tools before but never to actually be precise. More of quick down and dirty mechanical stuff working on cars in my free time. \n\nIs this mic at zero? Its a cheap o harbor freight special. Never needed anything better. ",
    "score": 106,
    "url": "https://reddit.com/r/Machinists/comments/1oxb9aw/mic_help/",
    "created_at": "2025-11-14T22:54:02.000Z",
    "num_comments": 73
  },
  {
    "id": "reddit-1pvcy9a",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Kinda new machinist here",
    "text": "Merry Christmas if ya celebrate! Found this page while doomscrolling. I’ve been machining for about 5 years, no schooling, just learned from people already in the trade. I’ve had a blast thus far even tho this was never my intended career path. Worked my way up from a manual knee mill, then 2 axis, then 3, now I’m on a cnc miltronics 25. Gonna be sharing some of my work with you all, happy to join the community!",
    "score": 65,
    "url": "https://reddit.com/r/Machinists/comments/1pvcy9a/kinda_new_machinist_here/",
    "created_at": "2025-12-25T13:02:20.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1l5go5v",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Thank you to this community.",
    "text": "Nine grueling months of overnight training 50 hours a week at a manual machine shop, and this communities amazing advice and critiquing has lead me to this amazing opportunity. \nToday was the last day of my two week notice to start my career as a CNC machinist on Monday. \n \nI was offered a substantial increase in pay at a local union providing training and all the benefits I dreamed of for a regular 6-2pm job. The interview set me apart from other applicants  due to my eager to learn and my experience on manual boring, lathe and drill press machines. \n\nThank you \n",
    "score": 56,
    "url": "https://reddit.com/r/Machinists/comments/1l5go5v/thank_you_to_this_community/",
    "created_at": "2025-06-07T09:17:09.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1k4iyrq",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Is HR just like that or is the job market getting really bad or is it just me?",
    "text": "I'm about to be graduating from a 2 year cnc/machine tool program in nys and I feel like I'm getting ignored by recruiters. I've been reaching out to companies that I see at career fairs and others but often I hear nothing back without pestering them. I've got letters of recommendation, a pretty decent resume, and good references from 2 internships. I know tarrifs are hitting alot of places but it's getting exhausting trying to pimp myself out to no reply for often mediocre money. Could just be me ¯⁠\\⁠_⁠(⁠ツ⁠)⁠_⁠/⁠¯",
    "score": 54,
    "url": "https://reddit.com/r/Machinists/comments/1k4iyrq/is_hr_just_like_that_or_is_the_job_market_getting/",
    "created_at": "2025-04-21T17:18:53.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1n6w5w7",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Machinist career questions from a 25 year old",
    "text": "I am a full time machinist right now. I have my Machinist journeyman’s papers. I have a pretty solid grasp on programming, making/dialing in parts with multiple .001 diameter tolerance/width, tight TP features, fixture making, experience with VTLs and Mills - G&amp;M and Mazak. Parts from 2k Lbs to ~4 Lbs. sometimes 1-2 part runs, sometimes 200 part runs. Good knowledge and understanding of GD&amp;T. Good with trig. Pretty good with solidworks. \n\nMost days I love my job. It is very satisfying. I am getting paid $32/hr. Plenty of OT available. \n\nHowever, people are in and out of the shop at ~60 years old. I do not want to be that age and working with hazardous materials while standing 8-12 hours a day on concrete. \n\nWhat would be some good next steps to advance? I know every shop is different. Are there any degrees that would mesh well with my journeyman’s cert? So many questions and I don’t know where to start. So that’s my brain dump. \n\nTLDR: What can I pair with Machinist journeyman’s to get away from standing on concrete until I die. \n\n",
    "score": 51,
    "url": "https://reddit.com/r/Machinists/comments/1n6w5w7/machinist_career_questions_from_a_25_year_old/",
    "created_at": "2025-09-02T21:27:32.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1pbksrh",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Job Posting: CNC and Machining Master Instructor - Relocation to Honolulu, Hawaii Included",
    "text": "Hello, we are a contractor for the federal government and are looking to hire a Master Instructor in CNC and Machining for one of our sites in Honolulu, Hawaii. Full relocation assistance is provided. If you would like to apply, [please apply on LinkedIn](https://www.linkedin.com/jobs/view/4336242920/) or email [kbright@bgworkforce.com](mailto:kbright@bgworkforce.com) .\n\n\n\n **Job Description:** Master Instructor - CNC and Machining\n\n**Location:** Honolulu, Hawaii\n\n**Compensation:** Salary ranging from $100k - $125k and relocation assistance including housing and car allowance. Comprehensive benefits package including paid health insurance and 401(k).\n\n \n\n**Position Overview**:\n\nWe are seeking a highly skilled and experienced Master CNC and Machinist Instructor to join our team in beautiful Honolulu, Hawaii. This is a unique opportunity to lead, inspire, and train the next generation of CNC operators and machinists in a state-of-the-art learning environment while enjoying an excellent compensation package and the perks of living in paradise.\n\n \n\n**Key Responsibilities:**\n\n*Instruction and Training:*\n\n* Deliver comprehensive instruction in CNC programming, machine operation, and machining processes, ensuring students acquire practical, real-world skills.\n* Develop and implement lesson plans, hands-on workshops, and training modules aligned with industry standards.\n* Teach the use of various CNC machines, including lathes, mills, and multi-axis machining centers.\n* Deliver comprehensive instruction in manual machining fundamentals, mill and lathe operations and, machining processes, ensuring students acquire practical, real-world skills.\n* Deliver comprehensive instruction in general mechanics and industrial maintenance fundamentals, hand and bench tool use, and QA and measurement processes, ensuring students acquire practical, real-world skills.\n\n \n\n*Curriculum Development:*\n\n* Update and enhance course materials to reflect current industry practices and technological advancements.\n* Collaborate with stakeholders to ensure the curriculum meets the needs of local and national industries.\n* Lead the development of a \"train the trainer\" model for certifying future instructors\n\n \n\n*Mentorship and Leadership:*\n\n* Provide guidance, mentorship, and career counseling to students.\n* Foster a positive learning environment that encourages student engagement and success.\n\n \n\n*Program Support:*\n\n* Maintain and troubleshoot CNC machines and related equipment.\n*  Assist in recruiting and retaining students through outreach and program promotion.\n\n \n\n*Professional Development:*\n\n* Stay updated on industry trends, certifications, and emerging technologies.\n\n \n\n**Qualifications:**\n\n* Proven expertise in CNC programming, machining, and operation with at least 10+ years of hands-on industry experience.\n* Experience operating Haas machinery highly desired.\n* Teaching or training experience, preferably in a vocational or technical education setting.\n* Strong knowledge of CAD/CAM software (e.g., Mastercam, SOLIDWORKS) and G-code programming.\n* Familiarity with diverse materials and machining techniques.\n* Excellent communication, presentation, and organizational skills.\n* Ability to inspire and motivate students from diverse backgrounds.\n* Certifications such as NIMS (National Institute for Metalworking Skills) or equivalent are highly desirable.\n* Prior military service or experience working in military environments highly desired.\n* Must be a US citizen able to pass a military background check.\n\n\n\n**What We Offer**:\n\n* Competitive Salary: Excellent pay reflective of your skills and experience.\n* Housing and Car Allowance: Relocation and ongoing housing and transportation support are provided.\n* Comprehensive Benefits: Paid health insurance, 401(k) with company match, and generous paid time off.\n* Tropical Paradise: Enjoy the unmatched lifestyle of Honolulu, Hawaii, with its beautiful beaches, vibrant culture, and outdoor activities.\n\n \n\n**How to Apply:**\n\nIf you’re passionate about CNC machining, have a love for teaching, and are ready for an adventure in paradise, we want to hear from you! Please submit your resume, a cover letter detailing your teaching philosophy and industry experience, and at least two references. \n\n\n\nJoin us in shaping the future of manufacturing professionals while living and working in one of the most desirable locations in the world!",
    "score": 49,
    "url": "https://reddit.com/r/Machinists/comments/1pbksrh/job_posting_cnc_and_machining_master_instructor/",
    "created_at": "2025-12-01T18:35:53.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1onqjoq",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Mental Health",
    "text": "Hi Everyone,\n\nI realize I am probably going to just be told to suck it up and stop being a bitch but I am going to ask the question anyway. \n\nHave any of you had experiences with shops that actually cared about the mental health of its employees? Or am I going to have to spend the rest of my career keeping all of the bullshit I go through completely to myself with no option to reach out for support?\n\nThe reason I ask, is because I am returning to work after around 9 months away, and among other things I already suffered from, I was recently diagnosed with PTSD. I had a panic attack at work last week, and was sent home without pay. This morning I had my employment terminated without cause as I was on probation. Prior to being let go, I had received positive affirmations from my boss. So I know that I wasnt let go due to performance issues.\n\nWith hindsight I realize I probably shouldnt have said anything to anyone, and kept it to myself, especially being on probation still. \n\nAlso I would like to add that the employer was aware of my mental health challenges prior to even hiring me, and reached out asking me to work for them, not the other way around.\n\nEdit to clarify: I am not looking for employers to fix my problems. I am just asking if employers capable of empathy of the lowest degree are out there. ",
    "score": 39,
    "url": "https://reddit.com/r/Machinists/comments/1onqjoq/mental_health/",
    "created_at": "2025-11-03T22:42:52.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1lluzu4",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Want a CAD/CAM position in Queens (NYC) High School? No teaching certificate initially required.",
    "text": "I am retiring from teaching in NYC as a second career. The school is having real trouble finding a replacement (Yea, I'm irreplaceable...). The program is for Computer Assisted Design and I've brought in a lot of equipment to build the students projects, since when they come in many have never built anything.\n\nThere are a number of pathways to get a teaching certificate including a high school degree and 4 years industry experience or Associates with 2 years.\n\nStarting Salaries range from $66K to $83K with summers off and lots of holidays, good benefits, etc.  \nYes, you have to put up with HS kids, pass background checks, and be able/willing to teach.\n\nIf interested, or know of someone, please give me a shout. I would like to see the program continue.",
    "score": 38,
    "url": "https://reddit.com/r/Machinists/comments/1lluzu4/want_a_cadcam_position_in_queens_nyc_high_school/",
    "created_at": "2025-06-27T14:15:41.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1lmvcix",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "How do you do this job?",
    "text": "Does anybody else find being a machinist (or toolmaker) stressful? Anybody else have struggles with the job or am I just crazy? \n\nEdit - I guess maybe it’s because I tend to be a perfectionist and don’t have a ton of confidence, that it messes with my head. I’m on year nine of my career, make about $90k. I’m currently deciding if I want to do a career change, but it’s hard to leave that kind of money. \n\nThank you all for your input. I do appreciate it. ",
    "score": 38,
    "url": "https://reddit.com/r/Machinists/comments/1lmvcix/how_do_you_do_this_job/",
    "created_at": "2025-06-28T19:35:16.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1hybk2t",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Machinists Salary/Hourly Pay in other countries compared to cost of Living?",
    "text": "Hello Everyone. I work as a CNC Machinist in Toronto, Ontario, Canada, and my hourly pay as a Machinist with 3 years of experience is 25$ per hour ( $50,000 per annum but after taxes $35000-$38000 per annum). Compared with the cost of living in Toronto, this salary is not good. I was wondering how much a Machinist get paid in other countries, compared to the cost of living of that country or city.",
    "score": 36,
    "url": "https://reddit.com/r/Machinists/comments/1hybk2t/machinists_salaryhourly_pay_in_other_countries/",
    "created_at": "2025-01-10T18:43:30.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1o7rq7u",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "What is that one tool . . .",
    "text": "Hey guys! So I decided to go to trade school for precision machining in my mid 30's, and so far classes are going well! It's funny, my old art degree is coming in handier than I expected.\n\nI have every tool on the school's list, but I gotta ask. What is that one weird tool you wish you had much sooner in your career? \n\nEDIT: Thank you everyone for your replies! Even the joke replies!\n\n\nSince a few have asked. My goal is a job in Tool and Die. I'm currently working as an assistant in a die shop. \n\nOh and don't worry, I don't plan on going hog wild and buying up everything everyone suggests. As much fun a shopping spree would be, my budget won't allow it. I have been slowly but surely building up my tool box a few tools at a time. This post has been incredibly helpful, and I've been updating my wishlist on my notes app. Thanks again!",
    "score": 31,
    "url": "https://reddit.com/r/Machinists/comments/1o7rq7u/what_is_that_one_tool/",
    "created_at": "2025-10-16T00:13:41.000Z",
    "num_comments": 87
  },
  {
    "id": "reddit-1ls54wm",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Overtime",
    "text": "How much overtime does everyone do on avg to boost their wage or none at all? At my last place I used to do 60hrs per month boosting my annual salary by 52% (25k basic, 38k with overtime).\n\nSince moved area and now earn £33k basic, and this year will aim to do 48k with overtime working 48hrs overtime per month (increase in salary of 41%) \n\nI’m reliant on it as I’m saving for a house and sole earner in my household. How about everyone else? ",
    "score": 17,
    "url": "https://reddit.com/r/Machinists/comments/1ls54wm/overtime/",
    "created_at": "2025-07-05T08:30:54.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1kin8ts",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Job offering in Southern California",
    "text": "[AWS Center for Quantum Computing](https://www.amazon.jobs/en/jobs/2975506/hardware-development-cryogenic-hardware-manufacturing-cryogenic-hardware)\n\nPasadena California, salaried position, $105k to $185k per year base salary depending on a number of things (there are typically bonus and stock offers that can raise that quite a bit, look up Amazon's corporate pay structure for more info). \n\nPrototype and small production run 3 and 5 axis milled parts in C101 copper for the most part, but good to have some all around experience as you are working directly with engineers who have some fun ideas from time to time. \n\nYour day is taking cryogenic hardware engineering concepts from print to part--programming, tool selection, fixture creation and machine operation are all part of the job. Folks from all backgrounds are highly encouraged to apply, we are willing to train the right candidate and no knowledge of cryogenics or quantum computing is necessary (I still don't quite get it myself).\n\nThis is a throwaway account for me so I might not check it often but if you have any questions leave a comment or send a DM. ",
    "score": 14,
    "url": "https://reddit.com/r/Machinists/comments/1kin8ts/job_offering_in_southern_california/",
    "created_at": "2025-05-09T16:48:38.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1oqjh66",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "How is the salary in your country/area?",
    "text": "I'm from Denmark, 45 years old, became an apprentice as a 16 year old at a steel mill, the same place that my dad had worked for 25 years, with a plate rolling mill attached.\n\nConscript in the military for 9 months.\n\nThen did production work for 6 years and then went back to being a machinist, at the same place as I was apprenticing with the same boss, but under new management. I have now been in the machine shop for 18 years. \n\nI made 500k danish kroner last year (77.276,15 USD) with almost no OT. Which is in the higher end of the pay bracket for machinists, here in Denmark.\n\nIn theory i could make more by finding a job closer to the capital. But i spend an avg. 36 minutes in my car daily and if I worked around the capital it would be around 3 hours daily or more. I can't see myself doing that anytime soon.\n\nAlso work time is 37 hours a week with very little deviation. But overtime does happen but that is usually due to things disappearing in storage.\n\nI was made a leader (small boss) and given some special responsibility (new and improved apprentice program) plus some OT. So I think I'll land around 570k (88.089,85 usd) this year.\n\nI've seen a lot of posts where people, usually from America, say the their salary is really bad. But is it really THAT bad?\n\nWhat about other countries?\n\n",
    "score": 12,
    "url": "https://reddit.com/r/Machinists/comments/1oqjh66/how_is_the_salary_in_your_countryarea/",
    "created_at": "2025-11-07T03:12:43.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1mbjss0",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "General Question",
    "text": "Hey, I am a European CNC machinist and have been lurking here for a while and i was interested in how it works in other countries. \n\nI see many from the US saying that they don't even do setups? Is that normal?\n\nFor example here we do all programming/setups i have ran mostlly a 5axis mill but also program a fanuc lathe, and I have learned Fusion 360 / Gibbscam / Mastercam. Also using both Fanuc and Heidenhain. \n\nHow does life look over there?. What kinda salary do button pushers or someone closer to what i do make. \n\nThanks \n",
    "score": 11,
    "url": "https://reddit.com/r/Machinists/comments/1mbjss0/general_question/",
    "created_at": "2025-07-28T15:48:37.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1ipka6b",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "How long to stay before moving on?",
    "text": "How long should I stay at a shop before I consider moving on?  I know the best way for a raise is to go somewhere else. There’s a posting in my area for a union job that would almost double my salary doing the similiar work as I’m already doing. I’ve been in the trade for about 8 years, with a year hiatus to go do industrial maintenance. The posting is for a tool and die position repairing sheet metal stamping components. I’m considering applying. \nMy trouble is how soon is too soon to jump ship?  I’ve been at my current job for about 6 months and the one previous to that for about 18 months. Will this raise a red flag as being a “job hopper”?",
    "score": 11,
    "url": "https://reddit.com/r/Machinists/comments/1ipka6b/how_long_to_stay_before_moving_on/",
    "created_at": "2025-02-14T20:34:55.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1mp1myx",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Options for new employment?",
    "text": "I’m 30 I’ve been in a manufacturing environment for about 10 years. I’ve worked my way up to machine shop manager. I can program, operate, design, order tooling, materials. I make great money compared to other job salary’s I’ve seen in the area. This company has been good to me but I don’t see us making it out of the slow time. I heard a rumor the owner is selling off his real-estate to keep us afloat.\n\nI’ve been pondering if this would be a good opportunity to get out of the trade. I’d even be willing to take a pay cut for something more enjoyable with better working conditions. Any suggestions for jobs that make around 100k a year that don’t need a degree? ",
    "score": 9,
    "url": "https://reddit.com/r/Machinists/comments/1mp1myx/options_for_new_employment/",
    "created_at": "2025-08-13T11:17:55.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1i8i8pa",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Question for Career Machinists",
    "text": "Hey guys, just wanted to get some opinions on my current situation, and whether i'm overblowing the issue.\n\nI'm a machinist just coming into my second year. I work with flat bed CNCs. When I was employed, it was as a general hand at my factory, but after a couple of months of working the floor, management realised I had a knack for machining and started training me up on the CNC, and since then they never took me off it.\n\nOver the last few months, the expectations of quality output have improved, and i've been expected to manage a second flatbed along with my first, this one being more complex with additional training required, such as operating and maintaining an oscilating knife tool, and trying not to snap the blades (having some difficulties with this part).\n\nI'm enjoying my work, but I feel as though both my workload and expectations are far exceeding my pay, which is still a general hand's salary. Is it worth bothering management to try and bump me up to the industry standard that's $6 an hour above my current wage? Or should I be happy with what i'm given as a new machinist with only a year of experience.",
    "score": 7,
    "url": "https://reddit.com/r/Machinists/comments/1i8i8pa/question_for_career_machinists/",
    "created_at": "2025-01-24T00:10:41.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1oe6wv1",
    "subreddit": "Machinists",
    "soc_codes": [
      "51-4041"
    ],
    "title": "Prototype Machinists Wanted in Eastern PA",
    "text": "I am leaving my position as a Prototype Machinist / Model Maker in a Research and Development Lab for a Pipe Fittings Company so I figured that I would send this out to see if any one felt it might fit them.\n\n[Prototype / Precision Machinist Position](https://jobs.jobvite.com/victaulic/job/o4ulwfw9) Location would be in Easton, PA.\n\n**Background:** I have been with Victaulic for 6 years and I am transitioning from a Machining position to a Facilities Excellence Management Coordinator position, so I am not leaving due to negativity. I am being given an internal opportunity to do something different in the company.\n\n**Pay:** Associate Level starts in the upper **$60,000s**, full \"Model Makers\" are in the mid to upper **70,000s**. I am leaving the position at $84k a year. I started 6 years ago as a full \"Model Maker\" making $64k.\n\nOvertime exists but it isn't consistent. \n\n**Benefits:** 5% 401K Match, 3% 401K Profit Sharing. Top notch Health Insurance (I pay around $105 a paycheck for a $350 deductible Cadillac Health Plan that covers my $6,000 a month Arthritis Meds 100%), a generous PTO Package (15 days to start, normal holidays off) plus the option to purchase 5 additional days of Optional Time Off over the course of the year. You are also allotted 5 Sick Days per year. PTO can be taken whenever you like. I have had days where I got to the parking lot, texted my boss and took a PTO day. It is written company policy that PTO is your time and you can take it whenever you like.\n\nTuition Reimbursement and Relocation Reimbursement are available as well.\n\nYearly Bonuses have been in effect for the 6 years I have been here, even during COVID. They are issued company wide for either a hard cash amount or 3% of your salary, whichever is higher. Yearly Cost of Living Adjustments have been close to the rate of inflation or just beating it.\n\n**Work Hours:** Shifts are either 7-3:30 for first shift or 2:30P-12A 4 10s for Second. Management is flexible with work times as long as you are producing good quality parts. They have no problem if you decide to work 6:30-3, for example. If you have a Drs Appointment, you can leave early and make up the time later in the week, or take PTO if it is more than 4 hours. Your workday includes 2 15 minute breaks and a 45 minute lunch. We have 2 Onsite Cafeterias that offer reasonably priced chow options.\n\n**Work Environment:** We have Prototrak Lathes, Prototrak Bed Mills, Prototrak K3 Knee Mills, 2 Haas VMCs and a Mazak VMC. This position is very much designed for the \"Jack of All Trades\" kind of worker. You would be expected to be able to learn the Prototrak conversational control and Mastercam for the other machines. Despite having a Mazak, we do no Mazatrol because we are a Mastercam Shop.\n\nThis is a pretty laid back environment where we are trusted to get our work done. I have always likened it to being an \"Independent Contractor\" in the shop. Jobs are doled out by our Tech Lead and we are expected to be able to get the work done independently. The other workers I work with are all pretty chill and are more than willing to help out with a problem or to bounce ideas off of. \n\n**There are no \"Crabs in a Bucket\" in this shop.**\n\n**Expectations:** We are looking for someone that has serious problem solving skills. You would be working directly with our engineering team to develop new products and prototypes as well as the fixturing and workholding the make what they need. A portion of our work is modifying castings before they can be tested, so having a good spatial understanding of non-flat parts is a big plus. \n\nMasterCam experience is a big plus, we are currently running 2024 and we update every 2 years once a stable version is released. Trainings are available, both in person and online with the end goal of becoming a MasterCam Certified Programmer.\n\nWe have a nascent 5S and Lean Manufacturing system in place, so that means the shop is fairly well organized with most tool boxes being Kaizened and all of our machines are kept clean and in well working order. The expectation is that the system will be expanded to include Total Productive Maintenance in the coming years.\n\nWhat we are NOT looking for: Bad Attitudes. We want people that work well with others, both in the Machine Shop day to day as well as Engineering, Design and Management.\n\nNo shop is perfect, but this is one of the better companies I have worked for in the 15+ years I have been slinging chips. The benefits are top notch, the work environment is pretty good and the crew in the machine shop is one of the best I have ever worked with in my entire career.",
    "score": 6,
    "url": "https://reddit.com/r/Machinists/comments/1oe6wv1/prototype_machinists_wanted_in_eastern_pa/",
    "created_at": "2025-10-23T15:50:44.000Z",
    "num_comments": 22
  }
]