[
  {
    "id": "reddit-1imkd3y",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "To My Fellow Lab Rats: A Letter From a Postdoc Who Survived the Bolsonaro Years",
    "text": "I want to share something personal. I survived my PhD in Brazil during the pandemic under Bolsonaro’s regime. For four years, my stipend stagnated, funding evaporated, and my mental health collapsed. I’d wake up and sleep scrolling through rage-bait headlines. I gained weight, battled gaming addiction, fought endlessly with Bolsonarist family members, and lost touch with people I loved.  \n\n**Here’s what I learned:**  \n1. **Your research matters more than the noise.**  \n   When I finally read a *4-month-old paper* in my field—a paper I’d ignored while doomscrolling Bolsonaro’s latest idiocy—it hit me: I’d traded meaningful science for political theatrics. Don’t let algorithms or billionaires (yes, Elon, I’m side-eyeing you) hijack your focus. Master the techniques you care about. Read papers that ignite your curiosity. Your work is your rebellion.  \n\n2. **You’re not trapped.**  \n   Academia trains us to move—cities, countries, continents. Closed regimes? They’ll still welcome skilled researchers. The world is vast, and your expertise is currency. I promise: there are labs, collaborators, and communities waiting for you. You are *not* alone.  \n\n3. **Break the obsession cycle.**  \n   You already know what’s happening. Trump’s latest stunt? Bolsonaro’s cultists? Elon’s “genius” hot takes? They’re designed to addict you to outrage. Instead of refreshing headlines:  \n   - **Protest strategically.** Attend one rally a week. Scream your pain. Demand justice. Then *leave.*  \n   - **Replace doomscrolling with action.** Train yourself to think: *“Will this headline change how I pipette tomorrow?”* If not, close the tab.  \n   - **Protect your joy.** Read a paper, troubleshoot an experiment, or just… breathe.  \n\n4. **Your sanity is non-negotiable.**  \n   I lost years to anger and anxiety. Don’t make my mistake. Find your “chains” and break them: unfollow toxic accounts, mute family group chats, and block anyone who dismisses your humanity.  \n\n**Final thought:**  \nThe best “fuck you” to fascists? Thriving. Publish that paper. Build that collaboration. Laugh with labmates. Science outlives dictators—but only if we stay in the fight.  ",
    "score": 7797,
    "url": "https://reddit.com/r/labrats/comments/1imkd3y/to_my_fellow_lab_rats_a_letter_from_a_postdoc_who/",
    "created_at": "2025-02-10T23:24:13.000Z",
    "num_comments": 156
  },
  {
    "id": "reddit-1j78hpm",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Trump Didn't Confuse Transgenic with Transgender, and That's the Real Problem",
    "text": "There’s been a lot of talk about [Trump’s claim that he cut $8 million in funding for making mice transgender](https://www.whitehouse.gov/articles/2025/03/yes-biden-spent-millions-on-transgender-animal-experiments/). The response has largely been to mock him,  *“lol he confused transgenic with transgender”,* but that’s **not what happening. We should be pissed about the indiscriminate attacks on justified research programs meant to help both cis and trans folks**.\n\nThe studies Trump targeted actually examine how sex hormones influence biological systems, research which holds significant potential for improving health outcomes for both cis and trans people. Among the NIH-funded projects [flagged on WhiteHouse dot gov are](https://www.whitehouse.gov/articles/2025/03/yes-biden-spent-millions-on-transgender-animal-experiments/):\n\n* A study on how [gender-affirming hormone therapy (GAHT) affects immune responses ](https://reporter.nih.gov/project-details/10849830)to vaccines (e.g., HIV, where trans populations have higher risk).\n* Research on [testosterone’s long-term impact on fertility](https://reporter.nih.gov/project-details/10619517) (modeled in female mice, simulating FTM transition).\n* Investigations into [breast cancer risk under gender-affirming hormone therapy ](https://reporter.nih.gov/search/Y3xbwNgJV0-V2-RIROPR1Q/project-details/10912193#description)(important given the lack of data in trans populations).\n* Studies on the effects of [sex hormones on asthma](https://reporter.nih.gov/project-details/10891526), [the neuroendocrine system](https://reporter.nih.gov/project-details/11000334), and the [microbiome](https://reporter.nih.gov/project-details/10944419) (which apply to trans medicine but also broader endocrinology).\n\nAre these mice actually transgender? Of course not. They’re hormone-regulated animal models, exactly like those used routinely in menopause, PCOS, osteoporosis, and countless other endocrine research areas.\n\nDo the anticipated results of these studies have the potential to improve the health and safety of trans humans? **Absolutely.**\n\nDid Trump + staff confuse the words transgenic and transgender? ~~Almost certainly not.~~ I doubt it. If he had, they would have flagged far more than $8M in research (For context, searching [\"transgenic mice\" on PubMed returns &gt;44K ](https://pubmed.ncbi.nlm.nih.gov/?term=transgenic+mice&amp;filter=datesearch.y_5)publications since 2020 alone) \n\nWhile it’s tempting to laugh at the absurdity of the “trans mice” talking point, the real outrage is how politically-motivated attacks threaten essential scientific research.\n\n# Why This Should Worry All Scientists\n\nWhat happens when sex hormone research gets labeled as \"woke science\"? What about studies on reproductive health? Or climate science? Or any field that can be spun as politically inconvenient? Ted Cruz's hairbrained list of woke NSF grants is [stuffed with proposals that have nothing to do with DEI](https://www.propublica.org/article/ted-cruz-woke-grants-national-science-foundation).\n\nThe issue here is not just about these specific NIH grants. It’s about what happens when research decisions become subject to ideological gatekeeping, driven by [political, populist narratives rather than scientific merit](https://journals.sagepub.com/doi/full/10.1177/0963662520924259). If this becomes normalized, entire fields could be defunded overnight for being politically inconvenient. Hungary’s Viktor Orbán did exactly that, and prominent U.S. conservatives like [JD Vance are explicitly trying to follow his lead.](https://www.chronicle.com/article/why-hungary-inspired-trumps-vision-for-higher-ed)\n\nAllowing this to continue sets America back as a nation, impacting more than just scientists. **We need to recognize conservative leaders as the manipulative vipers they are**, not as the bumbling idiots we pacify them into. \\*\\*They're weaponizing ignorance to manipulate a political base\\*\\* that ultimately will be hurt by these decisions but cheer them on none-the-less\n\n# What We Can Do\n\nMocking these cuts or dismissing them as ridiculous isn’t enough. We must clearly show the public how these politically-driven attacks on science harm everyone. Scientists have a credibility and communication problem, and this incident highlights how easy it is for others to control the narrative. [The public trusts scientists](https://www.pewresearch.org/science/2024/11/14/public-trust-in-scientists-and-views-on-their-role-in-policymaking/) (yes, even the majority of Republicans/conservatives, [who tend to only trust those familiar to them](https://www.nature.com/articles/s41467-019-12227-0)) but doesn’t understand what we do.\n\nStop letting the opposition define the terms of debate. When they say \"transgender mice,\"  show that these studies can help EVERYONE. When they say \"wasteful science,\" remind them them of [2.5X return on investment for research spending](https://www.nih.gov/about-nih/what-we-do/impact-nih-research/serving-society/direct-economic-contributions), the [10,000s of non-STEM jobs supported by our research  programs](https://blog.implan.com/funding-cuts-2025), and the [countless medical advancements we all benefit from](https://sciencepolicyreview.org/2020/08/federal-rd-funding-the-bedrock-of-national-innovation/).\n\nThe top comment on an r/conservative a post about trans mice[ is a non-political summary of how these studies could help everyone](https://www.reddit.com/r/Conservative/comments/1j50onn/comment/mgdgmzw/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button). Follow that as an example of how to engage across the aisle.\n\nEDIT: What Trump actually knew about these grants when he first addressed congress is besides the point. I'm not trying to say Trump is a genius puppet master or that making fun of Trump is the wrong move. RIGHT NOW there are grants addressing issues in trans health (and specific, [exceptional papers on the topic](https://www.nature.com/articles/s41386-023-01558-8#Abs1) by queer academic trailblazers) explicitly targeted on the White House's website. This post is meant as a call to action, not a critique of people joking about trans mice.",
    "score": 7107,
    "url": "https://reddit.com/r/labrats/comments/1j78hpm/trump_didnt_confuse_transgenic_with_transgender/",
    "created_at": "2025-03-09T14:14:14.000Z",
    "num_comments": 249
  },
  {
    "id": "reddit-1kwsl4v",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "ideas for science themed names for this little guy?",
    "text": "I found this baby under my porch and we are going to get him veterinary care and keep him. I would love to name him something science-related that could still have a cute nickname (eg: pipette shortened “pip”) but so far nothing is sticking. I would love to hear your ideas!! I work in a cancer biology lab but am open to all kinds of science-themed names :)",
    "score": 4363,
    "url": "https://reddit.com/r/labrats/comments/1kwsl4v/ideas_for_science_themed_names_for_this_little_guy/",
    "created_at": "2025-05-27T17:02:22.000Z",
    "num_comments": 1267
  },
  {
    "id": "reddit-1kaw5vv",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Fuck every single person who voted for this.",
    "text": "Thanks to Trump and everyone who voted for him, I’ve had to endure a month of mental torture ending today in devastation, heartbreak, and a deepening fear for my future and the future of research in America. Warning: this is going to be a long one. \n\nI’ve been applying for jobs over the last few months and in March landed an interview for my dream job - the exact institution, research topic, and techniques I’ve been looking for for years. It’s a niche topic so I couldn’t believe my luck when at my second interview, I was offered the job on the spot and told the hiring process would be initiated that same day. \n\nI got a call from HR the following week to discuss salary expectations and was told there’s still another candidate interviewing so I should expect to hear back early the next week. Wednesday came with no word so I called and they pushed it to Friday or Monday. Monday comes and I still haven’t heard a word so I called again and they told me what I thought was the worst news I was going to get in relation to this position - they offered the job to the other candidate. They said they hadn’t responded in a few days and had until EOD that Tuesday to accept. \n\nTuesday comes, not a word. I call Wednesday, straight to voicemail. I email the PI to gain some clarity and he said he’s unsure what HR has been telling me but no offers have been made due to uncertainty surrounding federal funding. Cue the next two weeks of me trying to get in touch with HR and my calls going to voicemail every. single. time. With not a single call or voicemail returned. \n\nI emailed the PI last night to ask for an email I could have for a direct HR contact and got what actually turned out to be the worst news I could get - hiring has been suspended indefinitely and I should continue to look for other jobs. \n\nTwo weeks of agony, anxiety, sleepless nights, lost appetite wondering if the other candidate accepted then ANOTHER two of the same wondering if there will even be funding for the position. I’ve been lied to by HR and dragged through the mud, left in the dark, and left behind. \n\nFuck every single person that voted for this. My dream job just fell through my fingers like sand and it’s hard not to feel like my entire career is in jeopardy. To say I am angry, frustrated, and devastated is the understatement of the fucking century. \n\nTLDR: got a job offer on the spot, HR lied to me during the hiring process, got dragged through the mud for a month only to be told hiring for the position can no longer continue due to funding",
    "score": 4356,
    "url": "https://reddit.com/r/labrats/comments/1kaw5vv/fuck_every_single_person_who_voted_for_this/",
    "created_at": "2025-04-29T19:08:42.000Z",
    "num_comments": 306
  },
  {
    "id": "reddit-1iw0v7f",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Lab members voted for Dump",
    "text": "I'm in a master's program at a(n?) R1 in the south. I was devasted on election day and even more upset when I noticed so many people walking around campus with celebratory MAGA hats on. I share lab space with a few members of my cohort, and we had always been friendly. So when they said hi and asked me how I was doing that day, I told them honestly: not too good. And then they started acting awkward, cagey, and looked away. It could not have been any more apparent why. I made a deal with myself that I wouldn't treat them any differently, wouldn't hate people who voted for Trump. Everything's gonna be fine, I told myself, just don't think about it.\n\nSo one month later, things don't look like they're going to be fine. Science is under attack. Nazi salutes. RFK. Deportations galore. I don't know why I'm listing this stuff; you guys know it. \n\n What really gets me that they are women who call themselves scientists, but voted for a party that encouraged anti science rhetoric for years before the election. At least one of them has immigrant parents. \n\nI don't want to be nice to them anymore. I want them to be publicly humiliated by their immigrant professors who rely on NIH grants.  For fucks sake, where do I put my anger? ",
    "score": 3836,
    "url": "https://reddit.com/r/labrats/comments/1iw0v7f/lab_members_voted_for_dump/",
    "created_at": "2025-02-23T03:29:28.000Z",
    "num_comments": 537
  },
  {
    "id": "reddit-1hu50im",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Can we talk about this for a bit?",
    "text": "For the record, I completely agree with this take. I understand that there are many overachievers out there and they work hard to get those extra experience. But it seems like nowadays, you need 5 years of experience to apply to an entry level job aka PhD. A PhD is a training program, where you get mentored and learn how research work and maybe publish. If you already got all of these BEFORE your PhD, why even need a PhD? And lets not forget, those who got the experience are just people at the right place at the right time. Some are luckier than others, some know someone. I never had any of these growing up. Those who are immigrated from lower income countries, lower income backgrounds etc. \n\nFor me, it's the aptitude towards research is what needs to be the top criteria, not how many research papers. ",
    "score": 3562,
    "url": "https://reddit.com/r/labrats/comments/1hu50im/can_we_talk_about_this_for_a_bit/",
    "created_at": "2025-01-05T11:24:06.000Z",
    "num_comments": 220
  },
  {
    "id": "reddit-1levrya",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "I sent Eppendorf an email and they actually sent me a pipette pen!!!",
    "text": "After ~~being incredibly jealous~~ seeing peoples pipette pen, I wanted one real bad. But as a student I don’t have access to local vendor shows/conferences / seminars. So I decided to gather some courage and send my local Eppendorf company an email, shared a little bit of my experience using their equipment, how I aspired to pursue lab related study after doing my first PCR with their pipette in high school. If they decline, at least I’ve tried! But the office manager was kind enough to send me one along with some other free goodies. This truly made my week and will forever be special to me 🥹",
    "score": 3387,
    "url": "https://reddit.com/r/labrats/comments/1levrya/i_sent_eppendorf_an_email_and_they_actually_sent/",
    "created_at": "2025-06-18T23:21:58.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1jq5wna",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Just found out my postdoc got terminated",
    "text": "No sorries. No warm wishes. Just a straight to the point email from the NIH that my funding (which also funds hundreds of other postdocs nationwide) has been cut. Now we are all going to compete against each other and every other PhD who lost funding for every single faculty position that exists (if there any left) and every single biotech openings (if those even exist as well). Hell, we are more realistically going to be competing for the part-time lecturing positions for summer school at our Unis because we all need to pay rent somehow...\n\nI really thought I was in the clear. I felt terrible about seeing all the other posts about people losing their positions but I always thought there was no way it was going to happen to me. And then it did...\n\nThis is actually insane.\n\nTo all the undergrads and grad students that are pursuing academia or thinking about pursuing academia. I truly am sorry. These are insane times. I cannot even describe the anger I am feeling right now. They literally are throwing us to the streets.\n\nEDIT: oh forgot to mention my research is on cancer... the very thing they claim they aren't cutting",
    "score": 3321,
    "url": "https://reddit.com/r/labrats/comments/1jq5wna/just_found_out_my_postdoc_got_terminated/",
    "created_at": "2025-04-03T01:36:54.000Z",
    "num_comments": 184
  },
  {
    "id": "reddit-1ibt3sm",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "All federal grants paused",
    "text": "It just keeps getting worse and worse:  \nhttps://thehill.com/homenews/administration/5109943-trump-administration-directs-widespread-pause-federal-loans-grants/. \n\nThis is so bad for science. This is so bad for scientists. It's going to hit trainees and early career folks the hardest, even if it only lasts a little while. And selfishly, the majority of my income is from NSF broader impacts funding — scientists write me into their grants to help them make educational videos about their research. This is gonna hurt.  \n\nTomorrow I'm going to call my Members of Congress (again) and ask them what they're going to do to protect science in the US. If anyone has other action recommendations I'm all ears!",
    "score": 1563,
    "url": "https://reddit.com/r/labrats/comments/1ibt3sm/all_federal_grants_paused/",
    "created_at": "2025-01-28T04:04:22.000Z",
    "num_comments": 227
  },
  {
    "id": "reddit-1k858yj",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Let’s be honest. Undergrads through postdocs have it the worst right now",
    "text": "Ive had a couple tenured PIs tell me, “yeah i know we are all screwed.” Or “yeah,tell me about it” etc etc. about all the cuts. \n\nAnd yes of course, I feel terrible for some of these PIs just watching multi million dollar grants go out the window. I really do. \n\nBut for people who are literally losing a grad school admission, or lost their postdoc, or had their offer rescinded for asst prof.. and have to wait 4 years until we get any clarity on the future.. this is dramatically worse. \n\nUniversities are not firing tenured faculty. They are putting hiring freezes instead. So basically everyone under faculty level is screwed the most. (Also PIs who are grant salaried as well). \n\nI just want to make this point because in the media all you hear about is “the research, the research, the research is getting killed.” But not a lot of news outlets talking about the massive chasm this administration has made to block 4 years of new aspiring scientists who will now become disillusioned, saturate the already terrible private sector job market, or go compete for all the EU openings. \n",
    "score": 1384,
    "url": "https://reddit.com/r/labrats/comments/1k858yj/lets_be_honest_undergrads_through_postdocs_have/",
    "created_at": "2025-04-26T05:08:19.000Z",
    "num_comments": 132
  },
  {
    "id": "reddit-1iwg3v5",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Bullet point: decrease in productivity due to endless status update meetings",
    "text": "There is now a pause on this. \nOne of my bullet points is as the subject line reads :\n1) spending countless hours in status update meetings \n2) spending countless hours trying to revise current research to ensure compliance with executive orders\n3) having to respond to emails sent during non work emails about my productivity in a specified format which may or may not be read by a 20yr old intern, and/or Grok\n4) finding a new person to work on my resume revision since my current /previous career advisor was fired (sorry, \"laid off\") this week \n5)lastly, had some time to do the tasks I am on contract to do as a research scientist. Whew. \n\n",
    "score": 1051,
    "url": "https://reddit.com/r/labrats/comments/1iwg3v5/bullet_point_decrease_in_productivity_due_to/",
    "created_at": "2025-02-23T17:59:32.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1j4p1dq",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "A rant to the void. I'm transgender. I've been doing molecular biology and genetics research for over 8 years. Those are not in conflict with each other.",
    "text": "I don't know what I'm trying to accomplish, or say here. Mods, I totally understand if this is too rantish and low quality for this subreddit.\n\nI'm exhausted. \n\nI'm laughing and memeing about the transgender mice as much as the next person, but there's genuine pain and grief here. I'm in grad school right now, and I've been doing research since my freshman year of undergrad. I started estrogen hormone replacement therapy in 2023, and I've been living openly as a transgender woman since summer last year. \n\nI attribute my studies in biology, and my ability to read primary sources about the biology of sex determination, hormonal physiology, and my background with fundamental concepts like gene expression as key reasons why I was able to finally feel comfortable enough to transition, both medically and socially. \n\nI've received nothing but love and support from other biologists. Mostly a few fun nerdy rambles while catching up with old colleagues about the precise biology of what I'm doing to myself right now, and over sharing about my own changing gene expression and physiology.\n\nThe growing hate coming from *outside* the field, from nonscientists, from stupid fucks who've never picked up a pipette in their fucking life, who've never seen a fasta file, who would struggle to pronounce two words in a paper... I can't even begin to articulate how simultaneously stupid and heartbreaking it is.\n\nMy career, my passion, my contributions to the world, are being gutted, censored, and used against me. I'm trying to be as grounded and practical as possible, but sometimes I break and feel like I need space for the genuine *grief* I'm feeling, for lack of a better word.\n\nI feel like I'm in a unique position to do something, say something, but I'm in such a whirlwhind myself and trying to figure out what to do with my own life and survive through these years, that I really don't know what I can or should do. \n\nSo I guess I'll scream into the void with this post, attend a march on Friday, survive, and see what I can do later. Fuck.",
    "score": 1023,
    "url": "https://reddit.com/r/labrats/comments/1j4p1dq/a_rant_to_the_void_im_transgender_ive_been_doing/",
    "created_at": "2025-03-06T06:10:30.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1nqg36y",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Boy, what they say about industry vs academia is true fr",
    "text": "I recently worked at an academic lab for the past year. I was obligated to come in 7 days a week, expected to put in unpaid overtime when necessary, and never had any time for breaks. All for shit pay on top. I recently got back into industry, and despite the job market being ass rn, I'm doing like half the work for double my old salary. Best of all? No weekends 🙏🏻. \n\nI did learn a lot of valuable skills in academia though, so even though it sucked, that experience was worth it imo. ",
    "score": 956,
    "url": "https://reddit.com/r/labrats/comments/1nqg36y/boy_what_they_say_about_industry_vs_academia_is/",
    "created_at": "2025-09-25T19:26:32.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1iccois",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Scientific American journalist seeking perspectives on federal grant freeze (mod approved)",
    "text": "Hello! My name is [Lauren Young](https://www.scientificamerican.com/author/lauren-j-young/) and I’m a journalist and health editor at the U.S. science news outlet, Scientific American. I've chatted with the mods to post this call out: I’m currently working on a news story about the federal grant freezes (NIH, NSF, etc) and how they are affecting scientists and graduate researchers. I’m hoping to hear about people’s experiences and perspectives on the current status of their research—and any concerns about future/ongoing funding.\n\nI'd love to speak with folks on the phone for on-record interviews. We can provide anonymity to people who may have any concerns. DM me if you'd like to share your experience and I can coordinate time privately to chat. I’ve interviewed folks from [reddit before](https://www.reddit.com/r/WegovyWeightLoss/comments/1c80iaz/how_has_wegovy_changed_your_relationship_with/), and I'll be sure to link to the final story once it's published. Thanks so much for the help!\n\n**Update 1/29:** Thank you all again! The response has been incredible. I've found the sources I need for this particular story, but I'm continuing to monitor the thread and reading DMs for a follow up piece. I will link to the pieces that come from this reporting. I appreciate everyone who has reached out! Thanks!\n\n**Update 2/7:** Hello! Today we released a podcast which includes reporting from this post! I want to thank everyone again for reaching out and chatting with me. I'm working on follow-up stories and will continue to link to those pieces as they are published. Thanks! [https://www.scientificamerican.com/podcast/episode/trump-executive-orders-create-confusion-for-science-and-health-agencies/](https://www.scientificamerican.com/podcast/episode/trump-executive-orders-create-confusion-for-science-and-health-agencies/)\n\n**Update 7/3:** Hello again! I'm here with another update: Today we published a followup story highlighting how early-career researchers have been directly affected by the federal funding cuts and grant terminations. It's written by one of our excellent contributing writers, edited by me, and featuring reporting from this initial callout. I wanted to express again my thanks to this sub. We will continue to follow this in the future! [https://www.scientificamerican.com/article/how-trumps-federal-funding-cuts-are-hurting-early-career-researchers-and/](https://www.scientificamerican.com/article/how-trumps-federal-funding-cuts-are-hurting-early-career-researchers-and/)",
    "score": 781,
    "url": "https://reddit.com/r/labrats/comments/1iccois/scientific_american_journalist_seeking/",
    "created_at": "2025-01-28T21:20:50.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1iojusx",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "THIS is the messaging we need - wild mischaracterization of DEI &amp; NSF research",
    "text": "The Cruz list dropped two days ago.\n\nhttps://www.commerce.senate.gov/2024/10/new-cruz-investigation-reveals-how-biden-harris-diverted-billions-from-scientific-research-to-dei-activists\n\nYou can search your school and you'll quickly see that the vast majority of the identified grants might seek to broaden participation as a side mission to a central research mission (as required by the NSF). NPR does a good job of pointing out how ridiculous this culture war is. \n\nhttps://www.npr.org/2025/02/13/nx-s1-5295043/sen-ted-cruzs-list-of-woke-science-includes-self-driving-cars-solar-eclipses\n\n\"I think there's a lot of mischaracterization done right now with throwing around of \"DEI\" or social justice,\" she says. \"There's nothing political about wanting students to learn. That's not social justice, that is simply giving all students an opportunity to get a good grade and be able to succeed in their future career.\"\n\nThe messaging here is simple. Point out how absurd this McCarthy-like hunt against \"the woke mind virus\" is. Tell your friends... Your family... Journalists... Social media. Parade the ridiculous examples of \"woke science\" just like the tea party effectively did when attacking any science. \n\nThese aren't serious people, but they're beating us with their messaging.",
    "score": 704,
    "url": "https://reddit.com/r/labrats/comments/1iojusx/this_is_the_messaging_we_need_wild/",
    "created_at": "2025-02-13T14:10:11.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1op3vb6",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Starting my own lab: how do I make it a great place to work?",
    "text": "Hey labrats,\n\nI’ve recently started my own lab. It’s me (the PI) and two brilliant bioscientists so far. My background, both during my PhD and afterwards, has always been very lab-based, so I understand the daily grind: the 5 pm “just one more spin”, the endless labeling of tubes, and the collective panic when the -80 beeps.\n\nNow that I’m running my own group, I really want to make sure my team feels valued and genuinely enjoys coming in. I’d love your input on what made your favourite labs great to work in, whether big or small things.\n\nSupportive mentoring, flexible hours, shared snacks, Friday beers, communal playlists, or simply someone who remembers to order tips before they run out... I’m open to any suggestions.\n\nWhat helped build a positive, motivating, and fun lab culture for you?\n\nEDIT:\nWow, thank you all so much for the responses. I started replying but there are just too many of you. Please know I’ve read every single comment and really appreciate the time people took to share their experiences.\n\nSome key takeaways from the most common advice:\n\n1. What works for one person doesn’t work for everyone. Adapt mentoring, management, and social styles.\n2. Flexible hours are essential for many, but too much freedom can be tricky for early-career staff who still need structure.\n3. Don’t be toxic: no blaming or shaming. Accept mistakes, learn, and grow together.\n4. Set clear boundaries and expectations from the start.\n5. Be transparent about progress, feedback, and the bigger picture.\n6. Delegate and let go. Don’t micromanage. Let people take responsibility and ownership.\n7. BRING CAKES\n\nFor those asking, we’re a commercial R&amp;D and diagnostics lab (so industry, not academia). Both my team members are MSc grads, and I pay them above the average postdoc salary.\n\nAlso, you all reminded me of one of my favourite lab traditions from years ago: we had an acronym, DBAD (don’t be a dick). It applied to all lab etiquette. Bin full? DBAD, empty it. Low on tips? DBAD. If someone did something dickish, a small piece of tape with “DBAD” would mysteriously appear on their bench. Incredibly effective, especially with students.",
    "score": 679,
    "url": "https://reddit.com/r/labrats/comments/1op3vb6/starting_my_own_lab_how_do_i_make_it_a_great/",
    "created_at": "2025-11-05T14:09:56.000Z",
    "num_comments": 214
  },
  {
    "id": "reddit-1lyf2fe",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Out of curiosity, I set up an account on a dating app to see if I could get better connections for research positions overseas.  It worked way too well. This is heartbreaking and also very very funny.",
    "text": "Tl;Dr: I have been trying to move overseas to do research for several years. I had made exactly ZERO progress until I made a dating app account for the cities of those universities with research I like. The “chances” for interviews and direct contacts have come pouring in. Like I’m talking 10+ direct contacts in 12 days. The fact my 10 years in academia, MSc in biochem, and 5 years full time lab experience meant nothing until it was put in a sexual context is funny and devastating. I will not actually take up these offers as I am actually happily married and I think it is very unseemly to undermine actually viable candidates by using my sexuality. I just wanted to see. Please get a laugh from this ridiculous post and enjoy. \n\nEDIT: This post was never intended to be a condemnation of men. Dating apps are one of the few places I feel people are completely justified in approaching others with sexual/romantic intent. I found these dudes to be very sweet and just trying to be helpful. If a dating app isn’t a place to trying to help people make connections and befriend people, I’m not sure where is. These interactions were not “Suck my dick and I’ll hire you lmao”. They were much more “Yo! I’d love to help. Here’s XYZ’s number. Hopefully he can help. Maybe we can grab dinner sometime.” I feel these interactions are very appropriate and this entire experience is more telling of me and my lackluster credentials than anything else. \n\nThis is to vent because I don’t have many other science friends and I always love to share experiences with the people on this sub whether that’s in lab or out of lab. This is ultimately a humorous post as you’ll read so please forgive my sketchy behavior and laugh with me please. I am the problem, etc etc. \n\nFor context, I am a semi-attractive, 30 year old female. My dream job here in the states is over due to budget cuts. That’s fine. Science is in the shitter here in the US anyway and I’m far from the biggest victim. I had a good run with my career here and I have been wanting to move to the UK for several years anyway. This desire to make it to the UK has mostly consisted of me just genuinely enjoying meeting other research professionals over there. However, all attempts at job applications, professional networking, and even the desperate cold email have been COMPLETELY unsuccessful. I am a middling candidate for research jobs anyway in comparison to my peers so this is not a condemnation of the UK’s immigration policies or discouragement to anyone also wanting to try to make the jump. I’m just here to complain that, in drunken curiosity, I set up an account on a dating app with the explicit intention to see if I could get connections/interviews to my two dream schools over there. The opportunities have poured in: Numbers to core facility managers, PI’s interested in people with my skill set, etc etc. Please note that this was more of a litmus test than anything as I am happily married. I am ultimately not willing to do sexual favors to further my career in research (at least not yet. Stand by.) I understand this makes me a trash heap of a person but I am not actually going to follow through on these offers. I actually got the chance to hook one of the sweetest dudes up with a single girlfriend so I’m trying to do my part lmfao. \n\nThank you for reading!! Hope everyone else’s careers are going better than mine! Chase your dreams and maybe consider marrying a British dude if you want to have a job over there. Good luck, babes. ",
    "score": 656,
    "url": "https://reddit.com/r/labrats/comments/1lyf2fe/out_of_curiosity_i_set_up_an_account_on_a_dating/",
    "created_at": "2025-07-13T00:09:32.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1kddpwr",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Officially losing my job due to the government, freaking out",
    "text": "Edit: thank you all for your amazing advice and support. ❤️ I feel a lot better after getting some advice from y'all, and feel better about my options. In case you're in a similar position and want to know my personal solution to my problems, this is what I've decided on. \n\nMy PI is being very flexible and communicative, which helps me a lot. He's open to being flexible as long as we still have remaining grant funds. This means that I can possibly stretch out the time I have to stay in this job by going part-time, and can maintain my insurance a bit longer while I figure things out. \n\nIn addition, I found out you can get partial unemployment, so I can go down to 20 hours per week, maintain my insurance, and supplement my income so I can maintain my current finances. I can also use these newly opened up 20 hours a week to put into my job hunt/study for the MCAT to pursue a career in medical research, which I really wanted to do before I got sick anyways. I already really wanted to go MD/PhD, but having an MD during this time of uncertainty definitely would give me more options in the future. \n\nI'll also look into rehiring lists at my university, and keep an eye on other opportunities I can transfer to for even better continuity so I have multiple backup plans.\n\nI really, really, hope things in our field improve for the better. We can't give up, and need to keep moving fiesta forward. Please don't forget to vote for even small local elections, go to town halls, and call your representatives whether they're red or blue. Stay strong.\n\nOriginal post:\n\nMy lab that studies rare pediatric disease is officially shutting down in a few months, and I was diagnosed with a disease last year that will kill me if I don't have consistent treatment,  so losing insurance will screw me majorly. \n\nI have a really strong skillset and would likely have a really good chance of finding a new research job in a normal situation, but with hiring freezes due to this administration's attack on science, and industry having mass layoffs for the same reason, I'm kind of panicking. My entire skillset is in science/writing/teaching, and those things are all under attack. I'm genuinely afraid for my life if my heart/autoimmune medications can't be refilled.\n\nIs anyone else going through this or does anyone have any advice? The worst part is that because of my new diagnosis, I don't feel confident I can work a rigid 9-5 anymore. It's worked out well for me that if I'm really ill one morning, I can just drop into lab and stay from 12pm-9pm if I have to, etc. Or if I have a doctors appointment, I can take off half a day and make it up on a weekend because I need to do some tissue culture anyways. I'm feeling pretty scared.",
    "score": 649,
    "url": "https://reddit.com/r/labrats/comments/1kddpwr/officially_losing_my_job_due_to_the_government/",
    "created_at": "2025-05-02T22:27:51.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1il6ygw",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "A Scientist's FAQ on the Proposed NIH Indirect Cuts",
    "text": "I've seen a lot of speculation about the proposed changes to NIH indirects. Here are some things that many people are missing. \n\nSend this to your friends who wonder why this issue is such a big deal.\n\n* Much discussion has been focused on the term \"overhead\" as if it's unnecessary bloat. **NIH does not define the term \"overhead\" in the same way that many other organizations do. Indirect funds are mostly used for key parts of the scientific project.**\n   * When someone buys a Tesla, they don't just pay a separate fee for the direct costs (metal that went into the car and people on the assembly line that put it together) and indirect costs (electricity and HVAC for the factory, salespeople and marketers to sell the car, accountants to process the sales funds, property taxes on the factory, and more). You pay one price for the car, and then the revenues get distributed to all of these people. In a strange accounting principle, NIH prohibits you from using direct funds to pay lots of people who perform research activities with direct funds, so they have to be paid with indirects.\n* As their stated rationale for the indirect cuts, the NIH made comparisons to private foundation indirect rates as \"market-based comparison.\" **Private philanthropic foundations are are not in the same universe as NIH in terms of support or impact.** All of the foundations NIH referenced for comparison are much, much smaller than NIH (several have &lt;1% of expenditures compared to NIH, none are even 5%). \n   * Like kindling in a fire, private foundations are seen as small feeder sources to get projects moving so that they can eventually receive the larger NIH funding they need to actually succeed. If any business analyst did a competitor analysis and only selected competitors that were anywhere from 1/30 to 1/100 the size as comparators, they would be fired.\n* The Heritage Foundation Mandate for Leadership (aka Project 2025) links indirects to DEI and uses this assumption as a rationale for targeting them. Indirects are at best tangentially related to DEI activities. There are far more effective ways to address this concern without destroying research.\n* NIH has a ton of documentation and regulation bloat. This makes it very difficult to submit grants and to properly administer them once they are funded. Indirect funds go to the people who address this documentation and the associated requirements. You see this much more in the military, resulting in things like the infamous $150,000 batch of soap dispensers for C-17 cargo planes.\n   * **If the DOGE is really about efficiency, this is a viable target that could make scientists more effective and actually reduce waste.** For example, some granting agencies do a first pass on a short letter of intent as opposed to requiring a huge grant with hundreds (sometimes thousands) of pages of basically unnecessary documentation. A lot of this documentation could be provided as just-in-time once a project receives initial interest for NIH support.\n* See how much inflation has affected things in the past two years? **The main way that NIH distributes funds, the R01 grant mechanism, has not increased in over 30 years. Due to inflation, NIH-supported projects have been receiving budget cuts for decades.**\n* The NIH overall budget has also not kept up with inflation. It's currently about 0.5% of the federal budget, at roughly $40 billion. The military, social security, and Medicare budgets each are each more than 20 times the NIH budget. They are also notorious for inefficiency. **They provide much easier places to find wasted funds without doing harm to America's leadership in medicine.**\n* **Waste in the private sector is often much greater than in academic areas funded by NIH.** Ask any NIH funded researcher about friends who have left for private sector pharma. Much nicer offices, higher salaries for people of lesser competence, way more \"overhead\" staff who make projects happen faster, daily DoorDash allocations even for failing firms, and what often results is poorly done science. One hugely profitable drug often subsidizes a ton of waste across the rest of the company. \n   * Academia provides benefits of not having to think quarter to quarter and more leeway to take bigger chances on innovative ideas. It's not like people stay in NIH-funded research so that they can live large on NIH indirects.\n* **Nearly any major medical advance you have seen since WW2 has some roots in NIH funding.** Private sector pharma and device companies rely on NIH-supported research to get ideas far enough along that they are then viable enough to invest in. An oft-cited statistic is that every $1 in NIH funding results in $2.5 increase in economic activity.\n   * **NIH is a huge American flex of superiority over other countries. It already runs on a modest budget that is a rounding error compared to other federal programs and the overall federal budget.**\n   * **China is laughing at us for injuring ourselves. In return for this proposed action, we would only receive negligible and short-term financial savings, and we likely will reduce economic growth.** ",
    "score": 619,
    "url": "https://reddit.com/r/labrats/comments/1il6ygw/a_scientists_faq_on_the_proposed_nih_indirect_cuts/",
    "created_at": "2025-02-09T04:47:15.000Z",
    "num_comments": 97
  },
  {
    "id": "reddit-1p5hc2j",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "I got fired today after six months",
    "text": "About six months ago, I accepted a postdoc abroad that looked like my dream position on paper. Right off the bat (and I mean the first fucking day) I felt that something about the environment was off. I tried to convince myself it was just the stress of relocating to a new country, navigating a new language and starting a new job. I thought I was just overwhelmed by the entire situation, and I would soon settle in.\n\nTwo weeks in, I befriended two senior postdocs who were honest with me about the situation. They told me the lab was extremely toxic, that the PI didn’t really give a shit about the science (hence the shit track record of publications, should have seen it coming from the moment I applied just by looking at it). Everything moved painfully slowly because he micromanages every detail while also being terrible at it. According to them, he ends up sabotaging people’s projects simply through incompetence. They were clearly exhausted. I could list all the shit things he's done to members of this lab, but you get the picture. I once posted about this on Reddit (the post is now deleted), and many people told me to leave immediately. I wish I’d listened. But I was afraid that quitting so early would make me look like a failure.\n\nSo I stayed and tried my best. Unfortunately, the project I was given was doomed from the very beginning. The PI asked me to design a completely new “system” to replace an established gold-standard method in the field — essentially because the existing approach is patented. In other words, he wanted me to reinvent the wheel so he could patent something new. This isn’t even my area of expertise (I was very clear about that during the interview), but he promised he would guide me. In reality, I was left completely on my own. Nevertheless, I tried. I generated multiple ideas, redesigned them over and over again, constantly changing things because he always found something he didn’t like. Every time I followed his instructions, he would shift the goalposts again. I tried reaching out to others in the lab, but nobody was willing to help. After months of work, I still had nothing solid because the target kept moving. Or, at least, this is how the situation looked like from my pov.  Two weeks ago, he asked me to present a clear pipeline for how I planned to move forward. I prepared one and presented it. Still not enough. Today, he called me in and told me he wasn’t satisfied with my performance and would not renew my contract after the trial period. \"Too late now\" were his exact words. \n\nI’m trying really hard not to take it personally. The two postdocs I trust told me he has done this shit to others, and that his behavior comes from not knowing what he actually wants. But I still feel completely defeated. Maybe I could have pushed harder. He said I wasn’t “proactive enough” for a person in my rol. This was my first postdoc, and I had been transparent from the beginning about my lack of experience in this specific field. He reassured me that he would support me, but I learned the hard way. I guess I was just too lucky with my PhD supervisor who was actually a nice person. \n\nNow I have to pack up my life, move back in with my parents, and my husband has to move back with his too, because without my salary we can’t afford rent. I feel hopeless and exhausted. I know, logically, that this situation says more about him than about me, but emotionally, I just feel like a failure.\n\nI don’t really know what I’m looking for here. Maybe just perspective or a few comforting words. Thanks for reading.",
    "score": 481,
    "url": "https://reddit.com/r/labrats/comments/1p5hc2j/i_got_fired_today_after_six_months/",
    "created_at": "2025-11-24T13:40:43.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1ixz6yk",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Implying that Akiko Isawaki is risking her career by studying how to improve the Covid-19 vaccine.",
    "text": "These people really only read what they want to hear. They have no idea that scientists continue to study vaccines decades after roll outs to track adverse effects, acknowledge legitimate adverse effects, and work to improve it. That is not \"anti-vax\" nor is it \"whistleblowing.\" We are still studying the efficacy of the vaccines for small pox, polio, measles, yellow fever, etc. It doesnt mean that the vaccines are dangerous nor does it meant that they are not remarkably more safe than getting the actual disease.  Just more sensationalist journalism feeds the nutbags. Edit: I horribly butchered her name via angry fat fingers. The proper spelling is Akiko Iwasaki\n\nhttps://www.dailymail.co.uk/health/article-14421799/yale-scientists-covid-vaccine-study-message-victims.html",
    "score": 465,
    "url": "https://reddit.com/r/labrats/comments/1ixz6yk/implying_that_akiko_isawaki_is_risking_her_career/",
    "created_at": "2025-02-25T16:34:25.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1ijxcqf",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Biotech Job Market Collapsing?",
    "text": "I know our industry is known for layoffs but obviously it's been much worse over the last year or so. With the impending demise of NIH/NSF/FDA/CDC etc tens of thousands of people will flood the job market in an already over-saturated environment and eventually the de-regulation of these entities will bleed into the private sector and biotech funding, likely causing many companies to close and investors to pull money. \n\nTwo days ago my group put up a job posting for an RA position and had well over 200+ applicants WITHIN two hours. We had to pull it so we could screen all the resumes in time. is this what other people are seeing?\n\nI'm looking to make a career change this year, things are looking extremely bleak for this industry.",
    "score": 453,
    "url": "https://reddit.com/r/labrats/comments/1ijxcqf/biotech_job_market_collapsing/",
    "created_at": "2025-02-07T15:19:28.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1iyqar9",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Why do PIs keep people who are not contributing to the lab",
    "text": "Just trying to understand out of frustration and tiredness. For some context, we have a postdoc in the lab who’s been in this lab literally all his career (undergrad, PhD and now postdoc for a few years). This postdoc does not contribute to chores. He doesn’t fill tips, doesn’t refill reagents and simply expects everyone else to pick up the slack. We have tried creating rosters but with everyone’s busy schedules it’s hard to enforce and we just make do when we can. When the PI has seconded the roster and this postdoc had the nerve to create the roster and told everyone to contribute. To his credit, he contributed for like two months before reverting to his ways.\n\nAdditionally, this postdoc is never around. He comes in the late morning and literally disappears from the floor (~80% of the time). Add on a two hour (or more) lunch break in the afternoon, none of the lab members actually know what his project is or what he is contributing scientifically to the lab. He does not have any unique technical expertise other than being around the longest to know where things are situated. And no, he does not write any grant to bring in money to the lab. His mentorship is subpar to say the least. Other lab members often have to retrain his mentees just to rectify some less commonly practiced lab habits. \n\nI’m pretty sure the PI knows everyone’s displeasure with the postdoc but yet it seems like the PI is trying to squeeze the post doc onto everyone’s publications. I really just needed to rant but any input or advice is welcome. \n\nEdit: for everyone who has mentioned it is not the job of the postdoc to do basic lab chores normally assigned to the lower ranked people. I would just like to clarify that it is common for my lab and other labs on the floor to be running on a skeleton crew (ie 5 people or less). Across every lab, regardless of rank, unless you’re truly busy writing in the office/ at the mice facility, everyone contributes to the lab chores in one way or another to keep the lab running. It is common to see senior postdocs filling tips and making buffers. Ordering is commonly done by lab techs but the dept is phasing them out so…",
    "score": 450,
    "url": "https://reddit.com/r/labrats/comments/1iyqar9/why_do_pis_keep_people_who_are_not_contributing/",
    "created_at": "2025-02-26T15:37:29.000Z",
    "num_comments": 98
  },
  {
    "id": "reddit-1ov83fg",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Does anyone else hate that the numbering on the serological pipets is backwards?",
    "text": "So I have used serological pipets for over 20 years. Never once have I wanted to use the larger numbering on the right. I have always used the annoyingly smaller numbers on the left for my entire career. \n\nI’ve always assumed that the majority of scientists used the reverse numbering on the right, and I was in the minority. But maybe we all hate this standard and just deal with it?",
    "score": 411,
    "url": "https://reddit.com/r/labrats/comments/1ov83fg/does_anyone_else_hate_that_the_numbering_on_the/",
    "created_at": "2025-11-12T15:24:47.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1kzzx1h",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "NSF 2026 Budget Proposal (it's bleak)",
    "text": "[https://nsf-gov-resources.nsf.gov/files/00-NSF-FY26-CJ-Entire-Rollup.pdf](https://nsf-gov-resources.nsf.gov/files/00-NSF-FY26-CJ-Entire-Rollup.pdf)\n\nThis mega document is the current NSF budget proposal to be approved by congress. Almost every section is being cut by gigantic margins (biological sciences -71.5%, engineering -75%, math and physical sciences -66.8%). \n\nThey also estimate that the funding rate will decrease from 26% (current) to 7% next year; this translates from 330,100 receiving support from NSF to only 90,000. 100% cuts to postdoc funding and CAREER grants.\n\nIt feels like there is a deliberate push for academics to move into industry positions. But this seems like a short sighted plan that will cut off future phd training programs and result in a short supply of researchers who can investigate emerging STEM problems in a relatively unbiased position. \n\nIs there anything we can do? I fear that even government representatives who sympathize with these detrimental cuts are not willing to demand the NSF request more budget...",
    "score": 405,
    "url": "https://reddit.com/r/labrats/comments/1kzzx1h/nsf_2026_budget_proposal_its_bleak/",
    "created_at": "2025-05-31T15:34:26.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1hp3b0m",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "While postdocs are necessary for entry into tenure-track jobs, they do not enhance salaries in other job sectors over time. Ex-postdocs gave up 17–21% of their present value of income over the first 15 years of their careers.",
    "text": "",
    "score": 401,
    "url": "https://reddit.com/r/labrats/comments/1hp3b0m/while_postdocs_are_necessary_for_entry_into/",
    "created_at": "2024-12-29T19:13:34.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1lk9tr2",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "What is a silent way you guys have notice that you know that lab has a ton of funding and money?",
    "text": "I will start, if they have any technicians that are only pay by one lab. Most labs have technicians are share with other labs to help pay the salary of the technician.\n\nEdit: It will be also cool to know ways that you silently know a lab does not have a lot of funding and money.\n\nEdit No.2: I mean as an example animal technicians only for one lab... like no use of vivarium staff or core... literally animal technicians payed full time for one labs work.",
    "score": 380,
    "url": "https://reddit.com/r/labrats/comments/1lk9tr2/what_is_a_silent_way_you_guys_have_notice_that/",
    "created_at": "2025-06-25T16:10:49.000Z",
    "num_comments": 222
  },
  {
    "id": "reddit-1oxmelg",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Is Dark Academia - How Universities Die, by Peter Fleming, accurate?",
    "text": "\" Fleming’s analysis is sharp, witty, and unflinching. He argues that the university has become a \"zombie institution,\" outwardly maintaining the rituals of academia while its internal life has been hollowed out by market logic. He details how the language of \"excellence,\" \"impact,\" and \"brand\" has created a environment of performative busyness where genuine intellectual curiosity is a liability. The chapter on \"communal cynicism\"—where everyone knows the game is rigged but feels compelled to play along—was a mirror held up to my entire department. This book offers no easy solutions, and that is its strength. It is not a self-help guide for surviving the academy; it is a diagnosis of a terminal condition. It gave me the vocabulary to understand my burnout not as a personal failing, but as a logical response to a broken system. It was the push I needed to look beyond the university walls for a meaningful life and career.\n\n10 Lessons and Insights from \"Dark Academia\":\n\n1. The University is a \"Zombie Institution\": It walks and talks like a place of learning, but its core has been consumed by corporate managerialism, leaving a hollow shell that mimics its former self.\n2. \"Toxic Professionalism\" is the Prevailing Culture: A performative ethos of overwork, competitiveness, and feigned passion masks a system of exploitation, creating an environment where burnout is the norm, not the exception.\n3. Your Value is Reduced to Metricized Output: Your worth as an academic is not your teaching or intellectual contribution, but your ability to generate measurable \"products\"—publications, grants, and citations.\n4. The \"Publish or Perish\" Imperative is Structurally Sadistic: The system is designed to create a permanent state of anxiety and job insecurity, especially for early-career researchers, forcing them into a cycle of endless production.\n5. Administration is the New Core Activity: The real growth in universities is in managerial and administrative roles, which impose auditing and compliance regimes that strangle actual teaching and research.\n6. The \"Impact\" Agenda is Often a Farce: The pressure to demonstrate the societal \"impact\" of research often leads to contrived, box-ticking exercises that distort genuine intellectual inquiry.\n7. Precarity is a Feature, Not a Bug: The reliance on a vast, underpaid army of adjuncts and fixed-term contract researchers is essential to the business model, ensuring a disposable workforce with little power or job security.\n8. Cynicism is the Collective Coping Mechanism: Most academics are privately cynical about the system's demands, but this cynicism is passive. It allows the game to continue because everyone is too afraid to stop playing.\n9. The \"Brand\" is Everything: The university's primary concern is its market brand and position in league tables. Education and research are merely marketing tools to attract customers (students) and investment.\n10. Escape is a Legitimate and Often Sanity-Saving Choice: Fleming legitimizes the desire to leave academia. Recognizing that the system is dysfunctional, rather than internalizing its failure as your own, is the first step toward liberation and a healthier professional life.\"",
    "score": 363,
    "url": "https://reddit.com/r/labrats/comments/1oxmelg/is_dark_academia_how_universities_die_by_peter/",
    "created_at": "2025-11-15T08:20:51.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1ni2ssk",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Yo what's with those AI trainer jobs???",
    "text": "Every so often when looking at bio jobs these AI trainer jobs show up. They promise a huge salary, remote work, and flexible hours. Basically the listings want a PhD in bio to feed info to AI models and assess outputs.\n\nSeems too good to be true, putting aside ethical concerns for supporting AI. Job sounds relatively easy, pick your schedule, wfh. All my alarm bells are going off when I read those postings.\n\nAnyone ever take one of those jobs and have some gossip? What is going on???",
    "score": 257,
    "url": "https://reddit.com/r/labrats/comments/1ni2ssk/yo_whats_with_those_ai_trainer_jobs/",
    "created_at": "2025-09-16T00:20:44.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1mxs7oj",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "3 months post-PhD, still unable to get a job, and battling with severe depression. Anyone else?",
    "text": "Hi fellow labrats,\n\nThis summer has been a tough one to say the least. I graduated with my PhD in May, but didn’t feel happy or accomplished due to scientific job prospects in the US. In March, I had interviewed with a lab for a prestigious fellowship and sounded like I was going to get it — until the federal government gutted the funding office. \n\nI have applied for 50+ jobs since then and only gotten one interview. Most rejected me or ghosted me. I was supposed to hear back from the job that I interviewed for by end of this week. I got no response. \n\nI have even applied for jobs that I am overqualified for, and again, I’ve been rejected. I don’t feel comfortable doing sales due to an ADA related situation. \n\nI have been battling a pretty severe depression and although I am being seen for mental health, it just doesn’t seem like enough. My husband and I are also living off his salary and barely making ends meet. I feel terrible for dragging us into this mess. \n\nI’m not sure what to do from here. I get stressed to the point of having chest pain when searching for jobs because it just feels like a dead end every time. \n\nAnyone else going through this? Anyone get past this that can give words of encouragement? ",
    "score": 219,
    "url": "https://reddit.com/r/labrats/comments/1mxs7oj/3_months_postphd_still_unable_to_get_a_job_and/",
    "created_at": "2025-08-23T04:41:25.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1kpifvb",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Why do bachelor degree in Clinical Lab Science pay more than PhD?",
    "text": "In California with a bachelor degree in CLS the pay scale is around $50-$76 per hour in Southern California and $58-$88 per hour in Northern California\n\nWorking OT at $100+ per hour can massively inflate this salary.\n\nIt seems most PhD in academia are lucky to make half that amount and bachelor degree in academia make near minimum wage.\n\nWhy is there such a disparity in pay between testing blood and pee in a hospital lab that it makes so much more than higher educated people in academia?",
    "score": 194,
    "url": "https://reddit.com/r/labrats/comments/1kpifvb/why_do_bachelor_degree_in_clinical_lab_science/",
    "created_at": "2025-05-18T12:07:14.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1osgxu7",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Any other soon-to-be PhDs noticing this?",
    "text": "I’ve been applying to jobs (summer 2026 defense in the works), and I’m honestly just really annoyed and upset at the fact that Sr. Scientist positions at big pharma/biotech firms are starting to ask for 2 YOE post-PhD…\n\nAt the same time, not even remotely surprisingly, I am seeing an influx in industrial post-doc postings, many of which are seriously underpaid with salaries that do not scale to location/HCoL areas…Merck for example, offering the same salary range to post docs both in Lansdale, PA and…you guessed it! South San Francisco, CA. Range is $75-86k. Absolutely a scam, despite the cool, relevant skills gained.\n\nI’m hoping I can use my connections and get lucky and land an FTE industry role right away, but I’m worried. Seems like an awful time to enter this area of work, and it’s honestly got me scared that my ~6y PhD will be a waste and not the terminal schooling I was hoping it to be. Anyone else feeling this way? Industry is ass at the moment, and I am worried lol",
    "score": 180,
    "url": "https://reddit.com/r/labrats/comments/1osgxu7/any_other_soontobe_phds_noticing_this/",
    "created_at": "2025-11-09T11:21:15.000Z",
    "num_comments": 129
  },
  {
    "id": "reddit-1khth2d",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "How much do you make as a research assistant?",
    "text": "Hi lab rat gang, \n\nAs the title would hit, I’m curious (if applicable to you) as a RA how much you make in 2025?\n\nPlease include: \n1. Age\n2. Highest degree\n3. years of experience \n4. Salary (or hourly pay)\n5. Geographic region \n6. And do you feel underpaid? \n\nFor me I’m 27, with a masters, with just about 4 and of half years of research experience, making about $57k in the south. Yes, I feel very underpaid, especially with the amount of work I do for my lab and other labs and the current economic environment. RIP to buying a house:(\n\nEdit: Thank you all for commenting!!! Very insightful information!! I hope this helps you in someway and hopefully a salary increase because you are worth it!!! \n",
    "score": 148,
    "url": "https://reddit.com/r/labrats/comments/1khth2d/how_much_do_you_make_as_a_research_assistant/",
    "created_at": "2025-05-08T15:50:46.000Z",
    "num_comments": 147
  },
  {
    "id": "reddit-1ietdi1",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Just got fired today :(",
    "text": "so technically, my position was terminated due to the contract not being renewed and my PI cannot afford to pay my salary any longer. I am not sure what to do next. i feel like my skills are so specific? Any advice on transitioning into another field or perhaps going into industry? recommendations?? \n\nanything would help 😭❤️ thanks ",
    "score": 146,
    "url": "https://reddit.com/r/labrats/comments/1ietdi1/just_got_fired_today/",
    "created_at": "2025-02-01T00:04:05.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1ox0hdo",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Job hunting and networking is so defeating right now",
    "text": "On top of the 250+ job applications I've put in over the past year I've recently tried the following\n\nEmailed multiple phd program reps who are listed online as the person to contact if you're interested in applying for the program- no response\n\nMessaged multiple companies/recruiters on LinkedIn I've applied for that I'm highly qualified for- no response\n\nMessaged someone on LinkedIn who used to work for the university that I currently work for who works in a specific field that I'm interested in, asking for any advice- no response\n\nPaid for a resume and cover letting editing service- one job offer max salary 45k per year, and I have a masters degree\n\nEven outside of research job searching I messaged someone on Instagram asking if they had any online sources of information for an advanced method of a hobby that I'm currently into that they're very good at, their response?- \"No I learned by doing\" \n\nAm I going fucking insane? Does everyone just know something that I don't? I know the market is horrible right now but it feels like I barely even exist the way that I can't get a response out of anyone.\n\nI'm just venting to my fellow research workers reading this right now. But this job search over the past year has been emotionally devastating. I thought I was a good candidate with a lot of valuable experience and education. I'm second guessing every career decision that I've ever made now. I just want a break. \n\n\n",
    "score": 128,
    "url": "https://reddit.com/r/labrats/comments/1ox0hdo/job_hunting_and_networking_is_so_defeating_right/",
    "created_at": "2025-11-14T16:03:34.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1oolhud",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "I'm not entry level!",
    "text": "I was recently asked to apply for a lead tech position by a talent scout for lab animal work. It would be an awesome boost to my salary and even though I didn't really plan to come back into this field, I was willing to for a job a bit less taxing on the body than what I do now. I more than met the qualifications for the position and was excited for my interview with the hiring manager. \n\nBut... I don't have a ton of experience with dosing animals (my previous institutions didn't have the animal techs do this). I told them I'd learn fast and be proficient in no time. I have my LATg.\n\nAt the end of the interview, the hiring manager said he was likely going to pass on my application since I didn't have that specific skill (not listed as a requirement on the job listing). He encouraged me to apply for their entry level positions. \n\nI got an email from the talent scout with the entry level listing. It makes about the same as I make now and there's not really a good incentive for me to leave my current position. \n\nAnd I know it seems like I'm looking down my nose, but I have a bachelor's, 4 years of experience in the field, and just got my master's last year. It just feels insulting to be told I'm better suited for entry level when I've worked so hard. \n\nI'm also still working an entry level job at an animal shelter. The job hunt is just killing me.",
    "score": 88,
    "url": "https://reddit.com/r/labrats/comments/1oolhud/im_not_entry_level/",
    "created_at": "2025-11-04T22:30:09.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1nkcsbd",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Salary in academic research hospital",
    "text": "I've just been offered a job at an academic research hospital in an HCOL. I recently got my PhD and worked for \\~2 years in research after my bachelors. They offered me just over 110k. Is this a good salary with the current state of the market? I know industry jobs can start out at 120-140k, but the positions I am in the running for in industry are taking quite long to progress (if at all).\n\nedit: it's a staff scientist position analyzing clinical samples, not postdoc or tenure track",
    "score": 85,
    "url": "https://reddit.com/r/labrats/comments/1nkcsbd/salary_in_academic_research_hospital/",
    "created_at": "2025-09-18T16:20:12.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1nr8dxs",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "After 9 months of applying to over 200 jobs, I finally got an offer- 12k less than I currently make",
    "text": "The HR rep said that she'll see if they can raise the offer at all, or see if there's a higher position that I could possibly be given, but it didn't sound hopeful. I know I have to get out of academia but a huge chunk of the jobs I've applied to have been industry and I haven't even been offered an interview at one. \n\nIt's just kind of bleak- with a masters and 7 years of research experience I didn't think I'd be getting salary offers this low. I know the market is abysmal right now and a lot of this is out of my control, but this job search has been emotionally devastating. Most of my other interview offers have been at MLM's. I know things will pull through eventually but damn shit is hard right now ",
    "score": 83,
    "url": "https://reddit.com/r/labrats/comments/1nr8dxs/after_9_months_of_applying_to_over_200_jobs_i/",
    "created_at": "2025-09-26T18:03:27.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1i2m748",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "two weeks into phd and my supervisor tells me he's leaving in a year",
    "text": "posting on an old throwaway\n\nhi everyone! the title describes my predicament. to provide more context: i recently started my phd two weeks ago. this week, my supervisor sits me down and tells me he is most likely not extending his contract. this wasn't an easy decision for him but over the past couple years, there has been a growing lack of support and funding for the research we do. it is not conducive to continue working under leadership and management that do not provide adequate support while overworking its scientists and hence, my supervisor had to make a difficult choice.\r\n\r\nthis obviously comes at extremely unfortunate timing. right now, nothing has been finalised yet but he has advised us to start finding other options. if I was a research assistant, things would be more straightforward. however, the nature of my phd contract makes things difficult. I work for the research organisation as a researcher and am enrolled part-time as a phd student. the research organisation is paying me a salary and sponsors my tuition. early termination of my contract would require me to repay the tuition fees that the organisation had paid thus far. my contract also ends without any penalty if my supervisor leaves the organisation.\r\n\r\nas of now, here are my options:\r\n1. remain in the current research organisation but switch to another supervisor, lab and project. \nthe easiest and least headache-inducing solution. i would lose some progress as i have already been working on my project for more than a year but I would still have a salary and sponsorship. however, there are some admin issues. other labs that interest me have already met the organisation's manpower quota. I will be emailing the relevant people to ask for some leeway but chances are low. the issue of low support and funding for research still remains. if I stay but did not manage to transfer into a desired lab, there is a risk that i would be placed into another lab that works on things entirely different from my interests.\n\r\n2. break my contract asap, pay the required amount (~$9k/year) and look for openings in my current university. \nI would lose my current funding but since I am a part-time student with the university, I would just need to switch my candidacy from part-time to full-time and apply for a university scholarship to cover my tuition fees. I also lose my current progress on my project but get the freedom to choose a lab that aligns with my research interests.\n\r\n3. wait it out for 1 year for my supervisor to leave, allowing me to leave as well without penalty. \nif this happens, there is a chance that my supervisor would have opened another lab elsewhere. he mentions that he would like to bring me along to the new lab if possible. I like working with him and wish to complete my phd under his supervision and guidance.\r\n\r\nthank you for reading my post! please share any advice you might have for me or if im overthinking this whole thing. this issue has been giving me anxiety and some reassurance would be nice 🥺\n\n\nedited for formatting",
    "score": 64,
    "url": "https://reddit.com/r/labrats/comments/1i2m748/two_weeks_into_phd_and_my_supervisor_tells_me_hes/",
    "created_at": "2025-01-16T10:42:22.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1ibno00",
    "subreddit": "labrats",
    "soc_codes": [
      "29-2011",
      "29-2012"
    ],
    "title": "Incredibly incompetent lab scientist/PhD student",
    "text": "Sorry if this isn't the right sub -- I work in bioinformatics so it might be a little adjacent to a lot of the content on this sub. \n\nI work as a research software engineer (US, R1 university). I'm relatively young (2 yr out of undergrad) with just my BS and am getting my MS at the same time as working. I've worked here since coming out of undergrad/worked for the same group in undergrad.\n\nWe hired a 'data scientist' \\~18mo ago who already had an MS but is also doing their PhD. Apparently they had nearly a decade of work experience in data science. They make &gt;160K (similar or more than every research assistant prof/non-tenure track faculty member in the department; about 50% more than me and 20% more than our most senior lab staff member). \n\nSomehow, they are the most incompetent person I have ever worked with in any capacity: everything from not being able to open an .rdata file (this is not a joke -- I had to take the 30 seconds to save the two dataframes as CSVs and resend them; ultimately half a workday blocker because I didn't receive the follow up until 4 hours after I had initially sent it) to having horrific technical writing skills/paper formatting skills to taking WEEKS TRYING to do tasks scoped for 2-3 days just to have them complain about things \"out of their control\" (frustrated with AWS EC2 (bog standard IMHO), frustrated with data quality, etc etc), have it dumped on my plate, and then proceed to have zero issues finishing it in a few hours or two days at MOST. They also constantly skip meetings, call out for ridiculous reasons (the same week a paper and grant are due, they take two afternoons off for being \"tired\" while two of us work till 7pm)\n\nMy PI is relatively non-technical/hands-off at this point in his career (and also does not have a formal computer science background) and does not look into specifics (why does it take them a month to train a classifier? why don't they share any code?), there are no other students in the group, and the other staff members are very much not the types to rock the boats (and I'm guessing have probably just seen their fair share of less than stellar PhD students and lump them in with that). I probably wouldn't have an issue if they were just a PhD student, but them making probably 4x more than what they should really frustrates me. \n\nFurther, my PI continues to act like their experience is a saving grace and the scope of that experience just keeps getting reduced (to the point they are now exclusively an \"expert\" in classifier development and have basically no other lab responsibilities). They also insist on incredibly questionable practices that my PI outright disagrees initially with (e.g. reporting absurdly high \"test-set\" accuracies (way higher than the validation set/cross-validated accuracies) and insisting it's acceptable for publication) but gives in because of the supposed pure data science background.\n\nIf I were my PI, I would have fired them 6+ months ago. I am also perfectly happy with my salary but the discrepancy borders on insulting.\n\nI'm at my witts' end with the handholding and authorship gifting. I just have no idea how to bring this up or if I'm even allowed to.  \n\n  \nApologies for the rant-like nature of the post, just unsure what to do (other than possibly look for a new job, which would be an extreme shame because I seriously love every other aspect of my current position). ",
    "score": 63,
    "url": "https://reddit.com/r/labrats/comments/1ibno00/incredibly_incompetent_lab_scientistphd_student/",
    "created_at": "2025-01-27T23:35:40.000Z",
    "num_comments": 14
  }
]