[
  {
    "id": "reddit-1oe8sno",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Wedding makeup trial, first time wearing makeup",
    "text": "Hello, I have never worn blush concealer foundation lipstick or fake lashes. I went with my mother in law and she loved it but want more feedback or constructive cristiscim. This is probably how I will do my hair, was my first time curling it like this, too. Next time the curls will be better. \n\n Lol all of this is new, I have no bridal party so friends how do I look? ",
    "score": 3681,
    "url": "https://reddit.com/r/weddingplanning/comments/1oe8sno/wedding_makeup_trial_first_time_wearing_makeup/",
    "created_at": "2025-10-23T17:01:39.000Z",
    "num_comments": 526
  },
  {
    "id": "reddit-1klrnxj",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "OH MY GOD JUST GIVE ME YOUR RATE",
    "text": "Listen I know it's a racket but like WHY do these guys not just give you their package pricing initially. There is no sales pitch that's going to trick me into paying extra for something I don't need JUST TELL ME WHAT YOU CHARGE and sell me on it later OH MY GOD.\n\nEDIT: Guys I work in events with vendors in the nonprofit sector and nightlife. I’ve literally put on events with the exact same services and needs for a wedding (florist, videographer, photographer ETC.) I speak to vendors on the daily a lot of the vendors under this post insisting this has to be an over complicated interview process are either incredibly unprofessional or full of shit. \n\nI never have drama getting rates from vendors for our gala/benefit concert/golf outing etc. they are able to produce an exact number or atleast a range. \n\nY’all are putting normie couples through an exhausting process where you try to form some type of fake relationship with the couple that makes you feel like the only option so it’s easier to up charge people who don’t know any better and it’s incredibly transparent and fucking gross. Y’all aren’t slick quit defending this practice in the comments it reeks of “I’m not surviving the impending recession” \n\nPUT PACKAGE PRICING/ESTIMATES  ON YOUR WEBSITE ",
    "score": 2648,
    "url": "https://reddit.com/r/weddingplanning/comments/1klrnxj/oh_my_god_just_give_me_your_rate/",
    "created_at": "2025-05-13T17:18:47.000Z",
    "num_comments": 343
  },
  {
    "id": "reddit-1l9pgi9",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "My caterers got my wedding date wrong. I found out 1 hour before the ceremony",
    "text": "The day started great and exactly as it should have - I got ready with friends and family, took a few photos - everything was perfect.\n\nWe only had 2 hours to set up before the ceremony began at 5pm, so around 3pm, a handful of friends and family headed to the venue to start setting up decor, put out the cake, put table numbers and menus on tables, etc. I was an *extremely* organized bride. I had the entire day planned by the hour, and everyone had an assignment to help the day go smoothly.\n\nAt 3:30, I received a text from one of my bridesmaids: \"What time is the catering team supposed to get here?\" They were supposed to arrive at 12pm to start setting up, but I don't panic, assuming that they're just running late or caught in traffic.\n\nOne thing to note here - our catering team wasn't just responsible for food. They supplied the tables, chairs for the ceremony and reception, linens, cups, plates, bar tables...pretty much everything. I start to call a few people from the company to get an ETA.\n\nI can't get through to anyone.\n\nI finally call the restaurant the catering company has. The teenager who picks up has no idea what I'm talking about, but says he'll get back to me ASAP.\n\nOk, fine.\n\nAnother 15 minutes goes by. Silence.\n\nI call the restaurant back. \"Anything?\" I ask. \"Nope,\" says the teen. \"I can't get in contact with anyone either.\"\n\nA few minutes later, I get a call from Susan, the woman from the catering company who I've been working with for 15 months.\n\n\"Hi Susan, how are you?\"\n\n\"Well, honestly? Not great.\"\n\nSusan then proceeds to explain to me that they somehow wrote my wedding date as May 25, 2025, instead of the correct date of May 24, 2025. She says everyone is scrambling to figure out how to get food, chairs, tables, etc over to the venue as quickly as possible.\n\nSomehow, I remain calm. I'm 5 minutes from the venue so I text my bridesmaids the situation and just take deep breaths. We're an hour from the when ceremony is supposed to begin and have no chairs, no food, no staff, no water...nothing.\n\nHere's everything that happened in that next hour:\n\n\\- My bridesmaids found a winery close by that felt so bad for us, they let us borrow 40 chairs for the ceremony for free so we could start at 5:30. My dad drove in his pickup truck to pick them up, and my entire family helped set up the chairs (and take them down after the ceremony!)\n\n\\- We convinced the violinist to stay an extra half hour to cover the ceremony (she was paid ofc).\n\n\\- My bridesmaids found an umbrella in the venue, flipped it upside down, filled it with ice that our groomsmen bought from a nearby liquor store, and made it a makeshift cooler for drinks. We supplied our own alcohol, so guests were able to grab a beer while they waited for the ceremony to begin.\n\nThe ceremony began with only a 30 minute delay, but here's everything else that we missed out on:\n\n\\- I lost 30 minutes of my wedding by starting at 5:30 instead of 5\n\n\\- My dad missed an hour of his daughters wedding dealing with the chairs\n\n\\- I got dressed by myself because everyone was handling things for me (no pics during this time either so I don't have any pics with my family or bridesmaids pre-ceremony)\n\n\\- Paper napkins instead of my gorgeous twill blue linen napkins, and white tablecloths instead of the color I picked\n\n\\- Plastic cups for drinks and champagne toasts\n\n\\- We used this massive carving knife to cut the cake instead of the ornate cake cutting set I ordered through the caterers\n\n\\- We only had 1/4 of the passed apps I paid for (I was SO excited for the bacon wrapped scallops)\n\n\\- No high top tables or chairs for cocktail hour\n\n\\- Only 3 attendants instead of the 5 I paid for\n\nBut you know what? I honestly wouldn't have changed a thing. My family and friends stepped up so completely and totally, I was in tears not from the stress but from the love I felt for everyone.\n\nI had a few people ask me over the course of the day why I was so calm and seemed so relaxed about the whole situation. I realized that having everyone I loved in one place on the day I was going to marry the love of my life was all I ever needed. If worst came to worst, we'd order pizzas and eat standing up while giving toasts with beer cans and we'd have an absolute blast.\n\nI wanted to make this post to reassure every stressed out bride that no matter how prepared or organized you are, there are still things that can go wrong and are totally out of your control - but THAT'S OKAY. I prepared and organized so. freaking. much. during the lead up to the wedding, that anything that went wrong was simply left to fate. I truly had the best day and felt so touched by my family and friends for literally saving the day again and again.\n\nOh, and I negotiated a 75% refund from the caterer, so...not so bad after all.\n\nhttps://preview.redd.it/5pemsgxnli6f1.jpg?width=5439&amp;format=pjpg&amp;auto=webp&amp;s=b21ca453296a2e76e426a257ef4371b056d0b747",
    "score": 2612,
    "url": "https://reddit.com/r/weddingplanning/comments/1l9pgi9/my_caterers_got_my_wedding_date_wrong_i_found_out/",
    "created_at": "2025-06-12T15:32:19.000Z",
    "num_comments": 207
  },
  {
    "id": "reddit-1jdec6n",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "PASSWORD PROTECT ALL YOUR VENDORS",
    "text": "We’re getting married in Napa Valley in the start of April. My fiance and I put a ridiculous amount of time into curating a chef made seasonal menu for our wedding. Our original menu carried butter poached lobster, wagyu short ribs, white truffle risotto, and a tasting menu of vintage wines that the sommelier personally walked us through. Everything we chose was local, fresh, and perfectly paired\n\n2 weeks back, our wedding planner calls us and asks if we made some last min changes to the menu because he just got an updated list from catering, and it’s…not what we originally discussed. That’s when we found out MIL had called our caterer and completely changed the menu behind our backs\n\nGone were the short ribs and lobster. In its place we had caesar salad, chicken parmesan, mashed potatoes, and a “fun” chocolate fountain. (Her words) Oh, and our carefully selected vintage pairings got swapped for a “house red” and “house white”\n\nWe genuinely thought it was a mistake. But NOPE, my MIL somehow got a copy of our catering contract (still don’t know how) and took it upon herself to “fix” our menu. She said “People don’t actually want all that fancy food, they just want something familiar and comforting.” I cannot stress enough how she is not paying for this wedding\n\nWe immediately called the caterer and thankfully, since we had the original contract on file with our planner, they reinstated our menu. It did take some scrambling because some ingredients had already been canceled, but at that point, we were willing to pay whatever we had to in order to undo the mess\n\nMy fiance decided to password protect EVERYTHING. Our venue, caterer, florist, literally every vendor now requires a password and written confirmation from both of us before making any changes. If you have a family member who loves inserting themselves where they don’t belong, I highly recommend this\n\nI’m 18 days out rn and haven’t told her a damn thing about this btw. She still thinks her menu is happening. She will find out when she sits down at dinner just like everyone else. If you’re in the thick of wedding planning, password protect your vendors ASAP. You never know what someone might try to pull behind your back",
    "score": 2495,
    "url": "https://reddit.com/r/weddingplanning/comments/1jdec6n/password_protect_all_your_vendors/",
    "created_at": "2025-03-17T14:45:33.000Z",
    "num_comments": 284
  },
  {
    "id": "reddit-1iu9b2z",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "So grateful for this community! Had the most stress-free wedding planning and the perfect day thanks to all your advice :’)",
    "text": "Was more of a lurker… and posted on an anon account, but super grateful for this amazing community! The entire process was honestly a BREEZE. \n\nNo anxiety about who we did or didn’t invited, not allowing kids, food and drink options, etc. Instead, we focused solely on ourselves and our own happiness. It’s true that on your wedding day you seriously notice NO ONE else but your partner :) \n\nThe only thing I WISH I did was eat more at dinner. But I seriously couldn’t bring myself to eat more than 3 bites! Fortunately I had a large lunch which helped offset some of the drunkenness. ",
    "score": 2318,
    "url": "https://reddit.com/r/weddingplanning/comments/1iu9b2z/so_grateful_for_this_community_had_the_most/",
    "created_at": "2025-02-20T21:03:27.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1jybt4x",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Americans: Do not change your last name at marriage",
    "text": "There have been a number of posts recently about changing your name after marriage. If you are not already aware, the house in the US just voted to pass the SAVE Act, which will require you to prove your citizenship to vote -- under your _birth name_. It will disproportionately affect women who have changed their last names and no longer match their birth certificates.\n\nThis should be a huge HUGE consideration when you are choosing whether to change your name. You may well disenfranchise yourself as an American citizen by doing it. \n\n\nhttps://www.msnbc.com/top-stories/latest/save-act-house-voting-rights-married-women-last-name-rcna200948\n\nEdit: Call your senators. This is not law yet but if it passes the senate, it will essentially mean that any woman who changes her name must jump through many more hoops to be able to vote. It's unfair and _will_ be used to silence women and trans people.",
    "score": 1960,
    "url": "https://reddit.com/r/weddingplanning/comments/1jybt4x/americans_do_not_change_your_last_name_at_marriage/",
    "created_at": "2025-04-13T16:37:31.000Z",
    "num_comments": 361
  },
  {
    "id": "reddit-1k0dbas",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "I lost my cool at my wedding",
    "text": "I completely flipped shit at my uncle because he wore a political shirt under his suit at my wedding. After a few bridesmaids/people coming up to me saying he was causing different issues (making fun of a gay waiter, told my brides maid her husband probably cheats on her, talking through my ceremony, called my mom a loser, nothing to crazy and he said they were all “jokes nobody understands”) I went up to him to see if he was too drunk and needed cut off or what the deal was and he took his suit off, showing me his political t shirt underneath. He very well knows our opinions are different, and apparently him putting that aside for my wedding day was too much to ask. I started screaming that he wasn’t there to support me, he was there attempt to upset me, and asked him to leave.  \n \nNow my entire family is fighting.  What would you have done? He very clearly wasn’t there to show me love and support or he wouldn’t have been wearing that. \n\nI feel like this has poisoned my memories from my special day and I regret how I handled it. But I also strongly believe he shouldn’t have been there. ",
    "score": 1717,
    "url": "https://reddit.com/r/weddingplanning/comments/1k0dbas/i_lost_my_cool_at_my_wedding/",
    "created_at": "2025-04-16T05:55:48.000Z",
    "num_comments": 231
  },
  {
    "id": "reddit-1niu9w1",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Unassigned Seating Disaster",
    "text": "I feel like I see the unassigned vs assigned seating debate on here frequently and I figured I'd share a recent experience. I went to one of my coworkers weddings this past weekend. She had told me she wasn't assigning seats because it felt stuffy. Fair. She's very laid back and her wedding was pretty casual. \n\nThe ceremony was lovely and the cocktail hour was very nice. Once the outdoor cocktail hour was done and the doors to the inside reception space were opened, all hell broke loose. My other coworkers and quickly I sat at one of the back tables (we know the bride well, but figured family and close friends should be up close). We took up 6/8 seats. Others were RUNNING to get tables. Literally jogging through the venue. We had to help 2 different sets of older relatives who didn't know where to sit. One asked us where the table numbers were, the other couple just looked so lost. \n\nWhen 80% of people had sat down, things started to get really awkward. People were moving chairs and the really cute place settings from one table to another. Like picking up the chargers and napkins and jamming up to 12 people at an 8 person table. Then, a family of 6 came in. There wasnt a single table left with more than 2 available seats. My coworkers and our dates all made the decision to split up and move so they could sit together. This was the grooms brother, sister in law, and nieces now sitting on the back corner. My boyfriend and I ended up sitting with the brides aunt, uncle, and cousins right up at the front. \n\nY'all, a little stress before the big day is worth it. Otherwise your guests are going to be stressed and end up in awkward seating situations. ",
    "score": 1613,
    "url": "https://reddit.com/r/weddingplanning/comments/1niu9w1/unassigned_seating_disaster/",
    "created_at": "2025-09-16T21:24:35.000Z",
    "num_comments": 202
  },
  {
    "id": "reddit-1kxs8b4",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "The hair trials I paid hundreds of dollars for vs. what my coworker did for free",
    "text": "I had my first hair and makeup trial at the end of March and was very unhappy with it. I voiced this to the stylist and she told me that my hair was too thin and dead to achieve the look I wanted without extensions. \n\nI had a second trial with a new stylist, and while I was much happier with the results it still wasn’t exactly what I had asked for. She still did an amazing job though. \n\nOne of my coworkers (an angel on earth) also does hair full time and offered to do a trial after our shift over the weekend. She killed it, did  EXACTLY what I asked for, it took barely 45 minutes and the curls lasted the rest of the day. I am SO HAPPY with the results and feel so much better about my hair for my wedding. \n\nI showed each stylist the same reference photo. It’s interesting to see how everyone did their own spin on it, but in the end I am forever indebted to my incredible coworker for saving the day. ",
    "score": 1431,
    "url": "https://reddit.com/r/weddingplanning/comments/1kxs8b4/the_hair_trials_i_paid_hundreds_of_dollars_for_vs/",
    "created_at": "2025-05-28T20:52:44.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1mzqpha",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Just got married. Here is my advice!",
    "text": "Do not worry about anything. The day is going to go exactly how it is going to happen. Your hair may not be perfect, your make up may start to melt. The photographer who ghosted you for 3 months will show up. Don’t worry about saying hello to each and every guest. Enjoy your new husband.  Don’t worry about timeframes and sticking to an itinerary. Be with your loved ones. Don’t worry about being a drunk bride, it’s your day have fun. You feel bloated in your dress? Cool who cares, people are going to say you look gorgeous anyways because everyone is there for you and your husband not to judge how your body looks. Don’t sweat small details when planning because honestly no one cares except for you. You do not have to spend a million dollars to make memories. Don’t worry about stepping away from your husband you’ll be with him hopefully forever. If you have family that is causing problems just ignore it, it’s not your problem that day. Just relax, feel like a bad ass, and enjoy your day because it happens so fast. ",
    "score": 1376,
    "url": "https://reddit.com/r/weddingplanning/comments/1mzqpha/just_got_married_here_is_my_advice/",
    "created_at": "2025-08-25T13:36:48.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1o6lzf5",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "UPDATE: Dad wants to do a memorial for my sister at my wedding but I'd rather she wasn't mentioned.",
    "text": "**Original Post:** [https://www.reddit.com/r/weddingplanning/comments/1o3d97t/dad\\_wants\\_to\\_do\\_a\\_memorial\\_for\\_my\\_sister\\_at\\_my/](https://www.reddit.com/r/weddingplanning/comments/1o3d97t/dad_wants_to_do_a_memorial_for_my_sister_at_my/)\n\n  \nI received a number of requests for an update to this, so here we are. It's a good update, thankfully!\n\nI spoke with my dad the morning after making the post. I tried to emphasize that mentioning my sister's passing in detail at the wedding would be very difficult emotionally for my mother and I, would take away from my fiancé's (now husband's) day and would probably make the guests uncomfortable or saddened. He said he was resistant at first because he's been so afraid of my sister's memory fading away, but that ultimately he understood my concerns. He still wanted her present in some way that wouldn't take away from our day. I offered suggestions that people gave for ways to have her memory present. We decided to have a seat reserved for passed loved ones at the ceremony, and an empty seat with a name-tag for her at the wedding party's table during the reception dinner. My dad was the officiant as originally planned, and he gave a beautiful speech at the ceremony and a heartfelt toast that was focused on the joy of the day instead of the sadness of the past. As far as I'm aware, everyone at the wedding had a wonderful time and the only tears shed were happy ones.\n\nI know that there were multiple commenters who said my dad should be replaced as the officiant no matter what, but I'm glad I didn't do that -- after the wedding was over, he gave me a big hug, crying because it meant so much to him that we trusted him to do the ceremony and how happy it made him to be such a big part of the wedding. It meant a lot to my husband and I, too.\n\nMoral of the story: sometimes it takes a few tries to get it right, but honest and heartfelt communication between everyone involved won the day here.\n\nThanks again to everyone who left advice, comfort, well-wishes and grandma hugs. :) I did not at all anticipate the interest in my post but I'm grateful for everyone's comments even if I ran out of time to reply to everyone!\n\nIn the end, it was a perfect wedding and I couldn't be happier with how it turned out.",
    "score": 1328,
    "url": "https://reddit.com/r/weddingplanning/comments/1o6lzf5/update_dad_wants_to_do_a_memorial_for_my_sister/",
    "created_at": "2025-10-14T17:31:13.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1jsb88v",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "You know you’ve picked the right dresses when they look this perfect together &lt;3",
    "text": "My partner was trying on dresses today, and the consultant asked us if I'd like to put on the dress I had already chosen so we could see our two dresses side by side. Any doubts I had about whether they'd work well together vanished instantly. It may not be the traditional way to pick out a dress, but I don't think I've ever felt a moment quite so magical ♥️",
    "score": 1316,
    "url": "https://reddit.com/r/weddingplanning/comments/1jsb88v/you_know_youve_picked_the_right_dresses_when_they/",
    "created_at": "2025-04-05T19:17:46.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1kzzeot",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Depressed that I'm not at my brother's wedding today.",
    "text": "I'm a paraplegic and my brother is getting married at a destination wedding today. I thought I was important in his life, but after questioning why my invitation was different (didn't include the invite to the first party on a boat because apparently it's impossible to accommodate someone in a wheelchair on a boat, even though I've seen others manage). Instead of being told ahead of time that my invite would be different, I thought maybe it was a mistake, I was told the whole venue just wouldn't be accessible for me. Just because I couldn't go on the boat shouldn't have meant my daughter should be excluded,  and that's all I was asking about. Apparently, even asking about that was offensive enough that all of a sudden I was told the venue was just not going to be accessible to me, so they said I shouldn't come. This is my little brother. Yes, he's 18 years younger than me, but I was the one who helped to raise him while my parents followed their careers and traveled extensively. I taught him how to drive, I helped him apply to college, I edited and rewrote every paper he turned in during college. I've loved this kid and doted on him my whole life and being cut out of his wedding hurts so much that I've cried  everyday about it for months. Please brides, when decide on your dream destination, please consider family members with disabilities who just want to be included too. The fact that neither of my parents even bothered to advocate for me also hurts. I know I was my dad's child from a precious marriage, but I lived with him, his new wife and my baby brither from when I was 15. I thought they were my family, but instead they've clearly let me know I'm nothing to them. I don't know how to get through today, seeing all the posts of a wedding I've been excluded from. I don't think I'll ever be able to get over this hurt. Worst of all, I have a daughter, the groom's neice, who is also feeling completely rejected from the only extended family I have. I know now that they prefer the carefree life of not dealing with a paraplegic family member. No wonder so many of us commit suicide. This makes me feel worthless, like the years of love and care I poured into him have ended in callous rejection. ",
    "score": 644,
    "url": "https://reddit.com/r/weddingplanning/comments/1kzzeot/depressed_that_im_not_at_my_brothers_wedding_today/",
    "created_at": "2025-05-31T15:12:58.000Z",
    "num_comments": 73
  },
  {
    "id": "reddit-1mzant9",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "My wedding day was the worst day of my life",
    "text": "It’s been two months since my wedding, and I can’t stop thinking about it with tremendous guilt and anxiety.\n\nBefore my wedding, I was pursuing a career after finishing my degree. My life changed when I saw a positive pregnancy test. My boyfriend and I decided to have a shotgun wedding and raise this child together, since we knew we were going to get married eventually anyway.\n\nThe stress of a short-notice wedding (I had to get married before I was showing) with pregnancy symptoms was really hard. I reached out to my three closest friends to let them know my wedding would be in three months.\n\t•\tFriend 1 completely ghosted me.\n\t•\tFriend 2 said she’d try to make it, then couldn’t because of money and flying from Florida to New York—. A month after my wedding she called me from an island saying she booked a girls trip the same day of . Which made me question how she was able to afford a last minute vacation. She did send a gift.\n\t•\tFriend 3 didn’t respond at all and then two months after my wedding reached out saying she’d been “mentally going through things” and couldn’t be there, even though I’ve always been there for her. (She didn’t text me after I sent an invitation, and didn’t reach out to say anything before my wedding day) \n\n(I don’t talk to these people anymore except for friend 2 but it makes me sad I had no one)\n\nOn the wedding day, I hired the best photographer, hairstylist, and makeup artist. I looked amazing—which I rarely feel about myself—but I had to get ready at home because my siblings were using the same team and had children. I wanted to get ready at the venue, but everyone said it would be too much trouble, so I gave in.\n\nMy makeup artist was telling me I can hire someone to come with me to the hall but everyone was making me feel guilty as it was $1200 so I declined. \n\nI was sent alone in my puffy gown to the venue for my first look, with only the photographer. I had no wedding organizer (my mom said she’d “call the shots”), no friends by my side, and I had to wait until after my first look to pee. My husband had to unzip my dress and help me get out of my gown. My bouquet didn’t even look like I requested.\n\nI spent four hours taking pictures with my husband but barely any with my siblings. Because no one was there to delegate to the photographer. The ceremonies ran late, I was a nervous wreck, and I couldn’t enjoy it. I fell in front of everyone while dancing because my bustle broke, and for the rest of the night my massive train made dancing miserable. I wanted more photos after the ceremony, but felt rushed and could only get a few. Also the DJ didn’t play the correct part of the track when I walked down the aisle.\n\nAnd to make it worse, my wedding photos are awful. The photographer got the worst angles of me and made me look 10x worse than I actually did on my wedding day—I actually liked how I looked in real life.\n\nThousands of dollars later, the day felt like a disaster. I know it was a shotgun wedding and I can’t be picky, but the anxiety and guilt I feel about it is debilitating. The fact that none of my friends were there for me, even after all the effort I put into making it happen, hurts more than I can explain.\n\nI just feel so alone, and I can’t stop replaying everything. Every time I think about weddings I get so triggered. I can’t even look at a photo without feeling the anxiety I had on my wedding day. Am I being dramatic ?\n",
    "score": 560,
    "url": "https://reddit.com/r/weddingplanning/comments/1mzant9/my_wedding_day_was_the_worst_day_of_my_life/",
    "created_at": "2025-08-24T23:16:26.000Z",
    "num_comments": 231
  },
  {
    "id": "reddit-1mnhcwp",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "You don’t need a reason to not take your husbands name",
    "text": "I see so many posts where a woman very clearly wants to keep her maiden name and has reasons to justify why they should, but still feels uncertain. Almost as if they haven’t done enough to deserve the right to choose their own name. Usually it’s due to higher education or career accomplishments. You don’t need to be anybody or have done anything to deserve the right to keep your own name. If you want to keep your name as is, KEEP IT. You are already worthy! ",
    "score": 524,
    "url": "https://reddit.com/r/weddingplanning/comments/1mnhcwp/you_dont_need_a_reason_to_not_take_your_husbands/",
    "created_at": "2025-08-11T16:15:52.000Z",
    "num_comments": 139
  },
  {
    "id": "reddit-1la3ztd",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Budget Breakdown 💖 \"Cosmic Romance\" Wedding",
    "text": "”Cosmic Romance” Wedding \nFinal Budget Breakdown\n\nTotal Cost: $44,356 USD\n\nL/MCOL Area (US - Alabama), 75 guests (invited 146,  anticipated ~100)\n\n- Stationery     $852\n- Postage     $178\n- Bride’s Dress    $240\n- Alterations     $90\n- Shoes\t     $39\n- Groom’s Suit &amp; Shoes     $600\n- Rings     $3,000\n- Coordinator     $1,900\n- Photography (9hrs, 2 shooters)\t     $3,000\n- DJ     $1,000\n- Lighting     $1,500\n- Flowers     $5,676\n- Linens &amp; Draping (through florist)     $2,340\n- Setup (florals, draping, etc)     $2,075\n- Other Decor     $700\n- Bridal Party &amp; Family Gifts\t     $1,954\n- Officiant Gift     $180\n- Bridal Party HMUA (Bride +9 others)     $1,950\n- Venue, Rental Fee     $4,000\n- Venue, A/V Service     $325\n- Venue, Labor     $330\n- Venue, Other     $250\n- Venue, Food &amp; Beverage     $7,460\n- Venue, Bar     $3,183\n- Cakes     $534\n- Tips (other than venue gratuity)     $1,000\n\nDetails: Catering and bar included welcome champagne &amp; lemonade before the ceremony, appetizers at cocktail hour, full open bar for cocktail hour and reception (charged by consumption), and a plated dinner with chicken / beef / fish / vegetarian / kids entree options.\n\nI’ll start by saying that I never imagined spending so much on my wedding. But hubs and I are 36/37yrs respectively, established in our careers, and financially stable. We have a house already, cars paid off, and we were able to pay cash (took on no debt) for the wedding. This is not a common situation and we are grateful that we were in a position to do this. If we weren’t, then we would not have had this kind of wedding.\n\nThe only family contribution was unexpected - at the last minute his mother wanted to pay for the rehearsal dinner (~$1200, casual pizza place). We were planning on paying for it ourselves, and it was super kind of her.\n\nWe started our wedding planning blindly guessing that we could have the event we envisioned for around $20k (because surely that would be more than enough?) but as soon as we started getting actual quotes from vendors, we decided to make adjustments and ended up at about double that. We are both very analytical and love a good spreadsheet, so we kept a running budget down to the dollar. And any time we got quotes that were higher than we planned, we had a conversation about it to decide whether we would  1. Nix the item altogether, 2. Find a cheaper alternative, or 3. Adjust our budget. We did each of these things at different points. \n\nYou can also clearly see our priorities in the allocation of budget - for example, florals &amp; decor were super important to me and food &amp; beverage were important to him. So those are the two highest cost items.  Alternatively, we nixed the videographer and I went very inexpensive with my attire (a prom dress I found on Pinterest).\n\nBiggest bang for buck were our coordinator and our photographer. They were on the low end of quotes we received but were both phenomenal. Florals were also phenomenal, but were pretty expensive. \n\nOur venue was the US Space &amp; Rocket Center, which has only recently started doing very many weddings - they typically do more charity / awards style events. But they accommodate up to like 600 guests (its a huge space!) and handle all food &amp; beverage in house. It was a bit non-traditional but we loved it and it worked out really well for us!\n\nI plan on doing separate posts to talk about a few other specifics from our wedding, but wanted to just focus on the budget breakdown for this one.\n",
    "score": 388,
    "url": "https://reddit.com/r/weddingplanning/comments/1la3ztd/budget_breakdown_cosmic_romance_wedding/",
    "created_at": "2025-06-13T01:43:43.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1mnxaix",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "My successful super-DIY wedding on a tall ship!",
    "text": "Our wedding was pretty unique — we were on a 101-year-old wooden tall ship, the Zodiac, based in Bellingham, WA. As a result of the very unusual venue, we DIYed a lot (way more than I anticipated when we started planning!) and had to be quite flexible on a lot of details.\n\n**We had a full wedding weekend**: joint bachelor/ette party for 15, welcome dinner for 35, wedding day sail for 40, after party for 15, day after brunch for 40, and then a mountain photoshoot with just our closest friends and the photographer. It was a lot! And I’m an introvert, so I was quite worried going into it. But by planning each event to be something I knew I’d enjoy, it actually turned out perfect, and I found myself with the opposite of a drained social battery (which tbh never happens to me — I’m always the person who wants to go home early, lol).\n\nWe did not have a wedding party, but several friends ended up being a de facto wedding party because they were staying with us the week of the wedding. This was crucial. Having moral support and extra hands around made the whole week way better!\n\n**Events**\n\nBach Party: Tuesday night. Walked around Pike Place Market with our closest friends (basically the people who would’ve been in the wedding party if we had one). Ended at a rooftop bar in downtown Seattle. Perfect weather, perfect views, wonderful friends, mediocre drinks, but who cares.\n\nWelcome Dinner: Thursday night. Chrysalis Inn &amp; Spa Bellingham. Invited all of our families and a couple friends who were staying with us. Wonderful venue! The view and sunset was gorgeous, the food was delicious, the space they set aside for us was exactly right.\n\nWedding: Friday night. Schooner Zodiac. 6 hours of sailing with 1 hour buffer on either side. When the sun went down at 9pm, we switched to pirate music and sea shanties, passed around a bottle of rum, and broke out pirate costumes. I wasn’t sure the ship would allow this (but they flew a pirate flag for us!!) or that our guests would get into it, but everyone was so excited. It went over much better than expected.\n\nDay After Brunch: Saturday morning. Chrysalis Inn &amp; Spa Bellingham. Invited everyone. This was the part I was least sure about but I was so glad we included it! After the wedding, I realized I’d spent a lot of time with my partner and friends and not as much with relatives as I wished. Luckily, we had three more hours with everyone to make up for that!\n\nSecondary photoshoot: Sunday. Closest friends + the photographer near Artist Point, Mount Baker. So much fun! Basically a trash the dress photoshoot, to make up for the fact that my original dream wedding was eloping on a hike.\n\n**General reflections**\n\n* Being on a ship meant a lot of things could’ve really gone wrong, and we were pretty lucky they didn’t! We made sure to have a life jacket for the toddler, a robust first aid kit with an epi-pen for our guests with food allergies, lots of motion sickness meds just in case, a ton of blankets, tea and hot chocolate in case it was cold, and more. Luckily, the only thing we needed from the emergency kit was the Tide Pen, but it felt really important to be prepared.\n* Also being on a ship is a new experience for a lot of people, so we fielded a lot of questions about attire and what to expect. Maybe this would’ve happened anyway. It also meant that we had to do more shepherding of other vendors than might usually be required — the photographer had never shot a wedding on a ship before, for example, and the ship rarely hosts weddings, so in both cases we had to do a little extra leg work. And being on a sailing ship meant we had to be flexible with our schedule — what time is the ceremony? Whenever we reach the beautiful spot. Which sails will be raised? Whichever the weather calls for. Where will we sail? Wherever the wind takes us.\n* We did not have a rain plan. We couldn’t, really — we were on a ship! There was enough space for everyone below deck had the weather been wet or cold, but it would’ve been tight. We knew this risk going in and spent a lot of time researching the day of the year least likely to have inclement weather. And I spent $14 on an Etsy weather spell lmao which I'm not sure I believe in but it seemed to work!!\n* We were only 90 minutes from where we live, but our friends and family are scattered far and wide, so it was a destination wedding for most people. We had guests from New Zealand, Chile, and right off the Pacific Crest Trail! We spent a lot of time making sure accommodations and travel were affordable and reasonable for everyone, including covering lodging for six guests and driving four guests from the nearest major city. It was important to us that cost and logistics not be a barrier to anyone. Also, it was way more fun having some of our closest friends stay with us before and after the wedding! I would not have wanted it any other way. We have our whole lives for romantic private nights alone; our friends aren’t all in town all the time. So worth it to spend more time with them. \n* Everyone was quite skeptical of my blue and orange color scheme (which we communicated early and encouraged but did not require people to dress to match), but I had multiple people come up to me after and say they should never have doubted. The idea was to emphasize and match the sunset on the water, and boy did it deliver. There are some photos where my bouquet perfectly matches the orange of the stained wood on the ship and the blue of the sky and the water, or where guests who dressed per the color scheme look standout but coordinated with the brightly painted evening sky. Just perfect.\n* I knew something had to go wrong, and the things that did were pretty minor! Not going into detail here as I don't think there's much for other people to learn from them except maybe a lesson I don't love -- that relaxing control is asking for disaster, lol. My partner and I had good gut instincts about who we could trust to execute little tasks or run errands, and when we deviated from that instinct, things went wrong. Luckily, nothing too major! We also had an attitude that if it's gone wrong, it must not be that important (because we wouldn't let the major things go wrong), which I think really helped. \n* I managed not to look at the weather forecast up until a couple days before, since I know it’s not very accurate. But then I kind of panicked because, after a beautiful week of 80 degree sunny days, our wedding day was forecast to be 65 and cloudy! On the water, that can be quite cold. So I leaned hard on manifesting and an Etsy weather witch (lol) which I never thought I’d do. And oh my God, the weather turned out perfect!! Mysteriously, the weather app never caught on to reality — it said 60F when it was 75F outside, and said full cloud cover when it was sunny.\n* We never reached an “omg I just want this to be over” moment within our planning, which was kind of shocking to me because everyone I know who has gotten married recently recounted feeling that way in the leadup to their big day. I attribute this to a few things:\n   * 1) We weren’t stressed about the budget — we both have good salaries, our parents chipped in, and we planned a fairly budget-friendly day. It still felt intimidating to make those last-month deposits, but they weren’t uncomfortable for us to cover.\n   * 2) We planned very intentionally and made sure not to do anything we weren’t stoked to include. Even if some of the DIYs were time-consuming and stressful in the last couple days before the wedding, they were still fun, and we knew we really wanted them.\n   * 3) We reminded ourselves and each other frequently that almost everything was optional. If none of our DIYed cocktails worked out, there would still be beer and wine. If none of our flowers came together, we’d still be in a beautiful place and it would be fine. Etc.\n   * 4) We had a lot of support. My best friend flew in from New Zealand and stayed with us for a few days leading up to the wedding and was extra super helpful the whole time (plus so much fun to be around). Both sets of parents helped a lot and took a ton of things off our hands. It made it all so much more doable.\n   * 5) We split the work between us. My wedding planning tasks were weighted more heavily toward early on, researching, etc, and my partner did more work on the DIYs in the final days before the wedding, but it felt very balanced and shared overall.\n* OUR PHOTOS ARE AMAZING. I didn’t have strong feelings about a photographer, but my partner really really fell in love with our photographer’s portfolio, and I’m *so* glad he did. The sneak peak came back with 101 photos within 10 days, and every single one is a winner. The photographer we hired and the second he hired for the day were fantastic at catching great moments and coaching us into gorgeous poses. And they were up for anything! The editing also really makes the ship and the natural world shine. This was a perfect choice.\n\n  \n**DIYs**\n\nBecause we were on a ship, there were strict headcount limitations that meant we didn’t want to bring too many outside vendors, and many other logistical limitations that meant DIYing a lot made sense. Plus it was kind of fun!\n\n* **Paper**: We could have outsourced this one, but my partner is very good at graphic design and really enjoys it, so he designed all our signs, menus, etc. A few photos are included to give an idea. He did amazing.\n* **Flowers**: I don’t really care about flowers and didn’t have strong opinions, plus I knew we wouldn’t need many on the ship. My mom has a friend who is an amateur florist and my mom has done some flower arranging for nonprofit fundraisers, so she DIYed my bouquet + welcome dinner/day after brunch centerpieces, and also made a beautiful fake flower garland for behind the ceremony.\n* **Decor**: We didn’t do much decor because the ship doesn’t need it, but we did have a gorgeous card box painted my MIL, some lovely blue fabric hangings to obscure life rafts etc (borrowed from a friend who recently got married), and string lights for once the sun went down.\n* **Cocktails**: The big one! We are very into high-end cocktails, and my partner makes very fancy cocktails regularly. For our wedding, he designed four custom drinks with on-theme names and ingredients, then batched them in advance. We purchased clear square ice online and stamped it with a monogram. Then we invited some of my sister’s friends who also happen to volunteer on the ship to be bartenders.\n* **Cocktail-hour food**: We wanted a more complicated and unusual set of snacks during cocktail hour than the ship would normally serve, so we provided all ingredients. It worked out wonderfully! \n* **Pasta sauce**: My FIL makes amazing pasta sauce and we really wanted to serve it at our wedding. He and my partner made it a few days in advance and delivered it to the ship for serving. This was pretty ambitious but worked out great! I also decorated an artist's smock as a fancy bib for myself, because pasta sauce, red wine, and a wedding dress are a recipe for disaster.\n* **Rings**: My MIL makes jewelry and offered to make our wedding bands. Of course we said yes! They are beautifully carved to look like the North Cascades as seen from Bellingham Bay, where we got married. Super personal and unique.\n* **Music**: Obviously we could not have a live band or full DJ on the ship, so we spent a lot of time on playlists, got JBL pairing speakers, and controlled the music from an iPad. This one didn’t go quite smoothly — the speakers wouldn’t pair, so we only were able to use one. Luckily it was loud enough! We also had a bag piper playing during boarding/departure, which was a fun addition.\n* **Hairpins**: My partner made me some beautiful gem hair pins which I wore on the wedding day. They feature real gemstones we picked out this year at a gem show, which is one of our main hobbies. They included of kyanite, tanzanite, and feldspar.\n\nAll this DIYing made the wedding a lot more work than it would’ve been otherwise, but honestly I wouldn’t have it any other way. It was so personal and unique to us, and felt very hands-on. I never felt overwhelmed by our tasks because we had so much help, and each detail was so much more lovely for having been done by hand by people I love. Plus there were some great aspects of control that my Type-A soul loves! (No better way to make sure you like every song than devising every playlist and then not having Wifi during the wedding for anyone to download/stream anything else!)\n\n**Advice**\n\n* **Even though our photos are spectacular, I have some regrets about photos.** We really didn’t want the night to feel like a photoshoot, and it kind of ended up feeling that way at times. Part of that was our photographer being so stoked on the ship, part of that was us constantly going “Omg take a picture of this!!”, part of it was just losing track of time. I am really glad most everything is captured, but sometimes it felt like we were posing too much. Also, despite allllll those pictures, somehow we didn’t get one with my parents and sister and partner and I all together.\n* **Another source of regret was me drinking too much!** I’ve never before in my life drunk so much I don’t remember things, but I fully missed about an hour of the reception. We had some really delicious rum for pirate time, which I enjoyed more than I should’ve. Oops! As my best friend reminded me, though, in a year I wouldn’t remember it in that level of detail anyway, and I’ll have all the photos to fill in. It’s ok.\n* We wrote thank yous/love notes to all of our guests, which is an idea I got from this subreddit. I think everyone took theirs home, but I don’t know for sure, and I didn’t get the impression people were that interested in them. Some of them were very meaningful to write, but for some more distant relatives or friends, I didn’t have much to say. I think the better bet would’ve been to write the very sentimental ones and hand deliver them to the people we really wanted to thank. This would’ve saved a lot of time!\n* **Plan the wedding you want to live.** The moment you have guests, it’s not just about you and your partner, but that doesn’t mean you need to compromise too much. Forget about what people say a wedding needs to be and plan something meaningful and specific to you. Make sure you take care of your guests (enough food, enough bathrooms, enough information to plan their day) but don’t bend over backward so you’re suffering in the name of guest experience. Most guests will just be glad to celebrate you.\n* **On that note — know your guests.** There were a lot of things about this wedding that I worried about based on reddit’s discussions (Pescatarian menu, for example — will people be upset not to have meat? Our people didn’t care at all. Or holding the wedding on a Friday: everyone works remotely or non-Monday-Friday schedules, is retired, or was excited to plan a vacation to the region, so it ended up being no big deal). I also think the smaller the wedding, the more you can ask of people, because presumably you’re only inviting your closest friends and family. We knew every person there very well, and we were able to guess pretty well what they’d appreciate or struggle with. We didn't give plus-ones, but we did invite partners, and made sure every person knew multiple people besides us.\n* **A full wedding weekend was much more effort and money to plan and execute, but it was so so so worth it!** I can’t imagine if it had just been the one day. We only had 40 guests, and still I really felt like I needed the full weekend to get to see everyone. And I would’ve gladly had even more time with them if that weren’t totally outrageous!",
    "score": 361,
    "url": "https://reddit.com/r/weddingplanning/comments/1mnxaix/my_successful_superdiy_wedding_on_a_tall_ship/",
    "created_at": "2025-08-12T02:54:06.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1ofax9b",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Wedding in 2 weeks and I regret everything.",
    "text": "The last year has been absolute chaos. To start, my mom was diagnosed with cancer this time last year and right on the heels of that, I ended up gaining 30lbs due to a hormone issue that led to a PCOS diagnosis. My fiance then had to list and sell his house, we decided to build one at the same time. I graduated law school in May, took the bar in July and started a brand new career/job in September. I just turned 25 last week and feel like I'm at my wits end. \n\nI was thankfully able to lose all but about 8lbs from the gain. I've been planning this thing for 2 years and I dread coming home because it means I have to do wedding stuff. I just got my dress back from alterations and it isn't right/doesn't fit. I hate how I look in it. My arms are not where I imagined them being nor am I physically. Overall, I am just so unhappy with myself I think and its reflecting onto the main reason we are even having the wedding, to be MARRIED to the literal love of my life and my best friend. \n\nI keep looking back at things I should've done differently the last 6 months but it took all of me to get out of bed during bar prep. That whole process really just took a mental toll and its like I just couldn't snap out of it. I know at this point, I am just SOL but truthfully, I just needed to vent. \n\nNow onto the real problem, I suppose, I need to find a reception dress and still find one for rehearsal. Wish me luck! ",
    "score": 132,
    "url": "https://reddit.com/r/weddingplanning/comments/1ofax9b/wedding_in_2_weeks_and_i_regret_everything/",
    "created_at": "2025-10-24T22:08:52.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1kjip9s",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Finding it hard not to be upset about my mom’s lack of financial contribution. Am I overreacting?",
    "text": "Long story but I appreciate any input and am totally willing to accept if I am being unreasonable. \n\nI (26F) got engaged in November 2024 and am getting married in October 2025. After I got engaged, as I started planning, my mom said that she wanted to pay for my wedding dress. I didn’t want to have to set a certain budget for my dress, so I told her she could just help however she could and I would cover the rest. \n\nFor background, my mom had me when she was 19. I have 3 younger siblings who are all considerably younger than me (20M, 14F, 12F). We struggled HARD financially my whole life growing up. Section 8 housing, food pantry, angel tree at Christmastime, the works. We were extremely poor and I worked a job since age 15 to help pay bills. My senior year of high school, my mom went to trade school for welding and now has been a welder for 8 years. She makes WAY more money now than she did my whole life growing up and now she and my stepdad together probably make ~$110k per year (and live in a VERY low cost of living area of the rural Deep South). \n\nFast forward to wedding dress shopping, I pick a dress that is $1,400. My mom was there while I was shopping and loved the dress. The shop required half of the amount (so $700) to place the order. I paid the $700, and my mom didn’t pay anything at that time. \n\nMy mom is very irresponsible with money and is horrible at saving. Since my childhood was so rough due to poverty, I think she tries to make up for it by spoiling my two younger sisters (ages 12 and 14) with whatever they want. My mom has sent me $500 on Cash App since I bought the dress ($200 in January and $300 in April), saying “it’s not much but it’s what I can do.” I TOTALLY appreciate any contribution she makes, but in that same time span, she took off work to take my sisters to Panama City Beach for spring break, traded in her car (2022 Honda) for a brand new SUV, and bought my sisters a golf cart to drive around in the yard for fun, among several other things.\n\nIt’s very hard for me not to be bitter about her lack of contribution. It’s not because I can’t afford it myself (I am fortunate to make ~$75k salary), but because I feel like she is still prioritizing my sisters getting every single new thing they want over her contribution to the wedding. I feel ridiculous and insane being jealous of a 12 and 14 year old and *I know logically it makes sense that she’s spending way more money on them since they’re actual children*, but I guess it just stings a little. Especially since my mom originally said she wanted to pay for my dress. I don’t know. Am I being dramatic?\n\nFor what it’s worth, I don’t plan on discussing this with my mom at all in either direction. I’ve just been battling these internal feelings lately and think I could use a reality check lmao\n",
    "score": 112,
    "url": "https://reddit.com/r/weddingplanning/comments/1kjip9s/finding_it_hard_not_to_be_upset_about_my_moms/",
    "created_at": "2025-05-10T19:50:17.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1il1n5d",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "My Groom doesn't want a Gift and well... I've already hired a Painter...",
    "text": "Has anyone else ever had a major surprise gift for their wedding? Or is planning one?\n\nWe've been taking dance lessons for two years, and he proposed at one of our lessons. It is our absolute favorite way to spend time together.\n\nWedding gift discussions came up, and he didn't know this was a thing, so he began stressing over costs and said he didn't want something - I responded saying I appreciate that but I've had his gift picked out since May 2024. He jokingly said he didn't like where the conversation had gone, but accepted it.\n\nToday he brought this up again and wanted us to each get on the same page because the advide from friends was either \"undervalued\" or incredibly-labor and time intensive, and he doesn't have the mental bandwidth for the latter with his career challenges and mental health. He pressed to know how much I was spending on the gift.\n\nI told him it was going to be an experience, a gift for both of us to appreciate long term. The artist I found was incredibly reasonable (between $800-900, nearly 2-4x cheaper than others I researched). I told him about $800 and he wasn't prepared for that but understood. I told him if he wanted to put his faith in me, then he could contribute to the gift for both of us, and I think he's weighing that option right now.\n\nI want to surprise him with an artist painting our first dance, we're both going to cry and be so happy. I don't want him to stress about the cost of a gift though!\n\n**Update: I showed him the artist's website and he thought it was super cool and didn't know it was a thing. We're both less stressed and happier to know about this surprise for our household and guests now.**",
    "score": 77,
    "url": "https://reddit.com/r/weddingplanning/comments/1il1n5d/my_groom_doesnt_want_a_gift_and_well_ive_already/",
    "created_at": "2025-02-09T00:06:07.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1jlbsuz",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "It happened.",
    "text": "You always here about nightmare soon-to-be MIL moments when planning a wedding, but I never thought it would happen to me. For context, I've (23F) been together with my fiancé (22F) since our freshman year of high-school (we are 2 months apart). I love my MIL (~45F), and although she is sometimes a bit demanding or controlling (and she accuses me of being a bit dramatic, which considering that I grew up as a theatre kid, is fair), we overall have a stable, if not a touch emotionally distant, relationship. Well,  my fiancé and I are 3 months out from the wedding now, and I went over to her house (she moved to the same city we moved to about a year and a half after we did because she missed my fiancé so much) last night, and asked for her help getting addresses on their side of the family for invites. I had given her the invite for their family about 2 weeks ago, since her son, my fiancé's youngest brother, is the best man. She informed me, however, that she had invited them already, AND sent out about 13 more invitations to other families using a scanned copy of our invitation. She still wants us to send the physical invitations which, bear in mind, she had insisted we purchase (otherwise we would have just sent everyone pdfs like we did for the save-the-dates). We don't even have enough physical invitations for these people, much less meals, cake, chairs, tables, ROOM, etc. I have three months until I am marrying this wonderful man!! I don't have time or energy for this!! She's inviting everyone from elementary teachers of my fiancé to their local IT guy they used for the last 10 years they lived in the town we grew up in. I have family friends and second cousins I'm not inviting, because things are too expensive and we are very young in our careers. My fiancé and I have been messaging people all day, explaining that we don't have any room for plus ones for them. I'm not even sure what to do here. I know my MIL had nothing but the best intentions, but.... come ON. sigh. I'm usually the type that says \"if you don't laugh, you'll cry\" (I mean heck, 3 weeks ago the place I got my wedding gown from gave me a gown in the wrong color and I didn't say a word until they realized it was the wrong one and gave me the correct one, and even then I laughed it off and said it was fine). But I can't even laugh. I have a massive pit in my stomach. I really, REALLY wanted this wedding to be debt-free, and I got SO CLOSE to achieving that. Now, my fiancé has to take out another credit card, and we aren't sure how we will do a wedding AND honeymoon AND make rent. Any help would be so, so appreciated. Thanks for reading my life problems.",
    "score": 75,
    "url": "https://reddit.com/r/weddingplanning/comments/1jlbsuz/it_happened/",
    "created_at": "2025-03-27T19:16:14.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1nc7zfn",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Household income, family contributions, and wedding costs: a lite analysis",
    "text": "# Background &amp; disclaimers\n\nI recently saw a [post about percentage of income spent on weddings](https://www.reddit.com/r/weddingplanning/comments/1n3jhqg/what_percentage_of_your_income_did_you_spend_on/), and while fun, I agree with u/whereistheicecream that percentages are hard to interpret in isolation. So imagine my reaction when I found [the older post](https://www.reddit.com/r/weddingplanning/comments/1jzetj5/whats_your_wedding_budget_vs_your_income/) where Wedditors provided both $ amounts and additional insights into contributions from family, etc.\n\nI spent an afternoon translating those into some insights that I’m sharing here for fun and non-profit. Three big disclaimers:\n\n1. **This is not rigorous nor do I claim it to be.** I am not a data scientist! For example, I report on arithmetic means &amp; medians; I think geometric means would’ve been more useful, but I am lazy.^(1)\n2. **This is not a representative sample.** In other words, I have a very small slice of r/weddingplanning. I’m missing r/WeddingsUnder10K, r/BigBudgetBrides, etc., and Reddit in general [skews more urban, liberal, and high income compared to the general US population](https://www.marketingcharts.com/digital/social-media-231591#:~:text=Demographics%20&amp;%20Audiences%20%7C%20Digital%20%7C%20Household,29%25%20of%20the%20general%20population).\n3. **This is neither advice nor judgment.** No wedding, couple, family, or financial situation are alike, and this is *not* meant to be a judgement on anyone’s wedding. This is simply knowledge for knowledge’s sake.\n\n# This post is too long &amp; I will not read\n\n* In my little Reddit dataset, the median wedding cost $35K, about 18.5% of household income.\n* Self-funded weddings spent a median of $35K on their wedding, about 14.6% of their household income\n* About half of couples in my data set received support from family for their wedding. Couples with supported weddings spent a median of $42K on their wedding, about 22.7% of their income.\n* Parental contributions covered around half a wedding’s cost. The median (reported) contribution amount was $20K. Couples with supported weddings had an ‘out of pocket’ cost of about $22K, or 11.7% of their household income\n\n# Data cleaning\n\nAny good intro to statistics class will emphasize, over and over again, that your analysis is only as good as your data; in other words, shit in, shit out.\n\nI used a total of 214 weddings for this analysis. I excluded:\n\n* weddings from non-US countries, as income, taxes, and social benefits are meaningfully different\n* weddings that happened prior to 2024\n* weddings with incomplete information - at a minimum, I needed a wedding cost and household income (HHI)\n\nIf possible, I tried to take out pre- and post-wedding costs like showers and honeymoons. Sometimes this was not possible. When ranges were provided, I always took the midpoint, unless the poster specified that an income or budget was ‘closer to’ one end of the range, at which point I input that value.\n\n# Summary stats\n\nAcross all 214 weddings, the median wedding cost $35K and was about 18.5% of income. Funny enough, the median wedding cost of $35K isn’t that far off the $33K [The Knot has reported](https://www.theknot.com/content/average-wedding-cost).\n\n|Measure|Household Income|Wedding cost|\n|:-|:-|:-|\n|Min|$20K|$3K|\n|Max|$1M|$150K|\n|Median|$189K|$35K|\n|Average|$219K|$40.5K|\n|Geometric mean|$161K|$25.5K|\n\n[a: household income distributions](https://preview.redd.it/smgmvscf02of1.png?width=600&amp;format=png&amp;auto=webp&amp;s=7ad7c8b894ea22cdf7bef60d0624004408123edf)\n\n[b: wedding cost distribution](https://preview.redd.it/z2zduyii02of1.png?width=600&amp;format=png&amp;auto=webp&amp;s=8202371a56573b59014a5646930450084004331e)\n\n# Self-funded weddings vs Supported weddings\n\nA wedding was tagged as ‘self-funded’ if the poster explicitly said they did not receive or did not expect any financial support to pay for their wedding. 12% (25 weddings) received this tag. 50% of Wedditors reported receiving financial support from family (usually parents) to help pay for the wedding; these are tagged as ‘supported weddings.’ The remainder did not specify, and were categorized as unknown; they are represented in the summary stats above but aren’t included in the tables below.\n\nWedditors who self-funded spent around 14-16% of their HHI on their wedding, and a self-funded wedding was typically less expensive compared to a supported wedding:\n\n|wedding type|median cost|median HHI|as % of income|\n|:-|:-|:-|:-|\n|self-funded|$35K|$240K|14.6%|\n|supported|$42K|$185K|22.7%|\n\nHowever, this is only true overall! I tagged a total of 28 (13%) as HCOL or VHCOL weddings, based on whether the poster noted the wedding took place in one of the top [10 most expensive American cities on this list](https://www.visualcapitalist.com/u-s-cities-with-the-highest-cost-of-living/).^(2) In HCOL areas, Wedditors who self-funded and Wedditors who received support spent basically the same amount on their wedding, though please note we have some pretty small samples.\n\n|COL|funding|median cost|median HHI|as % of income|\n|:-|:-|:-|:-|:-|\n|HCOL|self-funded|$59K|$378K|15.6%|\n|HCOL|supported|$59K|$275K|21.5%|\n|not HCOL|self-funded|$35K|$230K|15.2%|\n|not HCOL|supported|$42K|$180K|23.3%|\n\nThe very, very small sample of HCOL &amp; self-funded weddings also were the highest income cohort at $378K; other HCOL Wedditors also tended to be high earners. Even in NYC, a median household income of $275K [puts the couple well into the top twenty percent](https://popfactfinder.planning.nyc.gov/explorer/selection/982500d4c9e972f91cb1597caf8403efda5cdc86?acsTopics=%2Cecon-incomeAndBenefits&amp;source=acs-current) of New Yorkers.\n\nFor self-funded weddings, HHI is very strongly correlated with wedding costs; 69% of the variance in wedding costs can be explained by HHI alone, which is damn good for a single feature model.^(3)\n\n[c: look at that R\\^2! ](https://preview.redd.it/xp6cer9n02of1.png?width=600&amp;format=png&amp;auto=webp&amp;s=25a411407f661298731f58d470712cc8f340f4df)\n\nThis correlation is notably weaker when looking at supported weddings - a little under 19% of the variance in the cost of supported weddings can be explained by household income alone.\n\n[d: Real Data Scientists will tell me I'm reading too much into a low\\(er\\) R\\^2. I am not a real data scientist.   ](https://preview.redd.it/7n5fx18q02of1.png?width=600&amp;format=png&amp;auto=webp&amp;s=e27977958327354a50f9c6c0f4134287a7ea6b27)\n\n# How much support did Wedditors receive?\n\nSo clearly, contributions matter! While half of Wedditors mentioned parental or family contributions to their wedding, not all provided exact estimates. 93 (43%) of Wedditors are represented here.\n\n|Measure|Contribution amount|\n|:-|:-|\n|Min|$0.5K|\n|Max|$95K|\n|Median|$20K|\n|Average|$26K|\n|Geometric mean|$15K|\n\n[e: distribution of contribution amount from family](https://preview.redd.it/q35jkld712of1.png?width=600&amp;format=png&amp;auto=webp&amp;s=5cc87acef625db00efd7c1cea90051eeae46f553)\n\nA median contribution of about $20K means that a little under half of a wedding’s cost was funded by family. Contribution amounts went up to $25K for weddings in HCOL areas, representing about 43% of the wedding cost. After contributions, a couple’s ‘out of pocket’ median wedding cost (the amount the couple themselves paid) was about 11.7% of their household income.\n\nThe level of support from family explains about 52% of the variance in supported wedding costs, which is way better than the 19% of variance explained by household income.\n\n[f: again, I am not a real data scientist and I love an R\\^2](https://preview.redd.it/w3wenxgj12of1.png?width=600&amp;format=png&amp;auto=webp&amp;s=7440d6112402aa2dfbb3e8c6e7e177560427f38f)\n\nI used a simple linear regression of two features - contribution amount and household income - to try and predict a supported wedding’s costs, but the R^(2) only increased to 55%, meaning a little over half the variance in a supported wedding's cost can be explained by these two factors. There are, I think, two reasons for this:\n\n1. Couples may be using family contributions for other financial goals. 16 couples (7.4%) specifically mentioned they had other financial goals - a house, an extended honeymoon, etc - besides their wedding and spent a median of $24K or about 12% of household income. 11 couples received financial support *and* noted another financial goal besides the wedding; their weddings cost a median of $30K, or about $12K less.^(4)\n2. I think the *relative* unimportance of household income for supported weddings is because a couple’s willingness to spend is also determined by future expected income. If a couple expects job changes (e.g. starting a Big Law career) or inheritance to materially shape their future finances, their willingness to spend today may increase.^(5)\n\n# Footnotes\n\n^(1) If you think my college statistics coursework prepared me for this post you would be wrong! From what I vaguely remember, geometric means are less affected by outliers as they assume the underlying data scales geometrically. This is helpful when calculating averages on rates or when there are big ranges in the data\n\n^(2) This meant that Chicago did not count as HCOL. I know this might be contentious, but I, a New Yorker by choice, seriously considered buying up a year’s worth of shoes and skincare when I visited Chicago. One must draw a line somewhere.\n\n^(3) Yes, a linear regression. Yes, it’s Google Sheets. Please see disclaimer #1.\n\n^(4) I would not be surprised if most couples reallocated some portion of a family’s contribution towards the wedding towards another financial goal.\n\n^(5) I’d bet couples who self-funded their weddings are older and more established in their careers, and less influenced by future expected income as a result. It’s also possible that a couple’s higher future income influences a family’s decision to contribute funds toward the wedding. That’s all just more speculation, but that’s the actual joy of statistics: using numbers to paint whatever picture you want.",
    "score": 67,
    "url": "https://reddit.com/r/weddingplanning/comments/1nc7zfn/household_income_family_contributions_and_wedding/",
    "created_at": "2025-09-09T03:06:06.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1mnaokp",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "How do you politely let people know you’re not changing your name",
    "text": "I am really waffling on the name change issue right now. I am a very independent person and have 2 degrees in my maiden name. I also have worked a career for a number of years where I am known in my circles by my maiden name. I just feel like changing my name will snatch away my identity and everything I’ve done up until this point.\n\nOn the other hand, I do like the idea of becoming one family unit and I do think it would make it less complicated socially, especially when we have kids.\n\nIf I do decide to go with the former and not change my last name, how do I politely let wedding guests know without sounding obnoxious. We already have gotten a few cards that say “the future Mr. And Mrs. [his last name]”. Which I haven’t said anything about. I just know that a lot of my friends received lots of personalized things with their future husband’s last name. I also would love to know how people have handled the “introducing Mr. And Mrs. X” post ceremony or during the reception, as just about every wedding I’ve been to has done that.\n\nAlso if anyone has any hybrid solutions, I would be open to that. I’m not vehemently opposed to changing my name, just concerned as to what it will do to me professionally.\n",
    "score": 48,
    "url": "https://reddit.com/r/weddingplanning/comments/1mnaokp/how_do_you_politely_let_people_know_youre_not/",
    "created_at": "2025-08-11T11:43:01.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1os3161",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "I’m so glad I waited to plan my wedding",
    "text": "Engaged November 2024. Wedding planning felt overwhelming in terms of budget and in terms of having a small circle and having little faith anyone would even want to come to my wedding (that would inevitably be a destination one to accommodate USA passports for my friends and family as well as Russian passports for my fiancés friends and family). \n\nFelt isolating and lonely and sad. Also uncertainty of the world as it relates to our families made us more sad and unsure of how to proceed. Decided to wait 10 months. \n\nIn the 10 months of waiting my fiancé’s career took off and he got a wedding-sized bonus. I also had time to get out of my head and appreciate the quality friendships and get over myself and the fact that I don’t have 1,000 friends and that’s okay (and I got really into the idea of an intimate wedding anyway). \n\nYes waiting 10 months sucked but everything happens for a reason and everything happens right as it’s supposed to. We have only been planning for a month but we picked a beautiful country that my fiance and his family is connected to, and we matched with a great planner who basically booked everything we need except for like the cake. Also my close friends and mom are so excited to visit me and go to my dress appointments, so I feel so supported and loved and the opposite of the isolated feeling I had 10 months ago. \n\nIdk, im just posting this in case anyone is wondering if waiting is a good option or if it’ll feel like you’re putting your life on hold if you don’t plan right when you get engaged. The 10 months honestly went by fast. I was like oh shit is it time to plan already? Also I’m 30 so if you’re in your late 20s and feel pressure it’ll be okay!!  ",
    "score": 34,
    "url": "https://reddit.com/r/weddingplanning/comments/1os3161/im_so_glad_i_waited_to_plan_my_wedding/",
    "created_at": "2025-11-08T22:53:22.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1octyp6",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Budget humble wedding planning",
    "text": "Sometimes i genuinely have found sadness trying to relate and talk to other brides planning their weddings, myself and my partner have been together for eleven years since we were 15, and both of us come from families with single mothers who don’t have the means to help in a traditional way like many others. We are planning our wedding truly out of pocket while both working full time at not minimum wage paying jobs, but not salary/super well paying jobs. We are not willing to take away from the money we put aside monthly to save up for a house/pay off student debt, but we have loved each other so dearly for over a decade and want to get married and have a wedding. We both have never attended a family wedding or any wedding before and were unaware on the incredible costs that go into having a wedding, so we have decided to try to keep total costs under $5000. Im wondering if anyone can give me tips on things you have done for your wedding with a similar budget that has helped keep the cost down, we found a beautiful wedding venue that is a cute nature conservation area with a large hunting lodge that has such beautiful potential for $500 and our photographer is a family member in university for photography who is doing our photos for $400! Food is our biggest concern right now lol! BUT anyways i also wanted to get off my chest since i saw a TikTok video saying if you cannot afford having a wedding you should not get married, girlll. Who cares if your budget is $5000 or $50,000 why are you judging a couple who just wants to celebrate their love?😭 \nLove, a budget 2026 bride🤞🏻🤭",
    "score": 31,
    "url": "https://reddit.com/r/weddingplanning/comments/1octyp6/budget_humble_wedding_planning/",
    "created_at": "2025-10-22T00:33:52.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1k2wtwn",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "What other stuff are you trying to do while also planning a wedding?",
    "text": "I know it can feel like wedding planning is taking over our lives, but I want to hear about the other parts of your life you're working on at the same time!\n\nWhen I agreed to have a big wedding, I told myself I didn't want this year to just become all about the wedding (lol, lmao). As naive as that was, I DO still want to make sure our big wedding celebration doesn't mean the rest of my life is on hold. I started building some career momentum last year and didn't want to let that stall, and as I get older, I'm particularly interested in maintaining my personal relationships and interests. \n\nSo while I'm planning a wedding, I'm also: \n\n* Trying to pitch 40 big ideas at work\n* Making 20 new career connections\n* Finishing writing and trying to sell a new writing project\n* Collaborating on 3 other writing projects, hoping for finished drafts by the end of the year\n* Completing a new season of my podcast and growing our listenership by 25%\n* Slowly preparing myself and my fiancé for a big hiking trip in 2026\n* Attending 5 climate events\n* Getting dinner with another couple every month\n* Helping figure out assisted living for my FMIL\n* Downsizing all our stuff and organizing our apartment -- which IS connected to wedding planning in that we have literally zero room for any registry gifts coming in\n* I WAS trying to max out my retirement contribution for this year but between the wedding and the general economic situation, that is absolutely not happening lol. I'm still saving money but \"max out\" was.... ambitious!\n\nThe nice (?) thing is -- when I want to procrastinate working on any of that stuff, wedding planning ends up being the perfect distraction!\n\nWho knows if I'll be able to complete any or all of this, but I'm embracing a \"shoot for the moon and you'll land among the stars\" attitude. If I can walk out of the year with this stuff even partially done, I think that will help stave off some of the wedding blues, knowing I still have so many things to work on and look forward to.\n\nSo what else are you trying to do this year while ALSO planning one of the biggest events of your life? ",
    "score": 27,
    "url": "https://reddit.com/r/weddingplanning/comments/1k2wtwn/what_other_stuff_are_you_trying_to_do_while_also/",
    "created_at": "2025-04-19T13:56:27.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1pjg5em",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Fiancé agreed to pay for half of wedding, now it's looking like he can't afford to.",
    "text": "I want to start by saying I absolutely love and adore my FH! He is the best partner I've ever had, incredibly in tune with my needs, and I can't wait to marry him.\n\nWe've been planning a destination wedding for over a year now in my mom's hometown in Thailand. It makes sense to get married there because, even though FH and I are based out of the States, a lot of my family lives in Thailand, including my mom, stepdad, and brother. It also helps that our money stretches so much further there. Our wedding is in two months.\n\nWe are both in transition phases of our lives right now: him switching careers recently, and me planning to go back to school and only working part-time in the meantime. I received a fairly large inheritance from my father, who passed away a couple years ago, as well as inheriting a house from him, so when that happened, the gap between my and his \"net worth\" (if you want to call it that) changed drastically.\n\nWhen we first began planning, we set the budget for $10,000, which I thought was EXTREMELY reasonable. 5,000 each. That would get us next to nothing if we had the wedding in the VHCOL area we live in. We have some help from our families, with my mom paying for accommodations for guests, transportation, and wedding favors, my uncle paying for catering, and his dad paying for the welcome party. I did increase the budget by $2,000, which he OK'd, because I wanted a few extra things. Still extremely reasonable, right?\n\nAnyway, I was crunching the numbers for how much we'd realistically spend, including everything like honeymoon, cost of our cross-country move (planning to move closer to his family after we get married), and cost of moving into a new rental, etc, and presented this number to him. It basically would wipe him clean. I knew he didn't have a lot saved, but I didn't realize he'd basically be going broke from the wedding/ post-wedding expenses. And now we are two months out, and deposits have been made, vendors have been booked, extras have been added on...I can't help but feel bitter and resentful. Obviously, not a good feeling going into a marriage.\n\nThe only real solution is to cover most of his portion, which I could easily do, but wasn't planning on needing to do, and have him pay me back in the year or two following the wedding. If he had been realistic with where he's at financially from the start, I could have mentally/ physically prepared to cover more, or been more frugal, or planned something different. But now we're here. He is good with money, but also tends to be a people-pleaser, so I think that's how we got to where we are. The other aspect of this that is frustrating is that he isn't really offering me any solutions—he mostly just feels bad that he \"can't hold up his end.\" So now I'm left to not only pay for most of his portion, but also figure out if I need him to pay me back and how. Last time we talked, we put a pin in the conversation, and I'm planning on addressing this all with him, but right now, I needed to vent.\n\nHas anyone else been in this situation? How did you handle it?\n\nUPDATE: Thanks for the comments everyone. Some of you have been kind, understanding, and offered interesting perspectives, some of you have been cruel. I guess that’s what you can expect from strangers on the internet. Despite what many of you suggested, we are still getting married and I am still going to make him pay me back. We decided that everything post wedding I’ll front (honeymoon, moving costs, new apt, so about 5k), and he’s going to pay back a little at a time into our joint account in the months following the wedding. We’ll both be adding a percentage of our incomes to this joint account every month.\n\nThinking through the whole situation I do feel a lot of guilt, like one commenter suggested, about the whole thing. I didn’t think he would be using ALL of his money in our wedding, and that makes me think I/he/we should have thought and planned more clearly about our priorities. Things kinda ravel out of control when planning a wedding, I’m sure you all can relate. And because of the privileged financial situation I’m in, I didn’t consider 6K (or ultimately 10K) to be unattainable for him. He wanted to make me happy, so he kept agreeing to more and more until we got to the situation we’re in now. I believe when there’s conflict in partnership, although it might suck, it’s good for information and data collection. We have this information, we know this about each other, let’s look out for it in the future or figure out ways to ensure it won’t happen again.",
    "score": 26,
    "url": "https://reddit.com/r/weddingplanning/comments/1pjg5em/fiancé_agreed_to_pay_for_half_of_wedding_now_its/",
    "created_at": "2025-12-10T22:09:12.000Z",
    "num_comments": 145
  },
  {
    "id": "reddit-1lo839e",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Am I overreacting or is our wedding planner not doing her job?",
    "text": "My fiancé and I are planning a wedding in a country in Western Europe with a budget of around €15,000 (excluding photographer, DJ, clothing, and hotel). We hired a full wedding planner to help us find a venue and coordinate everything. Specially because I’m in the middle of important exams/tests for my career.\n\nFrom the beginning, communication has been difficult. We’ve been asking her for over a month to help us find a venue that:\n\t•\tAllows external catering (we have a chosen caterer),\n\t•\tHas on-site or nearby accommodations, and\n\t•\tFits our budget and style (rustic, romantic with some nature, ~75 guests).\n\nShe kept saying there are no venues like that in the country. But we ourselves found and sent her several venues that met our criteria and were within budget, including some in Wallonia. She either ignored them or dismissed them for vague reasons like:\n\t•\t“I had a bad experience there once,”\n\t•\t“They didn’t answer me right away,” or\n\t•\t“that part of the country is more expensive” (even when the venue was under budget).\n\nFinally, she arranged one single appointment after a month of us pushing—and when we got there, we found out that the accommodations weren’t even available for any of our date ranges anymore. She didn’t check availability before sending us there. When we brought it up, she just said again that “there’s nothing within your budget with accommodations nearby and external catering.”\n\nWe’ve tried to be flexible—we’re open to any region in the country and have realistic expectations. But we feel like she talks down to us, acts like she’s doing us a favor, and expects us to settle just because we don’t have a massive budget.\n\nI’ve been crying since we got home. I feel heartbroken and like calling off the wedding because the one person who’s supposed to support us is making it worse. My fiancé is being so amazing and supportive, but I don’t even know if I want to keep working with her anymore.\n\nAre we overreacting? Is this normal for wedding planners, or is she not doing her job?\n",
    "score": 24,
    "url": "https://reddit.com/r/weddingplanning/comments/1lo839e/am_i_overreacting_or_is_our_wedding_planner_not/",
    "created_at": "2025-06-30T13:52:41.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1mpo8wd",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "My mom does not want to come to my wedding",
    "text": "Hi to all brides who have been or currently are in the same boat as me... I guess the title explains my situation and I write this post with a rather heavy heart and looking for some support as I have no one else to speak to about this. This is long so grab some popcorn I guess…\n\nFor some background: My mother has always been pretty narcissistic and is known to be the crazy one in our family. I do not feel like I had the most loving childhood and my mom has traumatized me a lot while growing up when I look back at it. She moved across the country from me since the beginning of my senior year of college. She has flaked from showing up to other previous important events in my life such as my college graduation. She has never once taken a flight to visit me, since she moved I have accomplished so much career-wise and have had beautiful apartments but she never came to see me. In fact, I always flew to see her and my family across the country. I had an engagement party in 2024 which she did fly in and show up for with my dad, but she caused so much drama I was so anxious the whole time. She is just never truly happy for me...\n\nNow fast forward we have been wedding planning for our November 2025 wedding for almost a year now. Everything was going tolerably okay with my mom until May 2025 when she randomly threw in my face that shes not coming to my wedding. For context, I was on vacation alone in another country and went to go visit my grandma (father’s mom) who is very old and because she lives in that country I was visiting. My mom absolutely hates her mother in law and they have a terrible relationship since even before I was born. My mom did not want me to go see my grandma at any cost but I did anyways because she is getting super old and is 80+ years old and I have not seen her in 10 years. I even explained this to my mom to reason with her and make her understand. When I came back from visiting my grandma that day my mom called me and said since I disobeyed her and went to go see the one person she hates the most on this planet, she is NOT coming to my wedding. And that is when I had it. I told her, “are you sure? Do you mean it? Because you cant take this back.” Because quite frankly I didn’t see the relationship between the argument we were having and what it had to do with her attending my wedding at all. It felt like it came out of left field. She told me “yes I mean it im NOT coming. If you as my daughter don’t feel my pain about why I don’t like your grandma then Im not coming to your wedding.” Mind you, at this point my wedding is only 6 months away. I was shocked that she would just say that about my wedding just like that out of thin air but I couldn’t just let it slide. She has said in the past things like “okay I just won’t come then” to be petty for other things in the last few years but something about this time felt so hurtful because Ive been putting my blood, sweat, and tears to plan this multi-event 4 day wedding all alone, and for her to just say that is crazy.\n\nIt’s currently August, so it’s been 3 months since my mom has spoken to me. I have handled all the wedding details such as invites, vendors, etc. all by myself. My wedding is in 3 months or so and I still have no idea if she is coming which is so crazy. My dad has tried his best to make her understand that what she said to me was really incorrect but he is very unhappy in his marriage with her and they are constantly troubled and fighting so there’s only so much he can do. She told my dad that she will only come to the wedding if I call her and apologize for going to my grandmas house that day, even though she acknowledges that she said shes not coming to my wedding because she snapped and got so mad. Yes in another world, I could just say screw it and call her but I feel so so disrespected. I don’t have many expectations from my mother since I was a teenager but she definitely crossed the line by saying what she said. It’s supposed to be one of the best days of my life and I don’t think any bride should ever have to hear those threatening words from their moms. At the end of the day, even as children of our parents, if we mess up or do something actually wrong, parents should be our support systems and pillars and the forgiving ones. She has stood her ground and as of today, she is still saying shes not coming. My dad has reported to me that she doesn’t want to come and if she does she will decide only a few days before the wedding if she wants to fly in. \n\nEveryday Im low-key grieving this and my fiancé has been really supportive but it’s been pretty hard. Im reflecting on my life and how I feel like I truly deserve a better mother-figure in my life. I feel a lump in my throat when I think of how awfully my toxic mom is treating me and just her audacity. Im trying to not let it effect me however I am constantly thinking about what all the guests (200+ guests) will think when they see that the MOB is missing and the photographers see the MOB missing. Im having nightmares thinking how embarrassed my fiancé and his side of the family will be. They didn’t sign up for this and they come from an Indian traditional family who values their self-image especially at their own son’s wedding. There’s just so much on the table at stake here and im just so overwhelmed. Im sure I’ve left out a lifetime worth of painful details but any support will be so appreciated or if anyone can relate. \n\nThank you so much! ",
    "score": 24,
    "url": "https://reddit.com/r/weddingplanning/comments/1mpo8wd/my_mom_does_not_want_to_come_to_my_wedding/",
    "created_at": "2025-08-14T02:27:58.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1in01z4",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Did anyone other brides here plan their wedding without the logistical or emotional support of their mother? How did you get through it?",
    "text": "This keeps coming up for me throughout the process. My mother really hasn’t been there for me since I was in elementary school, for complicated reasons I don’t want to get into on this post, past saying she could have chosen things very differently to ensure she could be there for me and she didn’t - her supposed love for her daughter wasn’t enough, and on a number of levels she effectively abandonded me. \n\nMy dad isn’t in the picture either, but this has been not as relevant nor affected me as much emotionally as my mother not being there. I do have another relative who is like a mother figure to me, but for logistical reasons is not as available as she ideally would be. My future MIL is a sweetheart also, but I’m still not as emotionally close with her, and she also is a very busy woman with a full-time career. Also because I feel like someone may ask in the comments - I don’t have sisters, and I did not want bridesmaids for a number of reasons. But nonetheless - none of this would make up for the mother-shaped hole, anyway, nor does it take away the fact that I have a mother who again effectively abandoned me and does not seem to care much. I’m not even sure if she’ll show up the day of.\n\nAnyway, although none of this is new, this has come up over and over throughout wedding planning. Both logistically and emotionally. Luckily I can afford my part of the wedding fiancé and I are planning, so that’s not so much an issue practically speaking. But, emotionally to not have my mother’s support has affected me in ways difficult to fully put into words.\n\nLooking for support from others (especially women) who have been in similar scenarios and can inherently understand. ",
    "score": 19,
    "url": "https://reddit.com/r/weddingplanning/comments/1in01z4/did_anyone_other_brides_here_plan_their_wedding/",
    "created_at": "2025-02-11T14:40:19.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1nldsrs",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "A little lonely being a bride 😬",
    "text": "Okay. I need to vent and hoping to feel a little community on this. Long post, sorry! \n\nI have hated being a bride. Some background - I am the oldest and have a lot of siblings. I have always taken care of things for my family and am the most successful career wise by far. My parents haven't been as interested in our wedding as my younger siblings need a bit more help with kids/craziness going on in their lives and always seem to be in some sort of a pickle. \n\n My partner is great and kind and thoughtful, but didn't start really being as interested in planning till we got closer to our date and the pressure was on, but happy to help if I asked for it then I still felt like the ball was in my court to ask. But I shared that I felt a little alone and now it's feeling more equal. \n\nAnd in my friends groups I'm the one that organizes trips, hosts get together and I am always celebrating others. \n\nI have done a pretty good job wedding planning (I think!) but have felt really alone and not celebrated the way I thought I would be. I don't know how to explain but I just wish we eloped and I could have skipped this disappointed feeling. No one seems as interested now that it's about me and I don't want to ask for the attention because then it doesn't feel as genuine or like it was an inconvenience. I skipped a bridal shower because we are pretty comfortable and don't need anything so I thought the wedding would be more of a thing people were excited about or wanting to check in on me the way I did for others.\n\nWe're two weeks out and I just feel a little embarrassed that I am throwing a party for us that others may feel more obligation versus joy. Blah. Anyone been in this boat? If so, how did you put it aside and enjoy your big day without little sadness creeping in?",
    "score": 19,
    "url": "https://reddit.com/r/weddingplanning/comments/1nldsrs/a_little_lonely_being_a_bride/",
    "created_at": "2025-09-19T19:59:11.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1psb8m7",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Changing my last name",
    "text": "Hi all!\n\nI know there have been previous discussions about whether to change your last name or not, and I've seen benefits to both sides.\n\nFor me, I do like my FH's last name a lot, but given the current political climate in the U.S., I'm not sure if I want to risk any potential complications if I do change my name. That's really it, I don't have any career related things that I'd want my birth name to stay on, nor do we plan to have kids.\n\nI saw you can change it \"socially\", but I'm not sure what that entails. Does that mean just social media and among family/friends? Can people send us mail with both of us having the same last name or is that illegal? I think I just need more context/details on what that means to see if this is the right way to go for now since I can always change my legal name later if I want to.\n\nTYIA!\n\n\nEdit: Thank you all for your answers ☺️ It was probably a little silly, but I appreciated the reassurance and shared experiences.",
    "score": 17,
    "url": "https://reddit.com/r/weddingplanning/comments/1psb8m7/changing_my_last_name/",
    "created_at": "2025-12-21T17:00:23.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1mfkqi2",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Too excited about life after wedding",
    "text": "Sorry I’m not sure where to post this. Feel free to point me to a more appropriate sub.\n\nThe love of my life and I are getting married next June. I’ve been planning my wedding my whole life. We have stable careers and contributing parents and are able to have our dream wedding while still having enough money for future things.\n\nAfter our wedding we are going on a honeymoon and then will have enough savings and high credit scores to put a down payment on a lovely home. Then we can fill it with babies which I’m dying for.\n\nI just feel like I’m too excited about rhe furure that I’m not appreciating the present enough. My mind is “wedding &gt; honeymoon &gt; house &gt; babies” but I feel like I need to stop thinking three steps ahead. I’m having baby fever which doesn’t help.\n\nI’m hoping maybe someone feels something similar and can share advice! I’m planning my beautiful wedding and want to enjoy every moment with my love, not just wait for the next one.",
    "score": 15,
    "url": "https://reddit.com/r/weddingplanning/comments/1mfkqi2/too_excited_about_life_after_wedding/",
    "created_at": "2025-08-02T07:39:46.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1p31583",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Wedding Gift Amount as a Bridesmaid?",
    "text": "Hi! I'm in a wedding this weekend as a bridesmaid for a close friend of over 10 years. She's 100% going to be a bridesmaid at my wedding, so I'm looking for some advice as to how much I should give without offending her or going over budget.\n\nFor context, I paid about $200 for my dress (the dress itself and alterations), $230 for the bach, $215 for one night's hotel room (split between myself and my partner), and I've spent lots of time doing DIYs and helping the bride with tasks leading up to the wedding. I really don't want to look cheap, but I've already spent $655. This is also my first time being a bridesmaid, so I'm also not sure if this is roughly on par or above average.\n\nMy mom advised me that $500 is appropriate for the wedding gift. That brings my total spent on this one wedding to a little under $800. I'm still relatively early in my career, so this is not an insignificant amount of money to me.\n\nIs $250/person between my partner and I too much? Or would $300-400 be more appropriate? We've given about $200-300 for other weddings we've attended this year as guests, but I'm under the impression that we should give more as part of the wedding party. I'd love some honest input! Thanks Reddit!\n\nEDIT: Thank you guys so much for your comments!! I really thought that it would be crazy to give $500, especially on top of everything else. I think $200 is more than enough considering everything else. Thanks guys!",
    "score": 14,
    "url": "https://reddit.com/r/weddingplanning/comments/1p31583/wedding_gift_amount_as_a_bridesmaid/",
    "created_at": "2025-11-21T15:12:02.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1htu0he",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "What are people considering acceptable for notice for destination weddings?",
    "text": "My best friend since highschool has been engaged for a couple of years now. They were focusing on a few other things for a bit like house, school, careers and such and just really started planning. Back in November he asked my opinion on destination weddings (like Mexico or Jamaica, we live in Canada for reference). I told him they are just fine but that he would need to give like DOUBLE the notice compared to a local wedding and accept that people still may not be able to come. He agreed and said they had been thinking October but was thinking of pushing it out a year to be able to do the destination.\n\nHe just sent me their save the date mockup (preview?). They are going with this October and Jamaica... final payments need to be in by August, and the cost is, at minimum $4500 per couple not including any other costs besides flights and accommodations and that only gives people 8 months to save.\n\nI'm kinda devastated. I told him we most likely would not be able to attend. We booked a trip for the end of this month that we cannot cancel. If we had known sooner we would have not booked it and used some of that money for the wedding.\n\nMy husband and I make decent money together but even then we would be stretched to save that amount in time. We would have to drain two savings accounts earmarked for other things. So yes it is doable...but am I a terrible friend for not wanting to put us through that stress?\n\nAlso for context, they, us and our friends are all roughly in the same tax bracket.\n\nHe was in our wedding party but ours was local and there is absolutely no way they spent anywhere near $4500 to attend/participate.\n\nBrides/groom's having tropical destination weddings, what type of notice are you giving?\n\nI want to show up for him and support him in this marriage but this feels extreme.",
    "score": 12,
    "url": "https://reddit.com/r/weddingplanning/comments/1htu0he/what_are_people_considering_acceptable_for_notice/",
    "created_at": "2025-01-05T01:22:47.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1m744a4",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Regrets after my wedding (need help understanding it all)",
    "text": "Ugh, I hate even typing that headline, but it’s true to how I feel.\n\nI wish we’d waited one more year to get married. We booked the wedding and were married within the same year and it gave no breathing room to change decisions or to help my overwhelm, mainly because my career of 12 years was ending. It can’t be helped because, we can only do what we know at the time, and my husband reminds me that everyone would do things differently in hindsight, it’s just I have a sadness when I think of my wedding and I don’t know what to do about it.\n\nI’m not sad because I married my husband, that’s the best part! And that makes me realise, we maybe didn’t need all the big extra stuff. But, I learned a lot about some - what I thought were - close friendships, realising there’s friends who I love dearly who I overlooked for bridesmaids, and then one in particular I chose who just was not good at all! I actually think she’s always been this way I just had rose tinted friendship glasses on and overlooked the crap because her parents were friends with my parents. She had done something shady before the big day but the advice from around me was not to rock the boat and then after the wedding I never have to speak to her again, but the problem is, it’s made me resent my wedding photos with my bridesmaids.\n\nI don’t like looking at my photos at all 😣. It was such a stressful and overwhelming time for me - my work place was horrendous at the time and I was planning to leave when I went on wedding leave, they made me redundant the week of my wedding, which actually worked out better because I got a pay off, but I think a lot was changing in me internally and it was so stressful. I’ve since had a career break and have better prospects and new career avenues on the horizon and needed the break for many reasons.\n\nThere is so much I loved about my wedding though, my Mum and bother being there in particular. I lost my Dad 3 years prior (who my husband unfortunately never met), and I wanted to get married while I still had my most loved people around me, so that was the eagerness to get married sooner than later, and then the job stuff I could not have foreseen.\n\nI just hate that I have these mixed feelings. I feel like my wedding was a bit of a life twist, it highlighted what I need to let go of; a career that made me unhappy and friendships that were not what I thought they were, and has shown me who truly cares about me and what amazing new friendships I’ve made over the years that are stronger connections and much more supportive and caring people.\n\nMaybe that’s the takeaway, the wedding was a necessary closing of some doors and opening and realising of others.\n\nHas anyone else felt this sort of way about their wedding? I feel I had to talk about it and hopefully there’s some wise words that can help.",
    "score": 11,
    "url": "https://reddit.com/r/weddingplanning/comments/1m744a4/regrets_after_my_wedding_need_help_understanding/",
    "created_at": "2025-07-23T08:53:27.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1pmvks6",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "No friends or family",
    "text": "I’m recently engaged (30F) and as we get further into planning, my fiance and I are realizing how little friends/family we have.\n\nBoth of our families are small and dysfunctional (mental illness, differing political beliefs, etc). We are not close with our parents. No cousins, no extended family, most of them are in other countries, whom we have no connection to.\n\nOn the friendship front: over the years we’ve moved around a lot and focused on school, our careers, and on each other. Now as adults it’s extremely difficult building close friendships. Collectively we have 3 close friends. However, we don’t want to invite them and face the shame and embarrassment of them realizing that we have no other friends but them.\n\nBecause of all this we’ve been leaning towards eloping but I’ve been feeling so emotional because it’s almost like we didn’t really have a choice in the matter.\n\nI think I just want to know how do I make it hurt less? Are there other couples who’ve gone through this? What did you do to make the day special?\n\nI feel like I’ll just look at the empty venue and feel sad we have no one our my lives to celebrate us…",
    "score": 11,
    "url": "https://reddit.com/r/weddingplanning/comments/1pmvks6/no_friends_or_family/",
    "created_at": "2025-12-15T02:03:46.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1n1ttks",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Got married last Saturday - final thoughts",
    "text": "Our wedding was on Saturday and everything was PERFECT. We weren't nervous at all and I was smiling non-stop from 5:30 am to 3:30 am the next day! We couldn't have asked for better.\n\nIn no particular order, here are some thoughts and reflections that may be of value to others:\n\n• I am so glad we didn't do a first look. We had a Catholic wedding so it wasn't practical anyway, but regardless I didn't want one. And I can't imagine how the aisle moment would have been the same if we had done one. Don't get me wrong, I'm sure it's still magical- but it can't possibly be *as* magical because so much of it was directly related to seeing each other for the first time. Putting on my career researcher hat for a minute here- claims that a first look doesn't diminish the aisle moment are objectively unfalsifiable no matter what people think or feel. You can never know really know what something would have felt like if you'd done it differently. So if you don't want to do a first look, don't let anyone pressure you.\n\n• We didn't do much in the way of extras - no lawn games, no bouquet toss, no shoe game etc. - but we had Irish and Indian dancers during dinner and a 360 photobooth and both were so worth it. The photobooth was constantly in use, and I think the dancers were a lot of our guests' favourite part.\n\n• There are some things, like the weather, or random emergencies or acts of God, that are outside your control, but for the most part when people say \"something will go wrong and that's okay\" it's cope. NOTHING went wrong. And I won't be modest about this- it was because of our meticulous work over the last two years. Nothing went wrong because we organized and planned and double and triple checked everything practically down to the millisecond. The way your wedding day unfolds is largely within your control.\n\n• As sort of a Part B to the above, there were two instances were things could have gone wrong but didn't, and that's because we handled them ourselves. We were both cool as a cucumber all day (also thanks to the planning), and that left us in the headspace to directly handle things ourselves rather than delegating them to someone else. You are the expert on your own wedding and you are the person most equipped to handle anything that may arise.\n\n• A couple of people wore entirely or almost entirely white dress. I did notice, kind of thought \"lol ok girl!\" and then didn't think about it again. It's rude, but it's also a choice to let it impact your day.\n\n• People were so generous with their time and money. Of course we're extremely thankful, but it sort of made me realize that it's nothing I wouldn't do for them and it's okay to hope that the people you love will be kind and generous about your wedding. All of our wedding party members gave gifts. They're certainly not all wealthy; some are barely financially stable. Additionally, our wedding party as well as our close family were constantly asking for more ways to help. I think some of them were actually disappointed that we didn't need much from them! Two of my cousins, who were my MOH and a bridesmaid, stayed at my parents' house with me the night before and decorated the entire upstairs, unprompted. I never would have *expected* any of this from anyone, but after the fact it does kind of make me feel like \"yeah, Reddit is super wrong about this.\"\n\n• We did a surprise mother-daughter dance but also invited all the mothers and daughters to join us because my mom doesn't like attention, and I think that was the best decision we made. There wasn't a single dry eye in the house. We somehow ended up all linking hands and forming a big circle and it felt like the most beautiful celebration of mothers and daughters and women in general. So many people came up to me and thanked me for it.\n\n• You will spend the whole day with your photographer and videographer so make sure you actually like their personalities as well as their work! We were so fortunate that ours were wonderful. I can't imagine how much it would suck to have a photographer or videographer you don't vibe with.\n\n• We ate. You can eat. Not eating is a choice. I didn't eat as much as I usually would, but even that was a choice. I could have if I wanted to.\n\n• Lots of people told us it was the best wedding they've attended but I'm pretty sure people say that to everyone. So when someone shows up here and is like \"I had my wedding in a ditch on the side of the road and multiple people told us it was the best wedding they've ever been to,\" take it with a grain of salt!!!!!\n\n• It was all worth it. The only real worry I had was that all the time and money would feel wasted when it was over, but that couldn't have been less true. Yes, the day flew by, but we loved every second of it and I'm still reliving it basically 24/7. Two years of planning, 170 attendees, and over $60K total (over $40K we paid ourselves), and I'd do it all again (and so would our parents who helped). Obviously a big wedding isn't for everyone, but you know yourself. If it's what you want, don't question that gut feeling. It's so worth it.",
    "score": 11,
    "url": "https://reddit.com/r/weddingplanning/comments/1n1ttks/got_married_last_saturday_final_thoughts/",
    "created_at": "2025-08-27T21:32:01.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1jqwtjg",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Financial changes and RSVP changes crushing our budget",
    "text": "We decided on a destination wedding after factoring in how insanely overpriced the local market is for us and wanting a more intimate, fairytale castle experience. After checking with our VIPs last winter, we locked in a date for this December and immediately sent out Save The Dates, giving folks a year to plan. \n\nThen a large chunk of our VIPs told us literally the next day they suddenly couldn't go due to date conflicts they failed to mention when I got their buy in on picking our wedding date and destination. It was upsetting, most were family, I had a pity party over it for a weekend, but then I moved on and contacted our B list and sent them Save The Dates.\n\nDue to the time of year and distance, we were advised by everyone and our planner to expect a low turnout and plan accordingly, keeping backup guest lists.\n\nWell now several weeks later and apparently the airlines had one heck of a deal and suddenly all those \"No\" responses along with the \"Maybe\" have flipped to \"Yes\", bringing our expected wedding guest count from 25-40 up to over 80, with an almost 100% acceptance rate.\n\nI would otherwise be excited except for a few things:\n\n1. Our venue has lodging but can only sleep 40 and all rooms are spoken for by the guests who RSVP'd \"yes\" from the start, meaning the family who changed their mind can't stay onsite with us and are now upset they aren't getting priority over friends who committed first.\n2. Due to the initial low interest and high rejection rate, we chose not to spend money getting a hotel block. Turns out the two main hotels in town are both hosting big weddings the same weekend, so they don't have much availability left now.\n3. We are doing a Welcome Dinner the night before since the wedding was going to be so small and we have no wedding party. It was part of our venue package and all guests staying onsite are meant to attend, but the castle will only serve up to 60 guests. Going beyond that means we'll have to bring in the outside caterer who's serving our actual wedding dinner - aka paying 15k euros as a surprise cost unless we uninvite people.\n4. Our planner based all our beautiful decor, dishware, and antique rentals on there being &lt;50 guests (we told her how many we'd invited but noted all the RSVP \"No\" also). She's now messaging that we'll have to downgrade and change rentals due to guest size doubling and change the entire tablescape. Not the worst, but unexpected curveball to my emotions right now.\n5. The exchange rate went from on par a month ago to eating up 5k more of our budget due to the economic chaos, so we have no real wiggle room anymore.\n6. A reputable rumor is going around work to expect no merit increases in salary and no bonus, and our stock tanked 1/4 of its value in the past few weeks, meaning we can no longer really afford to pay for all these guests without taking on some debt unless the economy improves or the rumor is false.\n\nI know you shouldn't based your budget on bonuses, but historically my work guaranteed one as part of the compensation package unless the employee was on a performance plan to be fired. Our stocks vesting were supposed to cover the bulk of it, so the bonus would be a \"nice to have\", but with how severely their valuation has dropped, we'll be in the red if all these guests truly show up. \n\nI would not have invited the B list if I'd known our A list rejections would change their mind. I would not have done a wedding at all if I'd known my job was at risk and the economy would be collapsing!\n\nTl;dr: What to do about a large number of guests (family especially) changing their mind before the RSVP deadline and overcommitting headcount? Also how are folks handling the economic uncertainty with wedding planning?",
    "score": 9,
    "url": "https://reddit.com/r/weddingplanning/comments/1jqwtjg/financial_changes_and_rsvp_changes_crushing_our/",
    "created_at": "2025-04-03T22:53:35.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1kyjlb6",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Tipping Catering Servers If Labor Cost Is Already High?",
    "text": "Hello! We just had our wedding this past weekend in Chicago - it was magical! We are now sitting down to figure out tipping. \n\nMost sources say to tip Catering staff in the US. However, we paid a labor cost that was equivalent to $40 an hour ($360 total for 9 hours) for each server. In looking up the average salary of a high end restaurant server in Chicago, this amount is about double the avg. per hour salary. We've already spent a ton of money on this wedding, with Catering being by far the highest expense. But, I also don't want to be rude. \n\nSo my question is - do we still tip? \n\nThanks!",
    "score": 6,
    "url": "https://reddit.com/r/weddingplanning/comments/1kyjlb6/tipping_catering_servers_if_labor_cost_is_already/",
    "created_at": "2025-05-29T19:20:22.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1in8kh4",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Job promotion before wedding?",
    "text": "I’m currently being offered a job that is higher stress than my current job, but also with that it’s a much much higher salary as well. I’m comfortable with my job now and can confidently say taking time off for the wedding won’t be an issue. I also know it will be relatively low stress leading up to the wedding. I’m worried if I take the new job my stress levels are going to sky rocket and I’m not so sure I want to deal with that during what’s supposed to be an exciting time. The wedding is still a few months away and it’s possible the new job might be not as stressful as I’m thinking it is, but I’m just not sure if it’s the right time to test it out. I’m a terrible decision maker so figured I’d ask here to get some input!",
    "score": 5,
    "url": "https://reddit.com/r/weddingplanning/comments/1in8kh4/job_promotion_before_wedding/",
    "created_at": "2025-02-11T20:31:13.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1me781x",
    "subreddit": "weddingplanning",
    "soc_codes": [
      "13-1121"
    ],
    "title": "Cutting guest list",
    "text": "UPDATE:  \n\n\n1. Talked to fiance and went over the budget (which we hadn't done since I started trying to cut things because I was still in research-mode just comparing different options, caterers, bakers, flowers, etc) and they realized how much I was cutting back on everything else. When all the legal stuff happened a week ago, we talked it over and both agreed to keep our date no matter what. Like I said, I will go to a Costco sheet cake and Capri Sun to keep this date if I have to.\n\nWe both felt very very strongly that we just absolutely refuse to lose this day we've been looking forward to so much for so long because of my ex. We've been together five years and we finally felt ready to do this. Not just because we had already paid for the deposit for the venue which is 100% not flexible. It's one of the most sought after in the city and we were extremely lucky to get it, it books up at least a year in advance.\n\n2. Y'all helped me clarify that more than anything I was just upset they wouldn't even consider looking at the list or reach out to people tentatively and get a feel for who would say \"yes we can totally come, come hell or high water\" or \"actually no probably not.\" I made the post because I wanted to sit with it and get feedback first.\n\n3. It is kind of a leap that somehow asking them to see if the guest list could be trimmed down ever so slightly and maybe only for people we knew were going to have a hard time coming at all is BEYOND THE PALE, but asking me to postpone or straight up cancelling the wedding is not. I couldn't crunch numbers and determine if it WAS possible at all to still keep the date/menu/whatever without really nailing down the min/max number of guests. It doesn't really save an appreciable amount of money to cut it back by five or ten people. And we didn't want it TOO too small, because then what's the point of having a venue and caterer etc in the first place?\n\n4. Our budget was always $10,000 because we wanted to prioritize building up their savings first. Someone also had the idea of a compromise that if they absolutely couldn't, see if they could get any kind of small side gig to contribute more, which my fiance was also receptive to! I looked things over and split up how much extra we would need every month to hit both our wedding goal AND savings goal. It's a major squeeze, but it's doable. I'm a nurse and can always pick up a shift somewhere.\n\n5. We nixed the waffle bar since that's the most expensive possible way to cater, to have someone making them on site (much as I wanted to.) So we're going to go with other breakfast bakery stuff and stuff like croissant sandwiches that can be just picked up and served buffet style and won't be hard to set up. Our grocery store (HEB for the win!) has a fantastic deli section that caters as well for some more substantial protein items.\n\nSo yeah, thanks y'all! It actually really did help. =)\n\nOkay, so. Getting married in March 2026. We've only sent digital save the dates. Hard hard hard limit of $10k and 100 guests which we've mostly stuck to so far and agree on everything, we had pretty much everything good to go. Then my ex-husband is taking me back to court and I am ALREADY $6k into that just for the retainer and haven't even gone to court yet. We also had a bunch of other big expenses just blow up, cars, dental implants, etc all at once, and ate up half my savings.  Fiance isn't working right now while they're in pharmacy school, but will be around October or November. So we both understand that we need to cut certain things back about the wedding.\n\nI want to start with the guest list. That's really the most \"flexible\" number we can work with to reduce costs because then we need less invites, tables, chairs and of course food, cake, and booze. I already really cut back my floral budget (which was one of the most important things to me) and went with fake flowers instead of real, as well as my dress and the cake. They didn't really care about any of that to begin with, the important thing for them was getting to invite everyone they want to celebrate with. Which I realize makes me sound kind of petty or superficial that I'm more invested in the other things.\n\nThe other thing is that I only have 34 people to invite, total. Most of them are out of state because all my friends live in the computer and have kids of their own and everything and my only family is my mom and my three kids. And even I went and pared down who I could really do without and messaged my friends if they were like a \"come hell or high water\" RSVP, a \"I don't know but really really want to\" or \"probably can't tbh.\"\n\nThey have 55 total invites, more of their friends are local or single/childless and much more able to travel, and a much larger family who can all bring all of their kids. It's also still mostly going to be paid for by me (I make roughly twice what their starting salary is likely to be.) And it's bothering me that they wouldn't even consider LOOKING at the list and just marking \"yeah I could live without them\" or \"they're probably a non-starter\" like people that live out of the country, when I have already cut back so much of what I really wanted AND my guest list.\n\nThe other thing is that if we go to a cake and punch reception (which is normally between lunch and dinner) then it's going to be during the hottest part of the day in Texas in March while I'm wearing six layers of polyester. I really really had my heart set on a brunch wedding with a waffle bar and mimosas and also because of the heat and some of our guests are elderly like my mom and their grandmother.\n\nThoughts? I'm just trying to figure out if this is a reasonable complaint or not.",
    "score": 5,
    "url": "https://reddit.com/r/weddingplanning/comments/1me781x/cutting_guest_list/",
    "created_at": "2025-07-31T17:06:09.000Z",
    "num_comments": 23
  }
]