[
  {
    "id": "reddit-1np467p",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "This garbage from Nexstar makes me want to quit the business",
    "text": "Nexstar told stations we wouldn’t run Kimmel tonight, but they didn’t bother to pull the ABC ads which said, “Hey, Kimmel is back on!” \n\nWe are already producing long newscasts to fill the gap. By the way, no direct word from higher-ups. No company-wide email, just trickled-down half-communications to station managers and news directors. I’d bet they’ll get mad about all the overtime we’re running for this. \n\nOur in and out times have been insane, and there has been no guidance to the production side. Hell, half of them today weren’t even informed about the extended newscasts when they began. \n\nAside from all the absolute BS regarding the FCC, this makes me just want to walk away. This has been the worst past week I’ve ever had in my career. How am I supposed to justify myself as a responsible journalist when I’m being told not to run stories about the BIGGEST story of the day? How am I supposed to justify myself when all I can tell people is “it wasn’t our choice”?\n\nEmails, phone calls during the show (which I answer if I can catch them), Facebook comments, people angry and under the belief that yes it is indeed our local station’s choice for this crap. \n\nWe complain to our ND, who is telling the station manager about our complaints, and that’s where it just stops. Our corporate overlords don’t give a shit about us, and while I’ve known that a long time, it’s becoming harder to look away from. \n\nI’ve never felt this disheartened in a news job before. I love my job, and I love my community, but with the Kimmel mess, I wonder if it’s even worth it. \n\nAnyways, thanks for letting me complain. Fruitful and good news days to all who read. ",
    "score": 658,
    "url": "https://reddit.com/r/Journalism/comments/1np467p/this_garbage_from_nexstar_makes_me_want_to_quit/",
    "created_at": "2025-09-24T05:41:04.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1jqu0in",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "I'm leaving journalism and feeling insanely guilty about it",
    "text": "Hey everyone, I'm currently a federal policy reporter in DC, decent salary, great benefits, my beat is not bad either, but a horrible editor and publishers, horrible management, terrifying expectations, and also terrible news that I've CONSTANTLY been reporting on. i've been reporting for years now and after lying to myself for years that journalism was great and that i have to brave through every harsh editor, i crashed out not too long ago. i've made the conscious decision to exit the space and get into a comms/PR job. Easily transferrable skills and I know that I need the peace, fixed hours and a better pay.\n\nHowever, there's this guilt that's gripped me. I've always worked in journalism and I had the absolute privilege of working with on projects that have made an impact and brought me so much joy. But at this point, I am so burnt out that I have a resgination letter sitting on my laptop just itching to be sent out. I feel like my creative output has been drastically reduced and I just don't have it in me to be that intellectually engaged anymore. I wake up tired and the need to \"change the world\" is so drilled in, that I feel like I'm doing a huge disservice to not only me but readers.\n\nJournalism and free speech is beginning to look like a joke to me right now and with everything going on right now, I really just want to step away from journalism and send a few emails a day as a job and be done with it.\n\nHas anyone here been in a position like this? Leaving journalism and feeling strong guilt for leaving? I know I'm going to leave because I matter more than anything but would be great if I could hear your stories!",
    "score": 158,
    "url": "https://reddit.com/r/Journalism/comments/1jqu0in/im_leaving_journalism_and_feeling_insanely_guilty/",
    "created_at": "2025-04-03T20:56:52.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1lbphku",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Well, I’m okay",
    "text": "This is effectively the sequel to this post from yesterday: https://www.reddit.com/r/Journalism/s/2O1s5kg6a6\n\nThe protest went pretty well actually. There were only about a dozen counter-protestors compared to hundreds of No Kings protesters. And while there were a few heated moments, everyone was surprisingly respectful for the most part (it’s both humorous and sobering that the rowdiest person there, who wasn’t driving by in their car trying to intimidate protestors, was a middle school-aged boy). \n\nThanks again to everyone who offered me advice yesterday. To address a few things: I’m used to getting a lot of heat on stories, and even got death threats for a Black History month story earlier this year. Just that the added realism of being on the scene made me pretty anxious. Even though I kind of stumbled into this job, I do like it and always saw it as a the most viable / attractive alternate career path should the one I studied for not pan out.\n\nI’ve got another long week ahead of me (have to cover for a coworker who’s on vacation while simultaneously being on somewhat of a staycation), so I’m just going to focus on that. Once again, thanks for all your help!",
    "score": 157,
    "url": "https://reddit.com/r/Journalism/comments/1lbphku/well_im_okay/",
    "created_at": "2025-06-15T02:23:02.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1m84xhz",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Trump’s suit against Murdoch pits him against a longtime adviser and ally",
    "text": "Throughout President Donald Trump’s political career, Rupert Murdoch has played the role of a scold and a cheerleader. He has been a target, and frequent beneficiary, of Trump’s whims. But Trump’s recent lawsuit against the Murdoch-owned Wall Street Journal tests their mutually beneficial bond.\n\nOn Friday, one day after the Journal [published a story](https://www.wsj.com/politics/trump-jeffrey-epstein-birthday-letter-we-have-certain-things-in-common-f918d796) alleging that Trump wrote a “bawdy” birthday letter to financier and deceased sexual predator Jeffrey Epstein, [Trump sued the Journal](https://www.washingtonpost.com/politics/2025/07/18/trump-lawsuit-wall-street-journal-murdoch-epstein/), the two authors of the story and a raft of corporate overseers including Murdoch, whose family trust controls the Journal’s parent company and that of its corporate sibling, Fox News.\n\nTo which Murdoch told associates: “I’m 94 years old and I will not be intimidated,” according to three people familiar with his comment who spoke on the condition of anonymity because they were not authorized to relay a private conversation.",
    "score": 147,
    "url": "https://reddit.com/r/Journalism/comments/1m84xhz/trumps_suit_against_murdoch_pits_him_against_a/",
    "created_at": "2025-07-24T13:49:11.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1nl7j3g",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "The best investigative journalism story of 2025 may be coming from the NBA",
    "text": "Pablo Torre spent months investigating how an NBA superstar got paid millions to do nothing from a company his NBA owner was an investor in. Given the salary cap and collective bargaining agreement, this is a story about the wealthiest NBA owner (likely) circumventing the salary cap, risking fines, suspensions, loss of draft picks, etc. and could lead to massive lawsuits. \n\nThe hard work Pablo has done, and how he has dripped out the facts over time, giving the accused enough rope to hang themselves as they respond, only for him to later produce more receipts, is wild. Even if you are not a sports fan, the investigation Pablo has done, and how he is telling the story is amazingly compelling.  This is the brave journalism we need in 2025. \n\nSearch \"Pablo Torre Finds Out\" on YouTube or your favorite podcast app to see the magical story unfold, or go to r/NBA to see the highlights.",
    "score": 141,
    "url": "https://reddit.com/r/Journalism/comments/1nl7j3g/the_best_investigative_journalism_story_of_2025/",
    "created_at": "2025-09-19T16:01:05.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1htywrp",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Just left my career in journalism in New Orleans before this horrible tragedy",
    "text": "I’m venting here because I recently left my career as a reporter and returned to a non media role that pays a livable wage and is not as stressful. Also, I live six blocks away from where the terrorist attack occurred in New Orleans.\n\nI was reluctant to leave my job because I truly love reporting but working in this market has been unbelievably unrewarding and frustrating. If anyone happened to watch the press conference in New Orleans after Jan. 1, this city, the state and its politicians were woefully unprepared for what transpired. Despite city and state officials being warned of pedestrian targeted activity in recent months…there were seriously no safety measures in place for what transpired. I'm not exaggerating when I say I would have anxiety attacks about the lack of preparedness I observed here fearing the worst. \n\nWhat I’m most frustrated about, and maybe I’m projecting, is the way Louisiana PR impacts all of the journalism here. When I was reporting, it was almost impossible to get ANYONE to say anything without having a public relations person filter their statement or to just be outright ignored. I am not from here which makes people really wary of my questions. I was assigned a beat of Super Bowl 2025 reporting (it will be held here on Feb. 9) and was reprimanded anytime I asked about safety preparation or the city’s ability to handle such a huge event. \n\nI guess I feel a bit of guilt…like if I had only pressed harder, if I had fought against the system more. I had reached out to friends at The NY Times to notify them of my concerns but no one really seemed interested. I don’t know if that’s because Louisiana Tourism pays for huge ads. It’s all that I can think about when I see Fox News gloating about how Chicago is so treacherous…of course they say that…they take out AD DOLLARS!\n\nI guess when I started my career I thought I’d be a voice of the people and try to look into things. And I’ve certainly done so in points in my career. But here I was almost treated with suspicion. I gloated when I saw national outlets grilling Louisiana’s incompetent leaders of both parties. People called me a bigot for not understanding the argument that \"culture\" is the reason infrastructure doesn't matter.\n\nAnd while I have a moment, I just want to ask, as an aside: Isn’t it unethical for food critics and writers to accept free food, gifts, etc.? I’m nauseous seeing stories here by the local food “critics” imploring people to return to Bourbon Street as soon as possible. Of course they would write that! They haven’t paid for groceries in twenty years!\n\nAt the end of the day, maybe this is me feeling powerless and disappointed in myself and narcissistic that I could have warned people about what happened. I’m depressed living here, I never fit in with the culture of parades no matter what and jazz music (I moved for my ex partner’s career…) and a vain part of me thought my writing might be able to help citizens be more informed. Now people are gone and while I know it’s not about me, I keep thinking how broken the system of reporting is and how no matter how much so many of us write or try to be ethical, people will ultimately have their minds made up about what they want to believe.\n\n**TLDR: I live near the New Orleans terrorist attack, left my career recently as a journalist and feel I could have done better getting the word out how pathetic this place is in terms of security. Now it’s too late…**",
    "score": 126,
    "url": "https://reddit.com/r/Journalism/comments/1htywrp/just_left_my_career_in_journalism_in_new_orleans/",
    "created_at": "2025-01-05T05:46:07.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1n0noxe",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Lost half the newsroom and the company hasn't made any effort to hire",
    "text": "When I started working at this newspaper in a 50,000 pop city back in October, we had an executive editor, managing editor, 3 reporters, 2 sports reporters and a photographer. We are owned by one of those piece of shit corporate entities that all have ugly as fuck cookie cutter websites. The one that had a massive cyber attack in February and is hemorrhaging money.\n\nExec editor quit the week of the cyber attack after a 30-year career due to burnout, the company laid off a reporter for not producing enough, the sports editor quit 2 months ago and now our other sports reporter just out in his 2 weeks notice.\n\nStarted with 8 staff. Ten months later down to 4. Company isn't doing shit to help us and provides no support and hasn't made any job postings.\n\nWe charge $30 a month for subscription while our TV news competitors are free and get 100x our engagement on social media.\n\nNothing we do matters. I had a story go viral, with 22,000 views but with a very hard paywall, only 2% of those viewers were subscribers. What's the point?\n\nI'm am experienced political reporter and I cover local issues and our state legislators. I get good feedback from the few readers who appreciate my work and trust my byline, but the stories that get conversions (new subscribers) are sex crimes, drug busts, murders and deadly car crashes.\n\nI'm sitting in bed at 8:35 a.m. and I dont want to go to work today.\n",
    "score": 122,
    "url": "https://reddit.com/r/Journalism/comments/1n0noxe/lost_half_the_newsroom_and_the_company_hasnt_made/",
    "created_at": "2025-08-26T14:41:22.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1kzkyzk",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "The suits have ruined this business.",
    "text": "Twice a year, my coworkers and I are put through an evaluation process to see how much we’ve “progressed” since the last review. It’s humiliating — essentially re-interviewing for our own low-paying, dead-end jobs. \n\nMeanwhile, I can only imagine how upper management evaluations go. Having worked in news for nearly 20 years (in art, pagination, marketing, and editorial departments) I cannot fathom why there are so many suits or how they can justify their continued employment.\n\nIn my experience, accountability seems to stop below the upper management level. I’ve never seen one of them fired unless it involved serious ethical issues. If my work falters for even a month, my job is at risk. Their job is to make this company profitable, but when things go south, it’s employees like me who are furloughed or laid off, not them.\n\nNewspapers have struggled to adapt for decades, and what solutions have management developed? Digital advertisements and subscriptions — essentially the same revenue streams as before, just online. When those inevitably fall short, their only “strategy” is to cut their way to profitability. \n\nMy company employs a director of marketing and a director of engagement, yet we don’t do ad buys, and social media marketing is our responsibility. We have an art director and a pagination head, but nearly all of that work has been outsourced. How is upper management justifying these positions when frontline workers have been winnowed down to skeleton crews?\n\nSure, they stay busy with meetings, but their day-to-day work isn't getting the news out, the ads sold or built, the paper or the production put together. Cutting a few of their bloated salaries would make a far greater impact than losing a $15-an-hour employee like me, who can barely afford a day off due to constant deadlines.\n\nI don’t claim I could do their jobs better, but I doubt I’d perform much worse — and I’d do it for far less pay. \n\n**Or better yet, we need a union.** ",
    "score": 120,
    "url": "https://reddit.com/r/Journalism/comments/1kzkyzk/the_suits_have_ruined_this_business/",
    "created_at": "2025-05-31T01:16:41.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1mkk4hg",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "My job has become training an AI model",
    "text": "I am a former breaking news producer who moved on to work in documentary and longform. I’ve usually really enjoyed my career and the stories I’ve helped tell. For the past year, I was hired on a project to adapt documentary content from English to Spanish. \n\nSoon after coming on, the company decided to hire an outside vendor to do the actual Spanish dubbing, using AI technology to modulate voices, thus drastically cutting the amount of voice actors needed for the job. What originally took a whole cast of actors, could now be done with just one actor. They would read all the lines, and the AI would change their voice to fit the different characters. \n\nMy job at that point became doing quality control of the AI dubbing, judging and grading the outputs, giving feedback; which then would go back to the machine, and do another iteration. So on and so forth, until we get a *passable* end result after about 6-7 times. I say passable because this tech is still early stages, and it’s not very good. But the company insists on this being “the future”. \n\nAll in all, it feels a bit disheartening that my journalism career has hit that inevitable AI dead end we’re all heading towards. Mine just happened quicker than I expected. ",
    "score": 91,
    "url": "https://reddit.com/r/Journalism/comments/1mkk4hg/my_job_has_become_training_an_ai_model/",
    "created_at": "2025-08-08T03:04:54.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1n7k1xn",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "I’m quitting the career I worked towards since I was 16…",
    "text": "…Because it all seems so hopeless. SO much is wrong with journalism at the moment - I’m coming away from it feeling radically against the (British, mainstream) media and everything it stands for. \n\nThat being said, I think so much good, valuable journalism is coming from independent voices and publications, as well as local titles which aren’t run by the likes of R**ch Plc etc. \n\nI’m reaching out to see if anyone works for an indie pub/writes a Substack filled with informative content, investigations, op-eds and the like. I’m a lefty and so looking for content that aligns with my morals and political views, naturally, but would love any and all recommendations please x ",
    "score": 84,
    "url": "https://reddit.com/r/Journalism/comments/1n7k1xn/im_quitting_the_career_i_worked_towards_since_i/",
    "created_at": "2025-09-03T16:47:05.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1nael4c",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "I am so sick of working in PR",
    "text": "Got laid off at the end of the year last year from my magazine job, quickly found a contract job shortly after still in the field, but then left for an agency PR job because benefits. Also, I’ve heard good things from people who have made the switch. \n\nSix months later and I am so miserable. The pay isn’t even much better than what I was making in journalism (was making $60k, this job is $65k). I hate corporate and I miss my old job. I miss my old coworkers. I miss the cool shit I got to do. Now I’m drafting action items no one will read and hopping into “fire drills.” \n\nI’m looking for more content-driven jobs with “senior” titles (I’m tired of being 5-7 years into my career with a resume of early career titles and salaries). I feel like people talk about PR being a walk in the park/easier than journalism and … I would like to know where and if they’re hiring. I’m a shell of a person, I haven’t slept well in months, I feel like I’ve shot myself in the foot career-wise. Also feel like I’m in a self-fulfilling prophecy of misery because freelancing would be hard to manage with this full-time hell job. And we all know about the state of our fruitful economy and robust, thriving industry.\n\nMaybe more than a rant than advice, I know corporate BS is everywhere, unfortunately not enjoying this flavor of corporate BS. ",
    "score": 83,
    "url": "https://reddit.com/r/Journalism/comments/1nael4c/i_am_so_sick_of_working_in_pr/",
    "created_at": "2025-09-06T23:53:35.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1mf1u50",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "What's a piece of outdated journalism career advice that needs to go?",
    "text": "I'll go first: Not having a social media presence. We live in an attention economy and the more eyes on your work = better name recognition and more opportunities for yourself. ",
    "score": 78,
    "url": "https://reddit.com/r/Journalism/comments/1mf1u50/whats_a_piece_of_outdated_journalism_career/",
    "created_at": "2025-08-01T16:56:46.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1n59nxq",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Laid off -- what would you do?",
    "text": "So, I'm about to be unemployed at 52 here in a few weeks for the first time since I was in my teens. I broke into the field through newspapers, where I spent 20 years before jumping ship to the digital/cable sphere for the past 10. It was an amazing retirement-type job but unfortunately reality had other ideas.\n\nOn the bright side, I was able to take advantage of the first real paycheck I've ever earned and built a decent little nest egg. On the down wide, I'm not sure I have the heart to continue and I have absolutely zero clue what other jobs my extensive writing/editing/producing (website) experience translates to. Especially now in the age of AI.\n\nI can provide further details about experience and skills, but I've been trying to think of a new career path for the past year or so and am absolutely stumped. Journalism is the only thing I've ever really wanted to do but at my age, the prospect of moving someplace shitty just to go back to another mediocre paycheck doesn't seem appealing.\n\nAny ideas?",
    "score": 73,
    "url": "https://reddit.com/r/Journalism/comments/1n59nxq/laid_off_what_would_you_do/",
    "created_at": "2025-08-31T23:44:12.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1iqxglo",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Job sadness",
    "text": "Been working overnights shifts for 4 years for one of the biggest broadcast companies. My body is exhausted. I finally got a job offer 12% more than I’m making now and it’s day shift. It’s still weekends though but my schedule will line up with my loved ones for the first time in my professional career (I’m 26).\n\nI haven’t formally signed the offer yet so have not told my current job. Once I leave, a domino effect begins of all my coworkers schedules getting screwed. I feel so much guilt. I also never wanted to truly leave the company. I could have stayed here for years. But I feel like I have no other choice. I was denied a promotion in the fall due solely to the fact the higher ups never really see my “work” because they don’t work with me. I was told to “speak up in slack more so they can see it”.  A dayside weekend job opened up on my team and they never considered to move me in. That to me, spoke volumes. \n\nI guess I’m starting to grieve the job but I don’t see professional growth in this position and my body can’t keep sleeping at 3/4am. It’s affecting my health. I guess I’m typing this out bc the grass isn’t always greener. I’ve put in long hours at one of the most widely recognized news companies and I’m still thinking about leaving because I’m not getting what I deserve. I feel completely taken advantage of. \n\nOn top of this, I am still in the final stages of interviewing elsewhere (which came out of the blue) for a job outside of news. It would be 100k and Monday thru Friday. It’s crazy bc here I am been stuck making 72k for years. \n\nJust wanted to stay I recognize the people who are doing what they love for little pay and recognition. I know how it feels.\n\n",
    "score": 69,
    "url": "https://reddit.com/r/Journalism/comments/1iqxglo/job_sadness/",
    "created_at": "2025-02-16T17:32:21.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1kcbgj7",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Opinion: Diplomacy is more important than toughness if you're a reporter",
    "text": "I spoke with a woman recently who told me she dropped out of journalism school in the early 1970s because a prof told her she wasn't \"tough\" enough to be a journalist.\n\nI was somewhat saddened to hear that she never pursued the career she wanted because of this criticism. It's also a criticism I strongly and vehemently disagree with. Perhaps this was more a sign of the times?  \n  \nI think the most important aspects of your personality that can make you a \"great\" journalist are diplomacy, kindness, fairness and integrity -- not toughness.   \n  \nI have always found this profession to be largely about relationship building and trust. It's also about being objective and fair. The best reporters I've seen in my 25 years in the field have been people who were well respected and liked by the people they wrote about.\n\nOn the other hand, I've seen tough, tenacious journalists struggle to get people to talk with them because they have a bad reputation as being aggressive.  \n  \nJust some shower thoughts I thought I would post. ",
    "score": 61,
    "url": "https://reddit.com/r/Journalism/comments/1kcbgj7/opinion_diplomacy_is_more_important_than/",
    "created_at": "2025-05-01T15:25:06.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1mnkr8o",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Is my Journalism career dead if I don’t move to a major media city before I’m 30?",
    "text": "I’m a 28F My life feels like a cliché I never wanted—I moved back to my hometown after college and got engaged to my \"high school sweetheart.\" I'm facing a serious career and personal conflict, and I'm desperately hoping for some outside perspective before I turn 30. My life can't be over yet, but is my shot at a journalism career dead?\n\nBeing a journalist has been my dream since I was a child, reading the daily news with my grandmother during summers in the Northeast. I went to a major city in the Northeast for college, but I moved back home to the South in 2020. I finished my degree last year, and this past spring, my partner and I got engaged. While I love him and want to build a life together, our current reality is taking a major toll. I lost my job in early 2025, and though my fiancé has a stable job, we've been living paycheck to paycheck, which has been incredibly stressful.\n\nThe problem is that I'm professionally stagnant. My current state has virtually no opportunities for a journalist, and while I've been doing independent work, it's unpaid. I'm terrified that if I stay here, I'll never achieve my dream and will eventually resent my partner for it. I truly believe my only path to a real career is to move back to a media hub like the city where I went to college.\n\nThe timing is both perfect and terrible. We’re about to move out of our apartment. The plan is to move in with my fiancé’s wonderful mother, but a part of me thinks, \"Shouldn't this be the moment I just go?\" But that path is full of complications. My parent, whom I would have to live with temporarily, is intimidating, and our past living situation was a source of great anxiety. On top of that, my fiancé is from the Northeast, but he hates the cold and says living there is like \"living life on hard mode.\" Still, I'm clinging to the hope that he'd compromise and eventually move to be with me.\n\nSo, I'm turning to you all for some advice.\n\nAm I being delusional for thinking I should move?\n\nIs it foolish to risk the stability I have for a dream?\n\nShould I give up and stay south, continuing to do unpaid work, or is there a way to say \"screw it,\" develop a real game plan, and follow my dreams without destroying everything?\n\nThanks for your help.",
    "score": 61,
    "url": "https://reddit.com/r/Journalism/comments/1mnkr8o/is_my_journalism_career_dead_if_i_dont_move_to_a/",
    "created_at": "2025-08-11T18:18:27.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1kkd0qw",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "How do I quit after my 2nd nervous breakdown?",
    "text": "So I've been working as a TV Reporter for 8 1/2 years and currently make 18.11 and hour (context, I live in West Los Angeles) I had been making 18.85 up until last year when HR claimed that I had been given a raise by mistake and dropped me to 17.75. I raised hell with them but they only raised me to $18.11 and started garnishing my wages to make up for the \"overpayment\" from my previous salary. I can't live on this anymore and it's a pretty stressful job. I just had my 2nd nervous breakdown today and want to quit.\n\nWhat is the best way to do this? Do I give two weeks notice? Do I request a living wage and leave when they refuse (I know they're gonna refuse) Do I do it in person? Over e-mail? Phone? I figured 8+ years means I shouldn't just rage quit but is it worth keeping bridges intact at this point?\n\nAnd how do I move on from this career? What jobs can I transition in to after being a TV Reporter for so long that will pay me an actual living wage? ",
    "score": 60,
    "url": "https://reddit.com/r/Journalism/comments/1kkd0qw/how_do_i_quit_after_my_2nd_nervous_breakdown/",
    "created_at": "2025-05-11T22:20:56.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1nugf2b",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "About to get my journalism degree but don't want to be part of the industry anymore",
    "text": "Hello! I'm hoping for some advice on exactly where I can pivot career-wise with a journalism degree.\n\nI've been working towards a journalism degree for around 6 years. I'm a low-income student and the \"affording college\" portion of college has been a nightmare. I think I'm well-qualified for a job in journalism. I have more than one internship under my belt, great clips in a beat that I like, and what I believe are good references. \n\nThe issue is, I'm about to graduate and I don't want to be part of this industry anymore. One of the main employers in my area just laid off their entire news team, and I believe more will happen next. I'm still low-income, and if my job suddenly disappeared, I wouldn't have the resources to be unemployed for a while. The other entry-level people in this industry that I've met are miserable, working in service positions and not on enterprise reporting. Tldr, I want out.\n\nI'm feeling really stuck though, because I've hated every marketing/public relations class I've ever taken and that seems to be the main alternative for my degree. It also feels too late to get experience in anything else. I adore the idea of getting a PhD with the goal of working for nonprofits working to help bolster local news, but I've been told by people from my internships that it would make me completely unemployable and that I'd rack up a lot of debt, even in a fully-funded program. I like that journalism is person-serving and the research aspect of the job.\n\nSo, what are the other options at this stage? Has anyone successfully pivoted to something other than marketing or public relations?",
    "score": 56,
    "url": "https://reddit.com/r/Journalism/comments/1nugf2b/about_to_get_my_journalism_degree_but_dont_want/",
    "created_at": "2025-09-30T15:33:40.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1mbozox",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Why do people want to pivot into journalism?",
    "text": "I keep seeing posts on here about people from all over the world, wanting to transition into the journalism industry. Of course it’s met with the negativity familiar to this sub, admittedly perpetuated by myself sometimes. \n\nBut my sincere question is: Why would someone, especially with an established career, transition into journalism for work? We’ve all described the low-pay, low-status, and other issues with it industry-wise. I’ve seen the same problems across the other forms of media where journalists earn a wage (print, TV, radio).\n\nIs their income already at a level where this doesn’t matter?\n\nIs it the storytelling, more passion-based aspect? In that case, you can tell stories, create a blog (even eventually monetize it), and take pictures all without quitting your day job, which may pay better than the journalism industry. \n\nUnfortunately, after 7 years in news broadcast (now for a national cable org), I’ve learned passion doesn’t pay the bills, among the other growing ethical problems with the profession.",
    "score": 53,
    "url": "https://reddit.com/r/Journalism/comments/1mbozox/why_do_people_want_to_pivot_into_journalism/",
    "created_at": "2025-07-28T18:58:09.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1ke640n",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "How do you make a living in this career?",
    "text": "I know it’s near impossible to make a living for most in this field of work, but I still wanted to ask. How do you make enough to cover your household’s expenses each month? If you are maybe earning a living in this field of work in a way that you aren’t proud of, just say it. I want to hear the honest truth of how the hell you do this job without ending up homeless. I don’t want a polished answer that makes everything seem perfect and easy, and I just want an honest answer. \n\nI love investigative journalism and photojournalism, but I just really need to know if this career is worth going after or if I’ll regret it and end up working 3 jobs as well as doing journalism. \n\nTL;DR\nHow do you not end up broke in this field of work?",
    "score": 52,
    "url": "https://reddit.com/r/Journalism/comments/1ke640n/how_do_you_make_a_living_in_this_career/",
    "created_at": "2025-05-03T23:26:56.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1labqdf",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "This Times writer complained they don’t earn enough to save on a six-figure salary",
    "text": "Flaired as Meme because it amounts to a humour post. Times published a piece by an accountant with a combined household income of £215K who say they have to dip into their savings every month and can't save anything. Hoping to get 20 per cent off what they pay their nanny. \"It isn't fair,\" they say. \n\nThere's a funny response imagining a violin so small it has to be viewed through a magnifying glass. \n\nDoes this signify that Times is so out of touch that the sad money stories it publishes are about people with among the highest earnings in the country? Is it daft? Offensive? ",
    "score": 48,
    "url": "https://reddit.com/r/Journalism/comments/1labqdf/this_times_writer_complained_they_dont_earn/",
    "created_at": "2025-06-13T09:38:14.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1nzp3st",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "For my safety, i was advised not to publish a story and i feel discouraged",
    "text": "\n\nnote: english is not my first language so i apologize for any grammatical error\n\n\nI just recently started pursuing journalism as a career while maintaining a full time job (communications related). My goal was to cover sports, so I started with an independent local outlet. However while covering a football game, i wondered something that led me to a rabbit hole, a deep, dangerous rabbit hole that prompted an investigation from me. \n\n\nKeep in mind this is my first time doing “investigative journalism” and idk if god sent me this story or i was in the right place at the right time, but i uncovered a whole lot of shit that no one seems to question at least here in my city. I got public records, documents, old articles linking old stuff with current stuff, etc etc . It was a whole month of me being obsessed with this. It all started with a football team and now I'm out here with a truth bomb in my hands.\n\n\nThe only person that knows about this is my best friend who knows a lot about the type of stuff i was investigating about. He tried to help me by giving me tips etc. \n\n\nLong story short, we found out through a source that indeed the people I'm investigating are not to be messed with and I SHOULD NOT publish anything related to them, for my safety.\n\n\nI understand it and I wont do stupid stuff, but i feel discouraged because my first investigation ever actually led to something, and now it will have to be buried.\n\n\nHow can i even make an impact as a journalist if this will keep happening?",
    "score": 48,
    "url": "https://reddit.com/r/Journalism/comments/1nzp3st/for_my_safety_i_was_advised_not_to_publish_a/",
    "created_at": "2025-10-06T17:13:46.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1jx1wf8",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "How do you deal with people who don't trust journalists?",
    "text": "Hey everyone, I hope you're all doing well.\n\nI'm a high schooler in Canada, and right about now is when talks about post-secondary / future careers start. As such, a lot of friends &amp; family members will ask me what I want to do in the future. Whenever I mention journalism, I get some pretty mixed comments.\n\nOn the more positive end of things, people will say things like, \"Oh, that's good, we need more journalists to cover the truth\" or even, \"to cover our side of things.\" Implying most in the industry aren't truthful or fact-based.\n\nSome people I've spoken to will outright say that many journalists are liars, corporate shills who will say anything about anyone and are getting kickbacks from large corporations and things like that. Oftentimes, their comments aren't limited to specific offending news outlets, but the industry as a whole. \n\nOverall I've found that there's a growing negative sentiment in how people see journalists. But at the end of the day, I'm just a high school student, so I wanted to ask people who really do work in the industry- do you experience comments like this in your personal lives? How do you respond to claims and accusations like these? ",
    "score": 46,
    "url": "https://reddit.com/r/Journalism/comments/1jx1wf8/how_do_you_deal_with_people_who_dont_trust/",
    "created_at": "2025-04-11T22:02:40.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1k749w2",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "“Leaving” the industry but I’m anxious about it",
    "text": "I went to college for journalism, and I have known that I loved it since high school. I did well in all my classes, scored great internships, won awards and have had a handful of years of post-college work experience.\n\nIn this most recent job, I have few benefits and a low-to-mid-range salary — I’m paid less than another reporter who is younger than me with less experience. I report, but I also edit, lay out newspapers, manage social media accounts, plan newsletters, etc. I’m exhausted, and my boss told me he was unimpressed with my performance a few months ago, which was a punch to the gut when I felt I was fulfilling the essential duties of my job well.\n\nI gave my two weeks recently because I accepted a job with higher pay and full benefits, but it is in communications, not journalism.  \n\nI know this change is probably for the best, but throughout my college/adult life, people have called moving out of journalism to a different media industry going to the “dark side.” I know it’s silly, but because of that rhetoric, I’m really nervous. I have never had a non-journalism job in my life, and I’m scared I’ll be bad at anything else or find it boring or hate it. I’ve been told repeatedly that this new job doesn’t mean I’ll be “locked out” of journalism or anything, but this still feels like a really significant life transition.\n\nCould anyone provide some insight into this? Any similar experiences you can share?",
    "score": 45,
    "url": "https://reddit.com/r/Journalism/comments/1k749w2/leaving_the_industry_but_im_anxious_about_it/",
    "created_at": "2025-04-24T21:42:22.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1n96xqq",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "What made investigative journalism so “rare” nowadays in mainstream media?",
    "text": "I dont want to generalize because i know investigation pieces come out every day. But i wondered this after seeing the reactions to Pablo Torre Finds Out’s case about Kawhi Leonard.\n\nIf youre not aware of this, a sports journalist basically shocked the internet by revealing an investigation on how the LA Clippers and its star player Kawhi Leonard, may have violated salary cap rules with an under the table payment brokered by a sketchy company.\n\nSorry if this explanation isnt the best but english isnt my native language and i tried to explain the best i could.\n\nWhat caught my eye was seeing a ton of comments saying this type of journalism is rare nowadays, or how Pablo Torre is a breath of fresh air. \n\nWhy is investigative journalism considered rare?",
    "score": 42,
    "url": "https://reddit.com/r/Journalism/comments/1n96xqq/what_made_investigative_journalism_so_rare/",
    "created_at": "2025-09-05T14:34:13.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1lggzxo",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Former digital journalists: Where did you end up?",
    "text": "I was laid off 2 months ago. I worked as a digital producer for a good while, but now I'm not sure where I should go next in my career. I know my skills are transferable to communications, advertising, public relations, social media management, and marketing. Despite living in a moderately sized city, I'm not seeing many job openings locally except for marketing, of which I'm least interested in.\n\nWhere did some of you end up after leaving journalism? Are you happier? Thanks in advance!",
    "score": 40,
    "url": "https://reddit.com/r/Journalism/comments/1lggzxo/former_digital_journalists_where_did_you_end_up/",
    "created_at": "2025-06-20T22:29:58.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1kk3hd6",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "I'm afraid I won't have a good living with journalism",
    "text": "I have always been passionate about sports journalism and I want to get into this field because it is the only one where I believe I will feel truly happy. However, I also have to think about the financial aspect and at least in Brazil, where I live, the profession is totally undervalued and I would not have such a comfortable quality of life. \n\nToday I spoke to a Frenchman because I was thinking about doing a master's and doctorate in France or another European country and then staying there and working there, but the answers I got from him were very negative, he said that it is not very well valued there either. \n\nSo, because of this, I am very afraid of doing sports journalism and regretting it because of the salary, even though it is what I love. I would really like to cover Italian or other European football, but for that I know I would have to study a lot, so I would like to learn at least 4 languages ​​in addition to Portuguese (Italian, French, English and Spanish) and also take specialized courses in football (like some here in Brazil with very renowned journalists from the world of football and CBF courses for coaches and analysts). \n\nCould you tell me about your experiences in this area? I need to understand if it really is the problem that people say about low salaries and difficulty in promotion.",
    "score": 32,
    "url": "https://reddit.com/r/Journalism/comments/1kk3hd6/im_afraid_i_wont_have_a_good_living_with/",
    "created_at": "2025-05-11T15:21:27.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1olztgh",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Writing tests",
    "text": "I’m an editor for a small but ambitious local news outlet. We pay well, offer good benefits and treat our employees well and do not overload our reporters and editors with work.\n\nRecently, we opened up a few new positions. As part of the interview process, we decided to have finalists in for a partial day of actual work to see how they did in real time and how they worked with the team.\n\nBecause we want to be respectful of candidates’ time and effort, we offered a flat rate payment for this. It was a good amount of money that technically worked out to about $55/hr for that one partial work day. But it was always meant to compensate people for the all-in effort of going through the interview process and how disruptive and stressful a multi-step interview process is to people’s lives.\n\nThe problem? As we moved toward negotiating offers, every candidate demanded $55/hr (or about $115k/year). These are jobs with a salary more like $65-85k, with benefits and other perks pushing the total comp beyond that.\n\nThey argued that since we paid them that for the writing and editing tests, we should give them that as a salary (even tho a writing/editing test is closer to freelance, which pays higher due to not having to pay all the costs associated with employing someone full-time.) The salary ranges were given to them in advance, in the job ad and in the initial interviews. I had to explain to candidates that the writing/editing test pay was to compensate them for the total effort put into the entire job application and interview process.\n\nSo now we’re thinking of paying people much less for writing and editing tests.\n\nThat makes me sad because I was proud that we were not exploiting job candidates, but it’s a case where trying to be fair and generous backfired.\n\nI’ve also seen the most insanely unprofessional job applications, usually from more experienced hires. (Intern and early career journalism applications are generally much more professional, thankfully.)\n\nDon’t spend your entire cover letter explaining all the ways past employers have wronged you to the point where you’ve lost all faith in journalism. I know it’s a common experience but at least half of all applications do this. \n\nAlso, don’t write saying you have serious reservations about the job and are demanding a conversation with the senior management before you decide if you’re willing to apply. We’re busy and we’re not going to beg someone to apply for a job.\n\nI know the job market sucks out there but don’t shoot yourself in the foot.\n\n(Also: no 33-page resumes, please. No one is that experienced. And yes, I have received 33-page resumes.)\n\n",
    "score": 29,
    "url": "https://reddit.com/r/Journalism/comments/1olztgh/writing_tests/",
    "created_at": "2025-11-01T21:38:44.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1k773xp",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Has anyone made the switch from journalism to law school? How did it go?",
    "text": "I’ve been looking for a new job for over 1.5 years while working a clickbait-y job for a Gannett paper. No luck finding a new job in journalism, marketing or communications (despite what I’d consider some pretty good efforts), but I also applied to law school at my parents’ urging and surprisingly received a full ride with an additional stipend. \n\nThis might sound really bad, but I never really expected myself to go into the law. However, I don’t have any other opportunities on the horizon and the stipend will pay about the same as my current (pretty low) salary. \n\nI majored in journalism and have only ever done journalism jobs and internships: LA Times  internship and two Gannett jobs. \n\nHas anyone else made the switch from journalism to law school? How did it go? Was it a hard transition? Any positives? Job outcomes after? \n\nAdditionally, if I hated the law, would it be impossible to go back into journalism or communications/PR after earning the degree?",
    "score": 24,
    "url": "https://reddit.com/r/Journalism/comments/1k773xp/has_anyone_made_the_switch_from_journalism_to_law/",
    "created_at": "2025-04-24T23:53:47.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1pm30dj",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Getting deported. Need a career alternate.",
    "text": "Hello all, I'm a 25 year old broadcast journalist for a local newscast show of a national channel in Canada in a medium sized market. I write, shoot and edit almost all of my stories. I do on-cams maybe thrice or four times a month, but it's mostly a voice over for the rest of the days. I should also mention that this is my first professional job and I've been doing this for about a year and a half now. Other than this job, I have multiple internships in India and Canada -- and a few international storytelling (Print and video) projects with a US university. \n\nMy biggest concern is that I don't see any growth opportunities other than maybe moving to a bigger market. But is that really growth? My salary increase would basically just match my increase in expenses. \n\nI love journalism but it feels like the industry has no ways of making a decent amount of money except to always live on a budget. Now, I'm not chasing money. That's not why I got into this career. But now I do want a life without constant financial stress. \n\nThe other part of the story is that I'll have to move out of the country in about six months. \n\nIf I go back to India, I probably won't be able to practice journalism because the industry there is honestly laughable at this point. I've reached out to a few senior editors in media and all of them have suggested that I should move out of the industry. \n\nI know that there are outlets in the country that are doing a great job. But with over 5 years in Canada, I have touch with reality in India. While I have done some really strong ground work in India in the past, I'm just not sure if they'll entertain my profile any more. \n\nIf I stay in Canada, the industry seems to be shrinking at a rapid pace. And I feel like I'll be forced out of it soon -- if not now, maybe in 5 years. I see my colleagues, who have been at the same position for years now -- which is fullfiling in its own way but I don't want that for myself. \n\nWhat can I pivot to? \n\nI'm really intrigued with AI ethics and governance but I don't know where to start. \n\nI have about six months to upskill, learn or grab any relevant experience/conversations here. \n\nWhere should I start? ",
    "score": 20,
    "url": "https://reddit.com/r/Journalism/comments/1pm30dj/getting_deported_need_a_career_alternate/",
    "created_at": "2025-12-14T02:34:11.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1isqohj",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Law School?",
    "text": "Hey all, \n\nI'm considering an off-ramp from my journalism career, and pursuing a legal career is on the short list of options. I'm (thankfully) employed with a decent salary in news, but I'm not confident the landscape will provide for longevity without forcing me to move around the country every few years. I deeply love reporting, but I don't want be in my 40's or 50's without a news job and scant other options at that age. I'm in my mid-30s and a little less than a decade into my career. Has anyone else made this transition? Thoughts? Advice? Admonishments? ",
    "score": 10,
    "url": "https://reddit.com/r/Journalism/comments/1isqohj/law_school/",
    "created_at": "2025-02-18T23:31:00.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1p64hjz",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Jobs for Journalism majors who are unsure about what to do after graduation",
    "text": "The job market has been bad recently, but it's been bad for a while in the journalism industry. A friend who's graduated five years ago imagined she'd have a straightforward career path as a journalist. Instead, she's currently freelancing and willing to take unpaid positions just for experience that could boost her future job prospects. \n\nFrom her struggles, my own, and those from reddit, I realized that there are no good resources out there, especially for humanities majors. Online resources are super outdated to the point where every role is listed alphabetically.\n\nI became increasingly frustrated and eventually decided to turn that into building something that could genuinely help. It's a career tool based on real data that provides actually relevant information. It shows you jobs that exist across different industries (including ones you didn't know about before), lets you compare career paths, and is personalized to your set of skills, interests, and values. For example, there's definitely more to a job than just maximizing salary, so it allows you to filter by values such as autonomy in your work, societal impact, etc.\n\nIf this is something you'd find useful, feel free to check it out: [findyour.stream](http://findyour.stream/?source=r/journalism)\n\nMost journalist majors don't end up as journalists. You'd be able to see that in the statistics and the typical paths they take instead.\n\nIt's still an early version. Right now I'm mostly trying to validate the idea first and see if people actually find this helpful. Super appreciate any honest feedback, and just wanted to share. [](https://www.reddit.com/submit/?source_id=t3_1p0x2p7)",
    "score": 9,
    "url": "https://reddit.com/r/Journalism/comments/1p64hjz/jobs_for_journalism_majors_who_are_unsure_about/",
    "created_at": "2025-11-25T05:39:30.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1i239nt",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "70-100k for a senior producer job in LA? ",
    "text": "I was scouted for a senior video producer job based in LA for a big broadcast network. It would require me to move across the country and the salary range is 70-100k. \n\nI understand in many parts of America that is good money, but not in a city like LA or NY. In fact, that's an embarrassing offer. The job entails \"producing, shooting, editing, booking, and managing\" everything from social media explainers to long form projects. \n\nThis is essentially one person doing the job of 3 people. \n\nWhy am I venting? I currently work for this company, with a much lower title, and I'm making 80k. Which means that this job offer uproots my life and, at best, offers me only 20k more. \n\nWhat's more irritating is, when I accepted the current job I have, I took a title cut and pay cut. Tried negotiating even just a title bump on paper, and they wouldn't because of \"salary requirements\". Yet here is a senior position offering the same pay I currently have.\n\nThis industry feels more deceiving day by day.",
    "score": 8,
    "url": "https://reddit.com/r/Journalism/comments/1i239nt/70100k_for_a_senior_producer_job_in_la/",
    "created_at": "2025-01-15T17:52:53.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1ies51n",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Struggling with work load with very limited resources",
    "text": "I work for a trade publication in a very small team (3 people). The topic itself is interesting and I enjoy learning &amp; reporting about it. The thing that I’m struggling with is this never ending pile of work — whether it’s producing my own video series, the publication’s series, hosting &amp; developing several webinars, developing editorial content for two of our in person events, moderating panels for events, in addition to reporting on the daily news and building the pipeline — I feel like I can’t even write anymore. My brain feels fried. And as a team we just got assigned another massive project and this morning, I just felt frozen. I didn’t know how to start my day because of how much is on my plate.\n\nI’m not opposed to working long hours or even weekends at times especially if it’s something I believe in and enjoy, but this ongoing slew of projects is diluting the quality of my work. Plus our company doesn’t provide merit raises, just a 2-3% annual salary raise. So the financial incentive is quite nominal.\n\nMy fellow journalists, how is your work load? And how do you handle an increased work load?\n\n",
    "score": 8,
    "url": "https://reddit.com/r/Journalism/comments/1ies51n/struggling_with_work_load_with_very_limited/",
    "created_at": "2025-01-31T23:07:41.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1nukl85",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Salary Changes",
    "text": "For seasoned journalists, I was wondering how the salary of your positions has changed over time. Were you making anything working for a paper as a student, what were you making at your first real job, and what are you making now? \n\n",
    "score": 6,
    "url": "https://reddit.com/r/Journalism/comments/1nukl85/salary_changes/",
    "created_at": "2025-09-30T18:10:13.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1lz20e5",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Career advice",
    "text": "Hi there, I'm a journalism grad who has some experience as a freelance sports writer/announcer. I've applied for a ton of jobs that are salary/hourly (haven't been hired) and I'm thinking my next next best move is to just move closer to a bigger market (I live in a tiny market with slim pickings for opportunities). Any recommendations for markets/cities (other than NYC/LA/Dallas) that I could move to or closer to for more sports opportunities?\n\nAny information is greatly appreciated.",
    "score": 6,
    "url": "https://reddit.com/r/Journalism/comments/1lz20e5/career_advice/",
    "created_at": "2025-07-13T19:49:54.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1k3qeb8",
    "subreddit": "Journalism",
    "soc_codes": [
      "27-3023"
    ],
    "title": "Is This Internship Worth It? Pay vs. Experience with",
    "text": "Hey everyone, I’ve come across an internship that seems like a great learning opportunity, but the pay is pretty much a joke. The position is full-time, and the compensation is only £500/month (for expense). I have a Bachelor’s degree but I’m currently unemployed, so I’m torn.\n\nHere’s my dilemma:\n\n* The position seems like it would give me some solid experience in a publishing environment.\n* I know pay can be pretty low in this industry, but I feel like £500/month for essentially a full-time job is taking the piss, even if it’s an internship.\n* The job **requires you to be in the office every day**, so it's not hybrid or remote.\n\nFor anyone with experience in the publishing or editorial field, is this a typical starting salary for internships, or is this just taking advantage of interns? Should I consider applying for the experience, or is this just a waste of time and effort?\n\nI’m really struggling with the decision. Would love to hear your thoughts, especially from people who’ve been in similar situations.",
    "score": 5,
    "url": "https://reddit.com/r/Journalism/comments/1k3qeb8/is_this_internship_worth_it_pay_vs_experience_with/",
    "created_at": "2025-04-20T16:28:05.000Z",
    "num_comments": 13
  }
]