[
  {
    "id": "reddit-1lnv30i",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Occupational Therapist standing up for their profession and Bernie Sanders is supporting them!",
    "text": "Bernie Sanders is standing with healthcare workers at HCA-owned Sunrise Hospital in Las Vegas!\nThey’re fighting for a fair contract and showing the power of unity!  \n\nThis is what all healthcare professionals should be doing.",
    "score": 477,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1lnv30i/occupational_therapist_standing_up_for_their/",
    "created_at": "2025-06-30T01:22:26.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1kqo559",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "I love being an OT.",
    "text": "There's a lot of negativity floating around here, some of it justified, some super exaggerated, but I want to share a different viewpoint, especially for anyone thinking about OT as a profession or struggling in their current setting.\n\nPracticing as an OT is genuinely rewarding. Every day, you have the incredible opportunity to positively and directly influence someone's life. Whether it's helping them regain their independence, assisting them in activities they deeply love and miss, or simply being there as a caring human being. The relationships you form with your clients are deeply meaningful, and every time I have one of those magical moments of my client being excited to see me, all the hard work becomes worth it.\n\nSure, by the end of the day, I'm totally and completely mentally and physically exhausted and often find myself heading to bed earlier than usual. But the important part is this: I never dread waking up in the morning to go to work. I just dread the times I have to take documentation home with me lol. I genuinely enjoy my time spent working with clients, and the days go by incredibly fast.\n\nI get why there's plenty of venting here because our field, as does any field, has its cons, and these can sometimes overshadow all the positives. However, I wanted to share my experience and reassure anyone on the fence: being an occupational therapist can be an exceptionally fulfilling career when you're pursuing it for the right reasons.",
    "score": 383,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1kqo559/i_love_being_an_ot/",
    "created_at": "2025-05-19T21:43:34.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1ms0fz7",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "What “OT advice” will you never tell your patients again after actually doing/going through it yourself?",
    "text": "I’ll go first- I will never again suggest one of my patients do laundry with a reacher. It is wildly inefficient and don’t get me started on the hand cramps 😩",
    "score": 331,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1ms0fz7/what_ot_advice_will_you_never_tell_your_patients/",
    "created_at": "2025-08-16T16:39:56.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1kdbha7",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "If your Considering becoming an OT, Read This First.",
    "text": "OT is a wonderful and rewarding profession. However, if you're considering OT school, it's crucial that you have a clear and realistic financial plan to manage your student debt. Understand exactly what you're committing to financially before diving in.\n\nHere are some practical suggestions to minimize debt:\n\nStay with family during your program if possible, or share housing expenses with roommates or a partner.\n\nOpt for an affordable master’s program rather than an expensive doctorate. Doctorate degrees usually do not lead to significantly higher salaries, despite costing substantially more.\n\nConsider completing your undergraduate degree in three years, especially if you have AP credits. This can reduce overall costs significantly.\n\nWork and save money before entering OT school, perhaps with a bachelor's degree in a related or alternative field.\n\nIf feasible, live with family after graduation to quickly reduce your student loan burden.\n\nDiscuss openly with your partner about strategies to collectively handle your loans (such as dedicating one income to loan payments for a few years).\n\nExplore less expensive routes into healthcare, such as becoming a PTA or COTA first, to greatly reduce educational expenses.\n\nThink about working in travel OT, home health, or skilled nursing facilities, which often offer better pay to help manage debts.\n\nBe aware that some states have entry-level OT positions paying as low as $28/hr (\\~$58k), and even long-term salaries may not surpass $67k in outpatient pediatric settings. On the other hand, nurse practitioners and physician assistants, requiring similar amount of education (master's degrees), typically earn significantly higher salaries, often starting above $100k.\n\nOnly choose OT if you're absolutely sure that it's the right career path for you. While OT can be deeply fulfilling, many students enter programs accruing tens of thousands in debt without a clear strategy to pay it off, causing financial strain and stress. OT salaries generally range between $60k to $70k annually in many areas, so meticulous financial planning is critical.\n\nThis advice isn't meant to deter you, but rather to ensure you're informed and confident about your decision. Ultimately, you're the best judge of your personal finances, goals, and life commitments. Make your choice thoughtfully to ensure a fulfilling and sustainable career.\n\nEdit: Glad this post could serve as a place where a lot of you can offer your own opinions, as obviously above is just my own. Its important we as therapists talk about these things to each other and show it to perspective therapists, so people can enter the profession for the right reasons. I actually love being a therapist but the pay and productivity/documentation requirements, as well as treating taking a lot out of you does make it a challenging job. \n\nFor those of you who are newer to the profession or are at times struggling just like I do here are some of the best resources. (A little bias cuz I work in Peds) \n\n  \nFor helping planing intervtions and tone of activities with my kiddos : [this ](https://www.toolstogrowot.com/)\n\nFor accessing research articles once your school's log in stops working: [this](https://www.academia.edu/) \n\nFor making documentation faster/easier: [this](http://trynonotes.com)\n\nHere to only offer my perspective and I actually think its important that if you disagree with me you should comment, so people do get a good idea mix of opinions and not my own. I hope any of this helps you. ",
    "score": 312,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1kdbha7/if_your_considering_becoming_an_ot_read_this_first/",
    "created_at": "2025-05-02T20:49:59.000Z",
    "num_comments": 127
  },
  {
    "id": "reddit-1i9ke0h",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "I was that “older” student in my OTA program. Found a card my husband gave me when I was in school nearly 10 years ago. Hang in there students!! You got this!",
    "text": "I’m so so lucky I had a support system. My heart goes out to anyone in school struggling to finish and work at the same time. ",
    "score": 263,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1i9ke0h/i_was_that_older_student_in_my_ota_program_found/",
    "created_at": "2025-01-25T10:42:51.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1lg7dhz",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "I was featured on my local news channel as an occupational therapist who works in pain management! I talked about what OTs do for pain. Just wanted to share my accomplishment here!",
    "text": "As a reminder, pain management doesn’t just belong to a certain discipline! ",
    "score": 236,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1lg7dhz/i_was_featured_on_my_local_news_channel_as_an/",
    "created_at": "2025-06-20T15:49:09.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1np40ho",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "I Hate Sensory",
    "text": "I just hate it. I work in schools and literally any bad behavior a kid has is sensory. I think parents like to think their kids have so many sensory needs to excuse their kid’s bad behaviors. There are articles proving SI theory is total BS. I am just so sick of it. I think it’s really overblown here in California compared to other states. All I can do is give your kid a wobble cushion, fidgets, chewy, noise reducing headphones, and recommend that they have movement breaks throughout their day. Wtf else am I supposed to do? ",
    "score": 220,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1np40ho/i_hate_sensory/",
    "created_at": "2025-09-24T05:31:27.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1jbgc6w",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Thank you , OTs",
    "text": "I’ve been seeing an occupational therapist for the last few months, and the change I’ve seen in my life and my body have been monumental. I was someone who had never even heard of occupational therapy before my Dr recommended I go, and wow do I wish I had learned earlier. You guys are incredible, and thank you for all you do for your patients. ",
    "score": 215,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1jbgc6w/thank_you_ots/",
    "created_at": "2025-03-14T22:33:29.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1lba6ps",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "The Stuff We Don't Learn In School, But Never Forget",
    "text": "I’ve been practicing for over 15 years now, and the longer I do this work, the more I realize how much of it happens in the messy, unspoken spaces between what we document and what we feel.\n\nLike the moment you help a daughter put lotion on her dying mother’s hands and suddenly you’re holding your own grief too.\nOr when you teach a 92-year-old how to wipe themselves after surgery and they look you in the eyes and say, “I never thought I’d need help for this.”\n\nWe document functional mobility and ADLs. But we witness loss, fear, resilience, humor, trauma, and dignity on a whole different level. We are silent witnesses to so much real life that doesn’t show up in our CEUs.\n\nI’m curious — what’s a moment in your OT journey that changed you? Not in a resume way, but in a human way.\nCould be beautiful. Could be heavy. Could be hilarious. But let’s be real about it.",
    "score": 203,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1lba6ps/the_stuff_we_dont_learn_in_school_but_never_forget/",
    "created_at": "2025-06-14T14:36:48.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1pbzcg9",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "I love my occupational therapist for my daughter",
    "text": "So my daughter’s been in OT for the past 3 weeks and she’s been doing great. Her OT is so sweet. She has speech and OT back to back on Monday’s. So I sit outside in the car while she does her 2 sessions back to back. Her speech is 30 mins and her OT is an hour long. So they called me in 10 mins early to pick her up I thought something happened. I walked in and my daughter was laid asleep across her therapist chest and it was the sweetest thing ever. She said she did good today but she was just a little grumpy &amp; fussy and she was tired. It was just the cutest thing ever. I really appreciate her speech and occupational therapists. They really understand my daughter and don’t overstimulate her and let her take breaks when needed. Seeing my daughter so comfortable with someone she just met a few weeks ago was such a positive sign to see. She has been really doing so much better after her sessions I wish I would’ve put her in therapy a lot sooner but nonetheless, I just want to say I really appreciate all the hard work you guys do. You guys are a safe and soft spot for a lot of these kids and your hard work never goes unnoticed. 🩷",
    "score": 202,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1pbzcg9/i_love_my_occupational_therapist_for_my_daughter/",
    "created_at": "2025-12-02T04:40:31.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1kw8mo9",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Drowning in documentation",
    "text": "Hi everyone! I’m a brand-new OT in an inpatient rehab unit, and it’s clear that documentation and I are in this for the long haul. Right now my evals and daily notes take forever. Because I have ADHD, trying to get notes done with the world spinning around me feels literally impossible, so I’m usually the first one in and the last one out. I’ve started reading colleagues’ notes to borrow wording for specific tasks, but I’d love any recommendations for courses or programs that could help me improve how fast I get them done.\n\n**Edit:** Thank you to everyone who's commented with suggestions! I really appreciate all the helpful advice. I'm definitely going to check out [trynonotes.com](http://trynonotes.com) that one of you recommended. It sounds like it could be exactly what I need!",
    "score": 197,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1kw8mo9/drowning_in_documentation/",
    "created_at": "2025-05-26T23:22:00.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1jntbyx",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "We need a rebrand",
    "text": "Took a course over the weekend and a PT in class said “well OTs, you’re just more function based than us.” And I agree! But it made me think about the ambiguity of what we do. I think our name, “occupational” is so silly. Besides us, in healthcare (Occupational medicine, occupational health, etc.), the word relates purely to employment. As it should. No one says “Man, my hand fracture is making my daily occupations a real bother.” But they might associate the word “function” more commonly with an ailment. I thought “functional therapy” might be a better fit. I know it would be insanely tough to implement this but sometimes a total rebrand can change the course for a business or organization. The name seems like a good start. Just a thought. ",
    "score": 192,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1jntbyx/we_need_a_rebrand/",
    "created_at": "2025-03-31T02:41:42.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1p17vbt",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "US Dept of Ed is going to deem us “non professional” now?",
    "text": "is anyone else following this? the demotion of our professional status may result in us no longer being able to access loan forgiveness (though tbf those programs are also being annihilated by the current shitty regime). what other repercussions will this have for us?\n\nhas aota made a statement on it? something tells me their lobbying efforts, if any, wont be enough. we’re going to have to mobilize, dear colleagues. \n\neta: the reclassification isn’t currently impacting pslf. however, we didn’t see this reclassification coming, so we shouldn’t be naive to think that the sleights will stop here. follow the money, honeys. who benefits financially from these changes in the long run? do you honestly think the wealth hoarding will stop soon? ",
    "score": 185,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1p17vbt/us_dept_of_ed_is_going_to_deem_us_non/",
    "created_at": "2025-11-19T13:36:24.000Z",
    "num_comments": 117
  },
  {
    "id": "reddit-1mb5wzg",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "My OT saved my life!",
    "text": "Not an OT, but I do have a OT for a dad and have lived with CP my entire life. About a month ago I started noticing that my legs were stiffer and it was harder to walk. With that came trouble getting in and out of the car, driving, getting on and off the toilet. I also had hand spasticity which I’ve never experienced in my life. I relied on my wheelchair A LOT, which was super concerning. So I get an OT referral (my OT has treated me before) and head in for my eval, my OT tells me that I need to call my doctor due to my sudden decline in mobility; and that I shouldn’t have waited to hear that from a professional. I ended up in the ER a few nights later and was put on an oral muscle relaxer and told I was just stressed from college. \n\nA few days later my baclofen pump is adjusted. Midway through that week I go in for OT, and ensure my OT knows what’s going on. My OT is very concerned that something isn’t right, but also trying not to raise my anxiety levels. Long story short: my OT was very correct! Towards the end of my session, I start feeling really really bad. My blood pressure was fine, but I felt like I was another planet. Food and water don’t help. My OT tells me to call my dad and have him take me to the ER (I drove myself to OT)\n\nAnyways I safely make it to the ER. They’re still not sure what’s up with my sudden decrease in mobility, but it turns out the oral muscle relaxer I was prescribed strongly interacts with baclofen, and we think the increased baclofen dose caused the two meds to interact. If my OT wouldn’t have been there to insist I go to the ER I probably would’ve just brushed it off as just feeling weird, and potentially gotten behind the wheel. \n\nLong story short: my baclofen interacted with a different muscle relaxer, and made me high AF in the middle of OT. My OT made me go to the ER instead of brushing it off and going on with my day. Y’all don’t get paid enough, thanks for saving my butt!! ",
    "score": 156,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1mb5wzg/my_ot_saved_my_life/",
    "created_at": "2025-07-28T03:38:55.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1nhzzrc",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "I work in acute care and I feel all I do is convince adults to get out of bed",
    "text": "I’ve been in acute for the past 4 years I love the  flexibility but man trying to convince patients and providers you’re important in the hospital is exhausting. how do yall deal with this esp when you try to find out what’s important to patients and all they want to do is walk or go home and sit in the couch ",
    "score": 155,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1nhzzrc/i_work_in_acute_care_and_i_feel_all_i_do_is/",
    "created_at": "2025-09-15T22:18:58.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1ib2dry",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Biggest regret in life picking OT?",
    "text": "I’m almost a year into being an OT in california. I feel like I made the biggest mistake in life choosing this field. I don’t want any arguing in the comments because OTs are always invalidating other peoples feelings on here and become rude if anyone speaks up. I feel like the salary amount that is listed when you look up the profession is extremely inaccurate. Differs by region/state/city. And no one talks about how you can cap out in your salary within a year. There’s no room to grow. There’s just a ceiling. Never once when I was shadowing or when I was in school was, I told that transferring very heavy human beings was a part of this field. How are transfers truly an occupation? I ended up breaking both of my wrists in fieldwork 2 and took on more than I should have. CIs treat students like absolute shit and exploit them for free labor. CIs have no training, no one holding them accountable, no checking on students to seeing they are okay. All the fieldwork evals have to be shared with CIs so you cant be honest about how bad you are treated because you want to badly pass to finish the hell that is fieldwork. Also, I feel like the career is just a sham because what do we really do? Everything? How can that be. It’s made up. There’s no real guideline. No outline. No where to get advice. People just throw out the words “imposter syndrome” to feel better about it. We are not taught to treat patients in school and fieldwork is too much too fast. It’s not a real career in my opinion. There’s no one supervising supervisors for scheduling so veteran OTs try to pick the easier cases and you get all the MAX A patients or behavior patients. There are not a lot of opportunities and job posts and if they are, the hourly rate is insanely low. It’s actually embarrassing how low it is. A lot of companies give you no benefits at all. If they do give you benefits it’s something that is almost nothing. Almost all OTs work 2-3 jobs to make a decent salary to survive. You have to live at work basically for 8+ hours a day and then take home work because you don’t have any time. We have no time to write notes, evals, conference notes, progress notes, and reports. I had a coworker who almost git divorced because their partner couldn’t handle how unavailable she was. We get double and triple booked with patients and are being honestly abused with the amount of work that we have to do on a daily basis. It’s also very unethical because patients aren’t getting the best care. I hate this field. I wish I never did it. I don’t know how to get out of it. What other career options are there? I’ve been talking to several OT’s because I work at three companies right now and almost every single person says the same thing. I have never heard an OT say they enjoy their job or they’re satisfied with their pay. Or that they don’t have any injuries and had to go on disabilities. I feel like I’m living through a nightmare I can’t wake up from.",
    "score": 152,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1ib2dry/biggest_regret_in_life_picking_ot/",
    "created_at": "2025-01-27T07:14:21.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1kneiz1",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "New grads are not to blame for decreasing salaries",
    "text": "This is a remarkably myopic read on the clusterfuck of external factors in the field of healthcare and under late capitalism at large that led to decreasing reimbursement for OT services, devaluation of our work, ballooning student debt, other professions encroaching on our admittedly amorphous scope, rampant program expansion, the abject cravenness of the insurance industry and the healthcare industrial complex, etc. \n\nWhy is the blame falling on the new clinician, who just went 6 figures into debt to \"help people\", who is accepting a shitty salary bc they aren't other options. Because if they don't accept it, someone else will. Because the alternative is to sit with your 6 figures of debt in a flooded market and do nothing. In many saturated areas, there is no negotiation. You're just lucky to get full time hours, if that. \n\nThe rhetoric that it's the individuals fault for \"not negotiations\" is toxic. ",
    "score": 141,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1kneiz1/new_grads_are_not_to_blame_for_decreasing_salaries/",
    "created_at": "2025-05-15T17:47:03.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1nmv6ez",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Frustrated with the amount of referrals I’m getting for children displaying challenging but age appropriate behaviors— I am not a parenting coach",
    "text": "Does anyone else feel like kids are referred to OT simply when the parent could just benefit from taking a parenting class? When I have cases like this, I’m so often on the fence whether to pursue tx with these kiddos, as they will often score average but the parents main complains are things like: child won’t stop hitting me, child has a meltdown when it’s time to leave the park, child has a meltdown when I won’t buy them candy from the store, child won’t stop climbing on furniture, child doesn’t like to take medicine when sick, etc… I have been told these complaints are occupation based, therefore in our wheelhouse. But at what point do you draw the line? I do often see progress with kids like this if parents are willing to carry over strategies. Then on the other end of the spectrum, I have many parents wanting me to fix their child’s behavior in their session, which is super frustrating. I don’t mind addressing behaviors if the child has delays/complex needs. But with kids that have no delays other than just being strong willed,  I feel like I’m just being a parenting coach rather than a therapist. I just feel like I’m letting parents down if I don’t pursue treatment with their child, can anyone relate? ",
    "score": 136,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1nmv6ez/frustrated_with_the_amount_of_referrals_im/",
    "created_at": "2025-09-21T15:38:07.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1p2f1pp",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "“Update 9 Months Later: I Passed After 8 Attempts — Here’s What Finally Worked”",
    "text": "**Follow-up:**  \nHi everyone, I’m back — and I am so grateful to finally say this: **I passed.** Yes… after **8 attempts**, I made it. I’m still in shock even typing those words. If you’re reading this and you’re struggling, please know this: it *can* happen for you too.\n\nI want to share honestly what changed for me this time, because this journey almost broke me — but it also rebuilt me.\n\nAfter my seventh attempt, I took **five weeks completely off** to reset mentally. I felt drained, discouraged, and honestly embarrassed. I even worked with two different private tutors, but both of them kept promoting extra materials I “needed” to buy — even while charging $200 per session. And one of them said something that really stuck with me:  \nshe told me I should *reconsider*, that maybe I should just give up.\n\nHearing that hurt. But instead of letting it defeat me, something in me refused to stop trying.\n\nI completely shifted my mindset. I started going to the **gym**, praying more, and listening to **affirmation videos every day**. I also reflected on what had worked for me in the past when I scored my highest (449 and 447). The common factor? **AOTA.** So I went back to it.\n\nFour weeks before my exam, I bought the **AOTA study pack**, and later postponed my test another two weeks so I could fully prepare. During that time, I scheduled **seven full practice exams** across NBCOT, AOTA, Theraped, and TrueLearn. I also spent hours with the **450 Formula**.\n\nFor the first time ever, I also used **Anki** for active recall. Every night before bed, I reviewed my cards. I even practiced by teaching my husband and my best friend — which surprisingly helped me learn even more.\n\nAnother huge game-changer: I took **every practice test at the exact same testing center** where I planned to take the real exam. Over time, my mind got used to the environment. By the time test day arrived, walking into the center felt familiar and calm instead of terrifying.\n\nThere were still moments during practice when I panicked or didn’t understand a question, but pushing through those moments built my confidence.\n\nAnd finally… it all came together.  \nI passed.  \nAnd I am truly, deeply **proud of myself** for not giving up — even when someone told me I should reconsider and maybe stop trying.\n\nIf you’re still on your journey, please hear this from someone who felt behind in life, cried, doubted, and tried again anyway: **You are not alone. You are not failing. You are becoming stronger than you realize. Don’t give up.**",
    "score": 133,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1p2f1pp/update_9_months_later_i_passed_after_8_attempts/",
    "created_at": "2025-11-20T21:03:47.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1luerdy",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Protect Evidence Based Care- Say No to a Chiro program at Pitt",
    "text": "Hi everyone, I’m a physical therapist and I’m reaching out to my colleagues in occupational therapy because we’re all in this together when it comes to protecting the integrity of our professions and the care we provide.\n\nThe University of Pittsburgh is launching a Doctor of Chiropractic (DC) program — and while it’s being framed as an academic expansion, many of us in allied health are deeply concerned.\n\nEven if Pitt’s program meets high academic standards, nothing stops graduates from accessing CEUs that are still widely approved in most states and promote:\n\nSpinal manipulation for infants\n\n“Energy detox” and quantum healing\n\nSubluxation theory — a concept long debunked but still taught\n\nAnti-vaccine rhetoric\n\nThis isn’t about inter-professional rivalry. It’s about the risk of giving academic legitimacy to pseudoscientific practices that could undermine patient safety, public trust, and the credibility of all science-based rehab fields.\n\nWe’ve seen this before, medicine drew a line against homeopathy, refusing to validate it academically because it couldn’t meet scientific standards. I believe we need to do the same here.\n\nIf you’re an OT who values evidence-based care, I’d love your support. Please consider signing this petition or helping amplify it across your networks.\n\nThanks so much for reading — and for all you do.\n\nSincerely, A PT who deeply respects your role in the rehab world 🧡\n",
    "score": 130,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1luerdy/protect_evidence_based_care_say_no_to_a_chiro/",
    "created_at": "2025-07-08T03:46:11.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1l60oyn",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Is therapeutic use of self not really a thing anymore?",
    "text": "Granted, I got my OTA degree back in the middle ages (LOL I'm in my 34th year), and it was something that was heavily emphasized when I was in school. I'm noticing many of the newish grads seem to be missing this piece. I'm not talking about brand new grads; it's hard enough putting all the technical pieces into place once actually in the field, much less how to put yourself into the equation so I figure they need some time to figure it out. I mean folks who have been working for a few years and should be past most of that. \n\nCurrently I work with toddlers in a half day program; 1 1/2 - 3 yrs old. While I don't get on the floor as much as I used to with them (my knees say no!), I'm active in, and acknowledge everything they do. Get onto a piece of equipment they've been afraid of - Whoa! You did it! Upset and crying - Are you sad? or You seem frustrated, let's try it this way. Putting coins into a slot - Hey, can I have a turn? You DON'T want to put doins in a slot? - Ok, let's clean them up and we'll do something else (cleaning up means putting the coins into the slot so we can put that activity away LOL). I whoop, I laugh, I sigh, I get exasperated and demonstrate it physically as well as vocally.  \n\nAnd I'm noticing most of my coworkers are really removed from their therapy sessions. They do to, not with. There's very little give and take, or even acknowledgement. If a kid is upset and crying, I often hear them say \"You're ok,\" which in my head is SO dismissive. If a kid has a lot of ya-yas to get out, instead of going with the kid's need, it's \"no, we're sitting in the chair right now.\" \n\nThis really hit home for me yesterday. One of my patients, a non-verbal, autistic toddler, has a hard time with transitions. To \"school\", to leaving the classroom, to leaving mom, to go to get his diaper changed, etc, etc and each transition is accompanied by a meltdown. For the past 2 months my main priority is just getting on his level and connecting with him. When I went to pick him up from his mom this time, he saw me, walked right to me and grabbed my hand. His mom was astounded. And I was thrilled - now that we've established that level of trust, I can start gently guiding him to things that challenge him. To me, having that connection is just as important a piece of therapy as fine and gross motor skills. \n\nBut it often seems like I'm the only one who feels that way. Has the OT curriculum changed that much? ",
    "score": 130,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1l60oyn/is_therapeutic_use_of_self_not_really_a_thing/",
    "created_at": "2025-06-08T01:38:22.000Z",
    "num_comments": 73
  },
  {
    "id": "reddit-1jmon6t",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "How I've Changed as a CI",
    "text": "8th year OT here. Current school-based OT but also have a background in psych. Like many other OTs, I've had issues with declining quality in FW2 students which has caused a lot of stress &amp; time as a CI. Main issues are professionalism, very poor communication skills (with me, with the students, w/ staff), and limited clinical reasoning skills. I've made serious changes in my approach (using the following tips for my last 2 students; I've had 6 total) and seen a positive change. I wanted to share this with others.\n\nFeel free to share any strategies you've implemented as a CI that seems to have made a positive impact on the trajectory of the student's FW experience.\n\n**BEFORE THEY BEGIN FIELDWORK:**\n\n* Provide a pre-fieldwork form for the student to fill out. I use google forms. It's brief. I ask what their background is with working with kids, what they are most nervous about, what they hope to learn about, and what their 3 best qualities are\n* Have a zoom or phone call prior to them coming (and after they fill out the form), to connect and get to know them. I obviously go over any questions they might have, but also ask about their personal interests, etc. Be warm. Students have told me this helps ease anxiety.\n* Follow up with a document of professional expectations and site expectations. **Don't assume anything is common sense**.\n   * I include hours, that they should expect to do some work outside of fieldwork hours, phone/technology use (only should be used during the 30 minute lunch), dress code, etc.\n   * This has SIGNIFCANTLY helped me reduce the amount of issues I've had with professionalism (soooo many students wearing inappropriate clothing or always on phone). When it outlined for them, it's something you can reference back to. Teaching professionlism during FW is seriously taking time from teaching clinical skills, so if you can avoid it by setting the expectations up front, it will help you and the student in the longrun\n   * I also include that if they have more than 2 absences, they may have to make it up after the 12 weeks if they aren't showing entry level skills to pass the final. This is my own rule.\n\n**DURING FIELDWORK:**\n\n* For every week for at least the first 6 weeks, require the student to fill out a reflection form. I use google forms. I include questions like \"what did you most enjoy, what is one thing that was difficult for you, how did you feel about XXX meeting, what traits do you think are important for an OT to have when presenting in meetings, what do you need more support in, etc\". I provide a lot of face-to-face check-ins and meetings, but I find so many students don't open up, and I get more info with these forms\n* Give them tests. I created a 10 question quiz for each school-based evaluation tool (ie- Beery, SPM-2, SP-2, DVTP, TVPS, THS, SFA)  to make sure they were actually looking through the manual and understanding scoring, basal/ceilings, etc. It is an open book test (again I use google forms) so it's nothing that they can't find in the manual, but requires them to actually do it. I probably had them do 2 a week until they got through them all\n   * If you work in a different setting with less evaluations, you could make quizzes for other things that are more relevant. For example, if you work inpatient neuro unit, you could make a quiz on working with TBI patients, working with SCI patients, etc.\n   * If you work inpatient mental health, you could make quizzes on scenarios of how to redirect certain things that might happen in group (what to do if a patient starts screaming profanities, if a patient starts engaging in self-harm, in 2 patients start to get in a heated argument, etc).\n* Give them projects and have them present it. I assign 2 projects.\n   * The first one is just any evidence-based article that has to do with the school system, and what OTs could take from it. They present it virtually to all OTs in the district\n   * The second is a case study- they pick a student (usually after about week 8) and tie with any FOR, and how we can use the FOR to support the student. They present it to the school team, in person.\n   * The FW student has past projects from previous students to reference\n* If you have ANY concerns, address it immediately. Don't let it build up. When you confront the student about it, frame it like you want to find a solution together.\n* If applicable, teach them your organizational strategy from week 1. I give my student a weekly planner (same as mine) and show them how I organize my workload for the week. I have them pencil in our therapy sessions and tell them when we will be taking a student to test, have an IEP meeting, etc. When they are actively engaged in the scheduling, even if it is just writing down what you are telling them, they feel more prepared.\n* If there' any downtime, always have something for them to be doing. For example, my student is in her last 2 weeks and we are at a lull for evaluations, so there is some downtime when I am at duties. I'm having her participate in webinars on [occupationaltherapy.com](http://occupationaltherapy.com) on trauma informed approach, or she's reading my copy of \"no drama discipline\" to grow her behavior management skills.\n\nAll of these strategies took a lot of time in the beginning (such as creating all of the quizzes), but now that I have them, it's actually saving me time. The student is taking more accountability for their own learning. I find that they all enjoy the structure and leave the fieldwork feeling like they learned a tremendous amount. I've felt very confident in their entry level skills for school-based OT, but also feel like I've given them a good foundation of how to enter the working world. ",
    "score": 125,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1jmon6t/how_ive_changed_as_a_ci/",
    "created_at": "2025-03-29T15:22:30.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1hun5ak",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "I did it!!",
    "text": "I got into my state program for MSOT and it will be fully covered. I am so excited, I am nervous to move for the program. I was also accepted into several doctorate programs, but I am going with the fully funded state masters program- am I making a mistake?  \nEdit: for everyone asking, my state has a program for family members of disabled veterans, so I was able to get my program funded for (this only applies for state masters programs, not doctorates as it is considered as extra education that isnt required for the career path) Thank you so much for the support everybody! I can’t wait to become an OT!💗",
    "score": 121,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1hun5ak/i_did_it/",
    "created_at": "2025-01-06T01:23:25.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1lwi2oh",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Students asking for help",
    "text": "I recently recieved a DM from an Occupational Therapy student. The message contained only a question about treatment protocols, they did not introduce themselves, they did not let me know that they were a student (I had to ask), and gave no indication that they had tried to find the answer to this question on their own. \n\nI know there are a lot of OT students in this sub and I also know that practicing therapists are generally happy to help (myself included). Please remember to apply basic professional practices when reaching out for assistance, and be prepared to explain what you already know and where you're getting stuck! Even if you're totally stuck and just need some help taking through the process.The person who messaged me did not reply after it became clear I was not simply going to supply the answer. \n\nLearning how to find these answers and use your clinical reasoning skills is going to be imperative to being a good therapist. We are more than happy to help guide you by asking questions that will lead you in the direction of the answer, but please don't expect us just to hand out homework help answers, and please learn how to compose a more professorial message. ",
    "score": 119,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1lwi2oh/students_asking_for_help/",
    "created_at": "2025-07-10T17:04:36.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1idrfpg",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "What’s the point???",
    "text": "Sometimes I really wonder if all the training, reading and CEUs I've done on certain topics was a complete waste of time.\n\nI sat through an IEP and a parent explained that it upsets her that her child stims 🙄.\n\nNothing violent or aggressive, he doesn't break anything or harm anyone (I asked). She says he only throws a tantrum when she tells him to stop.\n\nI tried my hardest to kindly explain to her that stimming is appropriate and healthy, especially for autistic kiddos (he is in KINDERGARTEN for God's sake) but she \"wants her boy to be normal.\" \n\nBtw his stims are shaking paper and flipping empty water bottles. As she's explaining it it took everything in me not to yell \"WHAT'S WRONG WITH THAT?????\"\n\nNo one on the team backed me up, they actually shut down everything I was saying. Because what would an OT know about stimming or sensory behaviors? I'm clearly way out of my league (🙄🙄🙄)\n\nSo F neurodivergent informed practice. I guess it doesn't matter. Ugh. I tried.",
    "score": 117,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1idrfpg/whats_the_point/",
    "created_at": "2025-01-30T16:53:04.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1jnesxd",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "OT month is dumb",
    "text": "I know not all may agree, but what on earth has having a whole month dedicated to our profession gotten us?\n\nPeople have token parties and go “yay OT” and that’s pretty much it. Rarely does it lead to increased influence, power, referrals, even actual understanding of what we do beyond the classic tropes. And please pray for me if someone asks me to take on more work with nothing in return to help go through this song and dance that does absolutely nothing.\n\nI feel like we need actual advocacy in OT month and not just the standard BS.",
    "score": 111,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1jnesxd/ot_month_is_dumb/",
    "created_at": "2025-03-30T15:24:24.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1kgtlei",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "What professions have OTs successfully transitioned to? Feeling stuck",
    "text": "I am utterly disheartened by the lack of advancement, opportunity and stagnation that is occurring in the field of occupational therapy. I am seeking an exit to greener pastures to find a profession that offers social mobility, career advancement and fair compensation for efforts rendered. I find that the majority of companies I have worked for or interacted with (this is only getting worse with recent macro and geo political trends) aim to pay as little as possible and suck as much profit out of clinicians as possible (productivity police) while other professions such as nursing have an abundance of opportunities with much higher compensation (where’s the OT union at y’all?). I come to Reddit looking for hope as a present OT seeking an exit out of this melting career path which in my humble opinion is over sold by academia and top job lists designed to take your money and spit you out with a degree that will barely earn you enough to support a family without relying on an additional part to full time salary as a masters or doctorate level clinician. Not to mention you face a 0-3% wage increase at most companies you will work at for the remainder of your career requiring you to job hop annually to keep up with inflation until your wage tops out at 40-50 bones per HR. I love working with my patients and helping them achieve their goals but the typical 60-80k salary per year compensation for most OTs is laughable compared to the investment required and I would tell anyone to avoid this field on the ROI alone unless it is your dream and/or you are independently wealthy without requiring student loans or debt. I apologize for the negative tone of my post but I am utterly disappointed in the field of OT and am looking for any glimmer of hope one may have to offer regarding finding the light out of this very dark tunnel. Thank you. ",
    "score": 75,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1kgtlei/what_professions_have_ots_successfully/",
    "created_at": "2025-05-07T10:02:38.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1hnhmpi",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Let's share our loans, program (B.S./MOT/OTD) and when we graduated for the greater good.",
    "text": "We have OT Salary, time to get some OT Loans data up in this subreddit. I'll start:\n\n\nLoan total: 80K, Masters at TWU 2016.\nActual program was 40K but needed 40K for 3 years  living expenses. ",
    "score": 48,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1hnhmpi/lets_share_our_loans_program_bsmototd_and_when_we/",
    "created_at": "2024-12-27T15:44:50.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1id6k5g",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Salary discrepancies between OT/PT/SLP",
    "text": "I currently work in an acute care setting and we recently brought it to our administrations attention that the OTs are at a lower pay grade than our department coworkers (PT and SLP - both are at the same pay grade). I can see how PT would be higher because of the on going issues nationwide, but now SLP as well. We were informed that we are having a meeting next week with HR so they can explain the reasoning (our lesser value to the company) to us. I was wondering what other facilities pay comparisons between disciplines are like, the value of OT compared to other disciplines within a company and their own department, and how this should be approached! ",
    "score": 42,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1id6k5g/salary_discrepancies_between_otptslp/",
    "created_at": "2025-01-29T22:27:23.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1ntcr7r",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "OTs on here that regret their career choice.",
    "text": "I’ve noticed a lot of negativity surrounding the OT profession — from pay concerns and imposter syndrome to work-life balance struggles, burnout, and even Medicaid cuts. I’m genuinely interested in OT, but I’d be lying if I said all of this hasn’t made me second-guess things.\n\nFor those of you in the field, are there other factors that contribute to the frustration? Do you personally carry a lot of student debt? What’s your hourly or annual salary?How long have you been practicing? What did you expect from Occupational therapy?What state are you in, and how frugal is your lifestyle?\n\nFor context: I’m a single mom to an 8-month-old, and I’m really focused on turning our lives around. Right now, I’m completing my associate’s in Communication Disorders (SLPA track). My plan is to move on to my bachelor’s, then work as an SLPA while saving for grad school. I’m in California, and I’ve found a program for about $30k — my goal is to avoid debt entirely.\n\nI’d love to hear some real experiences. Is anyone here genuinely content with their OT career? If not, and you had the chance to start over, what would you do differently?Any input is greatly appreciated!",
    "score": 41,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1ntcr7r/ots_on_here_that_regret_their_career_choice/",
    "created_at": "2025-09-29T08:38:46.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1o8m9c2",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Sorry to be a downer",
    "text": "I am working for an agency that contracts with schools on long island. For a while it was great, they were one of the rare companies to offer a salary (40 hours a week) to be paid for indirect and direct treatment sessions. The company is owned by a larger rehab company. The larger rehab company no longer wants to pay us for indirect work. Basically we would only be paid 30 hours a week. Only choice is to go back to 1099. I hated 1099, the pay was never consistent and i needed health insurance. \n\nI know i am beating a dead horse, but I hate that in order to make a wage that is somewhat doable in the OT field, especially for long island, you have to work yourself to the bone. I already have back to back sessions each day, work with some of the lowest functioning students in the school, and bring home so much work to do for notes, evals, reports, emails, prep for sessions. I am lucky if I get to use the bathroom during the day.\n\nI feel like this is the same for most settings in this field. I just can’t do it anymore. I want the security of a salary regardless of how you work every minute of your day. I’m so tired each day and it’s still not enough. \n\nAnd no one truly cares. Not insurance, not these companies. They need to make money and don’t care that actual humans are on the other end of it trying to do all they can.\n\nWith that said, I have no idea what to do. I need to look elsewhere, but i’m a terrified. All i’ve done since graduating is school based ot. But i want out of the field.  I need a change in life. I don’t know where to begin. This has been my life for 10 years since starting prerequisites for grad school.",
    "score": 34,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1o8m9c2/sorry_to_be_a_downer/",
    "created_at": "2025-10-16T23:53:42.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1m2j9rw",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Founder of OT Potential here! AMA anything about occupational therapy (from AI to CPT codes—let’s go!",
    "text": "https://preview.redd.it/03fiadnh0idf1.jpg?width=2000&amp;format=pjpg&amp;auto=webp&amp;s=ebd08195874af96087bba02635087dd1375ec532\n\nHi, I’m Sarah Lyon, OTR/L, founder of OT Potential. I graduated from the NYU OT program in 2011, and worked clinically for 5 years before fully devoting my time to OT continuing education and clinical decision support. \n\nThis means it’s essentially my full-time job to keep up with OT industry trends and best practices—and figure out how to translate this all to help you at the point of service. \n\nI’ve done in-depth interviews with 100s of the most influential OTs over the last 5 years. The takeaways from these interviews are constantly rolling around in my brain, and I marvel at the interconnectedness of it all! \n\nAMA anything about OT! From salaries to specializations to sleep, I’ve covered it all! \n\nI will be answering questions from 2-4pm CST this Friday, July 17th. Ask me anything here before or live on Friday and I’ll answer during the AMA!\n\n&gt;Phew! What a big 2 hours! Thank you all for sharing what was on your mind. It was so helpful for me to hear your thoughts/questions, and I will continue to ponder them.\n&gt;\n&gt;- Sarah Lyon\n&gt;[OT Potential ](https://otpotential.com/)",
    "score": 32,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1m2j9rw/founder_of_ot_potential_here_ama_anything_about/",
    "created_at": "2025-07-17T21:02:17.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1o6u47r",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Tell me what job you took if you left OT",
    "text": "Getting pretty close to the end of my rope with OT lately and looking for alternative options. I’ve been working in a SNF for 5 years and love the patient population but just can’t handle the ethical issues brought on by both my rehab company and the facility. Sessions are pretty much all 20-23 minutes (time mandated by my company so we can treat more patients without them having to pay us much) and 88% productivity trying to help sub acute rehab patients get better and get home just isn’t sustainable for me anymore. \nLooking into ATP certification to try to transition to an ATP role, but I know there’s positive and negative aspects of this role as well. \nSo if you left OT, what job did you take, and how much of a change in salary did you have with it?",
    "score": 31,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1o6u47r/tell_me_what_job_you_took_if_you_left_ot/",
    "created_at": "2025-10-14T22:38:40.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1kwx7gm",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Does OT salary basically cap out at $100,000/year?",
    "text": "Hello all. Was wondering if anyone could share their experience with breaking the $100,000 salary ceiling of earning as an OTR? I really only know of DORs making this much or working for the VA. And many OTs I know with more than 5 years experience seem to never really make more than this amount. Are there other areas of healthcare OTs can move into to make more money, especially considering how much debt we accrue? \n\nEdit: I stand corrected, thank you to all the replies!! I hope this post serves as a motivating resource to OTs everywhere. What I've learned from you all is if you are willing to relocate and specialize, it is possible to break through this income ceiling. 👊",
    "score": 30,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1kwx7gm/does_ot_salary_basically_cap_out_at_100000year/",
    "created_at": "2025-05-27T20:01:29.000Z",
    "num_comments": 126
  },
  {
    "id": "reddit-1nlt082",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Is it normal to work so many hours outside of work in outpatient peds?!",
    "text": "I recently switched into outpatient pediatrics (not early intervention, so all ages) because I thought it would give me more of a work-life balance… but honestly, I think I made it worse lol. I'm full-time, salaried btw.\n\nI feel like I’m spending HOURS outside of my actual workday catching up on documentation, treatment planning, emails, and just keeping my head above water. It’s starting to feel unsustainable, and I can’t tell if this is just the “norm” in outpatient peds or if I’m doing something wrong.\n\nFor those of you working in outpatient:\n- Do you also find yourself putting in lot lf unpaid time outside your scheduled hours? If do, are you still doing this as a seasoned OT in this setting?\n\n- Have you found strategies to manage the workload or set better boundaries?\n\nI feel kind of crazy right now, so would love to hear if this is just how it is… or if there’s light at the end of the tunnel.\n",
    "score": 28,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1nlt082/is_it_normal_to_work_so_many_hours_outside_of/",
    "created_at": "2025-09-20T08:44:15.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1n55n2i",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Mid-Life switch to OT, panicking about grad school $",
    "text": "Hey folks, I am just seeking some more opinions and input before I go past the point of no return towards grad school for Occupational Therapy.\n\nI am 45 years old in the US and want to transition to OT for the last half of my career. I'm pretty sure. Mostly sure. Kinda sure. It's the astronomical price of grad school is really hard for me to get past. \n\nHow am I going to pay for a $100,000 degree at this point in my life? Will my increased salary over the next 15 or 20 years even make up the difference? *Is there more to life than just the balance of debt you carry? WillI have to work until I die? Why do I even live in the US doom spiral ...*\n\nThose of you later in your OT careers, do you have any advice or suggestions? What OT employment can I expect to enjoy when my body and brain are closer to retirement age?\n\nThose of you who didn't just take out $100,000 in loans for your degree, how did you do it?\n\nThose of you who manage to not spiral into desperation several times a day, what's your secret?\n\nIs OT even worth pursuing? I've read your cranky pants rants on this sub. Talk me out of it, but please talk me into something else.\n\nVery many details below if you care enough to read my life story. Thank you so much for any time you're willing to spend on this with me!\n\n\n\nMy current work:\n\nI've been working as a paraeducator in schools for the past 15 years. It's been a fun &amp; fulfilling hobby job, but the money I make is insufficient. I reached the end of the pay scale years ago and there is no opportunity for advancement.\n\nI need a career that will allow me to save for retirement and that I can support myself with if something happens to my partner.\n\nAs I get older and accrue more and more experience, I am having a harder time being \"just an assistant\", and it is painful to watch new therapists every year struggle to work with the students I know very well. I know I could do their job.\n\n\n\nI don't want to be a classroom teacher:\n\nJust NO. Merely thinking about it gives me stress hives. This is unfortunate because I could obtain a fully sponsored Masters degree in teaching in an easy year. Even though this route would get me the pay I want with no debt in a short amount of time, I know I don't want the job.\n\nI do wonder what doors could open if I tacked on a specialty teaching endorsement? The only one I know of is Teacher of the Visually Impaired (TVI), which in my district is an itinerant specialist who works with individual students like a therapist. I like that idea very much. Then I get panicky about being completely dependent on our crumbling public school system to take care of me the rest of my life. *What about when public schools get completely privatized and my pension disappears doom spiral ...* \n\nBut all that aside, do you know of some other sweet loophole in the school system for teacher-like pay without managing a classroom that I am missing?\n\n\n\nCOTA feels like going backwards:\n\nOccupational Therapy Assistants in my area do not make more money than I do in my current para position according to my research, and I feel like I'm getting too old and opinionated to keep acting as an appropriately humble assistant. It would free me from the confines of the school system though.\n\nCOTA would be a less expensive path to get me going in the direction of OT, but becoming a Registered OT from there would be both slow and costly. If I was younger, sure, I'd do this. COTA to OTR bridge programs are just as expensive as entry level graduate OTR programs according to my research. \n\nIs there something wonderful about COTA as a career in itself that I am misunderstanding or underestimating? \n\n\n\nMy grad school options are limited:\n\nI am not going to move to a new city or state. I want to get school over with as soon as possible and start making a higher salary.\n\n1. There is one Public University near me that is transitioning its MOT program to OTD. They haven't announced tuition yet, but if the MOT is $65,000 we know the OTD program will cost more. I expect it will be a 3 year full time program. That means 3 years where I make no significant income. It's a bummer, but bound to be the cheapest option out of pocket. I however know better than to lay all my plans on expecting to be accepted to one specific school.\n2. There is one Private University that costs $150,000 for their 2 &amp; 1/2 year MOT or a little bit more time and money for a DOT. This is both a long time and outrageously expensive.\n3. There are several schools awaiting accreditation for their 2 year Hybrid Accelerated DOT programs that I can conceive of traveling to a few times a term. I like the idea of getting this all over with in 2 intense years, and doing my work from home most of the time. These schools will cost $100,000-$115,000 but if I can finish school in 2 years instead of 3 then I can enter the workforce a year sooner and start earning again.\n\nHow on earth do people pay for this??? This is crazy!!! *Or is it fine to just assume outrageous debt because money as a concept is losing all meaning and if humans even exist 15 years from now we will all just live on boats doom spiral ...*\n\nShould I just be a nurse? Or an electrician? Neither of these are especially appealing except for their job flexibility and income potential. Tell me your thoughts!\n\nThanks for reading my manifesto.",
    "score": 27,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1n55n2i/midlife_switch_to_ot_panicking_about_grad_school/",
    "created_at": "2025-08-31T20:47:09.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1kx40c6",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "If youre a hospital OT please list your salary/hourly + benefits",
    "text": "Hi! Ive been offered an exciting position at a hospital but im extremely disappointed in the pay for the position and im just wanting to compare- i live in NJ high cost of living. I know they go by the tier system-im 7 years OT \n",
    "score": 26,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1kx40c6/if_youre_a_hospital_ot_please_list_your/",
    "created_at": "2025-05-28T00:55:56.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1pq6m3q",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "What is a realistic salary?",
    "text": "I’ve graduated recently and the salaries are all over the place. I’ve seen 45-110 an hour and base salaries ranging from 80k (peds) to 155k (school based). I have classmates that are working for 60-70 an hour with the 70 an hour saying 200k isn’t impossible after a few years and being efficient. I have a lot of student loans after going from bachelors to OTD so I definitely am looking for 100k minimum which in SoCal isn’t too hard to find from what I’m seeing. Any info would be appreciated thanks! ",
    "score": 25,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1pq6m3q/what_is_a_realistic_salary/",
    "created_at": "2025-12-19T00:10:59.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1p60h3f",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Overly saturated market",
    "text": "For reference, OTR/L with 12 years experience, make $43/hour at my full time job and between $50-55/hr PRN in SNF/LTC. I live in the Midwest, USA. The market where I live is saturated with OTs. Our town of 500,000 has four private colleges popping out at least 240 new grads yearly. Job hunting is bleak. Hospital and pediatrics pay horrible. It’s hard to get in the door somewhere and once you do, raises in pay are few and far between. I like what I do but need to financially get ahead, mainly payoff student loan and medical debt. I would like to move to a LCOL area with a higher rate of pay. However, my husband needs to stay close to his aging mother. I like to dream about other places knowing that we will eventually move. In the meantime, I am considering travel therapy to pay off some debt and have some adventure. Please feel free to give me advice, tell me about the job market in your area and also pay/salary info (if you feel comfortable). ",
    "score": 25,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1p60h3f/overly_saturated_market/",
    "created_at": "2025-11-25T02:15:26.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1mv7k40",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Becoming a Therapist",
    "text": "I am currently an OT student. While reading this subreddit, I can see a lot of OTs that are burned out, complaints about their salary etc, so I am kind of let down by all of this. What alternative careers can I pursue with an OT degree that have better work-life balance and better salary? (That don’t necessarily involve OT, but use it as a stepping stone to advance) Can I become a therapist? ",
    "score": 22,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1mv7k40/becoming_a_therapist/",
    "created_at": "2025-08-20T06:53:51.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1i25imw",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Are OT salaries too good to be true?",
    "text": "I've been in education in various capacities for many years and want to earn more than I have so far. Occupational therapy is one option that I have thought about and looked into... wages seem, on the low end, to be 60K/yr, with numbers more like 80K being more standard. Bureau of Labor Statistics also describes a really positive outlook- median pay of 96K yr, 11% annual growth in job openings projected for the next several years, which sounds amazing...  \n...Does this ring true with everyone? Or is there, as someone recently posted, a flood of new grads competing for positions?  \nAnd while I'm at it, does knowing another language (I know Spanish, French and Russian) help earning power in this field?  \nADDENDUM: I'm in Cincinnati, Ohio.",
    "score": 22,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1i25imw/are_ot_salaries_too_good_to_be_true/",
    "created_at": "2025-01-15T19:27:12.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1i4z4tz",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "What's it like when you have your own children?",
    "text": "I'm a new grad, and I'm trying to plan ahead like most of us want to map out our lifestyles: ideal setting, decent salary, work and life balance. These are several questions for parents with children; Considering you all have clients/patients, does your job setting allow you to step away when you get a call to 'pick up your sick child' or 'something happened in school, come quick'? what is it like to have your child in a daycare? Or where do you have them throughout the day if they're not in school? \n\nI live in TX, and there is a lot of demand for Home Health setting, which I would not mind if that's what it takes for me to get my foot out the door, but I want to be flexible for my 10month old. She has her dad, and I know his job is more lenient when it comes to stepping out for personal matters. But do I? Would I? As a mom, you try so hard to be there for your babies when they need it most. If anyone has any experience or life lessons, I'm all ears 💖",
    "score": 21,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1i4z4tz/whats_it_like_when_you_have_your_own_children/",
    "created_at": "2025-01-19T14:04:41.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1o939ri",
    "subreddit": "OccupationalTherapy",
    "soc_codes": [
      "29-1122"
    ],
    "title": "Anyone ever left OT for a non-OT salaried position that pays significantly less and become happier?",
    "text": "EDIT: Role is full remote.\n\nI have a chance to take on a new role and although excited, am not thrilled with the pay. It would be \\~60k/year with basic benefits (PTO days, health/vision/dental insurance). I guess with any change though a pay cut may be expected, but also a little sad given it sometimes feels like I'm going backwards with pay. Anyone else gone through something like this? Just want to find something better suited for me, less physically intensive, a better work-life balance while still applying my skills, and change is scary.",
    "score": 20,
    "url": "https://reddit.com/r/OccupationalTherapy/comments/1o939ri/anyone_ever_left_ot_for_a_nonot_salaried_position/",
    "created_at": "2025-10-17T14:45:43.000Z",
    "num_comments": 12
  }
]