[
  {
    "id": "reddit-1i8ir4m",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "What you learn in optometry school",
    "text": "I’m a fourth-year OD student 4 months away from graduation.  I thought it would be funny to see the total amount of stuff I’ve studied over the last 4 years.  \n(NOT PICTURED is my iPad with 39gb of PowerPoints, lecture notes, homework, and endless number of digital textbooks and lab manuals.)\n\n\n\nI decided to do this after seeing ignorant people in the Noctor subreddit saying that optometrists only learn about “glasses and contacts” and supposedly don’t study disease. \n\n\n\n",
    "score": 348,
    "url": "https://reddit.com/r/optometry/comments/1i8ir4m/what_you_learn_in_optometry_school/",
    "created_at": "2025-01-24T00:34:49.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1jbjlq3",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Retina detachment first hand experience",
    "text": "I’m an illustrator from Adelaide South Australia and a week ago my retina began to detach, I also had multiple tears in the retina so I’m presuming it was different from the usual curtain imagery I’ve heard before.\n\nJust a few notes:\n\n- This is from memory and drawn into Procreate so I wouldn’t say it’s scientifically accurate.\n- I wear a sclera contact lens in that eye so initially thought the chunk of debris was inside of that.\n- I took the contact out at about 3:00pm, and placed it back in at 4:00pm, initially I thought it was an air bubble in the lens so took it out again and noticed it was still there. \n- I eventually had a vitrectomy and they used cryo to reattached the tears. Currently keeping my face pointed down for ten days and that is the most incredibly painful and uncomfortable experience I think I’ve ever been through.\n\nAlso the brown gunk I saw wasn’t blood apparently. Would love to know if any ophthalmologists could shed some light on this?",
    "score": 329,
    "url": "https://reddit.com/r/optometry/comments/1jbjlq3/retina_detachment_first_hand_experience/",
    "created_at": "2025-03-15T01:09:11.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1l56aij",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Warby Parker eye exams, how are these even legal?",
    "text": "I usually go to a legit Optometrist to get my eyes done, but the guy I went to since I was a kid retired. So I needed a new contact script, so I'd thought I'd go to the Warby Parker store in Charlottesville, Va. A kid right out of high school conducted all the medical tests in such a poor and clumsy manner. By the end of the exam the guy lost my right contact which they didn't have a replacement for until I talked to the manager, they replaced my day and night contacts with crappy once a day contacts. I talked to the actual doctor for 5 min, and he was clearly just rolling through Tele patients all day. I could tell the doctor was not happy with the people working there. In the end, they couldn't even give me a vision prescription because the system was down, so I just left. The customer service was bad, but that's not why I'm here. How do we prevent this \"fast food\" style of healthcare? Vision should be taken way more seriously. We need to make it a requirement you have to go to an actual doctor and that tests like this should only be performed by a medical professional like a nurse or mabe just someone with a certification not some kid who hasnt been properly trained. I will be going to a real doctor from now on, but I truly believe this sort of healthcare practice should not become mainstream.",
    "score": 142,
    "url": "https://reddit.com/r/optometry/comments/1l56aij/warby_parker_eye_exams_how_are_these_even_legal/",
    "created_at": "2025-06-06T23:09:56.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1lutxn4",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Big Beautiful Bill and Optometry",
    "text": "Let’s not shy away from this topic - as this impacts all of us. This week OD’s in finance sent out a mass email about how much this bill benefits high income earning optometrists in the profession and how great it is! \n\nWith a very brief mention on the “cons” associated with this bill. \n\nHow disingenuous to support a bill that cuts benefits to the most vulnerable parts of the population. Because we all did this career because we wanted to make money right! Not all optometrists are high earning, and some of us are in it because we whole heartedly care about helping individuals in need. This email mentions benefits to those earning 120-135k+. What about new grad salaries that start below or around 100k. A bill that according to legitimate economists - will put our country into further debt and economic turmoil. \n\nHow about our future students, who still need to go to school with the high cost of tuition. The email mentions how it would pressure schools to lower tuition. Tuition has never decreased in the past 20 years, year to year. But it’s okay because a some of us get an extra grand a year by using some tax loopholes. \n\nDo you want to know what this email left out - increasing the budget to organizations such as ICE. An organization where masked men are grabbing individuals on the street who have mistakingly arrested US citizens. \n\nA greater tax break for the top 1% because they earned it right?\n\nhttps://taxfoundation.org/blog/one-big-beautiful-bill-pros-cons/\n\n“The bills further complicate the tax code in several ways, sending taxpayers through a maze of new rules and compliance costs that in many cases likely outweigh potential tax benefits. No tax on tips, overtime, and car loans comes with various conditions and guardrails that, if enacted, will likely require hundreds of pages of IRS guidance to interpret”\n\nIf us as optometrists are so concerned with our earnings, maybe a better use of our time is leveraging and advocating changes to insurance repayment policies and putting pressure on vision insurance to increase reimbursement rates. \n\nThe AOA sent out an email how this bill clearly negatively impacts us our field as a whole - \nConsolidating the NEI institute and cutting funding to the National Institute of Health by 40%. We all push ourselves to be called Doctors, real doctors, we fight for it every year - but for those of you guys putting your private practice’s profit over the health and well being of your patients- you are far removed from what it means to be a doctor.  Maybe you should recite the optometric oath one more time. ",
    "score": 101,
    "url": "https://reddit.com/r/optometry/comments/1lutxn4/big_beautiful_bill_and_optometry/",
    "created_at": "2025-07-08T16:59:56.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1i1p7fw",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Why are people still chosing Optometry? ",
    "text": "The debt to income ratio is obscene ( school is so expensive, the cost of boards, the cost of boards prep vs the low income out of school). There has been recent discussions on how the NBEO scores have had such a high fail rate and there are even students who have taken the boards 6+ times and can no longer practice or take them again. Once you're out of school, patient care can be brutal when people think you are only good for renewing glasses and contact lens presciptions...even if you get residency trained- oftentimes those ODs end up working for Lenscrafters or Pearle.  There are so many other careers with much higher earning potential with way less school than this one. Most of the new grads I've met don't even want to do direct patient care anymore...So I genuinely want to understand why people are chosing this as a career? ",
    "score": 93,
    "url": "https://reddit.com/r/optometry/comments/1i1p7fw/why_are_people_still_chosing_optometry/",
    "created_at": "2025-01-15T04:08:01.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1m6w5xp",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "I’m filled with regret and I can’t live with it anymore.",
    "text": "This career has emptied me and I haven’t even really started it yet. \nI hate waking up in the morning. And not in a “oh I’m tired” way. I genuinely don’t want to get out of bed in the morning. The worst part of my day is waking up. \n\nI’m 26. In almost half a million dollars of student loan debt. I still have to pass part three. I’m out of money. I’m tired. I’m burnt out and I haven’t even started yet. I’m tired of older ODs saying “oh we’ve been there” bc no they haven’t. I’m tired of hearing “this will pass” because quite frankly it’s been eight fucking years of school and NOTHING IS PASSING. \nI’m in debt I’ll never get out of. I have no shot at ever being a home owner much less married with kids and a nice house on a nice suburb. I feel like it’s over and it’s all because I made a horrific decision in choosing this career. \nI’m 26 and still studying. I’m 26 and still asking mom and dad for help. I’m 26 and I still can’t be independent. And I’m so far in to this career that I can’t even quit and do something else. I’m HALF A MILLION in debt. There’s no “just get out and do something else”. This is all that I can do. And I still have to pass a board exam to even get to do this. \nI don’t want to do this anymore. \nBut I have to. And that’s the hell. I literally have no choice but to keep going. I’ve screwed myself for a lifetime. And I’m only 26. ",
    "score": 91,
    "url": "https://reddit.com/r/optometry/comments/1m6w5xp/im_filled_with_regret_and_i_cant_live_with_it/",
    "created_at": "2025-07-23T01:24:35.000Z",
    "num_comments": 91
  },
  {
    "id": "reddit-1pfs1t7",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Behind the scenes of Practice Ownership",
    "text": "My previous post about practice ownership showed that Reddit tends to skew heavily toward the employee perspective. I wanted to share a more comprehensive list of the benefits of being a practice owner. This isn’t to suggest that one path is right or wrong, but currently in the U.S., the current system is structured to favor business owners over employees in both fringe benefits and taxation. \n\nFor an employee you are a bit limited, most likely being paid by the day, hourly, salary, or salary with a production bonus. \n\nA business owner will typically be in an LLC or S-Corp. The S-corp is particularly favorable because the owner will pay themself a small but realistic “salary” and then the rest of their income will come as a “draw” or “dividend.” The “draw” the owner takes is taxed at a different rate than W2 income, and is void of social security and Medicare withholdings. So most owners make more money than employees, but they also are taxed differently. \n\nWhy do owners typically earn more? In a healthy private practice, owners often “net,” or take home, 30-35% of total revenue. By comparison, associates are usually paid about 15-18% of the revenue they personally produce. Using a simple example, if an optometrist generates $1,000,000 in revenue, an employee might take home around $170,000, while an owner could earn over $300,000. I track our net percentage closely, and we typically run well above 33%, sometimes exceeding 36%. At my current production level of \\~ $1.4 million per year working just four days a week, you can do the math on what that is for income.\n\nThat also brings on the advantage of having associates who just want to do their work and go home. Have the associate see patients and produce $1,000,000 in revenue while you pay them $170,000, and the owner will happily take home that extra $130,000 in their own pocket. \n\nOther benefits: \n\nReal Estate: I own my commercial real estate in a separate LLC which pays ME rent. This rent is taxed as passive income, and has benefits over your W2 income. I also depreciate the building and the equipment, with this saving more than $40,000 in taxes this year. I will hopefully be able to sell this asset for a gain later in life. Advantages: Monthly rent income, tax deductions, and eventual sale. \n\nFringe Benefits: \n\nI have my health insurance, cell phone, life insurance etc all through the business\n\nVehicle: This can be hotly debated but so far the 3 accountants I’ve worked with have no problem putting their vehicle and insurance through the business. Tread carefully here. \n\nMy children will sometimes do work in the practice. I’m able to pay them and they are minimally taxed, and then put that income into a Roth IRA for them. They better visit me in the nursing home one day when they see their Roth IRA account when they get older. \n\nThis brings up investing: You can run retirement investing accounts through your practice including a 401K. These can be expensive, but when you get older there are profit sharing plans that heavily favor owners of businesses. \n\nCash rebates: There are many buying groups, labs, companies etc that give rebates for buying their products. Some prefer to keep the rebates in the practice for expenses due to tax reasons, but I prefer to pull them out. I’ll take home more than $10,000 a year just in cash rebates. \n\nClinical trials: Participating in clinical trials can be very rewarding for the science of it all, but it also by chance is very rewarding financially. \n\nIn-house vision plans: We have created some in-house vision plans we give to businesses that help produce extra income and patients for our practice. \n\nOptometric business opportunities: Being a larger optometric business owner it opens up doors to other opportunities. People are more likely to talk to you about other business opportunities and outside investments if they know you can manage a business and have a larger income. This has been one of the more surprising, and I know a few owners who have been asked to be on the board of hospitals, businesses etc. \n\nAutonomy: I schedule vacation and time off whenever I want. I lose out on income if I take a day off, but also I refuse to miss any of my children’s activities and events. If you set up a good team and have good admins, the amount of time you spend on the business can be quite reduced.\n\nBusiness levers: There are many levers to pull in business to increase your income. This takes more skill and thought. By managing your optical, competent billing, becoming more efficient, managing staff time etc you can increase your income. \n\nI’m rural which comes with benefits: We negotiated with insurances before for better pay due to lack of providers. In some areas, Medicare will actually pay you more due to being in a rural location. As an owner you can pick and decide which plans to participate with. \n\nSale: You can sell your business! There is a reason that PE is buying up practices, it is because they can be very profitable. You will earn 2-3x more than an employee over a lifetime, and then after all of that you might have a million dollar business to sell on top of it all. \n\nThese are just a few reminders on the upsides of owning a business. Yes there can be downsides and many burdens, but I hope this will open up some eyes and have others give ownership a hard look and consideration. \n\nAnd remember you don’t have to go at this alone. You can join a group practice and buy-in as an owner like I am, or talk with colleagues or be part of other groups like the one that I’m in where younger practice owners get together and talk about strategies for a successful business. If there are any newer owners out there feel free to reach out, or those that want to talk shop about business ownership.\n\n",
    "score": 77,
    "url": "https://reddit.com/r/optometry/comments/1pfs1t7/behind_the_scenes_of_practice_ownership/",
    "created_at": "2025-12-06T15:33:48.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1jqsnj0",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "OD refuses to perform applanation",
    "text": "We have one doctor at this practice who will just straight up not do it. He relies solely on the tactile tonometer. Right now it’s broken and we won’t get another one for a couple weeks. His action plan is to make all these patients come back for IOP only.\n\nI think this is really unprofessional and unnecessary. It baffles me that management seems to be letting it slide. But I’m not a doctor so it’d be nice to hear what some OD’s think.\n\nThis same doctor also recommends retinal imaging over dilation for diabetics.",
    "score": 72,
    "url": "https://reddit.com/r/optometry/comments/1jqsnj0/od_refuses_to_perform_applanation/",
    "created_at": "2025-04-03T20:04:20.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1kovylb",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Optical front desk employees- why are we not allowed to sit at our workstations?",
    "text": "I am a recently hired employee at a very large national optical retailer I wont name here, and understand that the union contract took away all chairs at the front desk for clinical specialists sometime in the past year.\n\nEveryone I have spoken to about this feels it’s the most ridiculous thing they have ever heard. Friends, family, my medical team, strangers. Fellow employees. Everyone.\n\nI just submitted a strong doctors note so I can sit and HR still denied me, saying that I “can sit for pre testing” and sit “away from the desk” “on the iPad” to verify insurances??? when and where exactly….? Our pre testing room doesn’t really have room for a chair so even pre testing needs to be done crouched down over the machine….?\n\nJust curious if this is a universal experience and WHY this policy is in place? Seems highly discriminatory against those with disabilities and elders. ",
    "score": 71,
    "url": "https://reddit.com/r/optometry/comments/1kovylb/optical_front_desk_employees_why_are_we_not/",
    "created_at": "2025-05-17T15:42:09.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1jp1drm",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Please consider tropicamide refractions as a habit not an exception",
    "text": "I try to verify my refractions on peds and even young adults as a regular habit using a \"damp\" refraction.  Just had a patient with monofixation and history of vision therapy at an outside office.  This is my office's fourth time seeing him but my first.  According to our notes when he first came to us he had a mild myopic script.  We flipped that to a mild hyperopic script, and today with 1% tropicamide onboard low and behold he's actually a plus 3.  My coworkers think they will catch it on ret or in refraction somehow but they don't. Often times you just really need to go ahead and put the drops in even in they are healthy young and you would rather be playing on your phone or finishing charts.  There's a reason OMD's can point to us and say we aren't qualified to have scope expansion, many of us aren't even doing a thorough job of what is within our scope.  Those of you in a group practice with people that do the bare minimum, how do you keep it from getting under your skin?",
    "score": 69,
    "url": "https://reddit.com/r/optometry/comments/1jp1drm/please_consider_tropicamide_refractions_as_a/",
    "created_at": "2025-04-01T17:27:23.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1p3agsk",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Optometry in list of “professional” degrees by Trump administration",
    "text": "Trump administration removed: \n\n       •     Nursing (e.g., nurse practitioners)  ￼\n\t•\tPhysician Assistants  ￼\n\t•\tPhysical Therapists  ￼\n\t•\tAudiologists  ￼\n\t•\tOther fields noted: accountants, architects, educators/social workers.  ￼\n\nBut luckily optometry was included along side \n\n\t•\tPharmacy — Pharm.D.  ￼\n\t•\tDentistry — D.D.S. / D.M.D.  ￼\n\t•\tVeterinary Medicine — D.V.M.  ￼\n\t•\tChiropractic — D.C. or D.C.M.  ￼\n\t•\tLaw — J.D. (or L.L.B.)  ￼\n\t•\tMedicine — M.D.  ￼\n\t•\tOsteopathic Medicine — D.O.  ￼\n\t•\tPodiatry — D.P.M., D.P., or Pod.D.  \n\t•\tTheology — M.Div. or M.H.L.  ￼\n\t•\tClinical Psychology — (e.g., Psy.D.)  ￼\n\nThis has big implications for the types of loans students can take out. \n\nHow do you think optometry managed to stay in good graces?\n",
    "score": 65,
    "url": "https://reddit.com/r/optometry/comments/1p3agsk/optometry_in_list_of_professional_degrees_by/",
    "created_at": "2025-11-21T21:10:28.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1pqvd7j",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Details About the Kentucky Licensure Scandal",
    "text": "Timeline:\n\n2016: University of Pikeville School of Optometry opens with its first entering class. \n\n2020: University of Pikeville School of Optometry’s first class graduates, a class that includes the past AOA president, Joe Ellis’ daughter, Hannah Ellis. First time pass rates for NBEO I, II, and III for the class are estimated to be ~55%, ~76%, ~47%. \n\n2020-2022: Allegedly, NBEO never stopped administering exams during Covid-19, essentially making the NBEO exam still available to students to complete. Due to University of Pikeville’s abysmal pass rates for NBEO, there is probably pressure to have students licensed. \n\n2020-2023: During this time period, there were optometry licenses granted to 21 Kentucky OD applicants that did not successfully pass all three NBEO boards. One of these 21 applicants was the newly elected Kentucky Board of Optometric Examiners (KBOE) president’s (Dr. Joe Ellis) daughter, Hannah Ellis. Hannah Ellis graduated in 2020 but was not able to get licensed in KY until 2021 and only after having one or more NBEO boards waived by the KBOE. Some of these 21 applicants unsuccessfully passed not only one NBEO board exam but multiple and there is speculation that there may be applicant(s) who did not pass all three parts. These optometry licenses were granted in secrecy and were not publicly available to others that were in the same situation. This essentially means it was only offered to a select group of people for an undisclosed reason. \n\nEarly- Mid, 2025: The KBOE is quoted as saying: “there were a number of optometry students that could not pass the national boards as required in current Kentucky regulation”. Dr. Joe Ellis is quoted as saying: “If [prospective optometry students] see that testing seems insurmountable, they may not choose this profession down the road”. To remedy this, the KBOE proposes allowing Kentucky optometry licensure applicants to substitute NBEO part I with the significantly easier (online administered) Canadian Boards. As Kentucky is not located in Canada, this raised eyebrows for many, including the NBEO. NBEO realizes that 21 Kentucky licensed OD’s had not passed all three parts of NBEO at the time of their licensure and in May 2025, the NBEO sends a confidential letter to KBOE requesting information on its decision to grant these licenses. That letter goes unanswered. \n\nOctober 1st, 2025: It was decided by lawmakers that the KBOE has the authority to substitute NBEO part I with the less rigorous (online administered) Canadian board exam but KBOE did not have the authority to waive NBEO part III in 2020-2023 without going through the proper regulations. \n\nDecember 11 2025: In the midst of this controversy, Dr. Joe Ellis resigns from his position of president at the KBOE. Neither Joe Ellis or his daughter Hannah responded to requests for comments. \n\nDecember 13th 2025: The KBOE has a private meeting regarding the NBEO waivers it granted in 2020-2023 and plans to correct this action. No details were made public. \n\nAs usual, the AOA and the KOA have shown weak leadership by doing some gum flapping and monitoring instead of stepping in with action. This essentially allows KBOE to impose corrective measures for itself and those involved. Everyone knows that means KBOE is going to take it easy on themselves and everyone involved. If optometrists do not regulate and take action against poor licensure practices, someone else will do it for us. We've seen it happen with vision insurances and let me tell you, it doesn't end well for optometrists. \n\nTo be honest, these new schools that are opening up (especially rural areas) are destined to churn out poor students. The number of applicants to optometry school has essentially remained the same every year but the number of seats available in schools has increased steadily. This results in subpar students getting accepted to optometry school. On top of that, attracting good educators to a new school in a less than desirable location is a difficult task. Pairing substandard educators with subpar students will result in graduates of that school not being able pass standardized testing. The only way to remedy this is to lower the bar for being an optometrist and KBOE is starting/continuing this trend. Ironically, Kentucky has the broadest scope of practice and should actually be raising the bar for optometry candidates. \n\nTo be honest, to dedicate 4 years of your life and multiple $100,000s to be in an industry with weak leadership and decreasing leverage in the market may not be the best career decision. For all the students out there, think long and hard about it!\n\nhttps://kentuckylantern.com/2025/10/02/one-green-light-one-caution-flag-for-kentucky-optometrists-licensing-changes/\n\nhttps://kentuckylantern.com/2025/12/11/board-president-resigns-amid-questions-about-some-kentucky-optometrists-licenses/\n\nhttps://kentuckylantern.com/2025/12/11/questionable-testing-waivers-put-kys-licensing-of-optometrists-under-scrutiny/\n\nhttps://kentuckylantern.com/2025/12/12/kentucky-optometrist-board-meets-in-private-but-takes-no-action-as-groups-question-patient-safety/?fbclid=IwY2xjawOwLm5leHRuA2FlbQIxMQBzcnRjBmFwcF9pZBAyMjIwMzkxNzg4MjAwODkyAAEe7PUPHUIJJRn7_wXUHVMwtDQkLGkzh8B9ojPobXFPL90N6YLKQHwjfAgDHhk_aem_NjMD4KOxCk4METjkfheL6w\n\nhttps://nbeo.optometry.org/media/documents/news/Response_to_recent_reporting_about_the_Kentucky_Board_of_Optometric_Examiners.pdf\n\n\nPlease correct me if I have incorrect or missing information. ",
    "score": 65,
    "url": "https://reddit.com/r/optometry/comments/1pqvd7j/details_about_the_kentucky_licensure_scandal/",
    "created_at": "2025-12-19T20:23:55.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1neb25b",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Leave the US???",
    "text": "Has anyone left the US and successfully gotten an Optometry license/job abroad that could still support your family?  With all the craziness in the world going on, we are really considering leaving to give our child a better life. \n\nTop places we want to look into are New Zealand and Australia, but I am open to Europe if I can find an optometry job or equivalent.  We were thinking our original timeline to leave would be 3-4 years, but with how everything is escalating here, we want to be ready to leave sooner rather than later.\n\nAny advice or prior experience with this is greatly appreciated!",
    "score": 60,
    "url": "https://reddit.com/r/optometry/comments/1neb25b/leave_the_us/",
    "created_at": "2025-09-11T14:57:49.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1j274po",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Why is optometry so unpopular?",
    "text": "Hi! I'm a pre-med student looking to switch to optometry. I've been worried about going into medicine for a long time and when I researched optometry, it checked all my boxes. I'm interested in science and healthcare but I would rather not throw my life away for 10 years in med school, then residency. I also don't handle stress well so long shifts and surgical operations definitely aren't for me. So my question is, why don't more students pursue optometry? As far as I'm aware, it's way less competitive than most other medical specialties or similar fields, despite there being fewer optometry schools. If the issue is money, $100-200k is plenty to live comfortably and raise a family, and it's comparable to that of some doctors. I understand that student loans are pretty heavy, but isn't that how it is for any form of higher education? Especially med school, considering you would have to go through many years of residency while being paid minimum wage or lower.",
    "score": 59,
    "url": "https://reddit.com/r/optometry/comments/1j274po/why_is_optometry_so_unpopular/",
    "created_at": "2025-03-03T01:26:34.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1onyyu7",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Burned out",
    "text": "I am about 10 years into optometry career and I am burned out. I’ve done all sorts of practice mode. Ive tried working part time. I’ve now reached the point where I get very fidgety after 5 hours of work and can’t concentrate as much even after an hour lunch break. Seeing 20 patients a day used to be easy but now has become tiring . The limited income doesn’t motivate me as much help with burn out. I’ve never been able to make more than $120k full time. Please advise . Do I need a career switch? ",
    "score": 52,
    "url": "https://reddit.com/r/optometry/comments/1onyyu7/burned_out/",
    "created_at": "2025-11-04T05:11:13.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1iofzyx",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "High ability doc burned out.  Should I come back? (US)",
    "text": "I am honest, hard working and accurate.  At one point I had the lowest national remake rate in a particular chain.  But guys like me tend to get abused.  They realize I can do 4 an hour ... so how about 6? how about 8?  or how about more?  Pretty soon everyday becomes a slam day.  Yes I realize some of you will brag that you can see 40+ patients a day.  OK that's great...If you agree to it and are appropriately compensated.  I wasn't.   And when I complained I got nothing but \"yeah whatever\".   So I've quit and haven't looked back.  It's been about 5 years since I've worked.  I suspect the state and corporations where I worked had a lot to do with it. The previous states I worked were considerably nicer.  In any event it would be nice to do a few more years before I actually retire.  Any advice for older doc who has been burned a little too much?  ",
    "score": 51,
    "url": "https://reddit.com/r/optometry/comments/1iofzyx/high_ability_doc_burned_out_should_i_come_back_us/",
    "created_at": "2025-02-13T10:16:23.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1hnk3kx",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "On the fence with residency",
    "text": "For those of you that deferred applying to residency or started applying to residency then withdrew their application, can you explain your reasoning? Lately I have been getting burned out with this whole not-getting-paid situation and am ready to start my career, but I don't want to feel like my training is incomplete when I still am learning a lot of practical knowledge on my externships. I have the option to work rural for corporate through loan repayment programs but am nervous about being the sole provider in the middle of nowhere. ",
    "score": 42,
    "url": "https://reddit.com/r/optometry/comments/1hnk3kx/on_the_fence_with_residency/",
    "created_at": "2024-12-27T17:33:20.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1j0uk6x",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "So many unhappy optoms, is it really that bad?",
    "text": "I’m currently 2nd year vision science student studying to be a optometrist, but all the optometrists i’ve worked with keep telling my Ive made a mistake and to turn back immediately or how ‘its not too late’. \n\nTo studying and current optometrists in australia, how have you found it to be like? Please add clarification and not ‘its because its all retail’. I understand retail and sales are a big part of optometry but is the work-life that unsatisfactory?\n\nAnd if so, what career would you go with if you had the chance to redo your life?",
    "score": 41,
    "url": "https://reddit.com/r/optometry/comments/1j0uk6x/so_many_unhappy_optoms_is_it_really_that_bad/",
    "created_at": "2025-03-01T08:01:48.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1p6hzqu",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "New grad OD here: is this normal or am I being taken advantage of?",
    "text": "I’m a 2025 optometry grad and took a job right out of school at a practice that was recently bought by private equity. When I originally signed, the situation looked solid: the original owner was still there, the manager was great, and the staff seemed strong.\n\nBetween signing and my start date, everything changed. The original owner left, the manager left, and most of the staff left. So I walked into something very different from what I agreed to.\n\nSince starting, we’ve been extremely understaffed (currently dont have a tech) I regularly have to do work-ups and OCTs myself, which constantly puts me behind schedule. They hired a new manager, but they’re very inexperienced with clinical optometry, so I’ve basically become the person responsible for keeping the clinical side running and making sure workflow stays together, contacts get ordered correctly, and things don’t fall apart.\n\nUpper management keeps telling me I “only need to worry about seeing patients,” but that’s just not reality. If I don’t step in constantly, nothing gets done or it gets done wrong, and good patient care requires a functioning clinic.\n\nAs a brand-new grad in my first job, I honestly don’t know what’s considered normal growing pains versus true red flags. Is this something new grads typically have to push through for a while, or is this not normal and I should be considering other options?\n\nAny advice from ODs who’ve experienced PE buyouts or early-career chaos would be appreciated.",
    "score": 37,
    "url": "https://reddit.com/r/optometry/comments/1p6hzqu/new_grad_od_here_is_this_normal_or_am_i_being/",
    "created_at": "2025-11-25T17:06:11.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1mqlm10",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Would You Choose Optometry Again Knowing What You Know Now?",
    "text": "I’m looking for true, unfiltered opinions from optometrists who:\n\n- Did not have their parents pay for school\n- Have student loans in their own name\n- Do not work for and will not inherit a parent’s practice\n\nIf you could go back, would you still choose optometry?\n\nFor context: I’m a first-generation college student. I’ve been working as an optometric tech since graduating high school, I’m now a senior in college, scored in the 90th percentile on the OAT, and have been accepted into optometry school. I genuinely like the field, but the student loan debt is daunting.\nIs the career satisfaction and financial outcome worth it in the long run, or do you feel the ends didn’t justify the means?",
    "score": 35,
    "url": "https://reddit.com/r/optometry/comments/1mqlm10/would_you_choose_optometry_again_knowing_what_you/",
    "created_at": "2025-08-15T02:57:58.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1iyez16",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Corporate vs. OD/MD Practice: Best Choice for a New Grad with High Student Debt?",
    "text": "I'm a 4th-year optometry student about to start job hunting, but the options in my target area seem to be primarily corporate or optical-heavy practices—LensCrafters, independent opticians looking for full-time ODs, and National Vision/America’s Best. None of these have an OCT, and I’d likely be doing refractions all day.\n\nThere is also an OD/MD practice hiring, but I’m unsure how their salary will compare to corporate offers. So far, the corporate/optical salaries range from **$140k–$150k base**, which is hard to ignore considering I have \\~**$260k in student loans**. I’ll be speaking with the OD/MD recruiter soon, but I’m torn between taking the higher-paying corporate route or accepting a potentially lower offer for a more medical-focused setting.\n\nSome colleagues have warned that **starting in corporate can make it difficult to transition out** since private practices may see corporate-trained ODs as less valuable due to skill atrophy. However, would regularly attending CEs, reviewing office notes, and staying engaged be enough to maintain my clinical knowledge?\n\nI want to **retain my disease management skills** and not just be a \"refraction machine,\" but I also need financial stability and a good work-life balance. Would it be short-sighted to start in corporate optometry, or should I take the OD/MD offer even if it’s lower? Would love insight from those who’ve been in a similar position!",
    "score": 28,
    "url": "https://reddit.com/r/optometry/comments/1iyez16/corporate_vs_odmd_practice_best_choice_for_a_new/",
    "created_at": "2025-02-26T04:13:40.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1miczue",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Small ophthalmologist looking to hire part time optometrist",
    "text": "Hey all,\n\nWe’re a solo private ophthalmology practice in Northern California looking to hire a part-time optometrist (2–3 days/week). I’d love to get input from the optometry community on what makes for a fair and appealing arrangement.\n\n* What pay structure works best for ODs in this setting? Hourly, straight salary, or base pay plus production bonus?\n* What benefits are typical for part-time roles? (If any, at this schedule.)\n* Anything you’ve seen that works especially well, or that you’d avoid?\n\nAlso, where would you recommend posting the job? Just Indeed and optometry school forums, or are there other great places to look?\n\nGoal is to set things up so both sides are happy. All thoughts and experiences appreciated!",
    "score": 27,
    "url": "https://reddit.com/r/optometry/comments/1miczue/small_ophthalmologist_looking_to_hire_part_time/",
    "created_at": "2025-08-05T15:55:47.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1liie65",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Dropped from medical school as a 4th year, anyone here had any career changes like that or know anyone? Been finding it difficult to get back into a studying routine for the OAT",
    "text": "It's been since September since I transitioned out of med school, I obtained a Master's of Science and now just in limbo. I have considered many different career options and lots of insight of how to move forward, and I finally decided on Optometry. All fields have entrance exams, so it's a part I need to get over and just go for it. I previously was going to apply Ophthalmology and did multiple rotations in the field, so I am very familiar and most interested in going into Optometry. The problem is I have been depressed obviously and a loss of motivation from having to restart my life again from scratch. It's been many ups and downs, but I'm still here trying to move forward. I bought OAT Booster, watched some videos and read a bit, but nothing serious has come out of it yet and I dont have a study routine of studying daily as if I'm gonna take this exam in 3 months. I passed a million exams and my Step 1 in medical school, yet I can't seem to get back on my feet for an exam I already know a lot about in terms of material. If anyone has ever gone through something similar or knows someone that has been in my shoes, please some advice of how you got past this wall  because I really feel like I'm suffering even with the psychiatric/therapeutic help I've been receiving. I don't know what's gonna help me right now. My parents are immigrants, they are just grinders of like studying 15 hours a day without question and only hard work will get you there, which has always been our mindset. But this is just really difficult to make something out of nothing after I have been aiming to become a physician since I left high school and and wasn't able to pass my 2nd boards. Being so close to being done with medical school and not reaching the end has left me pretty scarred and is still painful, and I'm trying my best to just grind and move on but it's been ridiculously hard. I'm doing much better than I was since September but I'm still just not there mentally; I have to move on but it feels like I don't have the strength to. Any advice is kindly appreciated. ",
    "score": 27,
    "url": "https://reddit.com/r/optometry/comments/1liie65/dropped_from_medical_school_as_a_4th_year_anyone/",
    "created_at": "2025-06-23T14:42:39.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1lny42h",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "URGENT: Senate “Vote-a-Rama” on One Big Beautiful Bill—Just 2 More GOP “NO” Votes Can Save Medical Student/Optometry Loans and the Future of Healthcare",
    "text": "**A vote-a-rama is happening in the Senate for the One Big Beautiful Bill as you read this.** During a vote-a-rama, Senators are on the floor voting on amendment after amendment, and their offices are tracking every single call in real time. This is the moment when your call is most likely to be noticed and can directly influence how a Senator votes.\n\nA clause in the **\"One Big Beautiful Bill\"** aims to eliminate the Grad PLUS loan program, a lifeline for graduate and professional students. Grad PLUS has been pivotal in making medical school tuition affordable for 75% of students. If the bill is enacted, thousands of future doctors will be priced out of pursuing medicine. The vote is THIS WEEK. Your call to an undecided Senator will truly decide the future of American healthcare for all. We are just **TWO “NO” votes away from stopping this.** Your call to an undecided Senator could be the tiebreaker vote to oppose the bill. Take ACTION!\n\nThe Senate is currently voting on the bill that can end Grad PLUS loans for medical students. The Grad PLUS program under the Direct PLUS program has put thousands for doctors through medical school in US. Around 70-75% of MD students rely on the program to cover the cost of attending medical school. Four out of five DO students rely on Grad PLUS to cover similar costs. The Grad PLUS loan funds the entire cost of attendance, including tuition and living expenses. Grad PLUS has made medical education a possibility for the average American. Moreover, it’s made the dreams of low-income and underrepresented students a reality and has provided them with the means to pursue medicine. Removing the program would mean turning medical education and training into a career path only accessible to the wealthy.\n\nThe AAMC projects a physician shortage of roughly 86,000 by 2036, which the bill would only exacerbate. As the number of physicians declines, the quality of care and patient outcomes would very likely deteriorate due to a lack of physician representation and care in an ever-growing patient population. Areas in dire need of doctors would be hit the hardest, impacting rural areas, underserved communities, and VA hospitals. We need doctors more than ever, and restricting access on the basis of income rather than potential and talent will be detrimental in the long run.\n\nYou can take action TODAY. Voice your opinions to those you have put into positions of power. The bill is currently in the Senate for voting. This prime time to call your Senators. During the vote-a-rama, the Senate is in constant debate, and members are proposing amendments to the bill. Many Senators are all ears and are eager to hear from their constituents in regards to the bill. Voting in alignment with their constituents can increase their chances of reelection. Staff are especially more attentive and responsive to outreach, as Senators want to understand the general consensus of their constituents before deciding. Take full advantage of this! As mentioned before, we put them in positions of power, and we have every right to take it right back!\n\n\n\n**Here's how you can get started! (Takes 2 Minutes):**\n\nVisit[ **doctorsnotdebt.org**](http://doctorsnotdebt.org) for Everything You Need to Take Action:\n\nSign the Petition: Add your name to the official petition to show Congress that Americans care about the future of medicine. (Share this post with friends, family, classmates, and on every social platform.)\n\nContact Your Senators Directly: The website gives you an easy way to find your Senators’ contact information and even provides a ready-to-use script, so you know exactly what to say and who to call or email.\n\nSenators you MUST call (based on Current News &amp; Swing Votes):\n\nIf you live in these states, your call is critical. If not, please share this with friends or family who do:\n\n**Senator Thom Tillis (R-NC)—Phone: (202) 224-6342**\n\n**Senator Rand Paul (R-KY)—Phone: (202) 224-4343**\n\n**Senator Lisa Murkowski (R-AK)—Phone: (202) 224-6665**\n\n**Senator Rick Scott (R-FL)—Phone: (202) 224-5274**\n\n**Senator Mike Lee (R-UT)—Phone: (202) 224-5444**\n\n**Senator Cynthia Lummis (R-WY)—Phone: (202) 224-3424**\n\n**Senator Ron Johnson (R-WI)—Phone: (202) 224-5323**\n\n**Senator Tim Sheehy (R-MT)-Phone: (202) 224-2644**\n\n\n\n**Share your Story!**\n\nCalling all pre-meds, medical students, residents, fellows, attendings, or those who express similar concerns. Share your story! The Grad PLUS program has made the path to medicine accessible to thousands of Americans. Use Doctors Not Debt to share your story and express your thoughts on the matter.\n\nAll responses can be emailed to [doctorsnotdebt@gmail.com](mailto:doctorsnotdebt@gmail.com). Please include your name (first name required only), your current standing in medical education (pre-med, MD, fellow, attending, etc), and the college you are attending if applicable. All submitted responses will be a part of the Story section of the Doctors Not Debt website.\n\n\n\nThis is not just about the future of medical doctors. This is about every patient, every family, and the future of our nation's healthcare system. This issue affects most students from any discipline pursuing higher education. \n\n**Sign the petition at**[ **doctorsnotdebt.org**](http://doctorsnotdebt.org)\n\n**Call your Senator NOW.**\n\n**UPVOTE FOR VISIBILITY**\n\nWe are just TWO votes away—your voice and your share could make the difference.\n\n(Mods: This is a nonpartisan, fact-based, time-sensitive action for the future of medicine. Please pin if possible)\n\n",
    "score": 26,
    "url": "https://reddit.com/r/optometry/comments/1lny42h/urgent_senate_votearama_on_one_big_beautiful/",
    "created_at": "2025-06-30T04:05:15.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1ijz0o1",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Sluggish pupils",
    "text": "Anyone else genuinely surprised when they see a nice brisk pupil response? I feel like over the last 5 years of my career, pupil responses are just getting shittier? This is kind of an anecdotal rant, but anyone else feel this way?  I work in south Florida in a predominately older population so shitty pupils are kind of expected, but I feel like even my 40s/50s patients are mostly sluggish as hell.  ",
    "score": 24,
    "url": "https://reddit.com/r/optometry/comments/1ijz0o1/sluggish_pupils/",
    "created_at": "2025-02-07T16:29:03.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1mr0llr",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "How are you actually finding candidates these days?",
    "text": "We’re an established OD/MD practice located between Washington, D.C., and Richmond and have been trying to fill a full-time OD position. We’ve got what I think are pretty strong selling points:\n\t•\tNo weekends\n\t•\tFull tech support so you can focus on patients (we handle all pretesting, insurance headaches, etc.)\n\t•\tCompetitive salary + bonus potential\n\t•\tModern equipment and a supportive, collaborative team environment\n\nWe’ve used recruiters but the resumes we’re getting from optometrists are minimal if any. Pay is competitive, location is not rural, not big city — so I’m starting to think it’s not those factors.\n\nFor those of you who’ve been able to actually generate good leads for OD candidates recently — what worked?\n\t•\tAre you finding success through alumni networks?\n\t•\tSponsoring CE events?\n\t•\tMore personal outreach?\n\t•\tOther channels I’m missing?\n\nI’d really appreciate any insight from those who’ve been in the trenches recently. The goal is to connect with the right OD who wants great work-life balance and a solid team.\n\nThanks in advance!\n- Practice Administrator ",
    "score": 20,
    "url": "https://reddit.com/r/optometry/comments/1mr0llr/how_are_you_actually_finding_candidates_these_days/",
    "created_at": "2025-08-15T15:09:56.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1pq3bfg",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "need career advice",
    "text": "I’m a 2024 grad, medium size city in the Midwest, and my current salary is $144,000. Avg patient load is 8-16…(def busier this time of year). I work every single Saturday (9-6pm) and I’m starting to feel some burn out. I also don’t get two consecutive days off and management sucks. Typical corporate shit I get screwed out of my bonus. I’m considering a sublease instead of being an associate… anyone have any experience with this? This is my second associate position of out school and feel like I need to make a bigger change. I’ve been applying and interviewing for jobs the past year with no luck for anything super interesting. ",
    "score": 18,
    "url": "https://reddit.com/r/optometry/comments/1pq3bfg/need_career_advice/",
    "created_at": "2025-12-18T21:50:16.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1mdnfi1",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Salary for FYI doctors Canada",
    "text": "Hey everyone, FYI doctors is a corporate group in Canada. Do you think it is worth it to go to tim buck two for a year if they are offering 425k salary? \n",
    "score": 18,
    "url": "https://reddit.com/r/optometry/comments/1mdnfi1/salary_for_fyi_doctors_canada/",
    "created_at": "2025-07-31T00:35:48.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1m9entx",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "How did you get your first OD job after graduation?",
    "text": "I’m an OD4 in the US and I have a lot of anxiety about getting a well-paying group private practice job after graduation. I’m especially curious to hear from people who started their careers in OD-dense areas. \n\nAfter graduation, I’m moving to a city that already has an optometry school and is notoriously dense. Unfortunately I don’t have the option to move to a less competitive city for 2 years due to my partner’s job. I also don’t have a connection to that school/their alumni. Any and all advice is appreciated!",
    "score": 16,
    "url": "https://reddit.com/r/optometry/comments/1m9entx/how_did_you_get_your_first_od_job_after_graduation/",
    "created_at": "2025-07-25T23:45:32.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1ohkjg3",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Salaries in Private Offices",
    "text": "TLDR: what are some salaries for a full time OD in private practice seeing 25-30pts/day?\n\nI’ll preface with that I know in a general sense salaries are highly variable and there are a multitude of factors that go into it. However, my wife and I are contemplating moving in the next few years so I figured what better place to start my research than trusty ole Reddit so here goes.\n\nContext:\nI work in an OD/MD private practice. I have 30-35 scheduled depending on the day and have a show rate of 85-90%. This year is my first full calendar year with the company but am on pace for $1.5m collected revenue and will make roughly $180k gross so about 12% of collections. However I’m structured as base+ qtr production bonuses. If I assume the same pace as of late I may bring in ~$1.8m collections and gross ~$215k.\n\nQuestion:\nIn the event that we decide to move, would this be hard to come by elsewhere? I know I likely wouldn’t be at the same level immediately but would it be difficult to find a position elsewhere where I could make at least as much as I do now? ",
    "score": 15,
    "url": "https://reddit.com/r/optometry/comments/1ohkjg3/salaries_in_private_offices/",
    "created_at": "2025-10-27T17:21:27.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1kv9ktb",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "How much does doing laser procedures/injectables increase income?",
    "text": "Interested in applying to Optometry. I was in medical school and have done multiple Ophthalmology rotations so I’ve seen many laser treatments, usually the ones for retinal detachments and YAG capsulotomies. I see that there are like 20+ states that allow Optometrists to do this kind of work. I would be interested in doing this type of thing post-grad but I wanted to know how much does it really add to the average salary as an optometrist? if 150-160k is average, how much more can you make from these procedures? thank you! ",
    "score": 15,
    "url": "https://reddit.com/r/optometry/comments/1kv9ktb/how_much_does_doing_laser_proceduresinjectables/",
    "created_at": "2025-05-25T18:32:56.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1i2z5ua",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Walmart Independent Optometrists: pros/cons",
    "text": "Hi everyone! \n\nI’m considering starting with Walmart as an Independent Optometrist, but I need some more information about it before I make any big career moves.  Any Walmart/Costco/Sam’s Club independent optometrists want to tell me what they like and dislike about their jobs? Any guidance is appreciated! ",
    "score": 14,
    "url": "https://reddit.com/r/optometry/comments/1i2z5ua/walmart_independent_optometrists_proscons/",
    "created_at": "2025-01-16T20:57:43.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1k7t6y3",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Independent Practice in WalMart/Sam’s Club",
    "text": "Would it be smart to jump into leasing a space in Walmart/sam’s club right after graduation without any real work experience? I’m trying to find information on average salaries, typical hours, patient or glasses/contacts sale quotas. There are many of these spaces near my town that I could potentially work post grad so I’m looking for any information and guidance! ",
    "score": 11,
    "url": "https://reddit.com/r/optometry/comments/1k7t6y3/independent_practice_in_walmartsams_club/",
    "created_at": "2025-04-25T19:11:13.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1lqxhvr",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Am I underpaid?",
    "text": "Reading so much online, especially here about compensation makes me question a lot. Here’s my details:\n\n8 years experience. \nWorking in PP currently. 5 OD group. \nSchedule is 4 days a week. Two 10 hour days. Two 8 hour days. One Saturday a month. \n\n\n21-27 patients per day on average. \n\n$150k\n15 days PTO\n\n1/3 of patients are medical. \n\nBonus structure is:\n\nbonus equal to: four percent (4%) of the amount by which\nOptometrist’s Collections during that fiscal quarter exceeds four times (4x) the\ncosts to Corporation for that fiscal quarter for Optometrist’s base salary (including\npayroll taxes). \n\nJust feeling extremely burnt out recently and seeing other salaries for way less experience really is frustrating. \n\nLocation is suburban/semi rural Pennsylvania. \n\nEDIT: in my location I’ve turned down multiple other jobs within the past year for significantly less pay. That’s why I’m asking. I can’t seem to get any practice retail or private to offer anything over $140-150k. I’ve been offered as low as $60/hr no negotiation for full time with weekends. ",
    "score": 11,
    "url": "https://reddit.com/r/optometry/comments/1lqxhvr/am_i_underpaid/",
    "created_at": "2025-07-03T18:46:38.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1lj2xpv",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Upcoming optometry student interested in becoming a military OD",
    "text": "Hey everyone, I know these posts are pretty frequent but I wanted to ask a few questions from any current ODs that are active duty. \nI’m going to enter my first year to optometry school here in a couple months and I’ve been contemplating about making a career out of being a military Optometrist. There are a couple concerns, of course that I have since this would be a big life-changing decision if I go through with it , but I wanted to hear some testimonies from any active duty ODs that would be willing to share.\n\nMy first question is if you have a family (with or without kids) is it pretty hard to balance family life especially with moving since you’re active duty? I’m getting married soon and my spouse says she will support me in what I want to do but I want to take in consideration family balance \n\nThe second question is, how is your scope of practice? I’m looking to be more of a Medical orientated Optometrist. I don’t want to just be stuck doing refractions for potentially 20+ years. Is this something I would have to keep pushing for so I could expand my scope of practice or is it a lot harder to do and not worth it?\n\nMy last question is if you’ve been serving for a while, would you do it all over again or would you rather just become a civilian Optometrist? \n\nThank you for taking the time to read my post, feel free to DM me if you don’t want to comment on here! ",
    "score": 11,
    "url": "https://reddit.com/r/optometry/comments/1lj2xpv/upcoming_optometry_student_interested_in_becoming/",
    "created_at": "2025-06-24T05:29:25.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1lv1tyr",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Salary Opinions",
    "text": "Hi everyone! Wanted to get some opinions from other ODs about my current position and if I am being fairly compensated.\n\nFor reference, I work in a semi-rural area in PA at an OD/MD practice. I have been here for 2 years, started right out of school.\n\nBase salary is 130k with bonus potential. Bonus is based on total receipts (heavily influenced by overhead of the company and have to cover 2.6x my salary first). I see about 25-30 patients a day, mix of post-ops, medical and vision exams but heavily medical exams/POs. My days can be super stressful given how much medical stuff I see plus seeing all the things the MDs don’t want to see. I also have to take about 10 weeks of call a year and work one Saturday a month. I do get a scribe most days but of course we are short staffed and most of the time, I get the short end of the stick. I have to travel to 3 different offices, one being about 35 minutes away from my house. They are constantly increasing or changing my schedule without really asking me.\n\nThe 2 years I’ve worked here I haven’t hit a bonus yet. First year I attributed it to being new, second year my schedule was pretty packed and I still didn’t bonus, which was really frustrating. It’s still up in the air this year as well. \n\nI’m starting to feel pretty burnt out and starting to wonder if this is all worth it or if it’s time to start looking elsewhere.\n\nWanted to get some opinions. Thanks in advance!!\n ",
    "score": 10,
    "url": "https://reddit.com/r/optometry/comments/1lv1tyr/salary_opinions/",
    "created_at": "2025-07-08T22:06:23.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1iu3aeb",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Any advice from Private Practice Owners",
    "text": "Hi all, I am a student (male, 21) very interested in the field of optometry and one of my family members is an optometrist who owns a practice specializing more in ocular diseases. She wants me to take over her practice in the next 5-6 years. She does very well, makes around (~600-700k). I have always been very passionate about disease management and diagnosing which is why her particular practice is enticing but also medical school and studying to become a specialist such as a hematologist or rheumatologist is very much an interest of mine. I was hoping any optometry practice owners could talk about if they ever decided medicine and why they choose optometry and if they are happy with their career choice. I do think that I really like the business aspect of optometry aswell and the idea of advertising yourself and practice and not being bound to OHIP (I am from Ontario,Canada.) I am just struggling as I don’t want to regret doing optometry if I could have done medicine and vice versa. Some insight would be helpful. ",
    "score": 10,
    "url": "https://reddit.com/r/optometry/comments/1iu3aeb/any_advice_from_private_practice_owners/",
    "created_at": "2025-02-20T16:59:48.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1psrj93",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Career Advice",
    "text": "New grad finishing up boards but looking into jobs. Has anyone experienced being the only doctor at a site as a new grad specifically?  If so how did it go? I have a lot of anxiety in regards to being the only doctor at a potential site. And I still don’t have experience with certain things such as using an algae brush etc. likely would be a corporate setting…",
    "score": 10,
    "url": "https://reddit.com/r/optometry/comments/1psrj93/career_advice/",
    "created_at": "2025-12-22T05:28:06.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1ld7ebr",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Military Optometrist",
    "text": "Hi everyone! I’m curious about what life is like for military optometrists stationed abroad. Do they get to choose where they’re sent, or is it assigned? What’s the average salary, and are there extra benefits for being overseas? Do they live on base or off base, and what’s the housing like in other countries? I’m especially interested in the lifestyle, patient population, and work-life balance. Also, are there opportunities to work abroad as a reserve or civilian optometrist without being on active duty? For those who’ve done it, how did you apply or get selected for an overseas position? Would love to hear about your experience! Do I have to serve for this job?",
    "score": 9,
    "url": "https://reddit.com/r/optometry/comments/1ld7ebr/military_optometrist/",
    "created_at": "2025-06-16T22:56:36.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1mv2f3h",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Just how much higher pay are corporate optometry jobs?",
    "text": "I will be a new grad soon and want to pay off loans ASAP. I wish salary transparency where a little better on online job listings. I'm particularly interested in working in a mid-sized city in the Southeast US with fairly low cost of living. \n\n**If you have been employed as an OD by a corporation in a place like this, what was your salary and hours per week like?** I know people might comment to not go into corporate. I understand the drawbacks. I am just keeping my options open and weighing costs and benefits. ",
    "score": 9,
    "url": "https://reddit.com/r/optometry/comments/1mv2f3h/just_how_much_higher_pay_are_corporate_optometry/",
    "created_at": "2025-08-20T02:16:00.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1oykrlv",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "New Grad Optometrist working at Ophthalmology Practice",
    "text": "Hi everyone, as the title suggests I’m a new grad optometrist (just finished uni last week!) who’s going to be working at an ophthalmology practice. While im extremely excited for this opportunity(particularly given the incredibly difficult job market at the moment)and I’m so grateful to be in a place where I can continue to grow my knowledge, I’m absolutely terrified. It’s not that I’m worried about treating patients, but more so that I miss important things or ask stupid questions. While im aware that my boss and co workers know that I’m still just finding my feet, I can’t help but feel an incredible sense of pressure to not let them down- especially as I’ve been granted such a rare opportunity that most of my peers have not. Because of this, I constantly feel the need to prove myself and it’s stressing my out. \n\n\nWhile I desire nothing more than being in a clinic where I get to be challenged and where each day is interesting, there’s so much I’m trying to learn on the go that I feel incompetent, and that I’m going to make them think I don’t deserve my position when I can’t answer their questions or report incorrectly/incompletely about a case. The reality is that no matter how much I study, until I see something in real life it’s difficult to pick up on certain signs or presentations (and even then it can take a few times/ exposures to feel confident about assessing certain cases). Particularly as alot of the cases are post/pre op or involve more complex referred pathology that I’ve not personally encountered when training in clinic. Currently I’m working part time to get a sense of things before commencing full time next year, but I’m fearful that I’ll be so riddled with anxiety everyday (as I currently am the night before going in) that I wont enjoy working despite being so exited to be there…\n\nWith so many posts discussing burn out and dissatisfaction with optometry as a career, I feel even more hopeless when I consider full time work. \n\nAny advice or input in appreciated. Thank you! ",
    "score": 9,
    "url": "https://reddit.com/r/optometry/comments/1oykrlv/new_grad_optometrist_working_at_ophthalmology/",
    "created_at": "2025-11-16T12:41:45.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1prq6y6",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "VA physician salary",
    "text": "Since optometrist are now considered physician level at VAs, I’m wondering what that means for the salary at VAs? I was told by an optometrist that salary should be around 200k nationally (100k for residents) with the new physician title. Is this true? Seems too good… ",
    "score": 8,
    "url": "https://reddit.com/r/optometry/comments/1prq6y6/va_physician_salary/",
    "created_at": "2025-12-20T22:12:28.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1moeuga",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Returning to optometry after a career break... Has anyone else done this?",
    "text": "I am returning to optometry after several years away from practicing (for 15 years). I moved to a country that does not have optometry for several years. Now I am back and trying to get myself caught back up. \n\nI find that the didactic part (refreshing on ocular disease, new treatments, new drugs, new tech, etc.) is going somewhat smoothly if still difficult. I have been unable to find any real refresher courses out there other than just plain old CE.  \n  \nWhat I find a real challenge is feeling like I need to get back into a controlled clinical environment to get my skills back up to speed as well. This has been a bigger challenge for me.\n\nSo far, I have taken about 75 hours of CE this year (at 2 conferences with one more to go) and done some workshops at those conferences, but getting real clinical exposure is quite difficult.\n\nI am curious to see if anyone else has taken a break and come back, and what did you do to get yourself ready? Are there any refresher courses, books, and/or materials you used? Or any clinical exposures you tried?\n\nThanks in advance!",
    "score": 8,
    "url": "https://reddit.com/r/optometry/comments/1moeuga/returning_to_optometry_after_a_career_break_has/",
    "created_at": "2025-08-12T17:19:47.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1muk29t",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Career advancement for Opticians?",
    "text": "I am an optician/optometry tech (I have done both in tandem with each other) and have been for seven years now, going into 8 next year. Started in my early 20s as a receptionist and got on the job training from my GM and the other seasoned opticians and techs. At my current job, I'm directly working under the ODs and all that comes with that.\n\nThe problem is, this is pretty much a dead end job for anyone who doesn't desire to become an optometrist. I originally wanted to become an Ophthalmologist when I started this job 4 years ago but quickly realized that the finances will never add up for me because I would be in school on my own dime. So, what's next? Do I have to leave my field for a challenge and a pay raise (bc I'm considering dental hygiene if I can't find a solution). I'd prefer to stay in the field I'm an expert in but the more I research, the less I find. \n\nAny long time opticians that advanced in their career? \n\nP.S. I know the next step is naturally management but government has an entirely different management system than private practice.",
    "score": 8,
    "url": "https://reddit.com/r/optometry/comments/1muk29t/career_advancement_for_opticians/",
    "created_at": "2025-08-19T14:30:03.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1l0c5m9",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "From Patient to Provider: Exploring Career Paths in Eye Care",
    "text": "Hi everyone,\n\nI’m exploring a career change and would really appreciate some guidance from professionals in the optometry field.\n\nI’m a 27-year-old male in Southern California with a BA in Film. I’ve been fully blind in my right eye for most of my life and have spent a lot of time as a patient in optometry, ophthalmology, and glaucoma clinics. Those experiences have made me want to give back to help others going through similar journeys with vision loss or impairment.\n\nAt first, I started looking into nursing (specifically Accelerated BSN programs), thinking I could become a nurse in a vision related setting. But after some honest feedback on r/Ophthalmology, it sounds like nurses aren't commonly used in eye care beyond some support roles.\n\nThat brings me here to ask:\n\n* Is optometry a more appropriate or realistic path for someone with my background and goals?\n* What roles exist for someone who is passionate about patient care in the vision field, especially from a lived-experience perspective?\n* I’m fully blind in one eye, is that a limiting factor in becoming an optometrist, or working in the field in general?\n* Are nurses (RNs or LVNs) ever utilized in optometry clinics? If not, is that because their training isn’t needed, or are other roles more cost effective for the same tasks?\n\nI'm just at the start of this journey, and I’m open to long-term schooling or certifications if it means doing meaningful work in this space. I’d really love to hear your thoughts especially on how people with personal experience in vision loss can fit into this field professionally.\n\nThanks so much for your time!",
    "score": 7,
    "url": "https://reddit.com/r/optometry/comments/1l0c5m9/from_patient_to_provider_exploring_career_paths/",
    "created_at": "2025-06-01T00:42:00.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1p28f1j",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "New Contract Advice",
    "text": "Hey guys, I am writing on behalf of my wife, a **fourth-year** optometry school student, who is about to take her first job as an optometrist in the **Florida Panhandle**. She has a full-time job offer at a private practice with multiple locations, but both of us are unsure of what to ask for in the contract, or what constitutes a fair starting salary coming right out of school. If anyone could offer insight or give some direction, that would be great. \n\nThanks in advance!",
    "score": 6,
    "url": "https://reddit.com/r/optometry/comments/1p28f1j/new_contract_advice/",
    "created_at": "2025-11-20T16:58:00.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1idepwk",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Working in myopia clinic",
    "text": "I wanted to know how a day in an optometrist who works in a myopia clinic looks like. It seems cool to have a specialty. Also wanted to know if that would potentially increase salary. Thanks! ",
    "score": 6,
    "url": "https://reddit.com/r/optometry/comments/1idepwk/working_in_myopia_clinic/",
    "created_at": "2025-01-30T04:43:41.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1os3vum",
    "subreddit": "optometry",
    "soc_codes": [
      "29-1041"
    ],
    "title": "Job search with new grad expectations",
    "text": "Hello! I am recently licensed and would be interested in offers preferably around NYC or willing 1-2hr from the city.\n\nWhere are people commonly finding new jobs? I've been looking on indeed/zip recruiter so far and most ads are either lower end salary, part-time, or not even responding. Two of my colleagues got earned 205k (OD/MD in NYC) and 195k(OD/MD) for their first year. Ive started looking for 175k and find that impossible online...am I setting my expectations too high??\n\nI'm trying to aggressively pay back loans so I'd even consider relocating further for a decent salary and I'm very committed to work. (I am interested in learning/enhancing my skills, so practices that offer contacts or dry eye treatments would be nice, but im open to corp/practices not offering those for my first few years as well).",
    "score": 5,
    "url": "https://reddit.com/r/optometry/comments/1os3vum/job_search_with_new_grad_expectations/",
    "created_at": "2025-11-08T23:30:56.000Z",
    "num_comments": 45
  }
]