[
  {
    "id": "reddit-1l3ig0p",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Mother \"Doesn't Recall\" the 2 Decades her Son was in Prison",
    "text": "Since everyone seemed to enjoy my last post about the awesome response (basically a smoking gun) I got from my subpoena to Disney, I thought I'd share my all-time favorite paralegal story.\n\nThe circumstances were tragic: a homeless man, mid-40's, was hit by our Insured and killed. Insured swore up and down he jumped in front of her car at the last minute and, honestly, I believe her. However, she had been convicted in the past for perjury (it was bad, made the news and everything), so we did NOT want to put her on the stand at trial. Clearly, no jury would believe her. \n\nDecedent's mother filed a lawsuit on behalf of herself and her granddaughter. The adjuster did a claims search and a basic background search and even used the in-house investigator to do a cursory search, but didn't find anything, so it looked like this was going to be a pretty bad case - a wrongful death suit where the driver had a high limit policy plus an umbrella policy.  I'm fortunate enough that my firm will NOT take cases where we feel it would be unethical to pursue - like if the Insured had been drinking, we'd tell the adjuster to either pay out or find another law firm. But the adjuster came to us and said something about this case \"just seemed fishy\" so he wanted to proceed with litigation, at least through discovery. Investigate? Sure, my favorite! \n\nFirst weird thing was the fact that the Deceased's mother (Plaintiff) filed this suit on behalf of herself and her granddaughter - but the mother of the daughter wasn't involved and wouldn't give permission for us to depose her minor daughter (a preteen, so not that young). But the Complaint alleged as damage the loss of a father figure, role model, and filial support - were we just supposed to accept that without evidence? But we just figured that's a problem for another day. So just a little weird, not a red flag or anything. \n\nSecond part that was also a little weird (though less so) was how I couldn't seem to find any criminal records for the Decedent. Not to be judgmental or anything, but he was homeless for over 2.5 years and it just seemed odd that he was capable of working and earning a living so he could afford a home but just ...didn't?  And I really believed he jumped in front of the car, so I thought he might've been high on drugs. I send FOIA to the Sheriff's Dept for that county as well as the surrounding ones, and I got back nearly 500 pages - but it was mostly incidental things relating to homeless camps, asking him about other crimes that happened in the camps, a few trespasses issued, and offering him rehab - and no arrests. So, seemed a bit odd but more like \"it is what it is\" sort of thing. \n\nThen we get back Plaintiff's answers to interrogatories - we ask the standard model questions, so of course one of them asked if the Decedent had ever been convicted of a crime. Her exact response: \"Not that I recall.\" Verified and under oath. \n\nI don't know why, but that phrasing seemed fishy to me. As was the fact that she \"couldn't recall\" his exact address prior to him moving down to this state nearly 3 years ago. Attorney said she'd ask about it at Plaintiff's depo the following week, but it just irked me, ya know? Why phrase it that way? Why not say just 'yes, he was arrested,' or 'no, he wasn't'? \n\nSo I started investigating - I call it \"going down a rabbit hole,\" where I suddenly look at the clock, realize I spent the last few hours or half a day on following less than a lead, when I should've been dealing with the million responses and filings and other stuff I have to do. So I wasn't expecting to find much, and the only \"leads\" I had was the death certificate listing his father being back up north, as well as listing the city where he was born. State and county courts don't bring up a single case, and I wasted more time trying the surrounding states and counties with no success, and that's normally when I would've given up. But for kicks, I started googling the Deceased's name, including variations, with those locations and up come a few articles from 1998-ish (one was literally AOL News, these were very archived) about a guy with a similar name (think \"Jon\" instead of \"Jonathan\" or \"Will\" instead of \"William\") *robbing a bank and leading the police on a high-speed chase*. \n\nThere's no way that's the same guy, right? I mean, the adjuster would've found this - right? RIGHT?!\n\nSo now I know to look at federal cases! I hop on PACER, find the right district, type in his last name, first initial, and DOB, and WOWZA! \n\nTurns out, he was convicted of armed robbery in 2000-ish, sentenced to 20 years, paroled after serving 12, at which point he kidnapped a minor, brought her over state lines, made terroristic threats, and committed assault and battery. Because it involved state lines, it was again federal and they ultimately didn't even pursue most of these new, additional charges in exchange for him having to serve the remaining years on his 20 year original sentence - no parole, no early release. So when he got out, he had no probation and that's when he decided to leave the state and move to our state. (Also based on this timeline, his daughter was clearly conceived during that crime spree - so I'm not sure, but can guess why his daughter's mother didn't want to be involved in the lawsuit. Probably also the reason they didn't pursue the new charges, to avoid her testifying as a victim - but again, I'm just speculating.) \n\nI immediately sent an FOIA request to the prison he served at and while I couldn't get most of what I wanted without a subpoena, I did get the correspondence log, showing who he got letters and packages from.  Guess who wrote her son *EVERY SINGLE WEEK* for those 20 years (minus the brief time he was out and on a crime spree)? \n\nThe depo, according to my attorney, started off with her asking the Plaintiff multiple times if she was sure her son had never been arrested. \"I don't recall.\" She confirmed that a mother would remember that sort of thing though, right? Like if she were to write someone, especially a son, in prison, she'd remember writing the letter, addressing an envelope, stamping it, and putting it in the mail to go to a state or federal prison, right? \"I guess.\" What if there were multiple letters? That would be more memorable, right? \"I guess so, but I don't recall doing that.\" \n\nAt which point, my attorney apparently pulled up on screen the correspondence log and - while scrolling through page after page after page - said something along the lines of, \"You don't remember writing your son every single week, plus each holiday, every year FOR TWENTY YEARS?! That's about 55 times a year, or approximately 1,100 times. You don't remember sending 1,100 cards and letters to your own son, addressed to a federal prison? And remember, you ARE under oath.\" \n\nHer attorney immediately called for a break, so there was no response to that question. When the depo resumed, he objected to the correspondence log being introduced as evidence. Attorney continued, saying a judge would rule on it later, and went thru it, wanting to know why there were no letters or correspondence from his daughter? After threatening to get phone records and visitation logs, Plaintiff admitted granddaughter never once saw or communicated with her dad while he was locked up. \"So after, when he moved to an entirely new state, how often did she see him?\" Well, apparently they called and FaceTimed - but she couldn't provide when, how frequently, or any proof he ever paid a cent of child support or other contribution to the child. After stating we'd subpoena phone records, Plaintiff admitted she never saw them talk on the phone or saw them FaceTime, nor is she sure her son had an iPhone, but \"she's sure\" they had \"some sort of relationship.\" Attorney asked for evidence and I was literally drafting a new Request for Production as this was going on, requesting a lot of the above, that was filed immediately after the deposition. (Edit to add: Plaintiff moved to our state in the early 90's, and of course media coverage from then isn't archived as well as it is today, so in the 5 days from when we discovered his criminal history and when her depo was held, we couldn't prove she was in court at the sentencing or trial or anything. I'm sure we could see if she spoke at sentencing, but that turned out to be unnecessary). \n\nCase was settled the next day - for one tenth of the main policy limits, the majority to be held in a trust for the granddaughter (that was our condition and apparently this got some push back from Plaintiff, but her own attorney seemed like he wasn't going to put up his client anymore). Adjuster was thrilled but also impressed that our office found this information that neither he nor their background investigator did. Kept asking, \"how did you know to dig in that small county in a state 1,000 miles away?\" Well, I didn't. It was literally just the way she answered that single interrogatory, \"Not that I recall,\" that was the only thing that seemed odd. In conjunction with all the other things, yeah, it makes sense in hindsight - why he didn't have a LOCAL criminal record, why we couldn't depose the daughter or daughter's mother, even why he was homeless (since it's hard for felons to be employed), but those things individually weren't suspicious. \n\nI just can't believe a mother wouldn't \"recall\" if her only child was ever arrested. \n\nI still go down rabbits holes, but they've never been as successful as this one. Lemme know if you want more stories like these, it's cases like this one that make me love my job! ",
    "score": 1259,
    "url": "https://reddit.com/r/paralegal/comments/1l3ig0p/mother_doesnt_recall_the_2_decades_her_son_was_in/",
    "created_at": "2025-06-04T22:01:26.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1kaqrm4",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "“You’re too smart to be just a paralegal”",
    "text": "I went on a date. The guy told me he was in law school. We chatted for a while and he asked what I did. I told him I am a legal assistant and in school to be a paralegal. He asked what school was like. I told him I wanted the classes to be accredited and told him what classes I was taking. \n“Wow. I have taken some of those.”\n“Well, they’re at an undergraduate level. I’m sure the ones you took went way deeper.” \n“Do you want to go to law school?” \n“It’s a lot of money and I have to work. I can’t imagine how that would be possible. Besides, I like my job.”\nWe chatted a little longer and he asked me again why I don’t want to go to law school. I told him the same thing. \n“It’s a shame. You’re too smart to be just a paralegal.”\nJUST a paralegal??? I was floored. I, of course, had to respond to that. \n“Well IF you pass the bar, you’ll be wanting a smart paralegal.” \nNeedless to say, he did not get a second date. ",
    "score": 1151,
    "url": "https://reddit.com/r/paralegal/comments/1kaqrm4/youre_too_smart_to_be_just_a_paralegal/",
    "created_at": "2025-04-29T15:29:43.000Z",
    "num_comments": 163
  },
  {
    "id": "reddit-1idrr2h",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Left my \"family\" firm, got money.",
    "text": "I worked for the same form for 10 years. Loved it. We were a \"family,\" they said. We'll take of you, they said. We're a team, they said. \n\nThen they:\n~ Guilted me about using my PTO\n~ Told me I was replaceable \n~ Changed their firm policy to reduce the max amount of PTO I can earn\n~ Declined to give me a pay raise after 6 years without one\n~ Didn't acknowledge when I hit 10 years with the company (their longest standing employee other than the owner)\n~ Declined to give me a 4th week of PTO when I hit 10 years\n\n\nSo. I left. For a 20% raise and a flexible schedule. Been here less than a year and got an additional 8% increase today. \n\nI loved that place. I was dedicated and loyal, I had turned down several offers over the years from competitors paying more because of that loyalty. That was stupid. Please learn from my dumbassery. \n\nThat is all. ",
    "score": 785,
    "url": "https://reddit.com/r/paralegal/comments/1idrr2h/left_my_family_firm_got_money/",
    "created_at": "2025-01-30T17:06:06.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1l2o947",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Disney May Help Win My Case",
    "text": "Insurance defense paralegal here; I get to do a lot of investigating that I enjoy. Recent case is a guy who fell getting out of his truck - nothing slippery, so I'm not sure how we're liable, but he fell on his back and fractured a vertebrae. \n\nSuit alleges lost wages, loss of ability to earn, etc. One of his \"main\" damages alleged is the fact that he (purportedly) gained a lot of weight while recovering due to his inability to work out and had to get rid of his cosplay costumes, some that were custom-made and expensive. But all together, his medical bills - without write offs, adjustments, insurance or PIP payments, just boardables - totaled about $50K. We have no proof of income let alone lost wages, so when we went to mediation last month, so we made what I thought was a very reasonable opening offer at mediation of more than that. \n\nAlso, as icky as it made me feel, we did a chart of Plaintiff's weight over the past 15 years, basically proving he gained a ton of weight during the pandemic and as of the time of his most recent doctor appointment earlier this year, he was only 8 pounds heavier than he was in the DOL. (At his deposition, he was only 10 pounds heavier, so this rebuttal to his claim shouldn't have been surprising.) So basically, we didn't include \"loss of costumes\" (that he never gave receipts for) in our damage assessment. \n\nMediation didn't even last an hour. Plaintiff and his attorney won't come off their 7-digit demand. (Yes, they want over a million dollars for this fall.) So I guess we're going to trial. \n\nHere's where the fun part (for me) comes in - I figured if he has all these cosplay costumes (most having to do with a galaxy far, far away) and given that we live in a state known for a certain mouse, I went on hunch he might be a pass holder and sent Disney a subpoena. \n\nWell, they delivered - not only providing every time Plaintiff went to any of their parks, and that he never once rented a wheelchair or requested accommodations, but also tons of photos! Including photos of Plaintiff on ALL the roller coasters and rides! Any time he went on something and didn't buy the photo at the end of the ride? Those were apparently all kept and provided to me today, dozens and dozens, all in glorious HD that will be fantastic to blow-up as a trial exhibit for a jury to see. \n\nImagine needing a million dollars for your \"crippling\" back pain, but well enough to go to theme parks and ride roller coasters! 🎢 ",
    "score": 723,
    "url": "https://reddit.com/r/paralegal/comments/1l2o947/disney_may_help_win_my_case/",
    "created_at": "2025-06-03T21:39:53.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1jsfazf",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "“All you had to do was format &amp; doc production. That’s the easy part.” Cool. I resign Monday.",
    "text": "Hi just needing to vent. I’m the only litigation assistant/paralegal, and of course the attorney had a sudden family “emergency” trip right when 8 discovery responses were due.\n\nShe obviously waited until the very last day to serve them, because why not live on the edge? Opposing counsel maxed out interrogatories, production, and admissions for all of them. \n\nFinal drafts? Got them 8 hours before the 5pm deadline. Final documents to compile? A generous 4 hours before. Add 20+ emails of cryptic instructions like, “Add that doc, no wait — remove it. But also keep it. And format it like I didn’t tell you.” She CC’d the office manager and another secretary to “help” but both were too hesitant because the emails were too confusing.\n\nI somehow managed to finalize everything 30 minutes before the deadline. But did I get the green light to print and serve? Not until 4:55pm. Her words: “Serve this ASAP, I want to meet the 5pm deadline.” Sure! Let me just teleport 8 responses and hundreds of exhibits in 5 minutes.\n\nI served the last set at 5:45pm and I am so thankful electronic service.\n\nThe next day, I sent an email saying this deadline was not realistically doable, even with help (which no one felt comfortable giving because no one knew the case). I kindly asked to be given materials earlier next time. You know, basic expectations and consideration of my time and anyone else in the office that would be forced to help.\n\nFour days later, I get this response:\n“There was no way I could’ve gotten these to you earlier. The clients and I did the hard part. All you had to do was format and compile. That’s the easy part. Did you even ask for help? The 5pm deadline wasn’t met, which leads me to believe you didn’t ask for help.”\n\nJust formatting and compiling…Like it’s a five-minute arts &amp; crafts project where I cut, copy, and paste. This from the same person who doesn’t know how to convert a PDF to Word, search inside a PDF, or know how to send a Zoom invitation. \n\nSo after years of being dismissed, gaslit, and blamed — I’m finally submitting my resignation Monday. I’m sure she’ll have no trouble finding someone else to do such an “easy” job.\n",
    "score": 679,
    "url": "https://reddit.com/r/paralegal/comments/1jsfazf/all_you_had_to_do_was_format_doc_production_thats/",
    "created_at": "2025-04-05T22:21:56.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1j51dx6",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Email Wars",
    "text": "Anyone else sit back and watch an email thread that makes you go “Damn that was AGGRESSIVE….” That’s my life today. And I may have to ignore that thread because these attorneys are stressing me out lol. ",
    "score": 645,
    "url": "https://reddit.com/r/paralegal/comments/1j51dx6/email_wars/",
    "created_at": "2025-03-06T17:49:53.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1p6sdo3",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "I enjoy taking PTO just to watch my attorneys burn",
    "text": "I genuinely love where I work — the firm is great, my job is (mostly) enjoyable — but my attorneys? Lord help them.\n\nI’ve got one who is *so* forgetful that if I don’t remind him, he will straight-up miss critical litigation deadlines. Like… career-ending deadlines. Then my other attorney is the exact opposite: super organized, very on top of things, but when she wants something? She wants it *yesterday.* I’ve had to remind her multiple times that I am, in fact, ONE person.\n\nIt’s also a short week, the firm is closed Friday, and BOTH of them asked me if I’ll be working that day. (???) I’m also out two days next week — which I put on their calendars AND reminded them about repeatedly — yet somehow it’s still a shock.\n\nHonestly, sometimes the best part of taking time off is watching them try to function without me. Anyone else get that chaotic little thrill?",
    "score": 594,
    "url": "https://reddit.com/r/paralegal/comments/1p6sdo3/i_enjoy_taking_pto_just_to_watch_my_attorneys_burn/",
    "created_at": "2025-11-25T23:42:53.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1kilnmo",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "what e-filing feels like",
    "text": "Me: okay everything is correct, no typos, all components present, calibrated the scanner to 0.5mm, chanted in Greek over the certificate of service, the barometer readings are favorable, optimum humidity levels, the star charts align, sacrificed a goat three weeks two days and six minutes prior to submission, injected code into the PDF that increases clerk's chances of winning the lottery by 12 percent, am wearing my lucky socks, have fasted the requisite 24 hours, triple checked that we are submitting the right document, time to hit send\n\nRejection email two days later\n\nRejection reason: idk the vibes were off",
    "score": 581,
    "url": "https://reddit.com/r/paralegal/comments/1kilnmo/what_efiling_feels_like/",
    "created_at": "2025-05-09T15:43:18.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1j4d44r",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "My Client Died.",
    "text": "I’ve been in civil law my entire career (20 something years). It wasn’t until 2023 that I got into personal injury. Specifically, premises liability. I didn’t realize how taxing this work is mentally. Especially when you connect with clients. Particularly the clients who represent estates. It’s hard. \n\nToday was my third time in 19 months that I had to step out and take a walk. The quick version is, we have a client who was sickly, particularly with diabetes. The client had an injury that caused amputations, so it was a decent sized case. Defense settled out of court for a large 6 figure sum. The problem here is the client’s treatment was through the VA. And I don’t know if anyone has experience in trying to get a VA lien, but the process is ENDLESS. \n\nIt took exactly 10 months to get the lien. From\nOctober through January, my client and their spouse were living out of their car, just hoping and waiting for their settlement. They called me every day. And not in an annoying “I want my money” way. They were always so kind, so pleasant. But my client was always so sick. I wanted to help them badly but waiting on the VA lien tied my hands. In that time, they called me crying pretty often. It was heartbreaking. \n\nI finally was able to make the call in January. WE GOT THE LIEN! They were so happy. I expedited the entire process to get them their check. It was a victory moment not just for them, but for me too. I didn’t live through their struggles but I was sympathetic to my daily conversations with them. They are good people who deserved a place to sleep at night. \n\nToday, one month after I sent them their settlement money, my client’s spouse called me to tell me our client passed away this past weekend. I am devastated. Our client spent the last few months of life struggling to survive (and I don’t mean the illnesses) and when they finally get the means to have a sustainable life, our client died. \n\nMy heart is absolutely broken for the both of them. Our client wasn’t elderly, but she was sickly. I know how to put a wall up, and prevent myself from being emotionally invested in clients, but this one really hurts. \n\nThanks for letting me get this out. ",
    "score": 381,
    "url": "https://reddit.com/r/paralegal/comments/1j4d44r/my_client_died/",
    "created_at": "2025-03-05T20:31:36.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1kqzxli",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Landed a big role",
    "text": "I started working as a legal assistant in 2023 and earned my paralegal certificate in 2024. Earlier this year, my attorney decided to take early retirement. I’d been job hunting since October (lightly), and with the way the economy’s been, he gave me about a month and a half to find something new before laying me off since he was planning to travel for the rest of the year (It was a small boutique firm, but he still gave me severance - amazing guy)\n\nAt the time, I was making $25 an hour. Now, I’ve landed a new role with full benefits, a $90K salary + bonuses, and a hybrid schedule 2–3 days in the office and the rest WFH. Honestly, it’s been the best thing that’s happened to me.\n\nI started in IP and I will never leave it. Excited to start this new chapter in life. ",
    "score": 214,
    "url": "https://reddit.com/r/paralegal/comments/1kqzxli/landed_a_big_role/",
    "created_at": "2025-05-20T08:39:47.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1j39vx6",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Do you think it's realistic to earn six figures as a paralegal?",
    "text": "I work in the legal office of a federal agency in a paralegal-like role for over 10 years. I earn six figures. As a federal employee, I likely will be losing my job and will have to enter the non-federal world. Wondering if it's possible to earn my salary elsewhere. ",
    "score": 188,
    "url": "https://reddit.com/r/paralegal/comments/1j39vx6/do_you_think_its_realistic_to_earn_six_figures_as/",
    "created_at": "2025-03-04T12:41:39.000Z",
    "num_comments": 232
  },
  {
    "id": "reddit-1kx7049",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Accepted a new position",
    "text": "After a year at a firm that hardly trained me and constantly lectured me about mistakes, I turned in my notice to go to a firm with lots of resources in regards to me actually learning and growing in the field. They even offered me almost $20k over my current salary. First day is 6/9 🥳",
    "score": 170,
    "url": "https://reddit.com/r/paralegal/comments/1kx7049/accepted_a_new_position/",
    "created_at": "2025-05-28T03:26:13.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1jjmtfs",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Roll Call: Paralegals, What’s You’re Annual Salary?",
    "text": "Is it taboo to ask everyone what their annual salary is, city, size of firm or in-house, billable requirements, yrs of experience, certified, etc.? I’m curious what pay is like in different cities, etc and transparency of what paralegals are REALLY making.\n\nI’ll start:\n$95k + bonus + benefits/OT/2weeks vacay; 3 days in office 2 days work remote\nMiami, FL\nMedium Litigation Firm (Civil and Real Estate)\n100/hrs month billable\n5 years experience\n\nI have a JD (but didn’t want the long attorney hours and stress)",
    "score": 169,
    "url": "https://reddit.com/r/paralegal/comments/1jjmtfs/roll_call_paralegals_whats_youre_annual_salary/",
    "created_at": "2025-03-25T16:00:13.000Z",
    "num_comments": 356
  },
  {
    "id": "reddit-1muhoqg",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Boss cut my salary by 50% after firm lost a client… should I quit or stick it out?",
    "text": "The law firm I work at recently lost a major client, and now my salary is being cut in half.\n\nI’m in my early 20s, and I’ve been working as a paralegal at a very small firm. Most of my work was focused on collections for one of our largest contracts, which brought in a significant amount of revenue for the firm. I have a bachelor’s degree, a paralegal certificate, and about 3 years of legal experience.\n\nI mainly work under one of the attorneys. He has been practicing for decades and basically lives at the office. His wife is also a partner, but she does a different type of law so I rarely interact with her.\n\nLast week, he told me about the client loss and said he would try to keep my salary where it was for the rest of the month. He also recommended I start looking for other jobs and offered to give me a good recommendation.\n\nBut yesterday he said he crunched the numbers and would need to cut me about 40%. When I asked about my health insurance, he realized he hadn’t factored it in, so the cut became over 50%. When I worked it out, the new pay was only a couple of dollars above minimum wage.\n\nI asked him to put this in writing, and he said he would after recalculating everything. For now, I’m working without knowing what my paycheck will actually be. I asked about payroll, since by the time he told me this I had already worked several hours, and he said he had tried to keep me at my current salary for the month. I guess that means he’s not retroactively reducing my pay.\n\nHe said we could try to find other work to supplement my hours, but that’s not stable. Knowing him, he would expect the same level of output even with my salary slashed.\n\nI told him I couldn’t cover my bills with that cut and that I needed to think it over. I mentioned I was considering leaving, and he told me he personally would never walk away from a job. He said employees should stick it out in the trenches together. I used some sick hours to take the rest of the day off to think, and when I explained the situation to my dad, he said that by cutting my “rations,” my boss had already taken me out of the fight.\n\nEveryone I’ve talked to thinks it’s unreasonable to expect me to stay after such a huge cut. I even asked my boss why not just lay me off, and he said he doesn’t like hurting people and that I’ve been the best employee he’s had in years. That part is true. When I started, I had to teach myself everything and fix existing issues on my own. But to me, it hurts more not being able to pay my bills.\n\nSo here’s my dilemma. Do I make today my last day and accept a confirmed temp position that pays more? Or do I try to stick it out until the end of the month for the sake of my resume and a potential recommendation letter I could use for law school?\n\nTLDR: Small law firm lost a client, boss is cutting my salary by more than 50% (to barely above minimum wage). I can’t pay my bills like this. He wants me to “stick it out,” but I have another job lined up that pays more. Should I leave now or stay until the end of the month for the sake of my resume and recommendation?\n\nEDIT: I am the ONLY employee at the firm. The temp job is a restaurant job. I have been applying to other jobs, but I have worked at this firm for under a year, and the previous job I worked at was under a year as well (I moved states). So future employers/recruiters look at all the short stints on my resume and question my potential loyalty to their firm.\n\n**UPDATE**\nI had my meeting with him today and told him it was going to be my last day. We left on good terms and he will still be writing me my letter of recommendation. Thank y’all so much for your thoughts and recommendations. It helped give me a backbone!",
    "score": 163,
    "url": "https://reddit.com/r/paralegal/comments/1muhoqg/boss_cut_my_salary_by_50_after_firm_lost_a_client/",
    "created_at": "2025-08-19T12:57:59.000Z",
    "num_comments": 122
  },
  {
    "id": "reddit-1n8lvtp",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Leaving only bc of money",
    "text": "I've been working with my attorney for the last 5yrs and I get paid mid $70k doing insurance defense. He's always encouraged me and has become a mentor and a friend. I recently interviewed for a position in another firm with a base salary of $120k. On paper, it feels like a no brainer to jump ship, but I feel so, so awful about it. I live in a VHCOL and my salary is enough to cover my living expenses, but not enough to save or contribute towards retirement. \n\nAny tips on how to navigate this? It feels worse than when I got divorced. \n\nLocation: Miami\n\nEdit: Thank you to all. ",
    "score": 160,
    "url": "https://reddit.com/r/paralegal/comments/1n8lvtp/leaving_only_bc_of_money/",
    "created_at": "2025-09-04T20:53:12.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1j5sz60",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "How many of us are single and supporting a household of one on a paralegal salary?",
    "text": "I serve in a paralegal-like role for the feds and make good money. As I've mentioned before, I'll probably get laid off soon thanks to this presidential administration, and I'll have to be a paralegal in the private sector, which I've never done before. Worried that I won't be able to support myself on the salary. Seems doable if you're married, and the paralegal salary is like supplemental income, but maybe I'm wrong. ",
    "score": 115,
    "url": "https://reddit.com/r/paralegal/comments/1j5sz60/how_many_of_us_are_single_and_supporting_a/",
    "created_at": "2025-03-07T16:40:56.000Z",
    "num_comments": 91
  },
  {
    "id": "reddit-1mif49j",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Salary Progression",
    "text": "Curious to hear how everyone’s salary has progressed based on experience, location, and education.\n\nHere’s mine:\n\nEducation/Certs: AA in Paralegal Studies + ABA Certificate\n\nLocation: SoCal \n\nJan 2023 - May 2025: Small firm\n- Started at $18/hr, received a few raises up to $26/hr\n- No benefits\n\nJune 2025 : Mid-large size firm\n- $47/hr\n- Full benefits, 401k match, remote \n\nI’m very blessed to be in the position I’m in now and lucked out on a great mentor in the beginning of my career and working for another great attorney now. \n",
    "score": 109,
    "url": "https://reddit.com/r/paralegal/comments/1mif49j/salary_progression/",
    "created_at": "2025-08-05T17:14:29.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1j935jk",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Perks Flex",
    "text": "It feels like more than half the posts in this sub tend to be negative. Let’s try to bring some balance!\n\nWhat perks do you enjoy at your current job?\n\nFor me, I’m fully remote with a flexible schedule. As long as I log 8 hours a day, it doesn’t matter when I start or take breaks—I could clock in at 7 AM, take a 2–3 hour break midday, and finish up later.\n\nI also get full benefits, including top-tier health, dental, and vision plans.\n\nMy 401k doesn’t have monthly employer matching, but at the end of the year, the company deposits an equivalent percentage of my salary to it.\n\nThere are more perks, but these are my favorites!",
    "score": 106,
    "url": "https://reddit.com/r/paralegal/comments/1j935jk/perks_flex/",
    "created_at": "2025-03-11T22:09:14.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1on1lqa",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Boss was mean",
    "text": "I let my boss know I found a new job. My salary went up from 53.2 to 62. I am new in the field. Once the shock of what I said wore off, she said to me “well you weren’t worth 62 when you walked though my doors”\n\nAs if she made me worth the money and now I’m leaving\n\nFor context, she is basically a solo practitioner, comes in late, is very lazy, wants to retire, and is burnt out. It’s not like she was staying late to teach me how to file pleadings. I learned the most from other paras and from having to figure it out \n\nI was shocked she insulted me like that. But then she matched the salary and offered me a 5k bonus. \n\nI’m not staying with her. I just wanted to know if this was rude of her to say. I’m new in the field (been working for her for 18 months) and I felt very upset when she said this. ",
    "score": 95,
    "url": "https://reddit.com/r/paralegal/comments/1on1lqa/boss_was_mean/",
    "created_at": "2025-11-03T03:39:26.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1i0xep4",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Happy to share this…",
    "text": "Thanks to the advice and stories shared in this subreddit, I successfully navigated a month-long interview process and landed the job and negotiated a higher salary! I'm so grateful for everyone's contributions. Keep up the great work!",
    "score": 95,
    "url": "https://reddit.com/r/paralegal/comments/1i0xep4/happy_to_share_this/",
    "created_at": "2025-01-14T03:54:46.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1mjghu3",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "How in the world are you paying your bills?",
    "text": "I'm horrified at the salaries and wages I see on this sub.",
    "score": 95,
    "url": "https://reddit.com/r/paralegal/comments/1mjghu3/how_in_the_world_are_you_paying_your_bills/",
    "created_at": "2025-08-06T20:57:59.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1k1e1az",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Got fired yesterday.",
    "text": "First time in the field, I was hired in about 6 months ago at a specialty personal injury firm. I was still in school, and had just started my final semester in my paralegal program at the community college. They knew I had no experience when they hired me, and seemed eager to train me.\n\nUltimately, the reason I was given for being fired was that the learning curve was steeper than they thought it would be and that they needed someone with more experience. I received maybe 2 days of training, and one of those was with the legal assistant. I was given a bunch of cases and no direction after about a month. I flailed my way through, and sure, my work product could have been better, but they knew I had no experience working in a law firm when I was hired. I was following the directions I was given, and they refused to elaborate on the Bigger Picture when I asked. \n\nI felt my way through the pre-lit process and was starting to feel like I actually understood what we were doing. But I guess they had already given up on me. I saw the writing on the wall, honestly. I was kind of brushed aside. My questions and requests for tasks often went unanswered. I spent much of the past month just twiddling my thumbs. The attorney I worked for would send me emails asking for my thoughts about certain situations, and then would ghost me when I gave him my answers. A month or two ago, they started talking about bringing on another attorney, and then an off-shore paralegal. They both started this week, and I guess it left me as the odd man out. And so I got the Ol' Stanky Boot.\n\nTruthfully, I was getting kind of sick of the job anyway. I realized a couple months into it that we were a settlement mill. Our team got our clients *exclusively* as referrals from Top Dog Law. If you're familiar with Top Dog, you'll know what I mean. I feel that roughly 50% of our clients were trying to scam in one way or another. The majority of the ones I dealt with were non-responsive or incorrigible. It was nearly impossible to get any of them to follow instructions, and especially when I only half-knew what I was talking about.\n\nMy biggest concern is that taking this role may have ruined me and my expectations for where I should be at this stage in my career. The job was by far the best I've ever had after working ~20 years in the service industry. Hybrid schedule, wfh 3 days per week. $55k salary with full health and 15 days PTO. I was quite content to stay here for a couple years and gain some experience while finishing my bachelor's degree. \n\nTruthfully, I was kind of surprised to land such a lucrative role with no experience working in law. It's my intuition that the senior paralegal really pushed for me to get hired, but for her own purposes. I feel like she liked me because I was non-threatening. I am a guy and had no experience. She is a woman who has over 20 years of experience. After interacting with the team for the time I was there, I think she was trying to protect her own status as Queen Bitch of the firm, so to speak (I say this in a positive manner, not a derogatory one. I've got no ill will).\n\nThe CEO fired me because my former attorney is a coward and had him do it while he was out on vacation. He said that both himself and my former attorney were willing to be references on my job search, and offered me some leads if I was interested. He said that my work product was good and that everyone who worked with me only had positive things to say.\n\nShort term, I'll be fine. My partner is amazing and we have been discussing our options. However, I don't know that I can force myself to take another job paying $10-15k less that's going to require me to go into the office 5 days per week. I don't want to have to start over earning my PTO, which probably won't be near as good as it was. It just sucks to have to start over when I was finally settling in.\n\nOk, rant over. I just had to get these thoughts out. Make me feel better? Make me feel worse? Tell me a funny or relatable story? Idk, do what you do, paralegals of Reddit.",
    "score": 90,
    "url": "https://reddit.com/r/paralegal/comments/1k1e1az/got_fired_yesterday/",
    "created_at": "2025-04-17T14:22:25.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1pquscn",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Am I valid in being offended?",
    "text": "I’ve been a paralegal for an attorney at a small firm in Colorado for 3 years now. I am the only paralegal in the office, so while I mainly work for him, I also do work for the one other attorney in the office. It is also important to note that he is the owner of the firm, so he signs the paychecks, etc.\n\nWithin the office there are 2 attorneys, one file room person, and one secretary.\n\nToday I heard some chatter about the Christmas bonus and how they were distributed. I didn’t find mine in my box like other people, but I didn’t plan to inquire about it because I feel like at a small firm, unless you’re an attorney, bonuses aren’t really expected.\n\nMy boss came into my office and asked to speak with me, and he told me that he distributed the bonuses but that I wouldn’t be getting one (every other person in the office got one). Yeah, I was disappointed but I didn’t think a whole lot of it until he continued on and gave his reasoning as to why. He told me that the reason I wasn’t getting one was because my hours and overtime (I’m hourly, not salary) have been so substantial (I average about 10-12 hrs OT/week) that I have become the highest paid person in the office (excluding attorneys).\n\nThis comment is when I became offended. We have 4 major trials coming up in 2026 and I am the only person doing the “scut” prep in addition to the other paralegal duties I am doing for the smaller clients not going to trial. Earlier in the year when I started prepping, I asked him if he was okay with the hours I was working and weekends I was working, to which he said he was because my research and other work product needed to be done and those things I was working on required mass amounts of time. But now, because of those hours I’m working, I don’t get a bonus. I think at this point it isn’t even about the money, but the fact that his reasoning behind him not giving me one was because of the long and hard hours that I have put in. To twist the knife even more, he ended the conversation by saying that I was “a huge asset and indispensable to the firm.”\n\nI will say, I am applying to law school and he has been a huge help in that process by giving me advice, LORs, and helping me edit my personal statement. I feel like I have sacrificed a lot of my time and energy for this job, and I think I am more hurt by the lack of appreciation for it than I am about the money.\n\nAm I in the wrong for feeling offended? Do you all have any advice as to what I should do?\n\nEDIT: This is the first firm I have worked in as a paralegal, so I’m not really sure the “norm” for paralegals. Prior to this, I worked as a secretary at another law firm for 3 years in which we never got bonuses so I’m not really sure what to do. We also haven’t gotten bonuses at this firm that I’m a paralegal at before and this is the first year he has done them (at least to my knowledge).",
    "score": 73,
    "url": "https://reddit.com/r/paralegal/comments/1pquscn/am_i_valid_in_being_offended/",
    "created_at": "2025-12-19T20:00:30.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1k1je18",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Morgan and Morgan",
    "text": "If I am used to a shit show, is Morgan and Morgan really as bad as what I’m reading? I work at a mid sized firm with about 80 pre lit clients where it’s a shit show, clients are idiotic and rude, attorneys ignore everything until the very last second, overall similar to what I read about Morgan and Morgan. However it seems Morgan and Morgan’s salaries eat my firms Alive. I need more money asap and am used to a shitty environment and know I can easily handle 80-100 clients. Is it worth the switch? ",
    "score": 71,
    "url": "https://reddit.com/r/paralegal/comments/1k1je18/morgan_and_morgan/",
    "created_at": "2025-04-17T18:02:54.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1hqa40i",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Can’t survive on this pay",
    "text": "I’m an entry-level para at a large firm in CA, and had year of experience in the field at a very small firm before being hired. I make $24/hr and I willingly chose this job, taking a pay cut of $2/hr to gain experience at a bigger office and hopefully have room to grow. I even asked them to match my previous salary and they said no due to “equity” for entry level positions. I took the job anyway. \n\nI know that’s not the worst hourly rate I’ve seen on this sub. I’ve seen the horror stories of $10/hr listings etc. and I can’t imagine what some of y’all go through. That said, given the high cost of living where I am, I was scraping by at $26/hr and now I’m underwater. If not for my partner who makes 2.5x my pay and essentially supports us both, I would be living with parents or homeless. \n\nI love my job so far, I love my firm and my colleagues and the independence I have. But I can’t even buy weekly groceries. My car had issues this week and I had the terrifying realization that if I needed a new car I simply could not take on car payments, much less a down payment even on a beater. \n\nEven while enjoying the job, it’s hard not to get down about this. I have a bachelor’s degree, I’m smart, motivated, and am already consistently surpassing my firm’s goals after 6 months. To be one bad day/breakup away from homelessness given these things is incredibly scary and makes me wonder if it’s really worth it to continue in this field. Sure, there’s opportunity for growth from the bottom, but that bottom is so low.\n\nIs this a normal experience? When will the pay get better? Is it just my firm or does everyone just “eat sh*t” and suck it up the first 5 years? I guess I’m just looking for some clarity here on how normal or abnormal this is. Feel free to tell me I’m whining.\n\nEdit: I feel like I need to add — this is a remote job but based in CA and so of course I live here. That was 90% of what convinced me to switch over. It’s an enormous benefit to me, quite honestly.",
    "score": 65,
    "url": "https://reddit.com/r/paralegal/comments/1hqa40i/cant_survive_on_this_pay/",
    "created_at": "2024-12-31T08:01:40.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1ju1g1w",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "6 Month Salary Adjustment and Raise",
    "text": "I know this occupation is stressful but I just wanted to share some good news I got last Friday!! \n\nI’m 6 months in at my new firm and I was stressing out. This is my first paralegal job switching from corporate life where everyone is at risk of getting laid off always. Everyone at the firm has been there for a long time, and I felt like I had a bunch to prove. \n\nMy performance review went well, but I try to view raises and bonuses as nice but nothing guaranteed. WELL, Friday I open up an email from the managing partner with a letter attached detailing:\n- 1 time “salary adjustment” of $1,000 because they felt my initial salary was low &amp; wanted to comp for the past 6 months. \n- Additional raise of $4,000 a year, starting with my next paycheck \n\nI’m so hyped!! I don’t know if this is standard or not, but I feel very honored to work at such a firm and it definitely puts the pressure on to keep going :) it’s crazy because I did not negotiate or anything. I think others might have but I’m just relieved that they appreciate my work! ",
    "score": 64,
    "url": "https://reddit.com/r/paralegal/comments/1ju1g1w/6_month_salary_adjustment_and_raise/",
    "created_at": "2025-04-08T01:03:48.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1miburp",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "$30k - $60k to work in Manhattan?? With a Bachelor's?",
    "text": "Edit: This job posting is for a Commercial Litigation paralegal with preferably two years of experience. I can't believe the salary starts at $30k?? Am I crazy or is that absurdly low",
    "score": 63,
    "url": "https://reddit.com/r/paralegal/comments/1miburp/30k_60k_to_work_in_manhattan_with_a_bachelors/",
    "created_at": "2025-08-05T15:11:19.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1mrssyx",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Salary Range - Too High?",
    "text": "I had an interview yesterday for a position where salary range was not included in the job posting. Typically, I wouldn’t have bothered to apply but I know one of the attorneys there and he told me all the ins and out of the firm and he thinks I would be a good fit. \n\nMoving on, when the managing partner finally asked me of my salary expectations, I tried to turn the question around to ask him what he thinks a starting salary should be for a candidate like me with similar years of experience and qualifications. He didn’t seem to appreciate that question and gave me a non-answer and then asked me again what my range is. \n\nI said between $75,000 to $85,000 because that falls under the market value for this position with someone of my yrs/qualifications. \n\nFor reference (and didn’t tell him this obviously), I am making $68,400.00. I would like to jump to at least 20% so roughly $82,000. But willing to cut down to $79,000 if it comes down to it. I did enough research to know that my expected range is accurate for a paralegal with my experience in my area. \n\nManaging partner didn’t seem to think so and claimed that that’s a high range within their paralegal team. \n\nI asked if that’s in the budget and he seemed offended and said yes but still on the high end. \n\nNot sure how I feel about this. On the one hand, not a complete no. But on the other, if I do receive an offer, I’m worried any raise (requested or annually) wouldn’t be offered in the future.\n\nHave you ever had a situation where someone said your salary range was “high” during an interview? How did you go about it?\n\nEDIT - have 7+ years of civil litigation experience and in New Orleans metropolitan area. ",
    "score": 61,
    "url": "https://reddit.com/r/paralegal/comments/1mrssyx/salary_range_too_high/",
    "created_at": "2025-08-16T11:40:09.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1p8nm74",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "I like my job, but a new opportunity fell from the sky and the money is stupid good",
    "text": "Short and sweet.  I’m a paralegal with almost 16 year experience. I’m old school and like to stay at my firms for very long times. Anyway, I jumped about 1.5 years ago to work In-house. I took the job because that was my goal.  This job has been the best for my mental health…. Ever.  I love almost everything about the job, but I don’t see that I would ever have a chance to advance. I was contacted by a recruiter for a very interesting job for a newer insurance company.  No litigation, more compliance / research type paralegal job. Anyway, the salary is 38k more than what I make now. I wasn’t looking for a job and I really like my present one….. but the money. It would be putting me up to 110-115k per year plus bonus. What would you do if you got the offer? PTO benefits are comparable. Tech is better. Fully remote. My present job is 97% remote. Also, I wasn’t  extended an offer, however, I’ve made through all the interviews and I’m at the very last step.  I’m afraid to say who I’ll be speaking to, but let’s just say it’s the person in charge of all hires.  \n\nIf I do get the job offer, should I leave my current one just because of the money?  Should I leave to be “at the ground floor” of a new insurance company?  ",
    "score": 58,
    "url": "https://reddit.com/r/paralegal/comments/1p8nm74/i_like_my_job_but_a_new_opportunity_fell_from_the/",
    "created_at": "2025-11-28T06:14:55.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1ijztn0",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "No wonder they're confidential",
    "text": "Found this job listing on indeed.  $25 an hour to be both a paralegal and office manager, and use my own car for unspecified reasons...  It's a no from me dawg.\n\n  \nLooking to expand our legal team. Seeking a Paralegal / Office Manager with a minimum of 5 years’ experience as a civil litigation paralegal, who is dependable, organized and detail oriented. This role involves providing essential litigation support while managing the firm’s administrative operations. Only those who can exercise discretion and demonstrate independent judgement in significant legal matters need apply. **Responsibilities include, though are not limited to,** coordinating with clients and case intake, draft correspondence and client communications, electronic document management, filing, calendaring, and docketing, assist with preparation of legal documents including discovery and pleadings, trial preparation, billing, bookkeeping, managing receipts, bill paying, payroll, etc.\n\nOur office offers health insurance and retirement benefits as well as paid sick leave. Salary is contingent upon experience and qualifications. Applicants must have a good driving record and reliable transportation (your own vehicle) along with the ability to pass a background check.\n\nWe would ask that you are proficient with Microsoft software, Amicus, Adobe and Excel. Excellent attention to detail, analytical skills, ability to proofread legal documents accurately, strong case management experience and legal drafting skills required. Being able to stay organized and have the ability to prioritize tasks effectively is a must!\n\nJob Type: Full-time\n\nPay: $25.00 - $26.00 per hour\n\nExpected hours: 40 per week\n\nWork Location: In person",
    "score": 56,
    "url": "https://reddit.com/r/paralegal/comments/1ijztn0/no_wonder_theyre_confidential/",
    "created_at": "2025-02-07T17:02:18.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1oi97kr",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Morgan and Morgan opinions??",
    "text": "Hi there, \n\nI graduated from my paralegal program in September. I just received a job offer from Morgan and Morgan as a case manager. I’ve seen really bad reviews online. \n\nI need this job and I know people will scream run but I’ve been applying since June. They are starting me at an hourly rate. After training I will move to a salary that has not been clarified. \n\nAny advice or insight really helps as this is my first job in the legal field. I am located in LV if that matters. \n\nTIA! ",
    "score": 50,
    "url": "https://reddit.com/r/paralegal/comments/1oi97kr/morgan_and_morgan_opinions/",
    "created_at": "2025-10-28T13:22:08.000Z",
    "num_comments": 149
  },
  {
    "id": "reddit-1n18nf7",
    "subreddit": "paralegal",
    "soc_codes": [
      "23-2011"
    ],
    "title": "Hit my breaking point",
    "text": "So my firm has been going through some rough transitions. I was brought in during September of 2024 as a PI paralegal to become a workers comp paralegal. During the transition, I became the second most senior paralegal and became the go to fix it person despite my still learning. If shit hit the fan, it would hit my desk and I would find a way to fix it or minimize damage, if a file turned into a dumpster fire, i took it from the most senior paralegal. I took over the records department, began handling the liens, became quasi management, took over training new hires (support staff and attorneys alike) and became everyone’s go to. \n\nWell I was moved to salary and I have been working my ass off. This month I have hit 236 hours in billables, i had one day where I ended up working for 24 hours straight and brought in an equal amount of billables. I am the top biller in my firm, including the attorneys. Despite all that I’ve taken on, and the blood, sweat and tears I’ve spilt in an effort to keep this firm up and running, today my managing partner sent out a blast email to all the support staff blasting me because I hadn’t touched one file in 2 months. \n\nI just called my manager and broke down. Because if she had torn me a new one privately, I could at least defend myself, but if I respond to everyone to try and salvage my reputation then I’m breaking hierarchy which is already shaky and might cause another not so good reaction. \n\nEnded up telling my manager they need to find someone new to train people, they have to find another cash cow, and they need to find a fixer because the partner embarrassing me simply for an oversight when I have my hand in nearly every cookie jar in that firm is unacceptable. I was crying because I would have burned myself out to try and save this firm if the partner hadn’t just publicly blasted me. ",
    "score": 48,
    "url": "https://reddit.com/r/paralegal/comments/1n18nf7/hit_my_breaking_point/",
    "created_at": "2025-08-27T05:29:57.000Z",
    "num_comments": 7
  }
]