[
  {
    "id": "reddit-1ohh1h7",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Why KPMG is stigmatized?",
    "text": "I know here’s a strict hierarchy system in finance but why KPMG is rated so inferiorly? I watched a video of a professor saying you’re cooked that you’d be working at McDonald, or even worse, KPMG for a whole life. ",
    "score": 1865,
    "url": "https://reddit.com/r/FinancialCareers/comments/1ohh1h7/why_kpmg_is_stigmatized/",
    "created_at": "2025-10-27T15:12:02.000Z",
    "num_comments": 138
  },
  {
    "id": "reddit-1kmntz8",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "This Entire twitter thread is making me rethink this job (IB)",
    "text": "Look up this account on Twitter (X) @ BoringBiz\\_ \n\n(IDK why I cant link this thread)\n\nWhy am I fighting so hard to get a job where I will get chewed out because the font on slide 42 is slightly off or work 140 hours for pitch decks that only the MD will see. \n\n  \nThese real life experiences sound like fkn nightmares...",
    "score": 1462,
    "url": "https://reddit.com/r/FinancialCareers/comments/1kmntz8/this_entire_twitter_thread_is_making_me_rethink/",
    "created_at": "2025-05-14T19:16:17.000Z",
    "num_comments": 187
  },
  {
    "id": "reddit-1hplsc2",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Can I (a caveman) break in investment banking?",
    "text": "Ugg want to break in Merger and Acquisitions. Ugg hunt mammoth when he 6 year old. Ugg learn from village elder. Village elder tell me Morgan Stanley take Ugg. Ugg trade copper for wheel. Ugg not know work life balance. Ugg no know there other jobs with good WLB and ok pay. Ugg want to short fur and long wheel. Ugg want lots of seashell for currency. Ugg think wheel industry good. Ugg scared accounting will be automated by sabretooth tiger. Can Ugg do this.",
    "score": 1409,
    "url": "https://reddit.com/r/FinancialCareers/comments/1hplsc2/can_i_a_caveman_break_in_investment_banking/",
    "created_at": "2024-12-30T12:01:37.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1k1jrp2",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Destroying an entire generation",
    "text": "Kinda crazy how I’ve been running a small construction company (I hate it I want a office job) for the last few years, but I can’t get a job typing some fucking numbers in excel. I can sell a 6 figure job, and manage the project from beginning to end, but “he doesn’t have enough experience making power points”\n\nLike fuck you. Fuck you hiring managers. Fuck HR. Fuck everyone. \n\nPeople are out here CRAVING to work their asses off, but they won’t get hired because they’re expected to have years of experience in a field that no one hires for new grads for. \n\nAnd then the company will complain they’re understaffed. \n\nWhat a fucking joke. \n\nRuining an entire generation of people willing to work. CRAVING to work. \n\nShame on every hiring manager and every HR director. It’s embarrassing. ",
    "score": 1291,
    "url": "https://reddit.com/r/FinancialCareers/comments/1k1jrp2/destroying_an_entire_generation/",
    "created_at": "2025-04-17T18:18:40.000Z",
    "num_comments": 198
  },
  {
    "id": "reddit-1lsz0cu",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "98% of posts on this sub:",
    "text": "And its always some state school mf with a 3.2 GPA 🤣 “I want to work at the goldman sachs 🤓”",
    "score": 1276,
    "url": "https://reddit.com/r/FinancialCareers/comments/1lsz0cu/98_of_posts_on_this_sub/",
    "created_at": "2025-07-06T11:29:51.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1kninmr",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Finally breaking $100k at age 31.",
    "text": "I just turned 31, have 7yoe in financial services (mostly back office) and wrapped up my MBA last month at an average school that I did while working and got tuition reimbursement. Was getting discouraged in the job search and not getting far with roles that were $100k+. \n\nJust got an offer for a finance manager job at a healthcare company in a MCOL area. \n\n$120k base + 8% target bonus. Will be leaving a role paying $77k + 10% bonus. So about 50% raise. Taking a WLB hit but otherwise super happy with the role. My wife makes $60k so having a $180k HHI with very little debt is absolutely life changing for us. My wife could even quit hers if she wanted (doubt she would but that security is there now). \n\nJust posting this as encouragement, $120k is a lot of money to me coming from where I did. Stay hungry y'all, it will pay off. ",
    "score": 1243,
    "url": "https://reddit.com/r/FinancialCareers/comments/1kninmr/finally_breaking_100k_at_age_31/",
    "created_at": "2025-05-15T20:35:41.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1ol3lpu",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "I finally did it.",
    "text": "Guy's im speechless. just got accepted into a finance rotational program. I'm a first generation american who lived in a mobile home for most of my childhood. My parents don't even know how a credit score is calculated.\n\nNo connections to any rich people. I can't believe this. I worked so hard in university to achieve this goal and it finally happened.\n\nI'll be making $110k first year for my total compensation. My advice to you guys is don't give up. I was so close. I've had thousands of applications. MULTIPLE last round interviews only to get rejected because every other applicant had banking experience or went to a big university.",
    "score": 1223,
    "url": "https://reddit.com/r/FinancialCareers/comments/1ol3lpu/i_finally_did_it/",
    "created_at": "2025-10-31T19:16:34.000Z",
    "num_comments": 110
  },
  {
    "id": "reddit-1kwzo8g",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Can we normalize being honest?",
    "text": "„I am a 32 year old barista at a Portland new burger joint but after the penjamin I watched a tiktok about salaries in top quant hedge funds. How can i turn my life around without much effort to become a quant analyst in few years?” \nBro wtf is wrong with you, ofc you cannot. \nStop gaslighting people in the sub comments that they can suddenly trigger a magic switch and join the industry with terrible job market rn and huge instability. \nHalf of the subreddit is now flooded with posts like „breaking into citadel as a 35 yo balding midget stripper”. Get a grip. Sorry for wording and bad grammar but im tired (of you)",
    "score": 1116,
    "url": "https://reddit.com/r/FinancialCareers/comments/1kwzo8g/can_we_normalize_being_honest/",
    "created_at": "2025-05-27T21:38:48.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1jwyqdq",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Is there a secret investment banking cult I wasn't invited to?",
    "text": "Like seriously—where do you even learn this stuff? Schools don’t teach you “this is how to be an investment banker.” Nobody sits you down and explains the lingo, the models, the workflows. Yet somehow there are sophomores out here casually walking through LBOs and DCFs like it’s nothing?/!??!?1/1? How do interns know what to do? Is someone holding their hand the whole time? Are they just reading a bunch of books? YouTube? Adderall?? At the MBA level, is there some secret meeting where someone explains everything in a dim, candlelit basement with cloaks on and shit? The terms, the acronyms, the expectations? Because from the outside, it feels like you need to already know everything just to get in the door.\n\nI’m trying to prepare for interviews for next year and sharpen my skills  in general but holy shit half the time I don’t even know what I don’t know.",
    "score": 866,
    "url": "https://reddit.com/r/FinancialCareers/comments/1jwyqdq/is_there_a_secret_investment_banking_cult_i_wasnt/",
    "created_at": "2025-04-11T19:45:06.000Z",
    "num_comments": 137
  },
  {
    "id": "reddit-1ks2eyi",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Someone asked me why I hate working in VC. This was my response...",
    "text": "\\&gt; do masters in astrophysics\n\n\\&gt; get first/4.0 gpa\n\n\\&gt; start web3 business in 2021\n\n\\&gt; fail web3 business in 2023\n\n\\&gt; want vc job\n\n\\&gt; apply for vc job\n\n\\&gt; get rejected cos no consulting/IB experience (repeat 100x)\n\n\\&gt; get vc job\n\n\\&gt; \"wow im so smart - look how much value im providing\"\n\n\\&gt; \"im going to be a vc forever cos im so smart and im providing so much value and startups need vcs more than anyone\"\n\n*2 years later*\n\n\\&gt; click click\n\n\\&gt; “hi whats ur business”\n\n\\&gt; “nah that sounds bad”\n\n\\&gt; click click\n\n\\&gt; “yes I’ll make a presentation that no one will read but i’ll still spend 100 hours on it”\n\n\\&gt; click click\n\n\\&gt; go on plane to Next Gen Novel AI Unicorn Startup Con 2025\n\n\\&gt; “what do you invest in”\n\n\\&gt; “oh wow that’s so cool - no one else does that”\n\n\\&gt; \"a16z invested? yh count me in\"\n\n\\&gt; fly home\n\n\\&gt; click click\n\n\\&gt; get epiphany\n\n\\&gt; realise how dumb vc is these days\n\n\\&gt; get existential about how im wasting my life in a dumb job\n\n\\&gt; write reddit post to alleviate my pain",
    "score": 855,
    "url": "https://reddit.com/r/FinancialCareers/comments/1ks2eyi/someone_asked_me_why_i_hate_working_in_vc_this/",
    "created_at": "2025-05-21T16:36:45.000Z",
    "num_comments": 96
  },
  {
    "id": "reddit-1j3uey6",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "the truth about investment banking",
    "text": "While I'm cognizant that this sub-reddit is a circle-jerk for IB and everything related to it, I want to give my opinion on the industry from my experience.\n\nMost of you (like 99%), are 15-18 and have never truly worked a 40 hour week, let alone an 80 hour week. And while there is plenty of time left to determine whether or not you are capable of doing so, the reality is most of you could barely touch 40 without tapping out.\n\nThere isn't much of an emphasis on the reality of an 80-110 work week. Somehow many of you are convinced that you will break into this industry and begrudgingly work 110 hours a week, 7 days a week, holidays included, for 2 years and then what?... retire? \n\nWhile junior salaries are relatively high, it isn't millions of dollars. The people who end up at these BB or EB shops and work there for 2 years and move on to mega PE funds don't think about the hours. These people are machines and they could care less about WLB and also care a lot less about the comp.\n\n  \nEspecially considering that the comp becomes pretty negligible past $90k. While it is nice to make a shit load of money, you will realize that there is only so much you can do, especially when the only thing your salary goes towards is an uber black at 3 am back to your corporate apartment just to take the same uber back to the office at 4 am.\n\n  \nThe reality is, don't waste your time. If you have enough time to be scrolling through this sub, find another career path. You won't make it, and that's even if you get an interview, which you won't.\n\n  \nP.S. Employers don't give a shit if you did a goldman possibilities summit you look like retard putting that under experience\n\n",
    "score": 797,
    "url": "https://reddit.com/r/FinancialCareers/comments/1j3uey6/the_truth_about_investment_banking/",
    "created_at": "2025-03-05T04:01:03.000Z",
    "num_comments": 187
  },
  {
    "id": "reddit-1ixi1sl",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Jaime Dimon doubles down on RTO mandate and plans to cut DEI initiatives.",
    "text": "Jamie Dimon reiterated his mandate to implement full RTO measures. He says a hybrid schedule with Friday being remote does not f***ing work. He expects every employee to RTO by March, which is just around the corner. \n\nHe also mentioned that he will drop DEI initiatives to scale back on unnecessary investments, training and meetings. He said that since the laws changed after Trump came into office, the organization should “follow the laws” and “remove bureaucracies.” Other Wall Street firms are following suit and cutting back on DEI policies. Notably, Goldman Sachs is removing the requirement to have women or minorities in IPO client’s board seats. \n\nWhat are your thoughts on RTO and DEI scale back? Looks like the hybrid petition didn’t work. ",
    "score": 782,
    "url": "https://reddit.com/r/FinancialCareers/comments/1ixi1sl/jaime_dimon_doubles_down_on_rto_mandate_and_plans/",
    "created_at": "2025-02-25T00:42:02.000Z",
    "num_comments": 287
  },
  {
    "id": "reddit-1kxfv6o",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Is investment banking worth the 80–100+ hour weeks? My thoughts as a former JPM analyst",
    "text": "It’s been 7 years since I left J.P. Morgan, and some distance from my banking days have offered me some perspective. Here's my take\n\n**Definitely worth it if you are:**\n\n1 – Looking for the absolute fastest learning pace possible\n\nNo other job throws you into billion–dollar deals with exposure to C–suite execs immediately upon graduation. You’re also working twice the hours of a normal job, so the rate at which you learn will be twice your peers.\n\n2 – Aiming to break into the buy–side (Hedge funds, PE, VC)Banking is still the #1 gateway to becoming an investor because of the fundamental technical skills you develop. All other paths to the buy–side are much more challenging (besides VC).\n\n**Might be worth it if you are:**\n\n1 – Unsure what you want long–term but want optionality\n\nIf you’re young and just graduating, it’s okay if you don’t know what you want to do after banking. So many doors open for you that after some exploration, you are bound to find your way.\n\n2 – Doing it ONLY for the money\n\nWorking in banking just a few years to pay off loans or make some money quickly is (perhaps unsurprisingly) a very strong motivator. But unless you have a genuine interest in finance, you will eventually burn out as the lifestyle grinds you down.\n\n**Probably not worth it if you are:**\n\n1 – Hoping for passion–driven work right away\n\nJunior banking roles are deal–focused, not mission–driven. Banking can lead to purpose–driven careers as you get more senior but moving logos around as an analyst at 2am won’t feel meaningful in the moment.\n\n2 – Prefer creative, highly unstructured environments\n\nThe banking environment is hierarchical, process–driven, and rigid. If you thrive when you can experiment and think outside the box, you’ll likely feel boxed in as a junior banker.\n\nPersonally, if I could go back in time, I would still start off my career with a few years in banking because of everything I learned.\n\nHope this is helpful - let me know what you guys think too.",
    "score": 734,
    "url": "https://reddit.com/r/FinancialCareers/comments/1kxfv6o/is_investment_banking_worth_the_80100_hour_weeks/",
    "created_at": "2025-05-28T12:31:28.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1l4s256",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "BREAKING: JPM TO FIRE ANALYSTS IF THEY ACCEPT ANOTHER OFFER DURING THE FIRST 18 MONTHS OF EMPLOYMENT",
    "text": "This is one of the most stupid emails I have seen in a long time:\n\n\\- JPM banking program was already mediocre, top undergraduate talent was already not going to work there as a first choice\n\n\\- Now, every student who is not a complete idiot will never be interested in working at JPM\n\n\\- JPM is simply missing the point, the best analysts leave, but they can still be top analysts - the best banking analysts on the street (PJT RX) all leave after 2 years (and accept offers before starting at PJT), but they are still great analysts\n\n\\- JPM has client relationships with all the firms that hire their analysts, it is pathetic they take it out on 22 year old who are simply trying to do what's best for their career\n\nWhat is your view? Will they walk this initiative back?\n\nhttps://preview.redd.it/05acxlrm3b5f1.jpg?width=465&amp;format=pjpg&amp;auto=webp&amp;s=b20c45e34bd6537d7950febaf82f3b53e23295ab\n\n",
    "score": 707,
    "url": "https://reddit.com/r/FinancialCareers/comments/1l4s256/breaking_jpm_to_fire_analysts_if_they_accept/",
    "created_at": "2025-06-06T13:12:06.000Z",
    "num_comments": 193
  },
  {
    "id": "reddit-1j1rij8",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Finance pays well, but feels empty after seeing the World... How do I keep going ?",
    "text": "I just started my first full-time analyst job in the front office at a BB bank. I come from a rather poor background, so the salary and expected potential are extremely significant and life-changing for me.\n\nDuring college and my internships, I was really excited about this industry. But after graduating, I took an extended break to backpack around the world for several months, and it was a truly eye-opening experience. Now, I feel like I no longer belong in this environment. The egos, the luxurious lifestyles, and everything I see among my colleagues no longer excite me.\n\nI have always been a simple person : I don’t care about fancy hotels or high-end restaurants. My only priorities are taking care of my family and achieving financial freedom, which is the only reason I’m staying in this industry.\n\nHave you ever doubted the meaning of all this hustle? How did you find purpose again after such an experience? How do you stay hungry when you lose your sense of purpose?",
    "score": 605,
    "url": "https://reddit.com/r/FinancialCareers/comments/1j1rij8/finance_pays_well_but_feels_empty_after_seeing/",
    "created_at": "2025-03-02T14:02:48.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1i3jr0a",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "TRANSPARENCY SALARY POST: Title, How Much You Made In 2024, Experience years, Happiness out of 10",
    "text": "I've seen this done on a few other subreddits, but I'm curious for the finance people. There are many new people on here (myself included), and I think getting a realistic picture of salaries and titles will help figure out what we're getting into.\n\nThe years of experience in finance along with happiness level adds another layer of perspective imo.",
    "score": 361,
    "url": "https://reddit.com/r/FinancialCareers/comments/1i3jr0a/transparency_salary_post_title_how_much_you_made/",
    "created_at": "2025-01-17T16:07:17.000Z",
    "num_comments": 450
  },
  {
    "id": "reddit-1oq76qg",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Accepted a &gt;90% raise offer, but I feel really guilty",
    "text": "Hey everyone, I’m in a ~1.5 year FDP at an F500 and just accepted a new position. The problem?\n\nI have massive guilt.\n\nThe situation: I’ve had a great year at my current place. My manager supports me tremendously, has always believed in me, and is literally fighting these months to get me an additional promotion before my next rotation. She makes me visible to upper management, gives me interesting work, tries to develop my skills, speaks highly of me to everyone.\n\nMy entire department is being moved to India. Instead of doing a “normal” rotation as planned in the program, I was asked to stay a few extra months for the transition. \nThe director, not my manager, even created a custom role for my third rotation once this transition wraps up. A role that’s never been opened to anyone else in the program and it’s definitely interesting (similar scope to what I’m getting in my new offer). It signals trust and visibility.\n\nThen this offer comes through. 90%+ raise, significant title bump, from a larger multinational. For the same salary, I’d probably need another 3–4 years where I am now.\n\nObjectively irrefutable for my career stage and cost of living.\n\nBut here’s the drama: I know for a fact that leaving now puts her in a difficult spot. The India transition gets messier, my manager loses her only real ally on the team (it’s just the two of us), and all the work she’s done to advocate for me… yeah.\n\nI understand rationally that this is the right move for my career. Emotionally? I can’t shake the guilt.\n\nHow do you guys handle this? How do you come to terms with leaving people who genuinely supported you? Or am I just being too empathetic and should prioritize myself, full stop?",
    "score": 287,
    "url": "https://reddit.com/r/FinancialCareers/comments/1oq76qg/accepted_a_90_raise_offer_but_i_feel_really_guilty/",
    "created_at": "2025-11-06T18:43:37.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1nvum42",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "It’s crazy we haven’t had a salary mega thread since 2023 - has the economy really sucks this much?",
    "text": "Feel free to post salaries here. YoE, title, Location, total comp, hours, stress levels",
    "score": 251,
    "url": "https://reddit.com/r/FinancialCareers/comments/1nvum42/its_crazy_we_havent_had_a_salary_mega_thread/",
    "created_at": "2025-10-02T04:50:01.000Z",
    "num_comments": 286
  },
  {
    "id": "reddit-1ju0whg",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "How has your salary changed with age since graduating college?",
    "text": "I’m curious how salaries progress over time. If you’re open to sharing, I’d love to know!!",
    "score": 205,
    "url": "https://reddit.com/r/FinancialCareers/comments/1ju0whg/how_has_your_salary_changed_with_age_since/",
    "created_at": "2025-04-08T00:36:06.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1ksos3t",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "I’m tired of this finance world. Thinking of quitting before I’ve even started.",
    "text": "I’m honestly reaching my breaking point.\n\nI’ve spent years studying, working hard, even getting a Master’s degree in Quantitative Finance. And yet… here I am. Four months deep into job searching, sending out applications morning, noon, and night. Still nothing. Best case? I make it through HR and all the technical interviews, only to get ghosted at the end. No feedback. No closure. Just silence.\n\nAnd for what? To maybe land a junior position where I’d get underpaid for 5 years, grinding 60+ hours a week, just to be seen as “worth training”? To live the same draining “metro, boulot, dodo” routine with no time to enjoy life, no balance, no mental space?\n\nIt’s exhausting.\n\nThe barrier to entry in this industry is insane. Companies want candidates with a laundry list of skills, a perfect resume, 3 internships, and 30 certifications each one costing over $1,000. For jobs that barely pay a livable salary at entry level. How is this sustainable?\n\nFinance used to be about ambition. Now it just feels like a game rigged against you unless you’ve got the right connections or you’re ready to burn yourself out for crumbs.\n\nI’m honestly thinking of changing careers. I haven’t even started and I already feel burned out. What’s the point of all this if even doing everything “right” leads nowhere?\n\nAnyone else feeling like this?",
    "score": 191,
    "url": "https://reddit.com/r/FinancialCareers/comments/1ksos3t/im_tired_of_this_finance_world_thinking_of/",
    "created_at": "2025-05-22T11:54:44.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1izg8ev",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Received MS in Finance admits from 7 unis. Need constructive advice on how to evaluate and go ahead.",
    "text": "I am a finance graduate from India with no full time experience, looking to pursue MS in Finance / Quant Finance in the US. I have admits from UIUC Gies (MSF with no scholarship), Johns Hopkins Carey (MSF with 44% scholarship), Stony Brook (MSF with no sch), Rutgers (MQF with no sch), Bentley (MSF with 30% sch and GA Job for 2 semesters), Stevens (MFE with 30% sch), Northeastern (MSQF with 20% sch).\n\nAnyone who has ample idea about the programs, student life, pros and cons at a deeper is more than welcome to share their opinion. My main point of confusion arises from this situation-\n\nI wanted to target top quant programs initially but a lack of programming and math background proved a hurdle, hence I applied to some \"Beyond Top 10\" quant programs like Stevens, Rutgers, and Northeastern. Stevens and NE I am discounting for lack of repute and brand value. Rutgers is still in contention although I haven't received any scholarship.\n\nAdmits from Bentley and Stony can be comparable maybe but Bentley has a weird program and lacks any flexibility. Although, the reported numbers for employment post MSF look strong. SBU is a good name in SUNY schools but I have access to NO DATA about employment, avg salary, % employed at 3m, 6m, etc.\n\nNow, the big guns. UIUC and Johns Hopkins. UIUC allows A LOT of flexibility in MSF, as much as allowing me to take some financial engineering courses. The campus life looks very promising and vibrant. It's almost 6,500 acres. Access to Chicago but no other big city nearby. Brand value better than the colleges mentioned so far, except one. Johns Hopkins. JHU isn't as flexible as UIUC but also not rigid as Bentley. Quant isn't that much of a priority, hard and fast coursework for me. I am opting it only because of good salary. JHU is offering me the Washington DC, right in downtown next to Capitol Hill and the White House. Networking opportunities cross UIUC by a mile (I think). Brand value is immense. No such focus on quant, but instead on public policy related finance. I will target landing think-tank, policy making, govt finance jobs. Is that a viable plan? I’m willing to let go of a pursuit of a quant job hypothetically, because the job types mentioned above are more DC-oriented. But, the business school at JHU isn't THAT well known (I think). I don't know how far will JHU brand tag carry me? Is the downtown DC an ACTUAL plus-point? I've been offered a 44% scholarship but still the fees amount of 53K for the whole thing.\n\nTLDR, 7 uni admits. 2 with brand value, 4 with quant programs, 1 with GA job offer, 1 in NYC, 0 clarity on what to do. HELP.",
    "score": 189,
    "url": "https://reddit.com/r/FinancialCareers/comments/1izg8ev/received_ms_in_finance_admits_from_7_unis_need/",
    "created_at": "2025-02-27T13:50:39.000Z",
    "num_comments": 151
  },
  {
    "id": "reddit-1n3xiq6",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Graduate Job Finally Came at Citi",
    "text": "So after applying for like 50 jobs and not hearing back from 90% I finally got offered a role at Citi Bank as a Securities and Derivatives analyst in operations.\n\nDoes anyone know what I can expect when starting the role?\n\nThe salary isn't great I'll probably just about get by but at least it's a start after seeing some of my fellow students get positions earlier in the year I'm very happy to have finally made progress in the industry.\n\n\n\n\n",
    "score": 177,
    "url": "https://reddit.com/r/FinancialCareers/comments/1n3xiq6/graduate_job_finally_came_at_citi/",
    "created_at": "2025-08-30T09:41:35.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1np7u1h",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "I'm genuinely surprised when managers keep repeating the phrase \"we're looking for someone who isn't just in it for the money.\"",
    "text": "Honestly, what do they imagine people come to work every day for? Excuse me, but people have \"trivial\" things like rent and food and drink expenses they need to cover. Because my lifelong dream has always been to spend every waking hour passionately dedicated to your specific project. \n\nIf the goal is high performance, say so frankly. Say something like \"we need someone to increase our team's productivity by, say, 15% over the next two years.'\" But to say \"we're looking for people with a motivation greater than just the salary'\" is, frankly, a bit dishonest. Ultimately, we're here for the financial compensation. It's that simple.\n\n Even those who focus on career development and growth do so to qualify for better roles, which naturally means they'll earn more money. Forgive me if I see your organization as merely a professional exchange, or a mutual arrangement.",
    "score": 175,
    "url": "https://reddit.com/r/FinancialCareers/comments/1np7u1h/im_genuinely_surprised_when_managers_keep/",
    "created_at": "2025-09-24T09:43:19.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1lir0qd",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Worth taking $20k pay cut to work at Fidelity?",
    "text": "I’m currently working at a financial regulator and leaving because of all those federal layoffs. So technically it’s not a pay cut as much as me being employed instead of unemployed. However, a $20k lower salary than my last job is a big sting, and they haven’t been very open to negotiation. I really just want to get into a company where I can stay for at least a handful of years, but if I have to spend this much time just making it back to where I started I’d rather not. ",
    "score": 149,
    "url": "https://reddit.com/r/FinancialCareers/comments/1lir0qd/worth_taking_20k_pay_cut_to_work_at_fidelity/",
    "created_at": "2025-06-23T20:10:32.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1nlvorb",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "At what point does a higher salary stop being worth it?",
    "text": "Generally curious on what peoples views are on this in 2025. Anyone got a pay rise and more responsibility and wish they didn’t get it?",
    "score": 134,
    "url": "https://reddit.com/r/FinancialCareers/comments/1nlvorb/at_what_point_does_a_higher_salary_stop_being/",
    "created_at": "2025-09-20T11:26:03.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1mvzheg",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "1 year in retail banking follow up (there's hope).",
    "text": "TLDR: Took a shit retail job that I hated fresh out of school, coming up on 1 year at the same job, managed to make a pivot into a middle office middle market CB role. \n\nI posted roughly 9 months ago about hating a job I landed straight out of college in retail banking. I was being offered an FP&amp;A role a few months in and was seriously considering it, especially after a lot of people here said to take it. Things ended up not working out and I had to stay in my miserable, mentally draining, low fulfillment retail banking job that I loathed. \n\nI only took this job because after hundreds of applications and several months I couldn't land any other job. I definitely had too high of expectations fresh out of school, especially in this market. I'm very grateful for the job as a lot of my classmates are still unemployed. But nevertheless I was unhappy at my job and needed to get out. One of the first things I told my manager was that I hated the job but that I would do it and do it well if it meant I could move to another LOB within the bank.\n\nI immediately started networking within the bank, calling, emailing, going to corporate events etc... there were a lot of people who told me retail banking was a dead end and it would NOT help me land a job in any \"real\" finance role. However, I was constantly talking to people in private banking, IB, commercial banking, WM, etc... I took courses in commercial credit offered by the bank, signed up for seminars, anything that would help improve my brand. Asked to be connected with anyone else that might be of help after each interaction. Followed up after a few weeks and kept in touch with people that were in roles I was interested in. \n\nFast-forward to today, I networked my way into a middle market, middle office role at the same bank. I start next month, will recieve a 50% base salary increase, a hybrid schedule, and a clear path to a FO role.\n\nNo it's not IB, PE or VC, no I'm not making 500k in total comp, but hopefully this is a glimmer of hope to any recent or soon to be grad that feels stuck in a job they dislike, can't find a job, or feeling discouraged in this job market. It does get better, if you're willing to stick it out and put in the work.",
    "score": 118,
    "url": "https://reddit.com/r/FinancialCareers/comments/1mvzheg/1_year_in_retail_banking_follow_up_theres_hope/",
    "created_at": "2025-08-21T02:59:07.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1hmsc0m",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": " Why does Finance makes so much more than tech? Also are career in finance more stable than tech right now (which lay offs hundreds of thousands of people in a whim)? ",
    "text": "So, I have a cousin who went to the University of Pennsylvania for Economics, and he makes 400k+ working at a bank in Chicago after only 4 years of experience in the financial sector. Meanwhile, I have 2 friends working for Google for years, and they make only 150k. Also, I have friends in tech who are currently unemployed due to layoffs, and I myself are unemployed due to layoffs.\n\nWhen I went for tech in college, I thought that it was the future and it had the highest pay and the best work life balance for the salary. Also, I thought that job security would be great since everyone was always hiring for tech. None of that is the case anymore. The work-life balance is non-existent, and the salaries are going down. And there is no job securities with the constant layoffs.\n\nIn 2025: How is the work life balance in finance? And how come people can make such crazy high salaries with only 4 years of experience? I really feel that I picked the wrong career by getting into tech.\n\nEdit: For those asking what my cousin does is Macro Strategy ",
    "score": 110,
    "url": "https://reddit.com/r/FinancialCareers/comments/1hmsc0m/why_does_finance_makes_so_much_more_than_tech/",
    "created_at": "2024-12-26T16:48:57.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1owv35r",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Can a career in Finance match tech salaries ?",
    "text": "I’ve been noticing how much people in tech are making six figure salaries, even early in their careers and it’s got me thinking: Can finance offer that kind of earning potential too ?  \nI absolutely love finance. Numbers, markets and analyzing data are things I can’t get enough of. It’s my passion and I genuinely enjoy studying and working in this field. But I also dream of earning big. The idea of reaching those high salary numbers like what you see in tech is something I’m really motivated by.\n\nFor those with experience in finance, is it possible to earn at that level ?  \nOr is finance more about steady high paying but not tech level pay ?  \nWhat roles or paths in finance offer the best shot at reaching those kinds of numbers ?\n\nI’d love to hear your thoughts and any advice you can share!",
    "score": 105,
    "url": "https://reddit.com/r/FinancialCareers/comments/1owv35r/can_a_career_in_finance_match_tech_salaries/",
    "created_at": "2025-11-14T12:24:00.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1lg8ool",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Would you work in an IB boutique with three people and two clients ?",
    "text": "What would your prefer:\n\n- accept offer in an IB boutique with three people and two clients ?\n\n- Keep working as an auditor in big4 with double salary",
    "score": 99,
    "url": "https://reddit.com/r/FinancialCareers/comments/1lg8ool/would_you_work_in_an_ib_boutique_with_three/",
    "created_at": "2025-06-20T16:42:02.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1iyanva",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "The remote job I got 5 months ago is no longer remote. Advice? Encouragement?",
    "text": "I’m in my mid 20s, had a long search to find my job. I’m paid about $70k when industry in my city for my level of corporate finance analyst is $85k. I got to see the spread of salaries for my level at my company. I’m the lowest paid analyst with mid being $85k and high $101k. Tear.\n\nI accepted due to urgency and the remote factor, because I make some money virtually with a side gig after work. I have 4 years of professional full time finance experience. I feel qualified and knowledgeable enough that it feels illogical to be the lowest paid analyst. Considering I’m not straight out of college and I have experience in buy side, sell side, and lots of “real world” transactions.\n\nTo my surprise last week they told us that we will be required to be in office…every day. I’d have a commute of 1 hour each way, have to wake up much earlier, and I will have to cut some hours of my side gig (make less money).\n\nI already felt underpaid, but now they’re taking 10 more hours of my week via commute and I just got a very small merit raise *which leaves me with less money at the end of the month factoring the new commute.*\n\nIt feels wrong to leave after so few months. I feel like I’d need to leave next year to collect my 2025 bonus ($10k). I have good benefits and work with good people.\n\nI’m feeling like an entitled gen z. I just don’t think it feels worth my while even though it’s not *that* bad. Logical answer is suck it up until I get my bonus next year. Sigh.\n\nEdit: I welcome comments about how this sucks, would make me feel less glum -_-",
    "score": 99,
    "url": "https://reddit.com/r/FinancialCareers/comments/1iyanva/the_remote_job_i_got_5_months_ago_is_no_longer/",
    "created_at": "2025-02-26T00:36:03.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1isf167",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Would you still choose your career if money wasn’t a factor?",
    "text": "I’m in a unique situation. I’m a disabled veteran in my early 40s. I’ve been retired for the last 10 years. Before I was giving the option to retire from my federal job my professional background was in IT. Recently I was approved to go back to school in order to try to get me back in the workforce. For the last 5 years I have been obsessed with finance. So when giving the option of what jobs I wanted to do I said financial analyst. I live in a big banking city. I would attend a semi targeted school. Schooling and certifications would be taken care of. I’m not doing this for money right now so starting salary isn’t a big deal. Does this make sense? Or am I just dreaming? Should I focus on something else?",
    "score": 97,
    "url": "https://reddit.com/r/FinancialCareers/comments/1isf167/would_you_still_choose_your_career_if_money_wasnt/",
    "created_at": "2025-02-18T15:18:57.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1hrpfis",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Interview with a high school student ",
    "text": "Hey everyone! Please delete if not allowed but I am a current high school senior who plans on pursuing a degree in finance, hoping to lead to a career in banking or accounting. For a school project, I’m tasked with interviewing a couple people currently in the financial industry (any career). This is to further my knowledge on the field and to prepare myself/see if it is a good fit for me. I will attach the questions below, and if anyone is willing to help me out please DM or respond below!!",
    "score": 95,
    "url": "https://reddit.com/r/FinancialCareers/comments/1hrpfis/interview_with_a_high_school_student/",
    "created_at": "2025-01-02T08:43:12.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1nx4pwa",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "JFC Excel is way Fing deeper than I ever imagined",
    "text": "I posted here earlier about having an Excel test mid career as something of a senior analyst/project manager in fin tech. I'm feeling like I'm going to be yelling kids to get off my lawn before too long as I really have no clue about 95% of this. \n\nI thought I'd do a quick project to learn the functions and it's stumping me. I'm trying to load tables from websites and extract data from specific cells to automate populating salary data for my practice project. Using Power Query is hard! I've been using Excel every day for 15 years and all I've ever needed is Sum and to call specific cells from other sheets. \n\nI asked Copilot to help but am at the level of ineptitude I'm like googling definitions within definitions like WTF is M Query vs Power Query and how do I get to the correct text box? I was writing my codes into the Formula box without knowing to click the advanced editor.\n\nI'm not going to say my age, salary range, and years experience as I'm going to invite a lot of rage but let's just say it's probably assumed I'm an Excel professional at my level. Again, I'm literally doing this job now for 15 years and never used any of this...\n\nAny tips for good training to demystifying Excel?",
    "score": 91,
    "url": "https://reddit.com/r/FinancialCareers/comments/1nx4pwa/jfc_excel_is_way_fing_deeper_than_i_ever_imagined/",
    "created_at": "2025-10-03T16:58:48.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1pkd5rn",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Bizarre Call with a Recruiter- compensation",
    "text": "I’ve got over 15 yrs of experience in risk management and compliance in consumer banking. Was laid off from a senior director role at a top 5 assets bank last December. I am currently in a contract role for a regional bank while I continue to search for an appropriate full time role.\n\nA recruiter called me about a contract to perm role with a large bank in consumer risk. Director. Leading a consumer banking control testing team (2 lvl team with a total headcount of 15 people). Job will be to build the function from the ground up. They want someone with 10+ years of management experience in consumer risk and control and 10+ years focused on consumer lending. Experience with C-Level/exec communication and acting as a strategic partner to business unit leaders. Location is Charlotte, NC\n\nAll of this sounded interesting and like something I could knock out of the park. Then we got to talking salary. They’re looking at paying $75 per hour and converting to perm at $150k per year. I told the recruiter that there was no way they would find competent talent in this city to do that job for that rate.\n\nI made more than that in a smaller role over a decade ago. What the hell is happening from a compensation perspective? Is this a trend that I’ve missed?",
    "score": 87,
    "url": "https://reddit.com/r/FinancialCareers/comments/1pkd5rn/bizarre_call_with_a_recruiter_compensation/",
    "created_at": "2025-12-12T00:03:30.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1hpvvaz",
    "subreddit": "FinancialCareers",
    "soc_codes": [
      "13-2051",
      "13-2052"
    ],
    "title": "Just got hired today as a FA ",
    "text": "So I just got The Call less than an hour ago from a Fortune 500 financial planning company that was my top choice (they ignored my first two applications for the record). Training, exams, &amp; licenses are all paid by them (I already have my SIE and L/H but still need my 7/66). The base salary is good for this space for a new hire, the first year commission rate is standard, the bennies are excellent (I’m mostly excited about the free gym and 401k employee match). I am incredibly grateful for this opportunity, but I also acknowledge that I may not succeed as a financial advisor since so many FAs fail and attrition is brutal. Any advice for a new FA that you wish you’d known when you’d first started out? For those of you that quit being a FA, where did you end up? Thanks in advance everyone!",
    "score": 79,
    "url": "https://reddit.com/r/FinancialCareers/comments/1hpvvaz/just_got_hired_today_as_a_fa/",
    "created_at": "2024-12-30T19:55:51.000Z",
    "num_comments": 35
  }
]