[
  {
    "id": "reddit-1lqj56v",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Orkin sent Todd from Breaking Bad to my house to sell me a $17K Job.",
    "text": "I have a 3500 Sq ft house in North Carolina that's about 80 years old in a pretty nice neighborhood.  I purchased it five years ago and though it didn't have any infestations, it did have a few mice when we first moved in.\n\nAfter having Orkin come in (a different guy) and do an an initial inspection for mice five years ago as well as do a monthly exterior/interior spray, we found some evidence of mice, put out traps, plugged up some obvious holes, sprayed mint everywhere, and adopted two young cats. No hard sell, that was it. The last time we found a mouse in the house was in 2021 when one of the cats caught one.  There's been nothing after that.\n\nWe've been pretty happy with their pest service as things are generally bug and mouse free.\n\nLast week, they sent a new guy over to do a spray, which was fine, he was nice enough, and he looked almost exactly like Todd from Breaking Bad, which I found pretty amusing and I joked to myself he'll probably try to sell me a termite tenting from Vamanos Pest and use my house for a cook, but I digress.\n\nThis week, I get a text from a second Orkin guy from asking if they can \"do an inspection to see where the mice are coming from and why\" - which I found surprising because if there were mice, I'd see droppings and some very excited young cats, but of course, I wanted to do the responsible thing, so I said sure, come over.\n\nThen Todd and the new guy come over and do an inspection of the attic, then look around the basement and thew crawl space.  This is where the fun begins.\n\nWe keep a pretty clean house, so I didn't expect a lot of surprises.  So after Todd is done rooting around the attic, he tells me there's a hole in the roof where mice are coming in and also there are two squirrel nests, that I have a potential fire hazard from old beams in my roof, my crawlspace needs to be rennovated and that I need to get new insulation. Oh, and I should check for termites too and probably get a treatment... Umm, ok, that's new.\n\nNext, I go downstairs with the other guy and he doesn't see anything to be concerned about until we go to the storage closet under the stairs, and he almost instantaneously points out what I swear was a very strategically placed (planted) desiccated mouse carcass at the far end of the closet.\n\nI am not a paranoid person, but it definintely looked like it was put there from the outside asa plant like a corrupt cop planting drugs.\n\nI use that closet fairly often to store my luggage (I travel a lot for work), so I'd have seen a dried up carcass if one was there for a while, not to mention the cats would have been going nuts trying to get to it before it passed.  And why was there only one in the entire house in an area the cats don't have access to, and it was in the basement when the attic had the problem?\n\nNone of this was making any sense, but it only got better when they presented me with their solution to the problem. Here it is:\n\n\\-\tTreat home for termites with direct liquid and bait program with 5 years of maintenance\n\n* Remove all silver barrier and insulation from crawlspace in basement\n\n\\-\tRemove all debris and dead rodents from crawlspace\n\n\\-\tSeal all visible daylight entry holes in crawlspace\n\n\\-\tBorate treat all wood in crawlspace to kill fungus and preserve wood\n\n\\-\tInstall all new encapsulated r-19 insulation into crawlspace\n\n\\-\tInstall all new moisture barrier to ground of crawlspace\n\n\\-\tInstall maintenance free industrial dehumidifier on pavers into crawlspace\n\n(needs electrical)\n\n\\-\tRemove screens from gable vents (3) inside attic\n\n\\-\tRemove droppings, debris and the remaining stored items from attic haul away\n\n\\-\tSeal all visible daylight entry holes in attic\n\n\\-\tInstall wildlife screens over gable vents on exterior and interior\n\n\\-\tInstall solar radiant barrier into roof of attic\n\n\\-\tSanitize attic with vital oxide\n\n\\-\tClean any mess made and haul away all old materials when work is complete\n\nAll for the low cost of $16,952, which is such a deal as it is discounted from $18,994\n\nFor that price, I would rather just buy a used Porsche and do the work myself. Most of it is pretty doable.\n\nTo cut to the chase, I'm being told that Orkin needs to come in and renovate my attic, re-do my crawlspace, which has no issues whatsoever, and throw in a termite treatment for good measure.\n\nAnd to add to it all, when I asked them to break it down into stages of work, from high to low priority, Todd told me the couldn't do that.\n\nWOW.  As a business owner I didn't even know what to make of that reply.\n\nSo, I told them thanks and I would get back to them.  In the meantime, I got a second and third opinion from local pest control companies, and one of them started off with this dialog:\n\nThem: Hi this is XXX from XXX pest control, I'm calling you back - you need to get an inspection and service?\n\nMe: yes, I'm checking into new services for my house and I'd like to have you come over and do an inspection for pests, and take look at my roof - it's an older house and I think I may need to have something done about a hole in the attic - maybe that would be an issue with mice or squirrels?\n\nThem: Well, we don't typically see mice in this area coming into in attics and if there were squirrels up there, you'd definintely hear it.  The thing that we usually get called for in the attics are bats - do you have any bats or hear anything in the roof?\n\nMe: No, not at all, and if we had bats, wed' definintely know.\n\nThem: Yea, you would.\n\nMe: Well, I want you to come over and give the attic a once over, look in the crawlspace and the interior/exterior of the house and let me know what you think needs to be done...\n\nThat conversation was eye-opening, and completely turned me off from working with Orkin any longer...\n\nThe next day,  I got a text from Orkin asking if I wanted to move forward and I told them no, I'm getting estimates from other vendors and if they wanted my consideration, they'd need to give me a line by line itemization of costs and the option to do the work in prioritized stages.\n\nThat was the last I heard of them.  It so transparent it was a cash grab and not a real assessment of what actually is needed it's pathetic.  Who falls for this crap?\n\nSufficed to say, I've canceled my relationship with Orkin and am going with a local provided who provides an honest assessment and honest work.  Todd will just have to find another place to cook.",
    "score": 106,
    "url": "https://reddit.com/r/pestcontrol/comments/1lqj56v/orkin_sent_todd_from_breaking_bad_to_my_house_to/",
    "created_at": "2025-07-03T07:07:57.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1jm2f10",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Orkin - Dishonest, and I feel taken advantage of",
    "text": "I had Orkin come to my house on March 13th after spotting a mouse inside. When the technician arrived, he caused me a lot of stress by claiming that I had a mouse infestation and recommending that I remove all the insulation in my attic and replace it with their own. He pointed to what he claimed were tracks left by the mice in my insulation, saying there were a lot of them. The proposed solution was going to cost me over $10,000.\n\nMy wife wasn’t comfortable with this, so we decided to get a second opinion. Orkin charged me $270 for their visit, but all they did was place four poison traps for the mice. A second expert I called out was extremely honest and thorough—he walked through the entire house with me and showed me that the so-called \"tracks\" were actually just marks from the electrical wiring in the attic, not mouse trails. Turns out, I didn’t have a mouse infestation at all.\n\nI’ve had mouse traps set for over two weeks now, and the house has been empty for over a week with no signs of mouse activity. The traps remain untouched. It appears that the poison Orkin placed may have killed the single mouse I had, but I can’t find it, and now there’s a terrible smell in the house.\n\nI contacted Orkin to complain and was told a manager would call me back the same day, but it’s been three days and I’m still waiting for a response. I am demanding a refund. Orkin’s tactics were deceptive, and they tried to upsell me on unnecessary services. After I refused the $10,000 quote to replace the insulation, the technician called me back three times, and on the third call, he offered to do the work for just over $9,000. This is nothing short of extortion.\n\nI would strongly recommend avoiding Orkin. They are dishonest, and I feel taken advantage of.",
    "score": 93,
    "url": "https://reddit.com/r/pestcontrol/comments/1jm2f10/orkin_dishonest_and_i_feel_taken_advantage_of/",
    "created_at": "2025-03-28T18:47:56.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1js45yi",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "How do I eradicate these things from my front door? (NY)",
    "text": "These winged beasts only come during the warmer months, and when I leave for work in the morning or come back when it is getting darker/colder, they are in hiding, but when the sun is out, they fester all over the entrance to my front door, as well as creep inside my storm door. I believe they are living in that crack above and to the left of the doorbell. The same issue was prominent last year, however there are a ton more now. I am used to growing up seeing these insects occasionally around my house or where I used to go to school, but never so concentrated! If there are any prevention measures I can take to get them out of my door, it'd be much appreciated, I am not terribly squirmy, but I hate when they land on me in the time it takes to unlock and enter my home! Thank you!",
    "score": 76,
    "url": "https://reddit.com/r/pestcontrol/comments/1js45yi/how_do_i_eradicate_these_things_from_my_front/",
    "created_at": "2025-04-05T14:03:38.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1jx0ofm",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Advice to new techs: Develop some thick skin",
    "text": "To those new or thinking about joining the pest control industry, I advice you develop thick skin if you don't have it already. Most of your customers will either be pleasant or neutral, but you'll have some that just agitate you. \n\nI'm heading to the backyard to refill a bait box when I see the husband of the person in charge of the account. I say hello and he scoffs and says \"what the hell. Who are you?\" I introduce myself and he says \" oh well, I didn't know you were coming.\" Obviously bothered by my presence. I apologize and tell him we sent an email to his wife and I sent a notification before arriving. He just says oh and goes back to being on his phone.\n\nI wasn't too bothered, but at the say time, I didn't wanna deal with this guy. When I'm almost done spraying, he asks if it helps.  Ask if he means for the insects and he says no, for the rats. I felt better after that. Million dollar house. 10 dollar brain. So when a customer gives you a hard time, remember you're there to do the work they either don't wanna do or are not capable of doing. ",
    "score": 70,
    "url": "https://reddit.com/r/pestcontrol/comments/1jx0ofm/advice_to_new_techs_develop_some_thick_skin/",
    "created_at": "2025-04-11T21:08:18.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1jjl62o",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "What are these white colored pests in my kitchen?",
    "text": "Seeing these white colored creatures almost on a daily cadence near my sink in the kitchen. They are dead by the time I see them after waking up. Not too many, but couple of them per day is what I've seen so far since a week.",
    "score": 70,
    "url": "https://reddit.com/r/pestcontrol/comments/1jjl62o/what_are_these_white_colored_pests_in_my_kitchen/",
    "created_at": "2025-03-25T14:50:46.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1osezoz",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "What's this kind and how can i get rid of em?",
    "text": "Hello i'm in trouble with these guys. This is the 4th time i capture and release them. They're in the attick and eating my books and other valuable stuff. I love animals i don't want to poison them even if i consider it sometimes. i have cats i can't risk them.",
    "score": 67,
    "url": "https://reddit.com/r/pestcontrol/comments/1osezoz/whats_this_kind_and_how_can_i_get_rid_of_em/",
    "created_at": "2025-11-09T09:21:21.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1plwn01",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Insect Eggs? Found in silverware drawer.",
    "text": "Helping a buddy clean up his house, and found these eggs(?) in the silverware drawer. Would love some help with ID so to figure out if a professional is needed. Thanks in advance!",
    "score": 66,
    "url": "https://reddit.com/r/pestcontrol/comments/1plwn01/insect_eggs_found_in_silverware_drawer/",
    "created_at": "2025-12-13T21:33:12.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1pk5uzo",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Mice Keep Getting Through",
    "text": "Can someone please help me. Little bastards keep getting through my steel wool hole. I have an exterminator coming next week but I have been killing these things with snap traps 1-2x per day about 5 so far with no slowing down. \n\nIt seems I’ve found their trail and entry point; under my kitchen sink. Doesn’t seem to be anywhere else at the moment and I’m trying to keep them just within this cabinet area as best possible. \n\nAlso I have a “humane” metal mouse catch box coming. I plan to catch multiple at once then drown them in a big bucket. Poison is out. Our complex has multiple dogs (ourselves included). \n\nAny advice would be great. \n\nSorry, still not great at this Reddit thing so I apologize if this wasn’t written or tagged properly. \n\nP.S that hack carpentry / plumbing job was not my doing. Found like that from previous owner. ",
    "score": 61,
    "url": "https://reddit.com/r/pestcontrol/comments/1pk5uzo/mice_keep_getting_through/",
    "created_at": "2025-12-11T19:01:59.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1paqboe",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Roaches are coming from underneath the toilet",
    "text": "I've noticed a consistent pattern where I'd find roaches coming from my bathroom area. I decided to try and find out exactly where they were coming from. Eventually, I narrowed it down to the space behind my toilet, and I set up a camera there and recorded video.\n\nAnd guess what? I got video evidence of a roach squeezing through from underneath the crack between my toilet and the bathroom floor. I can't upload the video clip, but I uploaded snapshots from the video.\n\nNow that I know where they're coming from, what are my options? Should I uninstall my toilet and examine the connection between the floor and the toilet, and maybe repair any gaps, then reinstall? Or should I just caulk the gap behind the toilet where I saw the roach squeeze through from and seal it off? Has anyone dealt with roaches hiding around toilets before?\n\nI've also tried Advion bait gel in the bathroom but they haven't seemed too interested in what I've laid out. I think the building has a problem but I'm not sure how we could best address it. Would also appreciate any thoughts on what this means for the building: does this mean that the plumbing system has an infestation, and if so, what can be done?\n\nMy location is NYC, and the roach species is the large American cockroach (I believe). I live in a condo apartment that I own myself, so it's really on me to fix the problem. I've asked building management for help before, but they just sent an exterminator that scattered some bait around, which did nothing.\n\nAny thoughts or even condolences would be greatly appreciated! I hate these guys and I really want to restore my peace of mind.",
    "score": 58,
    "url": "https://reddit.com/r/pestcontrol/comments/1paqboe/roaches_are_coming_from_underneath_the_toilet/",
    "created_at": "2025-11-30T19:00:16.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1hrlror",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Actual effective way to get rid of these roaches?",
    "text": "I signed a lease for my apartment in August, and saw a roach the day I moved in. The frequency and number of roach sightings has increased since then. I can now find probably 3 to 5 roaches in my kitchen at any given time if I open all the drawers and cabinets. \n\nI frequently deep clean my kitchen with Disinfectant (including inside drawers and cabinets whenever I see a roach), and I don't keep any unsealed food or dirty dishes out. \n\nI have mentioned the problem repeatedly to the building manager. To his credit, each time he has scheduled pest control people to come and spray the kitchen. This means I have to remove all my dishes, appliances, pantry food, etc. Out of the kitchen and into another room, which takes quite a while and sort of wrecks my apartment in the process. This has happened 4 times now, and it is getting VERY old. \n\nNot once have I noticed any improvement after the pest control treatment. The building manager says the pest control people think the roaches are crawling in from other apartments through the electrical outlets. \n\nI live in the bay area CA and my apartment building isn't brand new, but is generally very well kept up and doesn't seem to have any sealing issues around the doors or windows that I can find. \n\nThe roaches don't seem to go for normal roach hotels, and I often find them in drawers and cabinets that only have dishes or silverware. In fact the one place I haven't found them is in the pantry cabinet, where all the food is. \n\nI'm kind of at the end of my rope here, and I don't know what else I can do. Is there some kind of roach control nuclear option that my building manager could arrange? Can they fumigate the whole apartment or something?\n\nI would appreciate any suggestions!",
    "score": 54,
    "url": "https://reddit.com/r/pestcontrol/comments/1hrlror/actual_effective_way_to_get_rid_of_these_roaches/",
    "created_at": "2025-01-02T04:38:54.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1jmedmm",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Accepted an offer to be a Pest Control Technician. Best advice?",
    "text": "I just accepted an offer to be a Pest Control Technician for a family run business in my area. I have never worked in this field and looking to make a career out of my new profession. What would be your best advice?   \nThank you all in advance! ",
    "score": 30,
    "url": "https://reddit.com/r/pestcontrol/comments/1jmedmm/accepted_an_offer_to_be_a_pest_control_technician/",
    "created_at": "2025-03-29T04:23:10.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1ph1lcv",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "What kind of rodent is that?",
    "text": "I’m not sure if this is a mouse or a rat, but I managed to catch this guy and set him free. What I’m worried about is that I’ve seen (and heard) several others - at least 3-5 others - I think I may have an infestation. My landlord is dragging their feet over the whole mouse/rat differentiation, but if they’re rats I’m going to go ahead and call an exterminator and send landlord the bill. \n\nAlso, I know that they’re getting in through shoddy work in the kitchen cabinets - that will be addressed too. ",
    "score": 26,
    "url": "https://reddit.com/r/pestcontrol/comments/1ph1lcv/what_kind_of_rodent_is_that/",
    "created_at": "2025-12-08T03:06:58.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1imhvkh",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "seeking recommendations for long-lasting indoor mosquito control",
    "text": "Hi everyone! I'm hoping to get some help finding an effective indoor mosquito control solution. I live in a tropical country, so mosquitoes are a constant challenge.\n\nI've already worked with exterminators twice, but unfortunately the sprays they used weren't effective for our situation. I'm now looking for a different approach.\n\nWhat I'm specifically looking for:\n\n- Indoor solution\n- Something proven effective\n- \"Set and forget\" type product (no daily maintenance needed)\n- Able to cover a whole room\n\nImportant notes:\n\n- Would prefer to avoid vape mats since they need daily replacement\n- Not interested in smoke-based solutions\n- Looking for alternatives to sprays\n- Would rather not use products requiring daily recharging\n\nI'd really appreciate specific product names I can search for, and purchase links would be incredibly helpful! \n\nThank you in advance for any suggestions that fit these criteria!",
    "score": 21,
    "url": "https://reddit.com/r/pestcontrol/comments/1imhvkh/seeking_recommendations_for_longlasting_indoor/",
    "created_at": "2025-02-10T21:38:23.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1o37sga",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Mice problems, and now a snake.",
    "text": "So we’ve had this mouse problem for a while, and the other day my we caught a snake in a sticky trap. \n\nBack story: We’re in a townhouse and the neighbors are hoarders. Last summer they had chickens and ducks and were forced to get rid of them. Well they didn’t get rid of the food or poop and that attracted rats outside. So our street and community had a LOT of rats running around. Hoarders had rat holes in their property and the county forced them to fill them in. The rat problem got resolved over the winter. Shorty after this, the mouse problem started. We didn’t see the mice often. Didn’t really see droppings either. The snap traps never worked and we stopped seeing mice in the springtime. Then in the beginning of Fall, we started seeing the droppings, then the mice. The exterminator put down snap traps and baits but nothing has worked. He thinks they’re eating whatever was at the neighbors house. Well guess who was evicted a few days ago? The hoarders. All their stuff was thrown out. They took a few days to go through it all with U-Hauls and they left the rest a huge mess. Anyway, I got so sick of the mice and these baits not working that I put down sticky traps behind the bathroom toilet and shower a few weeks ago, but that wasn’t even working. I know they’re inhumane but we’re at a point where we’ve tried everything else and it’s not working, and we’re still seeing mice. They’re not eating the bait. I put a candy bar in the middle of the sticky trap to lure the mice. A few days after their eviction this snake shows up in my bathroom. This was not in my bingo card!! Just when I thought this mouse problem couldn’t get any worse. \n\nSo my questions are:\nShould I expect to see more snakes? \nThis snake thing is freaking me out. Just fyi, this isn’t in a basement. This is in an upstairs bathroom. Closed windows, stairs to get up there. How did the snake even get into our house?\n\nI’m also wondering if this snake means that the mice infestation is really bad? Or maybe it’s all traced back to the hoarders house. \n\nAnd this exterminator never did an inspection of property to see if there were area where mice can get in. I asked a few times and he kept insisting it’s due to the hoarders. I did my own with a kit I bought on Amazon and I didn’t see anything outside but I didn’t check the attic. I really like the exterminator and he seems to know his stuff, but the problem is that it’s just not working and I’m frustrated with the situation. \n\nThe decision I have to make is should I get a new exterminator (maybe Terminex?) or keep the current one (owns his own business now and used to work for a big-ish company for 20 years).\n\nShould I hire a different exterminator? ",
    "score": 17,
    "url": "https://reddit.com/r/pestcontrol/comments/1o37sga/mice_problems_and_now_a_snake/",
    "created_at": "2025-10-10T17:46:43.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1me897s",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Indestructible Fleas Are Completely Destroying My Life!",
    "text": "I have read every single post about fleas already. I've done many hours of research. A little back story. I have one dog who is indoor only pad trained and has consistently been on bravecto with no lapse in medication.\n\n33 days ago I found a live flea on him. Then another. I wasn't getting bit. I immediately started vacuuming and mopping with boiling hot water and pinesol, laundering all bedding, cleaning furniture etc. (I have laminate flooring in my entire mobile home besides 2 area rugs).\n\nAbout a week later I started getting tons of bites and I'm allergic so I have a severe reaction to them. On July 12 I thoroughly cleaned the whole house then sprayed the entire floor with Pet Armour flea home spray and all the furniture with Adams flea home spray. It did nothing and flea numbers continued to rise. I've also treated the yard multiple times with granules and sprays.\n\nOn July 21 I had an exterminator come out and treat the whole house. I went from finding 3-7 fleas per day to finding 40-50 per day the very next day after he sprayed. Saturday I found over 100. Yesterday July 30 he came back and sprayed again. I found 38 fleas yesterday after he sprayed and I've already found 14 today from overnight, all alive.\n\nI keep a tin trap with water and a light over it, I have sticky traps everywhere, I keep a flea collar in my vacuum, I dispose of vacuum contents in a bag away from the house. I comb my dog several times a day, I clean daily. Who ever heard of the issue getting worse after treatment? It's not making sense! The infestation seems to be extremely concentrated in my bathroom and some in my bedroom (they connect). A few stragglers here &amp; there but I'm finding these all in my bathroom and bedroom!\n\nI've had underneath my home checked for damage or cracks in the ductwork, nothing. I don't see anywhere they could be getting inside. The Exterminator doesn't believe they are coming in from an outside source. I'm baffled. I have over 120 inflamed infected bites all over. I'm miserable. I cry everyday, all day. I haven't seen my family in over a month. I'm losing my sanity. I've tried everything recommended and it just keeps getting worse! I'm a paranoid wreck who's entire life is consumed by this situation, I need help! Any advice that isn't already out there for Indestructible fleas?",
    "score": 16,
    "url": "https://reddit.com/r/pestcontrol/comments/1me897s/indestructible_fleas_are_completely_destroying_my/",
    "created_at": "2025-07-31T17:44:58.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1m202m3",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "I have Fleas and I Can’t get rid of them! I also have no pets",
    "text": "Hi! I am having a terrible flea problem that I can’t get rid of. I just moved into a new apartment about a month ago and a previous tenant let me know there was a flea issue about 1 week after I moved in! The room was covered in diatomaceous earth that I had to sweep up. There was no previous pets and the tenant did not let the landlord know of this issue. When I had moved in I had let the landlord know instantly there was an issue. He does not believe me since the previous tenant never reported, but he still had exterminators come and flea bomb the house twice within the last 2 weeks. I’m constantly vacuuming, sweeping and mopping and we even have hardwood floors. We have been flea bombed by terminex twice within the last two weeks but it feels like the problem has gotten worse. I just found 6 fleas on the ground in my room today! I ordered spray and am constantly washing my sheets. We do have raccoons in the attic which I feel like the fleas can be coming from the vents. I also had flea jump on me outside on our deck patio. I need help bad, any tips, recommendations or tricks I just want them gone ! ",
    "score": 12,
    "url": "https://reddit.com/r/pestcontrol/comments/1m202m3/i_have_fleas_and_i_cant_get_rid_of_them_i_also/",
    "created_at": "2025-07-17T06:17:51.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1i67o0y",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "My Flea Infestation Experience",
    "text": "(Skip to the bottom to \"Key Lessons Learned\" section for instant ways to act on a flea infestation) \n\n\n\nI want to make this post because I have been dealing with a nasty flea infestation. I’d like to share some thing’s that worked and didn’t work for me. \n\n\n\nTo start off, I would definitely say my current infestation is pretty severe. And if you’re going thru an infestation, I understand how frustrated and defeated you may feel. \n\n\n\nTo provide some context: I moved into a new house (all hardwood flooring) where the previous tenant, who wasn’t the most responsible renter, owned several pets. I suspect they didn’t treat their pets with flea medicine, which likely left behind starving fleas and dormant eggs.\n\n\n\nWhen I saw the first flea after moving in, I was in such denial that I convinced myself I hadn’t actually seen it because I was so excited about the move. Looking back, I deeply regret not addressing the issue right away—it would have been much easier to fog the entire house immediately and contain the infestation before it got out of hand.\n\n\n\nThe next day I was painting a room, and I was sitting on the ground when I saw another flea and it jumped off of me. I stood up and immediately went to the bathroom to inspect myself. I was bit BAD. I was really sad and felt gross because I react badly to flea bites. I had no washer and dryer yet, so I shook my clothes outside and then took a shower. I went to Walmart immediately and I sprayed my mattress and couch with adult flea killing spray. I told my best friend about the situation, and she let me stay the night with her. \n\n\n\nThe following morning, I came back to the house to see how many dead fleas may possibly be laying around. The first place I looked was my white mattress. I looked REALLY REALLY hard with my phone flashlight, and I was HORRIFIED to count 15 dead fleas on the half of my mattress touching the floor. This was my “oh no” moment where I realized the house was truly infested. I went to Walmart and bought a flea fogging kit and placed one in the living room by the couch, in my room near the mattress, and the end of my hallway. I was convinced this would fix everything. *(Spoiler: it didn’t)* I left for 6 hours and came back feeling safe. I went continued painting my walls and eventually sat on my couch to take a break. From my 15 minute break sitting, I got bit up bad my stomach, back, and arms. CRAZY. After fogging and spraying??!? At that moment, I felt the deepest sense of failure and became more uneasy about the infestation. \n\n\n\nI went to Walmart again and bought flea spray killer for adult fleas AND larvae/ pupa/eggs with two more sets of foggers. This time, I thoroughly sprayed the entire house, including the floors, walls, baseboards, couch, mattress, clothes, boxes, and even floor cracks—anywhere fleas or larvae could be hiding. Then, I fogged every single room and the hallway before staying the night at my friend’s house to let the chemicals work overnight.\n\n\n\nThe next morning, I came back to the house prepared. I put duct tape inside-out on my ankles (IM SO GLAD I DID). I walked into the house and made myself a glass of water. Within less than 10 minutes of being inside and walking around, I noticed eight starving fleas stuck to the tape on my ankles. I was in complete disbelief. HOW? Panicked, I was about to leave, but as I lifted my glass to take a quick sip of my drink, I realized two baby fleas had jumped into the water while I was walking around. That was the final straw. I immediately called Orkin for professional help, and from there, the story is to be continued……\n\n\n\n\n\n***Key Lessons Learned:*** \n\n\n\n Understanding fleas \n\n* There are different types of fleas, but cat fleas are the most common—even on dogs.\n* *Flea Bites:* fleas prefer to bite animals first but will bite humans when they’re hungry. They typically bite in threes, but severe hunger may lead to large clusters or patterned lines of bites. Typically on ankles, waistbands, and body creases. Fleas can survive for 45 days with no host.\n* Vibrations (like from vacuuming), heat, and carbon dioxide trigger pupae to hatch and latch onto a host. It’s most effective to vacuum first, and then treat with sprays, powders, or foggers. As pupae patiently wait for months to latch onto a host. \n* Larvae feed on dust mites and dead hair so they are often present in mattresses and baseboards where dust and crap settles. \n* Eggs hatch every 1-10 days.\n* A female flea can lay 20-50 eggs a day, so prevention and acting immediately after the first sign is crucial. Don't avoid or ignore the situation!!\n* Fleas cannot survive extreme temperatures, dying instantly at -10°F or above 95°F. However, they can still survive outside in cold temperatures. Sources claim they can survive for 5 days in freezing temperatures.\n\n\n\nPrevention is crucial\n\n* Always treat your pets consistently with proper flea medicine to help prevent infestations. Even in the winter. My infestation is happening right now in the middle of January and it’s 8 degrees F outside. \n* If you think your infestation may be bad, it may be best practice to keep your vacuum cleaner outside to prevent fleas from getting out and reinfecting. Amazon has cheap vacuums for $60 delivered straight to your door.\n* It may be your best interest to throw away any area rugs if infestation is bad. I'm so sorry. It was hard for me to throw away mine and I was sad about it. But the underneath of your rug is a harbor for fleas to reproduce and hatch.\n* Prevention is the key to avoiding the nightmare of a full-blown infestation.\n\n\n\nDealing with an infestation\n\n* Act immediately when you first notice fleas. Spray and fogging every room from the beginning may help contain the issue, but it will only kill adult fleas. It didn’t contain the fleas for my situation at all. \n* Here's a source explaining why flea spray may not work.  [Flea Spray Didnt Work | Orkin](https://www.orkin.com/ask-orkin/flea-spray-didnt-work)\n* Using duct tape (sticky side out) on your ankles and wear tight clothing to protect yourself from getting bit. Some fleas will stick to the tape, but not all of them, as some can still jump off of it. If will act as a “shield” from being attacked from your ankles up.\n*  Setting traps will help gauge the severity of the infestation. It can be like water traps or one you purchased from the store. For me, I guess my white mattress that I sprayed was the \"trap\" that identified the severity of my issue.\n* I ended up throwing my mattress and couch to the dump since my infestation was so severe and stayed at my friend's house. I decided it was best to toss them in order to prevent further infestation since eggs, larvae, or pupa may be inside it feeding on dust mites. (I'm also paranoid at this point) This is something that may be worth considering. \n* Wash clothes and pillows constantly. Keep clothes off the ground or places near the ground where fleas can jump into and hide. They can jump 300x their size. They have jumped from the floor to my kitchen counter to put that into perspective.\n\n\n\nCall professional help\n\n* Call professional exterminators like Orkin to identify the source and fully eradicate the issue. Be prepared for multiple treatments and working with them to kill and prevent too. \n* In hindsight, I wish I had called an exterminator sooner. While it’s more expensive upfront (like starting at $400 in 2025), it would have saved me money and stress in the long run compared to trying to tackle the issue on my own. Calling is worth the peace of mind from this nightmarish experience. ",
    "score": 9,
    "url": "https://reddit.com/r/pestcontrol/comments/1i67o0y/my_flea_infestation_experience/",
    "created_at": "2025-01-21T01:59:02.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1l50kjj",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Please tell me what these are",
    "text": "Hi so I found these two on the same night about four or five days ago. My neighbor was having some leaking issues on her ceiling below me and maintenance thought that it was from us but it wasn't. They said they got the whole thing sorted out and told me it was some kind of Appliance issue in her kitchen on the ceiling?? But anyways I could hear them working on the ceiling below me and probably sucking the water out or whatever they were doing. That night I found these two one was outside of my bathroom and the smaller one was on the floor of my kitchen. They were both moving pretty slowly I would say and not scattering or running. I have the Exterminator come out today and he told me that the large one was in fact a roach but not a German roach. I don't think that he looked at the smaller one like I asked him to as he seemed to be in a bit of a rush. He sprayed some really strong stuff and told me to not let my pets out for at least 24 hours and I've already been looking at the advion gel to buy. Since finding them for 5 days ago I have not seen a single other bug anywhere and I do keep a pretty clean and average apartment. I'm not sure about my neighbors as I just moved here a month ago and I can tell that they all have heavy smoking issues so it wouldn't surprise me. I think that they might have crawled up the drain during whatever they were doing that was shaking my ceiling. But please somebody tell me are they both roaches? What should I do? Do I panic and cry? He didn't find anything while exterminating either and I haven't found any dropping or nest or anything like that. I have to live here for a whole year with no money to move again so I'm on the verge of losing my mind. For more context I live in Indiana (yay).",
    "score": 8,
    "url": "https://reddit.com/r/pestcontrol/comments/1l50kjj/please_tell_me_what_these_are/",
    "created_at": "2025-06-06T19:02:46.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1prv17t",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Considering pest control career but I'm 37.",
    "text": "I'm considering getting into this field but I'm a bit hesitant. I absolutely love bugs, I used to want to be an entomologist as a kid. I need a different job, I currently live in Missouri and work as a driver for Domino's, I make under $20k and I need something new. I think I would love this career, even with the bad stuff I'd have to deal with. Anyone have any recommendations on how to start? Which big companies should I look at or do I focus on smaller ones? Any information or tips would be very helpful and appreciated! I want 2026 to be a lot different than what my normal recent years have been. Thank you!",
    "score": 7,
    "url": "https://reddit.com/r/pestcontrol/comments/1prv17t/considering_pest_control_career_but_im_37/",
    "created_at": "2025-12-21T02:09:07.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1htjfls",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Is this career going to increase my risk for cancer?",
    "text": "After basically months of applications to various jobs, I actually heard back from a small pest control company that's willing to train me even though I have no experience. That was very exciting. I am not a squeamish person and I am definitely not afraid of bugs.\n\nMy dad and grandmother both really hate the idea though. They bring up how the insecticides kill farm workers and there's basically always class action lawsuits over them. My grandmother was a nurse from the 60s to the 90s, and I do tend to listen to her about stuff like this.\n\nAt the same time, the guys I've spoken to have seemed so nice, and this is a real career I could spend my life doing. I AM worried about cancer risk, and some quick google searches do claim there's an increased risk, so I figured I'd ask the community here. ",
    "score": 7,
    "url": "https://reddit.com/r/pestcontrol/comments/1htjfls/is_this_career_going_to_increase_my_risk_for/",
    "created_at": "2025-01-04T17:29:01.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1payo62",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "6-month infestation of flies, suspected to be phorid?",
    "text": "Hi all! Like many else here I feel I'm at my wits end :(\n\nI'm going to be very thorough in case it contains relevant information. Please pardon if its not.\n\nIn May, I found some eggs on some rotting bananas similar to the first image. Adults were mostly eliminated with a homemade trap (ACV, honey, water, dish soap) + flashlight combo, bananas/larvae were disposed of in the outside garbage can. Didn't see any for weeks.\n\nIn July, I was cleaning the litter trash when i found a massive infestation of the same eggs in my cat's 💩 (yes, it was as horrifically disgusting as it sounds. I just threw away the whole thing, lol).\n\nWe've been going through some renovations (June-October), and it was difficult to treat the stragglers as we didnt have much to work with. They came back and haven't left since.\n\nEcoStrong drain insect killer, diatomaceous earth, clove oil, and Terro drain insect killer have been effective enough in the bathroom, but not so much in the kitchen. I haven't tried light traps yet.\n\nI've noticed they're attracted to organic matter, specifically ACV, dried flowers, fruit peels, rotting starchy food, raw meat, and of course cat 💩. They aren't exceptionally fast (I can swat them mid-air), and they tend to scuttle around or just hang out, like in the second image.\n\nPlease God, any information would be greatly appreciated lol. I'm in SW Michigan, GR area if anyone knows of any exterminators.\n\nThank you very much.",
    "score": 7,
    "url": "https://reddit.com/r/pestcontrol/comments/1payo62/6month_infestation_of_flies_suspected_to_be_phorid/",
    "created_at": "2025-12-01T00:46:59.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1mwhojy",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Rats in my basement",
    "text": "I'm fed up. Even our exterminator doesn't know what to do anymore. Last year we bought a 1960s bungalow. We love our house EXCEPT that we've had five rats since last February. The exterminator came to seal off possible access points from the outside (attic, sagging slab in the basement entrance, blah blah). It didn't solve anything. We got a second opinion from another exterminator, who found nothing and recommended we do a smoke test with a plumber to see if it could be a broken pipe. The test shows that our plumbing is A1. The plumber advised us to close the toilet because rats could get in there since we don't have a check valve. That didn't solve the problem either.\n\nAfter all that, I wonder: where do the damn rats get in???? When we find them, it's in the subfloor of our basement, but we also hear them scratching in the walls.\n\nDo you have similar experiences, and if so, is there anything we haven't seen? I just cut down a shrub that was growing against our house to make sure they don't get in through a hole in the floor there. My next step is to tear out the entire floor and walls of our basement, but that would render our basement unusable. Help.\n\nAdditional information: These are house rats, commonly called sewer rats, so we suspect they're coming in from below (either through the plumbing or underground). Our foundation is a concrete slab and we have a garage drain (the garage has been converted into a room which is part of the basement. We live in Canada.",
    "score": 6,
    "url": "https://reddit.com/r/pestcontrol/comments/1mwhojy/rats_in_my_basement/",
    "created_at": "2025-08-21T17:35:42.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1ocy1gy",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Got a metal couch frame from Facebook marketplace that had cockroaches, now I have roaches",
    "text": "Hi! \nMy boyfriend and I recently got a metal futon couch frame from Facebook marketplace. The night we built it I saw one bug but I assumed it was due to the frame being in storage for so long and brushed it off. The next day I saw two large bugs and immediately called my bf who knew they were roaches. I am very lucky to have never dealt with a roach infestation so I was naive at first now I truly regret that. We only had the futon in the our living space for 24 hours before we brought it outside with plans to deep clean. We had sprayed it downed, scrubbed and hosed it down thinking we got all of them out. We were wrong, after bringing the metal frame back in 2 days ago we have now been seeing roaches again, more than before. We have now officially thrown away the cursed futon frame but are dealing with a cockroach infestation. We live in my parents attic and I do not want them to spread to the rest of the house. Should we call an exterminator? Try to deal with it on our own? Luckily it is early on but I don't want it to get worse and spread! ",
    "score": 6,
    "url": "https://reddit.com/r/pestcontrol/comments/1ocy1gy/got_a_metal_couch_frame_from_facebook_marketplace/",
    "created_at": "2025-10-22T03:50:50.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1mao6ff",
    "subreddit": "pestcontrol",
    "soc_codes": [
      "37-2021"
    ],
    "title": "Considering starting a career in pest control, but I’m not sure I can do it",
    "text": "I’ve seen all the good things Pest Control technicians say about this job and I’m thinking about giving it a go, thing is I’m not sure I’m “enough”, I’m a 22M with no college degree and I’m dumb as bricks I do my best to listen to instructions cause I know how much people hate repeating themselves (myself included), I’m not sure I’d make it \n\nWhat do I need to do and know?",
    "score": 5,
    "url": "https://reddit.com/r/pestcontrol/comments/1mao6ff/considering_starting_a_career_in_pest_control_but/",
    "created_at": "2025-07-27T14:49:23.000Z",
    "num_comments": 24
  }
]