[
  {
    "id": "reddit-1oi2shx",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "DM lied about promoting me so I wouldn’t qualify for mileage pay. Two years later, his own email cost him $21,000.",
    "text": "A number of years ago I worked as a pharmacist at the corner. I was a floater in a geographically large district, meaning I covered different stores across a huge region. One store was 100+ miles from home, in a rough area where staff had been robbed. Guess where my DM (via the market scheduler) kept scheduling me? Every. Single. Week.\n\nWhen I asked to rotate closer to home, he said I was the only one “experienced enough” for that location. Then I learned it is WAG's policy that floaters could claim mileage reimbursement for anything beyond 50 miles each way plus meals. That could have saved me a fortune.\n\nI filed the forms. He “lost” them. Every time. A coworker showed me how to fax them directly to Accounts Payable instead, right in the pharmacy, and suddenly my DM was blowing up my phone. He begged me to stop.\n\nThen came the bait: he’d “make me staff” at that store, no raise yet, but soon. And the reminder that staff positions aren’t eligible for mileage pay. I needed the stability, the job market for my area was garbage, so I agreed. A bizarre catch that should have been my first clue: I had to keep this \"promotion\" secret. Apparently I would be eventually replacing the current staff RPh at the store.\nSpoiler alert: That never happened.\n\nFast-forward two years. The store was so utterly toxic, I was burned out, and I asked to go back to floating. DM's response?\n\n&gt; “You are already in the role of market pharmacist- we just kept most of your shifts at a consistent store for you and the customer’s familiarity.”\n\n\nThat’s when everything clicked. He’d never actually promoted me, he just said he had, to stop me from filing reimbursements. And that single email confirming that I’ve “always been a floater” became my smoking gun.\n\nI found a new job (my dream career, outside retail) and handed in my notice. Then I went digging through two years of mileage records. Policy said nothing about time limits on reimbursements, so I spent my notice period faxing in every last one. Hundreds of shifts worth. I skipped meal receipts to keep it simple.\n\nA few weeks later, the checks started arriving. Tax-free. One after another.\n\nCue another panicked call from the DM, now with some loss-prevention manager on the line, claiming I was “never eligible.” They didn't even know how much these were going to total out to. I played coy, strung then along and calmly declined to discuss anything at length over the phone. Over the next few days over email, they got more aggressive, demanding renumeration and threatening legal action because as a staff pharmacist, I was ineligibleand I knew it. \n\nOnly then, calm as you like, did I send my coup de gras. I reminded them about that email, and that I had separately confirmed with HR that as a floater I was fully entitled to the reimbursements. Never heard another peep from any of them.\n\nFinal total: well over $21,000 in tax-free mileage reimbursement.\n\nDM and the store manager tried to play some wierd power game and save a few bucks by lying. Instead, I took every dime I was entitled to all at once, right at the end. Almost certainly screwed the store and District budget sheets for a stretch.\n\nMoral: know your company policies, get everything in writing, and never, EVER trust some middle management suit to not gaslight you out of what you’ve earned.\n\nTl;dr: DM lied to keep me driving 200 miles a day to a shitty store. I found out, and got a $21k goodbye present.",
    "score": 1020,
    "url": "https://reddit.com/r/pharmacy/comments/1oi2shx/dm_lied_about_promoting_me_so_i_wouldnt_qualify/",
    "created_at": "2025-10-28T07:10:06.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1ju5nyo",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "I cussed out a rude customer today",
    "text": "I cannot believe this happened, but it felt great. \n\nI am a pharmacist at X store. I’ve worked retail for years, I know the patients that make you want to rip your hair out. I know how it feels to be the tech/pharmacist that has to stand there and give them the customer service voice with the appropriate answer, when you would love to backhand them. \n\nToday, I got off my shift at X pharmacy (finished around 1230pm). I drive to Y pharmacy to pick up my brother’s rx. They have no idea I’m a pharmacist, and I prefer to keep it that way. I thought their lunch was 130-2pm, but turns out they close 1-130pm for the lunch break. I was there shortly before 1pm. \n\nI’m thinking “shoot. I totally forgot, oh well”. \n\nThere’s one person in front of me in line and a one behind me when the tech hits the lights and announces the lunch break to us. \n\nAlmost on queue, the guy behind me starts going OFF. Yelling at the tech that is helping that last patient. Yelling that there’s enough people back there behind the counter, he should get his med filled. “How many people does it take to put my fucking pills in a bottle?!? Oh, we all have to come back in an hour because the pHaRmaCIst needs to eat a SANDWICH”\n\nI felt my blood boil in half a second. I could see the tech with the face of “I wish I could say something but I can’t.”\n\nI went off on that asshole. Told him “this pharmacy is open 12 hours a day with 1 pharmacist and a 30 minute lunch break is the fucking BARE MINIMUM. This place is open 7 days a week. Are you kidding?? You’re standing here in a wife beater and carrying a case of beer at noon on a Monday. You can find a fucking time to come back when they aren’t on their lunch break!! Go fuck yourself” and walked off. \n\nNot gonna lie. It felt good. ",
    "score": 950,
    "url": "https://reddit.com/r/pharmacy/comments/1ju5nyo/i_cussed_out_a_rude_customer_today/",
    "created_at": "2025-04-08T04:55:38.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1l99epa",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Iowa passes PBM overhaul: Pharmacies now reimbursed at cost, can appeal rates &amp; patients choose where to fill",
    "text": "Gov. Kim Reynolds signed a new law today (Senate File 383) that places major restrictions on PBMs operating in Iowa. Key changes include:\n\t•\tPharmacies must be reimbursed at or above acquisition cost plus a professional dispensing fee\n\t•\tPBMs must allow pharmacies to appeal reimbursement rates\n\t•\tPatients can no longer be steered to specific pharmacies or mail order—they now have full choice\n\t•\tPBMs can’t require accreditation beyond what the state already mandates\n\nThis is a big win for independent and rural pharmacies who’ve been struggling with below-cost reimbursements. It could also have ripple effects for other states considering similar legislation.",
    "score": 859,
    "url": "https://reddit.com/r/pharmacy/comments/1l99epa/iowa_passes_pbm_overhaul_pharmacies_now/",
    "created_at": "2025-06-12T00:58:28.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1m1t9cm",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Petty Pharmacists",
    "text": "I am a floater, but I have a set schedule. \n\nYesterday I worked with a staff pharmacist (also their set schedule). This person went out of their way to email the DM to say I wrote my own prescription for a spacer. I didn’t use my own license as the prescriber. It was not for me or my family. \n\nThe geriatric patient I was counseling on their rescue inhaler didn’t have the dexterity to coordinate the inhaler with their inhalations and was wheezing/coughing in front of me. I wrote it out as a verbal, dispensed it, finished the consultation with him taking the medication in front of me, then I called the office to let them know I tacked on the spacer to the inhaler rx (which they were obviously fine with). The other pharmacist didn’t have to verify the data entry or the product, so their name/license was not associated with my decision.\n\nNo prescriber ever in the history of medicine would say no to a request for a spacer to accompany a new HFA inhaler. A lot of them don’t even know spacers are prescription only. \n\nThe next time this pharmacist substitutes an 18 gram albuterol HFA for an 8.5 gram albuterol HFA without calling the doctor’s office I’m calling 911😤\n\n\n\n",
    "score": 586,
    "url": "https://reddit.com/r/pharmacy/comments/1m1t9cm/petty_pharmacists/",
    "created_at": "2025-07-17T00:25:00.000Z",
    "num_comments": 226
  },
  {
    "id": "reddit-1mddw4b",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Pharmacy is a dead end job",
    "text": "I've been a pharmacist for 11 years and looked at my social security statement. My salary has essentially been the same since I started 11 years ago. The first few years were highest since I worked overtime and had a per diem job on top of my full time job. Later on, I had kids and quit my per diem and stopped picking up overtime. I've only gotten maybe 3 significant raises the whole time, and negligible bonuses. Most years there was no raise. My purchasing power is much less today than 11 years ago. I'm just getting eaten away by inflation every year. \n\nLuckily I bought a house before Covid. If I tried to buy one today, I wouldn't be able to afford it.",
    "score": 560,
    "url": "https://reddit.com/r/pharmacy/comments/1mddw4b/pharmacy_is_a_dead_end_job/",
    "created_at": "2025-07-30T18:08:48.000Z",
    "num_comments": 320
  },
  {
    "id": "reddit-1ixzlgs",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "The clozapine REMS has been eliminated by the FDA",
    "text": "February 24, 2025 - Beginning today, FDA does not expect prescribers, pharmacies, and patients to participate in the risk evaluation and mitigation strategies (REMS) program for clozapine or to report results of absolute neutrophil count (ANC) blood tests before pharmacies dispense clozapine. FDA still recommends that prescribers monitor patients’ ANC according to the monitoring frequencies described in the prescribing information. Information about severe neutropenia will remain in the prescribing information for all clozapine medicines, including in the existing Boxed Warnings.  ",
    "score": 551,
    "url": "https://reddit.com/r/pharmacy/comments/1ixzlgs/the_clozapine_rems_has_been_eliminated_by_the_fda/",
    "created_at": "2025-02-25T16:51:14.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1jljwce",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Well, it finally happened. Losing my job due to funding cuts",
    "text": "I’m a psych pharmacist (working in a position funded by state and federal funding) and I treat patients with substance use disorders. Funding was already shaky with cuts to NIH funding earlier this month, but yesterday’s abrupt cuts to fund public health departments, mental health care, and substance use disorder treatment sealed the deal. \n\nWhile I’m sad to lose my employment, I’m devastated thinking about the impact of these cuts to our patient population, and how the next 4 years will go.\n\nWith that being said, any job leads or words of encouragement/hope would be greatly appreciated. ",
    "score": 506,
    "url": "https://reddit.com/r/pharmacy/comments/1jljwce/well_it_finally_happened_losing_my_job_due_to/",
    "created_at": "2025-03-28T01:43:13.000Z",
    "num_comments": 118
  },
  {
    "id": "reddit-1l4mea9",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "8 years of school &amp; 2 years of residency later…",
    "text": "Just a quick rant. For some context, my family recently found out my grandfather has cancer and needs surgery to remove his tumor. My grandmother (retired RN) often comes to me for medicine advice or to chat about what’s going on from a medical perspective. We are able to discuss it in a way each of us understand, which we are unable to do with the rest of my non-medicine based family members.\n\nMy (28F) sister (30F) found out about that I was informed about my grandfather first, to which I said “[grandmother] trusts me with this to help since I work in healthcare”, and lost her shit. Mind you, my sister has some mental health issues so I am somewhat used to staying cool, calm and collected when we we argue.\n\nThis, however, is just too far. Why dedicate my life to a profession and specialty when this is how my own family members treat me and my career? I’m sick of pharmacists being under appreciated and undermined simply because people don’t understand what we do (and this goes for every type of pharmacist). It’s exhausting having to constantly advocate for our value in the medical field. I work very closely with physicians and APPs, and often provide most of the recommends for medicine treatment plans given the nature of my specialty. I bet if you ask everyone - including MDs, APPs, and support staff - who are the most valuable members of the team? 9 out of 10 would say the pharmacists.\n\nIt’s been a hard, tough week and getting this text just really hurts. I know she’s proud of me, but god damn. All I ever try to do is be supportive despite no one ever supporting me. \n\nAnyways, rant over. Thanks for listening &lt;3",
    "score": 489,
    "url": "https://reddit.com/r/pharmacy/comments/1l4mea9/8_years_of_school_2_years_of_residency_later/",
    "created_at": "2025-06-06T07:23:58.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1jz29dv",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Actual Pharmacist Side Hustles",
    "text": "I wanted to post this to discuss actual side hustles that don't include the typical answers to the side hustle posts.  These are all side hustles I have engaged in, or have personally known witnessed other pharmacists to engage in for money. \n\n1. This is not a retirement and saving post. Please save that advice for an appropriate thread. This post is made with the assumption everyone has done that already. We've already been to our financial advisor, so don't waste anyone's time with those comments. This is for people who wanna  ball out, or people like me who have crazy student loan debt and don't want to wait 20+ years, or sit at a job we don't like and pray to our corporate overloads/rapidly destabilizing government to forgive our loans.  Same thing with FIRE.  I get it; it's excellent, but this post is about MAKING Money, NOT Saving.  So put those comments elsewhere. \n\nThat being said, if you haven't got your savings plan in order, stop reading, see a financial advisor, and return to this when you're done.\n\n\n2. Let's address obvious stuff so once again, the thread doesn't get filled with posts about just working more hours. Duh. Try to get overtime and a PRN job. These are the easiest ways to make more money (but don't count as \"side\" hustles; it's just more of the same stuff you already do. So, let's not waste people's time on this thread with the obvious.\n\nOK HERE ARE THE ACTUAL TIPS:\n\n3. Incorporate yourself-  These are real side hustles; as such, they will require time, money, and effort to make any money. I don't think passive income exists, so if you're looking for ideas about passive income, you won't find them here. The first step is incorporating yourself so that the money you spend getting any of these side hustles started actually comes back to you at the end of the year, and that that money you make from these side hustles doesn't just end up getting funneled directly to uncle sam ( I used Bizee.com)  its super easy they take care of everything for you.  there is no reason not to do so. If you have questions about that, ask in the comments or DM me\n\n\n4. Consulting - Don't sleep on it.  at the end of this year, this will be my most significant source of income. there are several ways to get into consulting, and once you start consulting, there are multiple ways to get paid for a single project and limitless possibilities to grow.  You can start by contacting larger consulting firms that need pharmacist insight.  If you have experience(compounding, Purchasing, or are in a decision-making role, you can make decent money for low to no startup cost and time), I make 60$ per survey and 250/hr on a phone call/zoom meeting to answer questions.  ALpha1 insights is a good place to start. I also started my own consulting firm, which is now my main source of income and will allow me to quit my full-time w2 job by 2026.\n\n\n5. SALES - grew out of meeting and talking to people while consulting. Several Tech companies looking to break into the pharmaceutical industry. It pays handsomely if you can help them converse with healthcare systems or give feedback on their products.  I currently have 5 companies I work with, once again low, with startup costs and high rewards. For most of them, I get 2500/sale, or for managing an ongoing client, I get 1k/month per client for as long as that client remains a customer.  ( it takes a lot of time; I'm always on my phone,  and I'm sure my coworkers think I have a social media addiction, but I'm actually making $$$$ while I'm making $$$ lol ).  A good way to do this is to go to conferences and NOT TALK TO THE PHARMACISTS.  Talk to the people who actually own the businesses and technology. Show an interest in their product.  Understand that most of the people who are actually making real $$ in our industry are not Pharmacist ( hell I know technicians using this strategy that are making more money than any PharmD I know)\n\n\n6. Freelance Medical writing - this one is a bit more difficult but, when done well can actually pivot you into a career in the industry, or you can keep it as a side hustle (my initial intent with this was to try and backdoor myself into the pharmaceutical industry, but I actually just ended up offering it as a service in conjunction with my consulting company).  ASHP has an AMAZING course on Medical writing. It's like 600 $, but I think it's well worth it. I did the course and then immediately went to find some freelance work. Can't find freelance work? It's probably because you suck; write your own stuff for free until you don't suck ( start a health blog or something. Don't worry about the $$ yet). Once you have a portfolio of stuff that doesn't suck, you should be able to get freelance work.  once you have a decent reputation for doing that, you may be able to get some Medical review work (reviewing stuff other people write for accuracy).  Hint (GLP1 - RAs are a hot topic right now.) \n\n\n7. MA for Clinics - Want a fresh slap in the Face as a PharmD? Medical assistants have more prescriptive authority than you do ( at least in my state).  I want some hope as a PharmD - MAs, NPs, PAs, and many young MDs have no idea how to write RXs and hate taking phone calls about correcting their Rxs. Right now, there is a gold rush in the wellness space where MDs and mid-levels are opening independent clinics. They don't have software, and they don't have guidance on how to write for compounds; you can offer to remotely help send (predraft their RXs) and/or take phone calls about RX issues for them. Find a health spa, work out a contract, and get paid; you can literally do as much of this as you can handle. I have yet to be turned down. You can easily talk a spa owner out of their shitty MA; even if you cost a lot more, they have had an MA constantly interrupt their appointments to ask them simple questions; you solve that problem.\n\n\n8. Multi-state licensure - all you can do with multi-state licensure can be its own post.  Im talking 10 + states. It's expensive, but you can write it off once you incorporate it yourself. This is a fantastic move, especially if you are single and unattached.  it takes time and effort.  DM me if you want more specifics about what you can do with multi-state licensure. If I get enough comments/DMs about it, I may do its own post.  I have a post about the fastest way to knock out an MPJE. I got 10 licenses in one year while working full-time with that method.\n\n\n9. ACPE and other accreditation bodies accredited course/content creation - (DISCLAIMER I HAVENT GOTTEN PAID FROM THIS YET). I know some Pharmacists who get paid to create CE content and are currently working on a course ( and guess what? It's not even for pharmacists ). I haven't gotten a dime yet, and I am a lead on the project but not the sole contributor)  this was born out of my medical writing projects. I will only encourage you to try it with a grain of salt.  I have sunk a ton of time into this so far, and I hope it pays off. The idea is that once the project is complete, we can get paid for it regularly until the content's expiration date. It is too early for me to recommend it wholeheartedly, but I will update this thread later(someone holds me accountable for the Update lol)\n\n\n10. Public speaking -  another disclaimer because I haven't actually done this myself, but I personally know someone who does this)  all of these pharmacies (and other organizations) that have all these conferences are apparently DYING to find public speakers.  (yeah, that pit in your stomach you get from just saying public speaking is probably why)   but if you're an actual extrovert in a field full of introverts, you can clean up by taking public speaking gigs to reach out. A lot of the time, even at pharmacy conferences, the people who are doing the talking aren't even pharmacists. You can also get Zoom gigs ( they pay a lot less ). Some of the conference gigs pay 5-10k +. I would reach out to any org/company that does live CE or conferences and see if you can get a slot, build a portfolio. Once again, I'm not writing from a ton of experience, but I have seen evidence that this can be lucrative.\n\n\n\nThis is all I have so far, but please comment if you have other ideas. I would love to hear and try them. GOOD LUCK!\n\n",
    "score": 471,
    "url": "https://reddit.com/r/pharmacy/comments/1jz29dv/actual_pharmacist_side_hustles/",
    "created_at": "2025-04-14T15:52:16.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1mmcysx",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "PSA:  CVS is not worth taking your life over. Please read.",
    "text": "In light of the recent pharmacist suicides, I just felt like I needed to make an urgent PSA to my fellow pharmacists and especially new grads who may feel like they are in or close to being in the same “situation”, especially at the shithole that is CVS Pharmacy. \n\nThe TLDR is: \n\nDON’T. DO.  IT. \n\nDo NOT attempt suicide. Please. \n\nCVS does NOT deserve your life. \n\nYou will get through it and look back and be glad you didn’t. I promise. I have been there. Nothing is permanent, nothing is forever.  This period of time is a nothingburger in the bigger picture of life. \n\nCVS is not the end. THEY NEED YOU MORE THAN YOU NEED THEM. Trust me. \n\n————————————\n\n/////////// STORY TIME /////////////\n\nIn early 2019, I contemplated finding a way to kill myself in the bathroom at the CVS I was managing (it’s always the bathroom). And it wasn’t even a bad location. I just felt…trapped….like most of the pharmacists currently working at CVS. Like this was what my entire future was going to be now, riddled in student debt in an oversaturated field, and I was replaceable….and there was no way out of this life if I wanted to become debt free and start living my life.  \n\nI was stressed, I was trapped….I was clinically depressed to point of no return. It didn’t help that NOBODY in my family understood my pain. I couldn’t talk to anyone. I wanted to cease to exist.\n\nA small part of me, however, was still fighting. \nPartly because of how much I hated CVS. I initially thought killing myself in the bathroom would send a message. I thought I’d be a martyr, that my death would help bring to light the evil that is CVS. \n\nBut I thought more closely and came to realize I was wrong.  My death would be swept under the rug and only my family and friends would suffer.  Time will pass, and nobody would remember me for being brave. I’d just be another statistic.\n\nI wasn’t going to let that happen for CVS.  \n\nSo I decided to leave at the first chance I get. If I was going to be depressed, I sure as hell wasn’t going to be depressed in a sweatshop. Let me be depressed just sitting behind a computer. \n\nI didn’t know if my depression would ever subside or if I’d forever be in this state of pain. They say depression lingers, and since fluoxetine was not helping, I was prepared to live with this pain forever. \n\nBut holy hell.  \n\nWithin 2 months of leaving, one random day…I physically felt the clouds finally lifting! The colors came seeping back into my life. Hopes and dreams of the past came back, optimistic feelings came back. I came back. To life. All in one sitting. It was wild. \n\nIt was a feeling I’ll always remember cause I really didn’t think it was possible. I finally quit the fluoxetine. \n\nLooking back now, I can see clearly that CVS was my source of pain. That what seemed so overwhelming and dramatic at that time….was just merely a brief, tiny speck of anguish in the grand scheme of things. I wasn’t able to see it then because of the nature of depression. \n\nBut I’m SOOOO glad I didn’t go through with the bathroom plan. I’ve been THRIVING and SLAYING ever since….all the while CVS is struggling more than ever. I’m so glad I did not let them win over me.  \n\nAnd I want people to know that.  As cliche as it sounds, there IS a light at the end of the tunnel. You have so much life left to live after CVS. Don’t worry bout your student debt. That too shall pass. Don’t worry bout trying to make metrics or appease your Karens. They’ll always be there. Don’t worry about getting fired. THEY NEED YOU MORE THAN YOU NEED THEM.  \n\nJust do your job, take care of your patients as best as you can, and get out. Easier said than done. But it can happen. Make the moves necessary to make it happen.  \n\nAnd if for some reason you can’t just yet, just keep this in mind:  nothing is permanent. Nothing is forever. Except death that is unnecessary. But you are not trapped or helpless.  You will make it out alive. \n\nPlease talk to someone. Someone you trust and can talk to easily. If I were back in that situation, I’d find a therapist. A good therapist is worth their weight in salt.  You just need someone from the outside with a clearer mindset to bring you back to reality and keep you sane and grounded. \n\n Don’t be afraid to reach out. ",
    "score": 469,
    "url": "https://reddit.com/r/pharmacy/comments/1mmcysx/psa_cvs_is_not_worth_taking_your_life_over_please/",
    "created_at": "2025-08-10T08:09:58.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1izxduj",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Appreciation Post: pharmacist kept me afloat.",
    "text": "UPDATE: He was very happy to see me. Asked what I’ve been up to and was extremely happy to hear I’m living a stable life. I told him about travelling across the world, working in hospice, having a private therapy practice, and showed him a wedding photo. He was thrilled to hear my reduction in medication and said he knew Olanzapine always worked the best for me. He thanked me for stopping by and said it was a proud full circle moment to see me thriving and happy. He said I always had the passion, drive, and goals— I just had a clouded brain with mental illness. 2 years mania-free probably made him the happiest of all. \n\nNot sure I’ll ever see him again; extremely thankful for this chance though. \n\n—\nI have several chronic health issues, physical and mental. Notably, bipolar that was severely untreated for many years. I got to know the pharmacist who worked overnights because I would be manic at 3am and call him incoherent, manic. He eventually advocated for me to be prescribed a manic protocol so he could *do something* when I was in such distress. \n\nAnd, voila. 10-40mg Olanzapine, 15-30mg Temazapam max 3 day supply. Even as a social worker now I have literally never seen anything similar replicated even by people with similar diagnoses/chronic symptomology. \n\nThat kept me out of the hospital…seriously I haven’t been back to the ER or admitted for MH since. But I’ve used that protocol many times. It works— he knew I’d work because he knew I would get that in crisis at the ER and he thought (I guess) why not outpatient the same thing??\n\nHe really cared for my wellbeing. Went above and beyond and beyond. He knew I got agitated waiting in line. He knew what set me off or made me paranoid. He knew my file even though it was complex and evolving. (15+ PO meds, 3-4 IV— I had a port a cath) \n\nI’m telling you my medications were VERY complicated and I was STILL unwell. Being treated for epilepsy only to find out it was narcolepsy a couple YEARS later. I was severely manic every couple months. \n\nEven when I moved away, if I needed something he would still pick up the phone. \n\nI haven’t seen him since 2020 or talked to him since 2021. I happen to be vacationing where he works and I’m gunna stop by and let him know I recovered, became a social worker, got married, bought a home, and getting ready for a baby. \nAnd…manic protocol no longer active, 2+ yrs no episode. \n\nHe will be proud— but also hella surprised. \nHe never gave up on me when most of the medical system had— lost cause, chronic user of the system, poor prognosis. \n\nSo ya, the customers who are needy and kinda annoying but you also kinda empathize: we do recover. And sometimes that support is a pharmacist. For me, this person was accessible, knowledgeable, and gave a damn. \n\nTy for what y’all do. ",
    "score": 411,
    "url": "https://reddit.com/r/pharmacy/comments/1izxduj/appreciation_post_pharmacist_kept_me_afloat/",
    "created_at": "2025-02-28T02:33:07.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1n8rykr",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Finally! Someone who isn't afraid to call it like it is.",
    "text": "It's not often something comes across my inbox that sparks my hope for the profession. I think we've all had concerns about boards of pharmacy at some point in our career, and it's good to know that decent honest people are (were in this case) part of them with purity of purpose in their heart calling out wrongs where they see them. Do better, South Carolina! ",
    "score": 410,
    "url": "https://reddit.com/r/pharmacy/comments/1n8rykr/finally_someone_who_isnt_afraid_to_call_it_like/",
    "created_at": "2025-09-05T01:16:38.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1htkn70",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Moody boss",
    "text": "I was berated by my boss (also a pharmacist) for trying to prevent a shelf count discrepancy by writing on the top of one of the bottles. Med errors are not likely to happen due to this in our pharmacy, but just look at them! \n\nHe's like: \"You (staff) pharmacists cannot even read the bottle labels to tell the difference??\" \n\nOn paper he's a very fair and objective guy plus also VERY clinically knowledgeable, and for that I respect him greatly, but he does not know sometimes to be tactful in normal conversations and just blurts out highly opinionated words. He does not enjoy being the pharmacy manager and often lets us explicitly know this. 🙄 The next day one of the other staff pharmacists who overheard asked me why our boss was getting so bent out of shape over it. I said that's just the way he is. 😮‍💨 \n\nSide note: Can I report this manufacturer to the FDA medwatch program for this dangerous look alike labeling? Does that division still exist? ",
    "score": 393,
    "url": "https://reddit.com/r/pharmacy/comments/1htkn70/moody_boss/",
    "created_at": "2025-01-04T18:22:01.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1j1cp6c",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Why is our profession such a scam?",
    "text": "Currently in the process of applying to residency and woah do these prospects suck.\n\n8 years of school and 2 years of an exploitative residency program just to make less than a retail RPH? And it’s not even less than a retail RPH we make about the same as advanced nurses, PA’s, X ray techs meanwhile they all had a fraction of our education and debt.\n\nFor example not to compare ourselves to MDs but sheesh pgy2? That’s almost the same amount of residency MDs have to take (usually pgy3 and 4) and they have immensely more scope of practice and 2-4x our salary?\n\nAnybody else feel the same or completely regret going this path?",
    "score": 378,
    "url": "https://reddit.com/r/pharmacy/comments/1j1cp6c/why_is_our_profession_such_a_scam/",
    "created_at": "2025-03-01T23:18:50.000Z",
    "num_comments": 243
  },
  {
    "id": "reddit-1icigwz",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "\"Don't chew the Tessalon Perles\"",
    "text": "God, how you poor people must suffer. My daughter picked up my prescription and that was what the pharmacist told her to tell me. \n\nMy first reaction was \"I'm not that stupid,\" but having worked w/ humans, I quickly realized that, like every other sign that evokes that reaction, this was because someone had already been exactly that stupid. Or even worse. And then they complained, exhibiting it for all to see. \n\nMy restaurant equivalent was when the kid said to his mom, \"I don't like these!\" about his fried shrimp. *Without looking at him*, she said, \"You liked them last time you had them.\" \n\nGot your back, little man! \"Maybe that's because he's eating them tail first this time.\" Cue the Pikachu look. \n\nSo, what's your story of unnecessary but necessary instructions?\n\n PS: I gave my pharmacy buds a box of individual cookie packs for Christmas. Since they said they eat homemade, they're getting those for Valentine's Day. Love you guys!",
    "score": 352,
    "url": "https://reddit.com/r/pharmacy/comments/1icigwz/dont_chew_the_tessalon_perles/",
    "created_at": "2025-01-29T01:38:55.000Z",
    "num_comments": 248
  },
  {
    "id": "reddit-1pn94v1",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "STAT op-ed: \"I’m a CVS pharmacist. My retail pharmacy colleagues and I face a crisis\"",
    "text": "Hi everyone,\n\nI'm the opinion editor at STAT, the health/medicine publication owned by the Boston Globe. I've been reading this sub for quite some time now and have long wanted to publish an essay from a chain pharmacist about the difficult environment at the moment. \n\nIt finally happened last week, when I published a [fantastic op-ed](https://www.statnews.com/2025/12/12/pharmacists-crisis-union-patient-safety/) by a pharmacist at a (unionized) CVS in Rhode Island. He writes:\n\n&gt;Anyone who has visited a chain retail pharmacy knows that we are understaffed. It becomes obvious as patients stand in a long line, watching one of the few technicians waiting for the pharmacist to finish verifying an order before they can help the next customer. That pharmacist has a phone to one ear and is helping another technician with an antibiotic to be mixed for a sick child at the drive-thru window. Another patient stands at the counter waiting for a consultation on a potential drug interaction as the phone rings, unanswered, with a doctor on the other end. The waiting room fills up as immunization appointments begin to run behind.\n\n&gt;These working conditions have become so normal that all pharmacists like me can think is “it could be worse.” For us it has become just another Tuesday.\n\nI hope that it will resonate with those of you who work or have worked at chain pharmacies. ",
    "score": 344,
    "url": "https://reddit.com/r/pharmacy/comments/1pn94v1/stat_oped_im_a_cvs_pharmacist_my_retail_pharmacy/",
    "created_at": "2025-12-15T14:46:18.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1nhoxcz",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "I’m sick of this “residency or bust” culture",
    "text": "Short context - I have been working HARD at my workplace for the past 5 years as a licensed pharmacist and even longer before that as a student. I am the only one left who essentially knows everything about the place. Our head supervisor stepped down this year and originally appointed me to take over, but my workplace said “no we need to do a job search.” So while that’s going on, I’m putting in extra time for no extra pay and essentially doing the work of the supervisor. The no extra pay thing is not a huge deal because I deeply love this place but I wanted to mention it. So today, I got informed that I did not get the position. When I asked why, I was told it’s because I don’t have a residency. We are hiring someone who graduated residency in July and has never stepped foot in our building. Despite my actual, proven knowledge and experience in this specific environment, despite my team advocating for me, we are hiring an unknown literally just because of the residency factor. I just need to rant because this is absolutely insane to me. Why is a piece of paper worth more than my actual, specific experience and the recommendations of my team? ",
    "score": 342,
    "url": "https://reddit.com/r/pharmacy/comments/1nhoxcz/im_sick_of_this_residency_or_bust_culture/",
    "created_at": "2025-09-15T15:26:19.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1pkums7",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Pharmacist helped end Hep B birth dose and APhA is silent 😡",
    "text": "A pharmacist — the first pharmacist with voting power on the ACIP — Hillary Blackburn just voted to remove universal Hep B vaccination from the childhood schedule, despite the evidence and data supporting it.\n\nPharmacists should be speaking out loudly when one of our own makes a decision that could cause real harm, but I doubt the profession will hold her accountable. \n\nAmerican Pharmacists Association do you have anything to say?",
    "score": 329,
    "url": "https://reddit.com/r/pharmacy/comments/1pkums7/pharmacist_helped_end_hep_b_birth_dose_and_apha/",
    "created_at": "2025-12-12T15:24:50.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1i327h5",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "I hate everything about being a pharmacist",
    "text": "I have been a pharmacist for 5 and a half years now and I have hated all of them. I have found scarcely any joy in this career during that time but having invested so much money into it, I don't see any way out. Pharmacy was a mistake so huge I'll be paying for it until I die.  ",
    "score": 325,
    "url": "https://reddit.com/r/pharmacy/comments/1i327h5/i_hate_everything_about_being_a_pharmacist/",
    "created_at": "2025-01-16T23:12:51.000Z",
    "num_comments": 262
  },
  {
    "id": "reddit-1j3n76p",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "I regret my residency",
    "text": "I feel like in school they basically scare you into thinking you will have no job security unless you do a residency and you will have no longstanding career without one either. Well here I am, about to graduate (god willing) my PGY-2, with no job prospects, no call backs, no nothing. I’ve been applying for jobs since October and nothing! I feel like I completely wasted my time doing a residency. I should’ve just graduated school and started working retail right away. ",
    "score": 219,
    "url": "https://reddit.com/r/pharmacy/comments/1j3n76p/i_regret_my_residency/",
    "created_at": "2025-03-04T22:14:14.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1l5zbuw",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "I finally did it and found a way out (well, not completely)",
    "text": "I’m not looking for praise or a virtual high five, but I finally did it. I’ve been a licensed retail-only RPh for 21 years. \n\nMe and my wife this week settled on an already existing dog boarding business. The independent pharmacy I’ve been at for the last 10 years is letting me work 10-20 hours a week, so I’m still able to my keep my foot in the door. We’re taking a huge financial risk that we believe is worth it in the long run. \n\nThe reason I’m telling this pharmacy sub is you guys and gals need to take a real hard look at this profession, and how quickly it’s declined in the last decade or 2.  I’m only speaking of retail since that’s really all I know. Lots of words come to mind thinking about retail pharmacy, and I’m sure you each have your own.  Heck, there might actually be some of you on here who still have faith and absolutely love your job. All I have to say to that is: good for you. But, in looking at these insurance contracts, the reimbursements, the DIR fees, etc, it’s not looking great (to say it nicely). \n\nWhen I got out of school in 04, I had all the OT I wanted, a yearly sign on bonus/incentive/whatever the heck Eckerd use to call it for yearly tuition assistance through college, 4 weeks paid vacation to start, drug reps dropping off delicious food, pharmacy pens and coffee mugs, no vaccines to do, no MTMs, etc etc. It was beautiful. \n\nAnyway, my main point here is if you have to make a move in your life/change jobs/careers, I’d seriously consider it. Whatever your passion is, make it happen.  Life is too short. I’d be a complete fool if I said don’t let money step in your way, since this profession does pay pretty well (compared to others). It’s what kept me going for so long, as I’m sure it’s the same with a lot of you. If you have to just stay put in your position for whatever reason, at a minimum try your best to max out all those retirement plans.  \nYour future self will thank you.\n\nThat’s all I got. Thanks for reading. Me and the wife are so busy with this dog venture, that we don’t even have time to celebrate. But that’s the life of being business owners I guess. Our 4 kids might thank us someday.  Peace out.  🐕🐶🦮🐾\n\n\n",
    "score": 175,
    "url": "https://reddit.com/r/pharmacy/comments/1l5zbuw/i_finally_did_it_and_found_a_way_out_well_not/",
    "created_at": "2025-06-08T00:24:25.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1l92xzr",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "8+ years out of pharmacy school and this is my experience in the profession",
    "text": "Looking back, the things I wished I hadn’t done at the time were the biggest launching boards for success later. And I truly think the employment I had as a student and in the 3 years following have shaped me as a pharmacist for the better. I’ve talked about my pharmacy journey in every interview I’ve had and always get interested questions about it.\n\nI had a pretty atypical pharmacy school experience. I realized after P2 that I hated it. But I was in too deep. So I had to keep on with it.\n\nWhile in school, I worked. And I mean, WORKED. I held at least a full time job from P2 onwards. I took a semester off, returned part time. It was a mess. I held a job at the 3 letter devil and honestly didn’t hate retail, just corporate and figured I’d find an independent after graduation. Well, that’s hit a breaking point and I quit on the spot one day and never went back. \nLesson: NEVER big box retail\n\nI had a scholarship thru my church that required like 150 hrs of community service related to my major every year. So I decided to pick up some free interning hours at a unique program that catered to the medications of marginalized populations. I didn’t really care about it to be honest, but I ended up loving it. The person who ran it became a major mentor and source of encouragement for me.\nLesson: don’t count out different paths of employment\n\nAbout 2 months later I found another full time job as an intern at a smallish bed hospital, on the overnights as an intern. I loved the schedule, it was great for my often over stimulated brain. I took it bc it was good for my school schedule. I kept it bc it was good for my mental health. I continued working here until I graduated. I even had a rotation there and slept in the conference room between clocking out at 6 and starting rounds at 8. \nLesson: I dig the overnight shift\n\nDuring rotations…. Was a whirlwind. I had my IM rotation and cried in the corner of my preceptors office, thinking I was never gonna make it thru APPEs. I improved from a C- to an A- on that rotation thanks to a preceptor who was brutal but really wanted to teach. I had my independent community rotation, hated it. No thanks. Never again. Had an am care rotation and honestly loved it! Had my institution administration rotation: too many projects but a lot of them were cool, including one on using a neural network program to identify the likelihood of ade’s in a patient given their demographic factors. Had two specialty rotations that I didn’t really care for.\nLessons: Rounding was not for me so residency was a hard no, community all together was never gonna be where I wanted to be\n\nSo at this point, you’re thinking: I didn’t want residency, and I didn’t want community. WTH was I going to do? Buckle up, because I had 5 jobs in 4 years. I assure you, it’s not what’d you’d think from that statement\n\nYear 1: Overnight pharmacist at a 250 bed for profit hospital\nI reached out to EVERYONE for a job, any job. My IPPE preceptor was director at his hospital now and invited me to interview. It was an overnight inpatient position at a 250ish bed hospital. I was offered the job and took it. I was petrified. But I did well because I was never afraid of saying I didn’t know the answer. I got ONLY TWO WEEKS of training then was left on my own. My first night solo, I had a hunch a newborn was given the concentration of gent the day before and asked the doc to order a level. I was right, and then nearly panicked bc the neonatologist had so many questions. My director was awesome but my manager was TRASH. I left after a year.\nPay: $44.34/hr 😭\nLesson: I’m worth more, overnight was the right decision, management can make or break a job\n\nYear 2: overnight clinical pharmacist at a major 500 bed academic medical center\nI landed an overnight gig at a very busy AMC in my city and boy did I THRIVE. I expanded my practice by responding to codes and traumas, doing more pharmacy-based protocols and getting to have real input on how our department functioned and how it ran. Lots of management changes was the worst part. But then COVID hit and we got hit BADLY. \nPay: 62.92/hr\nLesson: I enjoy more clinical roles but still prefer the 7/7 overnight. I found my groove here.\n\nYear 2.5: added a second job like an idiot\nRemember that cool service internship I said I loved? The owner called me up and said she was expanding her service and would like to have me join her. I had stupid amounts of school loans and a new car. So I took it. It was a dream. I loved every second of it. Until the job started changing. I was never meant for paperwork or reports or long meetings. And because of our funding, that’s what a lot of the job turned into. I left after a year and parted on good terms. We both know that the job was no longer what was best for me. \nPay: 120k\nLesson: I’m not someone meant for a documentation-heavy job\n\nYear 3: continued full time AMC job and added an even better per diem\nI grabbed my dream PRN job at another AMC in my city and loved it. The most well-staffed, and highly clinical job I have ever had. No one ver leaves so a full time gig would have been a lonnng wait. \nPay: 65/hr, 68/hr\nLessons: I found my sweet spot of not working too much while also maximizing my income and experience while young\n\nYears 4-9(now): moved for love, sitting for my specialty boards\nI moved many states away because I met a man on vacation and moved on a whim. (We’re getting married this autumn.) \nThis move required me to move to a much smaller city and I got a clinical job at one of their best hospital. As one of three overnight pharmacists I handle the ED, ICUs and pediatrics. I completed 4 years here and passed the critical care board certification in 2024.\nPay: 180k salary\nLessons: the job you want IS out there\n\nAnyway, I just wanted to throw this out there as a note to the graduated class that even without a residency, your future can be whatever you want it to be. It just might take a different path. And that’s okay. My path gave me experiences and jobs that weren’t always steady, but I’m a great pharmacist for it. And most of all, I’m happy.",
    "score": 167,
    "url": "https://reddit.com/r/pharmacy/comments/1l92xzr/8_years_out_of_pharmacy_school_and_this_is_my/",
    "created_at": "2025-06-11T20:15:18.000Z",
    "num_comments": 48
  },
  {
    "id": "reddit-1pb2ta1",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Costco Pharmacist",
    "text": "Seeing some postings in my area (Midwest) for Costco staff pharmacist and pharmacy manager. Is the grass really greener? Curious about staffing/hours, bonuses, raises, if central fill exists, is there high turnover? What is the corporate culture and is there a big focus on safety? Any other big perks like stock, free membership, discount? What is the vacation time like, what about paid holidays / holiday weeks? Do you tend to find yourself working more than your base hours?\n\nI read some past posts about 45 hour base so that would equate to $79-80/hr in my state (see rate chart attached with min and max salary range). Currently I’m a manager at a grocery store, $75/hr (market value in my area), 2500 per week max. Have ~230 tech hours and ~105 RPh hours. Open 72 hours per week, utilize the dark hour prior to opening each day without customers as part of our hours. \n\nOverall I can’t complain - I don’t “work for free” like I used to at the 3 letter chain. The company focuses on safety, 2-3% raises annually, bonus up to 5% usually 2-3% guaranteed. Good relationship with supervisor. Not big metric focus. But I am noticing some hour cuts slowly but surely despite constant YOY growth. Not much opportunity for advancement. \n\nMaybe I’m just itching for something different. I’m always keeping an eye out for better opportunities. I’m interested in feedback from any Costco pharmacists, especially any who have jumped from other grocery and/or retail chains. ",
    "score": 139,
    "url": "https://reddit.com/r/pharmacy/comments/1pb2ta1/costco_pharmacist/",
    "created_at": "2025-12-01T04:02:13.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1lpemij",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "(Update #2) A PharmDs Journey to Wealth: 4 Years of Financial Tracking",
    "text": "You can find the original post: [HERE](https://www.reddit.com/r/pharmacy/comments/1anje94/a_pharmds_journey_to_wealth/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) &amp; [Update #1](https://www.reddit.com/r/pharmacy/comments/1ds3m0b/update_1_a_pharmds_journey_to_wealth_3_years_of/)\n\nInspired by seeing some of the posts across Reddit such as DrPayItBack, and not seeing the financial transparency as I was going through my pharmacy education I wanted to share my progress thus far towards building wealth and bring you all along the way and answer any questions. I've been tracking my financial progress and aim to make a consistent set of financial focused posts to show the outcomes of following general financial principles. I don't have an end goal in sight such as FIRE but simply using this as a way of tracking progress.\n\n**Updates - What's Changed? - bold text below for updates**\n\n* Consolidated and simplified my investment accounts. Previously I had taxable brokerages split across 4 accounts with various purposes. Seeing the excessive time it took to manage, the negative gut reaction I had to the Feb-May market turmoil and wanting to automate more, I consolidated them all into 1 account (75% ETF, 25% individual stocks).\n* Automated some monthly finance activities to include $1200 into taxable brokerage(100% VTI), $1000 into HYSA and $1000 into student loans\n* Emergency Fund is up to 12 months given the volatility in the pharma industry, a job security scare that I had last year and how challenging finding a desirable role is right now\n   * Work has bene going well although was recently overlooked for a promotion which was upsetting. Focused on grinding away and working on growing from feedback to make sure I'm ready the next time an opportunity arises.\n* Having feelings of guilt spending money on extra things in life whether it's an upgrade to a new TV, another lego set or traveling when I have the chance. I realize it's this underlying nature to keep saving and growing my net worth but having a hard time balancing that against living in the moment\n\n**General Background**\n\nI graduated from pharmacy school in 2021 from a MidWest school heavily centered around clinical practice and slowly began to realize that it was not where I wanted to take my career. I was able to get managed care and industry rotations throughout my fourth year which positioned me well for fellowship opportunities. I completed my fellowship in April 2023 and started my FTE right after at a different mid/large pharma company on the East Coast. I realize that I am in an extremely fortunate situation with my role, compensation, and the privilege that had allowed me to get to this point - this is not meant to be a brag but simply a rather transparent look into my financial journey as a PharmD.\n\n* I worked at a community and hospital pharmacy throughout pharmacy school for $17-21/hr over the years for about 16 hrs/week allowing me to pay for living expenses and fund things such as my Roth IRA during school. Living in a LCOL helped keep the financial burden down.\n* I graduated school during COVID with \\~$110k in debt with an avg interest rate of 5.4%. I benefited greatly from the interest rate pause over the past few years which helped my balance stay stable. I've slowly paid off the debt that sits at \\~$97k.\n* I lived at home during fellowship as it was virtual while making a salary of roughly $55k for two years where I prioritized investing as much of the money as possible and building up a small emergency fund.\n* My current role is a hybrid role with moderate travel (think 2 trips/month) based in a HCOL city on the East Coast for a large pharmaceutical company. I work approx 45-50 hours weekly but have a great QoL and good work-life balance.\n\n**Income &amp; Net Worth**\n\nI joined my current role in May 2023 with a $175k base salary, annual short term (20%) and long term incentive (15%). There was little room for negotiation and I did not press to hard considering my expectation post-fellowship was \\~155k. Three months into my role, I was given a $15k raise due to strong performance and then a 3.5% and 4.5% annual raise in 2024 and 2025.\n\nI currently make $204k base salary with annual short term(20%) and long term incentives(11%). The base salary to grow at about 2.5-3% annually with minimal change to the incentives unless I get a promotion. In 2024, I was offered a retention bonus of $32k if I stayed in this position for 1 additional year to ensure continuity on some of the longitudinal work I was leading. This was a one time thing and not something common but heavily contributed to my bonus payments.\n\n**In March 2025, I received a well above average short term incentive + retention bonus ($95k), long-term incentive (21.5k) and annual raise of 4.5% which are all part of my 2024 total comp package.**\n\nSince I started tracking my finances 3 years ago, **my net worth has increased by $337,000. It started with -$65.5k at graduation to +$271k at the time of this post.** The current market has helped push the growth significantly.\n\n**2025 Finances YTD(in depth Sankey to come at the end of the year)**\n\n|Gross Pay|$203,000|\n|:-|:-|\n|||\n|Taxes|$65,800|\n|Investments (401k + match, Roth, ESPP, HSA, Taxable)|$64,500|\n|Savings|$25,345|\n|Loans|$10,500|\n|**Expenses**||\n|Living Expenses(Rent, Utils, etc.)|$22,220|\n|Food + Drink|$4,650|\n|Car(Gas, Insurance, Maintenence)|$1,290|\n|Travel|$5,140|\n|Shopping(Household, Lego, Clothes, etc.)|$1,575|\n|Charity|$2,000|\n|Total Expenses|$36,855|\n\nEver since I graduated I have used an Excel spreadsheet to budget, track my expenses, and manage my money. I've found having to sit down and go through and manually type each expense has allowed me to be more intentional with my spending and has curbed impulse buying. In combination with my spreadsheet, I now use Rocket Money as a digital supplement to my manual tracking.\n\n**Living**\n\nI currently live in a 1b/1ba in a HCOL on the East Coast. Coming from the Midwest the prices are brutal but it's a nice place that is very close to my job, the airport, multiple large cities, and the train station so I don't mind the high cost. I've renewed my lease for an additional year and will reevaluate in Spring 2026.\n\n**I've definitely been eating out more this year than previously - both from a health and wallet perspective I am aiming to cut back eating out and cooking at home more. I lost my groove early in the year and really have fallen into some bad habits when it comes to food. I'm making it a priority to reel this in for 2H.**\n\n**Investments**\n\nI max out my 401k and HSA throughout the year via paycheck deductions. My company matches 9% on the 401k which is a blessing. I max out my Roth IRA every year on Jan 1st. Additionally, I contribute anywhere from 5-7% into my company ESPP at a 15% discount and invest an additional $320 weekly into a taxable brokerage.\n\nMy philosophy has been to aggressively invest as much as possible **but recently have taken a simpler approach to automating my taxable investments to VT**. The breakdown is \\~70% ETF, 20% in large tech stocks and 10% I actively trade to generate some income that gets autoinvested into VOO. In the past few months, **I've trimmed down individual positions in ASTS, IBM, WMT, HIMS, SOFI and UNH and invested those proceeds into VT.**\n\n**Savings**\n\nI'm trying to build up a larger emergency fund (\\~9-12 months) given the volatility in the pharma industry just in case I lose my job and am unemployed for an extended period. **I've reached about 12 months of an emergency fund. Since then, my savings go towards three buckets - engagement ring, wedding, and starter home. All of that money is in a HYSA with a rate of 4.35%.**\n\n**Student Loans**\n\nI've tried my hardest to delay paying these as much as possible given the 5.4% interest rate across them and the other financial priorities that I currently have. **My student loans are now down to \\~85k. I put $1k monthly and put a combined 10k towards them from my annual bonus. Using a loan amortization calculator and assuming interest accrues, I will likely be done paying these off in 5.5 years - some variability comes from when the interest rates start back up again**\n\n**Travel**\n\nI bucket a certain amount each month and whatever I don't use I roll over to the next month. At this age with traveling back home to see my parents, attending weddings, and trying to explore new cities, this is a high priority for me. **This year has already been incredibly travel heavy and I expect the second half of the year to be so even more. It's definitely more than I would like to spend but there's a ton of events both with family and friends that I need to attend.**\n\n**Bonus**\n\nEach year for my annual cash bonus, I put money aside to fund next year's Roth IRA, $5k for savings, $5k to my loan payment, $2k to the vacation fund, $2k for fun spending (laptop, legos, experiences) and the rest for gifts for my loved ones.\n\n**Net Worth Graph - $271k**\n\nhttps://preview.redd.it/nj3ov3oz2caf1.png?width=1138&amp;format=png&amp;auto=webp&amp;s=5b588058b98d7d3d1898dd23549ccdcfd39c5ff1\n\nIf you made it this far, props to you. Please let me know what other information I should include in these updates or what would be most valuable to the community as to what I should share.\n\nEDIT: Added in background info on income to help clear a few things up",
    "score": 131,
    "url": "https://reddit.com/r/pharmacy/comments/1lpemij/update_2_a_pharmds_journey_to_wealth_4_years_of/",
    "created_at": "2025-07-01T21:53:13.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1jue0id",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Fred Hutch is making pharmacists reapply for their own jobs, without clear info on pay, benefits, or job roles",
    "text": "I came across this via colleagues in the Seattle area...\n\nLast week, pharmacists at one of the major cancer centers in Seattle, WA (Fred Hutch) were informed that they have to reapply for their jobs as part of a \"non-competitive\" employment transition from UW to Fred Hutch. Currently, all pharmacists at Fred Hutch are employed by the UW.\n\nIt is being framed as a unifying move to align with \"peer institutions\", and an exciting opportunity to \"Streamline and grow\". \n\nThey were apparently given only a matter of weeks to reapply for their own jobs, with only vague promises of info sessions. They apparently were not given any guarantee on benefits, salary matching, clinical responsibility or job rules, and no credit for years of service at UW. \n\nPosting anonymously to protect those involved, but wanted others in healthcare and pharmacy to know that this is what \"restructuring\" looks like, and how unfair it can be to those involved. ",
    "score": 129,
    "url": "https://reddit.com/r/pharmacy/comments/1jue0id/fred_hutch_is_making_pharmacists_reapply_for/",
    "created_at": "2025-04-08T13:49:27.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1mjia2v",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Walgreens recruiter says they have “exciting things happening” and want me back!",
    "text": "Received a text like “We've got some exciting things happening here, and we're exploring opportunities to bring great people back” \n\nJust wondering what exciting things Walgreens has to offer 😂\n\nI’d like to add when I left Walgreens the HCS and DM asked me what was going to happen when I lost my new job and would have to come back to walgreens for a lower salary than what I was currently making lmao. ",
    "score": 124,
    "url": "https://reddit.com/r/pharmacy/comments/1mjia2v/walgreens_recruiter_says_they_have_exciting/",
    "created_at": "2025-08-06T22:07:29.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1kx5lhq",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Salary and our Profession",
    "text": "I know no one actually knows this, and I’m sure this has been talked about, BUT what do we think about the future of our careers? I mean seriously. I wanna hear thoughts. Less and less people are going to get their PharmD… this potentially a good thing? Higher demand and maybe actually getting paid what we deserve? Or do you think they’ll phase us out gradually? I just can’t see us completely going away as a profession. Do we think salaries will finally catch up? Not trying to complain too much I mean $130k/yr is still better than the vast majority of America but our salaries have been stagnant for years it seems. Just sucks going to school that is so expensive to make “only” this much.",
    "score": 102,
    "url": "https://reddit.com/r/pharmacy/comments/1kx5lhq/salary_and_our_profession/",
    "created_at": "2025-05-28T02:14:25.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1omu08h",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "The Uncertain Future of Our Profession in five years",
    "text": "Hello, I’m honestly worried about the future of our profession. Salaries have been stagnant around $55 an hour for many pharmacists and although there’s a push to expand the pharmacist’s role, the AMA keeps opposing it because they want to remain the only ones benefiting financially from that “slice of the pie.”\n\nCan someone tell me what’s expected to happen in the next five years? With the rise of artificial intelligence, do you think it will actually help expand our role? Because honestly, community pharmacy is going to die if the “test and treat” model doesn’t move forward.\n\nOur salaries are stagnant that is crazy I think wages will remain stagnant with this technology thing.\n\n\n\n\nPharmacists in Florida don’t make much compared to other states. 🤡",
    "score": 77,
    "url": "https://reddit.com/r/pharmacy/comments/1omu08h/the_uncertain_future_of_our_profession_in_five/",
    "created_at": "2025-11-02T21:50:43.000Z",
    "num_comments": 122
  },
  {
    "id": "reddit-1kbo7bb",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Remember my husband's \"unicorn job\"? They're hiring an even more unicorn position.",
    "text": "So I hope this is okay to post. I had to delete the old post because my husband didn't want his salary and other potentially identifying information on Reddit. But it was my most upvoted post ever so maybe someone remembers...\n\nI can post the link to current opening on indeed if that's allowed. But it's for encompass in Yuma so you can probably find it. And a bit of insider info the other pharmacist is leaving soon so there will be two positions open. But the one I'm calling a unicorn is a hybrid position with 20 hours in the rehab hospital and 20 hours verifying orders from home. It's a smaller rehab hospital, with a very great, understanding boss. She really is an angel and encourages my husband to leave during the day so he doesn't miss little things like elementary school spelling bee or spring musical performance. He is a few minutes late every single day because he drops off kids at school on his way and it's just fine. He can leave at the end of the day when work is done, even if it's not quite 6. It's really a great place to work.\n\n\nThe down side is living in Yuma, AZ. I still really want to move and I know my husband will not leave his boss high and dry so now that the other pharmacist is leaving I'm kind of on the hunt to help fill this position so maybe then I can fulfill my dreams of getting out of Yuma. ",
    "score": 72,
    "url": "https://reddit.com/r/pharmacy/comments/1kbo7bb/remember_my_husbands_unicorn_job_theyre_hiring_an/",
    "created_at": "2025-04-30T18:50:29.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1o5pkn7",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Is residency a scam??",
    "text": "Husband graduating pharmacy school this year. I’m a pharmacist who is now stay at home. I’ve been looking into salaries post PGY1 and PGY2. I’ve explored reddit, different positions, and talked to many pharmacists. In terms of pay only, it seems like residency doesn’t increase pay. If it does, it’s bleak compared to retail. Retail offering 68/hr in a nice, low cost of a living state for husband graduating next year + sign on bonus - 140k plus. To my knowledge, most hospital pharmacists don’t even make that much after 10 years. He’s looking to maximize salary only. He plans to get his MBA in the coming years. Thoughts on doing a residency vs retail in terms of pay only? \n\nThanks!! ",
    "score": 72,
    "url": "https://reddit.com/r/pharmacy/comments/1o5pkn7/is_residency_a_scam/",
    "created_at": "2025-10-13T17:05:39.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1n7efmx",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Amazon Pharmacy",
    "text": "Hi! I was offered a Staff Pharmacist position at Amazon. The salary is a little higher than what I make now. I was wondering if anybody had any insight on working for them in the pharmacy? I used to work in their fulfillment center as an associate so I’m a little familiar with how they operate on metrics. Also, what happens if I decide to leave before the year is up? Does the sign on bonus come with any ties? Anything would be helpful regarding this! Thanks! ",
    "score": 70,
    "url": "https://reddit.com/r/pharmacy/comments/1n7efmx/amazon_pharmacy/",
    "created_at": "2025-09-03T13:11:58.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1oa29g4",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "🚨 Alabama Board of Pharmacy backs down after backlash &amp; “non-disciplinary fines” rule withdrawn 💊💰",
    "text": "Well… this is interesting. The Alabama State Board of Pharmacy💊 just voted to withdraw its controversial unlawful emergency rule and permanent rule that would’ve allowed it to issue “non-disciplinary administrative fines” to pharmacists and permit holders to collect money in violation of recent legislation specifically tailored to prevent this extortion. 😳\n\n🔗 Article link (Alabama Political Reporter) https://www.alreporter.com/2025/10/16/board-of-pharmacy-withdraws-controversial-non-disciplinary-fines/\n\nThe idea behind the rule?\nBasically: “We don’t care what the legislature says. We will fine you however much we want and will even pass emergency rules to attempt to bypass any and all oversight.” Not so fast…\n\nCritics called it a clear violation of Act 2025-372, which was supposed to reform how the Board operates and stop these kinds of revenue-generating tactics. But this Board has one and only goal in mind - MONEY. Cold hard cash. In June 2025 alone, these board members were paid $5,000 each just to sit as a “public servant” on a state regulatory board. \n\nNow the Board has quietly pulled the rule but only after a ton of public pushback and some sharp legal scrutiny, including a lawsuit filed by Alabama Pharmacist Emily Singletary Pinon in Montgomery County Circuit Court on October 1, 2025.\n\n💬 So what do you think:\n\t•\tIs this a real step toward transparency and accountability, or just damage control?\n\t•\tShould any licensing board have the power to make up an emergency just to fine people because they need money to pay their $4,000,000 in salaries and benefits every year?\n\t•\tDo you see similar overreach from boards in your state?\n\nFor pharmacists who’ve had to deal with your state board: how does this compare?\nAre Alabama’s issues unique, or is this just another example of boards going unchecked?\n\nCurious to hear what y’all think. 👇\n",
    "score": 62,
    "url": "https://reddit.com/r/pharmacy/comments/1oa29g4/alabama_board_of_pharmacy_backs_down_after/",
    "created_at": "2025-10-18T17:47:54.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1ocjboo",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Louisiana Hospital Salary",
    "text": "Just wanted to share some new grad rates here with our lovely monopolies:\n\n\nHospital Inpatient:\n\nLCMC Health: FT ($44/hr) PRN ($55/hr)\n\nOchsner: FT ($43-48) PRN ($55)\n\nFMOLHS: FT ($50) PRN ($58)\n\n\nClosed door pharmacy:\n\nAbsoluteCare: PRN ($62)\n\nAfinida: FT ($67.50)\n\nRetail:\n\nCVS: $65\n",
    "score": 56,
    "url": "https://reddit.com/r/pharmacy/comments/1ocjboo/louisiana_hospital_salary/",
    "created_at": "2025-10-21T17:33:06.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1n9n00l",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Nyc pharmacist salary update",
    "text": "Today my hospital notified us of a salary adjustment coming this month. Wanted to see what you guys are making? I am a staff pharmacist in nyc, 7 years experience, no residency, no bcop and currently at $83/hr. ",
    "score": 52,
    "url": "https://reddit.com/r/pharmacy/comments/1n9n00l/nyc_pharmacist_salary_update/",
    "created_at": "2025-09-06T01:33:26.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1ly39nu",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Amazon Pharmacy",
    "text": "Looks like Amazon is opening and interviewing in Philly.  I applied and heard back from the recruiter for the manager role.  Not a ton of specifics but here are some of the numbers:\n\n135k base salary \n35k sign on bonus 1st year lump sum\n28k bonus in 12 monthly increments second year\nApproximately 460 restricted stock units that’s I’ll vest 20% in 2 years but fully vest in 4.  \nFour day work week 730-6 M T Th F\n\nIt’s a very short drive from my house as well (commute is 15 minutes).\n\nFirst concern is salary of course.  Currently make 150k as an ops manager for a LTC.\n\nSecond is what the culture looks like at Amazon.  \n\nThird is further potential for upward mobility within the established hierarchy.  \n\nAnyone with experiences or insights?  ",
    "score": 48,
    "url": "https://reddit.com/r/pharmacy/comments/1ly39nu/amazon_pharmacy/",
    "created_at": "2025-07-12T15:32:12.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1m76t8e",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Is it okay to leave a job after a week?",
    "text": "Hi. So I recently got hired from a big hospital as a healthcare professional (not to be specific) however, I feel like giving up after 2 days of working there. I mean, I'm quite familiar with the process because I already had my internship with the same system process they have, it is just that I don't feel like working there anymore. \n\nBesides, I was offered another job from a medical group (clinic) that requires mall hours only and take note, they just have the same level of salary. \n\nI am just scared to leave because this is my first job and maybe can affect my resume and credibility.\n\nps. I only need to process requirements to the new job offer and then I'm good to go which in fact, I already have those requirements since I was applying to my job as of the moment. ",
    "score": 45,
    "url": "https://reddit.com/r/pharmacy/comments/1m76t8e/is_it_okay_to_leave_a_job_after_a_week/",
    "created_at": "2025-07-23T11:33:41.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1p433ac",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Is this normal ? Pharmacists!",
    "text": "Retail pharmacy location has this rule where all rx must be processed/filled/verified/bagged on same day prior to leaving. With rx/refills rolling in indefinitely , routinely becomes 200+ rx in the last ~2-2.5 hr for 1 pharmacist /2 techs. Either speed verifying or staying late. Also you don’t get paid for staying late at all, pay is only for hours in scheduled shift (salary). Verification isn’t photograph/CVS style it’s traditional style. I’ve never dealt with this before.",
    "score": 44,
    "url": "https://reddit.com/r/pharmacy/comments/1p433ac/is_this_normal_pharmacists/",
    "created_at": "2025-11-22T20:18:12.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1ookazd",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "A 2025 PharmD Feeling Lost in My Industry Fellowship — Burnout, Regret, and Questioning My Path. Everything is terrible - and I need Guidance please",
    "text": "Hi everyone,\n\nI’m writing this because I’ve hit a point of unhealthy confusion, toxicity, and burnout in my current professional state. I am a 2025 pharmD grad, year 1 pharmaceutical industry fellow.\n\n I’ve worked hard to get here, but I feel drained, unfulfilled, and unsure of what I truly want moving forward. I’d really appreciate any honest advice, mentorship, or perspective. I’ll try to be as clear as possible.\n\nBackground: \n\nMy parents forced me into healthcare, and I never got the chance to figure out what I truly wanted. That lack of choice — not guidance, but *force* — shaped everything that followed.\n\nI earned a BS in Biology and attempted the MCAT, but I failed at it. Under pressure, I pivoted to pharmacy as a “middle ground.” My sibling was also forced into medicine, went abroad for med school, and came back unlicensed. Watching that cycle was disheartening. I did want to do medicine, but my parents twisted my arm off from that path.\n\nI also struggled with mental health, including a misdiagnosed ADHD (now properly treated), which made everything harder. Between that and family stress, I can say I have a lot of depression, anxiety, and terrible feelings.\n\nPharmacy School &amp; Career Path Decision, Contingent on my background\\^:\n\nMy pharmacy school had an outdated curriculum, which was challenging to navigate. Many students either excelled by quickly grasping the material or focused on memorization, something I struggled with. I did fine but never thrived. Still, I stayed active in research and leadership, hoping to get a residency.\n\nMy APPEs changed my mind. Clinical practice in my state was sooooooooo limited, and relocation to another state with better pharmacy practice wasn’t an option. So, I turned toward the pharmaceutical industry, something I never saw myself doing at all — but was drawn by the promise of a work-life balance, a competitive salary, and opportunities for growth. I don't see a work-life balance at all, though.\n\nCurrent Fellowship Experience:\n\nMonths in, I can honestly say I hate it. The environment is toxic, there’s no real training, and the culture is cutthroat for no meaningful reason. My co-fellows and I have voiced concerns, but nothing has changed. We’re buried in busywork with little meaningful guidance or mentorship. Everything is meaningless. The workload is worse than that of a residency, and it also lacks the learning, structure, and purpose that are typically present. It’s taken a serious toll and induced my mental health abnormalities. I’m even more depressed and confused, wondering how I ended up here after eight years of school. I wish I were a senior in high school again. I realize I never truly chose this path. It was shaped by the forceful pressure of parents and the fear of instability. I love patient care, and that’s why I wanted to do a residency in pharmacy, but during my APPEs, I saw the opposite, and every time I was around medical students or residents, I felt like I should’ve been one of them. That feeling never left, but I am blank-minded, though, at this point.\n\nDespite everything, I *love* patient care and want a meaningful, human career — something that makes me feel useful and worthy again. I believe pharmacy has that, but I am not experiencing it or seeing it. I actually respect community pharmacy, but it's challenging to find a healthy environment for it, or, more specifically, to fully practice community pharmacy given the right opportunity and setting.  I’m trying to focus on my mental health and rebuild my life while figuring out what’s next. If anyone has been at this kind of crossroads — between pharmacy, medicine, and burnout recovery — I’d love to hear your perspective or advice. It’s painful to feel lost at what’s supposed to be the “peak” of my early career, but I’m hoping honesty is the first step toward clarity.\n\nI hope I made sense and conveyed my message clearly because I can be unclear at times. I am truly desperate after speaking with faculty, other mentors, and even company employees who were assigned as buddies, all in a professional manner, but I have received no help. Thank you for reading, and for anyone to be a good Samaritan with thoughts you’re willing to share or offer as advice, help, or mentorship in public or private. 🙏\n\n",
    "score": 36,
    "url": "https://reddit.com/r/pharmacy/comments/1ookazd/a_2025_pharmd_feeling_lost_in_my_industry/",
    "created_at": "2025-11-04T21:44:46.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1kyawo8",
    "subreddit": "pharmacy",
    "soc_codes": [
      "29-1051"
    ],
    "title": "Salary",
    "text": "Hello all, long time lurker. \n\nTo all my fellow RPh’s in the southeast region or anywhere for that fact excluding HCOL areas. \n\nIf you are making $200k+\n\nHow old/long did it take you to get there?\n\nWhats your base? Do you work any PRN jobs?\n\nI know RPhcompensation dashboard exists but would like to hear firsthand on how to get to that point \n\nThank you,\n\nYoung RPh trying to survive in this economy with a shit ton of loans 🥹",
    "score": 35,
    "url": "https://reddit.com/r/pharmacy/comments/1kyawo8/salary/",
    "created_at": "2025-05-29T13:33:09.000Z",
    "num_comments": 79
  }
]