[
  {
    "id": "reddit-1kp4orj",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Today I was guilted for having nice gear by a professional photographer.",
    "text": "I need to vent….\nWas at a festival, enjoying the live band with my family. My Nikon Z8, paired with a Tamron 35-150mm lens, hung from my backpack via a Peak Design Capture Clip.\n\nA guy approached, eyeing my gear and the Peak Design clip.  After a few minutes, he asked, “Do you shoot professionally?”\n\nWhen I said no, his demeanor shifted. “Must be nice to afford nice gear; some of us in the industry can’t even dream of owning gear like that.”\n\nI responded calmly, emphasizing that passion for photography isn’t limited by profession and that great photos come from vision, not just gear.\n\nHe scoffed, “Easy to say when you have the luxury of expensive equipment.”\n\nFeeling the tension rise, I decided it was best to walk away, leaving the conversation behind.",
    "score": 8477,
    "url": "https://reddit.com/r/photography/comments/1kp4orj/today_i_was_guilted_for_having_nice_gear_by_a/",
    "created_at": "2025-05-17T22:09:24.000Z",
    "num_comments": 1390
  },
  {
    "id": "reddit-1mx679w",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Apparently I’m “NOT a photographer",
    "text": "Went on a photo walk this week while on vacation where I mentioned that I’ve been shooting for years and consider myself a photographer. One guy instantly cut me down and said unless you’ve been paid you can’t call your self that. \n\nThis lead to a huge debate whether passion or paycheck defines the word “photographer.” Half the group backed him up, the other half agreed with me.\n\nPersonally, I think calling someone not a photographer just because they haven’t charged money is ridiculous gatekeeping. There’s a reason we say “professional photographer” — the word “photographer” still applies without the paycheck.\n\n\n",
    "score": 2499,
    "url": "https://reddit.com/r/photography/comments/1mx679w/apparently_im_not_a_photographer/",
    "created_at": "2025-08-22T13:14:23.000Z",
    "num_comments": 1173
  },
  {
    "id": "reddit-1os4cde",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Instagram is no longer a photography medium",
    "text": "Als the title says, I don't think IG is a photograpy medium anymore. It's only reels and video or is that just my experience? \nThe number of photwork is really low, and some vidoes are not bad, but the bulk is just adds or reels with ads or instructional video lls that lead to more ads. \n\nNow what? ",
    "score": 1528,
    "url": "https://reddit.com/r/photography/comments/1os4cde/instagram_is_no_longer_a_photography_medium/",
    "created_at": "2025-11-08T23:52:19.000Z",
    "num_comments": 394
  },
  {
    "id": "reddit-1nbulr1",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Took a photo while passing a wedding, now paid photographer wants it",
    "text": "Spotted a couple getting married in an amazing location (EU) and took a photo from a vantage point. Approached them and swapped Instagram details to send it to them. They've got it all over their SM, which is great. The paid photographer has now messaged asking for all the images. I'm minded to do this over Instagram messaging but ask for a small payment if they want to use them commercially. Does this seem reasonable?\n\nEDIT Thanks for all the comments, advice and argument! The wedding photographer has asked us to email the RAW image and said they won't use it for commercial purposes. We're more than happy for the couple to have it as part of their album \n\nAs a few people have asked, and it is on SM, I'll post the photo.. \n\n",
    "score": 1425,
    "url": "https://reddit.com/r/photography/comments/1nbulr1/took_a_photo_while_passing_a_wedding_now_paid/",
    "created_at": "2025-09-08T17:48:00.000Z",
    "num_comments": 472
  },
  {
    "id": "reddit-1l6yj8j",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Doing a naked calendar shoot with my uni class — never modeled before, any advice?",
    "text": "Hi everyone,\n\nI’m taking part in a naked calendar shoot this Saturday with my veterinary uni class (yep, it’s a real tradition — and it’s a fundraiser!). There’ll be about 30–40 of us involved, mostly girls but around 10 guys too.\n\nI’ve never modeled before, let alone nude, so I’m pretty nervous — excited too, but definitely feeling the nerves.\n\nWould love any advice on:\n\n\t•\tHow to stay confident and calm while naked\n\n\t•\tNatural poses that look good but don’t feel overly “posed”\n\n\t•\tHow to avoid overexposing myself without looking super awkward\n\n\t•\tTips for covering in between shots — we won’t always have robes on us, and there are times we’ll literally just be using our hands to cover while walking to/from locations 😭\n\n\t•\tHow to manage nerves being nude around classmates and staying respectful during the process\n\nAlso if anyone’s curious what this kind of shoot looks like, last year’s class still has their calendar up here: https://www.vetsuncovered.com/ . Ours will be posted soon and calendars will go on sale once we’re done shooting and editing!\n\nThanks so much for any tips or encouragement — I really appreciate it 💛",
    "score": 1404,
    "url": "https://reddit.com/r/photography/comments/1l6yj8j/doing_a_naked_calendar_shoot_with_my_uni_class/",
    "created_at": "2025-06-09T07:24:14.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1lquwl5",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Etsy has taught people your photography is worth pennies",
    "text": "I've been selling my photography on Etsy since 2013. It took off in 2019 and was really good until about 2023. Every once in a while, I would get the straggler asking if I would sell one of images as a digital download. No I would tell them, it could be used for purposes without my permission. \n\n  \nThen I got to thinking:  \nEtsy has changed the way people value photography and digital downloads. Buyers have been trained to expect professional-quality work for $1 or $2, just because it's a digital file. There's this assumption that if it's not printed and shipped, it shouldn't cost much. But that completely ignores the years of skill, the gear, and the creative energy that goes into making the image in the first place.\n\nTo put it in perspective: it’s like messaging a world-famous hairdresser who charges $2,500 for a cut, blow-dry, and style and asking if they’ll just cut your hair for $5, since you “don’t need the full service.” The cut is still the craft. The artistry doesn’t become worthless just because you’re skipping the final delivery format.\n\nDigital files also carry a huge risk. Once it’s out there, it can be misused, shared, or even resold without permission. Tons of artists are seeing their work show up on sites like TEMU, printed on junk products with zero credit. It’s exhausting, especially for photographers trying to earn a living or even just get started. Pricing fairly shouldn’t be a fight, but on Etsy, it often is. This mindset is hurting the creative community, and it deserves way more attention.\n\nSo I came up with a response to anyone asking for my image as a digital download and use it as more of an educational tool!  \n  \n*\"Thank you so much for your interest in purchasing one of my photographs! I do offer my work as a digital download under very specific terms. The price for a digital file is $3,500 (non-refundable), which reflects both the value of my photography and the considerable risk that comes with releasing high-resolution digital artwork. Once a digital file is shared, there’s always the potential for unauthorized distribution, which can compromise the exclusivity, integrity, and reputation of my portfolio. This pricing helps protect the originality of my work and ensures it’s not devalued in a market where digital theft is, unfortunately, common.*\n\n*Along with the purchase, I require a signed Image License Agreement. This agreement states that the file is for personal display use only, not for commercial, public, or resale purposes.*\n\n*I take this seriously because a significant number of digital download shops on Etsy do not feature original art. Many are run by overseas sellers who copy images from the internet without permission. You may have noticed the same artworks appearing across multiple shops, a clear sign that the creator was neither credited nor paid.*\n\n*If you’d like to move forward or have any questions, feel free to reach out and I’ll gladly share the next steps.\"*\n\n",
    "score": 916,
    "url": "https://reddit.com/r/photography/comments/1lquwl5/etsy_has_taught_people_your_photography_is_worth/",
    "created_at": "2025-07-03T17:04:35.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1mln3a5",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "I’m a pro product photographer and I think we have less than 5 years before AI takes most of this work",
    "text": "I’m already hearing the decision makers talking amongst themselves. \n\nOn a large commercial job for nationwide industrial supply company shooting in a food processing facility, the agency rep tells the client “In a couple years we won’t need to do these shoots! We’re already taking detailed images of these locations to use later with AI.”\n\nClient says “Not sure if that’s gonna work for us. We need more than just images, we need everything in those images to follow code.” Proceeds to give an example where a recent phot from a shoot had to be scrapped bc something in the bg wasn’t set up like a real pro would have. \n\nRep says that’s not a problem. We’ll be able to feed it the whole book of codes and tell it to create images that follow those guidelines. \n\nThis on a set with 20ish people or so working. \n\nAnother client is a large nationwide grocery store where they’re already using AI to add some props, even with a stylist standing right there 😂, and in a conference call with higher ups I overheard one of them asking how much of this AI stuff can they legally use. \n\nIt’s moving really fast y’all. \n\nI’m about to shoot my last wedding in a few weeks after 15ish years doing them. I’m wondering if I should get back into that game but I imagine there’s gonna be a flood of photographers out of work due to AI looking to do the same. \n\nI’m legit scared where this industry will be in 5 years. Maybe my job will shift to taking 360 scans or photos of these products for AI to use for the final image 🤷🏼‍♂️",
    "score": 849,
    "url": "https://reddit.com/r/photography/comments/1mln3a5/im_a_pro_product_photographer_and_i_think_we_have/",
    "created_at": "2025-08-09T11:24:50.000Z",
    "num_comments": 483
  },
  {
    "id": "reddit-1lnj348",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "I built a open-source lightweight RAW editor in 2 weeks because Lightroom felt too heavy on my machine",
    "text": "Hey folks\n\nI'm a 18 year old photographer and programmer and I've been using Lightroom for a while but always found it kind of buggy on my windows machine, especially when dealing with a big batch of RAWs. So I challenged myself to build my own RAW editor from scratch, just to learn more about how it all works under the hood.\n\nRapidRAW is GPU-accelerated, non-destructive, and open-source. Still very much a WIP, but surprisingly usable already (especially if you're into simpler workflows). Built with Rust + Tauri + React. File size is under 30MB, and it runs on Windows &amp; macOS.  \nIt supports full RAW workflows, library, masks (even AI masks!), batch editing, presets, and more.\n\nI’m sharing it here because I’d love to hear what other photographers think or to get ideas from more experienced editors (e.g. what important features are missing).\n\nIf curious: [https://github.com/CyberTimon/RapidRAW](https://github.com/CyberTimon/RapidRAW)\n\nPS: If mods think this is self promotion feel free to delete it. I think it shares value to both the community and me.\n\nThanks :)",
    "score": 824,
    "url": "https://reddit.com/r/photography/comments/1lnj348/i_built_a_opensource_lightweight_raw_editor_in_2/",
    "created_at": "2025-06-29T16:37:56.000Z",
    "num_comments": 312
  },
  {
    "id": "reddit-1odhc8k",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Was this guy a legit artist or a perv?",
    "text": "I was at the park with my boyfriend when this man came up and asked if I could do him a favor. I thought he was talking to both of us so I said sure what could we do for you. He said he was an artist and was wondering if he could take some pictures. I said sure because I’ve seen plenty photographers do this to others in public before so I didn’t really care. \n\nHe said as long as I was over 18 and I’m 24 so I said oh yeah well over 18. He responded saying “oh good just can’t always tell” and then looked over at my boyfriend saying “are you okay with this?” basically making sure my partner was okay with this man taking pictures of me. I thought getting permission from my boyfriend was a bit weird but I can understand not wanting unnecessary conflict. \n\nAnyways, he starts asking me stand in certain areas for different lighting, by trees, things like that. The most consistent thing is he kept telling me to smile with my teeth or looking down. His hands were REALLY shaky, so I figured maybe he was a really anxious guy or just didn’t have steady hands. He tells me how he’s been taking pictures of people for 20 years (he was probably in his early 40s based on appearance). He seems pretty awkward but friendly overall. \n\nHe then asks me to take my shoes off so my bare feet were showing. I didn’t think this was that off since we were in a park, but I wasn’t exactly dressed for the park. I was in a giant hoodie and sweatpants, so if anything my bare feet showing was kinda silly looking. But anyways, I took my shoes off and he kept taking pictures. Sometimes he would ask me to smile with my teeth but the camera would be pointed towards my feet. He would also take really close up pictures of my face (which I don’t think is super weird just added context) and told me I have a very nice face. \n\nHe said it would only take around 10 minutes but it had been like 25 at this point. My boyfriend had to get to work so I said we could only do a few more if he needed because I had to go. He asked me to kneel down and look up with my teeth smiling. I do this once and then leave because I just got kind of a weird feeling. When we part ways he just tells me to have a nice day but didn’t tell me where I might be able to find his work or anything. I didn’t ask because I had just wanted to leave at this point. \n\nI think I am overthinking this and the man might just be an anxious artist. But the vibes were a little weird. What do y’all think as photographers? \n\n\nEDIT: well all the responses just confirm what I was thinking. Ngl some people are being pretty harsh, one person even responded saying my boyfriend should leave me because I was stupid. Im a very anxious person as well and I was pretty scared to leave abruptly. I’ve learned my lesson.",
    "score": 747,
    "url": "https://reddit.com/r/photography/comments/1odhc8k/was_this_guy_a_legit_artist_or_a_perv/",
    "created_at": "2025-10-22T19:04:51.000Z",
    "num_comments": 262
  },
  {
    "id": "reddit-1kex1p8",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Nightmare Trip in Iceland with Vulture Labs!",
    "text": "I want to share the story of an absolute nightmare of a photography workshop I attended in Iceland—an experience that was supposed to be the trip of a lifetime, but turned into a crash course in chaos, frustration, and the kind of leadership that makes you wonder if you accidentally joined a prank show. And the man at the center of it all? Jay Vulture of Vulture Labs Photography.\n\nhttps://www.instagram.com/vulture_labs\n\n⁦https://www.vulturelabs.photography\n\nI originally found Jay’s work on social media—long exposures, dramatic black and white edits, minimalist vibes. I was impressed. His workshop ad promised a full tour of Iceland’s south coast, in a cozy farmhouse, remote “off-the-beaten-track” locations via 4x4, and hands-on instruction in fine art black and white post-processing. It was pitched as a “once-in-a-lifetime experience.” Spoiler alert: it definitely was, but not for the right reasons.\n\nThe red flags started before the trip even began. Jay barely communicated. He never confirmed participant info, never sent an itinerary or accommodation information, and only responded to emails when chased down.\n\nWhen we finally got to Iceland, the trip fell apart almost immediately. Jay didn’t show up. He arrived 2.5 days late due to a canceled flight, even though there were other airline alternatives that would’ve got him there on time. He casually suggested we continue the trip without him until he arrived but wanted us to drive 4.5 hours north to the rental house, then drive 4.5 hours back to the airport to pick him up when he finally arrived, and then—yep—another 4.5 hours back north. We politely declined and did our own thing in the south for two days, covering all our hotel and gas costs out-of-pocket. No offer of reimbursement.\n\nJay eventually arrived and the disappointment only deepened. The rental car he’d booked was way too small to fit four people and their camera gear. We had to upgrade the car ourselves—over $400 on one participant’s credit card. Jay didn’t pay a dime.\n\nOh, and the best part? He didn’t have a driver’s license. Which meant the participants had to drive the entire trip. No warning. Jay sat in the back, headphones on, scrolling through conspiracy theories on his phone while we navigated the roads and planned every stop. And when one of us missed a turn, he yelled at us from the backseat in frustration.\n\nThere was no itinerary, no structure, no leadership. We had to figure out all the locations, all the routes, all the schedules. The only reason we shot at the best times of day—like golden hour or midnight sun—was because we planned it. Jay hadn’t even considered it, and even stayed in the car sulking when we shot the most spectacular storm and rainbows late one evening.\n\nAs for instruction? Forget it. Jay ignored questions, refused to demo anything, and offered zero input. He would show up to a location, walk off to take his own shots; of being walkin straight into our compositions, snap a few of his own, then wander back to the car for another cigarette and waited for us there. He smoked constantly—inside, outside, around gear—and left the rental house reeking. He flicked cigarette butts into the landscape without a second thought. There was no teaching happening. Just Jay doing his own thing while we ran the entire show.\n\nHalfway through the trip, he told us we’d need to cover our own hotel on the last night and figure out our own way to Reykjavik. This, despite his website clearly stating the workshop included all travel and accommodation. We had to extend the car rental ourselves—another $400-plus—just to finish the trip. Jay refused to contribute a penny.\n\nAnd then came the grand finale: Jay filled the diesel rental car with AdBlue into the gas tank. That’s right. He dumped the wrong fluid into the tank and wrecked the engine. The car had to be serviced twice during the trip, costing over $650. Jay said he didn’t have the credit available and made the participants cover it. He even lied to the mechanic, trying to blame the mistake on one of us.\n\nToward the end of the trip, he tried to cancel our final shoot at Kirkjufell—one of the main highlights. He claimed we wouldn’t have time. We pushed back. His response? “I’m the workshop leader. I’m the one making the decisions.” Right. Except he hadn’t made a single useful decision the entire trip. We ended up waking him up the morning of the shoot to make sure he didn’t make us miss it. Or our flights.\n\nHe later offered a token refund of $100 for the hotel night. Shocker—it never showed up.\n\nThis wasn’t a workshop. It was a self-funded road trip with a disengaged, unqualified leader who took zero responsibility and offered nothing in return. Jay Vulture sold a premium, all-inclusive learning experience and delivered a lazy, self-indulgent mess that left us footing the bill and planning our own itinerary.\n\nI’ve tried for several years to file complaints about Vulture Labs/Jay Vulture  but I’m unable to find anything about him or his business; and sadly he continues to run workshops in Iceland &amp; other countries.\n\nIf you’re considering a workshop with Jay Vulture/Vulture Labs—don’t.\n",
    "score": 733,
    "url": "https://reddit.com/r/photography/comments/1kex1p8/nightmare_trip_in_iceland_with_vulture_labs/",
    "created_at": "2025-05-04T23:05:31.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1jhzgtw",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Called racist for not taking patron’s photo.",
    "text": "So this is the most unusual situation after an event photography gig I have ever been in.\n\nPhotographed a workshop-style festival for a client. I was a LONG day: something like 10 hours and over 1,000 people at this event. There were 8 workshop zones, 20ish vendor booths, and 2 fields of people dancing and enjoying themselves to the main music stage.\n\nBefore you even say it: yes they absolutely should’ve hired more than just one photographer and one videographer…but they didn’t.\n\nSo I had around 5-7 minutes to photograph every single workshop as it’s happening, fly a drone around the venue, and capture all the in between at the same time.\n\nThis is the context I want to establish here because given these circumstances you’d miss photographing SOMEONE right? \n\nApparently I missed photographing a random person and she is up all over social media on the event page screaming that I’m a racist and purposely avoided photographing her because she’s Hispanic and I was only photographing white people.\n\nThe client loves my images that I’ve already culled, edited, and delivered, and there’s like every race in the book as photo subjects in the delivery. I was certainly not avoiding anyone and a high percentage of the images are Black, Hispanic, Asian, Indian, you name it - just whomever was there and was doing something interesting enough to tell the story of the event.\n\nIs there any sort of rational response to this? \n\nShould I just ignore it since my client is happy and is already well on their way sharing the images I sent? \n\nDefinitely don’t like being called a racist just because I was too busy to target someone specifically for a photograph.",
    "score": 717,
    "url": "https://reddit.com/r/photography/comments/1jhzgtw/called_racist_for_not_taking_patrons_photo/",
    "created_at": "2025-03-23T13:38:49.000Z",
    "num_comments": 223
  },
  {
    "id": "reddit-1m8igg3",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Don’t forget to photograph yourself too. You matter as much.",
    "text": "We capture so much.\n\nGraduations, weddings, protests. Quiet joy, loud grief. Strangers, lovers, families. We preserve the lives of others, their milestones, heartbreaks, laughter, growth. We chase light, frame moments, and document stories that aren’t ours. We tell the world what happened, but we rarely turn the lens around to show who witnessed it.\n\nI realized something recently. My SD cards are full of everyone else’s lives… but barely any proof that I was ever there. Not as a photographer, plenty of photos remind me of that, but as a person. A human being behind the lens, with my own journey, my own weight, my own existence.\n\nSo this is just a small reminder to my fellow photographers: take the damn picture of yourself too.\n\nEven if it feels awkward. Even if you think it’s “not the point.” Even if you’re bloated or tired or still adjusting your settings. Step into the frame.\n\nWe deserve to exist in our archives too, not just through EXIF data or watermarks, but through images. Our hands, our tired eyes, our beat-up camera bags, our expressions when no one’s watching. We matter in this story.\n\nThe camera might be our tool, but it’s also our mirror. Don’t leave yourself out of the narrative.\n\nMuch love, stay well!\n\nhttps://imgur.com/a/sKzT4lW",
    "score": 716,
    "url": "https://reddit.com/r/photography/comments/1m8igg3/dont_forget_to_photograph_yourself_too_you_matter/",
    "created_at": "2025-07-24T22:34:49.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1ot61ol",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "I just found out I’ve been shooting in JPEG for 5 years",
    "text": "Hey fellow photographers 💃🏼 I just found out after 5 years of doing photography I’ve only shot in JPEG and not RAW \n\nFor some explaining my first 2 years doing photography I worked one on one with a coach who taught me everything I know. He never once mentioned shooting in RAW. Everytime I saw videos of other photographers talking about shooting in RAW I just assumed they meant manual, which I do\n\nI’m the type of photographer where I don’t know much about cameras (annoying I know) I just know how to change settings and basic things to get nice photos so I don’t really go to my camera setting unless it’s to change white balance or format my cards\n\nAnywayssss today after scrolling upon a tik tok video of “how to change your camera settings to shoot in RAW” I found out my whole photography career I’ve only shot in jpeg \n\nI have consistent bookings and have done hundreds of weddings and never received any bad feedback on any of my sessions, so I know I’m not a terrible photographer, but today made me feel like an absolute failure lol\n\nAnyways do you guys have any feedback or advice on transitioning to shooting in RAW because this not so newbie photographer needs it 😂",
    "score": 713,
    "url": "https://reddit.com/r/photography/comments/1ot61ol/i_just_found_out_ive_been_shooting_in_jpeg_for_5/",
    "created_at": "2025-11-10T05:55:46.000Z",
    "num_comments": 532
  },
  {
    "id": "reddit-1jv13ci",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "I regret to inform you it costs a lot of money to take good pictures of birds (Olympus 150-600mm review)",
    "text": "\"You've just got to get closer!\" , \"Zoom with your feet!\", \"You just need to work on your technique!\". This is all a ***pack of lies.***\n\nI've been shooting photos for two decades now, and until last year I never really bothered with wildlife. Sure, I'd see some photo of a wolf jumping a fence or a bird snatching a fish from a river and say \"oooohhh\", and then immediately forget it. It's boring, it's mostly documentary, and that $hit costs a fortune.\n\nWell, middle-age comes for us all and I found myself knowing the names of birds and making time to look at sunsets and all the other soft-boy activities that appeal to a mind and body on the back half of life. The gray hairs in my sink spelled out \"long telephoto\" and I got into this nonsense.\n\nI started off with a Panasonic G9 and the Olympus 40-150mm 2.8. Amazing lens, and a great camera if you don't particularly care about focusing. The Oly is basically flawless, and even though I rarely find use for it, it sits in my cabinet, unsold. I cannot bring myself to sell such a perfect thing. Problem is of course even with the 1.4x TC it is stuck at a paltry 210mm. Pathetic. I can throw a small child that far.\n\nOh look! Olympus (I will NEVER call them OM System as it's such a stupid name) released a new 100-400mm! I'm so excited to have that kind of range! Well, it [was a dud](https://www.mu-43.com/threads/is-my-100-400mm-olympus-a-dog.122421/#post-1688501). As you can see in that thread, everything looked soft and gooey. It also feels like one of those camera lens shaped coffee mugs you buy off Amazon for $15. Cheap and plastic for a THOUSAND DOLLARS. Whatever, back to the rando eBay seller I got you from!\n\nOK, if there is one name we can count on for quality glass it's LEICA. They would NEVER put their name on a series of deeply underwhelming lenses. Not our precious *Ernst!* Well, 3 copies later, I feel confident in saying the PL 100-400mm is an inconsistent little can of garbage. Sure, once in a while you will get a glorious image, but much more often it will misfocus or be blurry at 1/2000 sec somwhow or the IS will just kind of not work. And when you complain **they** will yell, in unison, \"you just got a bad copy\". Buddy, at this point I think you'd be better off buying $1k worth of scratch off tickets at 7/11 then buying this monstrosity.\n\nThe Panasonic 100-300mm ii is certainly a lens. It fits on a camera. It produces images which you are able to transfer to your computer. You cannot deny it's inherent \"existing\". I have never sold a lens so fast in my life.\n\nNever got the Oly cheapo teles because their \"expensive\" one was deeply disappointing.\n\nSo, anyway, late one night I'm dealing with a bout of insomnia and hate-browsing Facebook marketplace when I see a listing for the oft-maligned Sigma/Olympus 150-600mm. To be clear, the 150-600mm defenders (which I am now one of) have let me know it is most certainly ***NOT*** just a re-badged FF Sigma and there are extra elements and it's got the sync IS and hey where are you going I haven't even broken out the AutoCAD plans to show you the spherical elem....\n\nAnyway a large amount of $$$ later (with a free 95mm CPL!) I come home with this monstrosity and slap it on my OM-1.\n\nI will not get into the ludicrous ergonomics of this thing. Everybody has talked to death about how it \"defeats the whole concept of M43\" and \"when extended it flips you over like a trebuchet\". They are not wrong. This lens makes absolutely no sense for M43. It is truly an abomination. On the OM-1 it looks like a Honda Civic with a Tomahawk missile glued to the hood. Gawdy. Absurd. [Malformed.](https://imgur.com/3fN8mww)\n\nIt is impossible to hold with a single hand unless you want to snap your lens mount, and although I've learned to wrangle it handheld (the adjustable collar is nice!), it cries out for a monopod or tripod. I'm still young enough I will be dumb about this and mostly handhold while taking ibuprofen and gritting my teeth, but do not let *your* pride and vanity cause shoulder strain.\n\nI got *actual looks and comments* from my neighbors while walking around with it. \"Hey #REDACTED#, you sure your lens is big enough?! Ha!\" was an actual thing the old lady who lives across the street *yelled at me* as I aimed at a bald eagle perched in a nearby tree. I am a very large man, so I cannot imagine how stupid this thing looks with one of you little people.\n\nOnce I recover from my embarrassment (and almost suffer a hernia when I trip), I am ***IMMEDIATELLY*** in awe. This lens is otherworldly. I am drooling like a moron while checking sharpness on my screen. Wide-open, at 600mm handheld I am getting untouched 1:1 crops like [this](https://imgur.com/ot8072w) and [this](https://imgur.com/fqNcDT6).\n\nStop it down one or two clicks and you get [this](https://imgur.com/R9Xie2y).\n\nWe are in a very different league of glass here. This is rarified air. I've used some higher-end Sony lenses and a boatload of classic MF glass from Konica, Minolta, Leica, Contax, Nikkor, etc. This is right up there with the best I have ever used on any system.\n\nFocusing is lightening quick, but I believe the OM-1 is the main driver there. The AF difference between the G9 and OM-1 is so vast I cannot believe they were both released in the same century. \n\nThe sync IS is otherworldly. This is a *1:1 crop of a macro shot, handheld, at 600mm, wide-open, 1/80th of a second.* Read that again. From that description, you should see a blurry *idea* of a photo. Instead you get [this](https://imgur.com/7Wx5UZB).\n\nI opened this review with a derisive bit about the advice you get every time you complain about a telephoto in any online venue. Somebody will come along and start going on about how it's all about technique and timing and patience and blah blah blah. I am here to tell you you can just buy the 150-600mm Sigma / Olympus / OM System (barf) lens and randomly point it at birds a great distance away and you will get pretty good photos\n\n[1](https://imgur.com/hcabbYt)\n\n[2](https://imgur.com/FCHjaXh)\n\n[3](https://imgur.com/Fb7OflK)\n\n(last one is a 1:1 crop high-iso, but I like the 3 little birds and kept humming the song)\n\nI don't particularly like wildlife photography. The vast majority of photos you see (even at high levels) are about as compelling as a Wikipedia article image. Turns out animals kind of do the same stuff. Yeah, that duck sure did land on the water. Welp, guess that buffalo is steaming in a field again. You get the idea. Also, I've always felt at its core it is mostly a measure of free time and money. That's why you see the gray haired dudes at nature preserves with a 100L backpack filled with $30,000 in gear on a Tuesday afternoon. This lens has done nothing but strengthen my feelings on this.\n\nAs far as \"technique\"..... Can you hold your breath? Can you steady your arms? Do you know how birds tend to fly? Have you taken photos before and understand the basic concepts of composition and metering? Great. I'm now handing you a very cool diploma that says \"Wildlife Technique\". You get 2% off at BH Photo if you show it to them. \n\nIt costs $2000, but if it was painted white and a little smaller it would be $5000 and they couldn't keep it in stock.\n\nBuy it if you want to, but be aware it's very stupid looking and will probably mess up your shoulders.",
    "score": 678,
    "url": "https://reddit.com/r/photography/comments/1jv13ci/i_regret_to_inform_you_it_costs_a_lot_of_money_to/",
    "created_at": "2025-04-09T08:47:57.000Z",
    "num_comments": 194
  },
  {
    "id": "reddit-1peqw2a",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Friendly friday reminder: It’s about light",
    "text": "I see so many posts online about the new Sony A7 V and peoples need to upgrade or not to upgrade. So I just wanted to offer my perspective as a professional commercial photographer and retoucher of 15 years. \n\nI’ve worked with alot of big camera brands over the years; Hasselblad, Canon, Nikon, Sony, Fujifilm etc. They all have their quirks and offer slightly different focus, settings and output. The big argument I see nowadays is color. Hasselblad or Leica have the best colors and Sony have the worst and such. I remember, like 10-12 years ago, when the commercial studio I worked at wanted to change brand from Hasselblad to Canon. I belive we went fron H4D to 5D mark III. We shot alot of seasonal campaigns for shoe brands both in studio and on location. Do you know what the biggest difference was? The Canon was easier to work with because it weighed less. That’s pretty much it. Since I retouched the images the differences in color and contrast was negligible. \n\nI started my own company this year and bought the Sony a7 IV as a starter and planned to get the a7 RV as soon as possible. As I do alot of high end studio work. Turns out, the a7 IV is great. I will not upgrade to either a7 V or a7 RV any time soon. And just last year I shot a few assignments using the old and trusted Canon 5D mark II. I plan on getting my Canon 5D mark I up and running again to try and shoot some assignments.\n\nI see on online forums amateurs getting so focused on megapixels or the latest features of newer cameras. It will not make you a better photographer if you have the latest autofocus or more megapixels or any modern features. What will make you a better photographer is understanding light and how it behaves. If you focus your energy on that, you will rapidly start to get more interesting images no matter which camera you have. **Get obsessed with finding interesting light and try to understand why it is interesting.** If you start there, things will start fall into place. You will develop a keen eye for what makes an image intriguing to look at.\n\nTDLR: You’re good with what you have. Limitations are your friend. Focus on understanding light.\n\n  \nEDIT: No, you will not be a better sports/action/wildlife photographer using newer gear with better autofocus etc. It will however get make things easier for you. But since when does easier equal better? If you take assignments and need to deliver quickly, sure. But this post is meant to target amateurs. \n\nI could have sworn that sports/action/wildlife photography existed before autofocus and digital cameras..",
    "score": 646,
    "url": "https://reddit.com/r/photography/comments/1peqw2a/friendly_friday_reminder_its_about_light/",
    "created_at": "2025-12-05T09:36:46.000Z",
    "num_comments": 166
  },
  {
    "id": "reddit-1nt1rbc",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Accosted when photographing a concert in a public park",
    "text": "The other night I was shooting a free show in a public park in the US. During a break, I turned toward the audience and grabbed a few shots - the stage lights were behind them, so you got some cool silhouettes of heads and hair against the light.\n\nLater a woman accused me of “taking pictures of girls’ asses.” I was stunned, didn’t argue, just walked off and kept shooting the band. Then a musician from an earlier set came up and repeated the accusation. He angrily demanded to see my camera (we’d actually talked earlier - I shot his band with permission and gave him my contact info to send pics).\n\nTo defuse things, I showed him all the images on the card: \\~1-200 band shots and maybe 4 crowd shots. The organizer of the event looked too and said nothing was inappropriate. The musician claimed I must have deleted “bad” shots and said he didn’t believe me.\n\nI packed up and left, and later that night I saw he’d posted on IG calling me out by name, saying I was taking pics of underage people and deleted them when confronted, and warning others to stay away and not work with me. (which was deleted before I could screenshot it, however)\n\nThis is just a hobby for me, not income, but I don’t want my name dragged like this. I know what the law says regarding expectations of privacy, but it wasn’t the moment to explain the law to an angry musician.\n\n**Questions:**\n\n* Anyone else ever deal with something like this?\n* Do I just keep my socials private and locked down and just move on?\n* Or is this actually a situation to consider a lawyer/libel angle?\n* Any tips for protecting yourself in the future (especially at shows)?\n\nI’ve kept the card intact just in case. Honestly I’m more frustrated and shaken than anything.",
    "score": 639,
    "url": "https://reddit.com/r/photography/comments/1nt1rbc/accosted_when_photographing_a_concert_in_a_public/",
    "created_at": "2025-09-28T22:34:33.000Z",
    "num_comments": 271
  },
  {
    "id": "reddit-1lqjsbf",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Unpopular opinion: A lot of “luxury wedding photography” is just average photography wrapped in expensive styling.",
    "text": "\n\nI’ve seen a fair share of weddings featured in Vogue and similar platforms – and honestly, many of those galleries would look entirely average if you stripped away the designer dress, floral arch, and the expensive venue\n\nThe composition and light is Basic. But the setting does the heavy lifting.\n\nWhat does this tell us? That “luxury” in wedding photography is often more about access and positioning than about actual skill behind the camera. Sure there are good photographers with Great skills but majority of photos are venue, decor, details and portraits with direct or side light. No silouethess or interesting composition or perspectives. Probably there is, but most od the work is very Basic.\n\nIf you know your light, framing, and timing – and you manage to break into the high-end market – you can call yourself a “luxury photographer.” It’s less about shooting better, and more about shooting in better places with clients who already bring the wow factor.\n\nTo put it simply: a $100 watch shows the same time as a $10,000 one – it’s the branding and context that change everything.\n\nCurious to hear how others feel about this. My goal is to hear opinions",
    "score": 596,
    "url": "https://reddit.com/r/photography/comments/1lqjsbf/unpopular_opinion_a_lot_of_luxury_wedding/",
    "created_at": "2025-07-03T07:50:22.000Z",
    "num_comments": 156
  },
  {
    "id": "reddit-1k1ggca",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Major music label wants full buyout of my photo for $0 — how much should I actually charge?",
    "text": "Hey everyone — I’m a freelance photographer and recently got contacted by a **major music label** to use one of my photos for an **Single cover**.\n\nThe artist they’re using it for is **newly signed but already doing \\~1 million monthly listeners on Spotify** — so there’s real visibility and commercial push behind this release.\n\nThey sent over a **photo buyout agreement** that gives them:\n\n* **Full copyright ownership**\n* **Unlimited worldwide usage in perpetuity**\n* **Commercial rights (album art, ads, merch, etc.)**\n* I also **can’t reuse the photo**, except in my portfolio (with their copyright notice)\n\n**And they offered $0 for it.**\n\nI’m planning to counter but not sure what’s fair. I was thinking around **$1,500** for a full buyout, but I’d love to hear from anyone who’s done work like this — or if I should propose a **license instead of a full buyout**.\n\n**TL;DR:**  \nLabel wants full buyout of my photo (forever, unlimited use) for an artist with 1M Spotify listeners. They offered $0. What should I realistically charge?",
    "score": 590,
    "url": "https://reddit.com/r/photography/comments/1k1ggca/major_music_label_wants_full_buyout_of_my_photo/",
    "created_at": "2025-04-17T16:03:36.000Z",
    "num_comments": 241
  },
  {
    "id": "reddit-1l9dc0w",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Smartphone Photography Has Raised the Bar for Photographers",
    "text": "Over the past decade, I’ve noticed a subtle but significant shift in photography one that’s easy to overlook because it’s happened so gradually: smartphones have quietly raised the bar for what we consider a “good” photo.\n\nTen years ago, if you had a decent DSLR or mirrorless camera, you were light-years ahead of most people. Camera phones were still catching up  they struggled with low light, had limited dynamic range, and often lacked the clarity or depth that came with a proper lens and sensor. Simply owning a good camera gave you an advantage. You didn’t even need to try that hard a clean, well-lit shot with nice bokeh practically screamed quality.\n\nNow? That gap has closed… dramatically.\n\nModern phones like the iPhone, Pixel, or Samsung Galaxy are pushing computational photography to wild levels. They balance exposure automatically, fake background blur decently well, and pull out dynamic range that would have taken post processing to achieve not long ago. Casual users are regularly producing clean, punchy, and “professional-looking” shots  just by pointing and shooting.\n\nAnd that’s kind of incredible, but also a challenge.\n\nAs someone using a dedicated camera, I’ve realized the bar has been raised. What used to make your work stand out (sharpness, clean exposure, nice color) is now just the minimum. If your photo doesn’t offer something more storytelling, mood, emotion, unique composition  it’ll probably just blend into the noise. It’s no longer enough to own good gear; the how and why of your photo matters more than the what.\n\nDon’t get me wrong.. I love that photography is more accessible now. But I do think it’s made the craft more demanding in a way. To stand out, you’ve got to be intentional. Thoughtful. Creative. The technical floor is higher, so the artistic ceiling has to rise with it.\n\nAnyone else feel this shift? Has it changed how you shoot or how you view your own work?",
    "score": 588,
    "url": "https://reddit.com/r/photography/comments/1l9dc0w/smartphone_photography_has_raised_the_bar_for/",
    "created_at": "2025-06-12T04:21:26.000Z",
    "num_comments": 338
  },
  {
    "id": "reddit-1jqkrs9",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Every Photographer Should…",
    "text": "A camera isn’t a shortcut to having taste.\n\nOne of the most common missteps I see in today’s photography industry? A lack of foundational art training. Composition, color theory, value; these aren’t just for painters and illustrators. They’re the bones of a good image, no matter the medium.\n\nOne of the wildest things I see floating around photography circles? People asking what they should charge… when they don’t even understand basics. It’s like trying to price a cake before you’ve learned how to crack an egg.\n\nLook, I’m not here to gatekeep. But if you don’t know how to lead the eye through an image or why certain colors clash, you’re not ready to charge. Not yet. Take a drawing class. Study paintings. Watch free videos on the fundamentals. If I can learn it on YouTube in sweatpants at 2am, so can you.\n\nYou don’t need an MFA. But if you’ve never taken an art class or studied the basics of visual storytelling, you might be charging before you’re actually ready. And yes, I said it.\n\nEdit: On a shoot right now but I will try to compile a list of the best free &amp; paid resources I’ve found!\n\nJust wanted to pop back in and say thank you for all the thoughtful conversations that came out of this post! It’s genuinely refreshing to see so many folks diving into the why behind good photography, not just the gear.\n\nAs promised, here’s a round-up of my favorite resources that helped me build stronger artistic fundamentals, especially as they apply to photography:\n\nLindsay Adler’s YouTube Channel – If you want to fall madly in love with studio lighting, her channel is a goldmine. I especially adore her studio lighting course, it’s a masterclass in intentional light shaping.\nLindsay Adler on YouTube\n\n[Understanding Values for Artists](https://youtu.be/RFQtsXktc9g?si=VRkrQtLd0sMX-axr) – This video completely reshaped how I look at contrast and tone in photography. Applicable way beyond painting.\n\nThe Art of Color by Johannes Itten – A classic, but for good reason. It’ll help you understand color harmony like a cinematographer.\n\n[Secrets of Colorgrading](https://youtu.be/mC8ol2-V7Ck?si=bOzLaLHF_GAn0T-v) - A quick overview of how color ties into photography and how to apply it to your workflow.\n\n[ShotDeck](https://shotdeck.com) – Using this platform was a game-changer for studying composition. Endless film stills to dissect and reference. I found it helped me see the frame differently.\n\nBut if I could offer just one piece of advice?\nBe your own art director. Analyze your work. Tear it apart. Study it like it belongs to someone else. Then show it to people: trusted peers, local photographers, even that one brutally honest friend who never sugarcoats. Ask for feedback. Take portfolio reviews seriously.\n\nThe fundamentals will always be there to catch you, even when you’re experimenting. And the more you shoot, the more you’ll notice your own patterns, growth, and—yes—flaws. Just don’t let perfectionism stop you from sharing.",
    "score": 512,
    "url": "https://reddit.com/r/photography/comments/1jqkrs9/every_photographer_should/",
    "created_at": "2025-04-03T15:02:41.000Z",
    "num_comments": 184
  },
  {
    "id": "reddit-1mzcqhi",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Practice photography as an art. Don't worry about becoming a business.",
    "text": "I'm pretty tired of the state of photography \"education\" these days. I learned photography in the 90s in high school on a Nikon F2. My high school photography teacher had a Master's in Fine Art and it was very much an art class with photography as the medium. We learned the whole process from end to end starting with bulk rolling film into canisters, shooting, developing, enlarging, and mounting prints. I took the class every year in high school. \n\nAfter going to college and working in the corporate world for many years, I switched my career path to cameras in 2022. I now am a professional motorsports photographer and blessed to have people like race car drivers and team owners in my rolodex. \n\nWhat led me here was not about business. Yes, I wanted to make a business. But I didn't just jump in and try to make a wedding photography or some other business, because frankly the thought of attending a bunch of random clients' weddings sounds horrendous to me. \n\nInstead, I sought out experiences and worked on my craft. I made connections with key players in worlds like motorsports, music, arts &amp; culture. I sought out ACCESS. Because I decided there's no point in being the greatest camera technician ever if you don't have something cool to point the camera at. \n\nThe problem as I see it is most photography educational content these days is not actually servicing the outcome of being a Photographer. I believe a Photographer is an artist with a unique perspective and way of seeing the world. They use a camera to translate their experiences into photos or videos. Whether or not a Photographer chooses to make their art into a business, they are still a Photographer. The YouTube &amp; social media photography business content machine is not teaching you all to become Photographers. It's teaching you to become event recording camera operators. \n\nYou don't need to be a \"professional\" to become a good artist. You need to learn and practice art. It is absolutely valid to have a personal art practice, seek out wonderful experiences, and record the memories for yourself and sharing with others who you think might enjoy the experience. If you love photography and want to keep it to yourself, great!\n\nI've had far too many motorsports fans approach me and profess their love of photography but couch it in terms of, \"but I'm only an amateur.\" I always encourage these folks to see the value in a personal art practice. Photography in particular by using one eye to look through a viewfinder actually trains the 3D navigation &amp; mapping centers of the brain through a process known as monocular cueing. Same idea behind how ancient ship captains navigated by the stars. \n\nYouTube &amp; social media content that only teaches you about gear, settings, and business is not teaching you about art. The rule of thirds is a starting point but not at all the end of understanding. Content creators like Jared Polin, The Northrups, and Simon d'Entremont are convincing you that technical mastery of the medium of photography, and expensive gear, are the point entirely. They rarely talk about ART. \n\nThese people aren't wrong, but in my opinion they're not seeing the full picture. You absolutely should pursue your personal art practice purely for its own sake. Learn about how art works. The mathematical underpinnings. The historical greats. Take that and inform your photography with it. \n\nA camera is just another form of brush &amp; canvas, but what makes it wonderful is it's a machine that captures an imprint of light and time. Talk about communing with the universe.\n\nEnjoy yourselves. Don't call yourselves \"just amateurs.\" Grow your art and I guarantee you'll reap the benefits. Photography has been the greatest blessing in my life and nothing to do with business is why I consider it a blessing. \n\nGo watch some Bob Ross videos. You'll see what I mean. ",
    "score": 505,
    "url": "https://reddit.com/r/photography/comments/1mzcqhi/practice_photography_as_an_art_dont_worry_about/",
    "created_at": "2025-08-25T00:50:51.000Z",
    "num_comments": 187
  },
  {
    "id": "reddit-1ipqoek",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "I went all in on photography in 2024: my 5 biggest lessons learned",
    "text": "After selling my online marketing business in 2023 - which I had for +-13 years, which was an online men's magazine and agency for branded content - I could finally go all-in on what I really wanted to do: become a culture and travel photographer and make epic photographs from around the world!\n\nI was always traveling a couple of times a year for the last 20 years, and I always took some sort of camera with me. But I was without a doubt just a silly tourist who shot on Auto-Mode. I had absolutely no clue about technical stuff like compositions, ISO, bokeh, white balance, Lightroom, and so on.\n\nSo I went all in! I think I never worked harder and studied harder in my life than in 2024. I think I did 4 years of school in 1 year. My brain is still making those electrifying crackling noises haha.\n\n**These are the 5 biggest lessons I learned in 2024 from going all-in on photography:**\n\nI would love to hear your input on this. Questions are very welcome of course!\n\n=====\n\n**5. It's 95% - 5% :S**  \nI was hoping to get away from the laptop with this new career, but sadly I still sit behind the laptop for hours and hours on end. I spend about 95% of the time behind the screens. Editing, marketing, building sites, emailing, networking, social media, bookkeeping, planning trips, researching, learning more about photography, and so on.\n\nThe sad truth is that I hardly spend 5% of my time outside photographing. I really need to make this at least 10% of the time!\n\n*(My stiff back and legs also need to sit less and walk more...)*\n\n**4. Every photographer is truly unique**  \nJust like every music artist, nobody sounds exactly alike. You could certainly have a niche or a set of other photographers that your work looks a bit alike, but there are always certain small differences (the camera, the light of day, the editing etc) to make sure that your photo looks unique.\n\nYou should definitely get inspired by the greats, but make sure you have your own unique style. At first, I explored and tried a couple of categories in photography, but I quickly realized it's better to master one or two fields than be all over the place with like drone, macro, wedding, product, model, wildlife and so on.\n\nI looked at the bodies of work of heroes like Steve McCurry, Michael Yamashita, Peter Lik, Billy Dinh, and many others, but I found out quickly that I truly do have my own eye, my own interests, and my own vision of what I want my body of work to become. \n\n**3. Editing is 50% of a good photo**  \nThe more I edited, and the more I learned about Lightroom, the more shocked I was about how much good editing matters. I even reason it's so important that it's 50% of the photo.\n\nAnd the editing needs to be just right. Not too much, not too little. Keeping it realistic, but also impressive, colorful, and atmospherical. Editing is also almost just as hard to master as getting the shot!\n\n**2. The most important element is standing in front of interesting things**  \nI have such a strong opinion on this, that I just want to grab a microphone and scream this very essential fact haha! :)\n\nThere is nothing more important than standing in front of fascinating, interesting, beautiful, funny, weird, cool things happening before you. If you live in a grey boring village in some dead area in Germany in the middle of winter, please get out of there and go to exciting places like Italy, Vietnam, China, and/or Iceland.\n\nBeing in these lively places will inspire you to get the camera and go out there and shoot. There are dozens of cool shots (street, landscape, portrait, monochrome, colorful, etc) to be made if you, for example, are in Beijing, China.\n\nI also think many smart gearheads in photography are a bit too obsessed with the technical stuff, the gadgets, and having the best gear. They have like 10 bodies and 20 lenses, but don't get out that much to actually shoot a lot. It feels like they rather have the best gear, instead of the best photos.\n\n**1. A good photograph is like a symphony**  \nFor an absolute winner of a photograph, dozens of elements have to be right. The light, the moment, the subject(s), the timing, the photographer standing in the right place, an excellent camera with the right settings, and of course the editing. It's like a symphony!\n\nYou might be the conductor, but you need the whole orchestra to work perfectly together to create beautiful art.\n\n===\n\nThanks for reading.\n\nFor 2025 and beyond, I'm all in on getting better and better. Let me know your tips and lessons learned in your hobby or career as a photographer. And AMA if you have questions.\n\n**TLDR:** Photography is an elite art form. It's hard to master, but all in all a very fulfilling endeavor, but for sure don't underestimate it. It's a loooooot of work!  \n  \n*(If you are curious about my work, you can find me with my name on Reddit and many socials, would love to connect with like-minded creative souls!)*",
    "score": 387,
    "url": "https://reddit.com/r/photography/comments/1ipqoek/i_went_all_in_on_photography_in_2024_my_5_biggest/",
    "created_at": "2025-02-15T01:40:04.000Z",
    "num_comments": 291
  },
  {
    "id": "reddit-1peaj6p",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "The secret to a long lasting photography business?",
    "text": "As someone who's run a successful photography business for more than 20 years, I feel like I have some idea how maintain longevity in your photography career. Here are a few pointers:\n\n* Be ready to scale your business. I found implementing a CRM made it so much easier for me to handle more clients and still provide a high quality of service. Saved me hundreds of hours a year and having professional contracts, invoices, pay portal, etc. builds trust with clients\n* Remain adaptable. Learn new techniques. Pay attention to market trends - and I'm not talking about just style trends (which you should be aware of those as well) but how people are buying/booking. There are shifts over time and you have to adjust your approach in how you sell if you want to keep up. You can't keep using the same keywords for a couple decades.\n* Maintain your physical health. Some genres can be brutal on your body (10-12 hour shooting days on weddings, for example) but sitting around editing is not good for your body either. Find ways to keep your instrument running smoothly.\n* Prioritize your marketing over new equipment. If you don't have any jobs to work on, a new camera isn't doing you much good\n* Don't compare yourself to other photographers. I've seen people work decades without becoming 'famous' who still have very lucrative, fulfilling careers and I've seen people who 'shot to stardom' who burned out in a couple years. Everybody goes on their own journey and most of the time, you're not seeing what is really going on with someone's business.\n\nWould love to hear your thoughts as well!",
    "score": 175,
    "url": "https://reddit.com/r/photography/comments/1peaj6p/the_secret_to_a_long_lasting_photography_business/",
    "created_at": "2025-12-04T20:15:46.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1n3yp3n",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "I'm having an existential crisis",
    "text": "\n\nI've been a professional commercial photographer for the last 5 years and during that time I've had the pleasure of working with some of the world's biggest brands. My yearly income is insane and would never thought I would make this much money doing something creative  let alone taking pictures. This is a career I worked so hard for and I realize I am incredibly blessed to be able to do this for a living.\n\nBut it all feels so...empty. I am harnessing all my creativity, my blood sweat and tears for what. To help a corporation sell a product. To contribute to the sea of pollution that is the advertising world to trigger a reaction in people to buy a product. What a waste of creative potential. This is in no way helping the world or contributing anything of value, except for the corporation.\n\nMy career goal used to be working with a big brand like McDonalds or Nike, but now that just seems incredibly misguided. I have no idea what I would do other than commercial photo, but I think I'm losing that passion. The essential passion that you need to thrive in this industry.\n\nJust a vent. Anyone else can relate? Feeling lost",
    "score": 167,
    "url": "https://reddit.com/r/photography/comments/1n3yp3n/im_having_an_existential_crisis/",
    "created_at": "2025-08-30T10:56:53.000Z",
    "num_comments": 118
  },
  {
    "id": "reddit-1nvil21",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "How many SD cards have failed you as a photographer?",
    "text": "Currently working on a little stats projects about the failure rate of SD cards (including microSD cards). If you'd like to help me out, I'd be interested to know the following:\n\n1. How long have you been doing photography?\n2. What sort of gear do you use your SD cards in?\n3. Do you have a brand preference for your SD cards?\n4. How many SD cards in total have you used throughout your photography career?\n5. How many SD cards have failed you (corrupted, malfunction, physical damage, etc.) in total?\n\nThanks in advance to anyone who contributes!",
    "score": 167,
    "url": "https://reddit.com/r/photography/comments/1nvil21/how_many_sd_cards_have_failed_you_as_a/",
    "created_at": "2025-10-01T19:53:01.000Z",
    "num_comments": 472
  },
  {
    "id": "reddit-1j2lkbg",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Want to see contemporary photography? Look at the New York Times",
    "text": "Someone wrote a post about the NYT photography (specifically Oscars coverage) being lazy and flash-happy. I wrote a quick defense of the NYT in the comments and realized how passionately I felt about them. OP promptly deleted that post, so my response is gone. Wanted to paraphrase here because I see lots of posts about \"where should I look for inspiration\" and well, you could do a lot worse than flipping through the NYT.\n\nThe NYT is doing more for photography than pretty much any other publication in the US (maybe the world?). they hire a VERY wide breadth of photographers for a variety of assignments. as a great example, just look at this assignment on plastic bags that just ran: [https://www.nytimes.com/2025/03/01/business/plastic-bag-ban-nyc.html](https://www.nytimes.com/2025/03/01/business/plastic-bag-ban-nyc.html) If we can't appreciate how they elevated this story with a great photography essay, I don't know what to say. They spent money, invested time and energy to get a story about the most banal of objects, the plastic bag. Actually INCREDIBLE, if you ask me.\n\nAnd since we were talking about the oscars, look at the portraits of nominees they produced. They invested in numerous shoot days with multiple photographers just to make this happen. [https://www.nytimes.com/card/2025/03/01/arts/httpswwwnytimescomcarddatesectionlook-at-oscar-nominees-and-their-film-journeys](https://www.nytimes.com/card/2025/03/01/arts/httpswwwnytimescomcarddatesectionlook-at-oscar-nominees-and-their-film-journeys)\n\nThey persistently do these kinds of things. They almost single-handedly give young photographers careers and put them on the map. They're responsible for T magazine that has some of the most talented photographers working for them every week (from portraiture, fashion, documentary, etc etc).\n\nSo if you're looking for some inspo, flip through the NYT. You could pretty much build an index of the who's who of contemporary photography just by writing down the names of all the contributors. Just wanted to give the NYT some flowers today!",
    "score": 149,
    "url": "https://reddit.com/r/photography/comments/1j2lkbg/want_to_see_contemporary_photography_look_at_the/",
    "created_at": "2025-03-03T15:44:02.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1kiig4y",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Anyone else get weirdly sentimental over needing to replace really solid equipment that has followed up around for many years?",
    "text": "https://imgur.com/a/KEJNwPy\n\nOn the left is my 13 year old Kingston card reader that has followed me around since my very first day of art school. On the right is its replacement I had to buy today.\n\nI panic bought the Kingston from the photo store across the street from my class after realizing on the first day that I had forgotten mine at home, and since then its followed me in my bag for every shoot, every trip, every client event, everything that I’ve shot for 12 straight years.\n\nIt’s not hyperbole to say that this thing has transferred petabytes of information. Little did I know what sort of life it would see when I first bought it all those years ago. It’s seen me go from my shitty HDR and rusty sign phase, to my very first paid family gigs, to my first full time photojournalism job, to my commercial success as a full time senior photographer and lead media producer. \n\nIt really has seen every bit of my career’s failures, successes, fuck ups, embarrassments and triumphs. It's traveled the entire globe with me, and has always had it's place on my office desk at home. It makes me wonder what sort of life this new card reader will see in the coming years. \n\nRest easy, my scratched, roughed up friend.",
    "score": 107,
    "url": "https://reddit.com/r/photography/comments/1kiig4y/anyone_else_get_weirdly_sentimental_over_needing/",
    "created_at": "2025-05-09T13:26:10.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1lz5yh7",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "In your opinion, to what degree is photography a talent?",
    "text": "I often hear people say that photography is not a talent at all. People argue that it is a skill, and the camera does all the work. They seem to believe that \"talent\" must come from your body(ex. singing, acting, drawing, painting, etc.) but that photography is more of a skilled usage of a tool(the camera).\n\nHowever, in my opinion, it is as much a talent as it is a skill. The talent can come from a natural, intuitive sense for lighting, framing, composition, and expression. The skill stems from a comprehensive understanding of editing, exposure, focus, aperture, and shutter speed (to name a few). You can also be talented in creating a mood or feeling, particularly across a large body of work.\n\nI think a lot of people who aren't interested in photography see it solely as a way to immortalize a certain subject matter. So, they see photographers not as talented, but as people using a simple tool to draw attention to a subject matter of their choosing. In some instances, that may be true. However, in the artistic sense, photographers wield a great deal more control over their images than the average person realizes, and I see a natural, intuitive ability to do this effectively as a talent.\n\nWhat do you think? How do you see it? This is all my opinion, but I am very curious to see what people think.\n\n**Edit**: I was definitely not expecting this many responses, but it's been interesting to read everyone's thoughts. A few people pointed out this is more of a semantics question, which is fair given that **talent** is defined as a 'natural aptitude or **skill.**'\n\nWhat I found most surprising was that some people argued that no talent is involved whatsoever, or that talent isn't real. Skill is undeniably a huge part of developing any craft, and I respect the importance of developing skill in improving photography. However, I'm not willing to concede that talent doesn't exist.\n\nTaylor Swift has likely met Malcolm Gladwell's 10,000 hours rule(referenced a few times in this discussion) several times over in singing practice, yet there is no reality where she can sing like Whitney Houston. Why? Because Whitney was simply more talented. Given tens of thousands of hours of training, even world-class athletes cannot outrun Usain Bolt. Why? Usain is a talented athlete. To say talent doesn't exist is to deny the existence of natural ability, which is silly.\n\nMany people rightfully pointed out that absolutely anyone can develop a skill in photography, given enough practice. I can get behind that point. But, if we are being honest, they will never have that *natural talent* I am describing. A *skilled* photographer will always have to consciously think about compositions, for example, whereas a *talented* one would instinctively know what looks good. There lies the difference.\n\nI don't mean to downplay the importance of skill. Skill is a *massively* important part of developing photography, and absolutely no good photographers have gotten anywhere without it. But, I can't help feeling there is some innate sauce that can't really be taught.\n\nSome of my best photos (as selected by gallery owners and museum curators during portfolio reviews) were taken on manual settings, at a point in my career when I couldn't have defined 'aperture' or 'exposure.' Why? Because I am naturally talented. I have improved my skills, which has improved my work; however, no amount of technical training can match talent. It doesn't.",
    "score": 96,
    "url": "https://reddit.com/r/photography/comments/1lz5yh7/in_your_opinion_to_what_degree_is_photography_a/",
    "created_at": "2025-07-13T22:35:13.000Z",
    "num_comments": 247
  },
  {
    "id": "reddit-1nv7i8v",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "What's the best advice you have received or given that has improved your photography?",
    "text": "Photography is a hobby for me, I go to various car shows and meets and over the years i'd like to think my eye for car photography has improved. I do follow a fair few people on Instagram and YouTube who have made a full time career from car photography too which is where I've learnt mostly from. That and actually going out and experimenting for myself.\n\nMy question for you is what advice if any was given to you that has improved your work? And what number 1 advice would you give someone who is maybe looking at trying photography etc.\n",
    "score": 93,
    "url": "https://reddit.com/r/photography/comments/1nv7i8v/whats_the_best_advice_you_have_received_or_given/",
    "created_at": "2025-10-01T12:58:36.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1nxyxib",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Lasers: A guide for photographers and videographers by a laser tech",
    "text": "(Repost from r/videography, figured you folks would get something out of this too!)  \nThis is mostly focused on concerts, clubs, etc, as that's where you'll likely encounter lasers - anything \"EDM\" and you'll almost certainly encounter some.\n\nI'll start with some quick takeaway points for those in a hurry, but there's a lot of info here, so feel free to read at your own pace. If you get to the bottom of this without falling asleep, maybe consider a career in lasering :P\n\nAny questions on what I've said or omitted, feel free to leave them below and I'll answer best I can. Hope this helps :D\n\ntl;dr - if you take away anything please remember this:\n\n* **Lasers can and will fry your camera's sensors, as well as your eyes if they aren't treated with respect by everyone involved** \\- from the performers, to the laser tech, to you. However, with some preparation, communication, and common sense, they are perfectly safe to work around.\n* **Try to observe the lasers for a little before starting shooting if you can.** This might be during an opener, or ideally before doors open. As much as I wish every laser tech was competent and operated everything safely, some are not that smart. If you're there early, ask the tech if they're happy to turn the lasers on so you can have a look and ask yourself: \"Where in the room are the lasers coming from? Will they hit the audience areas? Will they hit where I might shoot from?\"\n* Talk to the laser tech if they've got a minute! Just ask \"Are you crowd scanning tonight? Is there anywhere I shouldn't go with my camera so it doesn't get hit?\", and \"anything else I should know?\". Thank them afterwards, too. Technicians never have enought time on their hands-\n* If it's a \"party\" laser with no dedicated operator (or a lighting technician as an operator rather than a trained laser technician) or that the promoter has installed themselves in a smaller venue, then err on the side of caution and assume it's dangerous. It might stray into audience areas, or places you don't expect it to. If you've watched it's behaviour for a while, and can see it's well above the audience when it's projecting, you should be fine, but just be ready to change that judgement on a moment's notice.\n* **An ND filter will not save your camera.** No filters will save your camera from direct hit from a class 4 laser.\n\nLet's start from first principles: *How does a laser damage things?*\n\nYou hopefully remember from high school physics that all light is a form of energy. The difference between lasers and regular lights are that lasers concentrate all of their light energy into a tiny area, whereas regular lights spread their light energy out over a much larger area. This is what makes them so dangerous.\n\nThe analogy I like to use to explain this is that lasers operate in the same way that pressure does. For example, hitting a plank of wood with a hammer might cause a small dent. Hitting a nail into the same plank will drive it through the wood. By concentrating the same force into a smaller area, more pressure is created.\n\nIn the same way, lasers concentrate light energy onto a small area and will only diffuse back out to a larger area over a very long distance. This is great, in that it lets us laserists shoot beams over the entire length of an arena and have them still look pencil thin, but it also means that there is potentially enough energy in that small area to burn things, such as surfaces, skin, eyes, or indeed camera sensors.\n\nAdditionaly, both our eyes and cameras have lenses that focus light onto a smaller area, which further increases the risk. Even though a laser hitting a surface may appear to not be causing any burns or damage, the focussing that a lens performs can concentrate the energy in that same beam enough to damage whatever is on the other side of the lens. In the case of the human eye, this can cause up to a 100,000 times increase in energy density.\n\nTo put this all into perspective, a standard laser pointer will operate at under 1mW (milliwatts, I'll explain in a moment!). A 100mW laser can cause damage to the human eye within an extremely short time frame... and most show lasers operate at anywhere from 1000mW to 100,000mW, depending on the size of the show.\n\n*Laser Classification (Classes)*\n\nLasers come in different \"classes\" that broadly define how dangerous they can be. These range from class 1, all the way up to class 4, where a higher class means a more hazardous laser exposure.\n\nProfessional show lasers are always class 4, but some smaller \"party\" units may come under other classes. Classification is based on a number of factors, but is primarily informed by the output power. This is usually measured in milliwatts (mW), but show lasers are often measured in whole watts (W) instead as they are able to output several thousand milliwatts.\n\nThe higher the class, the less time it will take for direct contact with a laser to cause damage, with class 1 lasers taking anywhere from a few minutes, to a class 4 laser taking microseconds of direct contact to cause damage.\n\nClass 2 lasers range from 0.4-1mW, and ~~present a risk of significantly damaging a camera sensor~~ present a low risk of damaging your eyes or a camera's sensor. Our natural aversion response to the bright beam protects our eyes from direct exposure, and short shutter speeds will likely protect a camera, but deliberately staring at the beam or performing a long exposure of the beam is not safe (though I'd not reccomend risking it regardless!)\n\nClass 3 lasers are 1-500mW present a risk of damaging your eyes or skin as well as a camera sensor. Class 3 is actually split into 3R and 3B, where 3R is 1-5mW and 3B is 5-500mW. Some smaller \"party\" or \"automatic\" style laser show projectors are class 3B, but these can still be dangerous!\n\nClass 4 lasers are anything that outputs 500mW or above. These will, of course, fry camera sensors, or eyes, or quite frankly anything easily combustable they encounter! These are the one's you'll likely find being operated by professionals.\n\n*What about different coloured lasers? Aren't different colours more powerful?*\n\nThere are a lot of interesting misconceptions about laser colours and how that affects safety.\n\nIn a typical diode laser projector, there are typically 3 smaller laser diodes fitted inside the projector housing: one for red, one for green, and one for blue. This, as with pixel displays, allows for any colour to be mixed additively (in theory!). However, as our eyes are less sensitive to specific colours, the relationship between perceived brightness and energy output of the laser varies depending on the colour, among other factors.\n\nThis makes trying to guess whether a laser is hazardous based on the brightness of the beam extremely ineffective. For all intents and purposes, I would ignore colour and work off the class of the laser.\n\nUltimately, the sorts of wattages you'll encounter at concerts where there are dedicated laser operators will be high enough that the differences in wavelengths will be negligible - all of them can cause damage.\n\n*Should I never shoot around lasers then?*\n\nAll of that said, you can still shoot around lasers safely given a little forethought and communication. Because of all of the risks I have just mentioned (as well as other factors that are far too in-depth to talk about here), governements and health and safty regulators are (usually!) very strict about laser use. For example, in the USA laser show operation requires a type of license called a \"variance\", and in the UK there is an expectation of competence that is covered in legislation.\n\nOne key thing that qualified laser operators should be doing is ensuring that all laser beams are kept at least 3 meters above any ground the audience is stood on. If this is done, then you should be safe to shoot from pretty much any audience area. The rules on clearance over staff and performer areas are a little different however, so it's worth asking the laser technician where is safe to shoot from. If you're mounting any cameras above the audience in advance, try and talk to the laser tech before they start setting up and work with them to confirm that where you put them won't be in the way. They may be able to digitally mask a section out of the laser's projection area for you to put your camera safely.\n\nOne thing to be aware of is that there are ways for laser technicians to safely and legally fire beams into audience areas (called \"audience scanning\"). However, these require a lot of paperwork, pre-planning, and often a dedicated license, so if you're at a smaller show, you're almost certainly not going to get safe or legal crowd scanning occurring. If you do see beams hitting the audience at a small show, shut the cameras off, and go talk to the laser tech and ask if the audience scanning they're doing is safe for both your eyes and your cameras. If you're at all unsure that they're doing audience scanning safely, legally, and competently, pop the lens cap back on and get the hell out of there! Go talk to the promoter or whoever booked you and see if you can get the lasers looked into (the threat of bad crowd scanning blinding audience members will probably be enough to get them to go check with the laser tech!).\n\nIf you're at a bigger event or a festival, it's possible that there are lasers set up to safely crowd scan. It's worth checking with the stage manager about that if you've got time, the technician or on site safety inspector should be able to inform you about what is and isn't okay for that setup.\n\nAlso, as an aside, the laser technician should have an dedicated emergency stop at their operating position, as well as be able to see the surfaces the lasers hit. The technician should also not fall asleep or get blackout drunk on the job (I wish I wasn't speaking from experience dealing with another laser tech who did/did not do all of those 4!)\n\n*My videos of lasers don't look right! They're moving on the video when they look still in real life.*\n\nYou've just encountered laser banding (not to be confused with colour banding). If you've ever shot a video display and been able to see the display refreshing in the footage, it's basically the same principle. Laser projectors work by using a pair of mirrors to move (or \"scan\") the beam quickly enough to trick our eyes into seeing a shape, rather than a moving beam. However, the camera's shutter only expose light for a small segment of each frame's duration, so only a small number of the beam positions show up on the final frame. Try adjusting shutter speed and capture framerate until the banding clears up. If this comes at the cost of other aspects of the footage that are more important to you, feel free to scrap it though - most people don't pay much attention to the look of the lasers after the fact, just the general colour and the fact that they're there (though us laserists do appreciate good laser footage, so maybe get a couple of handheld clips of the lasers without the banding for our sake if you can ;) )\n\nOne nice upside laser banding is that it can look awesome if you're doing a dedicated shoot and working with a laser technician. Go see the video of Tom Scott stopping a laser beam midair or Childish Gambino's SNL performance of \"This is America\" for some examples of what I mean.\n\n*Further reading*\n\n* [https://www.ilda.com/camera-sensor-damage.htm](https://www.ilda.com/camera-sensor-damage.htm)\n* [https://en.wikipedia.org/wiki/Laser\\_safety](https://en.wikipedia.org/wiki/Laser_safety)\n* Anything from LVR optical, ILDA, or [r/laserist](https://www.reddit.com/r/laserist/)",
    "score": 84,
    "url": "https://reddit.com/r/photography/comments/1nxyxib/lasers_a_guide_for_photographers_and/",
    "created_at": "2025-10-04T16:45:30.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1logq0p",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Got recommended for a job I can't do",
    "text": "Still processing this slight shock but wanted some advice that wasn't my roommate so bear with me 😅\n\nI'm a relatively new photographer whose been passionate hobbyist for several years but have started actually securing gigs in events and fashion only for the past year or so. \n\nI recently received a message from a stranger enquiring about newborn photos, asking about pricing packages and studio locations and all that while I'm internally panicking. I was very upfront about my areas of 'expertise' and that I did not have a studio. In fact, I've never worked in a photo studio before. I've done runways and conferences and career fairs and press rooms, but not studios. The person understood and we parted ways positively and quickly. \n\nBut before the convo ended, I asked to see the message that recommended me in the first place because if anyone I've worked with would know that I'm not newborn photography ready. \n\nThey sent me back a screenshot and I instantly recognised it as a person who gave me work in theatre. And I'm like....?????? I don't know if I should speak to this recommender about randomly sharing my number to anyone who's looking to take more professional photos of anything. Or if I should just politely decline them as they come? \n\nI don't want to cut off potential opportunities, and maybe I'm overreacting in this one instance, but I felt that it sets a bad precedence.\n\n\nUPDATE: thanks everyone for the variety of opinions!! it was really helpful to get a range so i can understand how this post could have been interpreted. for clarity, i wasn't bugged that the recommender was offering work. i simply felt that working with newborns is an extremely specialised area with a wholeeeeee different skillset to working with adults and professionals. also, the parents were specifically looking for studio environment and wanted somebody with experience in newborn photography, which I definitely did not fit the bill, and had no time to practice since they also wanted it done ASAP. When I was starting to level up slightly into the 'pro' area, i also frequently did mini practice at home to have something relevant to show for portfolio (e.g. product, portraits), so i get some commenters encouragement to hustle and take it on. but i felt newborn photos was wayy too beyond any home 'practice' i could do. it is an extremely precious and emotional window of time for thrm and I didn't feel comfortable taking it on. this discomfort may have then been transferred to the recommender, who I might have subconsciously believed to be the 'cause' of this awkwardness. which is completely unfair, i get it. \n\nUPDATE #2: I will also thank the recommender soon for thinking of me for non-theatre work. thanks for the reminder 🥺🙏 ",
    "score": 59,
    "url": "https://reddit.com/r/photography/comments/1logq0p/got_recommended_for_a_job_i_cant_do/",
    "created_at": "2025-06-30T19:26:17.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1p1e9qi",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Historic perspective on trends",
    "text": "Photography was a major part of my job 1980 to 2022, when I retired to continue my lifelong pursuit of shooting for fun.\n\nI have witnessed many equipment advances and changing style trends.\n\nI've been amused by some folks' belief that there is something magical about what is referred to as the \"full frame\" digital format. The 35mm full frame format (in my vague memories) originally was called \"miniature,\" because until the 1930s (and actually far beyond then), still photographers shot with sheet film, 8x10, 4x5, or smaller. In comparison, a 35mm film frame is tiny. Digital \"full frame\" is just the regurgitated 35mm frame size, which is what it is only because Oskar Barnack repurposed 35mm movie film into his still camera design. Yes APS-C and Micro Four Thirds are smaller formats, but there is nothing magical about \"full frame,\" which itself is considerably smaller than medium format digital cameras or scanning backs on large format cameras. Each format has advantages and disadvantages. None is perfect and none is bad.\n\nI also am amused by the recent trend to always strive for a short depth of field to create bokeh by decreasing depth of field. For most of my newspaper and magazine career, I frequently struggled to increase depth of field so images would bring more of a scene into reasonable focus. Showing surroundings, or even just getting several faces into focus, helped tell the story. Limitations of film speed and other equipment considerations could make this difficult. While I acknowledge the visual and artistic beauty of wild bokeh, I suspect its widespread use is a temporary trend and will fade from popularity when people realize visual context can be as important as the central subject.\n\nIt has long puzzled me that so many beginners and advanced amateurs cannot be satisfied with anything other than the latest, most expensive camera and lens. For more than 40 years, I earned my living with used gear, never top of the line. I generally shot with mid-priced cameras and lenses, averaging about a decade old. Sure, I read about the newest models -- but I didn't need them, and I really never desired to own them. Portability is important. And my jobs involved navigating the real world of crowds, rain, snow, dust and blunt objects, so I didn't want to carry expensive gear for gear of damage. In retirement, my newest camera is 10 years old (though I just bought it last year), and I still sometimes use a 20-year-old DSLR. \n\nMany megapixels are nice, but pricey. And not needed for most shooters. I have some beautiful 8x10 prints from images taken with my first digital camera, which produced only 3 megapixels. I rarely make prints larger than 20x24, for which 10 megapixels is plenty -- despite what some number crunchers calculate. People who only view or share images electronically need only a few megapixels.\n\nI always have considered subject matter more important than technical perfection. Perhaps because I matured in an industry that valued reportage, meaning and understanding -- alongside turnaround speed to hit deadlines. Sometimes you have to cut corners to deliver a valuable message on time. Readers want to see what happened, and don't care if the shadows are muddy or a brick wall is slightly out of focus.\n\nI love looking at images by Ansel Adams. I also love looking at images by Daido Moriyama and Olga Karlovac. Technical perfection can be beautiful. But imperfection can share messages just as meaningful, if not more so.",
    "score": 55,
    "url": "https://reddit.com/r/photography/comments/1p1e9qi/historic_perspective_on_trends/",
    "created_at": "2025-11-19T17:41:29.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1l3vhhw",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Do you still have time to enjoy photography?",
    "text": "This is a question to all the fellow professionals in this community.\n\nLike many of you, I fell in love with photography long before I actually decided to do it professionally. Naturally, what I used to do for pure enjoyment slowly became more of a \"chore\", to the point that I now barely open Lightroom/Photoshop to edit my \"personal pictures\".\n\nI love travelling and do it quite frequently. Whenever I'm away, I spend a considerable amount of time doing landscape and street photography. I still love the feeling of seeing new places through the lens and capturing candid moments. That part hasn't changed. But most of my images just sit on an external hard drive, waiting for me to \"find time\" (or the energy) to sort through and edit them.\n\nAfter spending hours on Lightroom and Photoshop working on client images, I find it hard to feel excited about doing that same work on my own time. I obviously still care about my photos, but I guess turning a passion into a profession creates a strange feeling where you associate the process with an obligation rather than a creative outlet.\n\nDon’t get me wrong, I’m grateful to make money doing something I’m passionate about. But I miss when photography and editing were just mine, with no client expectations or commercial pressure attached.\n\nDo you also struggle to work on your personal stuff? How do you maintain that sense of joy and creative excitement when the process becomes your career?",
    "score": 52,
    "url": "https://reddit.com/r/photography/comments/1l3vhhw/do_you_still_have_time_to_enjoy_photography/",
    "created_at": "2025-06-05T10:10:45.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1jagu4z",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "I’ve secured multiple media passes this year, but how do I actually make money with these opportunities?",
    "text": "I’ve made money as a photographer through weddings, family/senior portraits, product/lifestyle gigs, and especially with automotive photography as that’s where I started my photography career. \n\nRecently, I’ve secured multiple media passes for a bunch of automotive events in my state. I typically use these events for networking and obviously to get some stuff for my portfolio. \n\nI’ve been trying to do some research as to how I can make money from the photos that I take at these events but I’m struggling to find anything else other than trying to sell them as stock photos or possibly licensing them to publications. \n\nAny other ideas? What would you recommend?",
    "score": 50,
    "url": "https://reddit.com/r/photography/comments/1jagu4z/ive_secured_multiple_media_passes_this_year_but/",
    "created_at": "2025-03-13T17:00:42.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1ilqwoc",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "AITAH- volunteer situation",
    "text": "I am an experienced professional photographer, who's put that career on the back burner while I go back to school for a separate career path.\n\nThere is an organization I'm a part of who I've volunteered my services with, mostly in other roles, but at times also as a photographer.\n\nA leader in that organization has asked me to take a photo for a particular graphic they need. I asked them \"Need a certain aspect ratio or anything for what you're putting it on?\"\n\nThe organization's position is that that question was totally out of line, and I shouldn't have even asked.\n\nMy position is that I needed to know whether or not they had specific expectations in mind, and the fact that their responses to that question involved a lot of contradictions, and even moral accusations, suggest that if this were any other client I should have just been \"busy\" that day.\n\nMaybe a dumb question, but am I the asshole here?",
    "score": 44,
    "url": "https://reddit.com/r/photography/comments/1ilqwoc/aitah_volunteer_situation/",
    "created_at": "2025-02-09T22:19:07.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1lijdtu",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "What advice would you give a 17 year old kid who going into his last year of highschool who wants to start a career in photography.",
    "text": "He's a good kid that's been shooting hockey games at the rink I coach in for a few years now. In summer he shoots a lot of baseball and car shows. \n\nI recently helped him get started in analog photography and he's been shooting a lot of landscape stuff on my 4x5 which has really helped him understand how different settings impact the final photo and photography as a process. \n\nI can't say enough good about the guy but he's not academically gifted and wants to try and make a full time job out of photography after highschool instead of going to college. \n\nI've been a photographer for a long, long time but apart from a few stints of real estate photography I've never been paid for my work and very rarely display it or share it. For me personally it's just a hobby so I don't feel I'm qualified to give the kid any advice. \n",
    "score": 41,
    "url": "https://reddit.com/r/photography/comments/1lijdtu/what_advice_would_you_give_a_17_year_old_kid_who/",
    "created_at": "2025-06-23T15:20:51.000Z",
    "num_comments": 129
  },
  {
    "id": "reddit-1lygn53",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Is it fair for me to be charging this much?",
    "text": "Hey! I'm sixteen and just beginning my photography career (I mean I got my camera at Christmas 2024 and don't have any experience other than yearbook club and stuff for my track &amp; tennis team) but my friend asked me to take 8th grade graduation photos for her and another friend. I've done portraits for my sister and done a couple of events (a banquet, a vow renewal) but I haven't really charged anybody anything yet since I don't have a clue what to be charging and I was really just helping out the main photographer who was a family friend for experience. I'm thinking of charging for these grad photos since I need to start making money as I'm going to college soon and I think I want to continue throughout the rest of HS and College. Is it reasonable to be charging high schoolers:\n$35 for a 45 minute session (10-15 photos, edited)\n$65 for a 1 hr 30 min session (15-20 photos, edited)\n$85 for a 2 hr session (20-25 photos edited)\nSince I'm just a beginner? And is it okay for me to not really have a studio and just work out of local hiking trails and arboretums as my shooting location? I live near the Hudson Valley so there's tons of scenic spots for photography. To me it seems like a lot since a lot of my customers probably will have minimum wage jobs or no jobs at all but I see so many people charging 100-500 in my area so I don't really know. \nThanks in advance for the input!\n\nTLDR: is it reasonable to charge high schoolers $35 dollars for a 45 minute session and up to $85 for a 2 hour session with edited photos from a beginner photographer?",
    "score": 40,
    "url": "https://reddit.com/r/photography/comments/1lygn53/is_it_fair_for_me_to_be_charging_this_much/",
    "created_at": "2025-07-13T01:29:20.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1p0a6fo",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "I was in PhotoParis this weekend, my first time.",
    "text": "I was present the four days, early morning and late afternoon. I’m not a professional photographer, but decided to go into art photography a couple of years ago. PhotoParis presents 220 galleries, which represent photographers from around the world. It is considered ‘traditional’, in the sense that many of the images are from classic dead photographers, aimed at an older crowd of collectors. But it is also considered the most important photo fair in the world, given the amount of galleries, the amount of collectors present, and the prices of some images.\n\nFirst thing that impressed me was the size and presented quality of the works. Many are printed analogicaly, and japanese handmade papers seem to be in fashion. The excellence in printing and framing is clear from the start. I teached me that I need to be way more careful in how i present images. Every detail counts. There are many present in the normal fashion, black or white frame, and paspartou. But usually smaller images from famous photographers. Emergent ones need to call for attention, and works need to look and feel expenesive.\n\nAnother idea that jumped to mind is the fact that, although much of the photography from dead or old masters is from street photography, almost all of the new photography is NOT street photography. Either landscapes or portraits, and most of it conceptual. It seems that contemporary art has taken over photography too, and photographers/artist need to research a topic, decide on the 3 or more important ideas (how and why do I look at things, how this topic affects society, whyshould you care about me and this topic, whats the best medium to support my idea, etc.), then decide on the best medium (sock burned using the sun and a loupe made from glass brought from a warzone, or photopaper treated with secret chemicals and left underwater for a week :) ).\n\nIt seems just taking a good photograph, of people ina moment, is not enough for you to make it into the photo/art market. You will need research, a lot of experimentation, and good habilities at networking with galleries. Collectors are the ones paying the big prices, and they follow artist careers, not the odd good photograph. Photographers always felt like the lesser  brothers of artists, so they moved into art, and now they have to play under those rules.\n\nPhotobooks are another big thing during PhotoParis. This traditional way of showing your photography, through a story, in a cheap book, is doing better than ever. Also, lots of collectors chasing the rare items, that was news to me. \n\nOverall, worthwhile a plane ticket there, a once in a lifetime experience for an amateur photographer. It gives you a point of reference, and lots of new ideas for years to come.\n",
    "score": 37,
    "url": "https://reddit.com/r/photography/comments/1p0a6fo/i_was_in_photoparis_this_weekend_my_first_time/",
    "created_at": "2025-11-18T12:05:34.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1n4yame",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Holy Trinity Lenses",
    "text": "Back in SLR-Film days, most professional photographers, specially in Journalism and Wedding fields, used to carry “Holy Trinity Lenses”. \nMaking those three lenses a popular first purchase. \n\nWhen starting your career in photography or beginning your serious advance photography journey, \nDo your recall what was the first professional lens you purchased?\n",
    "score": 33,
    "url": "https://reddit.com/r/photography/comments/1n4yame/holy_trinity_lenses/",
    "created_at": "2025-08-31T15:54:29.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1llof16",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "for people who now have photography as a career, how did you do it?",
    "text": "i’m a sophomore in high school and want to do photography when i get older, preferably as a main job but i realize that is NOT a dependable income/outcome lmao. so, my question is for people who have photography as their main source of income, how did you get to that point? and what are some tips to get there?",
    "score": 33,
    "url": "https://reddit.com/r/photography/comments/1llof16/for_people_who_now_have_photography_as_a_career/",
    "created_at": "2025-06-27T08:09:48.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1iqm818",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "'Dorothea Lange - An American Odyssey'. Short documentary about the journey of her career, that shows the impact photography can have on society at large.",
    "text": "",
    "score": 26,
    "url": "https://reddit.com/r/photography/comments/1iqm818/dorothea_lange_an_american_odyssey_short/",
    "created_at": "2025-02-16T06:34:29.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1khu46t",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "The million dollar question I wish I could ask pros IRL...how long did it take you to make how much $?",
    "text": "My degree is in photography and while I've done portraiture on the side for years, I've only once ever tried to make a living out of it, and I lasted about 6 months before breaking down and taking another office job.\n\nI just had a baby last year and we planned on me staying at home for at least the first year, and we're living off (read: hemorrhaging) our savings without my income. I want to restart my business and work part time two or three days a week on daycare days. In a perfect world, my goal is to have flexible part time work that is satisfying, that would allow me to spend time taking care of my son, and that would bridge the spending gap.\n\nMy plan is to specialize in babies and family, now that I'm really enjoying pics of my own kiddo and I have a great mom network in place, and also pets and branding. I already have the equipment I need to shoot lifestyle on location and I have a home office setup. I'm trying to keep overhead down until I'm more established, so fortunately here in the US we're going into summer season and I can shoot outside, then maybe by winter be able to get studio space. My passion is in having a tangible display rather than only digital images, so I'll be including some kind of print with additional options of albums, custom prints, etc.\n\nI feel like this is my last chance to give my photo career a shot (pun intended) so I'm not so much looking for feasibility but more of a realistic expectation of what earnings might look like so that I can decide what my monetary/timeline cutoff is based on our budget. Knowing how regional the industry is, and that I live in rural Maine with a smaller market, I'd love to ask local photographers how long it took them, working how many days, to earn what amount of money, but it just feels too crass. So instead I'm asking you all... Undersanding that it's a HUGE spectrum dependent on where you live, specialty, and so on.\n\nAre there other family photographers out there who started part time (especially stay at home moms!) willing to share how many hours (roughly) they worked a week and how much they made in their first year and what they're making now? I'm really hoping I can pull this off before money gets too tight and I have to go back to an office job.😬",
    "score": 19,
    "url": "https://reddit.com/r/photography/comments/1khu46t/the_million_dollar_question_i_wish_i_could_ask/",
    "created_at": "2025-05-08T16:16:40.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1jlvcy3",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Is my friend being taken advantage of?",
    "text": "I have a question regarding a friend of mine who works for a very small photography studio. I want to understand if she is being screwed or not. Here is the situation:\n\n    She has been working for her boss and friend for 10 years. They are the only two who do work for the business. They originally started in Vegas doing weddings and she would shoot and edit the videos while the boss would shoot and edit the photos.\n\n   They've switched focus over the years to doing boudoir and my friend is responsible for social media, video editing, calling leads and securing the shoot, and meeting with clients in person. The relationship dynamic is a bit complex because my friend also feels responsible for helping her boss-friend out with her boss's farm. \n\n     A typical day entails waking up early to help with the farm work then spending the rest of the day calling clients and doing social media or editing. My friend never gets vacation and is considered a freelancer so she has to pay taxes every year. She also does not get insurance through her employer.\n\n    She works essentially every day of the week with no days off. Originally she was promised a base salary with 10 percent commission for each sale. Her boss's argument is that because they are not making enough, she no longer gets commission and makes a base salary of 4k a month. Aka no matter how many sales she makes (their highest package is 12k) she will not make extra. The boss argues she cannot afford to pay any more than that and that she is essentially keeping the business open for my friend so this is the best she can do. \n\nIs this an appropriate amount for the work she is doing? How much do video editors usually make? Is it typical to be considered a freelancer after working the same company for an extended period of time? Is it typical for photography studios to fail to provide insurance or other benefits? \n\nI feel like my friend is being taken advantage of but I really don't know enough about this industry to fully understand if her pay is appropriate. Any insight you can provide would help me. Thank you so much! 💓 \n\nAlso I'm sorry if this is the wrong place to post this, if you know of a more appropriate subreddit please let me know and I will post it there. 😊 ",
    "score": 6,
    "url": "https://reddit.com/r/photography/comments/1jlvcy3/is_my_friend_being_taken_advantage_of/",
    "created_at": "2025-03-28T13:42:19.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1jf5e9m",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "retoucher salary",
    "text": "Hi ive been doing photo editing in real estate for 3 years now and i also have a degree in photography, a photographer asked me to do some editing, he said if i would be interested in doing some batch editing for 1$ per photo… what do yall think about that price? ( real estate retouching) ",
    "score": 5,
    "url": "https://reddit.com/r/photography/comments/1jf5e9m/retoucher_salary/",
    "created_at": "2025-03-19T19:26:22.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1lipm0q",
    "subreddit": "photography",
    "soc_codes": [
      "27-4021"
    ],
    "title": "Moving from 1099 Contract to W2 Full-Time Doing Media for a Company — How to Handle Gear?",
    "text": "Hey all,  \n  \nI've been working for a company the last \\~3 months or so doing motorsports photography on-site, as well as social media management (content calendars, copywriting, and so on).  \n  \nThe owner liked my work enough to offer me a full-time salary position with benefits. This is good for me, and I've already accepted.  \n  \nBut one question I have:  \n  \nHow does one handle gear in a situation like this? Thus far, I've been using my own, totally fair and expected for contract work. It's a sizable kit, at least for a one-man band. FX3, A7IV, 70-200 GM1, Zeiss 50mm 1.4, 35mm 1.8, etc etc, plus all the peripherals — wireless DJI lav mics, DJI RS3 gimbal, etc, etc., plus Macbook Pro, iPad Pro, hard drives, and so on.  \n  \nNow that I'm transitioning to a full-time employee, what does this look like? Monthly stipend paid to me for wear and tear of my gear? I can't possibly expect a small business owner (I'm the first employee!) to invest $\\~15k+ to replicate my exact setup, right? Am I effectively now renting my own gear to the business while working? How does this go?  \n  \nThanks so much for any advice, those of you who have been in similar spots.",
    "score": 5,
    "url": "https://reddit.com/r/photography/comments/1lipm0q/moving_from_1099_contract_to_w2_fulltime_doing/",
    "created_at": "2025-06-23T19:16:09.000Z",
    "num_comments": 21
  }
]