[
  {
    "id": "reddit-1hnjfs7",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "This is why people hate insurance companies",
    "text": "Relatively young patient presents with symptoms concerning for cancer and common, non-insidious etiologies of these symptoms already ruled out. Guidelines for the society of my surgical subspecialty detail a clear diagnostic pathway which I follow and this workup is routinely approved without issue for almost all my patients.\n\nHowever, for this patient, their CT was denied, literally without any reason given.\n\nI call the insurance company (major insurer in my state). After 20 minutes of hold, a customer service representative with NO medical training tells me the claim was denied (which I knew), can literally not give me a reason why, and states I do not have the option to do a peer-2-peer (which I was told to call to do) or even have the option to speak with an actual provider, nurse, or anyone with any actual medical degree. \n\nAs it turns out, the insurance company uses another company \"RADMD\" whose apparent only job is to wrongfully deny claims and as such, my only option is to write an appeal letter to \"RADMD\" to see if my patient can then get their scan. I am told an email can be sent to me with instructions on how to submit this appeal. They cannot quote me how long the appeal will take or even tell me how long it will take for the email to be sent to me with instructions on how to do the appeal, as the customer representative cannot herself send it but can only request it be sent to me.\n\nMerry fucking Christmas, health insurers of America.",
    "score": 2681,
    "url": "https://reddit.com/r/physicianassistant/comments/1hnjfs7/this_is_why_people_hate_insurance_companies/",
    "created_at": "2024-12-27T17:04:30.000Z",
    "num_comments": 182
  },
  {
    "id": "reddit-1ivqmr0",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "I regret becoming a PA",
    "text": "I regret becoming a PA. You can attend a highly respected university, excel academically, gain admission to a PA program with a 3-4% acceptance rate, study 70 hours a week for two years, complete a fellowship—and still have less practice authority, fewer job opportunities, and lower pay than an NP who completed their entire education at Chamberlain or Walden.\n\nI also resent the focus on “clinical hours performed” as if that even begins to capture the difference. The acceptance rate alone creates a drastically different labor pool before the educational differences even begin. On top of that, PA programs provide a much more rigorous didactic education—even compared to NPs from Ivy League brick-and-mortar schools.\n\nMany of us chose this profession because we thought we would enjoy it, but the job market doesn’t reflect the value we bring. Instead, it rewards the opposite, which is incredibly disheartening. And nothing seems likely to change.\n\nSad state of affairs. Any thoughts from my fellow PAs?",
    "score": 982,
    "url": "https://reddit.com/r/physicianassistant/comments/1ivqmr0/i_regret_becoming_a_pa/",
    "created_at": "2025-02-22T19:18:42.000Z",
    "num_comments": 755
  },
  {
    "id": "reddit-1ht4hx5",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Please make me feel better about one of the most embarrassing moments of my life in front of a patient",
    "text": "New grad working about 4 months. I wore a button down shirt today. All was well in the morning. My MA mentioned before my first patient that my first button was undone, I fixed it and thought nothing else of it.\n\nTwo patients later I'm in a visit with a young 20 y.o male. I see that he keeps smirking but I had no idea why, maybe he thought my plan was silly. I then do a physical exam on him. Still smirking, weird. I honestly thought he didn't like my plan and thought I was a dumbass. Oh well.\n\nI walk back to my desk and look down. TWO BUTTONS UNDONE. TWO. YOU CAN SEE MY BRA. I AM WEARING A WHITE COAT BUT YOU CAN SEE EVERYTHING. IT WAS LIKE A BURLESQUE SHOW. I have never been so embarrassed in my entire life. I want to crawl in a hole and die. I will NEVER wear a button down shirt again.\n\nPlease tell me you've done something embarrassing so I can feel better. How do I face this patient again?!\n\n  \nEdit: thank you so much to everyone who was kind enough to share their stories. It really did make me feel better! ",
    "score": 787,
    "url": "https://reddit.com/r/physicianassistant/comments/1ht4hx5/please_make_me_feel_better_about_one_of_the_most/",
    "created_at": "2025-01-04T02:47:44.000Z",
    "num_comments": 372
  },
  {
    "id": "reddit-1j6aijz",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "I think I encountered why some physicians hate us",
    "text": "I have a casual position I pick up shifts at. They finally hired someone for a position they had been struggling to fill (undesirable hours) and I’ve worked with the NP who will be taking over 3x now. \n\nI’ll preface this by saying she is a genuinely nice person and I do like her as a person. I think she means well. I also have worked with many NPs who are competent and good at their jobs. \n\nBut “Susie” as we will call her, is not. She went to an online diploma mill for her NP school and although she has 20 years of RN experience, it doesn’t seem to help her much. She doesn’t know just the complete basics of care - everything from how to write a SOAP note (or how to even formulate an assessment and plan) to how to diagnose conditions, prescribe medications, just… anything. She can perform the mechanics of an exam but doesn’t seem to understand/recognize when there are abnormal findings (or when there are normal findings that are not abnormal). Even the questions she asks me make zero sense - instead of “45 yo M presenting with xyz, my ddx is abc, anything you would add?” Or whatever, it is “what should I put as my diagnosis in the computer?” (But she barely gives me any context.. where does she think the diagnosis comes from??) or “what should I write in the A/P?” I mean… your assessment and plan??\n\nI thought maybe it was nervousness at first and things would improve. But it’s been about 2 months and I’m not sure anymore. We had a patient come in interested in birth control and she asked me what she should do. I had to walk her through everything, from what history she should gather to how to decide what product to order. \n\nThe kicker is she will be working SOLO at this clinic once her “training period” is over - which will be over in a few weeks. I just don’t think her practicing solo is safe for these patients! Many of them are uninsured or underinsured to make things worse, so it’s not like she can easily refer everything out (not that that’s a great solution in the first place)\n\nMy mind is just boggled as I genuinely did not know there was an institution of higher education that would give someone an NP degree who has such little knowledge about practicing medicine! I have heard of the “diploma mills” but thought they were exaggerated tbh. \n\nI can see why physicians who work with someone like this might be horrified to work with any PA/NP in the future! \n\nI think at the minimum she needs to work somewhere where other physicians or experienced PAs/NPs are. She does have experience as an NP apparently (not in primary care) but I don’t understand what she was doing previously, as surely it required her to formulate a basic note. \n\nAnyway. Just had to vent. Feeling discouraged to even be a PA or “APP” after this experience. I think these schools should be shut down, they honestly take advantage of people and make everyone look bad. Our supervising physician came by to “visit” and I have never seen him in all my time working there, so I think someone has made him aware of the situation. He privately asked me my thoughts on her and sat in on her visits. He didn’t seem happy, but I can’t blame him. Thank goodness our institution requires supervision - I know there will always be docs who just sign their name and don’t care, but he does seem to genuinely care and in this case it really does matter that he does. \n\nJust.. ick. I hate the direction medicine is going. \n\n\n\n",
    "score": 770,
    "url": "https://reddit.com/r/physicianassistant/comments/1j6aijz/i_think_i_encountered_why_some_physicians_hate_us/",
    "created_at": "2025-03-08T05:48:32.000Z",
    "num_comments": 191
  },
  {
    "id": "reddit-1m0zjfz",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "STUDENT LOANS PAID OFF!",
    "text": "Never thought this day would come. 5 years. Six figures of debt (&gt;180,000). Sweat, tears and sacrifices. First generation! Never thought I could do it. I literally remember sitting during PA school orientation and thinking, I cant pay this off but I did it. Proud moment.\n\n  \nEdit: Wow, I didnt think Id get this many AMAZING and joyous responses. I just want to say thank you to everyone in this community. The  kindness and support from these messages have been overwhelming. I wish the best for those who are pushing through this process as well.",
    "score": 711,
    "url": "https://reddit.com/r/physicianassistant/comments/1m0zjfz/student_loans_paid_off/",
    "created_at": "2025-07-16T01:15:58.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1kcr99l",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Peer to peers are basically my anger management",
    "text": "Does anyone else fucking thrive on getting to do a peer to peer? I feel like peer to peers are my outlet to just let all of my built up anger out on Insurence companies that love to deny my patients care that they need. Sometimes they keep me on hold for an hour, that's fine, I bring my phone with me while I see patients and if they answer while I'm seeing a patient I tell them it's their turn to hold ( I love doing that) \n\nLiterally when I'm told a patient needs a peer to peer I jump on it so quick... I love challenging them as to why they won't give the patient what they need. \nI always get full names and credentials, I want to know what their speciality is. I want to know what their actual hands on experience in my specialty is ( spoiler, most of them have never worked in my specialty) \nThis is my toxic trait maybe, but I get so fucking irritated with insurance companies and this is my way to let out my frustration. ",
    "score": 668,
    "url": "https://reddit.com/r/physicianassistant/comments/1kcr99l/peer_to_peers_are_basically_my_anger_management/",
    "created_at": "2025-05-02T03:18:19.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1i0v7ao",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Cried at work today",
    "text": "This is my first ever post on Reddit. Today, I had a patient who was truly awful and one of the worst encounters I’ve ever had and I just need to feel I’m not alone in these experiences! \n\n(For reference, I’ve been working in a dermatology clinic independently as the sole provider for 3 years now and for a total of 7 years:)\n\nI walk into the room and introduce myself. Immediately I could tell she was going to be awful by the way she sneered and looked me up and down. She told me in a very matter of fact way that she’d had granuloma annulare before, years ago, and it was back. She then proceeded to demand I treat it with “naprosyn” because she read about it online. “Naproxen?” I say. And she leans forward and it the most condescending manner says “No, not naproxen, Narcan. Do you know what Narcan is? “I asked do you mean nalaxone?”  “Yesss naloxone” she says, exasperated like somehow I’m an idiot when she was saying the wrong medication! I let her know very politely I wasn’t aware it could be used to treat this condition but I would certainly research it. She got agitated saying “ OH the research is there.” So I tell her more about the nature of the rash and then she proceeds to insist that it was caused by trauma she had to her lower leg or a vaccine. I just nodded and said the cause of this rash is unknown, and she got more agitated that I wouldn’t agree it was caused by her fall or a vaccine. I just said I’m sorry I can’t speak on what may of caused it in your case, it’s associated with x, y, z, etc. She goes back to asking about systemic drugs for it, I tell her none are approved, I typically treat with topicals and light box, she wasn’t having it. So I said well if you’re insistent on systemic therapy I need to do a biopsy to confirm the diagnosis. \nAfter the biopsy and I go through the follow up timeline etc , she asks “and who does the skin checks here” - “I do mam, you can schedule an appointment on the way out” she said “No, we can do it NOW” and then asked well “then where’s the doctor” I said there is no doctor on site, if you’re uncomfortable with that you’re welcome to pursue care elsewhere (and I WISH I had a dermatologist on site - but in my area this is few and far between) \n\nMy blood was boiling!! I never feel mad like this with patients. I calmly explained no, we had exceeded the allotted time for her visit, this was scheduled for a rash, she needed to reschedule OR if she wanted to wait, I told her I’d see her after I saw the remainder of my patients. She huffed and asking well how long will THAT be? \n\nI just don’t know why I chose a career where I have to put up with this type of behavior from people - to be disrespected and just have to grin and bear it. To be looked down upon because I’m not an M.D. (totally fine with me, I have utmost respect for M.D.s and don’t resent I’m not one or pretend to know everything they do) when they knew I was a PA when they scheduled the appointment ahead of time!! I could’ve pursued a different masters program that wouldn’t have this end result. \n\nIt was so degrading. She was so condescending, rude, mean. I’m over it. \n\nI want out of patient care. \n\nCan anyone else relate? \n#rantover \n\n\n\n",
    "score": 590,
    "url": "https://reddit.com/r/physicianassistant/comments/1i0v7ao/cried_at_work_today/",
    "created_at": "2025-01-14T02:01:49.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1hwafti",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "I’ve hated being a PA",
    "text": "Idk y’all I’ve hated being a PA the last 4 years. I tried different specialties, 8 hour vs 12 hour shifts, surgery, clinic based, hospital based etc. I totally hate it. I hate conventional medicine and how much of a scam it is. Patients constantly sick and in pain and sometimes how little we can do about it I feel like all I do is send in more steroids and pain meds all the time. I hardly ever have the answers for why patients have this pain or that pain and I’m just a robot saying the same things over and over again. I hate talking to patients about the same problems over and over and all I do is send in a steroid or pain meds. It feels like all I do is trained monkey work.\n\nConventional Medicine just seems like such a scam and is completely driven by money. Every job I’ve had they push seeing more patients, longer hours, and they get rid of your ancillary support bc of “budget cuts”. No one ever cares to look for the root cause of symptoms it’s just sending in more medications to mask things. I’m so over it.\n\nI found a 100% remote job outside of medicine that I accepted and I’m happy I’m leaving a field I hate. But at the same time I feel like I wasted 6 years of my life on something I previously had thought I wanted so badly.\n\nDoes anyone feel the same? Or am I just a loser for not knowing myself well enough and hence deciding to go to PA school ",
    "score": 570,
    "url": "https://reddit.com/r/physicianassistant/comments/1hwafti/ive_hated_being_a_pa/",
    "created_at": "2025-01-08T03:35:36.000Z",
    "num_comments": 322
  },
  {
    "id": "reddit-1p30ias",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Limits on loans, PAs no longer considered an”profession”",
    "text": "Has anyone seen this yet? Apparently the Dept of Education no longer considers nurses, PAs or PTs as professional degrees. So they are putting a lower cap on undergraduate GRAD loans and may take away loan forgiveness programs! This will just make negative impacts on healthcare. Trump is just making this country worse everyday .. \n",
    "score": 521,
    "url": "https://reddit.com/r/physicianassistant/comments/1p30ias/limits_on_loans_pas_no_longer_considered/",
    "created_at": "2025-11-21T14:47:30.000Z",
    "num_comments": 97
  },
  {
    "id": "reddit-1kjbv1i",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "\"Do you know what separates us from ER doctors?\"",
    "text": "Forever ago when I was a little PA-S, I had a fairly grueling trauma rotation. For six weeks we did five 12-14 hour shifts, on our feet the whole time (we ate while walking the hallways, without exaggeration), and once a week we spent the night and got no real sleep and did post call the next day (once my resident woke me up after 45 minutes of bliss-filled uncomfortable napping on the sad on call room bed - we went down to the trauma bay and it was an obviously non-surgical, drunk guy who hit his head. \"What'd you wake me up for?\" I asked the young doctor. \"Hey man, someone has to check rectal tone!\").\n\n  \nMy preceptor, a hardened trauma attending, was one bad SOB but man the guy must've got burned by somebody somewhere. After we did our 24 hour shift and rounded for post call he'd take me, another sad PA-S, and a couple residents to the conference room and lecture us on the worst stuff possible, like IL-6 and cytokine release. Man you're a board certified trauma surgeon, do you really need to teach this stuff? The room was always a cozy 72 degrees too while the rest of the hospital was always too hot or freezing cold. And if whoever was post call that day fell asleep while he lectured, he'd make an example out of them.\n\nWell all along as a PA-S and on my emergency medicine rotation, the ER docs always had this little spiel where they said, \"You know what separates us from ALL the other doctors?\" *You have no circadian rhythm either, I thought?* \"Other doctors think 'what's the most likely diagnosis.' We think 'what's most likely to kill my patient?'\" You hear this over and over as a PA-S. It's like the most clever thing an ER guy ever said or something. But when they ask for the fifth time you just say \"no, what?\" because they love to tell you the answer.\n\nSo there I was, eyes barely open, drool in corner of the mouth, waiting for this lecture to end after my turn at post call rounds so I could drive back home and hope I fell asleep at the wheel so a semitruck would put me out of my misery. When my preceptor, the trauma attending, asked,\n\n\"Do you know what separates us from ER doctors?\"\n\nOh God, I thought. This is it. The pinnacle of bad-assery in medicine. Because I already knew how ER docs thought, and now I was dying to know how trauma docs thought. My last four brain cells rallied to keep one eyelid open as I waited in eager anticipation to hear.\n\n\"ER doctors think 'what's the most likely diagnosis.' We think 'what's most likely to kill my patient?'\"\n\nI closed my eyes and put my head down on that cold, hard conference room table. Let him yell at me. This bastard can't hurt me anymore than he already has. I'm already cooked.",
    "score": 510,
    "url": "https://reddit.com/r/physicianassistant/comments/1kjbv1i/do_you_know_what_separates_us_from_er_doctors/",
    "created_at": "2025-05-10T14:41:52.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1onkrl5",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "my PCP, who’s also a PA, who also graduated the same year as me, asking me what I do for work",
    "text": "like why is it so embarrassing to admit?? because suddenly i feel like they’re self-conscious and now I’M self-conscious that i made them self-conscious 🫠 at appts i always try to act as clueless as possible so i don’t seem like i work in healthcare",
    "score": 485,
    "url": "https://reddit.com/r/physicianassistant/comments/1onkrl5/my_pcp_whos_also_a_pa_who_also_graduated_the_same/",
    "created_at": "2025-11-03T19:05:59.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1mab1gm",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "NPs are harming the PA outlook",
    "text": "I can’t even find a side hustle for a PA that’s telehealth. In MY speciality that Ive been working on for the past 3 years. They all only want NPs. I reached out to a few recruiters on social media and all said they don’t hire PAs due to the physician sign off. \n\nI’m not super into PAs getting full practice authority without physician sign off but in order for us to stay relevant, we need it. \n\nThe NPs are taking over. Every nurse I know now is in NP school. And with their poor education and so so many schools online and popping up everywhere, it’s not looking good. \n\nThis is not good for APPs.\n\nI’m worried for our salary and outlook.\n",
    "score": 485,
    "url": "https://reddit.com/r/physicianassistant/comments/1mab1gm/nps_are_harming_the_pa_outlook/",
    "created_at": "2025-07-27T02:26:29.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1l6q9ss",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Isn’t independent practice a bad thing?",
    "text": "My state recently passed a bill that allows mid levels to practice without supervision after a certain number of hours. It seems like the majority of posts from PAs I’ve seen have been very positive about these kinds of changes. Am I missing the big picture or something? The thought of a PA working alone sounds crazy to me. Our education is rigorous but it is nothing compared to med school and residency. I would imagine that this will only strain our relationship with doctors and could be harmful to patients in the long run. Aren’t we called physician assistants for a reason? Am I the only one who is worried about this? Or am I looking at it wrong? ",
    "score": 444,
    "url": "https://reddit.com/r/physicianassistant/comments/1l6q9ss/isnt_independent_practice_a_bad_thing/",
    "created_at": "2025-06-08T23:38:36.000Z",
    "num_comments": 145
  },
  {
    "id": "reddit-1kcf1ar",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Tbh… we need to stop precepting NP students, hear me out…",
    "text": "This is not just a one time thing, but I’ve actually seen it on NP program curriculums, websites, NP forum here on reddit, and other various online sources that many NP programs only allow preceptors to be “NP or physician” it may initially seem insignificant (which in the grand scheme it is), but it really shows you NP programs and AANP’s true colors. They genuinely believe they’re above PAs to the point that some/many programs don’t let their students be precepted by PAs. It’s honestly hilarious and so delusional. If they believe NP = physician so much we PAs should honestly all stop precepting NP students overall. They already have a hard time getting preceptors. I just am never surprised anymore by the audacity of NPs. Truly tho, the one thing nurses know how to do is talk up about how amazing they are and better than everyone else. Their self confidence is literally out of this world. \n\nThis is not an attack on NPs at the individual level but moreso how the NP profession tries to poise itself as God’s gift to patients. \n\nHere is an example of a very misinformed and indoctrinated NP in the comments. \n\nhttps://www.reddit.com/r/physicianassistant/s/S2AXHpztPF\n\nShe says NPs are “more specialized”, “more qualifed”, since “most NPs have a DNP” (which ~14% is not most NPs) and due to nursing lobby really fighting for FPA makes “NPs better to precept PAs”. I’m telling y’all THESE are the kinds of NPs the online NP diploma mills are producing. These NPs then go online to social media where they spew this baseless and incorrect rhetoric to everyone who then believes it because they’re a “nurse”. \n\nShe also said PAs are “med school flunkies” and NPs are better because they went into “advanced nursing”. She MUST be trolling. \n\nThis NEEDS to be a wake up call for PAs. I’m sure there are great NPs out there, but the batches they are churning out now are just awful and have an unfounded superiority complex. We need to be more visible and vocal even though many of you don’t want to be. We need to be better PA advocates. ",
    "score": 437,
    "url": "https://reddit.com/r/physicianassistant/comments/1kcf1ar/tbh_we_need_to_stop_precepting_np_students_hear/",
    "created_at": "2025-05-01T17:51:54.000Z",
    "num_comments": 190
  },
  {
    "id": "reddit-1lybvon",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "I’m ready for the hate, bring it on",
    "text": "I’ve gone back and forth on the issue of independent practice rights for PAs over the years, but I’ve come to fully support it, and here’s why.\n\nFor the past decade, “supervision” has been mostly symbolic. In most of my jobs, it has meant a physician signs a form when I get hired, and that’s the end of their involvement. I’m the one seeing patients, making clinical decisions, prescribing, ordering tests, and managing follow ups. If I need help, I consult, just like any competent provider would. But the idea that I legally need a supervising physician when they’re not actively involved in my decisions just doesn’t reflect reality.\n\nAdministrators have had far more influence over my clinical decisions than any of the physicians listed as my supervisor. I’ve worked in urgent care, primary care, and rural medicine, and in all of those settings I’ve been expected to carry my own load and manage my own patients. I am responsible for outcomes, and I carry malpractice insurance at the same level as the physicians I work with.\n\nWhat’s frustrating is that if I ever wanted to open my own practice, I would have to pay a physician I may not even know to be listed as my “supervisor.” That arrangement doesn’t benefit patient care. It’s just a regulatory hurdle that restricts PAs from growing professionally.\n\nI totally get that not all fields are the same. In most specialties or high acuity settings, supervision and structured oversight are appropriate. But in general practice, I’ve already been functioning independently for years.\n\nNurse practitioners in many states already have full practice authority, and that is never going to be undone. There’s no reason experienced PAs shouldn’t have the same opportunity. Independent practice does not mean working in a silo. It means practicing with autonomy while still collaborating when needed, just like every other clinician.\n\nIt’s time to recognize what’s already happening in the real world.\n\nAnd to the bitter, underpaid residents on Noctor who love to hate on PAs and NPs: I get it. You’re exhausted, buried in debt, and watching someone make more than you while working fewer hours feels infuriating. But there is a light at the end of the tunnel for you. Once you’re done, you’ll have the autonomy, the income, and the recognition that you’ve worked so hard for.\n\nAs for me, I didn’t have the luxury of going straight through undergrad and into med school. I grew up poor. I was in my 30s retaking science classes while working full-time just to get into PA school. Med school wasn’t an option for me, financially or logistically. I chose the path that was possible, and I’ve built a career I’m proud of.\n\nSo no, I’m not trying to be a doctor. I’m a PA. And like many others in this profession, I’m just asking for the right to practice at the level I’ve already been working at for years, with honesty, accountability, and independence.\n",
    "score": 425,
    "url": "https://reddit.com/r/physicianassistant/comments/1lybvon/im_ready_for_the_hate_bring_it_on/",
    "created_at": "2025-07-12T21:39:48.000Z",
    "num_comments": 322
  },
  {
    "id": "reddit-1jmtxty",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Some quick tips if you want to maximize income as a PA",
    "text": "I've worked in several specialties as a PA for over a decade. This is just a quick pointer for newer PAs given some of the \"compare job offer posts\" we've been getting lately, to help some of you guys steer away from these bogus 100-110 offers we are seeing lately. \n\n#####\n\nONE: Do your research. So, there is a huge variability in PA pay between cities, states, and specialties. While some cities are quite obviously over saturated (you can spot them because they're HCOL and the only job postings are family medicine and urgent care) and some places obviously will pay a lot (super rural, or inner city hospitals in states that aren't considered popular to live in), there is often LITTLE predictability in this. So do your research! Look up salary reports both APAA and whatever Google spits out. No it's not reliable but it's a starting point. Then look for recruiters in your job market, make an email account specific for this and don't give out your cell. Recruiters will often tell you salary ranges before you interview, so this is another way to learn the market. Ask other PAs you know in private some will share numbers. Finally, you can interview at spots and turn them down if you literally have no other way to get market insight. \n\n\n#####\n\nTWO: Apply broadly. If you aren't limited by geography, apply in cities that interest you. Look at cost of living, school districts, things to do. If you're willing to move, sky is the limit on salary. Even if not, apply broadly locally. Some major hospitals only post jobs on their career page but otherwise use indeed, Google jobs, doc cafe, zip recruiter as some places don't post universally. If you have connections use them cuz some positions don't get posted at all. Big hospitals have their own recruiters. Ask them what positions pay the best, if any are in critical need of a PA they often pay above market value for those positions. \n\n#####\n\nI've done multiple specialties and my advice is find the right schedule, pay, and group of people to work with and you can be happy. Don't pigeon hole yourself into one specialty. Every specialty has its pros and cons and anywhere you will learn stuff that transfers universally. Plus getting 1-2 subspecialties on your CV will make you a lot more attractive to employers. \n\n#####\n\nTHREE: go on multiple interviews. Grill potential employers on non financial details of the job like what's a typical day, how often are you out late, how many patients a day, do you get your own MA if it's clinic, how many PAs have they hired and what's the retention on them, etc. If you're forgetful write the info down once you get to your car. But DON'T talk money on an interview. If they ask what your last job paid just say you'd have to check to be sure etc. \n\n#####\n\nFOUR: try to get at least 3-4 offers. Ask every. single. one. if they negotiate. Most will. Make a document comparing all jobs. Convert PTO into a dollar amount. Write down major pros and cons of each job and rank them how bad you want them if money wasn't an issue. Write down red flags and commute time as well. \n\n#####\n\nIf they do negotiate, go to your highest offer, write that dollar amount down. Let's say 160K. Go back to the other employers and say \"I really want to take this job however I had another employer offer a more competitive financial package.\" They're gonna ask what it was. Add 10K or whatever to your best offer so let's say 170K and see what they counter with. \n\n#####\n\nIf they match it, you can maybe go even higher. Tell them you took that to the first employee (the one who offered you 160, which you claimed was 170), and now they offered you 180. See what happens. Keep pitting your offers against each other til they say no more. Then go back to your document and update the salary for everyone. \n\n#####\n\nFIVE: finally after all this, do not make your decision based on money alone. Go back to how you ranked the offers based on if they all paid equal. The best job may be in the middle, say number 2 for pay and 2 for what you want. Or maybe not. But at least this way you've got the best financial offers you can. \n\n#####\n\nSIX: don't take the literal first offer you get. A lot of employers take a month just to review your CV so have a little patience if no one is biting early on. If you're desperate for cash you can always do urgent care since they don't care (usually) about retention anyway. I say this maybe half jokingly. But regardless, if you do take one of these 110K jobs, every six months or so re evaluate the market. \n\n#####\n\nGood luck out there. Remember it is very difficult to become a PA. We offer a significant service unparalleled by most other professions in skill besides doctors and of course. We accept a lot of emotional baggage at work and huge liability. Don't sell yourself short and don't let yourself get taken advantage of. It's ok to take a low paying job if you want but at least make an effort not to unless you're already financially set because that extra money is going somewhere and it isn't patient pockets. ",
    "score": 393,
    "url": "https://reddit.com/r/physicianassistant/comments/1jmtxty/some_quick_tips_if_you_want_to_maximize_income_as/",
    "created_at": "2025-03-29T19:19:49.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1ikz637",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Lululemon leaves PA-s out of healthcare worker discount!",
    "text": "Hey everyone, I wanted to bring this to your attention—Lululemon has updated its discount program to include only nurses and doctors under their first responder program, leaving PAs out. Despite our critical role in patient care, we’ve been excluded from this benefit.\n\nThis change overlooks the essential role PAs play in patient care, and it’s disappointing to see our profession left out. If you feel the same way, I encourage you to reach out to Lululemon and share your feedback. Let’s remind them that PAs are a vital part of the healthcare system!\n\nYou can contact them at:\n📧 Email: GEC-MFR@lululemon.com\n📞 Phone: 1-877-263-9300\n\nThe more they hear from us, the better chance we have of being included again!",
    "score": 388,
    "url": "https://reddit.com/r/physicianassistant/comments/1ikz637/lululemon_leaves_pas_out_of_healthcare_worker/",
    "created_at": "2025-02-08T22:12:39.000Z",
    "num_comments": 133
  },
  {
    "id": "reddit-1j599yo",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "How to be an amazing standout new grad APP in your first job…",
    "text": "1. There is a hierarchy in medicine but you don’t need to espouse it. The nurses, MAs, clerical staff, MDs, etc are all part of the same team. Make sure that you show that you value them and treat with equal respect.\n\n2. Be a sponge for knowledge. The first few years of our first job is “our residency”. I always tell students who are applying to jobs that the most important questions are:\n     A. Who will be responsible for training me and how long will my onboarding last?\n     B. What feedback will I be receiving along the way to know that I am on track to being a full member of the team?\nThe best first position to accept is not the one that pays you the most and is not necessarily in your favorite specialty. It is where your training will continue best.\n\n3. There is no downtime at work. If you have a free moment then read on UpToDate about conditions your patients have.\n\n4. Find a mentor if you are not assigned one. That person should have high expectations for themself and others, lots of experience, and a passion for their job.\n\n5. When you refer a patient to a consultant, make the phone call and ask questions about the work up that will ensure. Learning from consultants is better than any book.\n\n6. In the hospital setting, go to procedures with your patients. Have a radiologist read your CT or plain film. Have a cardiologist review an echo with you.\n\n7. RNs are the frontline of healthcare. Healthcare does not exist without them. They are as much your teachers as are your colleague APPs and supervising physicians.\n\n8. It is always ok to say “I don’t know but I will go find the answer to your question.” No one came out of the womb knowing medicine. It is not weakness to ask for help. It is a strength.\n\n9. I got baited by a malignant MD on this sub Reddit. Don’t be baited by anyone who is malignant. Spending time with patients and listening is not about making them feel warm and fuzzy. It is about empowering them and making them feel heard. Our patients too are our teachers. 17 years in I am still learning from them.",
    "score": 380,
    "url": "https://reddit.com/r/physicianassistant/comments/1j599yo/how_to_be_an_amazing_standout_new_grad_app_in/",
    "created_at": "2025-03-06T23:22:17.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1kl9vf0",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "AAPA salary report is a leash keeping PAs humble since... forever?",
    "text": "The PA Salary Report is that ex you still text even though he wrecked your car, stole your dog, and somehow still has the nerve to send you a \"you up?\" at 11:47 PM.\n\nI’ve been a PA for 3 years and at this point, I’m convinced AAPA report is ruining our lives. \n\nHear me out....its ruining us not in some abstract way. It's screwing us in real life, In our bank accounts, tax bracket where you remain to be making just enough to get no help but not enough to ever afford more help.\n\nMy first job paid 125K. I was fresh out of school. It felt good. wRVU bonus sprinkled on top...I thought I was on my way to greatness. Year two rolls around... still 125K. Bonus? Vanished! Ghosted! When I asked, they blinked like I’d just told them I wanted to start doing surgeries...“You’re already in the upper tier of PA salaries” they told me.\n\nUpper tier? Bruh, I drive a car that needs prayer, patience, and a floor tap to turn on AC when I need it...which is every single day in Texas!\n\nShockingly (not really) every single clinic I’ve interviewed at since says the exact same thing! The moment I mention I want “135K base and a quarterly bonus,” you can see them glitching! Their pupils blow up like they just spotted a chart with no vitals... PA Salary Report has opened in their head like a mental CT scan..w and w/o oral contrast! They smirk at my audacity before they start putting me back in my place\n\nI can hear their inner monologue:  \n“LOL at your AUDACITY, you peasant!!! HOW DARE YOU! You… little stethoscope-wielding gremlin. You thought your value goes up with experience, just 3 yr of experience? Have you not seen those before you, the ones with 5+ years of experience sitting gratefully at 125k...YOU Fool. You are not here to grow. You are here to pre-chart, over-chart, re-chart and keep charting to cross that milli, turn it into a billi, do more refill fluconazole, and die quietly at your desk…and while dying, make sure you remind yourself how lucky you are to be making 3 figures right out of PA school! You’re not the captain of the ship. You are the The Groom of the Stool... The one who empties the urine bucket wipes captain/king after he takes a dump..you are important to a degree just like THE GROOM OF THE STOOL is/was (https://en.wikipedia.org/wiki/Groom\\_of\\_the\\_Stool)\n\nThe AAPA report was supposed to help us. Instead, it gave every clinic owner and admin a number to weaponize. It’s not a benchmark anymore. It’s a trap. You hit that number, and suddenly asking for a raise feels like demanding Jeff Bezos’ yacht.\n\nAnd you know who isn’t living like this?  \nDerm PAs. The chosen ones. They escaped. They have their own subreddit now. They’re getting paid for productivity, procedures, lasers, fillers, botox, maybe even inner peace because of financial security. Good for them. They figured it out.\n\nOver here, someone with eight years of experience is clapping for 140K like they just got a full ride to Harvard. That’s not okay. If you're ten years in, doing specialty work, managing patients, and still showing up with clean scrubs and semi-functioning eye contact, you should be making more than a derm shave biopsy every 10 minutes.\n\nAs a new grad, I wanted to “do real medicine” but then real bills happened. Now I’m not poor enough for food stamps and not rich enough to buy a new HONDA Civic without another loan. I hate loans…I don’t want more loans… right now I'm just stuck in the middle, watching my student loans age like fine wine.\n\nFew months back when I was low key job hunting, didn't put my resignation yet- I met a PA who had slithered his way to become a manager. He offered me a position: 15 solo night shifts a month (how generous), 12hr each, No PTO, MD available \"by phone.\"...Pay? 140K and that already included night differential.  After this amazing offer, with dead eyes of someone whose soul left during managerial training, he says,  \n“We’re hoping you’ll pick up extra night shifts and you will remain nights for at-least 1 year”\n\nSir… you are not a manager.  \nYou are a marrow suppression event.\n\nAnd of course he closed with the sacred line every trash offer comes with:  \n“That’s not the usual salary for someone with two years out”\n\nNo. Just no.\n\nBurn that line. Burn the report. Burn the spreadsheet.  \nIf AAPA doesn’t lock that report or burn it and then flush it down the toilet, we’re all gonna be trapped in hellish time loop where every day is Monday, the coffee machine is broken, and the pt wants abx “just in case.” for his viral infx\n\n**P.S.** I know some pre-PAs and PA students are lurking here as I once did, scrolling reddit posts thinking,  \n“OMG what is wrong with this PA… she is soooo ungrateful. 125K?? That’s AHHMAZING! I’d cry tears of joy for that.”\n\nAnd I get it. I really do. I was you. But here’s what u don’t know…\n\nWhen that 125K doesn’t move after 3 years. When you’ve maxed out your learning curve in your field… When your schedule is full, the collection reports keep climbing to milli, and instead of a raise or even a gift card, they hire two more NPs to triple the clinic income while you just... keep swimming?\n\nYou realize something dark, u have officially maxed out, not because you’re not growing, but because the AAPA salary Report told them so.\n\nAnd when financial stagnation hits...It’s a whole new flavor of existential dread because your raise this year was emotional resilience.\n\nIf I were 60yr old, maybe I’d shrug it off. Retirement’s around the corner. But I’m not. I still have to buy a house, pay off loans, maybe own a car that doesn’t start with prayer ;) …\n\nAnyway, to the students, yes 125K is amazing on year 0  \nUntil it isn’t \n\nGood luck out there",
    "score": 378,
    "url": "https://reddit.com/r/physicianassistant/comments/1kl9vf0/aapa_salary_report_is_a_leash_keeping_pas_humble/",
    "created_at": "2025-05-13T01:33:22.000Z",
    "num_comments": 162
  },
  {
    "id": "reddit-1kzmdij",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "10 career alternatives for PAs",
    "text": "Sitting here finishing up my 12 hour shift in UC contemplating life. \n\nCurrently looking for openings in any of the following fields/careers: \n\n1) Penguin Trainer \n2) Gourmet Greek Yogurt maker \n3) Bee Keeper (preferably not killer bees) \n4) Chuckie Cheese Mascot Rat \n5) Oriental Rug Trader \n6) Hot Dog Vendor\n7) Unsolved Mysteries Solver\n8) Cartoonist \n9) Stand-Up Comedian \n10) Mars Mission Volunteer \n\n\n\n",
    "score": 365,
    "url": "https://reddit.com/r/physicianassistant/comments/1kzmdij/10_career_alternatives_for_pas/",
    "created_at": "2025-05-31T02:31:17.000Z",
    "num_comments": 113
  },
  {
    "id": "reddit-1i0gqzz",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Left job on 1st day",
    "text": "So for some context, I’ve been a PA for 3 years in primary care and urgent care. Accepted a new urgent care job and the training details for the job were scarce even though I kept asking what they were. Today was my first day and it was a complete disaster. The practice owner (no medical experience whatsoever) basically gave me the EMR login and said there you go. 10 patients in the waiting room, solo provider, no EMR training whatsoever, no tour of the clinic. I saw a few patients on my own and staff helped me navigate EMR, but then the owner left me on my own. I proceeded to immediately leave and resign immediately. \nI know I should’ve listened to my gut but I needed a schedule change and urgent care was the only place that fit that need. ",
    "score": 348,
    "url": "https://reddit.com/r/physicianassistant/comments/1i0gqzz/left_job_on_1st_day/",
    "created_at": "2025-01-13T15:40:55.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1ia7li7",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "After working 10 years in FM, applying to every derm clinic in my area without a single interview for years- I got the job!",
    "text": "I posted here a while back asking how to break into derm. I have been applying for 10 years- and I started to think it just wasn’t meant for me. One of you told me it can take months or years - encouraged me to keep trying. \n\nI made another list of clinics and was driving to drop off my resume, took a wrong turn and found a derm clinic not on my list and applied. 6 months later they contacted me for an interview. Day after the interview- they called me and offered me the job. 30% of collections after 3 months training. NP shared what she cleared last year. That’s more than 290% higher than my starting salary in family medicine 10 years ago. I adore the Dr and NP. I adore the staff and patients. There’s a school for my kids a block away. There are tons of other moms in the clinic. I can work less, make more, do what I truly enjoy, and support my family.\n\nThank you! ",
    "score": 327,
    "url": "https://reddit.com/r/physicianassistant/comments/1ia7li7/after_working_10_years_in_fm_applying_to_every/",
    "created_at": "2025-01-26T06:16:24.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1ksfbf1",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Question to all the Physicians/NPs/PAs: Why can't we all just get the f&amp;%k along?",
    "text": "Y'all, I am a PA student bout to start clinicals and I'll be honest, all this discourse of \"Physicians are just mad cause debt lol\" or \"NPs are all diploma mill grads lol\" followed by an invasion from noctor has me feeling like I'm about to enter a warzone. In my 6-7 years of working in healthcare I have never once, in my entire life, seen a PA/Physician/NP NOT get along with each other, but for some reason, on Reddit it just feels like the total opposite. I don't understand why one fucking profession feels the need to come in and start bashing another when we are literally ON THE SAME FUCKING TEAM! Imagine any other field with this kind of animosity?\n\nI swear I am so tired of opening the PA subreddit to try to see how salaries are, read funny patient stories, etc., only to come across a thread about how a terrible horrible no good very bad resident bashing a poor, helpless PA student or reading a comment about how PAs are little baby boys who can't handle residency. Like we all chose our careers for our own reason, but most importantly, we chose our careers cause we WANT TO WORK IN HEALTHCARE/MEDICINE/WHAT HAVE YOU! Like, we are all trying to work to make a patient feel better. I don't get why there has to be so much internet hatred, especially when we all know DAMN well we wouldn't say half that shit in real life. I get it, it's the intertet, but isn't this line of work supposed to inherently attract empathetic people? Can we just try to lift each other up? We're all fucked up from admin, we're all fucked up from insurance companies, we're all fucked up from that one annoying patient demanding the Z-Pack for the common cold and threatening to sue us for malpractice. Like we are all experiencing the same kinds of stress out here when we get to working.\n\nThat's it. Rant over. Thanks or something.",
    "score": 317,
    "url": "https://reddit.com/r/physicianassistant/comments/1ksfbf1/question_to_all_the_physiciansnpspas_why_cant_we/",
    "created_at": "2025-05-22T01:57:33.000Z",
    "num_comments": 171
  },
  {
    "id": "reddit-1jjrqqb",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "I realized today that we just work a customer service job.",
    "text": "In clinic today seeing patients, I realized how much what we do is literally just customer service. For good reason of course, but still like being nice, answering questions, helping, and depending on the specialty suggesting treatments, medications, etc. Hoping to get good reviews online, patients to come back to you, etc. Just our product is medicine. ",
    "score": 314,
    "url": "https://reddit.com/r/physicianassistant/comments/1jjrqqb/i_realized_today_that_we_just_work_a_customer/",
    "created_at": "2025-03-25T19:20:39.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1kxuy18",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Does anyone else feel like PA “influencers” are harming our reputation?",
    "text": "I’ve seen many Instagram/Tiktok reels of PA influencers who are trying to flex their titles. Some of them will even brag and compare themselves to doctors. Some will brag about how the education is shorter or that they didn’t get into medical school debt. Instead of giving useful lifestyle or medical advice, it’s just videos of them begging for attention. I find it extremely cringy and feel like it is making our profession look bad. I know social media is the thing nowadays but I feel like there are better ways to advocate for our profession. What are your thoughts? \n\nAlso, that recent “airball” trend is so stupid lol. ",
    "score": 311,
    "url": "https://reddit.com/r/physicianassistant/comments/1kxuy18/does_anyone_else_feel_like_pa_influencers_are/",
    "created_at": "2025-05-28T22:45:39.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1hq11oa",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Is it pretty normal to dread going into work everyday?",
    "text": "I've been a PA for several years now - worked three diff jobs in diff specialties.\n\nMy current specialty is very low stress however I still dread going into work everyday and talking to patients. I always feel like calling out lol. Once the day gets going, I feel fine and don't mind at all.\n\nAll my friends say they all feel the same no matter what type of specialty they are in. Is this just the norm for working in healthcare?",
    "score": 310,
    "url": "https://reddit.com/r/physicianassistant/comments/1hq11oa/is_it_pretty_normal_to_dread_going_into_work/",
    "created_at": "2024-12-30T23:42:38.000Z",
    "num_comments": 98
  },
  {
    "id": "reddit-1nr8rqd",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Calling all PAs! Its time for the betterment of our profession",
    "text": "  \nI’m reaching out because I’ve been struggling with something that I think many of us might relate to: our pay compared to the responsibility and investment it takes to become a PA.\n\nI work in critical care medicine in NYC and have been practicing for the last year. Recently, I found out that my sister, an RN who graduated just 6 months ago, is taking home the same paycheck that I do. We both make about $3,800 every two weeks after tax—with no overtime for either of us. The difference? I went through graduate school, invested nearly $200K in my education, and carry a very different scope of responsibility. She completed an accelerated nursing program for a fraction of the cost.\n\nOn top of that:\n\n* She earns **1.5x overtime** pay for extra shifts, while I only get a flat \\~$20/hr increase for PRN shifts.\n* She gets a **pension**, while I do not.\n* She has scheduled breaks, while I rarely do.\n* And she works in a suburban area with much lower cost of living, while my NYC rent is almost double hers.\n\nMeanwhile, I see RNs in my own hospital with these same benefits and protections. To be clear—I’m not upset at nurses; they’ve done an incredible job advocating for themselves in NYC, LA, SF, and other metro areas to secure fair, often excellent, compensation. My question is: **how can we as PAs do the same?**\n\nI want to learn from experienced PAs:\n\n* What steps can we take collectively to **elevate our profession** and negotiate for better compensation and benefits?\n* On a personal level, what moves have you made to grow **financially as a PA**—whether through job changes, side work, investing, or even shifting specialties—that made the career more worthwhile for you?\n* Are there organizations or advocacy efforts we should be rallying behind to make sure PAs don’t get left behind in the larger healthcare pay landscape?\n\nI love the work I do, but I need to see a clearer path to financial growth and professional respect. Any guidance or wisdom is appreciated.",
    "score": 304,
    "url": "https://reddit.com/r/physicianassistant/comments/1nr8rqd/calling_all_pas_its_time_for_the_betterment_of/",
    "created_at": "2025-09-26T18:18:44.000Z",
    "num_comments": 121
  },
  {
    "id": "reddit-1jhl3ht",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "NYC RNs are making almost as much as PAs.",
    "text": "I recently came across a post that showed all major NYC hospital systems and the starting new grad RN salaries. Most are around 117-120k, which is very comparable to new grad PAs, where I see most commonly start around 130k in NY. I have the utmost respect for RNs and the work they do, but I can’t help but feel a bit disrespected as a PA. Considering the education and the liability we take on. I imagine this is all because of the strong union and high demand. Whats next for PAs? Whats the answer?",
    "score": 303,
    "url": "https://reddit.com/r/physicianassistant/comments/1jhl3ht/nyc_rns_are_making_almost_as_much_as_pas/",
    "created_at": "2025-03-22T22:59:21.000Z",
    "num_comments": 335
  },
  {
    "id": "reddit-1nej2r1",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "20+1 Tips: The Unofficial Survival Guide for New Grad PAs",
    "text": "We all know about onboarding &amp; CME… but I’ve come up with a list of real-life hacks, shortcuts and tips that make the chaos of your rookie year more survivable. Like an unofficial cheat sheet.\n\nThis is mostly tailored for acute, inpatient settings (ER, ICU, etc) but honestly everybody can use a few of these.\n\nHere goes: \n\n1. Find your pooping bathroom on Day 1. Not the one on the unit that everyone uses. The one wayyy down the hall in the corner that barely gets any sunlight. It might even be on a different floor. This is more important than your login credentials. \n2. Learn all the nurses’ names ASAP. The good ones will save your ass. The great ones will quietly warn you before you step in shit. \n3. Say hello/good morning/good afternoon to everyone, from custodial staff to other providers. It forces people to look at your face when they otherwise wouldn’t have. Being a familiar face will save you one day … and it’s just good manners.\n4. Especially ER or anything procedure- heavy. Keep one set of backup scrubs in your car. There WILL be blood, vomit, poop, or something unidentifiable and the hospital issued scrubs fit horribly. \n5. Figure out the food situation early on. What is the shortest route to the cafeteria? Where’s the microwave/fridge? Which nurse/provider always has a snack? When do reps bring lunch? This is survival intel.\n6. Learn which attending will actually teach you and which will roast you. Seek the teachers out. They’re worth gold.\n7. Save dot phrases early. If you write something more than twice, turn it into a template or dot phrase. Your future self will thank you.\n8. Identify the gossip triangle and avoid it. Every workplace has one. Stay out of it or you’ll be the topic by Friday.\n9. Similar to the above tip, limit the amount of personal info you share at work. Chat casually, but your coworkers don’t need your entire life story. (Pro tip: being young, childless, or unmarried may make you the “go-to” for short-staffed coverage… reveal details with caution)\n10. Wear layers. Hospitals are hot and cold zones. Sweaters and undershirts are your friends.\n11. Learn what you can delegate early. You’re not a martyr, you’re a provider. Use techs, nurses, RTs. It keeps patients safer. \n12. Similarly, remember you’re NOT too good for anything. You’re not too good to ask for (and OFFER!) help. Don’t let the hierarchy get to your head. At the end of the day, we’re all here to help patients. \n13. Create your own cheat sheet. Common meds with dosages, top 5-10 complaints with management, treatment algorithms, short list of most important phone numbers. I have a one page Word Doc saved to my email that I pull up before even logging into the EMR for the day. You won’t need it after a while but it certainly helps early on.\n14. A really good backpack/work bag, travel mug, and set of pens are worth their weight in gold. \n15. Learn who actually runs the place. Hint: probably not the doctor. Sometimes it’s the charge nurse. It’s usually the unit clerk or front desk lady. \n16. Get comfortable saying “I don’t know.” Faking it gets people hurt.\n17. Know your escape route. Find your spot to cry, to vent, to breathe for 5 minutes. Map it out before you need it. \n18. Pick your battles. You don’t have to fix every broken process on Day 1… as much as we all want to. \n19. Find your “phone-a-friend.” It may be a doctor, it might be another PA. It might be your friend in a totally different state that has experience in the specialty. Have someone you can text about a weird lab value or a scary case without feeling dumb.\n20. Have a post-shift ritual. Especially if you work long blocks in a row (looking at you 7on/off-ers &amp; 12 hour shifters) Find your small thing that signals to your brain that work is over. For me, I listen to the same song on the way home. I’m almost conditioned now. I get SOOOO relaxed when I hear it in the wild. \n\n\nAnd perhaps the most important one… Celebrate regularly. Treat yourself. You’re learning fast &amp; deserve to celebrate. I keep a “mini-win” list for when I get discouraged. \n\n\nYour first year will be chaos, but it’s where you grow the most. Stay humble, stay teachable, and when in doubt: snacks, nurses, and bathrooms are the holy trinity.”",
    "score": 292,
    "url": "https://reddit.com/r/physicianassistant/comments/1nej2r1/201_tips_the_unofficial_survival_guide_for_new/",
    "created_at": "2025-09-11T20:05:58.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1i1il3x",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "I have a mostly administrative position and for the first time in my career, I don’t dread going to work",
    "text": "PA for almost 5 years.  Worked family medicine and urgent care.  I was lucky enough to meet a really great doctor that hired me to help out in his clinic from a mostly administrative standpoint.  I don’t even see patients every week, and when I do, it’s only a couple.  Just wanted to share my success story, sorry if some of you hate me now",
    "score": 288,
    "url": "https://reddit.com/r/physicianassistant/comments/1i1il3x/i_have_a_mostly_administrative_position_and_for/",
    "created_at": "2025-01-14T22:37:39.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1ouz7iw",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "My dad is dying, and I need to thank his PA",
    "text": "Tldr: my dad's on hospice and his PA used magic unknown words to make him live longer. Thank you also any gift ideas?\n\nMy dad is dying. He's been in rough shape for a while and frankly it'd be a shorter list at this point of what isn't wrong with him. He was put on hospice yesterday and it won't be much longer before he passes.\nFor the last 6± years he's been seeing an endocrine PA for diabetes management, and she has been more amazing than I can begin to describe. She's the only provider he has ever seen regularly and continued to go back to in his entire life. He has no PCP, no cardiologist, no gastro. \nJust her.\n\nMy dad is so deeply hard headed you cannot tell him a damn thing he doesn't want to do and you can't make him understand the importance of those things. I work in health care I explain test results and follow up care to people all day long. I'm really goddamn good at health care communication but I could never get through to my dad the way she did. She convinced him to get testing and additional care that he never would have done (even if he never followed up with the other departments again).\nShe single handedly extended my dad's life by years. She gave me so many more good years with him. He got to see me graduate college, get a fiancé, get a good job, and buy a house.\n\nThere will never be a large enough thank you I can give to his PA. I know this job is thankless, taxing, and underpaid but please know the difference you are making in so many lives of people you'll never meet.\nAlso, if you have ideas for gifts I could send in addition to a thank you note, I'd love to hear it ❤️ ",
    "score": 278,
    "url": "https://reddit.com/r/physicianassistant/comments/1ouz7iw/my_dad_is_dying_and_i_need_to_thank_his_pa/",
    "created_at": "2025-11-12T07:52:06.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1hq4egk",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "How to be a happy PA: finding the right job and making it work for you",
    "text": "Hello fellow PAs. I've done a few of these guides now and always a ton of fun so thought I'd try my hand again. This is really intended for PAs who 1) feel burnt out at work especially early in the career (and I have noticed a fair amount are in IM and FM) who are interested in potentially changing specialties or jobs, and 2) those who feel bogged down in clinic work due to patient visits going over the limit and prolonged inbox work. \n\nThe first half will address picking a good job fit for you (there's another guide floating around about how money isn't everything and one about negotiating so I'll try to avoid overlap).\n\nThe second half is how to optimize clinic and inbox workflow to enjoy a lunch and getting out on time every day. Feel free to skip to whichever part you're interested in. As always my intent is only to help and never to offend. I am always open to feedback and people adding their own pearls of wisdom in the comments (invariably I always wish after seeing great comments I could edit my original post).\n\nVery briefly, I'm years over a decade in the game now having done many specialties and roles as a PA. I've been lucky to have a job that checks many boxes but I've also had jobs that made me want to pull my hair out. I also will say upfront that being able to move geographically (and I totally understand not everyone can) opens up substantial possibilities. The underserved healthcare areas (both rural and urban) often are a sweet spot for us PAs in terms of good pay, high autonomy, and reasonable cost of living. But there's many other factors to finding where you belong as a PA. So without further adue...\n\n___________________________\n\nI. Finding the right job fit \n\nQ: What specialty or job should I go into?\n\nPAs are a bit different than doctors in that the job itself has more to do with job satisfaction than the specialty. For example, some dermatology positions (a great lifestyle gig for docs, by which I mean good pay and good schedule with minimal call or dumpster fire emergencies) have poor pay and schedules for PAs. Alternatively some gunner positions such as neurosurgery (meaning jobs with high acuity, complex patients, but rough hours) can have a very accommodating schedule for PAs where the doctors deal with most the call and super stressful situations. \n\nThat said, fields that generally lead to high burnout are marked by two things: too many problems in a short time span, and too many high risk responsibilities without enough support. I had a job like this for years and loved it but after having kids it quickly became not for me. The classic fields this describes are CT surgery, neurosurgery, trauma and critical care, emergency medicine, NICU. I'm sure I'm forgetting some but those are typical examples. \n\nFamily, internal, hospitalist, and pediatric medicine while not always high acuity have high complexity and often pressure you to see one hundred problems an hour (sadly not pure hyperbole as four patients can easily have twenty five problems each in today's world) and belong on this list of high burnout jobs despite not being high acuity. \n\nThese jobs are great... For people who are impassioned by this line of work. An analogy: very social people would love to go out three nights a week for years on end. Others of us would just as soon stand in a corner before doing so. The important thing is matching the quality of work with what fufills you and doesn't leave you exhausted in your off time. \n\nThe more lifestyle specialties include dermatology, sleep medicine, wound care, low acuity plastics, low acuity ENT, pure clinic urology, radiation oncology, of course many others. \n\nIn the middle are various medical and surgical subspecialties. As you will fulfill a specialist role you get to focus on a few problems at a time (usually) and avoid a fair amount of scut work. This includes most surgical subspecialties that are mixed inpatient/outpatient/OR (Ortho, surgical and I'll add also medical oncology, head neck oncology, not purely outpatient urology [which is what I do], cardiology and EP (though this can be high acuity if mostly inpatient), burn medicine. Obviously many others here as well. \n\nFinally there are very niche fields including those that are purely OR based, purely procedure based (IR), and then the options for people who don't want to practice clinical medicine (occupational medicine to a degree, veteran exams, admin, education, or men's clinic or medical spa to a degree). \n\nAnd then there's of course urgent care. If you know, you know (jk my UC PAs, much love!)\n\nMy advice is think more about your lifestyle (enjoying yourself at work, good hours, enough time off, enough time with patients) twice as much as what specialty interests you. Granted some things just aren't gonna fit (I could never do OB GYN for example) but in general, better to be happy in a less \"interesting\" specialty than miserable in one that sounds really cool. I also would say really worry less about specialty than you do about getting the right fit. Which brings me to...\n\n___________________________\n\nQ: How do I find the right fit?\n\nYou need to get your priorities straight. You can have it all sometimes but often not. Decide what matters most out of:\n\n- salary (10K more a year to be miserable ain't worth it. But 40K more a year to deal with 25% more stress is quite reasonable for most of us)\n- schedule (hours that match your spouse or kids, versus shift work [three twelves or seven on seven off], days or nights)\n- how much time off, especially for those who love to travel\n- good education and positive vibes from colleagues, good support staff in clinic or OR\n- how much you wanna be challenged (you want the disaster patients often or more solveable problems?)\n- room for growth\n\nWhen you interview you need to be as honest as possible about what you want. In surgery how, much dedicated first assist time? If you love OR and hear \"let's get you set up in clinic first we'll figure that out later\" think twice. If you had a bad first job and need training and hear \"oh you'll shadow for a month then don't worry the doc is only a text away\", don't be fooled twice. \n\nGreen flags (not a slam dunk but a good sign): other PAs there happy, high staff retention, half days or admin time, doc who wants you to become autonomous (\"if you're interested you can also learn XYZ!\")\n\nRed flags (not a hard no but proceed with caution): never had a PA or they don't last long, high general staff turn over, call or significant extra hours without clear extra pay, working at multiple sites, people seem unhappy (trust your gut!)\n\n___________________________\n\nQ: But I really need a job / I already took a job I'm unhappy at\n\nGreat advice: the best time to job hunt is while currently employed. Grass isn't always greener but life is like a bicycle. If you just sit there, you fall on your ass. If you start pedelling (interview elsewhere even if don't accept it), you learn to ride and can easily begin to navigate the road and get to your destination. \n\nIf there's nothing better and you can't move, pause and try again in a couple months. \n\n___________________________\n\nQ: I'm unhappy in primary care, did I make a mistake being a PA?\n\nMy background originally was EM and IM. These PAs are true front line heroes and deserve the upmost respect (along with general surgery PAs, the front line of the surgical world). However the work is hard and underappreciated and not for everyone. Learning and seeing everything isn't fun forever for all of us. \n\nSwitching to subspecialty surgery for me was a game changer. No more ten problems, how about two or three or even one per patient. Inpatient I can do my thing and be done, no dispo problems. I still moonlight IM and have mad respect for it but always love going back to my real job where I don't have to think nonstop about everything. Generally the same applies for medical subspecialties (cardio, oncology, endocrinology, maybe not GI sorry y'all have it as rough as the PCPs!)\n\n___________________________\n\nQ: I'm unhappy and in a damn subspecialty, what about me?!\n\nYep, grass ain't always greener. IM you get a lot more autonomy especially compared to surgery or sub-subspecialty roles. Your patients often bring you Christmas gifts to clinic. So there's no one size fits all. The point is if you're unhappy don't ask \"did I choose the wrong field?\" Before first seriously ask \"am I in the right role for me?\"\n\nAgain, for PAs, job description often trumps specialty. I know urology PAs working fifty hours a week and IM PAs doing 32 hour work weeks. \n\nOkay so moving on. \n\n___________________________\n\nII. How to get home on time and enjoy lunch everyday. \n\nThis is getting long so I'm gonna focus purely on clinic for this post and in honor of the House of God, make this a ten commandments type situation. \n\nNow some may find this list harsh. I did too for a while. But wanna know what was harsher? My family seeing me get home late, tired, and grumpy consistently. So I decided to be \"harsh\" at work and let my family get the happy, please others version of me, not the other way around. \n\n1. Thou shall not do inbox work for free \n- if I can't tell my MA how to answer it for me, they're coming in to clinic to discuss whatever it is (obviously special circumstances merit exceptions for this and any other rule)\n- if I order a CT or specific lab panel, my patient will call and schedule to review with me in clinic, not discuss over the phone\n- if labs are overdue or last visit was missed, see me before a refill\n\n2. Thou shall demand patients respect thy time\n- if you're late and I can't spare the time, you're going to have to reschedule \n- when your time is up it's up. We can reschedule next available appointment to finish. I'll do my best to guide my patients. I'll block thirty min slots for known difficult patients. Those who want a half hour face to face for fifteen minute slots Will have the visit ended and be unhappy\n\n3. Thou shall do work of a PA\n- I don't expect my MA to diagnose and prescribe. My MA doesn't expect me to step on their toes either\n- scheduling and admin stuff? Sure, with dedicated admin time. Otherwise, thanks but no thanks!\n\n4. Thou shall use technology to work smarter not harder\n- Scribe AI becoming an absolute game changer. Heidi is free and works well. FreedAI is a bit nicer if you wanna spend CME money on it but Heidi alone is enough IMHO for those that want to stick with free. Many others and almost all have a free trial\n- OpenEvidence is free with your NPI and like chat gpt for us\n\n5. Thou shall stay in thy lane\n- PCP PAs use your consultants! We have time to discuss one problem at a time, you don't. I can see a clinic patient for such a problem if Everytime you try he wants to discuss ten other things. Send them over!\n- Consultant PAs stick with what you know best. If you're not comfortable managing something bring in your doc or consult out to sub subspecialty as appropriate\n\n6. Thou shall not be a perfectionist (with care, explanations to patients, notes - self explanatory)\n\n7. Thou shall live and learn. To err is human. Don't beat yourself up, learn and move on. And somon and so forth. \n\n8. Thou shall have fun at work. It's crazy how much drama can stew at the clinic or nurse station. Lighten up! Humor is the best medicine after all. \n\nK guys. I'm really dragging to hit ten tbh. Hope you all enjoyed!",
    "score": 266,
    "url": "https://reddit.com/r/physicianassistant/comments/1hq4egk/how_to_be_a_happy_pa_finding_the_right_job_and/",
    "created_at": "2024-12-31T02:23:34.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1hwr1wb",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "PA-C = Lifelong Resident",
    "text": "I work in clinic but in a surgical specialty, left the room after seeing a patient, and just heard one of my SP's talking about how someone is like a bad resident and leaves at the end of the workday without asking if anybody needs anything. They got awkward, stared at me in silence for a bit and then continued after I left. \n\nThe same doc shortly after I overheard them talking about the PA's job is to do anything to make sure the SP's needs are all met at the end of the day...\n\nI had a bad experience of my docs making me see patients afterhours without overtime and just making up work for me. So I started to just leave when my work is over.\n\nEvery time I have a question, they bring up \"When I was a resident, I did this. I did that.\" \"When I was a resident... When I was a resident.\" Where I work they think PA's are lifelong scrub residents and should behave like one.\n\nI am underpaid compared to peers, work over hours too. We have no hope of graduating \"residency\" to becoming an MD with 3x the salary we make now! I think this is all fucked up. Doctors treating PA's like residents. What do you guys think?",
    "score": 235,
    "url": "https://reddit.com/r/physicianassistant/comments/1hwr1wb/pac_lifelong_resident/",
    "created_at": "2025-01-08T18:24:48.000Z",
    "num_comments": 151
  },
  {
    "id": "reddit-1lmvm6v",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Is making $200k possible?",
    "text": "Like most of you, I entered this profession out of interest in science and passion for helping others. However, the salary in this field drew most of us in as well. Even just a few years ago, pre-pandemic, making $100,000 was a big deal. But now that number feels like the bare minimum to be middle class. With so many increases in cost of living like rent/housing, general price increases, interest rates, etc., etc., I feel like a $200,000 salary is now the new version of what making $100,000 was like 5-10 years ago. There are so many people I know working in other professions whose incomes have substantially increased but it feels like our field really hasn’t. I have friends with just a few years experience working for smaller companies in areas like marketing or sales that now make like $150k-200k doing relatively stress-free, easy work. I work in general/bariatric surgery and love being in the OR but I barely make $130k. I am seriously considering exploring other careers such as MSL or Robotic device rep that have much less cap on their income and work less hours than us (from what one of the device reps told me). Is it possible to make $200k as a PA without working a million hours or side hustles? ",
    "score": 220,
    "url": "https://reddit.com/r/physicianassistant/comments/1lmvm6v/is_making_200k_possible/",
    "created_at": "2025-06-28T19:47:03.000Z",
    "num_comments": 292
  },
  {
    "id": "reddit-1pd5m8h",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "What do you wish you were told before becoming a PA?",
    "text": "I wish someone told me how much of this job is emotional labor. You are not just treating patients. You are managing feelings, expectations and the pressure to stay patient.\n\nI also did not realize how much the job can feel like customer service on some days. Smiling, reassuring, explaining things in different ways, trying to keep someone calm. It's harder to manage than I thought and I wasn't fully prepared for this aspect of the job.\n\nAnd I wish I knew how draining the pace can be. The messages, the follow ups, the questions, the notes. Some days it feels impossible to keep up with notes no matter how hard I try.\n\nThose are mine.  \nWhat do you wish you were told before becoming a PA?\n\n  \nEdits (with things that people from the sub said they wish they were told):\n\n\\- That the pandemic would make wages less shiny and impressive as they used to be.\n\n\\- The job can have a really large customer service aspect that is hard to prepare for.\n\n\\- There's sooo much talking involved. \n\n\\- It helps to find a place to go and collect yourself sometimes.\n\n\\- The job search experience is awful.\n\n\\- Documentation sucks. Some people recommended AI scribes. Others recommended text expansion (Text Blaze).\n\n\\- CRNAs can double your salary. \n\n\\- You can get treated as a resident even with experience.\n\n\\-  Many people would choose the CRNA route if they had to go back. ",
    "score": 216,
    "url": "https://reddit.com/r/physicianassistant/comments/1pd5m8h/what_do_you_wish_you_were_told_before_becoming_a/",
    "created_at": "2025-12-03T14:27:29.000Z",
    "num_comments": 179
  },
  {
    "id": "reddit-1js911f",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Happy update",
    "text": "Hey everyone. It’s the PA that was working as an MA/scribe for a derm office making $25 an hour 🤦🏼‍♀️\n(please see my 2 other posts if you are confused).\n\nJust wanted to give an exciting update!! I did quit that awful job 2.5 months ago and took some time finding the right job for me. After multiple interviews, I recently accepted an offer with an OBGYN office for a 115k salary with 10% net collections after I bring in $287,000 for the office. 3 weeks PTO. No weekends, no holidays, no call. Benefits, $1,500 CME, and they will contribute 3% of my income to my 401k. Schedule is 8:30-4:30 Monday-Friday.\n\nI was in OBGYN for my first 2 years as a PA (was only making 95k salary), so I feel extremely grateful that I’m able to go back to a speciality that I love with a higher salary this time around.\n\nThank you all for the advice and support that has been given on my previous posts. It is truly appreciated.\n\n",
    "score": 205,
    "url": "https://reddit.com/r/physicianassistant/comments/1js911f/happy_update/",
    "created_at": "2025-04-05T17:42:46.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1htx7dp",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Open Letter to the PA Who Posted Asking About Strikes, What They Mean, And Then Deleted Their Post",
    "text": "**Congratulations on Unionizing!**  That's a big step, and the first of many towards better compensation and a better workplace that includes a voice for you and your colleagues. \n\nI'm a Union Leader, though not with your union. Most of the things I'll describe are defined through the **National Labor Relations Act (NLRA)** and the cases and decisions and precedents that have followed from interpretation of that over the years.  \n\nYou asked about strikes. *To note: Initial contracts take time, and lots of it. It is not unusual for negotiations to take months or even over a year to iron out. Just because it's been awhile doesn't necessarily mean you're going to strike. Save what money you can, don't go buying a boat or a new car, and if you need to strike, then you'll be ready. And if you don't need to, all the better for everyone.*\n\nI'll try to explain strikes and their variations and answer your questions. There are different types of strikes.\n\n* **Economic Strikes** (for better wages) do not protect your job from permanent replacement. Meaning, if your employer hires somebody to do the work, they could choose to keep those persons on, and not bring you back. \n* **Unfair Labor Practice (ULP) Strikes** (in protest of unfair labor practices such as not bargaining in good faith) protect your job from permanent replacement, among other things.  \n\nStrikes can last for an undefined period of time. These are known as **open-ended strikes**. There are also strikes that can occur for a defined duration. Because you are in healthcare, Section 8(g) of the NLRA requires that your union provide a 10-day notice of intent to strike to the employer, so you'll know at least 10 days in advance whether you'll be striking and whether it is open-ended or otherwise. \n\nThe difficulty is that intermittent strikes cannot occur for the same general purpose and still offer those aforementioned NLRA protections. So while you can have intermittent strikes, the cause / purpose of each strike will have to be different. Most employers, however, commit so many Unfair Labor Practices in the course of their usual tactics that it's not too much of an issue to have a different intermittent strike for each one, at least for a bit. It is \"safer\" for NLRA protection purposes to have an open-ended strike but a couple intermittent strikes to show strength and ability can help the employer recognize that the union can both strike if necessary but also show that it is interested in continuing positive relations if the employer is willing. That decision will be up to your union leadership.\n\nAn example: If a strike is defined as lasting for 3 days because the employer has committed one action, such as 1199 / Coalition of Kaiser Permanente Union's recent strike which was the largest healthcare professional strike in US History accounting for over 75000 members, the union cannot strike again for the same purpose and still have its members protected under NLRA protections.  \n\nThey can go out on strike again for a different purpose, but not the same one.\n\nThe longest healthcare strike in the history of the United States was at St. Vincent in Massachusetts, accounting for 301 days and 800 nurses.  \n\nThat is, admittedly, *scary*. It's a long time to go without pay.  \n\nThe average strike is for 40 days.\n\nYou've also talked about your worry for *retaliation.* From an employer and a union standpoint this is expressly forbidden by the NLRA. Does it still happen? Sometimes, especially from an employer. If you were terminated in retaliation then a ULP grievance over the termination would be submitted to the NLRB and you would be entitled to backpay for lost wages and reinstatement. The employer of course, would make every argument that you violated your terms of employment that would justify your termination as non-retaliatory. In terms of retaliation from your union, if you were to scab, you'll likely be ostracized upon return for crossing the picket line - after all, your coworkers were sacrificing and putting everything on the line to ensure a better future for you and for themselves, and you would have been *actively undermining their efforts, future and livelihood.*\n\nHere's the thing.  \n\nYou have been grossly underpaid because your employer thinks they can get away with it. It sounds like your employer has been stealing $20,000 per year from you, every year, for years. \n\nAnd the honest truth is that they *can*, they've demonstrated that, that they can, and have, gotten away with it. Because you were too tired from working to look for another job. \n\nThe big tool in the workers' collective toolbox is the strike. If you refuse to strike, which is your right and of course everyone has a different financial situation at home, then you are essentially saying \"I will take my crap pay\" to the employer and \"I don't care about your livelihood\" to your coworkers. Whether that's because you are unwilling or unable the result is the same - the employer will continue to underpay you.  \n\nA strike is a bit like medicine. The disease is the employer's wage theft and refusal to you your fair due so that they can pad their c-suite executive salaries and shareholder payouts. But all treatment modalities in medicine have a risk of adverse effect. By necessity, it hurts us at the same time as it hurts the employer. So the decision to strike would not have come lightly.\n\n&gt;I need pay and benefits.  \n\nThat's why you're striking. It's an investment in your future pay and benefits. If you're not willing and able to strike when called upon, the alternative is accepting whatever pay and benefits and work environment your employer decides to graciously bestow upon you. The alternative is to undo the sacrifice and work towards a better future that your colleagues and their families are all building and sacrificing for.\n\nIf you anticipate a long strike, you could pick up a job (preferably part-time or per-diem) at another employer to help pay the bills. That could be in healthcare or otherwise. Don't forget to show up to picket, there's strength in that. And there are things you can do to help mitigate the effect - you can ask your mortgage lender to pause payments due to temporary hardship. There may be a strike fund, but it's usually pretty small.\n\nAt the end of the day, if you want to stay at your current employer, with better pay and benefits, ***sometimes you have to be willing to fight for it.***",
    "score": 193,
    "url": "https://reddit.com/r/physicianassistant/comments/1htx7dp/open_letter_to_the_pa_who_posted_asking_about/",
    "created_at": "2025-01-05T04:08:49.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1knc5tw",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Surgical PAs, how many hours do you work a week?",
    "text": "\nHey! I work for a surgeon in joint replacement and work 50-60 hours a week SALARIED at 110. \n\nI talked to my doc about it and he basically said \n\n“Idk what you want every surgical PA has these hours or worse” \n\nHow many hours do y’all work?\n\nSide note, I would be more ok with the hours I think if I was hourly and getting paid for the longer days \n\nEDIT: for more context some have asked. \n\n- I do two full clinic days with 45 ish patients between me and doc. \n-2 full 12 ish hour surgery days doing 6 joints a day \n- I round on inpatients in the morning everyday. \n-I take call every 4th weekend and get paid 100 bucks a weekend. ( I will say I never really have to go in besides \nrounding on the weekends when I’m on call) \n- Fridays I either drive 1.5 hours away to our rural clinic and get hammered with 50 patients or we do another surgery day like 7-3 ish \n\n\nThank you for the feedback though. \n\nI quit today and he came at me saying my expectations are too high and myself and all other PAs are just lazy and don’t want to work. So I wanted to confirm I’m not crazy ",
    "score": 184,
    "url": "https://reddit.com/r/physicianassistant/comments/1knc5tw/surgical_pas_how_many_hours_do_you_work_a_week/",
    "created_at": "2025-05-15T16:12:22.000Z",
    "num_comments": 237
  },
  {
    "id": "reddit-1o8oz5d",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "A reminder that high paying salaries are out there",
    "text": "A classmate of mine just landed a surgical NICU job at a local children’s hospital after a fellowship. \n\nStarting pay listed as 144k-220k depending on experience.\n\nOffered 165k starting 1 year out of school!\n\n",
    "score": 183,
    "url": "https://reddit.com/r/physicianassistant/comments/1o8oz5d/a_reminder_that_high_paying_salaries_are_out_there/",
    "created_at": "2025-10-17T02:02:05.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1idn5dm",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Cardiology PA- negotiation update",
    "text": "I made a post a couple days ago of what I make and what my duties are. I took a lot of people’s advice when we had our performance review but unfortunately, it didn’t go as well as I hoped it would. \n\nThere were 4 people present (the doc, admin,  manager and finance person). It felt like 4 vs 1 the whole time. My doc said this wasn’t a negotiating platform almost immediately after I gave them a list of all my duties to justify what I was asking. \n\nHe jokingly said “you don’t see enough patients to cover your own salary, if anything, you owe us money” and everyone at the table laughed. I was told I can’t just “demand” a raise only because another job offered me more money. \n\nI told him I do a lot, I commute to many different clinics and we are on call all 2 separate hospitals AND I’m expected to do marketing for the clinic. I said marketing is not a typical duty for a PA and that it’s not something I want to continue doing. \n\nHe said to think about how little I knew at the beginning fresh out of school and he looked me in the eyes and ended the meeting with this last sense… “you wouldn’t have made it anywhere else.” \n\nNeedless to say I bawled my eyes out as soon as I left the building. I constantly told them I wanted to stay and that I was wanting to come to an agreement. That I had a heart for the clinic and wanted to make it work. \n\nWhat’s worse, I had two other very confident women sitting at the table with me and for them to just stand idly by as a man tells me I wouldn’t have made it anywhere else while I am trying to prove my worth felt absolutely awful. \n\nWe talked for about an hour and not one positive remark was made for what I’ve contributed. The theme of it all felt like it was “see more patients, market yourself more and go to more clinics” \n\nI feel it’s now going to cost them more money than the 5-10k more I was asking to find someone else, train them and  convince anyone else to do all I do for the same price. \n\nI feel so blindsided by the entire meeting. I was even starting to convince myself that I came on too strong and asked for too much. But I know I didn’t. I felt so undervalued and to say I wouldn’t have made it anywhere else…. It was wrong. I have to put in my resignation in the next few days and I’m doing it with such a heavy heart. \n",
    "score": 179,
    "url": "https://reddit.com/r/physicianassistant/comments/1idn5dm/cardiology_pa_negotiation_update/",
    "created_at": "2025-01-30T13:39:06.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1lm8oau",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Halfway through PA School - regretting not doing medical school. experience/advice?",
    "text": "Hi everyone! \n\nI (25 yo female) am halfway through my last semester of didactic of PA School &amp; I’ve been enjoying it and doing very well (3.95 GPA). I recently turned 25 and have been reflecting on my career choices… \n\nI always planned on going to PA School &amp; never seriously considered medical school. I was attracted to the lower level of responsibility, lateral mobility, work-life balance &amp; having the safety net of working under a doctor. However, through my experiences it became clear the me how drastically different the salaries of PAs vs MDs really is.. (I know this shouldn’t be a determining factor, but it plays a role. I’m from a very low income family &amp; have always been extremely hard working). This sparked an interest in medical school &amp; the more I think about it the more I wish I chose that rather than the PA route.\n\nWhile the money was what got me thinking about this initially - I’ve realized I continually search for a better understanding of the diseases/medicine we learn. Throughout didactic, my peers tell me I’m “doing too much” by memorizing details, or learning material beyond what we are taught - to better know how to recognize/treat patients. When I started school I thought I would have a much better knowledge base as the end of didactic than I do now and I think I realized that I AM doing too much and a PA really doesn’t have a knowledge base even close to an MD and it’s honestly discouraging. As I get ready for clinicals - I find myself wanting a bigger role in the diagnosis &amp; treatment of my patients. I feel like I’ve discovered a true passion for medicine and making an impact on my patients and I’m scared I’m not living to my full potential by not pursuing medical school. \n\nI plan on finishing PA school because I’ve already put so much time &amp; money into it - but I wonder if there’s anyone out there who’s gone to Medical school after PA graduation &amp; how that process was. I love being a PA(-S) but I’m scared of getting older and always regretting my decision, but maybe I haven’t seen the full scope of what PAs really can do.? If anyone has a similar experience or advice that would be greatly appreciated!!",
    "score": 165,
    "url": "https://reddit.com/r/physicianassistant/comments/1lm8oau/halfway_through_pa_school_regretting_not_doing/",
    "created_at": "2025-06-27T23:42:41.000Z",
    "num_comments": 169
  },
  {
    "id": "reddit-1kqhao8",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Laughable job offer, family medicine",
    "text": "I have been a PA for 9 years, 6 years in clinical practice and 3 years in research (clinical trials). I left my last job in January. I wanted to share this story as a reminder to know your worth when on the job hunt and in negotiations.\n\nI am in a HCOL area (DC metro). A nearby family practice gave me a job offer. This place is M–F plus every other Saturday, hospital call daily (PAs only), 15-min slots often double-booked, no set patient panel, and a supervising physician frequently away. Benefits advertised: health insurance, 401k match, profit sharing, PTO, paid holidays, license fees, CME, bonuses to include sign on bonus. Pay advertised at $55–60/hour (I planned to negotiate).\n\nFirst, I had an in-person interview. Second, a shadowing interview. Third, an in-person interview in which they stressed urgency for hiring due to an upcoming PA's leave. Fourth, they tried to get me to come in again to review the offer letter in person and sign but I asked it to be sent to me ahead of time. \n\nBoy, was it a doozy. I was offered: \n\n\\- 6-8 week \"training\" period of $25/hour \"as a contractor\" while we wait for delegation agreement to be completed. Note that at the first interview, the training period was quoted at $30/hour.\n\n\\- $55/hour thereafter \"as a contractor\"\n\n\\- Full time work, every other Saturday included (six-day work weeks), until the return of the PA going on leave (likely 2 months)\n\n\\- 401k with 3% match after 1 year of employment\n\n\\- Profit sharing after 1 year of employment\n\n\n\nWhat was the offer letter missing? \n\n\\- Coverage of DEA and other licenses/registrations needed for me to start (verbally stated by person at third interview with clinic, but missing from letter)\n\n\\- CME stipend (verbally given as $1500 at first interview)\n\n\\- Sign on bonus details\n\n\\- Any info at all about benefits (stating they would discuss details \"in the future\")\n\n\n\nI had questions, chief of which was why I am being offered a 1099 position when there was no mention of this in any of my three in-person visits to the clinic. Also, $55/hour is laughable and I made it known that it is well below market. I highly dislike the idea of a training period, but was willing to hold my nose and stomach it had it been a W-2 position but at the higher rate of $30/hour. As this is the only offer I've gotten in 4 months of searching, I was planning to just take the loss.\n\nSecond email from clinic:\n\n\\- the \"training\" period is 1099 and now offered at the $30/hour initially quoted, with the period thereafter as a fully operational PA being W-2. Note that it was very clear from the initial offer letter that both were intended to be 1099. They were just hoping I didn't read it thoroughly.\n\n\\- the salary is $110,000 the first year (somehow decreased from the initial quote of $55/hour, which annualizes to $114,400)\n\n\\- CME reimbursement occurs only after 1 year of employment\n\n\n\nThey were being purposely vague and trying to make me feel like I'm the one on their timeline. I decided to hit the big red button in the next email:\n\n\\- CME reimbursement after 1 year is unusual and to please elaborate as to whether my licensure costs are also pushed after 1 year of employment\n\n\\- Provide me with a detailed benefits package to include what is covered immediately and what is only available after 1 year of employment, given the lack of transparency\n\n\\- Attached the AAPA 2024 salary report with a breakdown of what would be considered reasonable pay in our area ($61/hour with all benefits up front is not ideal but something I can swallow).\n\n\n\nAll I got in reply was that I'm too expensive.\n\nKnow your worth.",
    "score": 157,
    "url": "https://reddit.com/r/physicianassistant/comments/1kqhao8/laughable_job_offer_family_medicine/",
    "created_at": "2025-05-19T17:15:49.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1jz2p5h",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "High Earnings Salaries",
    "text": "I’m sure this has already been discussed, but would like to hear an updated discussion on what the HIGHEST earning salary you’ve ever heard of, seen, or have had yourself. Salary base + bonuses included. Benefits not necessary unless there is direct monetary value associated with it. \n\nAnd I’m hoping for fact-based comments, not the “oh I heard a friend of a friend of a distant relative had XYZ salary but I’ve never confirmed” types of comments. \n\nI’m hoping to see if there’s a correlation with specialty, years of experience, scope of practice, setting of practice, etc. ",
    "score": 142,
    "url": "https://reddit.com/r/physicianassistant/comments/1jz2p5h/high_earnings_salaries/",
    "created_at": "2025-04-14T16:10:01.000Z",
    "num_comments": 306
  },
  {
    "id": "reddit-1j30f8l",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Set me straight…",
    "text": "Looking to be (metaphorically) shaken by the collar. I've been a PA for a few years. Currently in a role that many people have described to me as \"the dream.\" Without too much detail, I work a job in a *super* niche field (would dox myself if I described it) where I see a single digit amounts of patient per week for extremely low acuity visit (read: 1-2 ppd). I also get paid twice as much as some PAs I know and have insanely good benefits. Amazing work culture and supportive, nice coworkers. Located in a highly desirable city. \n\nMy problem: I actually really love medicine. I should have gone to med school (too late now). While I have virtually zero stress with &gt;99%ile PA salary, I am bored out of my mind. I feel like I went to school to be a trained monkey doing the mostly mindlessly easy medicine. I'm pretty intellectually underwhelmed and unstimulated. \n\nThe ask: tell me I'm an idiot and that the goal is to work as little as possible for the most amount of money -- because if that's the goal I may have won the profession...but, is there anyone else out there who has ever been tempted by the thought of taking a humongous paycut to work a more stressful job in order to be more intellectually stimulated? Any stories of this? Or am I being dumb and need to just enjoy my life and not work to live? \n\nPS I may be the kind of person who would complain about their job if I were ice-cream-taster-in-chief making $1mil per year, idk. \n\nPPS this isn't a fake humble brag, I'm actually questioning my career choices.",
    "score": 142,
    "url": "https://reddit.com/r/physicianassistant/comments/1j30f8l/set_me_straight/",
    "created_at": "2025-03-04T02:30:37.000Z",
    "num_comments": 296
  },
  {
    "id": "reddit-1ku1jw3",
    "subreddit": "physicianassistant",
    "soc_codes": [
      "29-1071"
    ],
    "title": "Hospitals losing money on physicians",
    "text": "My hospital system is pretty regularly cutting benefits and discussing depressing financials, despite the still high salaried CEOs.  I am reading that 37% of hospital systems are still operating at losses. Interesting reports here on losing money per physician. I wonder if there are any similar studies on how much they are losing per PA/NP as well. \n\nhttps://www.kaufmanhall.com/insights/article/hospitals-losing-money-on-physicians",
    "score": 138,
    "url": "https://reddit.com/r/physicianassistant/comments/1ku1jw3/hospitals_losing_money_on_physicians/",
    "created_at": "2025-05-24T02:53:30.000Z",
    "num_comments": 115
  }
]