[
  {
    "id": "reddit-1ia71n0",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "What is going on here?!",
    "text": "I don’t see this kind of posturing working with my senior patient population and I’m a little stumped. I’ve seen folks say that this forward lean is indicative of frontotemporal dementia, but I have never witnessed a fwd lean that’s not kyphotic as well. I would love to see other’s opinions, as I know this sub is filled with smarter people than me. Thanks! ",
    "score": 532,
    "url": "https://reddit.com/r/physicaltherapy/comments/1ia71n0/what_is_going_on_here/",
    "created_at": "2025-01-26T05:40:32.000Z",
    "num_comments": 307
  },
  {
    "id": "reddit-1lquk85",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Sign the Petition: Keep Pseudoscience Out of Academia - No Chiropractic Program at Pitt",
    "text": "\n\nThe University of Pittsburgh is launching a Doctor of Chiropractic program alongside it’s DPT program, a move that threatens to legitimize a field rooted in outdated and dangerous ideas, such as subluxation theory and spinal manipulation for infants. \n\nLet’s be clear, this isn’t about a professional rivalry. This is about science. Chiropractic care, as it is still widely practiced today, includes interventions that are not supported by evidence, and in some cases are actively harmful. Despite what proponents claim, high velocity spinal manipulation is still being marketed for newborns and immune system boosting and even ADHD without valid clinical backing. \n\nWe worked hard to make physical therapy a respected, evidence-based medical profession. Letting a university give equal academic footing to chiropractic care without holding it to the same standards of scientific scrutiny undermine everything we’ve built. \n\nSign the petition to stand up for science back to care and for patient safety.\n\nTell Pitt and other institutions pseudoscience does not belong in our universities!",
    "score": 421,
    "url": "https://reddit.com/r/physicaltherapy/comments/1lquk85/sign_the_petition_keep_pseudoscience_out_of/",
    "created_at": "2025-07-03T16:51:07.000Z",
    "num_comments": 111
  },
  {
    "id": "reddit-1mpjyxj",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "A serious message to patients",
    "text": "OKAY LISTEN, NOBODY — AND I MEAN NOBODY — DOES PHYSICAL THERAPY BETTER THAN ME, FOLKS. THE DOCTORS, VERY SMART PEOPLE, THEY ALL SAY “SIR, YOUR FORM IS PERFECT, ABSOLUTELY PERFECT.” YOU GOTTA DO THE EXERCISES — TREMENDOUS STRETCHES, THE BEST STRETCHES — EVERY SINGLE DAY. IF YOU DON’T, BELIEVE ME, YOUR KNEES, YOUR SHOULDERS, THEY’RE NOT GOING TO BE GREAT, AND WE WANT THEM TO BE GREAT. SO GRAB THAT THERABAND, DO THE REPS, AND WE’RE GOING TO MAKE YOUR BODY STRONG AGAIN — STRONGER THAN EVER, MAYBE THE STRONGEST IN HISTORY! THANK YOU FOR YOUR ATTENTION TO THIS MATTER!",
    "score": 397,
    "url": "https://reddit.com/r/physicaltherapy/comments/1mpjyxj/a_serious_message_to_patients/",
    "created_at": "2025-08-13T23:16:32.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1p1vk7a",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "No longer considered a \"professional degree\"",
    "text": "The DoE no longer lists PT (nor OT, NP, PA, ST, or RT) as a professional degree, but fucking chiropractics makes the list. \n\nHow bad is our lobby that the APTA can't ensure this basic designation? Clearly the chrios have it figured out. MAHA at its finest...",
    "score": 365,
    "url": "https://reddit.com/r/physicaltherapy/comments/1p1vk7a/no_longer_considered_a_professional_degree/",
    "created_at": "2025-11-20T05:58:53.000Z",
    "num_comments": 230
  },
  {
    "id": "reddit-1idlnki",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "I love my job",
    "text": "A lot of negativity in this sub, some of it warranted and some of it is just absurd. However, for anyone in this sub that’s trying to get into PT school, currently in PT school, or just graduated, this profession is dope. Every day you have the opportunity to make someone feel better, physically, spiritually, and/or emotionally. You grow to form relationships with patients. They bring you food, check in on you, remember things you tell them about your personal life. New patients will come to you saying “oh ‘so and so’ recommended me to you, they say you’re great”. Yes, at the end of the days I’m mentally exhausted and go to bed earlier now than I ever have. However, I don’t dread waking up. I don’t dread going into the clinic. While I’m in the clinic, my days go by relatively quick. This sub has too much negativity and I can see how it scares people away from this profession. I’m just trying to shine light and say this profession is dope and you’ll love it if you’re in it for the right reasons. ",
    "score": 335,
    "url": "https://reddit.com/r/physicaltherapy/comments/1idlnki/i_love_my_job/",
    "created_at": "2025-01-30T12:16:03.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1ksejx1",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Want to become a physical therapist? Great idea! Read this!",
    "text": "Outpatient Ortho? Good start, let's pack on patients to your schedule to the point where you have 4 of them come in at the same time, don't worry we will give you one underqualified college kid as an aid to split between you and your co-workers for support. Don't forget about all the notes from the 16+ patients you saw today! Lunch? At your desk! Try shoving a couple of bites in between patients. The pay? I mean you get a paycheck, there won't be much in it but it's something! \n\nNo? Okay maybe acute care! Glove up friend and pin that nose shut because youll be covered in piss and shit a lot. Get that half conscious TKA up the stairs bud, we got money to make! Doc is yelling at you to get the drunk schizophrenic cleared for discharge? Is it safe? Maybe not, but it's not like your license is on the line or anything, Mod I for household distances it is. The pay? A little better but not by much. \n\nHmm maybe not. I think rehab is more your speed. I hope you don't like your back, or your shoulders, or your sanity, because they'll be gone within a couple months anyway. Keep documenting though! You got this! Management wants you to discharge faster? To see more? Noo prob! It's not like the patients complain every second of the day or anything to make your day even longer.\n\nAlright alright, so you want a nice chill pace, lots of money, and independence, I think homecare is for you. Will your patients get better? Prob not. Do they want PT? Debatable. Do they think you're a nurse? Yup! Will you have an absolute shit ton of notes to do when you get home? Hahahaha holy shit you will. Your contract may say 40 hours but we all know that's bullshit, schedule everything yourself, do all the notes, drive around like a madman, and go see your patients. Your life after work? Uh you're a PT, that's not a choice anymore. It'll be a blast! \n\nAnd don't forget, no matter where you go, you can always take comfort in the unreasonable amount of debt to income ratio you have to make you feel all warm and fuzzy inside. And that \"Doctor\" title! Wow. Will anybody ever call you doctor? No. But I guess its cool you know? \n\nI've been treating for two years and this has been my reality. I'll be dedicating the next year to finding a way out. Wish me luck. ",
    "score": 300,
    "url": "https://reddit.com/r/physicaltherapy/comments/1ksejx1/want_to_become_a_physical_therapist_great_idea/",
    "created_at": "2025-05-22T01:17:28.000Z",
    "num_comments": 178
  },
  {
    "id": "reddit-1ooswlb",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Third NPTE Retake, PASS, and tips",
    "text": "Hey everyone,\n\nI made a post back in July that I didn't pass on my second attempt, but I'm making another one now because I FINALLY PASSED on this third try. It's definitely been a rollercoaster of emotions these last couple months of restudying for it. I honestly really contemplated giving up on PT all together because I was so burnt out from studying. \n\nI want to let everyone know who weren't able to pass on this most recent attempt that I BELIEVE in you. For those who are planning to retake it in January, one of the best advice I got was to make sure you take breaks. If you're anything like me, I always tend to overstudy but we need to remind ourselves that these breaks helps refuel our energy to study again. We're not robots and we need time to consolidate the information. With that said make sure to enjoy the holidays. Spend time with friends and family and make sure you don't put your life on hold for this test. The NPTE will always be there, but the memories we choose to make now won't. \n\nAlso, if you're wondering in terms of the material what helped me pass. I HIGHLY recommend purchasing for the NPTE breakdown report for 100$ and TherapyEd's 3x practice exams for 100$ (total of 200$). The NPTE breakdown report helps show what your strengths/weaknesses are for the subjects, at which points of the test did the fatigue kick in, &amp; etc. The therapyed practice exams were BY FAR the closest thing to the NPTE that I've taken. What's cool about it is like the NPTE breakdown report it'll show what your strengths/weaknesses on the subjects are and rationales for why questions you got were correct/incorrect, and a score which indicates how ready you are after taking the test. I've taken so many practice exams like the PEATS from the NPTE website, final frontier practice exams, practice exams I found online, but TherapyEd BY FAR was the best in my opinion. \n\nAdditionally, HONE in on your MSK, cardiopulm, neuro, and differential diagnoses material. I've taken over 3000 questions during my second attempt and taking questions mindlessly will get you nowhere. If you have a really good understanding of the 3 subjects, you'll pretty much understand 80% of the test. For example really understand what the purposes of this special test is, why this muscle has this action/innervation will cause this impairment ex: during gait, why would a patient with a damaged deep fibular nerve demonstrate circumduction during swing phase of gait (because they're unable to clear their limb due to a weakened anterior tib muscle that is not dorsiflexing during swing), differentiate diagnoses like if a patient demonstrates bilateral LE edema, is it CHF, lymphedema, kidney failure, etc. Understand cardio pulmonary diseases restrictive vs. obstructive, different neurological diseases, and outcome measures! The outcome measure questions come out alot in those 3 part case scenario questions so be able to understand that this outcome measure for example the Stroke IMPACT scale (SIS) is a SELF-REPORTED questionnaire vs. NIH Stroke Scale (NIHSS) is an actual measure of stroke severity. These were just random questions that popped into my head while restudying it, but REALLY UNDERSTAND the 3 core subjects and not move on if something is not making sense to you. It is not a waste of time. \n\nLastly, if you made it this far. YOU ARE GOING TO PASS AND NEVER NEED TO STUDY/TAKE THIS STUPID TEST AGAIN. Believe me when I say I know all the emotions you're feeling because I've been in your shoes twice already. YOU WILL PASS AND I BELIEVE IN YOU. My friend once told me that life is tough and will probably only get harder from here, but you can only get stronger 💪💪. GOOD LUCK on this last time you will ever study for this test and HAPPY HOLIDAYS from the bottom of my heart!!!!!",
    "score": 284,
    "url": "https://reddit.com/r/physicaltherapy/comments/1ooswlb/third_npte_retake_pass_and_tips/",
    "created_at": "2025-11-05T03:58:55.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1j7q35j",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Disgusted with PT practice and lack of support.",
    "text": "I have been a PT for 30+ years.  I am good at my job. I really care about my patients.  This is why I continue to practice PT. However, the health care industry has become irreversibly contagious to normal work environment, We are subject to high patient volumes, no break time, \"iffy\" lunch break, and an expectation to do documentation on personal time.  Yet nobody stands up against this. It is just accepted.  PT's do not have unions. So, if we don't stand up for ourselves, no one does.  I tried standing up for myself over the past year.  The result was false accusations of things I said or did, and my rank of excelling at my annual review deteriorated to 2 levels lower to \"developing\" which is one level above getting fired.  I posted this on the PT forum on Reddit and got a notice from administration.  In all honesty, where the hell else am I going to get some support?? This is real life for Physical Therapists. Please don't shut down one of the few support forums we have.  We are persecuted for saying what we feel on Facebook and other public forums.  We do not have a union. There is no one to stand up for us but ourselves, and for that we are persecuted. ",
    "score": 279,
    "url": "https://reddit.com/r/physicaltherapy/comments/1j7q35j/disgusted_with_pt_practice_and_lack_of_support/",
    "created_at": "2025-03-10T03:59:12.000Z",
    "num_comments": 126
  },
  {
    "id": "reddit-1k3pod8",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Exhausted by the State of PT and Lack of Advocacy",
    "text": "I’ve dedicated over 15 years of my life to being a PT. I’m damn good at my job, and my patients mean everything to me—honestly, they’re the only reason I’m still here. But what our industry has become is toxic and unbearable. We’re drowning under overwhelming patient loads, breaks are nonexistent or unreliable at best, and we’re constantly pressured to finish mountains of documentation on our own personal time. And yet, nobody dares to challenge this. It’s just accepted as “part of the job.” PTs don’t have unions. If we don’t advocate for ourselves, literally nobody else will. I tried speaking out this past year and was swiftly punished with false accusations and watched my performance rating plummet from “excelling” to “developing,” just a step away from termination. I vented on the PT subreddit, desperately seeking support, only to get reprimanded by administration for doing so. Tell me, where else are we supposed to turn? Facebook and other platforms are monitored, and we’re actively punished just for being honest about our struggles. Please don’t silence one of the only safe havens we have left. This isn’t an exaggeration; this is the grim reality of PT today. Without unions or advocacy, we’re left alone and penalized for even daring to speak up.",
    "score": 275,
    "url": "https://reddit.com/r/physicaltherapy/comments/1k3pod8/exhausted_by_the_state_of_pt_and_lack_of_advocacy/",
    "created_at": "2025-04-20T15:55:47.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1lqoqvl",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Pitt is launching a chiropractic program alongside DPTs — this is not okay",
    "text": "The University of Pittsburgh is opening a Doctor of Chiropractic Medicine program within its School of Health and Rehabilitation Sciences — right alongside PT, OT, nursing, and other evidence-based fields.\n\nThis is a serious problem.\n\nChiropractic, as a profession, has deep roots in pseudoscience. While some providers focus on MSK care, much of the field still promotes subluxation theory, anti-vax rhetoric, and unproven treatments. Putting DCs in the same academic setting as DPTs blurs the line between real healthcare and snake oil.\n\nThis damages public trust and weakens our profession. Patients won’t know the difference — and that’s exactly the problem.\n\nWe need to talk to the APTA, our state boards, and Pitt leadership. This isn’t just disappointing — it’s dangerous. If we don’t speak up, who will?",
    "score": 270,
    "url": "https://reddit.com/r/physicaltherapy/comments/1lqoqvl/pitt_is_launching_a_chiropractic_program/",
    "created_at": "2025-07-03T12:49:09.000Z",
    "num_comments": 379
  },
  {
    "id": "reddit-1ol1f55",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "7 years of school was a lie",
    "text": "Just so yall know, our education doesn’t mean anything because patients do their own research!\n\nWas explaining to a patient (who says they exercise and stretch daily) the soreness they had after using 3# weights for bicep curls/chest presses/triceps extension in our previous session was a good thing! progressive overload and DOMS etc etc. patient stopped me and said they disagreed because they did their own research- you DONT need to get sore to get stronger and tearing muscles (I used the term microstress of the muscle fibers) is a bad thing.\n\nEgg on my face! Of course. Please tell me more. Let me just do 3 units of manual therapy every session and absorb your pain and weakness symptoms through my hands while you explain to me how one gets stronger by doing the same thing over and over again. \n\nWhat blackout stuff have your patients told you that made you internally scream?\n\nEdit:\n\nI absolutely believe in patient advocacy and listening to patient concerns. this was labeled a shit post to vent about a difficult patient, I didn’t think I needed to give an entire case study of the patient and their past medical history/years of chiropractic and PT without progress/change in impairments/function. I’ve tried numerous ways to modify exercise to meet the patient where they’re at, my last attempt was slapping some ankle weights onto their wrist to do some strengthening and here we are.",
    "score": 259,
    "url": "https://reddit.com/r/physicaltherapy/comments/1ol1f55/7_years_of_school_was_a_lie/",
    "created_at": "2025-10-31T17:51:58.000Z",
    "num_comments": 91
  },
  {
    "id": "reddit-1mqhe8r",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "From one healthcare professional to another; from one patient to PTs… holy crap thank you 😭",
    "text": "I work in xray at an outpatient trauma ortho/physical therapy clinic.  We can spot which patients do their physical therapy exercises.  We see patients using the techniques you’ve taught them.  These are the patients that get back to normal life quicker than before their injury or surgery.  We are always so proud of them!  \n\nBut the tables turned today. I was the patient. I walked in with foot drop, got some electric needles  poked in me, walked out with the ability to flex my foot.  CRIED HAPPY TEARS IN THE BATHROOM. 😭 and I showed off my cool new party trick (flexing my foot) to anyone that would look and listen lol \n\nI don’t know if PT is similar to the rest of healthcare, but I know for sure that most HCWs don’t get recognized and thanked enough in someone’s recovery.  So I wanted to reach out on here to say omgholyshit THANK YOU so much 😭😭 just one session and there’s a temporary world of difference for me, and it’s given me the motivation to keep pushing through.  Y’all are truly fucking awesome!  ",
    "score": 234,
    "url": "https://reddit.com/r/physicaltherapy/comments/1mqhe8r/from_one_healthcare_professional_to_another_from/",
    "created_at": "2025-08-14T23:48:04.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1nina4j",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "We need to demand better pay and conditions",
    "text": "I've been a PT for over a decade. I started out working at a spine specialty clinic and worked contingent at a hospital IPR (economically distressed urban area) at $52 per hour. \nI've recently left the mill i was at to start a private practice.  To make ends meet I took a contingent IPR job at the premier hospital ( suburban HCOL area) starting pay $44 per hour.\nHow does pay go down by $8 per hr in 10 years?\nMy wife at the same hospital,  different profession has unionized,  and they have received  8% and 10% raises, including backpay for the entire year.\nAPTA is worthless,  we as professionals are not , unless we let the world treat us as such. As individuals we can only do so much. But we need a union with teeth to advocate for us before this bleeding turns into a full hemorrhage. ",
    "score": 213,
    "url": "https://reddit.com/r/physicaltherapy/comments/1nina4j/we_need_to_demand_better_pay_and_conditions/",
    "created_at": "2025-09-16T17:05:54.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1jcw60y",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "here to tell you......",
    "text": "...physical therapists (at least the one I have for sure!) are great!  coming out of surgery (hip)  and needed and still need help with walking, strength and pain.  I have never gone to a pt before and it was intimidating as I didn't know what to expect.  not only is he helping me with muscles, pain and he listens and nothing gets by him.  I had trouble with vertigo (ear crystal) and would just sit a second for it to resolve.  He did the epley maneuver and it got gone.  I wasn't aware pt's do epleys.  one time I just made an off comment that I am sensory sensitive.  next time I came in, not only were the lights turned down (natural light lots of windows) so too was the radio.  I am weeks into pt and see the day may be soon where I will not see him for help anymore and he has done his job (getting me well).  I don't trust many people, but this guy I would trust.  especially as pain is involved, that would be hard for anyone.  I am getting better, my muscles are getting stronger and I look forward to talking with him while we work together.  I guess I am writing all this to all pt's out there as I can see your job is very hard and so many elements involved and probably a high burn out job.  just know there are those of us who love you for the work you do and if ever you feel like quitting or getting overwhelmed, know that you are appreciated.  thanks.",
    "score": 206,
    "url": "https://reddit.com/r/physicaltherapy/comments/1jcw60y/here_to_tell_you/",
    "created_at": "2025-03-16T21:24:55.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1kjbqqb",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Newest APTA Update, got this newsletter this morning.",
    "text": "Good Morning Everyone,\n\n\nAs part of our new community outreach program, I'm excited to make our first reddit post and begin our ongoing dialogue. As we've interacting with clinicians in the beginning of 2025, we've heard about the numerous challenges you've been facing. The cuts to reimbursements, the interactions you've had with other types of providers, and the concerns over the financial health of the profession. We know how stressful this can be, especially now with more uncertainty regarding the overall economy. I personally see this everyday when interacting with the clinicians in my local area.\n\nAnd many of you have asked, how does the APTA plan to react to this?\n\nRest assured, we've already begun taking action to make things better. In March, we ordered top of the line Herman-Miller office chairs for the new building, so employees can turn easier as to not have to look at what we call \"the poor side of the building\" where the Athletico is in view. Second, we hired my niece to do fun Tik-Tok dances and tag #PTcanBFun to help boost morale and improve social outreach. We expect this to increase the referrals to your clinic dramatically.\n\nWe've also come up with a comprehensive new budgeting tool to help PT's address their financial debts. We're proud to be partnering with DoorDash, in a program were calling \"oh by the way\", which we think will increase the awareness of the PT profession and help people #ChoosePT. APTA members should expect a detailed email in the coming days, with the general population probably hearing about it on the news in the coming weeks.\n\nBut remember, it won't be for the weak! #Grit\n\n-APTA",
    "score": 203,
    "url": "https://reddit.com/r/physicaltherapy/comments/1kjbqqb/newest_apta_update_got_this_newsletter_this/",
    "created_at": "2025-05-10T14:36:22.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1lyvlpf",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Dr told pt I called her suicidal",
    "text": "I’ve been working with this sweet but pessimistic 70 something year old in OP. She has been making jokes such as “I don’t want to live until August” “I’m moving in August and if I just didn’t wake up one day I would be happy” and some more each visit. I would try encouraging her and all the other things I am supposed to do but she kept it going. After she made 8 comments of death in 2 visits (and that’s just when I started counting) I consulted with some of our other therapists and called their doctor. SPECIFICALLY I SAID THIS “we have a common pt and she’s making jokes of about end of life. I do not believe she is serious about doing anything and they have their daughter and husband as caregivers right now. She’s moving in August and voiced stress about this. I just needed to notify you due to some medications she has started taking may affect this”. \n\nThe drs office called her and said “hey just got a call from your PT at ______ location. Heard you’re pretty suicidal right now. What’s been happening?” \n\nI’m pretty pissed at them for how they handled this and called me out for it. She came in yelling at me and said I embarrassed her. Very understandable. I was able to calm her down and get her to continue working with me but I just wanted to rant about how unprofessional some offices are. ",
    "score": 197,
    "url": "https://reddit.com/r/physicaltherapy/comments/1lyvlpf/dr_told_pt_i_called_her_suicidal/",
    "created_at": "2025-07-13T15:29:17.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1hofwvz",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "So many posts taken down",
    "text": "This sub has become almost unusable. \n\nAny post that isn’t complaining or the same question asked over and over again gets taken down. \n\nIt’s like the only thing allowed are posts complaining about how horrible the profession is or new grad advice. \n\nLegitimate topics like questions about practice acts or other providers asking about PT scope get taken down. \n\nWhat’s the purpose of this sub anymore? \n\nI’m sure this post will be taken down for some made up rule or called medical advice. \n\nEdit: this post got me banned. Ironic. \n\nSince I can’t respond to a mod slandering me. \nThis is absolutely untrue. If you don’t like me fine. But don’t ban someone then slander them. Be an adult. \n\n“He wasn’t banned for sharing his opinion, he was banned for being an asshole dozens of times and going through two separate temp bans as warnings to get him to stop, and still not doing it. He routinely calls people that disagree with him here bitches, clowns, mentally unwell, etc and refuses to abide by the sub rules.” u/aspiringhumandorito \n\nIf I’m so out of control why did it take me asking a simple question to get banned? It doesn’t add up. Just a reddit mod on a power trip. Maybe you deserve a ban for your current behavior. You’re in violation of the sub rules. ",
    "score": 192,
    "url": "https://reddit.com/r/physicaltherapy/comments/1hofwvz/so_many_posts_taken_down/",
    "created_at": "2024-12-28T21:33:59.000Z",
    "num_comments": 130
  },
  {
    "id": "reddit-1o8supk",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Kaiser PTs on strike, thoughts? seeing people calling it greedy since we are already being paid so much",
    "text": "Current Kaiser PT and I am going to admit that we make more than most of our outpatient counterparts. I have been seeing online that it is greedy of us asking for more money when we are 30 sometimes 50% earning more compared to our counterparts outside of Kaiser. \n\nI do sense resentment that we are making more compared to those who are definitely being taken advantage of, like PT mills and other places. \n\nBut on the flipside, this is what profession is striving for. Something (NOT APTA) that is fighting for increasing our wages and finally being paid what our degrees are worth.\n\nWhat are your thoughts?",
    "score": 191,
    "url": "https://reddit.com/r/physicaltherapy/comments/1o8supk/kaiser_pts_on_strike_thoughts_seeing_people/",
    "created_at": "2025-10-17T05:22:45.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1n7qx1y",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Burnt out",
    "text": "Just need to vent. I am 12+ years into my PT career, outpatient ortho, and pelvic floor for the last 5. I am so tired. Just weary on a deep, soul level, of being there for, empathizing, supporting, caring, encouraging, coaching patient after patient after patient. I am most distressed that I have no emotional energy left for my own family. Is this career supposed to suck this much???\nI have loved this work but I'm socially exhausted. \n\nEdit: After many prayers, tears, and discussions with my spouse, I have decided to leave my job. I'm very thankful to have accepted another offer and I will be returning back to general outpatient ortho and take an indefinite break from pelvic health. I love the specialty but I've realized I cannot be a pelvic health therapist on a traditional outpatient ortho schedule. My managers have been so amazingly supportive but all the things we've done to improve my work sanity are getting destroyed by my company being bought out and the new regime demanding more productivity. Our big boss thinks we can see 4 patients an hour. I fear they will turn this place into a patient mill, and turn my amazing manager into a stressed out micro-manager. But I have the option to leave. So I am leaving. My hope is to eventually start my own small cash-pay, high quality, holistic wellness and pelvic health PT service, where I can treat patients in a way that helps them optimally AND allows me to be sane and healthy. For now, this new job will be 1:1 general PT, three 10 hour days. I'm praying it will give me a much less emotionally demanding job and let me decompress and recover from burn out. Thank you all for such an outpouring of support and understanding!",
    "score": 190,
    "url": "https://reddit.com/r/physicaltherapy/comments/1n7qx1y/burnt_out/",
    "created_at": "2025-09-03T21:03:00.000Z",
    "num_comments": 144
  },
  {
    "id": "reddit-1ofufhl",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Not a PT - Just a Thank you &amp; gratitude!",
    "text": "I’m not a PT but a PT has changed the trajectory of my dad’s recovery and life so I wanted to just send an encouraging thank you to this profession. \n\nOn September 7th, my mom woke up to find my dad not breathing and without a pulse. She immediately called 911, and the dispatcher walked her through performing CPR until the ambulance arrived.\n\nOn the way to the hospital, the EMTs were able to resuscitate him with CPR and epinephrine, since he wasn’t shockable due to the lack of pulse. He was intubated immediately upon arrival and remained unresponsive, so they began targeted temperature management (cooling and rewarming) to help preserve brain and organ function.\n\nAfter 72 hours, he woke up and recognized me and my mom, and had movement on his left side, but not his right. A CT scan revealed that, on top of the cardiac arrest, he had suffered a brainstem stroke.\n\nHe spent 13 days in the ICU and was later transferred to the stroke unit, where he began physical, occupational, and speech therapy. His speech, swallowing, and cognition came back pretty quickly, but he was still very weak from both the stroke paralysis and being bedridden for nearly a month.\n\n\nDuring this time, the case manager applied for acute rehab. At first, he wasn’t approved because he was too weak. But one of the PTAs working with him asked one of the main rehab PTs to come evaluate him. Despite needing significant assistance, he was able to tolerate 45 minutes of activity.\n\n\nThat PT became his biggest advocate, and thanks to her pushing for him, he was approved for acute rehab. Now he’s making amazing progress, went from struggling to stand with assistance and now is down to minimal assistance with standing and transfers, and currently learning to walk again with a walker, and as of yesterday a cane! \n\n\nThis experience has completely changed how I see physical therapy. The compassion, advocacy, and belief that PTs have in their patients’ potential truly changes lives. Seeing how much of a difference it’s made for my dad has even made me consider a career change into this field, to help others the way these incredible professionals helped him.\n\n\nSo this is really just a thank you to all the PTs, PTAs, and OTs,  who look at the whole picture, who believe in recovery even when the odds seem stacked against someone. You don’t just help people heal, you give them hope and quality of life back.\n\n\n\n\n",
    "score": 189,
    "url": "https://reddit.com/r/physicaltherapy/comments/1ofufhl/not_a_pt_just_a_thank_you_gratitude/",
    "created_at": "2025-10-25T15:30:20.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1nlftuc",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Physician Perspective - DPT Didn't Go Far Enough",
    "text": "Hi all, interested in your thoughts on this.\n\nFrom the outside looking in, it seems like the pre DPT program was either a tough Masters or a short doctorate. PT leadership then made a small extension to call it a doctoral program, but, in doing so increased student loans without any commensurate increase in privileges or scope of practice. From the physician perspective, it seems one could debate if it was a 'cart before the horse' attempt to facilitate lobbying for those vs arguing it's a better representation of the rigor of the program, similar to a JD. Other countries, however, continue to have safe, effective, and (by all appearances) equivalent care given by Bachelors or Masters trained PTs, while in the US PTs now have more student debt and criminally low reimbursement rates (in many cases).\n\nHave PTs ever discussed basically extending the DPT further while also keeping a Masters PT.  \n\\- MPT: prior program - 2 or 2.5 years to become a Physical Therapist  \n\\- DPT: a 4 year + 2 year post graduate training period with a deeper dive into physiology, pathophysiology, pharmacology, imaging, sports medicine and rehab medicine alongside clinical clerkships and post-graduate work analogous to physician residency, where afterward PTs would work in a role similar to a Sports Medicine Physician or Physiatrist depending on their clinical track, with more privileges (imaging, prescription, etc). More in keeping with what optometrists have done relative to ophthalmology (eye doctor vs eye surgeon; it would be PT MSK doctor vs MSK surgeon). With that, they would have a higher salary (eg +$150k).\n\nClearly as a physician one wouldn't think me to be arguing for non-physician scope expansion, but if I try to be objective from the outside looking in I thought of that approach and it made sense to me, so I was curious on PTs thoughts. As it stands it seems like the DPT approach neither improves upon prior PT outcomes (correct me if I'm wrong) nor has it supported scope expansion or better reimbursement.",
    "score": 181,
    "url": "https://reddit.com/r/physicaltherapy/comments/1nlftuc/physician_perspective_dpt_didnt_go_far_enough/",
    "created_at": "2025-09-19T21:20:17.000Z",
    "num_comments": 108
  },
  {
    "id": "reddit-1ouhgs7",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Student Loans borrowers defense claim now that DPT is a graduate degree not a professional degree",
    "text": "I saw that based on the new Dept of Ed negotiated rulemaking they are defining what are “professional” degrees and what are “graduate degrees” and are setting loan caps based on these definitions. PT as of now is being considered a graduate degree and this falls under the lower loan caps of 100k total for program. I saw an argument was made that this may be enough for a borrowers defense claim as we were sold a professional degree as a DPT but the government is now classifying it differently. Thoughts?",
    "score": 138,
    "url": "https://reddit.com/r/physicaltherapy/comments/1ouhgs7/student_loans_borrowers_defense_claim_now_that/",
    "created_at": "2025-11-11T18:36:00.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1ird8g2",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Am I crazy to ditch my 250k/yr tech job to pursue DPT",
    "text": "Hi first of all, I’m really seriously considering this, so please be kind and open minded to hear this.\n\nI graduated undergraduate with business major and I have been in the field of business at quite reputable places for about 15 years now. I’m now  turning 40 years old in a few months. \n\nI have been so burnt out and unfulfilled from my tech sales job, so 5 years ago, I got certified as Pilates teacher and I have been enjoying teaching in person on the weekends. \n\nNow I feel like I want to help people recover from pain, rehab and I feel like as a Pilates teacher, my knowledge is too short to offer right hypothesis… \n\nI have been thinking of DPT schools but my friends family and even my PT’s say that it’s too much effort for too little money. \n\nIn my humble opinion, well trained PT’s are God sent gifts to humanity, who can directly improve the quality of life for clients.. \n\nI know I’m not too young, but if I invest 3 years to become DPT and I can do the work I enjoy until the rest of my life, I’d be happy.\n\nI have thought about DPT, PTA,….. not sure what other paths and options are. I sure am passionate about learning more so I can help people heal from pain.\n\nCould you please give me some advice? \n. \n\n*** A lot of you are saying no….thank you…\nWhat CAN I do then? To help clients more? Please recommend studies 🙏",
    "score": 122,
    "url": "https://reddit.com/r/physicaltherapy/comments/1ird8g2/am_i_crazy_to_ditch_my_250kyr_tech_job_to_pursue/",
    "created_at": "2025-02-17T06:08:23.000Z",
    "num_comments": 269
  },
  {
    "id": "reddit-1ijy8tp",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Is PT school supposed to be this terrible?",
    "text": "Does PT school really suck this bad or am I just in the wrong profession? I am almost done with my first year of physical therapy school and I hate it. I hate every second of it. I hate every class, I am not having any fun. I just want to know if this is a normal feeling for anybody who’s currently in or went through a DPT program or am I in the wrong place?",
    "score": 91,
    "url": "https://reddit.com/r/physicaltherapy/comments/1ijy8tp/is_pt_school_supposed_to_be_this_terrible/",
    "created_at": "2025-02-07T15:57:27.000Z",
    "num_comments": 130
  },
  {
    "id": "reddit-1nlogk7",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "What do you wish was allowed in the scope of DPT practice?",
    "text": "Fellow PTA here with a bachelor’s in health management, who decided going into $100,000 dollars of debt didn’t make sense for the ROI and limited scope for a doctorate degree compared to other doctorate degrees in medicine. Here are things that personally would have made my decision easier to be a DPT: \n\n1. Direct billing with no required referral/orders from a provider to initiate a therapy evaluation or receive reimbursement. \n\n2. Ability to order DME and imaging directly through insurance. \n\n3. DPT expertise alone should be enough for insurance authorization (most insurance companies still require referral for authorization or PCP for appeal process with peer to peer).\n\n4. Built in curriculum to be able to read diagnostic imaging (related to MKS) and make diagnosis, referrals to ortho, and plan of care based on this information. \n\nWould love to hear more what you wish would be a part of the scope of practice for DPT. \n",
    "score": 71,
    "url": "https://reddit.com/r/physicaltherapy/comments/1nlogk7/what_do_you_wish_was_allowed_in_the_scope_of_dpt/",
    "created_at": "2025-09-20T04:11:38.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1p3w0vy",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Can we get a monthly income/student debt thread going here.",
    "text": "I make 45 an hour as a 2nd yr DPT. My pay/loan ratio is $5,637/$1,654 a month after taxes and withholdings. Health insurance through wife's company.",
    "score": 65,
    "url": "https://reddit.com/r/physicaltherapy/comments/1p3w0vy/can_we_get_a_monthly_incomestudent_debt_thread/",
    "created_at": "2025-11-22T15:30:49.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1i50nux",
    "subreddit": "physicaltherapy",
    "soc_codes": [
      "29-1123"
    ],
    "title": "Picking X-ray/MRI tech over Doctor of Physical Therapy",
    "text": "I just finished a bachelors in Health Science with a concentration in Allied Health and got accepted to UConn DPT. Is it backwards and stupid to pick a 2 year X-Ray program and eventually train into MRI over Physical Therapy?\nReasons I did this:\n1. COST \nPT program I got accepted to in Connecticut starts at 100k in tuition alone and that’s not even considering the cost of living loans I need to take out if I am not able to work.\nThe X ray program is less than 30k altogether and I think I would be able to work a lot more considering I have 24 of the required 77 program credits to graduate. \n2. PAY (As of May 2023 in Connecticut)\nAccording to the BLS: DPT make between 75k and 130k.\nX-ray techs make between 57k and 110k\nMRI techs make between 74k and 119k\nIt’s really disappointing to see that a doctorate degree in healthcare caps at 130k \n3. Current Living Situation\nI currently live with my fiancé and obviously have bills we need to pay. Most PT students I know either take out loans, have rich parents, or are single. \n\nUPDATE \nI ended going the X ray route. I have also learned that I can teach in a radiography program after 2 years of clinical experience. It makes me feel a little better about getting my bachelors out of my way. ",
    "score": 65,
    "url": "https://reddit.com/r/physicaltherapy/comments/1i50nux/picking_xraymri_tech_over_doctor_of_physical/",
    "created_at": "2025-01-19T15:15:49.000Z",
    "num_comments": 82
  }
]