[
  {
    "id": "reddit-1k0jiey",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Contractor unhappy with my work.",
    "text": "So I do new build rough in and finish plumbing for residential mostly. I’ll be testing in to get my license this year as my partner is retiring but we do so much more as a company like full on whole home renovations so I’m not constantly plumbing.   Anyways, contractor was supposed to supply hot water heater but didn’t til after I roughed in all the supply and he originally didn’t want to do a recirc system so instead I ran individual lines to the master, laundry and 1/2 bath that is directly above this water heater. The runs are like 20’ or less ensuring hot water quickly.  He then buys hot water heater with recirc so I ran a return line from the upstairs bath and would’ve prolly just did a single 3/4” line throughout but that is no longer an option. \n\nSo at this point I’m just having fun making a nice custom manifold bc this is where we’re at and he criticizes everything about it. How it’s completely unnecessary and I shouldn’t have done any of that and how if he hires me again he doesn’t want any of that. It’s a waste of time and materials and then he says how crazy my stack is and how it should’ve been done different. How I took up too much room and now the electricians don’t have room for a panel. Mind you there are like 3 other walls that are better options in this same room.  \n\nIn my opinion, if there’s a problem with the water system, this manifold allows you to isolate the problem and gives you time to fix it without shutting down the whole system.  He also criticized me for stubbing out in copper. \n\nHis last plumber stubbed out in pex and ran the supply and drains up through the floor instead of the wall. \n\nI’m definitely not the best plumber but I did most this job on my own as my partner (master plumber) was out of town. \n\nAny constructive criticism from some pros would be helpful. Always trying to improve.  \n\nBtw, we passed our inspections. \n",
    "score": 11614,
    "url": "https://reddit.com/r/Plumbing/comments/1k0jiey/contractor_unhappy_with_my_work/",
    "created_at": "2025-04-16T12:44:58.000Z",
    "num_comments": 1879
  },
  {
    "id": "reddit-1nh819y",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "UPDATE: Today is fucked",
    "text": "Thought I’d pass on an update and a couple stupid things I did to my last post. If you saw it, you probably laughed at my misfortune. If you didn’t, knock yourself out: \n\nhttps://www.reddit.com/r/Plumbing/s/xSUy7CvbBk\n\nPlumbing was completed today. Took me two hours. 25’ of pipe that I somehow maneuvered into the existing hvac/plumbing/framing in 5’ increments. \n\nLike a true fucking man, I inhaled some glue, rubbed some primer in my wounds, told the kids to treat the wife well, and put on my mask. Because like many of you said, it smelled like shit. \n\nFYI, primer in your armpit feels weird. I don’t know how it dripped there but I was a contortionist on that ladder. I would try it again, but it’s not really that great. \n\nNow for the details:\n\nThere was a a ton of grease on the sides and top of the pipe. My guess is someone had better luck with a small snake in the past then I did and water has been traveling that path for the last 3.5 years. I obviously fucked that up with draino. \n\nNow it’s time to laugh at my misfortune. I forgot to mention that before I got the draino and snake, I was dumping near boiling water down the drain, waiting a minute, and sucking it up with a shot vac. I repeated that a dozen times until I heard gurgling. In my excitement, I stuck my head down there expecting it to drain. Instead I was greeted with an explosion of hot water and grease to my face and thighs. \n\nI’m fine, I once tried to find a propane leak with a lighter. 2nd degree burns on my face so my skin has some resilience. Yea, I’m an idiot and yea, I was drunk. \n\nI also tried plunging the sink and blew out the garbage disposal. I really have no idea what the fuck I did, but I somehow manhandled that thing to a constant leak. So there went a $120. I also tried an air compressor down the cleanout, but that didn’t accomplish much of anything. Which sucked cause I thought it was a brilliant idea. \n\nFor those of you that said raccoon shit was in the ceiling, not dog shit, you’re probably right. I found a hole in the OSB that is currently covered by siding. Of course there’s no house wrap there, either. Someone before me obviously was bedding down with those fuckers. Lucky for me, my dogs tree em and they rarely come around. \n\nBecause I’m not a fucking electrician, I swept up my mess when I was done. I’m also not a plumber, so I busted a pipe trying to snake a drain. Take that for what you will. \n\nAnyways, don’t be an idiot. Don’t run a snake for 4 hours. Maybe stay away from draino. And if you have a shot vac, air compressor, a 25’ snake, a 50’ snake, and some boiling water all in the kitchen- maybe stop and call a plumber\n\nAnd for those of you that asked about the grow tents, my wife’s weed is fine. Which is good, otherwise I would probably be in the middle of a divorce writing this. ",
    "score": 2876,
    "url": "https://reddit.com/r/Plumbing/comments/1nh819y/update_today_is_fucked/",
    "created_at": "2025-09-15T00:51:47.000Z",
    "num_comments": 186
  },
  {
    "id": "reddit-1l0rpkb",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Boss man wanted a tankless heater upgrade, told him I’ve got it covered.",
    "text": "Used to be a full-time plumber but currently an apprentice electrician. \n\nBeen re-plumbing my new boss’s house with a former apprentice of mine during his remodel over the last few months. All new waste and waters to two upstairs bathrooms, added HW returns to each of them, cleaned up a ton of old piping in the crawl space…all kinds of fun work. \n\nYesterday was tankless install day, nothing beats a smooth install and start up. \n\nNow go ahead, tell me everything I did wrong…",
    "score": 2782,
    "url": "https://reddit.com/r/Plumbing/comments/1l0rpkb/boss_man_wanted_a_tankless_heater_upgrade_told/",
    "created_at": "2025-06-01T15:29:03.000Z",
    "num_comments": 656
  },
  {
    "id": "reddit-1ngbr1a",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Today is fucked",
    "text": "While snaking a kitchen drain, I busted through an elbow. Wild thing is the hose, not the attachment rubbed a hole in the elbow. I guess that’s what happens when you run a snake for 4 hours slowly advancing through a wall of grease. \n\nNow I have a room covered in grease/water, holes in the ceiling of two rooms, and it gets worse. \n\nNot only have I not found the end of the clog- all of this is solid grease, but I now have two parallel hvac boxes directly under the pipe. \n\nIn order to get access, I cut a large hole off to the side so I could reach over the hvac only to have a mountain of mouse shit fall on me. \n\nSo I went to cut on the other side, and I shit you not- dog shit? Falling from the ceiling. \n\nI have lived here 3.5 years. Why the fuck is there dog shit in the ceiling. It’s a super nice house. I’m so unmotivated right now and my house is literally on the market. \n\nThis kitchen sink has never clogged until recently. I don’t dump grease down there. I had a slow drain and dumped a bottle of draino down there. My guess is the draino softened grease until it clogged the last path. \n\nSecond to last pic is a turd staring at me. \n\nFuck this shit I should have called a plumber. ",
    "score": 2647,
    "url": "https://reddit.com/r/Plumbing/comments/1ngbr1a/today_is_fucked/",
    "created_at": "2025-09-13T23:17:57.000Z",
    "num_comments": 376
  },
  {
    "id": "reddit-1ktlf1l",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Question - how wrong is it if my bathtub overflow does not swallow any water?",
    "text": "EDIT1: RESOLVED - see end of post for resolution :D \n\nIn a new house, I just noticed that our bathtub overflow does not take in any water. Meaning, we can fill it up even over the overflow and the water is just steady, there is no drain effect.\n\nFurthermore, there is weird noise to be heard under the tub - lie some water doing something.\n\nAttaching video for the purpose of the noise - put volume up and you will hear it!\n\nWe are still under warranty and am filing this issue with them today.\n\nWhat could this be?\n\nIs this necessary an error when installing, or can they just brush me of saying \"that is the way it is supposed to be.\"?\n\nAny advice?\n\nWhat shall I expect?\n\nWhat shall I be careful about?\n\nCan there be damage anywhere below the tub because of this?\n\n  \nEDIT2: RESOLVED! It was the putty in the drain hole ... first plumber came over twice and was persuading me I do not understand physics ... third visit was by another plumber from same company who actually installed the tub and he found the problem in 2 minutes. Hope he shamed his colleague at least a bit. I lost too much time on this. \n\nFunny thing is - drain could work faster, hole is still too small to take all water as it pours into tub (overflow). ",
    "score": 2296,
    "url": "https://reddit.com/r/Plumbing/comments/1ktlf1l/question_how_wrong_is_it_if_my_bathtub_overflow/",
    "created_at": "2025-05-23T14:47:36.000Z",
    "num_comments": 411
  },
  {
    "id": "reddit-1k8xser",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Is this legit/legal?",
    "text": "A few days ago, a plumber (sent by my landlord) came to my apartment to fix a leaking pipe in the apartment below. Turns out the leak was coming from the apartment above mine. Plumber fixed a  new pipe to redirect the problem right on our kitchen walls and we can now hear every time the upstairs neighbours use their washroom/kitchen sink (unsure which).  \n\nI've never seen anything like this and would love some opinions on the soundness/legality of something like this. Landlord is ghosting me. \n\nThank you!! \n",
    "score": 1988,
    "url": "https://reddit.com/r/Plumbing/comments/1k8xser/is_this_legitlegal/",
    "created_at": "2025-04-27T06:50:14.000Z",
    "num_comments": 234
  },
  {
    "id": "reddit-1ow9i1a",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Can't believe I didn't do this a while ago",
    "text": "So whenever I needed to shut off water in the house (either for vacation reasons or for maintenance/etc) I felt like I had to apply the power of Odin to my shutoff valve (bottom of the first picture) just to turn the stupid thing. It's 20+ years old and the original builder special.\n\nAfter advice from this group, I finally decided to get a plumber in to properly install a ball valve shutoff just past the meter. I'm leaving the old shutoff before the meter alone since I'm not really allowed to mess with it anyways. It will just stay in the on position from now on.\n\nNow, shutting off the water isn't a worrisome event and it's super easy to use.\n\nI know this is super basic and I'll probably get downvoted here but I wanted to say thank you to people for their advice and not shaming me with such basic questions.\n\nEDIT:\n\nI got some great comments below and just want to clarify:\n\n1. I have a shutoff valve outside but only the city can touch that one\n2. I have a shutoff valve just before the meter in the picture above. That one is just tough to use so i wanted an easier way. Hence, adding a ball valve down the line after the meter.\n3. If I want to replace the valve before the meter, I will need to get the city and come and shut off the water at the curb, do the work, then call them back out again. So I will be without water for a couple days at a minimum.\n\nHope this clarification helps.\n\nEDIT2: Forgot to update with the bill. Came to CAD$360-ish inclusive of taxes. I know this is basic for many of you but this was great peace of mind for me.",
    "score": 947,
    "url": "https://reddit.com/r/Plumbing/comments/1ow9i1a/cant_believe_i_didnt_do_this_a_while_ago/",
    "created_at": "2025-11-13T18:52:51.000Z",
    "num_comments": 242
  },
  {
    "id": "reddit-1mcpapw",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Went to Mount a shelf in my upstairs bathroom and accidentally drilled into what I think is the sewage vent. Advice appreciated.",
    "text": "Hey all, sparky here and I'm feeling pretty silly. Long story short I tried mounting a shelf in our bathroom and drilled into what I can only guess is our sewage exhaust. It's in the upstairs bathroom so there is no flow coming down from above the holes (as far as I'm aware, I'm no plumber). All I able to just putty the holes or something? Should have trusted my gut when the stud finder gave an off reading, definitely should have trusted it on the first hole when it felt like I drilled into something on the other side of the wall..",
    "score": 529,
    "url": "https://reddit.com/r/Plumbing/comments/1mcpapw/went_to_mount_a_shelf_in_my_upstairs_bathroom_and/",
    "created_at": "2025-07-29T22:15:35.000Z",
    "num_comments": 322
  },
  {
    "id": "reddit-1il4llc",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Solo operators - wanting input from guys running one truck companies",
    "text": "I'm hoping to start my own shop by the middle of 2026 at the latest. My Dad ran a one man shop (plus occasional help from myself and a younger brother) for about 15 years, so I'm fairly familiar with the benefits and headaches of the work. \n\nI'm currently working as a Union pipefitter, but got my journeyman plumbing license two years back and am going to be taking the master license test this Spring. I'm wanting to transition to residential work so that I can stop traveling.  I have a finance background, so I should be able to hold my own on the paperwork end of things.\n\nI had a few questions for any who also run one truck shops: What does your average work week look like? How much of your time do you work a week vs. what are you able to bill? Is there a particular type of job or set of jobs you prefer or avoid? What type (if any) of marketing do you use or did you use to start or grow your business? How long did it take you to grow your business to sustain at least 40 hours of work a week?\n\nI'd greatly appreciate any input,  thanks.",
    "score": 35,
    "url": "https://reddit.com/r/Plumbing/comments/1il4llc/solo_operators_wanting_input_from_guys_running/",
    "created_at": "2025-02-09T02:36:00.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1nacl31",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Net Worth being a tradesman",
    "text": "Remove if this goes against guidelines \n\nSo this is something I see in threads from other professions (Engineering,Finance, Doctors,Etc) where someone posts that they’ve hit X net worth after being in their field for x amount of years, then others comment their story.  At the end of the day, we work hard as plumbers for our money &amp; it seems like the sky’s the limit in this trade if you have a decent head on your shoulders. \n\nI don’t see much on here about finances (I’m aware it’s a personal topic) past the hourly rate/salary threads. \n\nI’m curious if anyone would like to share what they’ve accomplished financially, not just us plumbers but being a skilled tradesman. Whether self employed, employee, or union. \n\nI’ll start- \n3rd year plumbing apprentice at small mom &amp; pop shop in the north east. \nRoughly $70k NW, no debt. \n60% IRA/401k/Brokerage \n40% savings \n\nFeel proud of what I’ve put away but I’m aware I have a long way to go.",
    "score": 13,
    "url": "https://reddit.com/r/Plumbing/comments/1nacl31/net_worth_being_a_tradesman/",
    "created_at": "2025-09-06T22:22:10.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1hn5nzs",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Considering a plumbing apprenticeship.",
    "text": "Hi all, so backstory here is important for context I think. I am considering a career change/addition into plumbing. I am 31F, currently own a nail salon with employees and realizing that I don't think it will ever be lucrative enough to give me a decent salary and I have been literally suffering for the last 6 months with no end in sight. The salon is sustaining itself but I can't pay myself and there isn't much change in sight when we are coming up on yet another typically slow season. I need to be able to support myself and have something to fall back on in tough times as I don't have a any extra help from anyone.\n\nNow, the reason I am considering plumbing is - first, my whole family and partner are in the trades (none are plumbers though) and are encouraging me to do it and I'm genuinely interested in it. Plumbing specifically seems right for me because I am not squeamish when it comes to gross things (I look at feet all day) and before I purchased the salon, the former owners told me one of the reasons that they offered the salon to me first was because I fixed all of the plumbing problems that came up in the salon - clogged drains and toilets, and a leaky sink. I know those are super basic but the way pipes go together just seem to make sense to me and it felt so amazing to be able to make those simple fixes for everyone. In my profession now I basically consider my title to be \"troubleshooter\" and I'm very detail oriented. I'm also just a person that can't stand to wonder \"what if?\" so I like to try to take advantage of opportunities that present themselves...\n\nI was browsing a few days ago and found that my local union is opening up the apprentice application process in the next couple weeks which seems a bit timely? But I have no idea how it works as the people in my life in the trades never went through this type of apprenticeship.\n\nI just want to hear from others that have gone through an apprenticeship, especially with a union and/or women in the trade.\n\n\\- I would need to transition from my current role, Does anyone know how long the application process takes? Does it vary?\n\n\\- Are apprenticeship schedules flexible in any way? \n\n\\- What daily schedule (shifts) do apprentices expect to have? Days per week? I understand that most people want to get it done as fast as possible and put in as many hours as they can but, is it at all possible to do it part time at the beginning? or would I have to prepare my salon for my full absence? \n\n\\- Has anyone else had another job while doing an apprenticeship?\n\n\\- Is this completely ridiculous for me to consider? I do assume journeymen may look at it as a waste of time to train someone part-time, even though that would be temporary and I truly would be dedicated. I just also have this other obligation at the moment. \n\nI'm planning on finding these things out when I go to apply soon but I'm just trying to figure out ahead of time if this could ever work logistically.\n\nAny and all additional info/advice is welcome. Thanks in advance. ",
    "score": 4,
    "url": "https://reddit.com/r/Plumbing/comments/1hn5nzs/considering_a_plumbing_apprenticeship/",
    "created_at": "2024-12-27T03:20:57.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1klhmi8",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Tools",
    "text": "Hello I am a pipefitter 1st year apprentice but still come across recently and will in the future a lot of copper pipes. I am looking to invest in pipe  cutters for my apprenticeship that will stand the time and are quailty for 15MM, 22mm and 28mm copper. Would you guys have any recommendations \n\nAny help appreciated ",
    "score": 2,
    "url": "https://reddit.com/r/Plumbing/comments/1klhmi8/tools/",
    "created_at": "2025-05-13T09:29:00.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1opg6qq",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Local 32 Seattle area apprenticeship questions",
    "text": "Hi, like the title states, I’m hoping I can get in contact with someone who can answer some questions about the apprenticeship for pipefitter/plumber apprenticeship in the Seattle area. Ideally, someone who has gone through, or is currently in that apprenticeship. \nBasically, I’m 35, been working in healthcare for 12 years and have been wanting a career change for some time. I’ve always been interested in the trades, particularly plumbing and I’m also pretty mechanically inclined. I’ve done a whole lotta car work, including some fairly big jobs. \nAnyway, I know I’m going to take a pay cut initially and I’m aware I can check the pay scale to see what I can expect in that department, but I have questions about the Seattle apprenticeship. I’d like to know more about the daily schedule in terms of class and real world work, where most of the jobs are (I live in Tacoma and I know the training center is in Renton), the interview process, things like that. Any help would be much appreciated. Thanks!",
    "score": 2,
    "url": "https://reddit.com/r/Plumbing/comments/1opg6qq/local_32_seattle_area_apprenticeship_questions/",
    "created_at": "2025-11-05T21:41:33.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1k32sfk",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Questions on Plumbing School",
    "text": "Hello,\n\nI read the rules and didn't see anything about asking for school advice, but if it's an issue, I can delete this post. After years of attending community college at 26, I finally decided to pursue a trade, and I wish I had done this sooner, but I'm trying to better myself. What I'm here for is to ask questions about the plumbing field. So, I applied and got into a 9-month plumbing program at a trade school, and I was looking around to plan for my future, if I get to the point where I finish. Every time I look up information, I seem to get more confused than the last time. So my questions are:\n\nFYI I'm located in Illinois\n\nWith the trade school, I get a certificate and I can take that anywhere, but if I join the union instead of trade school, do I get a certificate that I can go anywhere with or is it only for that local?\n\nIf I finish trade school and go into the union, will I start at a higher percentage than those who didn't go into trade school? Say, instead of starting at 30%, will I start at 40% or 50%?\n\nWhile I attend school, should I apply for the union? I know it can take months to find out if you get in, but I fear that if I do, I will have to take more classes on top of going to trade school. Will that make the journeyman process faster, or will it benefit me in any way by going to school and taking classes for the union?  \n\nHow many years of apprenticeship do I actually have to do? I see 2-4, 4-5, just so many different years that I just don't know. \n\nSay, I finish school and get into the union, can I choose if I want to be a plumber or a pipefitter? Can I choose residential or commercial? I've worked in maintenance for about 5 years, and I like building new, but I enjoy fixing and seeing my work weeks, months, and years later, still working. \n\nMy last question... maybe. Say I go non-union, does the process work the same? \n\nThis is a lot and I apologize!  Every day I'm thinking of new questions, but I'm in that mindset of it's late for me and I should've finished school sooner, because I had goals and I'm either not going to reach them or wait longer to do so and it brings all these anxieties. ",
    "score": 2,
    "url": "https://reddit.com/r/Plumbing/comments/1k32sfk/questions_on_plumbing_school/",
    "created_at": "2025-04-19T18:23:06.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1lmj17k",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Need help for plumbers union interview",
    "text": "23M Need advice for local 38 plumbers &amp; pipefitters union, passed the test and the interview is in 2 weeks \nI have no experience in plumbing, I’ve worked a few manufacturing jobs and food service\nI’m curious about what questions they’re gonna ask me and I’m pretty nervous to be interviewed by like 6 people",
    "score": 2,
    "url": "https://reddit.com/r/Plumbing/comments/1lmj17k/need_help_for_plumbers_union_interview/",
    "created_at": "2025-06-28T09:50:44.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1id62zw",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "How often do salaries for plumbers fluctuate over time? Why do plumbers get paid so much in the pacific north west?",
    "text": "I have been thinking about becoming a plumber, I noticed that in the state where I live in they make a lot of money for some reason? When ever I try to google how much a specific job gets paid I always get very inconsistent answers but in my area they make between 60-90+k a year which sounds like a lot for a trade profession that does not require a college degree. Heck when I called my local plumbing union which is 290 tech they told me a beginning plumbers apprentice with no experience makes about 23 dollars an hour. I went to college for like a year for a drafting certificate and my first job with that paid me about 18 dollars an hour. Also the guy I talked with on the phone at that plumbing union told me that training does not cost any money all I have to do apparently is \"pay my dues\" which sounds too good to be true tbh. Doing trade apprenticeships sounds so much better than going to college it kind of makes me wish that I didn't. But then I wondered how often do salaries for plumbers change over time? Google told me the average amount of money a journeyman plumber makes is about 43 dollars an hour which is a lot, but in other states plumbers get paid like between 40-50k a year. Why does my region which is the pacific north west gets paid so much compared to others which is fewer and can that radically change over time? Do salaries for trade professions change more radically than salaries for jobs that require a college degree? Also I am from Oregon.",
    "score": 2,
    "url": "https://reddit.com/r/Plumbing/comments/1id62zw/how_often_do_salaries_for_plumbers_fluctuate_over/",
    "created_at": "2025-01-29T22:07:01.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1nvavc1",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Plumbers/Pipefitters Union",
    "text": "26 y/o male looking for a career change. I'm currently looking into joing the military or joining my local Plumbers/Pipefitters Union. For those of you that are union plumbers, how has your experience been?\n\nWhat do you like and not like about it?\nDo you get enough work year round to make a living?\nHow's your quality of life/ work life balance?\n\nFeel free to add anything else that should noted. Thanks!\n",
    "score": 1,
    "url": "https://reddit.com/r/Plumbing/comments/1nvavc1/plumberspipefitters_union/",
    "created_at": "2025-10-01T15:11:22.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1leszto",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Seeking advice on Domestic water boosters for my condo building",
    "text": "I would like to preface this by saying that Im a union pipefitter, so I know a bit about piping and pumps, but I am on the construction side, not service. \n\nI currently live in an 4 year old 8 unit condo building with an HOA. Our existing booster pump is so loud that it had to be turned off. I could hear it in my unit on the top floor, and was driving the folks on the first floor nuts. WIth it being off it takes me over a minute to fill a 1 gallon watering can, which drives me nuts.\n\nIm reaching out to a few of the vendors I work with for solutions, but most of these guys work in much larger scale. The one quote I got back was for a Hyfab eMVPjr Simplex Booster Pump Package, which at $8k, will be a tough sell to the HOA, and is fairly large for the undersized room the booster has to sit in.\n\nI was looking at some of the Grudfos boosters with integral VFD which I thought could really help do the soft start, but I honestly have no experience in picking pumps myself as I work all plan and spec. \n\nI was hoping someone with more experience could help provide some insight. Im still reaching out to some other vendors hoping they can  help as well. ",
    "score": 1,
    "url": "https://reddit.com/r/Plumbing/comments/1leszto/seeking_advice_on_domestic_water_boosters_for_my/",
    "created_at": "2025-06-18T21:21:22.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1o7iky4",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Indirect tank heat exchanger has a hole in it and boiler water has been mixing with potable water-how bad is this for the boiler/hydronic system?",
    "text": "During a routine service to my oil fired boiler (cleaning, filter change, combustion check, etc…) the tech noticed abnormal pressures and ended up placing the pressure relief valve on the boiler which had corroded shut.  After that he was still noticing excessive pressure and ended up isolating the indirect tank which then caused pressures to become normal.  The potable water (pressurized by my hydro pneumatic tank-I am on a well) was pressurizing the hydronic system via a hole in the heat exchanger.  \n\nLuckily I have plumbers/pipefitters in the family so replacing the tank is no big deal, but what should I do about the potable water infiltration into the hydronic system?  Flush it?  Check chemistry and just make sure pH and hardness are good?  I’ve been in the house eight years with zero issues.  The boiler (Buderus) and tank (Bradford White 46 gallon) were installed in 2004.  ",
    "score": 1,
    "url": "https://reddit.com/r/Plumbing/comments/1o7iky4/indirect_tank_heat_exchanger_has_a_hole_in_it_and/",
    "created_at": "2025-10-15T18:11:55.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1hqkvll",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Work/Life Balance--How Flexible is Scheduling as a Journeyman or later?",
    "text": "Current ambition is a union apprenticeship (UA 60) but I had some questions for the community I don't want to ask at the union.\n\nNo issues with working 40/50+ hr weeks during the 5 years of apprenticeship while I'm learning, but I'm curious--as a Journeyman or in later stages of the career, once I have some training and experience under my belt, how viable or common is it to request with the company to work fewer hours or, alternately, to take off a couple months a year? I know a lot of folks work 4 10's, and that seems look a great set-up to me, but honestly I'm totally spoiled with my current schedule working \\~30 a week and I want to be able to comfort myself as I make the transition to trade work by dreaming that this may be possible again a few years ahead in the future. Is it feasible to request a shorter work week or a stretch of time off if I don't need the money of working full time all year? Does anybody do this? I'm sure this is all case-by-case to some extent, but do most folks need to be already in business for themselves before they can properly negotiate their hours or work on their own schedule? I'm sure there's no set standard for this, just asking for everyone's experience.\n\nI don't feel comfortable asking these questions at the union because I don't want to seem lazy or unambitious--but, to be honest, a lot of the appeal of trade work for me is to work hard to put myself in a position where I may be able to create my own schedule. Plumbing seems like it could be perfect for this because there is such a good market for the work, but I don't really have a good understanding of how everything works. At what level of experience would setting my own schedule change from a pipedream (ha) to something actually feasible? Would the pipefitter path or other trade paths make this more or less possible?\n\nThe more experience you get, the more your time is worth, so it seems like there's a natural incentive structure to stay busy the longer you've been in the field; I'm wondering, then: is it unheard of to cut back on hours into something more part time once establishing yourself in the career? Is this something that's only feasible if you're working for yourself, or can you establish yourself as a Journeyman and then market yourself to a company as someone who wants to have limits on their scheduling? Is this more possible at the Master Plumber level?\n\nMy gf works remotely and no kids in the plans, and honestly our habits and lifestyle are such that we spend very little money. I'd love to work hard at the profession and find myself in a position where I could arrange with a company to take a couple months off a year so we could travel, or, alternately, to have a flexible weekly schedule because I have a lot of interests and hustles that I would like to devote time to outside the work week. Does anybody do this sort of thing after their apprenticeship?",
    "score": 1,
    "url": "https://reddit.com/r/Plumbing/comments/1hqkvll/worklife_balancehow_flexible_is_scheduling_as_a/",
    "created_at": "2024-12-31T18:31:40.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1mxngcu",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Best tools specifically for service work.",
    "text": "I'm flopping from industrial work (as a pipefitter) to residential plumbing next year. I have a ton of the tools you'd expect coming from heavy industry (pipe, combo, and ratchet wrenches, small, medium, and large channel locks, assorted screwdrivers, Allen sets files, various vice grips, all of the basic power tools) as well as some tools more oriented towards residential plumbing (pex cutter and crimp tool, tubing cutters, a basin wrench, water meter wrench, mapp gas torch, multimeter).\n\nI'd like to start collecting the tools I'll need to use in service work. Things like a sink wrench (is Ridgid's the best?), maybe a ferrule puller, cartridge puller. Hoping to get feedback on excellent tools that are common in the service world, but not as common elsewhere.\n\nThanks in advance, really looking forward to seeing your recommendations.",
    "score": 1,
    "url": "https://reddit.com/r/Plumbing/comments/1mxngcu/best_tools_specifically_for_service_work/",
    "created_at": "2025-08-23T00:39:02.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1im9b1c",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Merging with a Master Plumber",
    "text": "We are a growing HVAC crew that does a good amount of work with a local plumber.  He’s a one man in a van type company and we are his biggest (also only) clients.  He’s a great guy, personable, smart, does great work… everything you’d look for in a subcontractor.  \n\nHis costs are rising as are ours. Our plumbing division is only 4-5% of our total revenue but it’s steady and increasing.  Of this revenue, the plumber charges us nearly 60-65% to do the job and we cover equipment costs (2024).  We also directly employ his helper/apprentice. So our margins on plumbing are nearly zero with this set up.  Coupled with the fact he is always late on sending us invoices (by multiple months), and we already have plumbing as part of our umbrella insurance plan… it’s essentially a negative to keep him going. \n\n\nAt this point, we are getting to a crossroads. Dropping our plumbing altogether to protect our HVAC margins from this plumbing hole, or offer to buy out the plumber and have him become a full time employee. If we drop him, I’m sure he would be able to keep going and stay busy with other work.  I’d rather not drop him though given we like the guy.  \n\nEconomically, it makes more sense for both parties to merge.  That’s the outcome I would like to see. However, the plumber is very independent. It’s partly why he is a one man in a van. He likes setting his own schedule and living on his terms.  A merge wouldn’t need to change that.. I mean, that’s how he operates now and it’s not impacting how things are done. \n\nWe would take on all the admin duties, absorb any insurance he has to pay out, can offer him a better salary than what we pay him currently, cover his overhead… bringing him in the fold would then help protect our hvac margins a bit better. We could hire more people for him and it could be a good deal for everyone. \n\nI am just not sure how to approach the subject.  What are the bottlenecks or pinch points that could trip up this type of arrangement?  He is making out pretty nice already not taking on any equipment costs.  But he’s also a 1099 subcontractor, he has to do all his paperwork on his own. He has his own insurance and taxes and all that good stuff… the stuff he doesn’t really like or want to do.\n\n\nAny thoughts on how to entice the guy to selling out and just joining our crew full time?  ",
    "score": 1,
    "url": "https://reddit.com/r/Plumbing/comments/1im9b1c/merging_with_a_master_plumber/",
    "created_at": "2025-02-10T15:54:29.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1l37ose",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Jarboes in Louisville KY?",
    "text": "Anyone have any experience with salaries? Offered a job there and interest in what actual earnings are. Would like to go off on my own in a couple years but need a some stable income for now.",
    "score": 1,
    "url": "https://reddit.com/r/Plumbing/comments/1l37ose/jarboes_in_louisville_ky/",
    "created_at": "2025-06-04T14:57:09.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1j2tkma",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Looking for answers to some questions (any answers appreciated)",
    "text": "Hello, I am currently in a government program called Vocational Rehabilitation, which is a program to help those with disabilities to achieve employment. I want to be a plumber. One of the tasks I need to complete is to interview a few plumbers, but I unfortunately only know one plumber in real life. I was wondering if anyone here could help me answer some of my assigned questions. These should be based on your experience as a plumber. If there is other advice I should know beforehand, please do tell me. I don’t think this is against the rules but please do inform me if it is.\n\n1. How long have you been a plumber?\n2. What types of tasks do you do in your job?\n3. What does your day look like?\n4. What are the physical demands of being a plumber?\n5. What are the mental demands of being a plumber?\n6. What is the ideal candidate for this career?\n7. What are the employer's expectations?\n8. What is the work environment like?\n9. What are the typical work hours for this job?\n10. What are the qualification requirements that you needed to become a plumber?\n11. What skills are required of plumbers?\n12. What degrees, certifications or licenses are required to be a plumber?\n13. What kinds of other jobs/promotional opportunities could this job lead to? (I don’t know what this means)\n14. What is the beginning salary and salary range?\n15. What are the employee benefits (e.g. medical insurance, vacation, leave)?\n16. Would there be any background checks required for this job?\n\nAny answers are appreciated.",
    "score": 1,
    "url": "https://reddit.com/r/Plumbing/comments/1j2tkma/looking_for_answers_to_some_questions_any_answers/",
    "created_at": "2025-03-03T21:11:45.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1ls2meh",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Wanting to become plumber at 21 .",
    "text": "Hey what’s up guys. I’m 21 years old and located in San Antonio, Texas. I’m a hardworking, hands-on learner who picks things up quickly and is eager to learn a new trade. I come from the collision industry, which I’ve been in since graduating high school, but I’m ready for a change. I’m highly interested in becoming a commercial plumber.\n\nI’ve already applied and gone through the interview and math assessments with Local 142 Pipefitters &amp; Plumbers Hall, but unfortunately, I didn’t get accepted. Right now, I’m working in a Commercial fab shop company that the union referred me to. I’m seriously considering getting into a commercial new construction plumbing company as a helper so I can start learning the UPC code and get hands-on experience. Later down the line, I’d like to transition into residential service work.\n\nWould this be the best path to take? I’d really appreciate any advice from my fellow plumbers out there!",
    "score": 0,
    "url": "https://reddit.com/r/Plumbing/comments/1ls2meh/wanting_to_become_plumber_at_21/",
    "created_at": "2025-07-05T05:42:06.000Z",
    "num_comments": 5
  }
]