[
  {
    "id": "reddit-1k0jiey",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Contractor unhappy with my work.",
    "text": "So I do new build rough in and finish plumbing for residential mostly. I’ll be testing in to get my license this year as my partner is retiring but we do so much more as a company like full on whole home renovations so I’m not constantly plumbing.   Anyways, contractor was supposed to supply hot water heater but didn’t til after I roughed in all the supply and he originally didn’t want to do a recirc system so instead I ran individual lines to the master, laundry and 1/2 bath that is directly above this water heater. The runs are like 20’ or less ensuring hot water quickly.  He then buys hot water heater with recirc so I ran a return line from the upstairs bath and would’ve prolly just did a single 3/4” line throughout but that is no longer an option. \n\nSo at this point I’m just having fun making a nice custom manifold bc this is where we’re at and he criticizes everything about it. How it’s completely unnecessary and I shouldn’t have done any of that and how if he hires me again he doesn’t want any of that. It’s a waste of time and materials and then he says how crazy my stack is and how it should’ve been done different. How I took up too much room and now the electricians don’t have room for a panel. Mind you there are like 3 other walls that are better options in this same room.  \n\nIn my opinion, if there’s a problem with the water system, this manifold allows you to isolate the problem and gives you time to fix it without shutting down the whole system.  He also criticized me for stubbing out in copper. \n\nHis last plumber stubbed out in pex and ran the supply and drains up through the floor instead of the wall. \n\nI’m definitely not the best plumber but I did most this job on my own as my partner (master plumber) was out of town. \n\nAny constructive criticism from some pros would be helpful. Always trying to improve.  \n\nBtw, we passed our inspections. \n",
    "score": 11610,
    "url": "https://reddit.com/r/Plumbing/comments/1k0jiey/contractor_unhappy_with_my_work/",
    "created_at": "2025-04-16T12:44:58.000Z",
    "num_comments": 1879
  },
  {
    "id": "reddit-1nh819y",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "UPDATE: Today is fucked",
    "text": "Thought I’d pass on an update and a couple stupid things I did to my last post. If you saw it, you probably laughed at my misfortune. If you didn’t, knock yourself out: \n\nhttps://www.reddit.com/r/Plumbing/s/xSUy7CvbBk\n\nPlumbing was completed today. Took me two hours. 25’ of pipe that I somehow maneuvered into the existing hvac/plumbing/framing in 5’ increments. \n\nLike a true fucking man, I inhaled some glue, rubbed some primer in my wounds, told the kids to treat the wife well, and put on my mask. Because like many of you said, it smelled like shit. \n\nFYI, primer in your armpit feels weird. I don’t know how it dripped there but I was a contortionist on that ladder. I would try it again, but it’s not really that great. \n\nNow for the details:\n\nThere was a a ton of grease on the sides and top of the pipe. My guess is someone had better luck with a small snake in the past then I did and water has been traveling that path for the last 3.5 years. I obviously fucked that up with draino. \n\nNow it’s time to laugh at my misfortune. I forgot to mention that before I got the draino and snake, I was dumping near boiling water down the drain, waiting a minute, and sucking it up with a shot vac. I repeated that a dozen times until I heard gurgling. In my excitement, I stuck my head down there expecting it to drain. Instead I was greeted with an explosion of hot water and grease to my face and thighs. \n\nI’m fine, I once tried to find a propane leak with a lighter. 2nd degree burns on my face so my skin has some resilience. Yea, I’m an idiot and yea, I was drunk. \n\nI also tried plunging the sink and blew out the garbage disposal. I really have no idea what the fuck I did, but I somehow manhandled that thing to a constant leak. So there went a $120. I also tried an air compressor down the cleanout, but that didn’t accomplish much of anything. Which sucked cause I thought it was a brilliant idea. \n\nFor those of you that said raccoon shit was in the ceiling, not dog shit, you’re probably right. I found a hole in the OSB that is currently covered by siding. Of course there’s no house wrap there, either. Someone before me obviously was bedding down with those fuckers. Lucky for me, my dogs tree em and they rarely come around. \n\nBecause I’m not a fucking electrician, I swept up my mess when I was done. I’m also not a plumber, so I busted a pipe trying to snake a drain. Take that for what you will. \n\nAnyways, don’t be an idiot. Don’t run a snake for 4 hours. Maybe stay away from draino. And if you have a shot vac, air compressor, a 25’ snake, a 50’ snake, and some boiling water all in the kitchen- maybe stop and call a plumber\n\nAnd for those of you that asked about the grow tents, my wife’s weed is fine. Which is good, otherwise I would probably be in the middle of a divorce writing this. ",
    "score": 2879,
    "url": "https://reddit.com/r/Plumbing/comments/1nh819y/update_today_is_fucked/",
    "created_at": "2025-09-15T00:51:47.000Z",
    "num_comments": 186
  },
  {
    "id": "reddit-1l0rpkb",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Boss man wanted a tankless heater upgrade, told him I’ve got it covered.",
    "text": "Used to be a full-time plumber but currently an apprentice electrician. \n\nBeen re-plumbing my new boss’s house with a former apprentice of mine during his remodel over the last few months. All new waste and waters to two upstairs bathrooms, added HW returns to each of them, cleaned up a ton of old piping in the crawl space…all kinds of fun work. \n\nYesterday was tankless install day, nothing beats a smooth install and start up. \n\nNow go ahead, tell me everything I did wrong…",
    "score": 2780,
    "url": "https://reddit.com/r/Plumbing/comments/1l0rpkb/boss_man_wanted_a_tankless_heater_upgrade_told/",
    "created_at": "2025-06-01T15:29:03.000Z",
    "num_comments": 656
  },
  {
    "id": "reddit-1ngbr1a",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Today is fucked",
    "text": "While snaking a kitchen drain, I busted through an elbow. Wild thing is the hose, not the attachment rubbed a hole in the elbow. I guess that’s what happens when you run a snake for 4 hours slowly advancing through a wall of grease. \n\nNow I have a room covered in grease/water, holes in the ceiling of two rooms, and it gets worse. \n\nNot only have I not found the end of the clog- all of this is solid grease, but I now have two parallel hvac boxes directly under the pipe. \n\nIn order to get access, I cut a large hole off to the side so I could reach over the hvac only to have a mountain of mouse shit fall on me. \n\nSo I went to cut on the other side, and I shit you not- dog shit? Falling from the ceiling. \n\nI have lived here 3.5 years. Why the fuck is there dog shit in the ceiling. It’s a super nice house. I’m so unmotivated right now and my house is literally on the market. \n\nThis kitchen sink has never clogged until recently. I don’t dump grease down there. I had a slow drain and dumped a bottle of draino down there. My guess is the draino softened grease until it clogged the last path. \n\nSecond to last pic is a turd staring at me. \n\nFuck this shit I should have called a plumber. ",
    "score": 2644,
    "url": "https://reddit.com/r/Plumbing/comments/1ngbr1a/today_is_fucked/",
    "created_at": "2025-09-13T23:17:57.000Z",
    "num_comments": 376
  },
  {
    "id": "reddit-1ktlf1l",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Question - how wrong is it if my bathtub overflow does not swallow any water?",
    "text": "EDIT1: RESOLVED - see end of post for resolution :D \n\nIn a new house, I just noticed that our bathtub overflow does not take in any water. Meaning, we can fill it up even over the overflow and the water is just steady, there is no drain effect.\n\nFurthermore, there is weird noise to be heard under the tub - lie some water doing something.\n\nAttaching video for the purpose of the noise - put volume up and you will hear it!\n\nWe are still under warranty and am filing this issue with them today.\n\nWhat could this be?\n\nIs this necessary an error when installing, or can they just brush me of saying \"that is the way it is supposed to be.\"?\n\nAny advice?\n\nWhat shall I expect?\n\nWhat shall I be careful about?\n\nCan there be damage anywhere below the tub because of this?\n\n  \nEDIT2: RESOLVED! It was the putty in the drain hole ... first plumber came over twice and was persuading me I do not understand physics ... third visit was by another plumber from same company who actually installed the tub and he found the problem in 2 minutes. Hope he shamed his colleague at least a bit. I lost too much time on this. \n\nFunny thing is - drain could work faster, hole is still too small to take all water as it pours into tub (overflow). ",
    "score": 2300,
    "url": "https://reddit.com/r/Plumbing/comments/1ktlf1l/question_how_wrong_is_it_if_my_bathtub_overflow/",
    "created_at": "2025-05-23T14:47:36.000Z",
    "num_comments": 411
  },
  {
    "id": "reddit-1k8xser",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Is this legit/legal?",
    "text": "A few days ago, a plumber (sent by my landlord) came to my apartment to fix a leaking pipe in the apartment below. Turns out the leak was coming from the apartment above mine. Plumber fixed a  new pipe to redirect the problem right on our kitchen walls and we can now hear every time the upstairs neighbours use their washroom/kitchen sink (unsure which).  \n\nI've never seen anything like this and would love some opinions on the soundness/legality of something like this. Landlord is ghosting me. \n\nThank you!! \n",
    "score": 1987,
    "url": "https://reddit.com/r/Plumbing/comments/1k8xser/is_this_legitlegal/",
    "created_at": "2025-04-27T06:50:14.000Z",
    "num_comments": 234
  },
  {
    "id": "reddit-1ow9i1a",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Can't believe I didn't do this a while ago",
    "text": "So whenever I needed to shut off water in the house (either for vacation reasons or for maintenance/etc) I felt like I had to apply the power of Odin to my shutoff valve (bottom of the first picture) just to turn the stupid thing. It's 20+ years old and the original builder special.\n\nAfter advice from this group, I finally decided to get a plumber in to properly install a ball valve shutoff just past the meter. I'm leaving the old shutoff before the meter alone since I'm not really allowed to mess with it anyways. It will just stay in the on position from now on.\n\nNow, shutting off the water isn't a worrisome event and it's super easy to use.\n\nI know this is super basic and I'll probably get downvoted here but I wanted to say thank you to people for their advice and not shaming me with such basic questions.\n\nEDIT:\n\nI got some great comments below and just want to clarify:\n\n1. I have a shutoff valve outside but only the city can touch that one\n2. I have a shutoff valve just before the meter in the picture above. That one is just tough to use so i wanted an easier way. Hence, adding a ball valve down the line after the meter.\n3. If I want to replace the valve before the meter, I will need to get the city and come and shut off the water at the curb, do the work, then call them back out again. So I will be without water for a couple days at a minimum.\n\nHope this clarification helps.\n\nEDIT2: Forgot to update with the bill. Came to CAD$360-ish inclusive of taxes. I know this is basic for many of you but this was great peace of mind for me.",
    "score": 949,
    "url": "https://reddit.com/r/Plumbing/comments/1ow9i1a/cant_believe_i_didnt_do_this_a_while_ago/",
    "created_at": "2025-11-13T18:52:51.000Z",
    "num_comments": 242
  },
  {
    "id": "reddit-1mcpapw",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Went to Mount a shelf in my upstairs bathroom and accidentally drilled into what I think is the sewage vent. Advice appreciated.",
    "text": "Hey all, sparky here and I'm feeling pretty silly. Long story short I tried mounting a shelf in our bathroom and drilled into what I can only guess is our sewage exhaust. It's in the upstairs bathroom so there is no flow coming down from above the holes (as far as I'm aware, I'm no plumber). All I able to just putty the holes or something? Should have trusted my gut when the stud finder gave an off reading, definitely should have trusted it on the first hole when it felt like I drilled into something on the other side of the wall..",
    "score": 532,
    "url": "https://reddit.com/r/Plumbing/comments/1mcpapw/went_to_mount_a_shelf_in_my_upstairs_bathroom_and/",
    "created_at": "2025-07-29T22:15:35.000Z",
    "num_comments": 322
  },
  {
    "id": "reddit-1il4llc",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Solo operators - wanting input from guys running one truck companies",
    "text": "I'm hoping to start my own shop by the middle of 2026 at the latest. My Dad ran a one man shop (plus occasional help from myself and a younger brother) for about 15 years, so I'm fairly familiar with the benefits and headaches of the work. \n\nI'm currently working as a Union pipefitter, but got my journeyman plumbing license two years back and am going to be taking the master license test this Spring. I'm wanting to transition to residential work so that I can stop traveling.  I have a finance background, so I should be able to hold my own on the paperwork end of things.\n\nI had a few questions for any who also run one truck shops: What does your average work week look like? How much of your time do you work a week vs. what are you able to bill? Is there a particular type of job or set of jobs you prefer or avoid? What type (if any) of marketing do you use or did you use to start or grow your business? How long did it take you to grow your business to sustain at least 40 hours of work a week?\n\nI'd greatly appreciate any input,  thanks.",
    "score": 33,
    "url": "https://reddit.com/r/Plumbing/comments/1il4llc/solo_operators_wanting_input_from_guys_running/",
    "created_at": "2025-02-09T02:36:00.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1nacl31",
    "subreddit": "Plumbing",
    "soc_codes": [
      "47-2152"
    ],
    "title": "Net Worth being a tradesman",
    "text": "Remove if this goes against guidelines \n\nSo this is something I see in threads from other professions (Engineering,Finance, Doctors,Etc) where someone posts that they’ve hit X net worth after being in their field for x amount of years, then others comment their story.  At the end of the day, we work hard as plumbers for our money &amp; it seems like the sky’s the limit in this trade if you have a decent head on your shoulders. \n\nI don’t see much on here about finances (I’m aware it’s a personal topic) past the hourly rate/salary threads. \n\nI’m curious if anyone would like to share what they’ve accomplished financially, not just us plumbers but being a skilled tradesman. Whether self employed, employee, or union. \n\nI’ll start- \n3rd year plumbing apprentice at small mom &amp; pop shop in the north east. \nRoughly $70k NW, no debt. \n60% IRA/401k/Brokerage \n40% savings \n\nFeel proud of what I’ve put away but I’m aware I have a long way to go.",
    "score": 13,
    "url": "https://reddit.com/r/Plumbing/comments/1nacl31/net_worth_being_a_tradesman/",
    "created_at": "2025-09-06T22:22:10.000Z",
    "num_comments": 14
  }
]