[
  {
    "id": "reddit-1i3g47j",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Oof.. when you can’t unhear the screams. ",
    "text": "I took a call from an absolutely frantic mother this morning after she and her husband woke up smelling smoke and found out their daughter had successfully completed suicide in their garage. I won’t say how because I don’t want to put that kind of thing out into the universe, but I’m sure you can come to the correct conclusion. I couldn’t get much out of her besides screaming, you know that wounded animal, broken soul kind of primal scream? Like that. The kind that you’re gonna hear replayed in your head on a loop for the next little while. \n\nI’m fine, besides listening to this woman scream on repeat in my head but I do feel awful for that family knowing that that trauma is something they have to now carry forever. I’m not a new dispatcher, this is my seventeenth year so this is not my first suicide or my first screaming caller, although it was my first suicide in this manner. I started dispatching at 19  and am now 36, so I’ve heard a thing or two. I don’t really know what the point of this was except to vent to some people who “get it”.\n\nThanks for reading, friends. Take care of yourselves. \n\n",
    "score": 9337,
    "url": "https://reddit.com/r/911dispatchers/comments/1i3g47j/oof_when_you_cant_unhear_the_screams/",
    "created_at": "2025-01-17T13:16:56.000Z",
    "num_comments": 297
  },
  {
    "id": "reddit-1ppvuf1",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Had a \"cardiac arrest\" on a 3 year old that turned out to be a Golden Retriever.",
    "text": "I answer the phone to a woman screaming that her baby is dead. Ask what happened. \"I have no idea. I was working in my office and I went upstairs and my baby is in his bed and he's dead. He won't wake up even though I'm shaking him.\" She's screaming \"Max wake up baby wake up\"\n\n  \nI have police and medics rushing. We're doing CPR. The only thing that was sounded off the entire time was when I told her to place her hand between his nipples and she asked which ones and I said the ones on his chest. I just chalked it up to panic and didn't think too much into it. Police arrive after about 4 minutes and within 30 seconds they chime up \"Dispatch you can slow FD down and just let them know it's going to be an evaluation on an approximately 40 year old female. No cardiac arrest\"\n\n  \nThe sergeant calls in and their dispatcher starts laughing and saying are you serious and tells me to pick up the landline. Sergeant tells me she was doing CPR on her dog. Everyone in the room is laughing. We replay the call. At no point is there any indication that it's a dog.\n\n  \nMy supervisor saved the call to play for the next training class.\n\n  \nAnyone else experience this before??",
    "score": 3486,
    "url": "https://reddit.com/r/911dispatchers/comments/1ppvuf1/had_a_cardiac_arrest_on_a_3_year_old_that_turned/",
    "created_at": "2025-12-18T16:56:57.000Z",
    "num_comments": 250
  },
  {
    "id": "reddit-1ie5vqg",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "I took this job to help people",
    "text": "I’m sure I’ll lose my job for this but I refuse to work with or assist ICE. Nothing to do with politics. Just can’t stand idly by watching this. I’ll find different ways to help the community be safe. ",
    "score": 2658,
    "url": "https://reddit.com/r/911dispatchers/comments/1ie5vqg/i_took_this_job_to_help_people/",
    "created_at": "2025-01-31T03:38:35.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1m5s970",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "My Ex-girlfriend tendency to laugh out loud under extremely stressful situations may have saved a life",
    "text": "I was with my then-girlfriend when my sister-in-law fainted out of the blue. My girlfriend and I were in the living room when we heard a fall in the kitchen; there she was. I carefully turned her onto her side, checked her vitals, etc. Meanwhile, my girlfriend was laughing hysterically, tears streaming down her face. I asked her to go get her mom. I could see her, barely able to walk from how much she was laughing. We were 17 at the time.\n\nTwelve years later, I was a dispatch for 911. I was supervising a call with a new dispatcher, and the person on the line was barely able to speak, laughing uncontrollably. The dispatcher was about to hang up, thinking it was a prank call. The caller kept repeating, \"Please send... (laughter) help, send help... (laughter).\" It's hard to describe, but it sounded like the caller was mocking us. She looked at me and asked, \"Can I disconnect?\"\n\nI remembered that scenario from over a decade ago. I shook my head no and told her to get the address. If it is a prank, I'd take the fall.\n\nI understand nervous laughter, but I cannot think of a worse scenario for laughing uncontrollably. I wonder what it must be like for someone who has this condition: trying to convey an important message but being unable to do so. It must be a nightmare.",
    "score": 2101,
    "url": "https://reddit.com/r/911dispatchers/comments/1m5s970/my_exgirlfriend_tendency_to_laugh_out_loud_under/",
    "created_at": "2025-07-21T19:21:27.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1ocuck6",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Last night I sent my officer to her last call before she died on duty",
    "text": "Title says it all. She was coming back from jail and pulled over for someone that was in a TC on the freeway. She was hit by a distracted and speeding driver and instantly killed. We sent CHP to check on her after not answering her radio. I feel nothing but guilt even though I know it’s not my fault and this could’ve happened to anyone. I’m in shock, incredibly sad, and overwhelmed. She was an amazing officer and so young. I can’t sleep, eat, or even think really. I’m just gutted right now for her, everyone at the station, and her family.\n\nEdit: thank you everyone for the kind words and support. I appreciate everyone that reached out to me personally as well and I’m sorry if I haven’t gotten back to you. The whole thing is very overwhelming and I’m still trying to navigate the best I can. My station and surrounding agencies have been nothing but beyond generous and supportive. We’ve had our critical incident therapist and chaplain at our station and have had our debrief from everyone working the night of. They’ve heavily stressed EAP, and while I plan to take advantage of it, I’m just not ready yet. ",
    "score": 1645,
    "url": "https://reddit.com/r/911dispatchers/comments/1ocuck6/last_night_i_sent_my_officer_to_her_last_call/",
    "created_at": "2025-10-22T00:51:34.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1lp5507",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "I just lose a kid on that call. I lost the silence that usually followed.",
    "text": "\n\nThe worst call I ever took didn’t have closure. Just a scream.\n\nYoung male caller. Maybe 20. Obvious cognitive delay. Screaming in agony and not the “I’m hurt” kind, the kind that turns your blood cold. I couldn’t understand him. It was pure panic, raw and wild.\n\nMy center was quiet that night. My coworkers could hear it through my headset and jumped in immediately. One ran records. One hit online tools. I checked every GPS resource we had.\n\nNothing. PH1 ping only. One tower. No address. No way to narrow it down.\n\nI kept trying to pull any word from him. Didn’t need a story. Just a location. Something. He tried saying something, and I repeated it back the way you do with someone who has a mouth full of marshmallows, just to see if we could land on anything.\n\nThe scream hit another pitch. Then the line went dead.\n\nRedial. Straight to voicemail.\n\nI kept repeating the sound he’d made, trying to find the shape of the word. My partner said:\n“Hathoway Park?”\n\nYes. Yes. That was it.\n\nShe had the neighboring agency’s call board open. House fire in progress. We passed along what we had. A few minutes later:\n\n“We have two code black.”\n\n\n\nAnd that was that.\n\n\n\nBut for me? it wasn’t.\n\nThat scream didn’t leave when the call ended. It stayed in the room. In my ears. In my chest.\n\nI kept thinking about what I missed. What I could’ve done. If there was anything that would’ve changed the outcome.\n\nI didn’t spiral. I functioned. I showed up to work. But something shifted.\n\nI got quiet. Not the “zen” kind. But the kind where you're watching your own thoughts too closely, waiting for them to settle.\nThey didn’t.\n\nThat call changed something in me. Not with a bang, but a slow drag.\n\n\nI’m not sharing this for pity. Most of you reading this already know.\n\nYou’ve heard the scream too.\nOr the silence.\nOr the sound of CPR compressions from someone’s living room while a toddler cries in the background.\nOr the tone of a dispatcher doing everything right — knowing it still won’t be enough.\n\nWe don’t always talk about it. But we know.\n\nJust putting this one out there in case it gives someone else permission to name what they’ve been carrying.\n\nStay safe out there.\n\n\n\n",
    "score": 1568,
    "url": "https://reddit.com/r/911dispatchers/comments/1lp5507/i_just_lose_a_kid_on_that_call_i_lost_the_silence/",
    "created_at": "2025-07-01T15:47:44.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1n1w86b",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "So my mom got arrested -_-",
    "text": "Yup. I'm a dispatcher, and my mom is now a felon. Lol right? In between nights shifts and I wake up, mom's gone, had a missed call and I keep trying to get her to pick up. She's blind,  so if she's not here it's because someone else took her somewhere and she always tells me before she leaves.\n\nTurns out, she's at work! My work. *The police department work*\n\nI work for the cops and my mom is a criminal who got her *fucking mugshot* taken by the same detectives I work with. I gotta pass that man in the hallway and be like \"Ayyy.\" Y'all im so over these people. I work aaaaaall this OT and sell my soul for 96 hours in a row for you to go do crime??? Be blind, do crime??? In front of my salad???\n\nReally tempted to print out that call sheet and frame it for Christmas.",
    "score": 1062,
    "url": "https://reddit.com/r/911dispatchers/comments/1n1w86b/so_my_mom_got_arrested/",
    "created_at": "2025-08-27T23:10:13.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1iqnn05",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "I just spent two plus hours on a 911 with a suicidal male who wanted to commit suicide by cop.",
    "text": "I will spare you the scary details, but I will share that we did not shoot him (thank God) and that he is now safe and getting help. And one other thing about this call that is what makes this job worth it, what has kept me coming back day after 12-16 hour day again and again for 18 years now. Worth missing family stuff, being tired all the time, worth the emotional trauma this job (and this call) caused/causes. This one thing makes it all worth all the pain and sacrifice.\n\nAt the end of the call when I finally convinced him to put the rifle down on the porch and come out to the street with his hands up so we could help him, after two long, arduous and sometimes terrifying  hours, I heard the radio chatter that they couldn't see his hands as they were at his back. My heart fucking *sank*, but I stayed calm and asked him if his hands were up. His answer was, and this is a direct and verbatim quote:\n\n\"Hemorrhoids. I have hemorrhoids and them shits are falling out, I gotta hold them in! I been bleeding for days!\"\n\nHe is at the hospital now and getting help for his emotional issues and, I sincerely hope, those hemorrhoids. I love this job and I will never do another as long as I am able.\n\nnote: this is a 100% true story. I might talk more about how it went later but for right now I really just need some Earl Gray tea and to play with my new kittens. It was, despite the ending, a terrible fucking call up until he was in the ambo. I'm just glad he went in on his own two feet.",
    "score": 1035,
    "url": "https://reddit.com/r/911dispatchers/comments/1iqnn05/i_just_spent_two_plus_hours_on_a_911_with_a/",
    "created_at": "2025-02-16T08:14:09.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1ltp77k",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Apparently there's no emergencies in my city",
    "text": "Got on shift today and first call was a suicide - girlfriend heard the gunshot and found her boyfriend on the couch, kids in the apartment and everything. I stayed on the line with her until officers arrived and was a little shaky (first suicide call) but doing alright. Then within a few minutes I start getting calls from some lovely citizen upset about how loud the sirens are and demanding to speak to a sergeant. Doesn't believe me when I tell him the sergeant is on a high priority emergency call (apparently there's no emergencies in the city), and hangs up and calls back several times, at one point claiming he's taken a shit in front of the PD to try and get their attention (no news currently on if this has been verified). \n\nIdk what I'm looking for from this post, mostly just venting to people who get it. No clue why he refused to believe me, although it's not like I could tell him what was going on or that I'd had the hysterical girlfriend in my ear like 90 seconds prior. Dunno. Hope yall are having a better night than me.",
    "score": 987,
    "url": "https://reddit.com/r/911dispatchers/comments/1ltp77k/apparently_theres_no_emergencies_in_my_city/",
    "created_at": "2025-07-07T08:54:56.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1hvp26v",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "We had a crazy call the other night and I've never heard of anything like it in all my years",
    "text": "I will keep the intimate details to a minimum out of respect to the families involved, but this call is a tough one to process (not emotionally; I don't need CIT for it, but it is one of those rare calls where I want to know *why???*) and I want to know if anyone else has ever experienced it.\n\nAbout midnight the other night we get a call for a young man down, shot in the head, possible suicide. The guy who called (another very young adult) was gobsmacked, said his friend shot himself. We got the pertinent info and then this kid just started asking us to call his mom. He had tried to call her first and she didn't answer.\n\nWe respond, male in the driver's seat of a car, GSW to head, appears self inflicted, corroborated by the caller and two other males on scene. He had vitals (not that it changes anything; my agency transports *every* witnessed code no matter what) so they transport to the nearest trauma hospital. An hour later after notifications were made, the OIC calls in that he is deceased. \n\nAll of this, while sad and tragic for the guys on scene and especially the victim's family, is pretty cut and dried. It was somewhat odd that there were three other guys on scene who could confirm a suicide but nothing really eye catching.\n\nLater that night we got the full story. At around 0100 our victim calls three of his buddies and says \"we are getting food, I will pick you up.\" He does and they get food and are cruising through town bullshitting. Normal night for young guys. \n\nA bit later after some cruising around, the victim says he wants to show them something. So he drives to a random street in town, stops in front of a random house and parks the car. Without a word, he pulls out a gun and with no hesitation puts the gun to his head and shoots himself in the head with his three friends in the car with him.\n\nHe never said a word. No issues known to friends or family. Good kid, good life, happy kid, no drugs, no alcohol. Never said a word and did that in front of his best friends. Why do that to them? \n\nSenseless.",
    "score": 950,
    "url": "https://reddit.com/r/911dispatchers/comments/1hvp26v/we_had_a_crazy_call_the_other_night_and_ive_never/",
    "created_at": "2025-01-07T11:05:43.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1jddab2",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "\"Am I going to be deported?\"",
    "text": "Asked by a domestic violence victim at the end of our call. I'd literally heard this woman get beaten up while the line was open, and this was when she started to cry. She only spoke Spanish (I'm fluent), and she was fucking terrified that we'd send an ICE officer over there while she was getting patched up by ambo.\n\nI assured her that no, that's not how this works; my county (I'm on the west coast) doesn't do that. It's not our job, and our chief has straight up said that we won't be cooperating with ICE unless absolutely necessary. She seemed a little reassured by this.\n\nIt's already so hard for DV victims to seek help. The fear of getting deported/getting their families deported is making it worse. I don't even want to think about how many other victims are keeping their mouths shut because of this. I'm not trying to be political here; this is just the fact of the matter in my area.\n\nOh, and for the cherry on top? I also got a call demanding we send an officer out to investigate \"three illegals.\" The caller insisted that because these people were speaking Spanish amongst themselves and \"acting suspicious,\" they were illegals. Here's the thing: this caller had an accent thicker than molasses. \n\nEdit to add: I had hoped that the second call would illustrate why the current political climate makes it harder for legal immigrants to get help as well. They have a lot to fear, and I'd like to be able to tell the ones in my county - legal or not - that they're safe to report a crime or call for paramedics. If anyone works for a department that has successfully spread this message, I'm open to advice.",
    "score": 932,
    "url": "https://reddit.com/r/911dispatchers/comments/1jddab2/am_i_going_to_be_deported/",
    "created_at": "2025-03-17T13:59:19.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1mbc9q3",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Welp, it finally happened",
    "text": "Apologies if I used the wrong flair. New to Reddit, and even newer to this community. \n\nI’m a baby dispatcher. On my last week of call-taker training. Had a guy call in a few minutes ago who was gasping in between each word. After getting the address and the other pertinent info, i just asked him to try not to speak to keep him from struggling. He just kept begging me to help him, and eventually starting saying “I’m not going to make it.” Sure enough, i heard agonal breaths, and he stopped responding altogether. \n\nI come from a pretty solid healthcare background, with the majority of it being in the ED, so this is not the first person to die on me by any stretch of the imagination. But, i am completely new to dispatch, and he was my first death on the phones. \n\nThe death rattle never gets easier to hear. I knew exactly what was about to happen the moment I heard it.\n\nFD reported full arrest when they got on scene a short while after. I truly hope they get ROSC, but I am well aware that probably won’t happen. \n\nHis very elderly mother could be heard crying when FD came in. I disconnected when they got to him. \n\nI wish i could tell him how sorry I am it ended this way. I hope his soul finds peace. \n\nSigh. \n\nUPDATE: DIF (Death in the Field) 😔",
    "score": 875,
    "url": "https://reddit.com/r/911dispatchers/comments/1mbc9q3/welp_it_finally_happened/",
    "created_at": "2025-07-28T10:10:12.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1i81dv1",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Some calls get ya",
    "text": "Tonight I took a call for a teenager found down after a seizure. Long story very short he was transported and they called it at the hospital. And for whatever reason it’s really sticking with me. Well maybe it is or maybe it’s the fact that I checked on every unit who responded and asked them if they needed our peer to peer support to reach out and not one person asked me if I was ok. \nI’m sad tonight in a way I haven’t been sad in the last 5 years of working this job. Sad that someone’s kid isn’t here, sad that my units feel like they weren’t enough, and sad that once again I have been forgotten. \nAnd yes I know if I needed to I could reach out myself but I don’t want to have to do it myself I want to be remembered. I want to feel part of the team. ",
    "score": 826,
    "url": "https://reddit.com/r/911dispatchers/comments/1i81dv1/some_calls_get_ya/",
    "created_at": "2025-01-23T11:35:01.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1lah0gb",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "crazy how when it ends… the feelings start",
    "text": "just had one of those calls. nasty one. vehicle vs pedestrian. hit and run.\nvictim was a 2-year-old girl.\n\nfirst thing I hear is chaos. multiple people screaming. full-on panic.\nthen a caller gets on the line. she’s panicked too, but she’s holding it together. not crying, just stressed.\nsounds like she doesn’t know the little girl, just someone nearby who stepped in.\n\nshe tells me the kid’s on the ground. not moving. not breathing right.\nand in that moment, I couldn’t care less about the suspect car.[coworkers had other callers, and they got suspect vehicle info]\nwe needed to do CPR. now.\n\nshe takes a second to get through the family around the girl. everyone’s yelling, crying.\nbut my caller listens. she pushes through.\nI give her CPR instructions.\nI start counting compressions with her.\nshe whispers the count back to me, under her breath.\n“1, 2, 3…”\n\nwe’re doing this for like four or five minutes.\nit’s loud. emotional chaos in the background.\nbut somehow, she locks onto my voice. she’s focused. steady.\nkeeps repeating, “come on little girl, come on baby…”\n\nthen medics get there. they take over.\nand I finally get to tell her,\n“you did everything right. you stepped up. you should be proud.”\n\nand that’s when we both broke.\nshe started sniffling. her voice cracked.\nand then I noticed mine did too.\nwe said goodbye. we disconnected.\n\nand now I’m here reading the notes.\n“working code.” medics doing CPR.\nand suddenly, all the feelings hit at once.\neyes watery. voice shaking. full-on tears.\n\nfunny how we hold it in when we need to, and then it all just rushes in after.\nlike a dam breaking.",
    "score": 813,
    "url": "https://reddit.com/r/911dispatchers/comments/1lah0gb/crazy_how_when_it_ends_the_feelings_start/",
    "created_at": "2025-06-13T14:14:20.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1ixzgau",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Fatality Accident",
    "text": "We had a pretty bad 4 vehicle fatality accident that injured about 3 others as well. \nCall about 30 minutes in: \n\nMe: Police Dispatch how can I help you\n\nCaller: Google maps said that the highway would be congested for about 2 hours is that true?\n\nMe: Yes there was a vehicle accident with injuries\n\nCaller: Well what are we supposed to do? I want to get home and this traffic is ridiculous!\n\nMe: Wait in traffic because there was an injury accident\n\nCaller: Wow *disconnects*\n\nI wanted to be like \"There is a person dead in a car being cut out by the fire department right now and you're complaining about traffic??\"\n\nWe got many calls like this during the early January blizzard. People would call 911 asking why there was traffic. My response? \"Because there's a blizzard\" *hangs up*\n\nDo these people have worms in their brains??\n",
    "score": 720,
    "url": "https://reddit.com/r/911dispatchers/comments/1ixzgau/fatality_accident/",
    "created_at": "2025-02-25T16:45:14.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1lc2xyo",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "I cried during a call, am I going to get fired?",
    "text": "I am a new hire at my local E911 center in a very rural county. I just finished up my first week and I think I’m going to really like the job, but I’m worried I’m going to get washed out. \n\nIt was my fourth day and so far I’ve just been listening to calls and writing up mock CADs for them. I struggle a bit with catching addresses, so that’s been my biggest focus. This call was a mother who’s teenage son overdosed, and I broke down while listening to her. \nIt was silent crying, mostly just wiping my eyes and nose with my sleeve and I still caught everything to put in the CAD. I know my trainer saw me crying, but he never said anything about it. I stopped crying right after the call was finished (the kid was okay after narcan was administered), and the rest of the night went fine.\n\nAm I going to get fired? Will they see it as a sign I’m not emotionally capable of the job? I’ve worked in high stress jobs before and I think I’d be fine if I was the one in the hot seat, but it was so hard to listen and not be able to help. I really like this job so far and want it to work out, but I’m worried I don’t fit in with the other dispatchers. \n\nMy only protection from getting let go is that we are a very small center and I’m the hire who brought it up to full staff, but I’m still worried. \n\nAny advice?\n\nUPDATE: \n\nI just finished up my first month and it turns out I had nothing to worry about. \n\nMost of my coworkers are very kind and as cliche as it sounds it actually feels like a little family. I am loving the job so far and have quickly learned how to distance myself from difficult calls. \n\nI am still trying to decide if I want to settle into dispatching as a lifelong career or if I want to try to go to grad school. \nI enjoy what I’m doing, but watching the others work themselves to exhaustion covering shifts doesn’t instill me with much confidence. We only have 13 dispatchers including myself and another trainee, so employees are averaging 50-60 hours a week at the least. \nI just don’t want the majority of my life to be spent at work. \n\nIf anybody has advice about dealing with mandatory overtime and short staffing I’d be happy to hear it! ",
    "score": 297,
    "url": "https://reddit.com/r/911dispatchers/comments/1lc2xyo/i_cried_during_a_call_am_i_going_to_get_fired/",
    "created_at": "2025-06-15T15:25:39.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1l1c4eh",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Almost twenty years in and it still makes me as angry as it did on day one",
    "text": "Worked my third 12 in a row and have another (OT shift, no less) tonight. 0245 and that 0300 cut off for calloffs. 0250. 0257. *Oh two fucking fifty seven.* The phone rings. We've all heard it.\n\nIt's no biggie, I am not top on the list. I'm pretty sure you know what's next.\n\nTwenty minutes later and there's the supervisor standing at my desk, looking down at me. I immediately get that sinking feeling. Really it's disbelief at this point. How??? \n\nI have been at my current agency two years and have never, not once, not even have I *imagined* refusing an order to stay over. Mandatory. Force, whatever it's called where you are.\n\nNot one but TWO people above me on the list say no. One of them is only here 9 months. The other just over two years. They do this frequently. Neither of them work tonight like I do. They don't give a fuck. They are going home to a nice warm bed while I will have to do an 8 hour turnaround when I live 45 minutes away for my 4th 12 in a row after a 16. \n\nI hate the fact that we are so short staffed that management knows they can't enforce the refusal rules to the letter or they will lose another 25% of the staff. These insensitive and callous people have learned that. Last year when things were staffed they would be looking down the barrel of a 3 day suspension. Not now. So the people like me who care and will do anything to not have \"refuses orders\" on their name and reputation get fucked over again and again.\n\nIt gets old. I refused OT one time in my career and that was on Christmas morning to stay for a double when I had just done 32 hours of OT to be bottom of the list and it STILL got to me. 14 people refused before me. I still hate that I have that one on me but I was not missing Xmas morning with my kids for those assholes.\n\nIt gets old and I am tired. Sorry for the negativity, I felt the need to vent my spleen and there's nobody here I can vent to because they are all people who refuse. I need a fucking hug.",
    "score": 193,
    "url": "https://reddit.com/r/911dispatchers/comments/1l1c4eh/almost_twenty_years_in_and_it_still_makes_me_as/",
    "created_at": "2025-06-02T07:47:33.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1krdlxf",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Feeling Disappointed",
    "text": "I have been dispatching for over 3 years now and have always had it drilled into me that everything an officer requests must be on a recorded line and everything you do for them must be recorded. Even if it's just a simple status check and they are seriously standing right in front of you (yes annoying but it's what I've been taught). Well last night I witnessed one of our newer dispatchers take a call on their personal cell phone and ran someone through NCIC/CCIC for the person on the other end of the call. Well I mentioned it to the person that they can't be doing that and the response was \"well they did it to\" and pointed to the other dispatcher we were working with. I have never witnessed them doing this but responded with \"well they shouldn't be doing it either\". Well because of my training, my ethics, and literally what is in the training to get CBI clearance I did email my supervisor to let them know. I live by CYA and refuse to screw up my career for someone else. Before leaving I stopped and told both of them that I was very sorry but I did have to let our supervisor know of the incident. The person who did it just knodded but didn't say anything and the other person said \"well you said something so.\" In a very snarky and rude way and then I left. \n\nI know on my heart I did the right thing simply because this was a security breach and if they are willing to do this on a non recorded line how much are they willing to just run or how many times have they done this in the past and we have no way to verify if it was actually for an LEO or not. Now I'm starting my 10 days off and I have no clue what I'm going to be walking into when I come back. \n\nI know a lot of people believe in MYOB but I don't think that's the right thing in this situation. Would anyone else have done the same thing and said something? I guess I just want to know that I'm not the only one who would do this. I'm just very disappointed that two people who I truly enjoy working with a like as people who do this. \n\n***Edit***\nThank you to everyone who has commented. For the most part it seems that I'm not alone in knowing this is something. That needed to be reported. I truly appreciate all comments on this even if they don't align with what I did. After being able to spend some time thinking about this I definitely wouldn't have ignored it. Probably wouldn't have let them know that I reported it but the view point of how it may have appeared to them was not part of my thought process. I have goals of where I want this career path to take me and I feel as though they would have been derailed if I didn't say anything. I'm still disappointed that people that I trusted and worked with put me in this situation but I know that I have it in me to do the right thing. ",
    "score": 130,
    "url": "https://reddit.com/r/911dispatchers/comments/1krdlxf/feeling_disappointed/",
    "created_at": "2025-05-20T19:19:59.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1hwc3m5",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Career day at my child’s school",
    "text": "I was asked to speak at my child’s school ‘Career day’  &amp; other than the obvious  importance of knowing your home address &amp; not calling 911 unless it’s a true emergency I am blanking on what i’m going to talk to these kids about. (elementary level) \n\nHoping you guys could give me some bullet points you would address. \n\nmy coworker mentioned my center probably has stickers or something i could pass out- probably could talk to my supervisor about what they would talk about-but in the mean time i figure i would ask here.\n\n\nTIA ",
    "score": 114,
    "url": "https://reddit.com/r/911dispatchers/comments/1hwc3m5/career_day_at_my_childs_school/",
    "created_at": "2025-01-08T05:07:42.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1hsiba0",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Leaving the job...",
    "text": "I have been working as a 911 Dispatcher for PD, Fire, EMS for going on 6 years now.  I started applying for other jobs last year when things in my center started going south.  I was finally offered a position and I accepted it.  I turned in my 2 weeks tonight.  My emotions are all over the place.\n\nIt feels so bittersweet.  I have loved the job itself.  I dedicated my life to it though and I feel like I have gotten nothing out of it.  I have been on night shift, working every weekend and every holiday since I started.  My relationship failed early on in my career due to the difficult schedule, I have missed so many family events and gatherings, I gave up on my favorite sport because I could never get weekends off to go compete.  Our agency is constantly understaffed, our management is awful and disconnected, mandates are rampant, OT is out of control,  coworker drama is never ending and hard to avoid, it's extremely difficult to get vacation or comp days approved if you are lower in seniority... I can handle the calls and the radio traffic, in fact, I still enjoy this part of my job a lot.  But everything else with this job has mentally torn me apart.  I am in therapy, not because of the traumatic calls, but because of coworkers who have continuously bullied me and made this workplace an extremely difficult place to be, especially when I have to be here 50-60 hours a week.  I wish it had turned out differently.  I hate to leave it behind but I got to a point where I felt I didn't have a choice anymore but to try to get out.  ",
    "score": 78,
    "url": "https://reddit.com/r/911dispatchers/comments/1hsiba0/leaving_the_job/",
    "created_at": "2025-01-03T09:00:40.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1lukluq",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "What I would have said if I would have known it was the end...",
    "text": "I understand that many here are career dispatchers with much more experience than me. After experiencing what I experienced only a year and a half into my career I want to try to help provide others with the tools to try beginning the healing process after a traumatic event.\n\nI know that many of us have experienced trauma at some point in our careers as dispatchers. I had someone suggest to me of writing a letter about the incident as a means to seek some closure or relief from the call. This letter is going to be the ending that you never got to say. Your goodbye, your heart, your pain, your hope that they heard you, and your reminder to yourself: \"I stayed and did not let them go alone.\"\n\nI have dealt with this feeling of guilt and fear since the incident. Tonight, I finally made the choice to do this, and I feel a lot better. Tonight was a struggle emotionally until I had gotten my letter written. I know that with reddit things can be made public such as sharing and all that. I want to give everyone here who has had that experience to write anonymously what they wish they could say to that caller if they would have known it was the end. I have included my letter as an example. I would love to hear what others have to say about what they have experienced but this letter can be kept to yourself . I just hope that if there are some people out there struggling that they are able to use this as a place to start. \n\nif you are willing to share your letter here (following community rules of course) please do so. I know that I am not the only one. \n\n\n\n(Caller), I know that you do not know me, but I took calls from you prior to that dreadful night. That night, I didn’t know that it was going to be your final moments—not until after it had already passed. Even after it had passed, I still clung to hope that you would somehow answer the phone, or I would hear officers call out that they were with you. Answering your call for help, I knew something was wrong, but I did not know what it was. I sent help to you as fast as I could. Your delayed responses told me that something was wrong, but I couldn’t put my finger on what had happened. I saw the history with your phone number, but nothing could have prepared me for what you were about to tell me. \n\n“My husband is shooting me!!” You telling me about your husband shooting you caught me off guard. I knew that help was on the way but this is where I had stumbled. I had felt as if something had changed. There was a new stiffness in the air as I continued to question you about where your husband was and who else was there with you. I know that we had discussed how to try to stop the bleeding as well. Then I heard one last gunshot from on the phone. My heart sank; I could no longer hear your breaths. All I could hear was what was going on the background. I could hear your dogs whimpering around the phone. This I believe now was them trying to get you to respond. I could hear officers yelling into the house for someone to come out. \n\nI clung to our phone call still even after I heard the gunshot. I continued to try to get you to answer me. I tried to get you to go to the door. I kept telling you the officers are there to help you and to keep trying to get to the door and they WILL help you. My coworker called your husband and when he told us that you were no longer apart of the land of the living we asked how he knows. He stated, “because I shot her.” I knew that I could not stay on the phone with you any longer because there were other calls that needed to be answered. I continued to help not only your friends but people who knew your husband continue to help officers in trying to get him to come out of the house peacefully. I reassured people who you were close with that we had help there and that we were doing everything we could. You were not supposed to die like that. You didn’t deserve that. \n\nWhat I want you to know is that I tried my hardest to get help to you as fast as possible. Even though it was not until close to when you passed; you telling me that your husband was shooting you saved so many lives that night. It was not me who saved them. YOU DID THAT. Since then, I still carry your voice with me and saying that your husband is shooting you. That night changed me, and I wish I would have gotten Police there sooner. \n\nYour voice has stayed with me along with the other things that were said in the background. Your voice is the clearest of all of them all. The silence after the gunshot is what has stayed and haunted me beyond just your voice. You may not have heard me, but I believe that somehow part of you knew that I was there. I did not leave you. Sometimes I still wonder what else I could have done better or more to save you. I know that I tried to walk you through how to try to stop the bleeding. I know that I showed up when you needed me the most. I stayed with you so you were not alone. I gave everything I had in that moment, and you were not alone in the end. \n\nI am choosing to let this moment go—not to forget, but to release the grip that this has had on my heart. This pain is real, but I cannot live inside it forever. YOU MATTERED. YOU STILL MATTER. And I WILL carry your memory forward not as a wound but as a reason to keep caring.",
    "score": 73,
    "url": "https://reddit.com/r/911dispatchers/comments/1lukluq/what_i_would_have_said_if_i_would_have_known_it/",
    "created_at": "2025-07-08T09:58:46.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1ndwrwa",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Interview Advice… (for those applying)",
    "text": "We finished up a round of interviews about a month ago. Been pondering a few of the things that we saw. \n\n- jeans and t-shirt for an interview. I’m sorry, but show some respect for the position and agency. Even if you’re nearly broke you should be able to find a pair of khakis and a golf shirt at goodwill for a song. \n\n- sucking on candy or sunflower seeds through the interview. Nah, friend… we need to get a feel for how well you can communicate *without* crap in your mouth. (Admittedly, talking around food is a valid job skill for us, but still…)\n\n- not having a clear answer for the simplest questions; the predictable ones, e.g., “What skills or abilities do you bring to this position?”\n\n- when asked for five year goals your answer is “I want to be a cop/firefighter/medic, this seems like an easy way to start.” Nope. No shade for someone who wants to be any of those things, but don’t come in and say you just want this til your real job opens up. (An interview a cycle or two back knew the *start date of the next academy class* and told us they only wanted to dispatch ‘til then.)\n\n- have no questions about the agency at all. We cover a lot in our “about us” spiel, but that should prompt some kind of curiosity or digging deeper. We want that. Inquisitive is a positive job trait. Ask about promotion opportunities, or outside details, or the training path, or benefits, or schedule…\n\n- make some eye contact. Staring down at a table for an entire interview is not inspiring. \n\n- don’t come in to an interview and announce that you can’t work X schedule. This is a 24-7 job and “I can’t work weekends” is a guaranteed decline. \n\n- make a joke! Have some confidence, find something easy to joke about. Local sports teams, weird weather changes, anything to break the ice a little bit. \n\nI get it. This job is kind of in the shadows and learning some of the fine points isn’t easy. I get that people don’t want to think of it as a career. I know some departments *do* use dispatch as a holding pattern for potential officers/FF/etc. \n\nBut… damn. When we interview for 2-3-4 DAYS to fill a couple spots, we know we’re investing 3-5 months in training, and - at least in our agency - you’re coming in to a civil service job with really decent pay and outstanding benefits. We want to get a return on our investment, and make this an attractive place for you to be for 5-10-20+ years!",
    "score": 48,
    "url": "https://reddit.com/r/911dispatchers/comments/1ndwrwa/interview_advice_for_those_applying/",
    "created_at": "2025-09-11T02:03:04.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1nzitvx",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "A lil something to commemorate my careers...",
    "text": "I worked for OnStar emergency for a decade before moving to EMS dispatch, so I made sure to incorporate some stars :) \n\n",
    "score": 46,
    "url": "https://reddit.com/r/911dispatchers/comments/1nzitvx/a_lil_something_to_commemorate_my_careers/",
    "created_at": "2025-10-06T13:18:33.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1p8bi64",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Long-Career Dispatcher Gender Inquiry",
    "text": "I would like to get some anecdotal feedback. Overall, dispatch tends to be female dominated, but also has a a fairly short average career length (due to several factors, but overall, I think the tendency of agencies to treat it as a job rather than a career: lack of training opportunities, lack of career advancement opportunities, lower pay, less recognition for the value contributed, et cetera).\n\nIn my local area, I've noticed that a good amount of our long-term \"career\" dispatchers have been men. I'm think the 10-20+ years types. I'm wondering what other people's experiences are.\n\nAlso, quick shout out to dispatchers everywhere. The job is HARD. The career is hard. And you are valued more than you will ever know.",
    "score": 43,
    "url": "https://reddit.com/r/911dispatchers/comments/1p8bi64/longcareer_dispatcher_gender_inquiry/",
    "created_at": "2025-11-27T19:56:49.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1nwatj9",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Got fully cleared and hired.",
    "text": "Hey everyone! \n\nJust got hired for my first dispatch job at a smaller agency in the Tampa Bay area of Florida. I'm extremely excited to be able to finally start down this career path. I start just over two weeks from now.\n\nI'm looking forward to training, even though I know it will be difficult and a lot of information at first. If anyone has any words of wisdom I'll gladly listen, but I mainly wanted to share the good news with people other than my immediate family.\n\nHope you all have a great day and stay safe!",
    "score": 35,
    "url": "https://reddit.com/r/911dispatchers/comments/1nwatj9/got_fully_cleared_and_hired/",
    "created_at": "2025-10-02T17:52:15.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1l3l2na",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Witch hunt",
    "text": "I'm coming here to not really rant but voice a journal entry I guess. I've been with my agency coming up on 10yrs now. Got 1 write up at the start of my career that really motivated me to be as good as I am honestly. I was written up today because our CAD map was being updated and a call I sent CORRECTLY went to the wrong address once it hit the incident monitor. I truly don't know how to feel. I'm not upset because I certainly could have and should have double checked the monitor but a write up for it just feels WRONG. I obtained and verified address. Verified cross street all was right before I hit send but somehow CAD screwed up but that's my fault?? Am I wrong for feeling the way I feel. Was a write up absolutely warranted? Has this happened in other agencies?",
    "score": 32,
    "url": "https://reddit.com/r/911dispatchers/comments/1l3l2na/witch_hunt/",
    "created_at": "2025-06-04T23:59:37.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1kifrlb",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Pay difference",
    "text": "After 10 years in this position I'm curious how much salaries differ state to state and how much of a living wage your salary is in comparison to cost of living. Do you have steps.\n\nNJ/NY area- $60k 12s. NO steps after initial bump. Someone who's been here for 3 years makes the same as 20 pretty much. 🥸",
    "score": 17,
    "url": "https://reddit.com/r/911dispatchers/comments/1kifrlb/pay_difference/",
    "created_at": "2025-05-09T11:05:25.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1jh03s4",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Got my first offer but…",
    "text": "Hey everyone, I was hoping maybe this sub could give me some kind of insight about the subject I’m about to bring up, but I applied to become a dispatcher back in 2024. I had always thought about being one, and I saw an opportunity so I applied. Passed an entry test (forgive me I don’t know the name), and I got an interview. Did one interview, and for I’d say the next three months, it was radio silence. \n\nI wasn’t disappointed. I wasn’t sad or anything. I just kinda moved on, and then after those months of silence, I got a follow up about a second interview. Went and did that, then got the polygraph out of the way. Had my final interview with the chief of police and he liked me and recommended they hire me.\n\nI’m only 20 years old, and I’ve been unemployed ever since I was laid off due to seasonal work. I’ll be honest with everyone here, I thought I’d be happier getting this offer. I thought it’d make me feel good, that I’d finally be starting life with a promising career I guess. The annual salary is great with the benefits I’d get as a 20 year old, nothing seems to be wrong with my offer. But, if I’m going to be even more honest with everyone, I just don’t feel good about it. I feel the complete opposite. \n\nI’m nervous I’m not the person to be doing this kind of job, I’m not necessarily afraid to fail but I’m for some reason anxious about all of this. Not in a typical anxious change way, but in a dreadful kind of way. I don’t know why I feel like that, I mean, I know so many people who’d kill to actually get an offer like the one I have. I just don’t know why I don’t feel good about it. \n\nI haven’t accepted the offer yet, I can choose to not go through with this or go in the following week to get my signature on the paperwork. Feeling extremely lost and confused. I’d love to know if what I’m feeling is at all relatable or normal. ",
    "score": 13,
    "url": "https://reddit.com/r/911dispatchers/comments/1jh03s4/got_my_first_offer_but/",
    "created_at": "2025-03-22T04:05:53.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1plws8s",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Am i stupid to turning down a Police Communicator position for my city with a salary range of 95K-105K",
    "text": "Am i stupid to turning down a Police Communicator position for my city with a salary range of 95K-105K, for context I’m 24 male and have strong background in security industries, security systems and alarm monitoring. I just feel not ready yet to perform at highest level, communicators deal with another level of stress. I might later on eventually go down that path in the years to come but I’m just not ready yet. \n\nI took another offer (similar) for the city protective services at 75K a year.\n\nJust need to know if I made the right move.\n",
    "score": 12,
    "url": "https://reddit.com/r/911dispatchers/comments/1plws8s/am_i_stupid_to_turning_down_a_police_communicator/",
    "created_at": "2025-12-13T21:39:38.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1o54zzo",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Career change. Pros/cons",
    "text": "Hi fellow dispatchers,\n\nI got an offer to work in corrections. \nI'm considering this move for a couple reasons. \n\n-More physically active job \n-Long term better schedule \n-Higher salary\n-More advancement opportunities\n\nCorrectional officers at that agency can eventually move into regular day shifts once they have seniority. In my current agency, dispatchers are stuck in the same 2 days, 2 nights, 4 off schedule forever, regardless of seniority. \n\nThat's kind of a dealbreaker for me. What do yall think? \n\n\n\n\n\n",
    "score": 10,
    "url": "https://reddit.com/r/911dispatchers/comments/1o54zzo/career_change_proscons/",
    "created_at": "2025-10-13T00:10:38.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1ml71xx",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Entry level doesn’t seem to be anymore",
    "text": "TLDR: feels like competition is stiff for entry level positions in high cost of living areas. What free or low cost certificates could improve my resume?\n\nI’m in a high cost of living area and have applied to four entry level dispatch positions. I’ve scored in the 90% range on Criti-Call and gotten two interviews. Two hiring managers wrote back saying they have enough better qualified applicants. I managed to get two interviews. One interview netted a thanks but you will not be considered further due to the number of more qualified applicants. That was 48 hrs later\n\nMy other interview took place in a city with $20k hiring bonus advertised. The supervisor who walked me into the panel room said their department had 11 open positions. After the interview, I was informed I would not be moving forward but they would hold on to my resume for the next round of hiring. It took about a week to get that feedback.  \n\nThese are all with departments about 20mins or less driving distance. I’m about to start applying to departments about 30-40mins drive away. Co-incidentally, the advertised salaries are generally higher than what I’ve applied to so far.\n\nSo besides getting CPR certified ($85 around me), what other educational investments can I make to improve my resume? I already have a 60 wpm typing certificate from adult school ($15). I see FEMA has a 3 hr course on disaster area dispatching that yields a certificate number. Any other low hanging fruit?",
    "score": 9,
    "url": "https://reddit.com/r/911dispatchers/comments/1ml71xx/entry_level_doesnt_seem_to_be_anymore/",
    "created_at": "2025-08-08T21:05:20.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1ihsgpe",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Questions about ResQ911",
    "text": "I’m contemplating leaving my job and joining the team with ResQ911 but would really love some honest feedback about the company and its employees from people who have used their services and from those that work for them. I have dispatched for 27 years and have been everything from call taker and dispatcher, to a supervisor. However, I’ve always wanted to travel and this seems like a way to do that while serving my 911 family as well. The main concern that I have is the potential instability of it. Also, I already make nearly the same salary that they are offering and my insurance is already taken care of and I own my home. So I may lose pay by going this route. Any information anyone could provide would be helpful. Thank you",
    "score": 7,
    "url": "https://reddit.com/r/911dispatchers/comments/1ihsgpe/questions_about_resq911/",
    "created_at": "2025-02-04T21:04:33.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1ocz1cq",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "How likely is it for me to become a 911 dispatcher?",
    "text": "I (18f Seattle, WA) have been wanting to become a 911 dispatcher for years, it has always been a job I've been interested in. Recently I spoke with my family about this and some people have just told me not to, some told me I may want to wait a few years till I actually consider this, which I understand and take into consideration, but this is really one of the only career choices that I have found myself interested in and passionate about.\n\nThroughout my research in this career, I've realized this will be a high stress job, and will take quite a mental toll on me. Which aren't things I am to worried about, I've had to deal with very high stress situations in the past and managed it very well.\n\nSome skills I have which I feel pertains to the job...  \n\\-I have fairly good communication skills, which also includes decent grammar.  \n\\-Time management skills (I've been told that it is a big-time commitment and is often unforgiving in that regard)  \n\\-I'm good under pressure and know how to control my emotions in stressful situations.  \n\\-Typing skills (65-80 wpm on average)\n\nAlso, I know that there is a background check, which I am slightly worried about. I had an incident a few years back; I was 15-16 I think. I was staying with sister for a few weeks and she didn't have food, nor the money to buy food, so my cousin and I stole food from a store. The cops came, (there were 2 sheriffs), we weren't detained, although, they did take our names and information, and we were trespassed from that store. And at one point when I was younger, I was self-admitted into the hospital for a mental evaluation (It wasn't an overnight stay, and if it's relevant, it was because I attempted to take my own life) but they deemed I was okay and that it was a onetime incident. I also didn't do well in school until 12th grade, so before then, I had hundreds of absents and pretty bad grades (That was because I had to care for family and was having issues with some people at my school, amongst various other factors). But in grade 12, I got very good grades, barely missed school, got 128 service hours (volunteer work), and even did some college courses. (I'm not sure if this matters, but I am currently going to college to study psychology and am also going to study communications)\n\nI'm wondering how likely is it for me to become a 911 dispatcher? I don't have any prior work experience I can put on my resume (I have done landscaping and small construction jobs 'off the books').\n\n**Questions I have**\n\n\\-Are there any courses I should take to prepare? Or things I should study?  \n\\-Are there any tips and suggestions you have for me?  \n\\-What are the hardest parts of the job?  \n\\-How do you stop yourself from burning out?  \n\\-On average, what does you work week look like/what is the schedule and hours?  \n\\-Do you struggle to separate work and personal life? What does that balance typically look like? How does this job effect your relationships (both platonic and not)?  \n\\-What are some things you wish you did differently in your career?  \n\\-Do you think the pay is enough for the work?  \n\\-What should I do to make myself a good candidate? (How should I present myself and prepare?)  \n\\-Should I wait a few years before applying? (If I do apply, it won't be until this coming summer, but I'm trying to prepare myself) And to add on to this, what is the youngest person you've worked with?  \n\\-What sort of mental toll does this job take on you?  \n\\-Are there many options to 'climb the ladder'?  \n\\-What is your average take home pay a month? What should I expect (salary wise) when just starting out?  \n\\-What are the best things about your job? What are the worst things about your job?  \n\\-What does the relationship between you and your coworkers look like?  \n\\-Do you have any advice for me?\n\nI know that is a lot of questions, but I really just want to know as much as I can before starting down this path and I'd really like to hear your insight, and if you perhaps have any questions for me, I am more than happy to answer.\n\nThank you for reading, any advice and help is welcomed. (Also I am not sure if I put the right \"Flaire\" on this post, so I apologize if I am wrong)",
    "score": 7,
    "url": "https://reddit.com/r/911dispatchers/comments/1ocz1cq/how_likely_is_it_for_me_to_become_a_911_dispatcher/",
    "created_at": "2025-10-22T04:44:18.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1j3n18j",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Re-applying",
    "text": "Hi All, I am considering reapplying for a dispatcher position in my area. I applied back in 2022, and made it through every step of the interview process, including the family interviews and Chiefs interview, and fell out at the final step which is the psych evaluation. I was super bummed about that, partially because I felt like the evaluator judged me by my application alone and didn't explore it at all with me. \nI have been in recovery from drugs (11 years) and alcohol (4 years now) and was very very honest on my application about all of this and still made it super far in the interview process. Everyone seemed to appreciate my honesty, but I'm not sure it was the best idea since I feel like it ultimately cost me the job. \n\nAnyway, the agency requires you to wait three years before applying again, and I noticed a position just became available so was considering applying. I have a very stable government job right now but it is incredibly boring, and I have always been drawn to the dispatching field. I would potentially be taking a $20,000 pay cut, at least initially and based on the base salary of the position in my area. I do not have children, but do have a very needy dog, so schedule flexibility is not an issue for me. \n\nI guess I am wondering if anyone has hit a similar roadblock (psych eval) in the past and has any advice or suggestions if I go through it again? Since I've already applied with the agency, I will have to disclose it all again as I don't want to lie. And is OT such a widely expected scenario that the pay cut would make sense? I know it depends on the area so folks cant guarantee it would be worth it. If you were in my position, would you make the switch, or have you? \n\nSorry if these are dumb questions and pardon my rant. Appreciate any advice! ",
    "score": 6,
    "url": "https://reddit.com/r/911dispatchers/comments/1j3n18j/reapplying/",
    "created_at": "2025-03-04T22:07:17.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1lg497b",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Pre Employment",
    "text": "Hi all! I’m asking this question to gauge how this process works, not to bash at all. \n\nI applied 2 months ago to a neighboring county 911 center. I took the Criticall 3 weeks go, had a general interview, and then a preemployment interview with all of the background things (it lasted 2 hours and I have a clean record!). I know have a 40 page background check packet that reaches everything from addresses to money to previous jobs, so on and so on. \n\nThis packet wants specifics. Examples- Ex coworkers names, starting salaries of old jobs, birthdays of the family members of my boyfriend I was living with a few years ago, exact dates of elementary/middle/high school, extensive credit reports, part time jobs that I had 10+ years ago in high school, etc. I haven’t gotten a conditional offer of sorts (no idea what the benefits/pay is, probably should have asked that in the first interview but I forgot) and I have this to go through, polygraph, psych evaluation, they’re interviewing the neighbors on my street and my family members with a background check on my boyfriend. I feel defeated by this process because it’s a lot and a lot on the background check form I have I can’t answer because I don’t remember or can’t find answers to (HRs to companies aren’t calling back, my high school clerks aren’t in everyday so it’s phone tag, etc). \n\nIs this a process that all centers go through? Again, I see the reason and I’m not upset over it, but I’m curious if I apply to something closer to home if it will be the same intensity or something different. ",
    "score": 6,
    "url": "https://reddit.com/r/911dispatchers/comments/1lg497b/pre_employment/",
    "created_at": "2025-06-20T13:39:54.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1jlycqc",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Possible career change",
    "text": "Greetings!\nI am an HR Specialist at a grocery store chain and find my role fulfilling, but like any job, there are some negative aspects. I interviewed for a dispatcher position for the second-largest county in my state, which would be a significant career change if I am offered a position and accept the offer. Although, during the 2 hour sit along, it reminded me a lot of my answering service years as we dealt with emergent medical calls that we had to relay and had scripts to follow. We did not receive any \"real\" emergency calls, though. Alarm call, fire on the concrete floor, caller fell asleep at the wheel going about 25 mph and hit a guard rail, etc. \n\nSome cons of my current job are no raises this year, very limited opportunities for advancement, and pay that is not enough to support my family's independence due to medical bills just before COVID and now we just can't get ahead enough to afford monthly expenses once we move out (my husband is disabled so his low income is fixed). I'm salaried, so no OT pay despite working extra hours often. No union.\n\nHowever, a significant advantage of my current role is being able to create my schedule 90% of the time, which is a big deal for me as a parent. I stilk work nights and weekends. As I previously mentioned, I do enjoy my job. I have the opportunity to literally change someone's life with a simple job offer. It's just a job for most, but I've hired 16 &amp; 17 yr old baggers who are now department managers at 19/20. A cashier who is now an assistant store manager and a dairy clerk who is now in our asset protection program. I don't work on Thanksgiving or Christmas day , but I do work most other holidays. \n\nSo, my question is, if offered the dispatcher position, would you think it's worth changing careers? I definitely need something that pays more and has opportunities to advance.\n\n[View Poll](https://www.reddit.com/poll/1jlycqc)",
    "score": 3,
    "url": "https://reddit.com/r/911dispatchers/comments/1jlycqc/possible_career_change/",
    "created_at": "2025-03-28T15:56:04.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1pnd3j1",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Ontario Canada CACC hiring questions",
    "text": "Hi there:) \n\nI was just invited to interview for a CACC (EMS 911 dispatcher) position in Ontario (already passed Criticall)-normally I’d jump at this in a heartbeat it’s basically my dream job! But I am also 8 weeks pregnant, and currently working a full time job that’s stable. So if I take the leap for this new position I could make double my current salary if the hours are decent (even just 36 a week would double me) and be able to better provide for my baby BUT if I don’t pass then I give up a stable job in this job climate. \n\nSo I want to know what is the 4 weeks in class training like and what’s the likelihood of passing? I can’t seem to find any information about the actual in class training portion. Also any information on if I should disclose my pregnancy before or during the interview? \n\nThank you in advance! ",
    "score": 3,
    "url": "https://reddit.com/r/911dispatchers/comments/1pnd3j1/ontario_canada_cacc_hiring_questions/",
    "created_at": "2025-12-15T17:18:10.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1kcucva",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Pay Negotiations &amp; Psych Test",
    "text": "I had my final meeting with the chief today, and he welcomed me to the agency. I received a call from HR, where I negotiated my salary. Now, I won't hear back until next week on whether or not they except my negotiation..But I'm wondering has anyone ever been successful in pay negotiation for a City? for reference I'm in California. Also once  I accept my offer, they will send me to complete my Psych test. What can I expect during that process?",
    "score": 2,
    "url": "https://reddit.com/r/911dispatchers/comments/1kcucva/pay_negotiations_psych_test/",
    "created_at": "2025-05-02T06:34:11.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1j0b1xq",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "Comparing Different Toronto/GTA Dispatching Agencies?",
    "text": "Hello, I recently got into the world of dispatching. Hats off to you heros! \n\nTLDR: What do you like about your agency and what have you heard about others?\n\nI'm curious about the pros/cons/comparisons between the various agencies for dispatchers. In Toronto, I know of Toronto Police Services and Toronto Paramedic Services. Salary is similar I believe (70+ upto 90+). I did see a job posting for York regional police (experienced) dispatcher with a starting of 90+ upto 100+, which was surprising! Training for Toronto Police is 6 months. Not sure what training for paramedic dispatcher is, but it includes the EMD course by IAED (\\~$450, 3 day course, paid out of your own pocket). What do you like about your agency and what have you heard about others? ",
    "score": 0,
    "url": "https://reddit.com/r/911dispatchers/comments/1j0b1xq/comparing_different_torontogta_dispatching/",
    "created_at": "2025-02-28T16:01:39.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1pm3k5f",
    "subreddit": "911dispatchers",
    "soc_codes": [
      "43-5031"
    ],
    "title": "a couple questions..",
    "text": "hi everybody! i’ve been wanting to be a 991 operator for a solid 2 years, and it’s the first career i’ve actually looked into on my own time. i have a couple questions that i’ve had on my mind for a while\n\n• if i were to get an associates degree in something like communications or criminal justice, would that make me overqualified? \n\n•what’s the average salary when first starting? \n\n• how much guilt do you feel when you answer a call, yet the person passes if any?\n\n• will you always remember traumatic callers voices?",
    "score": 0,
    "url": "https://reddit.com/r/911dispatchers/comments/1pm3k5f/a_couple_questions/",
    "created_at": "2025-12-14T03:02:25.000Z",
    "num_comments": 4
  }
]