[
  {
    "id": "reddit-1kn2eez",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Trump supporters are the worst patients",
    "text": "I live in TX and this is a whole new breed of patient. They make horrible racist remarks about the doctors treating them and whoever else happens to be on their care team that isn’t Caucasian. They watch Fox News all day and constantly make political comments and references, trying to get you wrapped up in a political discussion. They say the weirdest and most outlandish things (‘did you know bread is made with hair thrown away from barber shops?’ is one that I got recently). They think ivermectin cures everything and all other medical intervention is a racket (so why are you in the hospital sir?). They really REALLY want to talk about vaccines with you and how deadly they are and how proud they are to not be vaccinated. They all display these exact same behaviors and it’s the entire 12 hour shift, it’s like a new form of dementia. It’s terrifying and miserable to care for these people. I’m dreading going back to work tomorrow.",
    "score": 10697,
    "url": "https://reddit.com/r/nursing/comments/1kn2eez/trump_supporters_are_the_worst_patients/",
    "created_at": "2025-05-15T07:36:48.000Z",
    "num_comments": 1017
  },
  {
    "id": "reddit-1iycy39",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I’m just a random guy",
    "text": "Random dad here. Not in the medical field at all. During lockdown and Covid, I couldn’t trust all the news and speculation.  \nI decided to just follow r/nursing to read what was happening in real life. I followed many of you with no beds left, intubating people, or getting yelled at by relatives who weren’t allowed in. Back when you didn’t have enough beds or PPE. \nI was with you when travel nurses arrived making 2x more while you were exhausted with cold pizza instead of getting the longer term support you needed. Many people left. Many nurses burnt out over and over. Many left. \nBecause of you, we took COVID seriously. I’m proud to say this family of four still hasn’t gotten it. Thank you.\nI can’t imagine the toll this has all taken on you. This 5+ year nightmare. COVID, flu A, flu B, RSV, upcoming Avian Flu, that new bat flu, whatever that Congo thing is.\nYou’re real heroes. Instead of paying taxes, I wish every nurse could be adopted and funded by 100+ Americans. You all deserve MUCH more than you have. Days off. Sleeping in your own bed. Vacations.\nI don’t know how to do that, but we SEE you. When I see a nurse, I want to be healthier. I am inspired. And most importantly, I really don’t want to piss you off. This is the toughest group of people in the US. More so than others.\nI don’t know what I meant to post here other than thank you and this family loves you all.\nNo more pizza and I hope you all get those gel pens you like.\n",
    "score": 9503,
    "url": "https://reddit.com/r/nursing/comments/1iycy39/im_just_a_random_guy/",
    "created_at": "2025-02-26T02:27:41.000Z",
    "num_comments": 467
  },
  {
    "id": "reddit-1jih44c",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I GOT SPIT ON 3 times today—— and I am pressing charges!",
    "text": "\nI don’t even know where to begin. I’m still fuming. Today, a patient SPIT ON ME. Not once. Not twice. THREE. DAMN. TIMES. And guess what? He was completely alert and oriented (AOx4). No confusion, no delirium—just entitled, disgusting behavior.\n\nHe came in for abdominal pain and was getting Dilaudid 0.5mg Q2H. Already a generous dose, but apparently, it wasn’t enough for him. As I scanned his next dose, he asked me to “just add another 0.25mg and throw the rest away.” Excuse me?? I told him absolutely not. We don’t alter orders, and we don’t play pharmacy tech on demand.\n\nAnd that’s when he lost it.\n\nFirst, he threw his tray at me. Then, the spitting started. Not one drop, not an accident—he aimed for me. Repeatedly. I didn’t wait. I didn’t argue. I called 911 immediately. Screw hospital security—I’m tired of being told, “It’s part of the job.”\n\nSecurity still showed up, courtesy of my charge nurse, who actually had my back and wanted to make sure I was safe. Meanwhile, my unit director decided this was the perfect time to scold me for “not following protocol.” I couldn’t even respond. I was done. Thankfully, my charge nurse cut in and said, “Nurses do not deserve this kind of disrespect.” And that was the ONLY correct thing said in that room.\n\nThe police arrived and asked if I wanted to press charges. And you bet I said HELL YES.\n\nThis. Needs. To. Stop.\n\nWhy are we expected to tolerate physical assault as part of our job? This isn’t a psych patient in crisis. This isn’t dementia. This was a fully competent adult who knew exactly what he was doing. And yet, if I had reacted in any way other than calling for help, I’d be the one under investigation.\n\nI’m done. If hospitals won’t protect us, we’ll protect ourselves. I hope this patient enjoys his assault charge. Maybe next time, he’ll think twice before treating a nurse like garbage.",
    "score": 7715,
    "url": "https://reddit.com/r/nursing/comments/1jih44c/i_got_spit_on_3_times_today_and_i_am_pressing/",
    "created_at": "2025-03-24T02:58:52.000Z",
    "num_comments": 365
  },
  {
    "id": "reddit-1nwz37p",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "You should not be a nurse if you are against science.",
    "text": "With light of everything happening in the world right now, it KILLS me to see nurses who are actively advocating for acetaminophen causing autism, anti-vax mandates (Florida), etc. You are in a MEDICAL, SCIENCE-BASED CAREER. Stop actively undoing years and years of scientific, evidence-based research and knowledge through conspiracy theories and fearful propaganda. Thank you.",
    "score": 7524,
    "url": "https://reddit.com/r/nursing/comments/1nwz37p/you_should_not_be_a_nurse_if_you_are_against/",
    "created_at": "2025-10-03T13:25:20.000Z",
    "num_comments": 573
  },
  {
    "id": "reddit-1pa386r",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Requested a different nurse",
    "text": "I’m a white OR nurse.  I had a black pt come back for a hysterectomy last week.  The surgeon was also black. She was very sweet, but was obviously very scared, so I asked her what I could do to make her feel safe. She started fumbling her words then started crying. So I held her hands and got her to calm down and she told me that she wanted a black team then kept apologizing to me for her request.  I told her I wasn’t offended and I’d do everything I could to get her request met. So I called charge and asked them to get me a black nurse in my room, and I’d switch with her (the surgical tech assigned is black).  The black nurse showed up, and my patient as so relieved. Great, I thought it was over, but no.  The charge nurse, a white woman, told me I should have told her that wasn’t possible and she was gonna speak with our manager about what I did.  Great.  I get called into my managers office, where my manager, a black woman, told me I did nothing wrong, but she had to talk to me because the charge nurse pitched a fit about what I did.  \nI’m a white woman, so I don’t understand why my black patient was scared, but I respected it, and I did what I could to make her feel safe.  \nHer surgeon found me later and thanked me for what I did.  Apparently this woman has been putting surgery off for years because she was scared of becoming another black statistic. \nNow, my charge nurse is treating me like shit. So I’m documenting everything this charge nurse is doing. I believe that I made the right decision. ",
    "score": 7041,
    "url": "https://reddit.com/r/nursing/comments/1pa386r/requested_a_different_nurse/",
    "created_at": "2025-11-29T23:36:39.000Z",
    "num_comments": 828
  },
  {
    "id": "reddit-1ipdjuv",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "They did it, they hit the VA",
    "text": "I just got back home from a 12 hour shift so I’m frazzled. But during huddle our manager just got an email that they will be letting go of all our probationary employees. \n\nFor VA nurses that’s 2 YEARS. Some of these people have worked for over a year and a half. \n\nI feel frozen I’m not really processing. I’m ok I’ve been with the VA system since 2019 and this particular VA since January 2023. But one girl just bought a house and she was her families first homeowner and she was housing her family. \n\nThere were people who tried to calm me down on November by saying the presidential election isn’t important and won’t affect me. I begrudgingly agreed to calm down but felt awful. And now he fired a lot of my friends and half our night shift. \n\nNone of these guys are lazy, they are mostly just new nurses. \n\nHappy Valentines I guess. \n\n\nEdit: From the comments some people had their managers say that nurses weren’t affected. MY manager specifically mentioned that nurses with less than 2 years would be let go. I go back into work tonight and I’ll try to find more info! When I get back I’ll update this post and if the Mods allow I’ll make a separate update post. \n\nIf I’m wrong I’ll jump with joy and gladly eat my words. But all the day shift nurses were asking questions and she did specify nurses would be affected. \n\nUpdate: 2/14/25 @ 1930\nIn case I get busy, computer isn’t working but looks like the Email my manager sent had names of people that had worked here less than 2 years. And she told some staff to watch out for emails coming soon. Specifically staff on the list. Will update when I get more info. ",
    "score": 6930,
    "url": "https://reddit.com/r/nursing/comments/1ipdjuv/they_did_it_they_hit_the_va/",
    "created_at": "2025-02-14T15:49:03.000Z",
    "num_comments": 899
  },
  {
    "id": "reddit-1kc5aiz",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Stop bringing your FAKE ASS “service animal” to the hospital.",
    "text": "This shit just happened I am beyond angry, disgusted, and completely stunned that something like this is even allowed to happen inside a hospital. Today was a shit show in every sense of the word. I got floated off my regular unit to cover a different floor, and everything went downhill from the second I walked in.\n\nI got report from the day shift tech, ( NO mention of this dog.) As soon as I entered the patient’s room, I noticed a medium sized dog on the floor, probably around 45-50 pounds lying on a pissy wet blanket. It had a bright red vest that said “service dog,” but it was immediately so obvious this dog was not trained. Not even close. The room smelled like straight piss. Sure enough, there were puddles near the bed and shit smeared on the tile. The patient’s family made no effort to clean it up before leaving. They just left it there like it was our responsibility.\n\nI have worked with real service animals before. They are calm, disciplined, and well behaved. This dog was the exact opposite. It barked constantly, growled if anyone came near the patient, and when I bent down to grab wipes to clean the patient after a bowel movement, the dog lunged at me. I was not even close to it. Out of nowhere it snapped and bit my hand, hard. I started bleeding immediately. Blood was dripping onto the floor. I cant believe this mother fucker bit me! \n\nThen the dog switched targets. It began jumping at my charge nurse and attacking her legs. It latched onto her calves and ankles while she tried to shield herself We were screaming for help. In pure panic, we slammed the code blue button on the wall not because the patient coded but because we were under attack and someone’s ass in this room NOW. \n\nI ended up physically sitting on the dog’s back just to keep it from doing more harm until someone could come help. Meanwhile, the owner, lying in the bed like nothing was happening, just kept repeating, “He would not hurt a fly!” Over and over. While the dog was literally covered in my blood and trying to bite through my charge nurse’s scrubs. Like he just attacked us dumbass. \n\nSecurity arrived, then police and animal control. It was absolute chaos. And now, because of the bite, We have to go through rabies precautions. This should have never happened. That dog was dangerous! The situation was preventable.\nNow the owner is talking about a lawsuit… LMAO\n\nThrowing a vest on a pet does not make it a service animal. It puts patients and staff in danger. We need real policies and enforcement now before someone ends up seriously injured or worse than what we have. \n\nFUCK YOU if you slap a service animal badge on your house pet with no real training. \n\nHonestly Im pressing charges because wtf . ",
    "score": 5859,
    "url": "https://reddit.com/r/nursing/comments/1kc5aiz/stop_bringing_your_fake_ass_service_animal_to_the/",
    "created_at": "2025-05-01T10:18:43.000Z",
    "num_comments": 715
  },
  {
    "id": "reddit-1mlavgk",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Sometimes we get the happy ending",
    "text": "6 year old came into the ER after a car crash, clutching this little paper crane. Kid wouldn't let go of it for anything, not for the exam, not for X-rays, nothing. He kept asking \"Where's Mama? Is Mama coming?\"\n\nWe didn't know. Separate ambulances, different hospitals initially. All we could tell him was that we were trying to find out.\n\nThree hours later, she gets wheeled in from the other facility. Banged up pretty good, broken ribs, concussion, lots of bruising, but stable. The second that kid saw her gurney come through the doors, he jumped off his bed and ran straight to her.\n\nStill had that paper crane in his little fist the whole time.\n\nFound out later she'd made it for him that morning before school. \"For good luck,\" she told him.\n\nGuess it worked.",
    "score": 5466,
    "url": "https://reddit.com/r/nursing/comments/1mlavgk/sometimes_we_get_the_happy_ending/",
    "created_at": "2025-08-08T23:49:00.000Z",
    "num_comments": 107
  },
  {
    "id": "reddit-1iwfalm",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "My stethoscope case is ready for my first ever clinical :)",
    "text": "Any advice is welcome! Specifically seeking advice from wound care nurses, as I’m seriously considering becoming one! ",
    "score": 5034,
    "url": "https://reddit.com/r/nursing/comments/1iwfalm/my_stethoscope_case_is_ready_for_my_first_ever/",
    "created_at": "2025-02-23T17:24:48.000Z",
    "num_comments": 564
  },
  {
    "id": "reddit-1id8kyo",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "My pt knew she was going to die and told me goodbye without me realising it",
    "text": "I (24F) am a nursing student and I work in LTC.\n\nOne of my pts (89F) suffered from dementia. She was incredibly sweet but very confused.\n\nIn her mind she was 6 years old. She was often scared, looking for her parents.\n\nSo every night I did a routine with her.\n\nGetting in her pjs, tucking her in the blankets like her mother used to do, saying a prayer (im not religious but it comforted her) and then wishing her goodnight.\n\nLast night we did the same routine. And when I wished her goodnight she grabbed my hands and said: “I will miss you so much sweet girl, you will always be my favorite. Goodnight kiddo”\n\nShe went straight to sleep after that.\n\nShe had no signs of illness and I didn’t notice anything else out of the ordinary. I had a strange feeling about her comment so I went to check on her about 30 minutes later.\n\nShe died. \nShe looked comfortable and the dr said she likely wasn’t in any pain when she passed. Just went to sleep and never woke up again.\n\nI really hope that is true.\n\nThe whole ordeal makes me feel strange. I wish I could have done more for her but Im not sure there was more to be done\n\n\n",
    "score": 4704,
    "url": "https://reddit.com/r/nursing/comments/1id8kyo/my_pt_knew_she_was_going_to_die_and_told_me/",
    "created_at": "2025-01-29T23:56:25.000Z",
    "num_comments": 204
  },
  {
    "id": "reddit-1mec6bn",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "New nurse on my unit can’t take care of male patients",
    "text": "I’m curious about people’s opinions on this. A new grad rn on my unit can’t take care of any male patients because of her religious beliefs. She cannot approach or talk to male patients alone and especially can’t help them with using the restroom or cleaning up. The only (kind of major) issue with this is we work on a trauma ICU. At the very least our unit is 50% males and 99% of the time they need assistance with cleaning. \n\nMy unit has bent over backwards to accommodate this nurse to the point where they’ll give another nurse a heavier, less safe assignment or switch assignments mid shift in order to not assign this nurse a male patient. This nurse also won’t respond to codes or patient emergencies if the patient is male because of the risk of seeing them in a state of undress. Not to mention just simple tasks like asking another nurse to help with a cleanup or calling on a buddy to lay eyes on your patient is made more difficult when this nurse has an assignment next to yours.\n\nI have really mixed feelings about it and everyone on my unit seems scared to talk about it and risk coming off as a bigot or insensitive. What are your thoughts on the matter?",
    "score": 4500,
    "url": "https://reddit.com/r/nursing/comments/1mec6bn/new_nurse_on_my_unit_cant_take_care_of_male/",
    "created_at": "2025-07-31T20:14:51.000Z",
    "num_comments": 1519
  },
  {
    "id": "reddit-1kikd5y",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Don’t date cops",
    "text": "I’ve coded patients, and stopped patients from completing suicides. However one of my proudest moment in healthcare was encouraging a nurse to leave her shitty abusive boyfriend, who is a cop, and a stalker.\n\nHealthcare workers and cops dating is pretty much a meme at this point, but I’ve seen it happen enough times i wanted to make this post. \n\nI’m sure some of yall have had wonderful relationships with folks in law enforcement. I get that having a partner who sees and understands the traumatizing shit a lot of us have had to endure can be comforting. However it can also minimize the traumatic nature things we deal with, and that can become a problem real fast. Trust me I’ve dealt with that before dating someone else in critical care, and it was a serious problem (I’m not saying it always is, just warning it can be a potential problem)\n\nMore importantly 40% families with a cop have experienced some form of domestic violence. It can also be a lot harder to get legal help if things get bad. \n\nJust don’t date cops. ",
    "score": 4334,
    "url": "https://reddit.com/r/nursing/comments/1kikd5y/dont_date_cops/",
    "created_at": "2025-05-09T14:49:53.000Z",
    "num_comments": 623
  },
  {
    "id": "reddit-1ifpqre",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "RN Pay",
    "text": "All this school for Costco workers to be making the same as nurses in some areas? We really need to demand better working conditions and pay. And no, I’m not saying Costco employees don’t deserve good pay as well. I’m saying nursing should be paying more for what we put up with. ",
    "score": 3433,
    "url": "https://reddit.com/r/nursing/comments/1ifpqre/rn_pay/",
    "created_at": "2025-02-02T05:00:45.000Z",
    "num_comments": 376
  },
  {
    "id": "reddit-1j0lq31",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Should I pass this student?",
    "text": "I'm a preceptor on a busy surgical unit, and I currently have a capstone (senior level) nursing student with me. She has done 7 shifts with me so far. She is doing an online RN program, and has never worked as a CNA. Also has something of a military background, though I don't know the specifics. She told me her plan was to blow straight through school to being an NP and never actually work as an RN. \n\nThe first couple shifts she was late (like 7:30 late and completely missed shift change/report) and also didn't have a stethoscope (!!!). She always asks if she can go get coffee/breakfast during the busiest morning hours of the shift. She had literally NO idea how to do assessments. I mean, none. I had to send her youtube videos to watch to get her up to speed. I have spent the majority of our clinical time showing her mundane CNA level shit...bed changes, transfers, etc. She often is clueless about the meds ordered and why, and seems to know very little about common diagnoses (CHF, PNA, etc).\n\nAs time went on I grew more impatient with her. She came to me for EVERY tiny thing. I started responding to her questions with, \"I don't know. You're the nurse. What do YOU think you should do?\" (not to be mean at all, just to start pushing her with the critical thinking). She never has any good answers, and relies on me to tell her whether she should give someone tylenol. \n\nYesterday I had a ridiculous assignment with 3 extremely heavy pts, plus 2 lighter ones on the other side of the unit. Just out of pure desperation I told her to take the 2 easy ones so I could get the others stabilized quickly. Seemed like things were going well. At 4 pm I finally had time to look at her charting on the other 2. One of her pts had a BP of 201/112 in the morning. I asked her why she hadn't told me this...?!? \"Well I treated it. I gave him 10 mg of PO lisinopril (scheduled)\". His next recorded BP at noon was 197/110. She never told me any of this, nor had ANY concern when I became alarmed over it. Granted, it was partially my fault for trusting a student and not monitoring her, but again I was DROWNING with the other 3 pts. Shouldn't a senior level nursing student at least be able to identify abnormal VS?!? \n\nSo...her instructor has told me it is 100% based on my review of her if she passes or fails. I feel she is light years away from being ready to practice as an RN. And again, she seems to not care a ton about her clinicals as she is planning \"to just be an NP anyway\". \n\nI hate to fail someone who has invested the time, money, and effort...but holy shit. I don't want it on my conscience either that I promoted someone who absolutely isn't ready. What should I do?!??",
    "score": 3238,
    "url": "https://reddit.com/r/nursing/comments/1j0lq31/should_i_pass_this_student/",
    "created_at": "2025-02-28T23:38:56.000Z",
    "num_comments": 1423
  },
  {
    "id": "reddit-1hvggse",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Saw this in r/IntensiveCare",
    "text": "I'll admit the bottom comment made me LOL but I work in a medical ICU and see this just about everyday and it's so sad and honestly sometimes kind of triggering. \n\nLike I understand not everyone has medical knowledge and can of course empathize with not wanting to say goodbye to your loved one but IMO it doesn't take a medical professional to discern when your love one should be left to pass away peacefully/with dignity. \n\nI'm not talking about not letting the healthcare team do everything they can (within reason) to prolong their life, more so referring to CPR and what I'd consider aggresive means to resuscitate very old people with very low quality of life. \n\nI've been in EMS for going on 3 years, so CPR is nothing new to me, I've ran more full-arrests than I can remember, and more often than not we've obtained ROSC but I usually find myself thinking \"okay but at what cost?\" And \"did we really do this person a favor?\".",
    "score": 2583,
    "url": "https://reddit.com/r/nursing/comments/1hvggse/saw_this_in_rintensivecare/",
    "created_at": "2025-01-07T01:58:19.000Z",
    "num_comments": 148
  },
  {
    "id": "reddit-1o34o4j",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I reported a doctor in my ER for SA. I lost my job, I lost everything.",
    "text": "I'm an RN. Earlier this year, I reported a doctor in my department for SA. I made a post about this a few weeks ago but wanted to further discuss the situation with new information.\n\nNot only was he a doctor in my department, but last year when I was admitted as a patient into his ER, he texted me off-the-books medical advice, interpreting my labs, diagnosing me, etc. all via text. He even offered to give me an off-the-books diagnostic procedure at work (which I obviously said no). When I was a month post-op from the surgery that he guided me through is when the SA occurred.\n\nI reported him at work and he was put on \"paid leave.\" I was told he was coming back but he never did, and it's been 6 months.\n\nI made a complaint to my state's medical board, as did my PCP (because I told him about it first). I'm interviewed, he's interviewed. In the meantime, I quit my job, because I was given a safety plan to avoid him which was later taken away. I went on short term disability but my doctor's extension wasn't approved. It was a lot.\n\nI received an email recently that the state board is closing my complaint due to lack of evidence.\n\nI feel completely tired, worn out, existentially exhausted. I have no job, I feel like I should never have reported if this is how I would get treated. I need a new job but am dreading going back to work as a nurse. Words of advice or how to cope with this would be very helpful.\n\nEdit: I reported the SA to the police when all of this happened.",
    "score": 2568,
    "url": "https://reddit.com/r/nursing/comments/1o34o4j/i_reported_a_doctor_in_my_er_for_sa_i_lost_my_job/",
    "created_at": "2025-10-10T15:50:53.000Z",
    "num_comments": 453
  },
  {
    "id": "reddit-1isrmx8",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I was the rapid response today.",
    "text": "TLDR: Male combat veteran RN passes out from butt play.\n\n\nWent into the VA for GI consult for some hemorrhoids that had been giving me pure hell for the last 3 months. Doc and I agreed to do a rubberband ligation on 1 of my 2 hemorrhoids. I've never had this procedure before. Doc tells me to take a deep breath while she secures the band. She ties the band and I felt a pressure in my rectum I have never felt in my 32 years on this earth. It felt like how a momma cat grabs her kitten by the scruff of their necks and they deactivate. But in this scenario my 285lbs ass deactivated as I was dressing myself in the room with the doc and rn. The tiny RN catches and pivots my body weight and gets me safely to the ground. \n\nAll I remember was feeling so flushed and nauseous and then... nothing. The next thing I know, I'm surrounded by people giving me ice packs and juice while others were taking my bg and vs. I ended up staying for about an hour until my vs were good and I felt better. \n\nI am very thankful for the entire team that ensured my safety. Sometimes as a nurse, we forget the experiences of being a patient and being cared for. \n\nThank you guys. \n",
    "score": 1979,
    "url": "https://reddit.com/r/nursing/comments/1isrmx8/i_was_the_rapid_response_today/",
    "created_at": "2025-02-19T00:12:39.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1n5xbp6",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Baby born at Burning Man. Big shout-out to the NICU nurse who responded! (Honorable mention to the OB/GYN in his undies) (NYT gift article)",
    "text": "TL;DR woman didn't know she was 36wks pregnant, wasn't trying to conceive. Wakes up with abdominal pain, rapidly delivers a 3lb 9.6oz baby girl in her RV bathroom. RN with NICU experience happens to be camping next door, hears the husband yelling for help, shows up &amp; leaps into action (along with a peds MD &amp; an OB/GYN in his skivvies - not unusual attire for the playa). Baby airlifted to NICU in Reno. Baby &amp; mom seem to be okay so far. \n\nThis quote from the nurse gave me chills: \n\n&gt; \"The hardest part was knowing, as a nurse, what can go wrong,” Ms. O’Reilly said. She added, “Having no resources was frightening.” \n\n&gt; Ms. O’Reilly asked the campers to turn on the heat as she examined the baby’s mouth and airways, checked her coloring and her posture and monitored her breathing. The baby was small, Ms. O’Reilly said, but she had pink coloring and was crying and breathing well, all good signs. Campers found a heated water bottle to help keep the baby warm. Ms. O’Reilly recalled soothing the newborn, saying, “Come on, baby. It’s OK.” \n\nI can't imagine doing emergency neonatal care in the MIDDLE of the DESERT with nothing but a towel &amp; a hot water bottle. So much pressure &amp; so few resources. Mad respect to Maureen O'Reilly from the Bay Area. Pretty amazing work, IMO. ",
    "score": 1969,
    "url": "https://reddit.com/r/nursing/comments/1n5xbp6/baby_born_at_burning_man_big_shoutout_to_the_nicu/",
    "created_at": "2025-09-01T18:54:19.000Z",
    "num_comments": 146
  },
  {
    "id": "reddit-1itpix7",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "My nursing journey in 10 years",
    "text": "My nursing journey started when I got my CNA license in 2015 in high school which then I entered a 4 year program nursing program. I had failed two classes which almost got me kicked out the program but the professors readmitted me and I graduated with my BSN in 2017. I started as a new grad in 2018 and worked in a neuro-medsurg floor for 4 years until 2021. I then went on to do travel nursing and till now I do local traveling. In 2024 I got accepted into a DNP program in the acute care program and in 2025 I got accepted in to an ICU position after doing medsurg for 7 years. So to all my people who are struggling don’t give up! We all have different moments in life when things can happen. You got this. 🫶🏻",
    "score": 1660,
    "url": "https://reddit.com/r/nursing/comments/1itpix7/my_nursing_journey_in_10_years/",
    "created_at": "2025-02-20T03:58:12.000Z",
    "num_comments": 93
  },
  {
    "id": "reddit-1i7nwr9",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "All NIH study sections- the work/salaries of 300k people at more than 2,500 institutions- canceled indefinitely",
    "text": "Well, folks, [I figured it'd be bad fast, but dang](https://bsky.app/profile/monscience.bsky.social/post/3lgecous7j22w).\n\nQuote:\n\n\"[All NIH study sections canceled indefinitely. This will halt science and devastate research budgets in universities. Apparently, the Federal Advisory Committee Act (FACA) allows the president or advisor to terminate any advisory committee at any time](https://bsky.app/profile/monscience.bsky.social/post/3lgecous7j22w).\" \n\nThis is going to have an incalculable impact on healthcare provision and research in the United States. Almost certainly to a permanent detriment.",
    "score": 1618,
    "url": "https://reddit.com/r/nursing/comments/1i7nwr9/all_nih_study_sections_the_worksalaries_of_300k/",
    "created_at": "2025-01-22T22:27:42.000Z",
    "num_comments": 284
  },
  {
    "id": "reddit-1k562ni",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Just got fired",
    "text": "I’ve been an RN for 20+ years. I have been with a home hospice company for over 2 years and was just fired for the first time ever in my career. The reason was due to refusing to take another patient assignment last week (I had been slammed w 9 admissions already in a row along w 7 deaths consecutively in the last 2 weeks and was totally exhausted-I said I needed a breather), one of these admissions was a horrible APS case beyond the scope of home management that I sounded the alarm  repeatedly about to management-I was told “we don’t talk to families” and “you just need to learn how to manage\npeople” and his final reason for letting me go-“you don’t seem happy here”.  I had great relationships w my patients and their families. I mainly feel the issue was I had clear boundaries with management and culturally they didn’t like it. I’m kind of relieved in one sense but I am also at a loss. I’m hoping it leads to a better job. \n**UPDATE**: I won my unemployment claim, unemployment said I did nothing abnormal out of the normal course of my job to warrant my termination and that they failed to prove anything other than they just didnt like me in essence. I wasn't on unemployment for more than 2 weeks but I felt vindicated knowing the state saw there was no legitmacy to anything they said. I got hired on for 3 PRN jobs that were a $10 hourly increase in pay and all is well. Thank you for everyone's support!",
    "score": 1555,
    "url": "https://reddit.com/r/nursing/comments/1k562ni/just_got_fired/",
    "created_at": "2025-04-22T13:17:35.000Z",
    "num_comments": 281
  },
  {
    "id": "reddit-1orhhgc",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I made a mistake at clinical and it got me a job offer",
    "text": "I'm in my final semester and doing my leadership clinical in the ED with a preceptor. A few weeks ago I had a patient who needed one dose of IV abx and would be discharged after. I started the IV and hung the abx with my preceptor nearby and went to see other patients. I came back about an hour later to remove the IV and discharge the patient, but saw the bag was still full of abx. I saw that I had the j-loop clamped and my heart literally dropped (we use dial-a-flow tubing, so no pumps to alert). \n\nI felt so incompetent and went and told my preceptor, who happened to be talking with the ED manager when I walked up. My preceptor said thanks for being honest and everything was fine. \n\nFast forward to last week, I had an interview for a new grad position in the ED. \nI got offered the job earlier this week!!\nMy clinical coordinator was part of the interviewing panel and later told me that the ED manager told the panel about what happened with the IV and said she was so impressed with how I handled it. She said the first thing the manager said after I left the interview was \"I want her in my department.\"\n\nI'm the type of student who is always terrified of making mistakes, so I wanted to share this and say sometimes mistakes are okay! I've learned this semester that mistakes are inevitable as new nurses and it doesn't make us stupid or careless. Good leadership will give you respect for owning up to a mistake. ",
    "score": 1479,
    "url": "https://reddit.com/r/StudentNurse/comments/1orhhgc/i_made_a_mistake_at_clinical_and_it_got_me_a_job/",
    "created_at": "2025-11-08T05:42:35.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1j39p86",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Is wearing a pride pin safe?",
    "text": "I’m just starting a new job as an RN at a new hospital. Ive wanted to wear a pride pin like the one above so my marginalized patients know that they are not going to be judged or discriminated against while under my care. I work in a large urban hospital, the only one in my area of the city. My patients have already made comments on my septum piercing, I’m including that info bc I wonder if I’d get even more comments by wearing a pride pin. Im worried that even though I feel this is the right thing I may spur harassment or bad conversations by wearing it or even worse. I’m wondering, is this safe? Have any of you had bad experiences wearing a pride pin? Should I check with management? For reference I’m in MI. ",
    "score": 1457,
    "url": "https://reddit.com/r/nursing/comments/1j39p86/is_wearing_a_pride_pin_safe/",
    "created_at": "2025-03-04T12:31:04.000Z",
    "num_comments": 503
  },
  {
    "id": "reddit-1oob85j",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "RN laughs at people losing their food stamps",
    "text": "Why are some nurses inhumane? I can't imagine laughing about people losing their food stamps. Children, veterans, people with disabilities depend on these benefits. ",
    "score": 1432,
    "url": "https://reddit.com/r/nursing/comments/1oob85j/rn_laughs_at_people_losing_their_food_stamps/",
    "created_at": "2025-11-04T16:08:52.000Z",
    "num_comments": 388
  },
  {
    "id": "reddit-1l64df5",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Fired for Whistleblowing, Found Something Better",
    "text": "This is a throwaway account, as I’ve been advised by legal counsel not to speak publicly about this—but I’m struggling to process everything and need to let it out.\n\nI come from a nursing background and transitioned into administration several years ago. At first, my clinical expertise was valued and respected by both leadership and peers. But over time, it became clear that my commitment to clinical integrity and regulatory compliance was seen as more of a nuisance than an asset.\n\nIt all came to a head when I was instructed by leadership to implement a directive that would have jeopardized the professional licenses of my staff and put patients lives at risk. The request blatantly violated internal policy, state regulations, and federal guidelines. I refused to comply. I anonymously reported to state regulators what my leadership was asking me to do.\n\nDespite having a spotless record—no corrective actions and a glowing annual review—I was terminated within days.\n\nSince then, more than half of my former team has resigned. Many have reached out privately to express their disappointment and outrage. Several colleagues, including individuals in senior leadership roles, contacted me directly to encourage me to seek legal counsel, sharing how troubled they were by how the situation was handled.\n\nI did just that. My attorney reviewed the facts and confirmed I have a strong case. I submitted all supporting documentation, and as of today—exactly 30 days since I was let go—the company has been formally served.\n\nLast week, I interviewed at a competing organization. To my surprise, they had already heard about what had happened (extremely embarrassing), and were even more surprised when they realized it was me sitting in front of them. Without pressing for details, they offered me a job on the spot—with a salary $28K higher than what I was previously making.\n\nThen, this morning—just hours after my attorney informed me that the legal filing had been completed—I received another job offer from a different organization (completely different field of nursing, but similar position to what I had before), this one offering $46K more than my former salary.\n\nThis past month has been emotionally exhausting. I’ve barely slept, barely eaten, and I’ve started seeing a therapist who, truthfully, hasn’t been much help. I’ve questioned myself repeatedly—even though I know in my heart I did the right thing.\n\nI was dreading today. One month since everything unraveled. But somehow, today brought some of the best news I’ve received in a long time.\n\nIt’s Friday, and I haven’t accepted either offer yet. I plan to make a decision by Monday and let them both know.\n\nAll of this to say: sometimes, when things fall apart, it’s because something better is waiting on the other side.\n\nAnd thank you for reading, if you've made it this far. I have a lot of shame related to being fired, and outside of my significant other, I told everyone I quit, so I don't have anyone to share this with. Regardless of the outcome - whether my former employer settles or it goes to court - I've finally started to make my peace with it. ",
    "score": 1421,
    "url": "https://reddit.com/r/nursing/comments/1l64df5/fired_for_whistleblowing_found_something_better/",
    "created_at": "2025-06-08T05:13:31.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1pcx47r",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "RN’s are getting phased out of our hospital",
    "text": "I’m an RN on a med/surg floor. Our normal ratio is 1:5, sometimes 1:6 on a bad day — but honestly our unit has always been pretty stable and fairly staffed.\n\nThen admin decided to “fix the nursing shortage” by hiring large numbers of brand-new LPN grads for almost half of the RN wage. The new model is:\n\t•\tLPNs get 6 patients each\n\t•\tOne RN “supervises” two LPNs\n\t•\tSo the RN is now responsible for 12 patients + 2 brand new nurses every shift\n\nMeanwhile… our unit was already fully staffed with RNs.\n\nBecause they suddenly don’t “need” us, they started putting RNs on standby for $3/hr. If we don’t get called in, they automatically pull from our PTO to pay out the shift. And when we do get called in, we’re floated to any unit that is short.\n\nToday FOUR RNs were put on standby. During huddle someone asked, “Is there a plan to fix this?” Management said:\n\n“We’re doing LPN blitz hiring for all the units that are short staffed.”\n\nAnother nurse asked:\n\n“So we’re going to be put on standby until enough RNs quit?”\n\nManager:\n\n“…Yes.”\n\nI wish I was joking.\n\nThey’re planning to roll this model out to progressive care next year.\n\n\n\nWhere the hell am I supposed to find a job if this takes off and other hospitals start adapting to this model? How am I going to get fair pay in a flooded market? I put myself in over $30K of debt to get my BSN., thinking I would always have job security. \n\nBeing responsible for 12 patients and two new grads is unsafe. They will not sit down and talk to us about the degree of legal responsibility we’re facing if an LPN screws up under our supervision. One nurse was told by management to get insurance. \n\nI can’t sleep.  Please tell me if this is happening where you are working, or if you’ve seen this plan fall apart, because I’m about to lose my mind. \n\n\nTL;DR:\n\nMy hospital is replacing RN staffing with large numbers of brand-new LPNs. Each RN now “supervises” two LPNs and is effectively responsible for 12 patients every shift. RNs are getting put on standby for $3/hr and losing hours while management openly admits they’re hiring LPNs until enough RNs quit. They won’t address the legal liability we face supervising these LPNs, and the model is expanding to progressive care. I’m scared for my license, my job security, and the future of the RN role. Has anyone seen this elsewhere or watched this model fail?\n\nEDIT:\nWow! This post got as much attention as I hoped it would — thank you to everyone who’s been commenting and sharing your experiences.\n\nA few people mentioned something I hadn’t even considered: that The Joint Commission is rolling out new staffing ratio expectations next year.\n\nIf that’s true, then what my hospital is doing starts to make a terrifying kind of sense:\nInstead of fixing RN staffing, they’re building a model where LPNs carry most of the patient load, and the RN is just there to supervise and absorb the liability.\n\nOn paper, hospitals can say:\n“Look, we have the correct number of licensed personnel for the ratios,”\neven if the actual care burden and the legal risk fall entirely on the RN.\n\nIt would explain the huge push to hire a ton of LPNs\n\nIf this is the direction hospitals are going to meet compliance benchmarks, then everyone in the profession should be alarmed, because this model threatens:\n- patient safety\n- RN job security\n- appropriate delegation\n- licensure protection\n\nThis whole situation just reinforces something a lot of nurses have been saying for years: we don’t actually have a “nursing shortage” — we have a shortage of nurses willing to work under unsafe conditions for inadequate pay. Hospitals are absolutely manufacturing the shortage. \n\nWhen hospitals can hire LPNs for half the cost of RNs and then put RNs on standby, float them, or push them out entirely, it becomes really clear the shortage isn’t about a lack of licensed nurses — it’s about a lack of acceptable working conditions that keep those nurses practicing at the bedside.",
    "score": 1374,
    "url": "https://reddit.com/r/nursing/comments/1pcx47r/rns_are_getting_phased_out_of_our_hospital/",
    "created_at": "2025-12-03T06:41:01.000Z",
    "num_comments": 634
  },
  {
    "id": "reddit-1iposa3",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "So:  how is everyone doing 😖",
    "text": "So, my job is 100% funded by Medicare.  \n\nIf we lose medicare, I won’t be working. \n\nI’m 55 and I’ve worked as a hospice RN for nearly 30 years.  I guess I’ll just stop working.  \n\nSo go ahead and say “they won’t touch Medicare” \n\nYou sure about that?  Like; real sure?  ",
    "score": 1337,
    "url": "https://reddit.com/r/nursing/comments/1iposa3/so_how_is_everyone_doing/",
    "created_at": "2025-02-15T00:01:21.000Z",
    "num_comments": 392
  },
  {
    "id": "reddit-1of76zo",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Just need to scream into the void",
    "text": "I was just soft offered a DON position at an assisted living facility in Salt Lake City for....\nAre you ready?\nSEVENTY THOUSAND A YEAR. $70K. $70,000. A YEAR.\nI'm currently doing admissions for home health (a field I've been in for over 2 years now) and making $79k! With no on call responsibility! This city has one of the highest COLs in this part of the country! I couldn't even pay my bills on that without my husband's income. I'm a BSN with over 20 years in healthcare, I've literally been doing geriatrics since high school. I graduated as an RN in 2018. I HAVE THREE RELEVANT DEGREES. \nAND THEY WANT TO PAY ME SEVENTY THOUSAND DOLLARS A YEAR TO OVERSEE AN ENTIRE FACILITY. I'D BE EXPECTED TO BE THERE ON THANKSGIVING AND CHRISTMAS AND INDEPENDENCE DAY AND *LITERALLY EVERY HOLIDAY*.\nI just can't you guys. This is one of the most insane things I've seen in my career. My flabbers are gasted. ",
    "score": 1330,
    "url": "https://reddit.com/r/nursing/comments/1of76zo/just_need_to_scream_into_the_void/",
    "created_at": "2025-10-24T19:35:00.000Z",
    "num_comments": 161
  },
  {
    "id": "reddit-1o91072",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Guys I hit a nerve 🫣",
    "text": "See my prior post regarding a mom in a facebook group for nursing students who mentioned that her daughter is in a dual enrollment BSN to pediatric NP program (she does not have an ADN or any prior nursing experience). I responded that no ethical nursing program would allow this to happen and it is diploma mills like these that are creating the untrust of NPs within healthcare. I guess she didn’t like my response and that I responded with a laughing emoji response 🫢",
    "score": 1315,
    "url": "https://reddit.com/r/nursing/comments/1o91072/guys_i_hit_a_nerve/",
    "created_at": "2025-10-17T13:14:34.000Z",
    "num_comments": 278
  },
  {
    "id": "reddit-1ondewl",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Nursing is for people not smart enough to become MDs",
    "text": "I’m currently a senior in nursing school (getting my BSN). My dad is a MD and has this belief that doctors are the apex of the healthcare system. He was telling me that everyone in the healthcare industry is envious of doctors… physician assistants, CRNA, midwife’s, nurse practitioners, physical therapists! \n\nHe was saying someone can become a NP, or CRNA and they will NEVER be a doctor. \n\nWe ended up have a disagreement, in my opinion the only similarities between MD and the other healthcare professions are because they are in healthcare… scope of practice is totally different. \n\nHe said nursing is meant to be a bedside and people are becoming nurse practitioners to leave the bedside - which is wrong. I think it’s amazing when people advance their career. \n\n\nI can’t even tell my dad by career aspirations because he’ll just say I want to be a “doctor without doing the hard work”. He is so judgemental of every healthcare career other than medicine. \n\nHas anyone else experienced the same thing, and if so how did you overcome it? \n\nEdit: he is trying to convince me to be a doctor/go to medical school. I don’t have the determination to be a doctor, I value what they do but I couldn’t be part of their profession. I’m 20 (so I’m still quite young), at the moment I want to become a midwife. ",
    "score": 1162,
    "url": "https://reddit.com/r/nursing/comments/1ondewl/nursing_is_for_people_not_smart_enough_to_become/",
    "created_at": "2025-11-03T14:37:24.000Z",
    "num_comments": 800
  },
  {
    "id": "reddit-1lt58ho",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "New grad shocked by 1st paycheck",
    "text": "I'm a new grad in a major city in the south. I took a job on a unit I worked on as a tech (and love the specialty &amp; the vibes of the unit) it's a better hourly than most of my classmates because they took jobs with another hospital system. We make full wages in orientation (can't work overtime) and I was honestly shocked in a bad way over my first check. I've worked in the service industry for 8 years previously. The money definitely varied in the service industry with slow/busy seasons but it seems hourly post taxes I was making more. I'm trying not to feel too discouraged because I am a new grad and I know I gotta put in time and work my way up. But for a job with such serious responsibility and student loan debt, it's definitely disheartening. I'm curious to see if anyone else felt  this way/how fast salaries increased. ",
    "score": 1121,
    "url": "https://reddit.com/r/nursing/comments/1lt58ho/new_grad_shocked_by_1st_paycheck/",
    "created_at": "2025-07-06T16:21:34.000Z",
    "num_comments": 441
  },
  {
    "id": "reddit-1jkc7sy",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "My ER got swatted on Sunday.",
    "text": "I’m a PCT at my local ER as well as a 4th year getting my BSN. I strolled into the unit 7 am on Sunday, humming with my coffee over to the nursing station. There were police walking around with their guns out, as well as our security along with them. All of the day shift nurses and techs were looking around confused while the night shift charge is going back and forth with one of the cops. Apparently a patient who had been discharged was mad at us and called 911 from outside saying “hospital security stabbed two nurses and shot one more”. Thankfully the cops figured it wasn’t actually happening since there wasn’t any panic when they walked in but the idea of getting swatted is trippy to me. I’m hoping this lady gets charged (they were tracing their number last I heard) since one of us could’ve been accidentally shot. \n\nIt’s easy for me to laugh about it now, but considering how many people have accidentally been killed by swatting, it could’ve gone really wrong. ",
    "score": 1020,
    "url": "https://reddit.com/r/nursing/comments/1jkc7sy/my_er_got_swatted_on_sunday/",
    "created_at": "2025-03-26T13:49:40.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1lunntp",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Badge buddy vs name tag",
    "text": "Hey fellow nurses. There seems to be some confusion about what a badge buddy is vs your normal name tag. Since there are not photo comments, I am making a post. This is not meant for argument, just as a visual representation for those who may not know what a badge buddy is. \n\nIn every place I have worked, your badge buddy displays your professional role (RN, MD, NP, NA, PCA, etc) and does not reflect your actual role or education level. This may be different where you work, but I have personally not seen it any other way. ",
    "score": 879,
    "url": "https://reddit.com/r/nursing/comments/1lunntp/badge_buddy_vs_name_tag/",
    "created_at": "2025-07-08T12:47:05.000Z",
    "num_comments": 268
  },
  {
    "id": "reddit-1jur7xl",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Caught a dysrhythmia as a student",
    "text": "Hello everyone! \n\nToday I had a client that was telemetry monitored. I was watching my patient’s rhythm on the monitor in his room, and it looked just like A. Fib. So I ask him - have you ever had A. Fib. before? He says no. The staff nurse was also in the room and comes over to look and tells me it is not A. Fib. \n\nSo a little later I’m looking at it again and I think - I swear that has to be A. Fib. So I show my instructor and she says “it probably just looks like it”. \n\nAgain later, the computer is alarming that this patient is in A Fib, and so I get my instructor and the staff nurse and tell them again I’m pretty sure IT IS A. Fib.!!! \n\nFinally, they get a 12 lead EKG - and I was right! It truly was new onset A. Fib, and I caught it first. I felt really happy - like maybe I won’t be such a bad nurse. \n\nI just wish others had believed me hours earlier hehe…",
    "score": 879,
    "url": "https://reddit.com/r/StudentNurse/comments/1jur7xl/caught_a_dysrhythmia_as_a_student/",
    "created_at": "2025-04-08T23:02:57.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1jxt5kl",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "A warning story for if you're considering cheating on those ATI exams",
    "text": "I got permission to post this by my friend. One of my classmates and close friends just got caught purchasing a test banks for the ATI maternal newborn and fundamental exams. \n\n**For background:** Majority of the \"test banks\" you're seeing online are actually scams. We also had classmates spend hundreds purchasing ATI test banks and they ended up actually being the questions from either the practice exams, older versions, and just questions from dynamic quizzing. In all honesty, those are the students who are lucky though- they're just out a few hundred dollars. \n\nWhat happens when the real test is found online is a lot deeper though. My friend was one of the few students who actually managed to get an actual copy of the proctored exam. She got a 88 and a 100%. A few weeks went by and she thought she was in the clear. But ATI is incredibly thorough about exam security. \n\n**How was she caught?** The way they caught her wasn't because of her score. But they caught the individual selling the material. According to our professor who works for ATI, there's trigger words apparently for many questions that ATI use specifically for their exams. They apparently have employees whose sole purposes are to look for copies of their exam. And they're extremely litigious. Officers are able to submit a warrant to get the payment info on who the material was distributed to on the distributors bank account and laptop. This is viewed as a criminal investigation. My classmate paid via PayPal. Her name was on her PayPal account. \n\nNote: for websites likes student doc, chegg, and such,  it's actually written in their policies that the material cannot be used for blatant cheating. If a professor files an inquiry, they will readily hand over the account registration email and names for the credit/debit card info- even without a warrant. This is copyrighted material and large websites don't want to get sued. \n\n**What is the school/ATI doing about it?**\nShe was called in by the school and told that ATI has contacted the school regarding the infraction. She's being expelled and she was advised by the school to get a lawyer. ATI has already contacted the BON and she's likely going to see legal papers regarding the infraction. She will almost 100% be barred from attending any accredited nursing program and taking the NCLEX. She will never become a nurse. The school literally isn't doing anything except letting her go, ATI did everything. Other schools and students will likely be contacted because of this breach. \n\n**Why did she do it?**\nShe was failing the course. She was struggling and is on a waiting list to be evaluated for ADHD. Her mom is sick and she was overwhelmed and desperate. Now she wishes she just failed. It doesn't even matter. It's 5%-10% of our grade and the remediation is only if you fail both the exam and the course itself.  \n\nYes, she knows she was dumb. You guys don't have to say it. She knows she messed up. But if you think spending a few hundreds to pass the ATI is worth it, it won't be worth the thousands she will have to spend on a lawyer now. And never being able to become a nurse. \n",
    "score": 770,
    "url": "https://reddit.com/r/StudentNurse/comments/1jxt5kl/a_warning_story_for_if_youre_considering_cheating/",
    "created_at": "2025-04-12T22:29:07.000Z",
    "num_comments": 206
  },
  {
    "id": "reddit-1nom16n",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Patient deaths increased in emergency departments of hospitals acquired by private equity firms. Researchers linked increase in mortality to cuts in salary and staffing levels. Findings amplify concerns about growth of this for-profit ownership model in health care delivery.",
    "text": "",
    "score": 706,
    "url": "https://reddit.com/r/nursing/comments/1nom16n/patient_deaths_increased_in_emergency_departments/",
    "created_at": "2025-09-23T16:26:31.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1kgmpa0",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Bidding farewell to this sub because I am officially done with nursing school!!!",
    "text": "I really didn’t think I’d make it to this point. I did well academically, but it was SO tough. I hadn’t been back in school for nearly 5 years when I started and was worried I’d be the oldest, but couldn’t be further from the truth! My class was a wonderful mix of people in all different stages of life and I’ve made some amazing lifelong friends. I commuted at least an hour to campus at least 3 days a week and sometimes over 2 to different clinical sites and usually got up around 3:50 AM to make it. Our program was very rigorous and an 80% was the passing grade. My past experience as an EMT and pediatric scribe saved me, I think. My final grade this semester was an 86, which is somehow still a C. We started with nearly 50 of us and 23 are being pinned next week. I’m so excited to begin my career as a pediatric ICU RN!\n\nBest of luck to everyone here. It’s tough, but you can do it! Would be happy to help at any time if anyone needs advice or anything so don’t hesitate to reach out 😊 now I want to know how everyone else is doing! Are y’all finishing up your semesters?",
    "score": 626,
    "url": "https://reddit.com/r/StudentNurse/comments/1kgmpa0/bidding_farewell_to_this_sub_because_i_am/",
    "created_at": "2025-05-07T02:34:15.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1m01kye",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I unknowingly did something during clinicals that ended up helping me a lot during interviews. Here's my advice!",
    "text": "A year ago, I did a supplementary nurse externship on a telemetry unit. At the beginning of the program, the hospital's nurse educator handed out flimsy little marble notebooks and asked us to write weekly reflections. She never did follow up on our notebooks, but I'd sit down at the end of some shifts and I'd write about what I did. Mostly I wrote about interesting patients, my feelings, new things I learned, and insights to reflect on. It was very easy and low effort because all I did was very casually write out my thoughts for the day, while they were still fresh.\n\nI recently graduated and got my license. I am going on interviews now. I revisited my little marble notebook, and let me just tell you... Wow. There is SO much stuff in there that I forgot about. Cool cases, interventions I did, and extra attention I gave to patients. It's almost like I wrote myself a guide to interview \"situation\" questions. Now when I go on interviews, I am faced with all those thought provoking questions:\n\n*\"Tell me about a time you advocated for a patient...\"*\n\n*\"Tell me about a time that you made a mistake...\"*\n\n*\"Tell me about a time you had a conflict with a coworker, and how you handled it...\"*\n\n*\"Tell me about a time when you had to escalate a patient's condition...\"*\n\nI've got stories for ALL of these. They are real, and they are what shaped me. And some of them I absolutely would not have remembered if they weren't written down.\n\nSo my advice to you is to buy a cheap little notebook, and maybe once a week during clinicals, write about your feelings. Not another dumb intensive care plan, just what you did and the thoughts you had. It is a personal safe space and no one is judging you. Sometimes when you have an interesting patient, you feel like you will remember them forever, but you often don't. You might graduate eighteen months from now, and you will have completely forgotten that day that you took extra time to talk to a hospice patient and did something extra to keep them comfortable. It might even be something that didn't seem very important at the time, but would be a fantastic example to give during an interview.\n\nBest of luck, my friends!",
    "score": 606,
    "url": "https://reddit.com/r/StudentNurse/comments/1m01kye/i_unknowingly_did_something_during_clinicals_that/",
    "created_at": "2025-07-14T23:06:11.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1kumo8a",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Why I Left Nursing",
    "text": "EDIT: Thank you so much for all your encouragement and the award! I’m proud to have been a part of this community. We’re stronger than we believe! If reading this truly struck you and you’re ready for an out, I hope you consider a change. Life is too short to be in a career you don’t like. It’s hard to leave what you know, but I truly believe it’s worse to be complacent with unhappiness long term. For me, college will only be another three to four years. The time will pass regardless. \nFor anyone reading this who found their heart here in nursing, I want to thank you again. You’re truly inspiring and the reason someone like me is living today. It’s cliche and we’ve all heard it a million times but I’ll say it once more. You save lives (yes, even by wiping by butts). Thank you. &lt;3\n\nWhen I became a registered nurse, I had already caught a glimpse of the less than idyllic reality that the healthcare system is.\nNursing school had a wonderful way of slowly feeding it to us over the semesters. \n\nAt the very start our professors told us heartwarming stories of all the nurses making differences in the lives of their patients. There was the brief reminder to “remember you’re not in this for the money”. \nBut of course not. At least not for me! No, I was going to save lives and make a difference in the world. \n\nNursing school was ruthless. We rolled up our pants so our clinical instructors could make sure our socks were white. All exam question choices were correct, but only one was the most correct. Below a 75 was considered a failing grade. Any absence in class was a huge deal. \nNeedless to say, there was a constant anxiety that permeated the classroom. We joked about throwing ourselves off the roof of the nursing building. \n\nOn my worst nights, deep in study and unable to take time to process what I witnessed in clinical that day, I contemplated why I didn’t.\n\nEach semester, we were exposed to the real world a little more. One day at clinical, an instructor told me to always lie and say we were married with three kids when a patient asked if we were single. I was naive. It sounded silly at the time. Why would they ask that? \nSoon enough, I had to tell a patient I was married with three kids.\n\nAt the end of nursing school, we had an entire class that focused on how litigious patients can be. As they should be. After all, nurses should never make mistakes. \nAnd anything that patients do to hurt us? We’re taught to report it. Yet somehow it’s still our fault. \n\nWhen I graduated and started my career in the ER, I was still determined to make a difference. Nursing school was worse, I reasoned.\n\nOn my best shifts I saved lives.\nMost shifts patients left with little answers. Or they were transferred to a floor with even worse coverage for care. Or they died. No matter what, I strived to make it a priority to be a shoulder to lean on. I held my patients hands. I’d always bring two warm blankets instead of one. I always tried to think of the little things. If I had three critical patients I still tried my best not to forget the turkey sandwich the least critical patient wanted. I did my best to think of everyone as a family member. I knew it hurt to do it that way, but the alternative was to see them as a job and ultimately, less as people. \n\nFor every good experience I had, I experienced several more terrible things. \nI once helped roll a body to do postmortem care and had their blood cover my shoes. As a matter of fact, I’ve been covered in all sorts of body fluids. I have been clawed at, spat on. I’ve had things thrown at me. I’ve been groped. I’ve had a patient threaten to kill me. I’ve cried in a supply closet. I’ve had nightmares. And I’ve hallucinated the constant beeping of monitors in my sleep.  \n\nPlease keep in mind, others have endured much worse. \n\nIt wasn’t long before I started crying before going to work. My heart was giving out. I became a patient myself when I went into SVT for the first time. I had to leave, or my body would make the choice for me.  \n\nSo I tried elsewhere. I worked at urgent care, family care, and finally a private practice. But for everything I left behind, new problems arose.  \n\nI was pressured to work while sick, told I was expected to use my lunch break to continue visits. It didn’t matter that most offices are closed for lunch too. \nGod forbid I ask a year in advance to take leave for my honeymoon. (The answer was “It’s unacceptable to assume you’ll have the time to do so”.)  Oh, and some nurses are bullies. \n\nThen I heard another former coworker took her life. \n\nI had enough. I quit my last nursing job.\n\nWhat I learned is no matter where you go, nurses are undervalued, underpaid (especially in the south USA), and treated as disposable by administration. \n“What about travel nursing?” Of course, there’s always more money to be made—if you want to sacrifice even more of your time, energy, and well-being for an even more stressful position in an unfamiliar environment experiencing a staffing shortage. \n\nNurses are expected to give everything while receiving little in return. We’re given cold pizza and certificates for a job well done instead of livable wages. \nWe’re taken advantage of for the very thing that brought most of us to the profession in the first place: caring.\n\nNursing will always have a place in my heart. I earned my BSN. I earned my RN. I worked damn hard for those letters and what they stand for. I’m proud of the people I have helped, and I will never forget the people I have lost. \n\nI have nothing but respect for fellow nurses who endure in a field that constantly beats them down. There will always be a need for nurses, and for those who thrive despite everything, I applaud you. Thank you for your strength. Thank you for doing what I could not. \n\nI’m studying to be an aerospace engineer now. I plan to use my BSN in conjunction with a BSAE to further advance safety in human space flight. \nI’m only a few semesters in and I’m still amazed at the difference. It’s hard, yes, but I don’t have to roll up my pants to show them I’m wearing space socks.\n\nMost notably, I don’t see articles every week about engineers being beat to near death while the industry brushes it aside.\n\nThank you.\n\nA Former RN",
    "score": 593,
    "url": "https://reddit.com/r/nursing/comments/1kumo8a/why_i_left_nursing/",
    "created_at": "2025-05-24T21:44:53.000Z",
    "num_comments": 82
  },
  {
    "id": "reddit-1ihq7ly",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I failed my RN program",
    "text": "I’ve only shared this with close friends and family. In December of 2019, I failed out of my RN program at second semester. At my school, you had to have an 80 in the class and 80 on the final to pass.  I was borderline on OB, needing a 90 on the final to pass the class. I scored 80-something, failing the class. In my adult 1 final, I scored a 78. Despite having a low-90 overall in the class; I was dismissed from the program as I failed 2 courses. I appealed, wrote letters, had a meeting with the school Dean, all of which ended up a waste of time. On a side note, I learned the next semester they changed the policy to needing an 80 overall, no regards to the final. \n\n2020 came, I started applying to other programs. Despite having taken A&amp;P, I had to retake it as it had expired at being 6 years old. Covid hit, and on came the challenges with that. I completed a&amp;p with a B. \n\nI enrolled in a semi-accelerated program, while still struggling with OB, passed my exams, (this program requires a 78% exam and class average to pass) I graduated spring of 2022 and took my NCLEX about a month later, passing first try. I’m now 2.5 years as an RN with plans to further my education. \n\nIf you’re struggling or even get dismissed like I did, don’t give up. Not all programs are created equal and some are just a better fit. \n\nTake some time and think about your future plans and what you intend to do. If you want to be a nurse, check out other programs. Know that failing isn’t always your fault, some schools care more about having a high NCLEX pass % than actually helping students succeed. \n\nEdit-I later learned that schools who advertise 100% pass rate for X semesters fail to mention that over half the class dropped or failed out. \n",
    "score": 557,
    "url": "https://reddit.com/r/StudentNurse/comments/1ihq7ly/i_failed_my_rn_program/",
    "created_at": "2025-02-04T19:33:02.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1lxng8x",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Wanted to say goodbye to this subreddit :) Finally started working as an official nurse. Thank you for all the support and advice.",
    "text": "Just wanted to say thank you! I remember my first month before starting nursing school. I would go onto r/StudentNurse and found so much good advice from others who walked the journey before myself and also from those who were going through similar challenges as I was. \n\nFor those who are anxious and nervous... you got this! Trust in yourself and truly take it one day at a time. I was in an accelerated program and the program felt extremely quick (especially when we took Pharmacology in 6 weeks...) \n\nJust some advice... \n\n1) Pay attention and active listening in class. Don't worry so much about taking notes. If you listen, you'll retain a lot more than you think. Just write down major key points. \n\n2) Don't focus so much on what works for others... focus on what works for you. No matter what advice someone gives you on how to study or what to study, you just need to find what works for you. \n\n3) Absolutely sit near the front of the classroom. There's less distractions in the front. This is coming from an introvert that used to hide in the way back of the classroom. My grades were a lot higher when I moved to the front (even the middle is fine!) \n\n4) Don't spend all of your time invested in school! If you're doing well, just take that break and go out with your friends. I noticed the more I was relaxed, the better I did on exams. One night, I decided to go out with friends the night before an exam and I surprisingly made a 94. \n\n5) Sleep early before test dates. It really helps... do NOT pull an all nighter... I did not pull any all nighters and I do not think I could. \n\n6) Take care of yourself :-) Try to find something that will help you relieve your stress. \n\n7) For clinicals... don't be nervous! You're new... you don't need to know everything! But also, stay in your lane. Don't be overly confident and try to do things on your own or question nurses about their knowledge (thats not your job). I knew a friend that had previous medical experience and she didn't leave good impressions with the nurses. She ALWAYS had issues with her clinical experiences, instructors, nurses and it made me realize it had more to do with her than the others. Always ask questions... always jump in when the opportunity comes. If they ask \"who wants to do a foley?\" you should say ME!!!! The best time to learn is when you're a beginner and you have people supporting you. \n\n8) Apply to jobs early. Don't spend so much time trying to perfect your resume like I did. I lost my chance to a lot of positions that got filled up quickly. \n\nI'll be leaving this Subreddit, but if anyone ever needs advice, feel free to message me at any time! :-) For those that are in school... you got this! There's a ton of resources online... you do NOT need to purchase those $100+ notecards or study aides!!\n\nGood luck everyone! ",
    "score": 519,
    "url": "https://reddit.com/r/StudentNurse/comments/1lxng8x/wanted_to_say_goodbye_to_this_subreddit_finally/",
    "created_at": "2025-07-12T00:52:57.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1idv8b7",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "PASSED NCLEX!! Officially a registered nurse!!!",
    "text": "I took my NCLEX on Tuesday and it shut off at 85 questions. When I left the testing center I felt like I definitely failed. I tried thinking back to my rationales and my mind was just blank. Spent the past 2 days extremely irritated, assuming I failed and would have to retake it in 45 days. I got my quick results from pearson vue and I PASSED!!! \n\nI used Kaplan to study bc this is what my school provided us with in addition to their live reviews. I also listened to Mark K lectures (on \nspotify). I listened to 1, 4, 10, and 12 bc I felt weak in those areas. If you run out of time or something AT LEAST LISTEN TO LECTURE 12!!!! I did over 1000 questions from the q bank (irregularly, just whenever i felt like it) and did the CAT 3 a week before I took NCLEX. I reviewed every rationale that I felt weak on. I also reviewed some stuff in the content library. \n\nI felt like my school did a good job at preparing me to take the NCLEX, that’s why I didn’t go so hard with studying on a consistent basis after I graduated. I pretty much just brushed up on things that I haven’t thought about in a few semester (like I havent taken OB since january of 2024 so i was a lil rusty on that). \n\nAnyway!!! If you’re reading this, no matter what point in your journey you are at, YOU CAN DO THIS! I am a first generation college student, had a lot of adverse childhood experiences, grew up in poverty and overall just didn’t have a lot of support. I was a crappy student in high school and always thought “I’m too dumb to be a nurse / I’m not good enough for that profession”… but here I am!! Nursing school is tough but it feels SO GOOD to say “I did it”\n\n\n\n\n",
    "score": 500,
    "url": "https://reddit.com/r/StudentNurse/comments/1idv8b7/passed_nclex_officially_a_registered_nurse/",
    "created_at": "2025-01-30T19:29:40.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1nxuz4k",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Here’s some light at the end  of the tunnel for you. School is 10x more stressful than actual working as an RN",
    "text": "I’ve been an RN for close to 2 years , working on an extremely busy Med-Surg unit an I’ve only had maybe 2 or 3 days that have even come close to the stress of nursing school  it’s been mostly smooth sailing",
    "score": 498,
    "url": "https://reddit.com/r/StudentNurse/comments/1nxuz4k/heres_some_light_at_the_end_of_the_tunnel_for_you/",
    "created_at": "2025-10-04T14:09:10.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1hxqpgz",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I started nursing school at 46 ",
    "text": "I relied a lot on stories and comments during my nursing school journey that I wanted to give back and share my story. In 2019 I was working as an Admin for a company which was extremely unrewarding. The company leaders didn’t seem to care much about the employees or the customers it was all about making money. Giving them all my time and effort made me feel like part of the problem. I had this desire to do something more meaningful, so I thought hey, I’ll be a nurse! At the time I had zero knowledge of how competitive nursing was where I live (Washington State). I approached a local community college that had a nursing program and despite the advisor telling me not to bother unless I got straight A’s I started taking my pre-requisites Fall quarter of 2019. The advisor was wrong, it’s competitive for sure but it’s also possible w/out straight A’s! I was working full time, so I completed my pre-requisites very slowly (1 or 2 at a time).  \nI transferred to a school closer to home and had to complete 3 more classes since their program was slightly different, but this school was literally 10 minutes from home opposed to my first school being over 1 hour away (it was closer to my admin job). I completed a CNA course, quit my admin job, and worked as a CNA for a year prior to starting nursing school which I loved though CNA’s are extremely underpaid.    \nI found nursing school to be very all-consuming. It’s fairly complex content but then you also have labs in which you must physically demonstrate your ability to complete nursing tasks. It was intimidating being in classes with students who were more my son’s age than mine but everyone was very accepting. My school had an 80% pass rate with tests and assignments averaged together.  \nI would say that nursing school essentially took over my life for the past 2 years. I would study anywhere from 6 to 15 hours per week depending on what was due. I really couldn’t give time or energy to much else and there were times I questioned if it would all be worth it. During the tougher times I don’t know if I would have recommended it to myself but during the better times I would recommend it to anyone looking for a new path. Nursing school was a stressful but amazing journey! I made some great friends and learned a whole lot. I also learned that I was more capable than I gave myself credit for!  \nNever judge if you should try based on your age! If you feel up to the challenge and have a desire to seek out a job that is rewarding and makes you feel like you’re making a positive difference then certainly don’t let your age hold you back!",
    "score": 465,
    "url": "https://reddit.com/r/StudentNurse/comments/1hxqpgz/i_started_nursing_school_at_46/",
    "created_at": "2025-01-09T23:37:39.000Z",
    "num_comments": 162
  },
  {
    "id": "reddit-1k5z4yl",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Heart Dropped at Clinical",
    "text": "I just began my first clinical and a few weeks before they talked with us about expectations. They said they wanted us to perform certain tasks in front of our clinical instructor before we did them independently. I didn't memorize them, but they were anything invasive or that could cause harm if done poorly. They also made a big deal about being generally available to help out with other patients if ours didn't need us (we are assigned to just one).\n\nFlash forward to yesterday. It is the first day and things are going great. My patient decides to rest up so I go out looking to see what I can do to help classmates or staff. I noticed a call light going off and no one else was nearby. I approach the room and see the patient has wheeled themselves to the bathroom. I ask if they need help and they said they needed help getting on the toilet. They are right there already just need to transfer. They tell me they stand and pivot, so I help them stand up. We are pivoting when I suddenly hear my clinical instructor outside the door. They say in a concerned and stern voice, \"\\*InfamouSandman\\*, are you in there?\" I reply, \"Yes, just helping a patient to the bathroom.\" They then continue in the same voice, \"Can I talk with you out here for a second when you are done?\" \n\nMy heart drops. Am I really not allowed to help a patient to the bathroom without supervision? This isn't even my patient. Am I about to get in trouble for helping a random patient in need? Are they really about to send me home from clinical for helping a patient to the bathroom? I suddenly remember reading about weird stuff like that happening at clinicals. \n\nOnce the patient is on the toilet, they thank me and tell me I have a great bedside manner with a grateful nod. I make sure they know how to call for help when they are done, then quickly exit the room to see my clinical instructor looking pale and concerned. \"Everything went okay in there?\" I'm nervous. \"Yea. They really needed help and seemed grateful.\" They look relieved, \"That's great!\" The color comes back to their face. \n\n\"I should have posted this earlier, but that patient is on our 'do not contact' list because of how they treat people,\" they continue. \"I dunno if they are physically or verbally abusive but they want us to stay away for safety.\"  \n\n\"Oh,\" I shrug. \"Well they were super nice to me and told me I had great bedside manner.\" \n\nThey laugh. \"Well great job then!\"\n\nYou all might have heard my audible sigh of relief from wherever you were yesterday.\n\nEverything else went fine! I just need to get used to patient care plans, but I think I will be alright!",
    "score": 431,
    "url": "https://reddit.com/r/StudentNurse/comments/1k5z4yl/heart_dropped_at_clinical/",
    "created_at": "2025-04-23T13:26:41.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1nnz1z3",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Nursing school is changing my life",
    "text": "A positive post here for those who may take something from it (I chose the most suitable flair, lol). \n\nMy whole life I was a very shy girl. I never took initiative, put myself out there, or had high aspirations. I chose nursing for a few reasons, mainly because I volunteered in a hospital and I found it interesting.\n\nI am now in the third year of my program, and nursing is developing me into the kind of woman I always dreamed of being. I am a firm believer in you get what you put in, and despite the embarrassing mistakes, stress of sim lab and clinical, learning nclex-style exams, the pain and struggle has forced me to find strength I never knew I had. I found ways to study that provided exceptional results, I won a scholarship that introduced me to an amazing community of nurses that have the kindest souls, I became a float pool nursing assistant and I get to learn a ton every single day working with a variety of of patient populations.\n\nI’ve began to grow a backbone that is dependent on my love of learning, because my patients now and future ones depend on me, a member of their care team, to be the best I can. I love navigating through the turmoil and looking back with pride, and I love the community nursing has given me, at work, at school, through my scholarship, and many other places as a side effect of the traits the field has forced me to develop. \n\nKeep going, days will be slow but years will go fast❤️",
    "score": 420,
    "url": "https://reddit.com/r/StudentNurse/comments/1nnz1z3/nursing_school_is_changing_my_life/",
    "created_at": "2025-09-22T21:23:48.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1hteucz",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I'm a Black Student, and I Was Called a Monkey by My Instructor",
    "text": "My instructor called me a monkey, and I’m Black. He tried to justify it by saying, “Don’t be a mindless monkey,” implying not to do things thoughtlessly or perform tasks without purpose. But this really bothers me. I feel it carries racial undertones, especially since I’ve noticed he only uses this term with Black students—and there aren’t many of us in the program. Beyond that, he has bullied me relentlessly, intentionally calling me names that aren’t mine and making me feel generally uncomfortable. I was also told that his behavior might be influenced by his friend, a past instructor of mine, who doesn’t like me.  I escalated my current issue with the instructor to the director of the nursing program and the college administration, but they’ve done nothing except retaliate. The director told me that if something like this bothers me, I wouldn’t do well in nursing. They also warned me that pursuing this further could hurt my nursing career because of the college’s “good reputation.”  I’ve already moved forward with another strategy, but I’m looking for opinions. Am I wrong for not just letting this go?  For context, I have tangible proof of what happened, so I’m not worried about proving it—there’s no doubt he said it. On top of everything else, this same instructor got a student from a cohort ahead of me pregnant. She had the baby just before graduating, and they now live together. The director of the program was aware of this relationship and the student received special privileges that I felt were extremely unfair. ",
    "score": 401,
    "url": "https://reddit.com/r/StudentNurse/comments/1hteucz/im_a_black_student_and_i_was_called_a_monkey_by/",
    "created_at": "2025-01-04T13:54:56.000Z",
    "num_comments": 178
  },
  {
    "id": "reddit-1lwo07v",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I did not expect to cry so soon",
    "text": "I am a male nursing student and I will be graduating May of next year. I just finished my second 12 hour shift at a Med-surg floor as an extern. I try to be as stoic as possible in life. I try to hold it together emotionally during difficult and sad situations. Today, after only my second shift, I cried for a patient. I did not expect to cry so soon into my nursing career. I was caring for a patient who has end of life kidney failure. Honestly, I don’t know how much time she has left but she is so kind. She told me,”I hope you don’t stop doing this, you are very caring. We need more people here like you”. During my next rounding she talked to me about how she loves learning languages especially Spanish. I speak Spanish, so we talked a bit about that. Then she said she would love to move back to Texas to see her son and use the language because there’s a larger Spanish speaking community there. She said she really hopes to do that before her time on earth is over……….. when she said that my eyes watered immediately. I had to step outside and collect myself. Reality hit me like a ton of bricks and the stoic attitude I put on display completely shattered. I went to a vacant hallway and cried so no one could see me. I knew one day I’d cry for a patient, but today caught me off guard because it’s only my second extern shift. \n\nHas anyone gotten attached or cried for a patient while being a nursing student? ",
    "score": 400,
    "url": "https://reddit.com/r/StudentNurse/comments/1lwo07v/i_did_not_expect_to_cry_so_soon/",
    "created_at": "2025-07-10T20:56:29.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1ljk4fc",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I passed my HESI final Exams!",
    "text": "Im so overjoyed to share that I just passed my finals for nursing fundamentals and pharmacology while working full time 🥹  \n\nhere’s how I did it :\n\n\nThe main way I studied was by using NotebookLM. I uploaded all of the power points, notes, homework, quizzes, etc. on every lesson and I typed in the prompt, \n\n“ Generate me a 25 question nursing fundamentals HESI style exam including the rationale (so I can understand the reasoning).” I also looked at my remediation packets from previous HESI exams I took, and added to the prompt to focus on those difficult areas when generating the practice exam. There’s also a feature where u can generate ur notes into a podcast so I would save that to my phone files and listen to it at work. (This sounds like an ad but I swear to god this study resource saved me 😭) \n*I used to used ChatGPT to generate these types of quizzes, but I noticed they pull sources from random places online &amp; the platform can’t handle the amount of content I try to upload ( like over 200 PowerPoint slides ). NotebookLM is better in my opinion because it generates it solely based off of the information you provide. \n\nMy school also uses evolve/sherpath so I would go in the Sherpath Ebook for my class and generate EAQ quizzes for the topic I was trying to master. I honestly think there were some questions on the HESI from those generated EAQ quizzes. \n\nPharmacology and fundamentals really went hand in hand with each other, and I noticed specifically with my Pharmacology HESI that it was heavily focused on nursing fundamental skills/processes .. but just adding some drugs lol. \n\nAlso in the pharmacology HESI they give you a lot of context clues where you just need to know the important/notable parts of the type of drug and drug class or what it does.. ik that sounds dumb but for the first pharmacology HESI I spent so much time trying to learn every detail about every single drug &amp; I just wasted a lot of time tbh.\n\nLike for example :\n\n“ Patient is taking warfarin to prevent the formation of blood clots. What should the patient avoid? “\nA. Sun exposure\nB. Dry shaving\nC. Eating chocolate\n\nIt says in the question that it’s used to prevent blood clots so the patient should minimize risk of cutting themselves (aka dry shaving) because they can bleed out 🙂 even without knowing warfarin was an anticoagulant I was able to use process of elimination. \n\n(Obviously not every question will be that straight forward but hopefully you get the point 😭) in my experience, less is more with pharmacology.\n\nThis is truly coming from a student that had no idea how to “study”. Some of my classmates would try to recommend YouTube videos to help understand concepts, but videos don’t do anything for me tbh. My personal learning style is repetition so the more i took these practice quizzes, the more it was beat into my head.  It was especially helpful pre-formatting questions to a HESI style so I already knew what question format to expect when it came to the actual exam.\n\n\nI hope some of this insight helped ! \n\n",
    "score": 391,
    "url": "https://reddit.com/r/StudentNurse/comments/1ljk4fc/i_passed_my_hesi_final_exams/",
    "created_at": "2025-06-24T19:13:34.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1jhbg4c",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I literally cannot wait to become a nurse.",
    "text": "I haven't even started school yet, but I have applied and hope that all goes well and that I'll start in August. It's taken me my whole adult life to find my calling, and I truly believe this is it. I'm 38 and started going to community college a year ago for social work. But then I took an anatomy class, and certain things started pointing me toward nursing. I just really strongly believe I'll do well at it. I'm doing really well in A&amp;P and find it so interesting. I know I have so much to learn and I'll probably have a ton of \"reality checks\" showing me that this is not easy, but I'm just excited for it all and can't wait to get started. I don't have a ton of people to talk with about my excitement, so I hope this is the right place to share. ",
    "score": 386,
    "url": "https://reddit.com/r/StudentNurse/comments/1jhbg4c/i_literally_cannot_wait_to_become_a_nurse/",
    "created_at": "2025-03-22T15:48:53.000Z",
    "num_comments": 130
  },
  {
    "id": "reddit-1kq0s2i",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "BSN is a scam, change my mind",
    "text": "Not talking about all in one programs, I’m talking about stand alone online RN-BSN programs. Especially this being a requirement for NP school for those that already have bachelors degrees in other areas.\n\nDoing this now and I can say there is nothing to learn. Writing papers does nothing for anyone and is a completely outdated practice. \n\nDiscussion posts are a flat out joke and everyone knows it. Get real.\n\nA lot of schools have no teaching involved, “read this book” or “do this module” is NOT teaching. \n\nUnsure what your thoughts are but my official assessment as someone with an education background and advanced education degrees is that these programs are useless except for those that are required to get one for stupid reasons.\n\nPossible solutions: allow tracks for BSN just like MSN, like focuses (education, research, leadership etc) with specialized classes that people are actually interested in. ALLOW OTHER BACHELORS DEGREES FOR NP, CRNA etc. no reason at all why someone with a BS in biochemistry should be unqualified as opposed to someone with a BSN. \n\nImagine a world that requires IT people with a medical background, let that person get their BS as an IT degree with all the certs that come with it. Nutrition BS degrees are brutal and useful, chemistry for those who are pharm freaks not to mention countless others. \n\n\n",
    "score": 385,
    "url": "https://reddit.com/r/StudentNurse/comments/1kq0s2i/bsn_is_a_scam_change_my_mind/",
    "created_at": "2025-05-19T02:18:36.000Z",
    "num_comments": 213
  },
  {
    "id": "reddit-1p2ij3v",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I PASSED!!!",
    "text": "Yall I passed my comprehensive test and also done with school, I’m so happy i’m aint going back at that place, I honestly didn’t know I would make it this far, I was so close in failing 2nd semester during summer but I passed my one point, listen I know its hard and stressful, but you gonna see the end i literally gained weight by and hair got thin but now to fix it but i’m just happy that i’m done, and you guys will also be done pretty soon just keep going even when its rough!  ",
    "score": 384,
    "url": "https://reddit.com/r/StudentNurse/comments/1p2ij3v/i_passed/",
    "created_at": "2025-11-20T23:20:06.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1lokab1",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "In 2024, more than 80,000 qualified applications turned away from nursing schools",
    "text": "Hi ya'll\n\nThe American Association of Colleges of Nursing just [released ](https://www.aacnnursing.org/news-data/all-news/article/schools-of-nursing-see-enrollment-increases-across-most-program-levels-signaling-strong-interest-in-nursing-careers?utm_source=informz&amp;utm_medium=test&amp;utm_campaign=test)their annual report.\n\nIn 2024, 80,162 **qualified** applications were not accepted to nursing schools across the nation. Within that total, 65,398 applications from entry-level baccalaureate were turned away, 1,530 from RN-to-BSN, 7,603 from master’s, 5,366 from DNP, and 265 from PhD nursing programs.\n\nAACN commented:\n\n&gt;“The primary barriers to accepting all qualified students at nursing schools continue to be insufficient clinical placement sites, faculty, preceptors, and classroom space, as well as budget cuts.”\n\nGenuine question: what can we do about this? Has anyone seen their employer, union, or college do something that helped unblock the blockage of insufficient faculty to teach?\n\nSeems crazy that 80,000 people wanting to do an important job would be turned away. ",
    "score": 382,
    "url": "https://reddit.com/r/nursing/comments/1lokab1/in_2024_more_than_80000_qualified_applications/",
    "created_at": "2025-06-30T21:47:33.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1kt37du",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I loved my nursing school experience! 🎓",
    "text": "I've officially graduated from my 12 month ABSN! I earned a 3.87 GPA, made the Dean's list, and graduated summa cum laude. I got all As in patho and pharm. I'm getting ready for the NCLEX now, and I'll be starting as a new grad in the ICU this summer.\n\nBefore I started nursing school, I spent a lot of time reading and watching videos about other people's nursing school experiences. A lot of people were really having a bad time! I don't want to discount their feelings, because their experiences may have been pretty different from mine. \n\nHowever, I did want to make a more positive post for anyone who might benefit!\n\n**Backstory (feel free to skip)**\n\nMy path to actually starting nursing school was a little rocky. I started taking my prereqs in Fall 2021 while also working full-time at a non-profit. I *loved* Anatomy and Physiology! I got a 94.7% on my TEAS in November 2021 and finished A+P 2 in Spring 2022. \n\nI applied to the ADN nursing program at my community college, as well as the ABSN program that I ultimately ended up attending. I was waitlisted for the ABSN (likely because I hadn't finished all my prereqs at the time), but was accepted to the ADN program for Fall 2022. \n\nFor personal reasons, I ended up declining my acceptance to that program. I kept working, waffling on whether I wanted to go to nursing school or not, and ultimately reapplied to the ABSN program for Summer 2023. This time, I was accepted, despite having one English class left to complete. \n\nI quit my terrible job and moved to be closer to the school. At the time I was very frazzled and honestly kind of depressed, and terrified that those things would lead to me failing out of the program. \n\nUltimately, I ended up having to delay for a year because I wasn't able to complete my one English class in time. 😑 \n\nThis actually ended up being an enormous blessing in disguise. I stayed in the area and ended up working as a tech on an inpatient psych unit at one of the local hospitals. \n\nI discovered that I loved the work, but more important, wound up being part of a fantastic team. I realized that I had internalized some things at my last job that reflected more about that specific, toxic workplace than they reflected about me as a person. \n\nI became more and more confident every day. I wasn't frazzled anymore. Not depressed. I learned how to communicate empathetically with patients, even in uncomfortable situations. I juggled tasks effectively even when the floor was chaotic. A nurse coworker once called me a \"supertech.\" It made me feel so much more prepared for nursing school than I would have been otherwise.\n\nThis isn't really important to know, but I wanted to include this backstory as reassurance for anyone whose path to/through nursing school doesn't end up being straightforward because of whatever obstacles you might face. In hindsight, I wouldn't have wanted things to go any other way.\n\n**Starting nursing school**\n\nI started my program in summer 2024 at age 30. I was very scared and definitely a little overwhelmed. I worried that I would fail, or, worse, that I would hurt someone in the process. I didn't really click with the other students in my cohort.\n\nMy program was \"front-loaded,\" meaning that the summer and fall terms were the most intense. We had at least one exam every week over the summer, sometimes even more. \n\nFor the first five weeks or so, I felt panicked every day. I was getting good grades in my classes and passing my check-offs, but I was very stressed. I had to [excuse myself from class](https://www.reddit.com/r/StudentNurse/comments/1d5rsbz/just_finished_my_first_week_and_ive_already_cried/) when we first learned dosage calculations so I could hide in the bathroom and cry. I left every exam convinced that I had bombed it. \n\nAfter the first month or so, a weird thing happened: I started to feel kind of okay again! \n\n**Surviving nursing school**\n\nThings didn't really get easy after that, but they did get easi*er*. I eventually stopped panicking after every exam. I started to feel a little more competent and a little more confident. \n\nI was tired as fuck – at the height of the program, we had clinical 4 days a week, and I was still working PRN on the psych floor. But, believe it or not, I was often having a good time. I loved clinical: learning new things, trying out skills, being able to help and talk to patients. I passed all my check-offs, stressful as they were. \n\nI hated sim. That part never got better, lol. \n\nA few cool miscellaneous things that happened: \n\n* In my first clinical rotation, my partner and I noticed that our nursing home resident had adventitious lung sounds (crackles) and reported it to our instructor and the nurse. She got evaluated by the SNF's nurse practitioner and it turns out we caught an early case of pneumonia!\n* I held a baby for the first time! (Even better, my instructor was surprised to learn I didn't have experience with babies!)\n* I got a $5,000 merit scholarship from the school (funded by a large corporation)!\n* I saw someone get born!!\n* Most of the patients I worked with were wonderful and kind, and often very happy to support my/our learning\n* I did pretty well on the ATI NCLEX predictor exam without extra studying (my program encourages us to take it \"cold\" to establish a baseline). I did get every single question on professionalism wrong somehowbut that's okay\n* Overall got really positive feedback from my instructors, including my favorite compliment: \"You care, and that's something I can't teach you.\"\n\n**Surviving capstone**\n\nI did not get the kind of unit I wanted for capstone. I was so sad! In the end, my unit wound up being exactly the right place for me. I had a preceptor who was an excellent teacher with a great sense of humor, and even clicked with some of the floor staff (I am quiet/reserved so this is big for me). \n\nEvery day got a little easier, and by the end, I felt so much more prepared for the future. I got offered a job on the floor more than once (and might have taken it if I lived closer!). \n\nOverall, it had its ups and downs, but it was a really great learning experience.\n\n**TL;DR**\n\nNursing school was probably the hardest thing I've ever done. To be honest, it felt like a transformative experience for me as a person, and I feel like I've grown so much over the last year. \n\nI do think to some extent I got lucky – my school didn't have a bullying issue in our cohort, and the staff were so supportive. So I dodged two of the biggest issues that people seem to face. \n\nI'm so fucking scared to start in the ICU – but I'm also really, really excited for what the future holds. I'm glad I went for it, and I'm so happy to almost be a real nurse. \n\nThis sub was also honestly a really wonderful support for me through the whole process – thank you!\n\n**Advice for prenursing students**\n\n* Get healthcare experience if you can. People with CNA/nursing assistant/patient care tech experience were noticeably more comfortable and adept with hands on skills, especially toward the beginning of the program. EMTs to some extent as well. \n*  For A+P: understand the big concepts first, then memorize the details. I highly recommend flashcards – I used [Anki](https://ankiweb.net) extensively in A+P/microbiology and then again in my nursing classes. I really like the spaced repetition features, but it does have more of a learning curve than Quizlet. \n* With Anki, you can make flashcards with images from your lab manual or lecture slides. Really great for memorizing structures, bones, muscles, etc. \n* Make your own flashcards. It forces you to review the material, consider what's important to know, etc. \n* Do *not* cram last minute for A+P and then forget everything. It will absolutely come back to bite you in the ass in patho and pharm.\n* Research the programs you're considering and ask the hard questions. I went to our admitted students event and asked some pointed questions about the culture and what the faculty were like. I would also highly recommend finding out the attrition rates *and* NCLEX pass rates – you don't want a program where a lot of people fail the NCLEX, and you also don't want a program with high NCLEX pass rates because they yeet everyone at the first sign of struggle.\n* I listened to the [Straight A nursing podcast](https://straightanursingstudent.com/podcast/) a lot when I was a prenursing student. The NCLEX/disease-specific episodes might not be as helpful before you're in nursing school, but Nurse Mo has some great episodes in there for prenursing students as well.\n* Find systems that work well for you NOW. You don't want to be trying to figure it out after you start nursing school. This includes study systems and also planners. I personally ended up using my phone calendar and Notes app because they sync to my laptop (RIP to the beautiful paper planners I bought but they weren't efficient for me).\n* Deep clean your house before nursing school starts. I post this all the time but I'm so serious about this. You won't have time or energy for much more than basic upkeep, if that. \n* You are not too old to go to nursing school!\n\n**Advice for nursing school**\n\n* Try to learn or do something new every single clinical day. A nursing student told me this before I started and it was really good advice for me.\n* Jump on every single learning opportunity that comes your way. **If your instructor asks you if you want to see/try something, the correct answer is yes.** Nurses are more likely to go out of their way to offer you opportunities if they can tell you're eager to learn, and it's a great way to make an impression on instructors who might be job references down the road. I'm like 98% sure that I got my job in the ICU because a specific instructor thought highly of me. \n* Try to take a sincere interest in everything that comes your way, even if you're not planning on going into that kind of nursing. I went in thinking I was going to be a psych nurse, and I'm glad I didn't limit myself by acting like anything else was unimportant. You never know.\n* The way my school taught dosage calculations was really confusing for me. I ended up using Nurse Mo's [Confident Calculations course](https://learn.straightanursingstudent.com/confident-calculations) and it made a huge difference for me. Would recommend.\n* I would actually die for Sarah [RegisteredNurseRN](https://www.youtube.com/user/RegisteredNurseRN/).\n* If you can, find a nurse mentor or a friend or SOMEONE who's been there. My nurse friend has been like 85% of my sanity. \n* Keep a \"wins list.\" This idea came from my nurse friend and it was brilliant. Anything good that happens goes in the wins list so you can remember later. Good grades? Good instructor feedback? Patient said something really nice to you? Made it through sim without craving the sweet freedom of death? Into the wins list it goes. Mine has ended up being a really lovely narrative following my nursing school journey and I'm so glad I have it.\n* I'm a really heavy sleeper and I can turn off alarms without actually waking up. Bad combination. This [shock watch](https://www.amazon.com/Pavlok-Shock-Clock-Customizable-App-Controlled/dp/B0BGYY45DY) saved my ass for real.\n* Communicate with your faculty and instructors. If you're struggling, it's way better to reach out for help sooner rather than later. \n* If you can, advocate for your learning. If there's something you really want to see or work on, letting your instructor or nurse know can really help them find you opportunities.\n* Ask questions! Especially in clinical.\n* Be patient with yourself. Try to give yourself grace. \n\nAnd with that, I'm officially changing my flair. Thank you for reading! ",
    "score": 373,
    "url": "https://reddit.com/r/StudentNurse/comments/1kt37du/i_loved_my_nursing_school_experience/",
    "created_at": "2025-05-22T21:57:35.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1is7372",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "As a new grad RN, here is some advice that I learned while being in school",
    "text": "1. Learn when to ask for help.\n\nDuring school, I worked full time at a restaurant because I was trying to keep up with my bills. Luckily I split the bills with my gf so it was easier on me. I hate asking for help from anyone but I finally mid way through schooling asking for my parents to help us with some of my rent so I wouldn't have to work as many shifts in a row. This saved me some time to spend my weekdays studying after school. Don't be afraid to ask for help, the worst thing that can happen is they say no.\n\n2. Study smarter not harder\n\nI used to be a C student when I was in highschool but years later I was making As and Bs in nursing school because I changed my mindset and the way that I study completely. I figured out my learning style which a little mix of everything. I would not use my textbook unless something very specific was repeated in lecture to highlight in our textbook or PowerPoint (some charts or a specific concept). I would watch YouTube videos from levelupRN and registered nurse Sarah online and take their quizzes linked in the videos. I would write out notes while I watched the videos and replay certain parts if I didn't understand something. I did all my flashcards using quizlet or would find some that match our content in class. We used ATI so I mainly read through the ATI books that they gave us and did questions online (a lot of questions) and made sure to write out the explanations on the ones I got wrong and try to rationalize out loud why it was wrong compared to the right answer. I would not study for hours, I studied for about 2 hours a day and took a lot of breaks. Sometimes I studied a few more hours if I really was lost on something but I mainly watched a bunch of content about a subject even while I was eating dinner. Over studying would just numb my brain and lead to burnout. \n\n3. Anxiety is the worst and is a theif of good self-esteem\n\nI had a very difficult time adjusting to the environment of nursing school and especially clinicals because I was always afraid I would harm someone or make a huge mistake. It didn't help that my first clinical instructor was extremely strict about every little thing and yelled at us multiple times over things out of our control. My advice is wake up very early for class/clinical and adjust yourself to the day. Make a coffee, watch some TV, and just relax before you go. Be at clinical 30 mins before so you can mentally prepare yourself and review what you need to review. Listen to music on the way there if it calms you. As a student, you know nothing and that is completely okay and even the nurses and everyone else know that you know nothing as well. That is fine, you are there to LEARN and do what you need to do to pass. No one is expecting you to do every IV known to man and chart as though you've done the job for 20+ yrs. If you need help or have a question, always ask the nurse or tour instructor if you are comfortable with them.\n\n4. The NCLEX is not a hard test.\n\nIf you are studying for the NCLEX right now, stop thinking that you need an everyday of the week 5 to 6 hr Study plan to pass. You don't. You just don't need that at all. I used Archer and did readiness assessments every single day and only focused on the easy and medium questions mainly. The NCLEX just wants to know if you know what everyone else knows. It doesn't care if you know the most complex questions. If I needed a refresher on a concept, I listened to the Mark K lectures on spotify and took notes. Don't forget that if you are like me and need absolute silence when taking your NCLEX, not only will they offer noise canceling headphones but they have actual earplugs that you can request as well!\n\n5. Passing nursing school is all about your mindset\n\nI would constantly tell myself things like hey if you made it through A&amp;P then surely you can make it through your TEAS test, if you can make it through that then your can make it through Fundementals and etc. If I had 2 careplans due the next morning and I only had my nurse notes done then I would just get started and think that it would be okay because once I get this done I will feel more prepared and if I can't complete something then I'll wake up early and finish it to the best of my ability. Don't overstress yourself and try to pull an all nighter to finish something because you need to rest while you can.",
    "score": 372,
    "url": "https://reddit.com/r/StudentNurse/comments/1is7372/as_a_new_grad_rn_here_is_some_advice_that_i/",
    "created_at": "2025-02-18T07:18:45.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1ibr782",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Getting a bachelors SUCKS",
    "text": "I’m getting my bachelors right now and I really fucking hate this shit! Sorry for my French but I’m so over it. I did an ADN program, I worked 2 jobs, worked overnight AND I still passed with honors. But this ADN-BSN is a bunch of bull crap. All of these papers are ridiculous. I despise papers, PowerPoints, MAKING VIDEOS like wtf ? WHO CARES . This doesn’t have anything to do with bedside!!! Thanks for listening to my rant im just over it ",
    "score": 355,
    "url": "https://reddit.com/r/nursing/comments/1ibr782/getting_a_bachelors_sucks/",
    "created_at": "2025-01-28T02:24:26.000Z",
    "num_comments": 131
  },
  {
    "id": "reddit-1nh58i1",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Which policy was put in place because of something you did?",
    "text": "Has anyone ever had a floor meeting held or policy put in place because of something you did?\n\nI was heavily pregnant (3rd trimester) while in an accelerated BSN program. Being accelerated, it was a very fast paced and crazy schedule. I caught no breaks or accommodations for being pregnant, not to mention I had a week long hospital stay in the midst of all this, which put me behind. They had me scheduled for 2 clinicals for 2 days in a row. They were an hour drive away from each other. I remember being SO tired after my first clinical, that there was no way I could get to the second hospital that night to look up patient information for the following day. \n\nMy friend suggested getting a good night’s rest and going early in the morning before clinicals to review the patient information so I did just that. Anyway my instructor overheard some of my classmates talking about how it was a great idea and they wanted to do the same. Instructor was LIVID and I got my butt handed to me. Anyway, it’s now policy that you must go the day before to prep for clinicals. ",
    "score": 343,
    "url": "https://reddit.com/r/nursing/comments/1nh58i1/which_policy_was_put_in_place_because_of/",
    "created_at": "2025-09-14T22:42:28.000Z",
    "num_comments": 186
  },
  {
    "id": "reddit-1pkjnr9",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Do you make at least $100k a year with a BSN?",
    "text": "Thank you for all the replies. I have to turn notifications off because there’s so many. I’ve gotten a good scope of information for my career path. I wanted to hear about this from actual nurses rather than just Google. I’ve always been interested in healthcare and taking care of others, so if I didn’t do nursing I’d do another thing in healthcare, but I needed to know more about if the pay is worth the amount of risk and hard work that nursing is. Thanks again",
    "score": 340,
    "url": "https://reddit.com/r/nursing/comments/1pkjnr9/do_you_make_at_least_100k_a_year_with_a_bsn/",
    "created_at": "2025-12-12T05:14:37.000Z",
    "num_comments": 903
  },
  {
    "id": "reddit-1pocz6x",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "For those who hold a BSN and don’t plan on ever going back for a masters, why?",
    "text": "I’m being pushed pretty heavily by those around me to go back to school for my masters or possibly NP. I don’t hate my job and I make decent money so I’m just very curious to hear from those that have no plans to ever return to school why not/why you wouldn’t recommend it? I feel a lot of external pressure and honestly I don’t miss for a moment taking exams, clinicals, or writing papers.",
    "score": 336,
    "url": "https://reddit.com/r/nursing/comments/1pocz6x/for_those_who_hold_a_bsn_and_dont_plan_on_ever/",
    "created_at": "2025-12-16T20:41:29.000Z",
    "num_comments": 443
  },
  {
    "id": "reddit-1kg5pll",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Update: nursing school gave my seat to another applicant",
    "text": "A reference for people who havent seen it. \nhttps://www.reddit.com/r/StudentNurse/s/3xcOPHB6w0\n\nI did pull through will the email to the nursing director. They were very kind and understand about what had happened. It unfortunately was a mistake that happened to other students too. Fortunately I was one of them who reached out. The director said I still have my seat and he is overriding it because of the mistake in my student portal. \n\nThank you to those who gave solid advice and similar life experiences. It was truly appreciated as I was going through a hard time accepting what had just happened. ",
    "score": 332,
    "url": "https://reddit.com/r/StudentNurse/comments/1kg5pll/update_nursing_school_gave_my_seat_to_another/",
    "created_at": "2025-05-06T14:21:25.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1luwq1h",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I regret choosing nursing",
    "text": "I go to the top school in my state. I cried for this and even delayed my graduation by a year and half just so I could do nursing and go to this school. But honestly after my first nurse externship I hate it. I just hate doing bedside but that seems to be the only option w money after college 😭😭. I feel like I just wasted so many years of my life just to end up not liking it 😔 idk thinking of getting my NP but I see so many hateful things about it online. Nursing and nurses so far have just not been nice and I feel as though I am stuck in high school w all these mean girls. I just can’t see myself doing this long term 😩  \nEdit: any advice on how I can love this profession  💔 ",
    "score": 324,
    "url": "https://reddit.com/r/StudentNurse/comments/1luwq1h/i_regret_choosing_nursing/",
    "created_at": "2025-07-08T18:44:57.000Z",
    "num_comments": 144
  },
  {
    "id": "reddit-1lpdiqk",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Late to clinical... Automatic fail",
    "text": "So, I'm in my 5th semester of the nursing program and today was the third and final clinical of the semester. I accidentally slept through my alarm this morning and ended up being 30 minutes late to clinical, my professor tells me she has to send me home due to being more than 15 minutes late. She went on to say that because of this, I automatically fail the entire course. The ENTIRE course .... Devastated, I began crying uncontrollably, because I have been killing myself to get through this program as a mother of two young kids and a husband who works two jobs (bless him). I am never late to lectures or labs and have been maintaining good grades from the start. Here's the kicker though, to retake this course, the school will make me wait until January because the next cohort has too many students and they can't fit me in. Currently, I'm reaching out to another school to see about starting in their nursing program in August. Overall, this all just feels like a huge punch to the gut and I'm feeling so incredibly defeated. I feel like a failure, even though I really know I'm not. I'm aware being late is nobody else's fault but my own, I just wanted to get this off my chest. It's been a rough morning. Has anyone else experienced something like this with their school? I'd like to hear thoughts and opinions.\n\nUPDATE: Sorry everyone, a few days late on updating you. It's been a lot to process. So, the meeting with the Dean went much as anticipated. She said there are no make ups or exceptions for being late to a clinical unless there was some sort of extreme illness, injury, or other extenuating circumstance of equal severity. This means that they are indeed failing me for the course. However, they won't know for a few more weeks what the final headcount of the next cohort will be yet. Until they have that information, I won't know if I can retake the course next semester or if they're going to have to make me wait until January. So until then, I'm just focusing on my other courses and those assignments for now. I haven't had the opportunity to speak to a counselor at the other school I'm considering yet due to the 4th of July holiday/weekend, but I will reach out to them Monday to ask all of the questions. It's a pretty disappointing update, I know. I'm feeling pretty disappointed about it myself, crushed would be a more accurate term, actually. \n\nOverall, I take responsibility for my mistake, being late was on me. But, I will say one thing, after reading all of your comments and thoughts on this, it is frustrating knowing that so many other schools offer some form of clinical makeup in situations like mine and it isn't such a major setback for students. Going forward though, I will be making some changes and taking the advice I've received from you all about setting multiple alarms for myself to ensure this never happens again. I'll provide another update once the Dean gets back to me about the timeline for retaking the course. \n\nThanks so much everyone for the love and feedback I've gotten, it's so much more than I expected and it has helped me get through this more than you know ❤️",
    "score": 320,
    "url": "https://reddit.com/r/StudentNurse/comments/1lpdiqk/late_to_clinical_automatic_fail/",
    "created_at": "2025-07-01T21:08:13.000Z",
    "num_comments": 179
  },
  {
    "id": "reddit-1jcnxyd",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Study hack - studying with husband instead of nursing students",
    "text": "I’ve made some good friends in nursing, but it’s really hard to get everyone together for study time. We often lapse into chitchat, or don’t get as far as I would have hoped with the time we have booked. It’s frustrating for me to stay after class for them to look over/take pics of my notes but we don’t do much…\n\nI started doing the bulk of my AP studying with my\nhusband at home. I have very little free time these days so it’s bonding time for us, and it gives me a confidence boost that helps me perform better. When I’m with my classmates it’s very much “yes you should should know this that’s the bare minimum expectation”, but with him it’s a reminder that the material is advanced, and yes it’s a lot of hard work to absorb and recall. \n\nMy husband is supportive and encouraging, he says things like “holy shit how did you know that”, and gives me these big kudos when I get through a tough segment. Then he says things like “this is just ONE class?” He had this eye opening moment that I am working my ASS OFF with a full load of 4 classes. When he’s impressed by me, it makes me feel better about the material and I retain it better. I still socialize with my classmates but don’t rely on them for study help anymore.\n\nNursing school can be isolating if you don’t have support, or your support group doesn’t understand what is on your plate. Studying together has really helped on a relationship level and I’m getting better grades as well!\n",
    "score": 314,
    "url": "https://reddit.com/r/StudentNurse/comments/1jcnxyd/study_hack_studying_with_husband_instead_of/",
    "created_at": "2025-03-16T15:27:50.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1ogf7va",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Shocked at anti-vaxx sentiments within cohort",
    "text": "I am currently in the first semester of an adn program. I live in the south, but I'm still shocked that around half of my cohort are anti-vaxx. I lose respect for each one and my first thought when I realize is that they shouldn't be here. I feel so judgemental for thinking that way about them, but critical thinking is a crucial nursing skill. All of us had to take and pass microbiology first to get into this program. Surely they should have learned basic concepts from it. I feel like they shouldn't be in the program if they don't believe in science. I can't help but hope they fail out. A few of them are already on the verge of it. I feel like an asshole for hoping that they fail. But I don't understand why they are pursuing a degree in a the medical field in the first place. I hope to never have a nurse with those beliefs as a patient. Does anyone else have experience being in a cohort with so many anti-vaxxers? How did it go?",
    "score": 314,
    "url": "https://reddit.com/r/StudentNurse/comments/1ogf7va/shocked_at_antivaxx_sentiments_within_cohort/",
    "created_at": "2025-10-26T08:19:31.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1jahxw0",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I think my teacher assaulted me",
    "text": "Me and my friend had just passed our final exam of nursing school and we were both really excited. We went to the career fair afterwards where everyone else went after the test then stood by a wall after talking to one of the booths.\n\nI think I was looking at my phone or friend when I turned my head to see my old professor approaching me before she wrapped her hand around my throat and she said she was mad at me. Her grip wasn’t tight but there was still some pressure. She thought I dropped out (I didn’t) and must’ve mixed me up with someone else. Me and my friend left right after she apologized. I started crying and my friend called it assault. I have a lot of bad memories that it stirred up.\n\nI’ve had issues with this teacher before where after an exam (still in the exam hall while others were taking a test) I’d turn in my scratch paper she’d tell me I lost weight. If I said I didn’t she’d get mad and say I had and wasn’t eating enough. She’d loud whisper it so the front row would always hear it. I felt under a microscope about my weight after that which didn’t help bc I had anorexia and was just getting over ‘people don’t actually notice my body as much as I do’ (I was physically recovered though when this happened, I’ve been BMI 21 throughout the program. She’s never seen me at another weight she’s delusional)\n\nMy friend said I should finally report her (I was debating with the weight stuff last year) and she’d be my witness. Is this serious enough to report? Or is it just a mistake.",
    "score": 311,
    "url": "https://reddit.com/r/StudentNurse/comments/1jahxw0/i_think_my_teacher_assaulted_me/",
    "created_at": "2025-03-13T17:44:53.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1hsafyk",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Well it's official, I'm out of my nursing program",
    "text": "The title pretty much says it all. I got the official email to both my personal and school email that I am out. I'm feeling the pain and depression all over again and honestly feel like I shouldn't pursue nursing anymore. I know other schools have nursing programs, but I feel like the one I was in had multiple connections to different hospitals and a lenient grading system (compared to other schools). I ruined my one good chance of getting a good career at a decent hospital (especially with the school's reputation). Not only that, but if I decide I want to go into nursing, I'd have to start all over again and that thought alone stresses me out. I worked hard this time around and still managed to fail. I know some of you are going to try to encourage me to try again/not give up but I feel like (realistically) I might not be having one of those successful endings. I don't know what to do at and would like any advice/opinions about what to do moving forward. Thank you for taking the time to read this if you reached the end and I hope you have a great day. :) (Happy New Year!).\n\nEDIT: I should have added that I was in an ADN program, not a BSN.",
    "score": 298,
    "url": "https://reddit.com/r/StudentNurse/comments/1hsafyk/well_its_official_im_out_of_my_nursing_program/",
    "created_at": "2025-01-03T01:24:37.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1ivwzzt",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Am I going to be a bad nurse?",
    "text": "Okay guys so this is a very vulnerable post, but I need some hard truth advice. I’m a 2nd semester bsn student and I feel like I cannot retain ANYTHING. Most students I watch or see are able to easily explain a disease process or know medications and how they work… I cannot do any of that. I realize nursing school doesn’t teach us how to be a real nurse, but I don’t know. I’m just venting here. It doesn’t help that I have adhd and I’m not currently being medicated for it, but I can’t remember a lot of the stuff I’ve learned. I do really well in clinical, with my patients but I really struggle with the learning part of things. I feel like I’m going to graduate and not know anything. Is this going to make me a bad nurse?? Was/is anyone else like this in school?",
    "score": 297,
    "url": "https://reddit.com/r/StudentNurse/comments/1ivwzzt/am_i_going_to_be_a_bad_nurse/",
    "created_at": "2025-02-23T00:08:29.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1kpxzoj",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "What age did you become a nurse?",
    "text": "Im 25 and starting the program and I didn't realize how young some nurses are. It's silly but I feel older compared to some people. I originally recieved a BSN in psychology then had a change of heart. Now I am starting the 15 month accelerated program. My ex told me I should feel behind which made me upset. He said most people would have been done before my age. I did not think it even mattered but it's all getting in my head. What age did you guys get your license? ",
    "score": 295,
    "url": "https://reddit.com/r/StudentNurse/comments/1kpxzoj/what_age_did_you_become_a_nurse/",
    "created_at": "2025-05-18T23:51:03.000Z",
    "num_comments": 393
  },
  {
    "id": "reddit-1mf7f51",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I need feedback",
    "text": "Where I work it started as majority 4:1 and occasionally 5: 1, they have gradually moved staffing to be 5: 1 And sometimes 6:1. Am an advocate for better ratios. I'm very outspoken. The first first email sent to everybody was our Alaris pump integration scores in percentage. I work on the med-surg floor and The score was 91 something. My reply all to everyone was intended to start a discussion, it got me a two-on-one meeting with my manager and assistant manager. I've been getting a mixed feedback on this, some high fives, some I shouldn't have done that. I want people's thoughts here.",
    "score": 286,
    "url": "https://reddit.com/r/nursing/comments/1mf7f51/i_need_feedback/",
    "created_at": "2025-08-01T20:31:42.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1jokdkx",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Advice to fellow students: be discreet.",
    "text": "I admit that I am an open book. I made the mistake of asking what my classmates had considered a dumb question. I have noticed that some of them rolled their eyes at me in the back of my mind. However, I am not in nursing school to read the room. I feel like I made some enemies without realizing it. It is ironic that the girl who found me annoying, is actually one of the most talkative girl in class. She is an open book and will tell others her life story. \n\nYour classmates do not care about your grandma or grandpa's disease, they just wanna get out and leave. \n\nPut your head down, and keep your mouth shut. This is what I would tell my old self. ",
    "score": 274,
    "url": "https://reddit.com/r/StudentNurse/comments/1jokdkx/advice_to_fellow_students_be_discreet/",
    "created_at": "2025-04-01T01:52:56.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1mimkvy",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "my family doesn’t want to go to my pinning.",
    "text": "as the title says, my family doesn’t want to go to my pinning ceremony anymore. \n\ni finished my RN program yesterday, and my pinning ceremony is this thursday. i have said for months now the date and time. today, my mom (who, by the way, has been an RN for 20+ years now) tells me she can’t go, but i should just get over it because she didn’t have a pinning ceremony. and by this news, especially because i asked her to pin me, i started to cry. she told me to “stop f-ing crying” and get “over myself” because she didn’t have a pinning ceremony. \nmy siblings decided to make plans with friends instead, and that i can get over a little. \nbut it just feels like such a slap in the face, to come so far, and i just want to be recognized by my family that i made such a huge milestone. \ni thought about asking one of my professors to pin me, since she played a huge part in my schooling, but i just feel so sad im going to be alone at my pinning and nobody is gonna be there to support me. all of my friends are long distance and aren’t able to come if they could. \nat the end of the day, i pulled myself through nursing school and i got myself to where i am. im just sad and had to vent about it :( \n\nUPDATE: i am so happy to read all of these wonderful replies, thank you all! 🤍 i wanted to write that i was doing some thinking, and i realized the one person who actually was there for me during my school was my nursing school bestie. we retook all of the same courses together, cried, laughed, and cleaned up so many code browns together. i just asked her to pin me, and she gladly accepted. all of my friends from out of town are going to be watching my pinning from home when it’s streamed! while it’s not my immediately family there, i am so happy i have a mini chosen family with my friends. 🤍\nUPDATE 08/06: my grandparents are going to come after asking them last minute! that just leaves me to give away my third and extra ticket",
    "score": 274,
    "url": "https://reddit.com/r/StudentNurse/comments/1mimkvy/my_family_doesnt_want_to_go_to_my_pinning/",
    "created_at": "2025-08-05T21:52:59.000Z",
    "num_comments": 129
  },
  {
    "id": "reddit-1m87wdy",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Just got accepted to nursing school!",
    "text": "I’M SO EXCITED!!!! I worked my butt off, maintained a 4.0 throughout my prerequisites, and got accepted 8 days after the application period. \n\nI’ve been a member of this sub for a while now, (finally got to change my user flair!) and bc of this, I’ve seen all the posts about how TOUGH nursing can be, but also how it can be rewarding, silly, inspiring, heartbreaking, scary, and fun. Thank you guys for giving me an accurate, (if slightly bitter😜) idea of what to expect in my new career :)) ",
    "score": 265,
    "url": "https://reddit.com/r/nursing/comments/1m87wdy/just_got_accepted_to_nursing_school/",
    "created_at": "2025-07-24T15:45:11.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1mboaaa",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Going back to nursing school as an older student - I did it. Here's what I learned that no one told me",
    "text": "I've watched this sub for a long time and even posted myself here and in a few student RN subs asking for advice and guidance about going back to school as an older student for an RN. I know posts abput going back to school come up not infrequently. So, this one is for all those lurkers out there! Here's my experience:\n\nI'm younger Gen X -- and I went back in my upper 40s. I have had a fair amount of higher education already which helped with prereqs and gen ed classes. Kids were a good age, spouse willing to step up on household duties. I've spent the last 10 years working in a healthcare aligned field, and I wanted to make my credentials a formal match for my experience. I'm also sandwich generation eldest child (and my spouse is an only child), so my eyes are wide open about how much elder care is going to be in my future between aging parents and in-laws. It will be an awful lot - like it or not. \n\nAll these things (prior education, personal capacity, professional and personal goals, and future circumstances) factored into my decision about whether it was worth it to return to school at my age; I invite you to consider these things as well -- ultimately I decided it was not worth it to invest in a very expensive direct entry BSN program but a much less expensive ADN program from my community college could be a worthwhile investment, given my previous education and work experiences, to unlock some lateral career movement and also provide support to the elder care that is inevitably headed my way. \n\nSchool was demanding, but I passed NCLEX first time. No regrets with the program and I'm happy to have achieved my professional goals. I have a new job and overall am content with my decision. But, here's what I have since learned that someone who hasn't been an older returning student won't know to tell you if you are thinking about this move for yourself:\n\n1. Hospitals want fresh young folks willing to work tough units and hours. As an older person your capacity to recognize working conditions that may be toxic, or use firm boundaries with management may be seen as a detriment and not an asset. Employers know it and may pass you over for younger, less experienced applicants.  \n\n2. This work is hard on the body and mind. I'm talking on your feet, compression socks, no pee breaks, and crazy hours - esp as a new grad when most of the work is nights. You will need time to come home and decompress. You will be sore from work. You will need time to collect yourself before going in. Also, most new grad positions are full time 7p-7a, which may be harder to do once the biological realities of perimenopause set in (if applicable). If you can't do hours like that, it will be that much harder to find work as a new grad. Part time or outpatient positions for less experienced new grads are very, very hard to come by. \n\n4. Age discrimination is alive and well in the job market and nursing is no exception. See #1 above. \n\nI'm sure there are other things I'll think of so I will edit this post if it's well received. Good luck with whatever you decide! ",
    "score": 262,
    "url": "https://reddit.com/r/nursing/comments/1mboaaa/going_back_to_nursing_school_as_an_older_student/",
    "created_at": "2025-07-28T18:32:06.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1kxzlkz",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "If I could do it, YOU CAN to!!!",
    "text": "Congratulations to all of class of 2025!!!! 🎉\n\nI recently graduated from a BSN program, and I never thought I would make it this far. If you’re doubting yourself, this message is for you. I failed one semester, took two semesters to finish one, and got held back semester due to a med dosage exam (that wasn’t my fault), and had a mass in my groin and was able to make it this far! But, I couldn’t do it by myself. I had family, friends, colleagues, and faculty who helped pave the way for me. No I did NOT graduate with a 4.0, I actually finished with a 2.5 nursing school gpa and that’s okay. And this is a reminder for my future self and you guys to let you know that YOU CAN DO IT!! I’m not the smartest or brightest and would even spend weeks to study to just get a 70 on an exam, but I got through. Here are small little tokens:\n\n- Find a way to study! For me it was videos. I would make sure to write every little detail. A 30 minute video suddenly became a 2.5 hr session but at least I came out knowing the pathophysiology and nursing care. Yes I didn’t like it but it what was worked for me. Some might be using the PowerPoint or audio and that’s okay. Someone else’s way of learning doesn’t mean it has to be yours.\n\n- Talk with people. Friend/study groups helped me incase I missed any small details or just be able to discuss the topics. Teach-back method helps solidify your understanding. \n\n- Get a job if you can in the specialty you want to work in the future. This helped me build my confidence and skills. I had teachers and faculty put me down due to my scores being low meaning idk nursing skills and won’t ever be a nurse. Guess what? Holyairball. Getting a job helped with networking and being able to prove to myself that I can do this!! Also, get a job in the specialty you want work after graduation but mainly for ED or ICU. Not very common to get these roles if you don’t have the “experience.” In my case I landed it but it’s very rare. Getting a job helped me also gave me confidence to work with my clinical instructor than just shadowing. It helped me create relationships with people and to get out of my comfort zone.\n\n- Your grades DO NOT DEFINE YOU!! Yes it’s good to have good grades, but I’ve seen many people who have good grades that fail clinically and vice versa. Don’t sell yourself short. YOU HAVE WHAT IT TAKES!!!\n\n- Take care of yourself. Health is wealth. It’s easy to say but not easy to do. Find what helps you heal or relax. For me it’s family time and binge watching, for others it’s going to the gym or going out. Find what works for you.\n\n- Build your time management skills. If you manage your time well; you will be able to find that you can work, study, and relax. Also these skills translate to your work in the future. \n\n- Always take practice exams. For me I knew the concepts and pathology of disease processes. But because I didn’t do practice questions and tests, I was always was a poor test taker. Yes it might not help you at work, but it will help prepare you for the NCLEX and how to understand the question and not overthink it. \n\nI hope this helps someone out there. Incoming classes, you guys got this!!!! Good luck future nurses!!",
    "score": 260,
    "url": "https://reddit.com/r/StudentNurse/comments/1kxzlkz/if_i_could_do_it_you_can_to/",
    "created_at": "2025-05-29T02:26:53.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1lolvw3",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "You don’t need to pay for extra crap to survive nursing school &amp; the NCLEX!!",
    "text": "I want to share my experience now that I’ve graduated from an ABSN with a 3.6 gpa, and just passed the NCLEX in 85. \n\nYou DO NOT need to pay for your best grade, uworld, mark k, archer, whatever the current thing is to do well in school (and the NCLEX) \n\nIf you are of average intelligence (be honest with yourself, if you struggle that’s ok and those tools may help you!), go to a decent school, and study an adequate amount, you’re going to be fine. Use free resources like YouTube if you need a better explanation. Read your PowerPoints from lectures. Read the book. Relisten to lectures. Study with friends to come up with stupid ways to remember info. \n\nAnd use the resources your school gives you that you’re already paying for! My program included the Saunders NCLEX prep book that came with practice questions on Elsevier. For the NCLEX I studied that book and did those questions. I wrote notes in the book for the rationales of questions I got wrong to review. I googled a list of common meds on the exam. I watched a free NCLEX review on YouTube. That’s it. I spent 2 weeks very casually reviewing. You don’t need a 6 week study plan 8 hours a day if you did well in school. Trust yourself that the knowledge is in there somewhere! \n\nI just wanted to give those that are worried some reassurance. If you’re tight on cash or just find the concept of spending MORE money ridiculous, you can still do well with what you’re given. ",
    "score": 257,
    "url": "https://reddit.com/r/StudentNurse/comments/1lolvw3/you_dont_need_to_pay_for_extra_crap_to_survive/",
    "created_at": "2025-06-30T22:54:27.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1mbzvlo",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "RN and Job secured!",
    "text": "I recently graduated and passed my NCLEX! I was also able to get a position in an ER new grad residency program. After hearing about the horrors of finding a new grad position in CA, I am very happy and relieved. I now don't know what to do with all this free time before I start. \n\nSome tips I have found that helped me:\n\n* Take your NCLEX asap! I know classmates who waited too long and then ended up failing, delaying their ability to get a job after graduating.\n* Bring copies of your nursing interview portfolio as I was told by my manager that it definitely makes a big impact on choosing candidates.\n* Wear at least business casual to interviews.\n* Work in the hospital during nursing school if possible as it is your foot in the door to land a job or interview when you graduate.\n* Look for job fairs hosted by hospitals. They will regularly announce it on their website or newsletter. \n* Have your career advisor look over your resume and try to get a mock interview\n\nI wish you all the best of luck in school and finding jobs!",
    "score": 255,
    "url": "https://reddit.com/r/StudentNurse/comments/1mbzvlo/rn_and_job_secured/",
    "created_at": "2025-07-29T02:35:16.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1l9r2ux",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Just graduated nursing school and realized I cannot do it, any suggestions?",
    "text": "For context, I went into nursing school (BSN) and I REALLY thought I wanted to be a nurse. I poured everything into it and I really loved learning about medicine. Once I started my second year of school, though, there was a small voice in the back of my head that kept telling me nursing was just not right for me. I ignored it and pushed through. I just graduated with a 4.0 and passed my NCLEX but now that I am out, I've had time to reflect and I know that I just can't do nursing. I feel like nurses are treated awfully, management is terrible (most times), and to make matters worse, I've developed a fear of blood borne pathogens and just cannot work in nursing.\n\nDoes anyone have any advice on where to go? In nursing school I worked as a retail manager and have a lot of experience working for the college which could maybe help me transition to a role outside of medicine? I really don't know what to do but I welcome any advice.\n\nAlso, please spare your criticism, I already feel crummy about my situation. ",
    "score": 254,
    "url": "https://reddit.com/r/nursing/comments/1l9r2ux/just_graduated_nursing_school_and_realized_i/",
    "created_at": "2025-06-12T16:36:31.000Z",
    "num_comments": 273
  },
  {
    "id": "reddit-1kw8fbz",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Nursing Education is created for and by the rich, and it's killing me",
    "text": "Long story short, I didn't grow up in a good home, and some of the times I felt best cared for were by nurses in the ER. That's how I fell in love with the profession -- I wanted to give back and care for people who really needed it.\n\nI became an EMT as soon as I could so I could support myself through college, and I saved every damn penny I could. After three years of working overtime, I finished my prerequisites and signed up for nursing school. The first day of orientation, the program director came in, explained what the program would entail, and finished with a message: The only way to get through nursing school is to quit your job.\n\nThere is simply no way I or anyone else for that matter would be able to pay for rent, food, tuition, transportation, etc. through loans alone. While working as much as I could manage through school, I took on $30k in loans, and blew through the entirety of the $20k I saved. I worked every single day of my winter vacation both years I was in nursing school. I came to class every single day exhausted with only one day off a week for nearly two years.\n\nDespite this, my program operated as if they were blissfully unaware of what needed to be done just to stay afloat. Class schedules would only be posted two days before each semester started, which made scheduling shifts a nightmare. The classes themselves would be scheduled for 2-3 hours 4-5 days/week, and assignment due dates would be at 9PM so they could \"make sure we get enough sleep!\" Massive program changes would happen last minute with absolutely no communication from administration. To top it all off, when academic counseling announced in middle of the last semester, that over half the class wouldn't be eligible to graduate because of an error with a university specific prerequisite class, I was treated as a nuisance and told that it was not a \"real emergency\" to have my graduation postponed.\n\nI survived. I graduated with my BSN last month, passed my NCLEX last week and I'm now a registered nurse. And yet, and the eleventh hour, nursing has found just one last way screw me. Nursing residency programs (required for all new grads at the hospitals in my area) have extremely strict start dates. Since receiving my RN, I am no longer allowed to work as an ED tech, and yet every single nursing residency position in the area has a start date at least two months out. I'm left without a job for two months, and the advice I've heard time and time again from hiring managers, school counselors, and other nurses, is to \"just take the summer off! It's the last one you'll be able to enjoy!\" \n\nI'm sick and tired of being treated as if mommy and daddy pay for everything.\n\nAnyways guys, I'll be enjoying the warm summer air sleeping under a bridge. Sounds like a blast.",
    "score": 248,
    "url": "https://reddit.com/r/nursing/comments/1kw8fbz/nursing_education_is_created_for_and_by_the_rich/",
    "created_at": "2025-05-26T23:12:13.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1lt65e6",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Is it appropriate to wear a DNP badge buddy while working as an RN?",
    "text": "As we all know, ost facilities use badge buddies that display credentials like RN, BSN-RN, MD, etc. I work with a nurse who has earned her DNP but hasn’t yet obtained licensure as a nurse practitioner. She still works strictly within the RN scope of practice, but she wears a DNP badge buddy.\n\nIs it just me, or does that seem a little off? I get that she earned the degree, just like someone with a BSN might display BSN-RN. But since her current role is under her RN license, does wearing \"DNP\" give the wrong impression about her clinical authority or role?\n\nCurious what others think.\n\nEdit: everyone needs to calm tf down. I'm VERY aware of the difference between *degree* vs *license.* I just wanted to have a low-key discussion. I'm not sure why so many of you are being rude about it. ",
    "score": 245,
    "url": "https://reddit.com/r/nursing/comments/1lt65e6/is_it_appropriate_to_wear_a_dnp_badge_buddy_while/",
    "created_at": "2025-07-06T16:59:47.000Z",
    "num_comments": 336
  },
  {
    "id": "reddit-1lecyp7",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Oh the fun of pay rumors.",
    "text": "My unit is up in a storm.  We all just got \"market adjustments\"  no email 3 months out announcing it like normal.  Same time, a rumor started 1 \"new grad\" RN ADN (LPN 4 years) is starting at $50/hr.  They are allegedly counting her LPN and EMT time eventhough all other new grads are told previous experience doesn't matter.\n\nFor context, with the market adjustment I make $41.89 BSN, 2 years experience, one of our charge nurses $55 BSN 45 years experience, another nurse (ADN) charge, with 6 years experience $48 and another with her master's and 10 years making $49.  New grads are supposed to start at $38.25.\n\nSome people have already started applying for other jobs out of frustration.  And 2 people have sent emails saying the entire unit needs their wages reevaluated if a new grad ADN is making more than everyone under 20 years of experience.\n\nI am fully expecting an email saying do not disclose pay and nothing else to be done.\n\nWost part, she is just one of management's favorite for some reason.  Poor work ethic, no extra responsibilities, lazy, typical mean girl attitude, has a special schedule (different start/end times than the rest of the unit), comes in when she feels like it, can't be called off because she needs her hours so other staff get sent home (email directly from supervisor saying not to call off).  \n\nOdds anyone gets more money?\nMy guess 1%",
    "score": 244,
    "url": "https://reddit.com/r/nursing/comments/1lecyp7/oh_the_fun_of_pay_rumors/",
    "created_at": "2025-06-18T09:44:53.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1o2m27p",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "clinical instructor hit student",
    "text": "should i report my professor?\n\nwe were at clinical this week (clinical site is a nursing home this semester.) one of my classmates was checking a resident’s vital signs, specifically the resident’s oral temperature. i’m not sure if she may have put the thermometer under his tongue a little too deeply or if the resident was just over-reacting, but he moved his head away from the thermometer, started groaning in frustration, and started flailing his arms to get the thermometer out of his face.\n\nmy professor/clinical instructor saw all of this happen, and in reaction to the situation, without even asking questions or assessing what happened, she hit my classmate’s arm really hard and yelled “what are you doing?!” it wasn’t a gentle tap or anything. it was a hard hit/slap on the arm that spooked my classmate and surprised me.\n\nmy classmate apologized to the professor and the resident, and the resident let my classmate redo his temperature reading (even though he was being mean and saying rude things to her throughout the whole thing.)\n\nanyways, i want to report my professor for her behavior, but i wanted others’ opinions on this. unfortunately the culture in my school’s nursing program seems kinda toxic, like the faculty members and professors are all buddy-buddy and are pretty rude and disrespectful to the student nurses, and that makes me worry that if i report my professor that she won’t face any consequences and might even worsen her behavior toward us students.\n\nshould i report her anyways? all opinions appreciated.\n\n(edit: some people are saying that i should talk to the instructor directly, so i wanted to clarify this: usually, talking to the person directly who i have the issue with would be my first course of action. however, i don’t believe it would be the best course of action in this scenario. my clinical instructor has shown disrespectful behavior to us nursing students since the beginning of the semester. she belittles us, talks trash about us to the other professors in front of our faces, constantly rolls her eyes at us and death stares us for no reason, and barely acknowledges our presence when we try speaking to her or asking her questions (sometimes just plain ignoring us.) i have brought this up to her before and a classmate of mine has confronted her about this behavior as well, but she just death stared us and walked away. for these reasons, i don’t think she would be receptive at all to what i say to her (not to mention there is a huge cultural difference as she is from another country where maybe behavior like hers is normalized toward students??? idk.) i continue to show respect toward her every day, but this situation makes me feel like she really has to be checked. i don't want my instructor hitting me or other students in the future, and i don’t think my classmate should have been hit in this situation either.)",
    "score": 242,
    "url": "https://reddit.com/r/StudentNurse/comments/1o2m27p/clinical_instructor_hit_student/",
    "created_at": "2025-10-10T00:04:59.000Z",
    "num_comments": 106
  },
  {
    "id": "reddit-1ih64ju",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I got a job offer in the ICU!!",
    "text": "I didn't think I would get this far! 😱 It was my very first nursing job application. \n\nI ran my resume and cover letter by a nurse friend, and verbally prepared answers to nursing interview questions that I found online. I also watched some videos on Youtube of other people doing mock nursing interviews.  \n\nI have a strong GPA (3.84) and really emphasized how excited I am about the learning opportunities the ICU would present. I also had one of their floor nurses as a clinical instructor last semester, which we talked about in the interview, so I suspect she was able to speak to my pros/cons if they asked. \n\nMy interview was much shorter than I expected coming from a non-nursing profession. I actually left wondering if I fucked up and they cut my interview short 😅 Apparently not! ",
    "score": 235,
    "url": "https://reddit.com/r/StudentNurse/comments/1ih64ju/i_got_a_job_offer_in_the_icu/",
    "created_at": "2025-02-04T01:32:49.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1inukjw",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Why are nurses at teaching hospitals so mean?",
    "text": "I had my first clinicals yesterday and it went horribly. The nurses didn’t try to hide their distaste for us. There was no guidance, which is fine I’ll observe that’s super helpful too! But there was absolutely no acknowledgment from the nurse during the 8 hours we spent together. She didn’t even ask for my name. When I was leaving I said goodbye and thanks and she gave me a little more than a nod. The other students had similar experiences with their nurses, and the other clinical groups in our cohort had the same stories as well even thought they’re all different hospitals. I’m just trying to wrap my head around how someone who’s essentially a community advocate and teacher displayed such horrible behavior and manners. \n\nAlso I’d like to note that I completely understand nursing is a fast-paced job and her job doesn’t encompass holding my hand thru the process but she had enough time to take a lengthy coffee break 20 min into her shift. A couple of seconds is all it takes for a basic human interaction between two people ",
    "score": 232,
    "url": "https://reddit.com/r/StudentNurse/comments/1inukjw/why_are_nurses_at_teaching_hospitals_so_mean/",
    "created_at": "2025-02-12T16:15:01.000Z",
    "num_comments": 122
  },
  {
    "id": "reddit-1kpyjbk",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Unpopular opinion: BSN ≠ Leadership Material — Especially Fresh Out of School",
    "text": "Let’s be real for a minute.\n\nHospitals are so obsessed with degrees and Magnet status that they’re fast-tracking brand-new BSN grads into leadership and ICU roles before they’ve even learned how to time a lunch break or call a rapid without panicking.\n\nHow is this safe?\n\nSome of these grads are barely out of simulation labs and suddenly they're charge nurses, preceptors, or managing ventilated patients. Meanwhile, ADN nurses who've been grinding at the bedside for years—handling codes, training others, actually knowing how the unit works—are passed over because they don’t have the right letters behind their name yet.\n\nI’m not knocking BSN grads. I respect the grind. But a degree doesn’t make you a leader—it makes you a nurse with a degree. Leadership requires experience, emotional intelligence, and clinical intuition—none of which you can get in a classroom or APA paper.\n\nWe’re losing seasoned nurses left and right. Replacing them with inexperience wrapped in credentials isn’t just short-sighted—it’s dangerous.\n\nBut hey, maybe I’m wrong. Let me have it. What are ya'lls experience with this?",
    "score": 207,
    "url": "https://reddit.com/r/nursing/comments/1kpyjbk/unpopular_opinion_bsn_leadership_material/",
    "created_at": "2025-05-19T00:18:51.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1je35a8",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Was this everyone's nursing school experience",
    "text": "Hi there, paramedic of almost a decade going through nursing school here. Just a couple questions. \nSo far (about halfway through the first semester) I've done fuckall in school. It honestly feels like a scam. The amount of times I've been told by professors this semester that \"we don't have time to go over this, so just learn it on your own. By the way, test on this next week\" is insane. I'm confused as to why I'm paying so much money in tuition and fees to learn from ATI or nurse sarah on youtube IN CLASS. I had my first clinical yesterday. I had 1 patient that I did 1 head to toe assessment on, in 10 hours. \nI understand with previous experience I'm probably jaded in that it feels dull and a waste of time. But I feel bad for my classmates. Most of them have no experience and are having to teach themselves everything because the instructors aren't teaching a damn thing. Was this everyone's experience, or is this school a dud?",
    "score": 207,
    "url": "https://reddit.com/r/StudentNurse/comments/1je35a8/was_this_everyones_nursing_school_experience/",
    "created_at": "2025-03-18T11:53:06.000Z",
    "num_comments": 98
  },
  {
    "id": "reddit-1jpexg6",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "In nursing school but don’t want to be a nurse",
    "text": "I’m 25, super quiet, and pretty awkward. I don’t know why I thought nursing was a good idea. Everyone in my class seems to be so passionate about nursing and they know what area of nursing they like, meanwhile I seriously dread going to clinical and have no interest in working bedside, making it difficult to find the motivation to continue (I can’t drop out). I guess I didn’t realize the level of communication I would need to possess (I do not have wonderful social or communication skills… I feel so weird at the bedside because I suck at small talk and just do not have the energy it takes to interact with care and enthusiasm). I feel like such an imposter, actually, and I’m not sure how I’ve made it this far. I mainly function on routine and there is no routine as a nurse since everything is always changing or could change at any moment which completely overwhelms me. I’m kind of a slow processor so it’s just not my gig at all. I also feel extremely overstimulated on the unit with all of the beeping and so much going on at once. The level of responsibility I would have as a bedside nurse terrifies me. Anyway, I need to at least finish the program, but I need to figure out what I’m going to do post-grad as a nurse. I’ve thought about home health or psych nursing but I don’t know.",
    "score": 200,
    "url": "https://reddit.com/r/StudentNurse/comments/1jpexg6/in_nursing_school_but_dont_want_to_be_a_nurse/",
    "created_at": "2025-04-02T03:10:14.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1izgbp3",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I got to witness a CABG",
    "text": "During my clinical rotation, my patient went down for open heart surgery. It was so surreal to meet my hospitals heart team and to witness how the whole surgery is orchestrated. I’m 3rd semester in an ADN program and I’m just now finding out I’d love to be an OR nurse. It feels so good to find my “home”.\n\nHow did you realize what specialty you wanted to be in? ",
    "score": 199,
    "url": "https://reddit.com/r/StudentNurse/comments/1izgbp3/i_got_to_witness_a_cabg/",
    "created_at": "2025-02-27T13:55:05.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1ofsyzv",
    "subreddit": "nursing",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Annoyed at hospital nurses who feel LTC nurses are not real nurses",
    "text": "As the title says I am annoyed! LTC is a nursing specialty, a hard specialty with little to no resources. We as RNs all take the same NCLEX. Both RNs and LPNs are all nurses. Please stop being condescending to LTC nurses because you have a superiority complex or you feel LTC is not real nursing! \n\nI am tired of hearing it when I call to give report or when I have to send a patient to your hospital. It’s not that we like to dump our patients, it’s that we do not have the proper resources to safely manage their care at our facility so we have to send them to you. I hate the push back, the attitude, the stupid comments of “did you try the other arm for blood pressure?” \n\nJust because we nurses avoid hospital work, does not mean we are incapable. I worked my way up from CNA to LPN to ADN to BSN and now I’m in my MSN program. I have worked in many other specialties since I’ve been in healthcare and I have been a nurse for other 10 years. Thank you for letting me rant! ",
    "score": 191,
    "url": "https://reddit.com/r/nursing/comments/1ofsyzv/annoyed_at_hospital_nurses_who_feel_ltc_nurses/",
    "created_at": "2025-10-25T14:30:23.000Z",
    "num_comments": 137
  },
  {
    "id": "reddit-1j0gtwf",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Wife just passed her board exams. Wanted to drop in and share some of the prep we did and the questions she went through.",
    "text": "I'm a RN of just over 10 years. She just took her boards earlier in the week and found out she passed today. She did 85 questions before it shut off. She had to take the new next gen questions.\n\nMost of our prep for the boards had begun towards the middle to the end of her last semester. I say \"our prep\" but let me clarify that she did 99% of the work and I mostly answered/clarified  questions if she was confused or stuck on any and of course, gave emotional support (lol). She did a lot of practice questions from start to finish of her program though which helped her tremendously.\n\nShe took it pretty quickly after graduating and it worked for her. We focused on ATI and Archer for practice questions and reviewed some of her weakpoints (Cardiac, Pharma and select all that apply).\n\nShe felt she had an even balance of mental health, mother/baby, med surg but says that if she had to guess then pharma and select all that apply probably showed the most for her. \n\nHer biggest problems that I could tell was not reading the question in it's entirety. She had some easy misses on her practice tests/exams that were largely due to her getting hasty and jumping the gun without fully reading the question.\n\nOne thing I forgot to also note is to not let the results from mock exams get you down. I'm not saying to ignore it but it's not the end of the world if you bomb one mock exam or two. She took one the day of the NCLEX (against my advice lol) and did *poorly* on it which really didn't help her mentality. She took a few leading up to the big day though and generally trended well and had the odd one or two bad ones out of the group. \n\nIf you have days where it feels like you're hitting a wall or you've had to re-read the damn question a dozen times and it still didn't make any sense then get up and go walk or do something else and return.\n\nTry to do questions on a daily basis if you can. We shot for 100-250~ or more usually. \n\nHope this helps/is appropriate to post here. Good luck. Ya'll can do this.",
    "score": 179,
    "url": "https://reddit.com/r/StudentNurse/comments/1j0gtwf/wife_just_passed_her_board_exams_wanted_to_drop/",
    "created_at": "2025-02-28T20:02:11.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1l4f8i5",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I did it!",
    "text": "It's been a long road, but I wanted to share my victory:  \n  \n**I took my NCLEX yesterday and got an email from my state's department of nursing with my license number last night.** \n\n  \n**Background:** I'm in my late thirties, with no real\\* college education prior to 2020. I decided to go back to school after getting laid off during the pandemic, and after 2 semesters of classes, decided to go into nursing and started my prerequisites. I earned my AA and completed my last prerequisite in fall of 2022 and applied to \\~10 BSN programs across the country that same semester. I moved to a new state in late December 2022 and began classes in my BSN program 10 days later. \n\n\\*I did enroll in classes in 2004 and 2005, but neither attended nor withdrew, leaving me with a pretty messy transcript that did indeed come back to bite me in the ass later on. \n\n***Why so many schools in so many locations?*** \n\nBecause I could, mostly. Also because I attended community college in CA and got my AA for free, but I couldn't count on getting into an affordable BSN program in CA. I also couldn't afford to spin my wheels and wait around for a lottery or waitlist ADN program to become available. I was pretty broke, so most schools were willing to waive my application fees, so the cost of applying wasn't significant. \n\n**My advice:** Ask about application fee waivers. Consider moving out of state-- stepping outside your comfort zone builds character and develops empathy. If you're in CA, you'll have a lot more options elsewhere.\n\n***How did I pick the schools?***\n\nThis was a process. There are a lot of nursing schools in the US and I don't have any real allegiances to any particular area. I started by considering what kind of place I wanted to live in, because quality of life is important. My final \"must have\" list: population &gt;100k, within 2 hours of a reasonable airport, not Florida, reasonable-ish cost of living.\n\nBeyond that, after confirming accreditation, etc., I screened for which schools wanted the prereqs I'd already taken. Some schools wanted organic chemistry or calculus and I hadn't taken them and didn't want to. I simply eliminated schools that wanted those, because I wouldn't be eligible for them this application round anyway. Finally, I also screened schools for which ones offered a spring start. This eliminated roughly 60% of my options, which was kind of a surprise, but I didn't want to sit around for 8 months for a fall start. \n\n**My Advice:** Start a spreadsheet for your application process! Track application opening dates, due dates, fee deadlines, prerequisite information, whatever information is important to you. It is such a pain to find all of the pertinent information on multiple schools' websites, just go ahead and consolidate it in a spreadsheet with links to applications and whatnot. My spreadsheet saved my butt in keeping deliverables all straight!\n\n***My school experience:***\n\nMy BSN program was 5 semesters. It didn't need to be. It felt like a solid 17 credit hours could have been emails. The instructors were pretty universally lovely human beings and likely talented nurses, but that doesn't mean they were all effective instructors. I was a very active participant in class, engaging purposefully in lectures. I stopped taking notes after I realized I never looked at them. I swore up and down I was going to build good study habits... I didn't. \n\nDon't get me wrong. I didn't party. I completed homework religiously and turned it in on time and followed rubrics like the lifelines they were. I missed one single class (and I made the purposeful decision to skip it when I found out what the discussion for that day was going to be). That said, I didn't make school my life: I worked 20-35 hours/week as a nanny. I built a life in a new city. I hiked and biked and canoed a lot. I threw a lot of dinner parties. I drank a lot of cocktails and organized full moon hikes and meteor shower camping trips.   \n  \nI graduated with a cumulative GPA of 3.58, after having my grades from nearly 20 years earlier come back to haunt me. I still graduated cum laude, but I'm bummed that my poor decisions from BEFORE SOME OF MY CLASSMATES WERE BORN had an impact on my GPA.\n\n**My advice:** Don't let school consume you. Yes, go to class. Yes, do your homework. But please let the fact that you're in nursing school be the least interesting thing about you. Nursing is your career, not your life. Live. Make friends. See the world. If you're studying 10+ hours/week, I personally think you're doing something wrong. Finally, get to know your teachers. It goes a long way in building bridges and making it easy to ask for letters of recommendation for jobs or scholarships or whatever. \n\n***My clinical experience:***\n\nHonestly, it was a mixed bag. I spent some time at a SNF, on med/surg floor, in stepdown, in the ICU, and in the ED. I had a single day each in L&amp;D, peds, picu, and postpartum. The facilities were a mixed bag, but I felt really fortunate to spend some time at all 3 major hospitals in my area. What I thought I wanted wound up not being at all what I wanted to apply for, mostly for culture reasons. I realized I'd much rather work somewhere that was a good culture fit than get what I thought I wanted and wind up miserable.\n\n**My advice:** Keep an open mind. There's something to learn everywhere. Pay attention to the culture of different facilities and specialties. Don't be your own limiter. \n\n***Finances:*** \n\nI knew I'd be paying out-of-state (OOS) tuition for the first year. I confirmed it with the registrar prior to accepting my seat. I also made a checklist of what I needed to do to petition my residency status and become an in-state (IS) resident. I did all those things... and had my petition denied because of... unknown reasons. I fought tooth and nail, appealed and re-appealed, but did wind up paying OOS tuition for 3 of my 5 semesters. I was mad about it. I also fucked up and didn't know about all of the scholarship opportunities available to me those first 3 semesters, but had all of my tuition and books paid for by scholarships the remainder of the program. \n\nBeyond that, I burned through savings and worked. I fully acknowledge that I wasn't living super frugally (no roommates, for instance). I kept my two dogs. I traveled a tiny bit, mostly to see family. It's just money. \n\n**My advice:** Meet with a financial aid advisor immediately. I didn't and it cost me money. I didn't know I could appeal my financial aid designation. I didn't know about the school's universal scholarship application. I didn't know that they could have helped me finesse my residency petition. \n\n***NCLEX prep:***\n\nMy school mandated the use of KAPLAN as test prep. It was included in most of our lecture classes, utilizing some of the tests as assignments. We had a full-on prep course our final semester that was basically just \"do this test, remediate the questions, create a study plan to address your deficiencies\" every week. I didn't love KAPLAN. I didn't use it extensively, maybe doing another 300 questions post-graduation. Eventually, I just kinda felt like it was all blurring together and my practice scores were dropping and I was feeling dumber, so I abandoned KAPLAN entirely about 4 days before the test. I scheduled my NCLEX for as soon as my work schedule allowed, about 4 weeks post graduation. It completed at 85 questions and took me 56 minutes. \n\n I felt very unsure about how I was doing on the test, and panicked internally when it shut off. I didn't feel particularly confident-- there were drugs and procedures that I couldn't recall anything about. Yes, I got \"the good pop-up\" about 90 minutes later. My state emailed me my license info later that evening. \n\n**My advice:** Yes, learning about NCLEX-style questions helped. Yes, attending nursing school helped. That said, I think the thing that benefitted me most was being a voracious reader-- I read very quickly and have good comprehension, even at speed. I'm not convinced that KAPLAN was the magic bullet. I didn't spend money on any other study systems. I'm not big on youtube videos. I tried listening to some podcasts by some guy named Mark but couldn't get through them. Learning how to interpret NCLEX style questions is probably the most helpful thing... and I guess I used KAPLAN exclusively for that. \n\n***Job stuff***:\n\nAs mentioned above, I thought I knew where I wanted to work: which hospital, which units... and then clinicals really made me change my mind. I realized culture and work/life balance were more important to me than anything else, so I shifted gears. The hospital system I ultimately wanted to work for is notoriously difficult to get hired into, so when I found out about their nursing residency program, I decided that was my ticket in. They accept 8 BSN new grads annually, so I compiled their (extensive) application packet, completed a panel interview, and accepted their offer immediately. \n\nI had compiled a brief list of alternate possibilities, prioritizing commute distance (all were under 5 miles away) and good unit culture, but I didn't need to extend my application efforts.  \n  \n**My advice:** \n\nDon't get so wrapped up in what you think you want that you lose track of the reality of that unit. Don't sign an employment offer more than 6 months before you graduate. You're still learning. If hospitals are willing to hire that far ahead, what's wrong with them that they need to snipe all of the naive new grads? ",
    "score": 169,
    "url": "https://reddit.com/r/StudentNurse/comments/1l4f8i5/i_did_it/",
    "created_at": "2025-06-06T00:36:15.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1oqzmql",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Some study advice from a near final semester student",
    "text": "-#1 game changer-Record every single lecture even if they tell you not to. Listen to those at home at 1.5-2x speed while following the slides. This alone helped me bump my average test scores in pharm 8-10pts per exam\n\n-convert your PowerPoints to PDF (file, save as) and upload them to Notebook LM \n\n-Create a study guide in the “reports” tab “create your own” then prompting “create a study guide covering the entire source, and add a focused section on signs, symptoms, medications that differentiate similar conditions” or safety things if you are in a fundamentals class/adjust depending on the class you are currently in\n\n-hit the edit button on the create quiz tab and select questions “more” level of difficulty “hard” and prompt it to make an Nclex style nursing practice exam covering all contents of the source. Add questions that test ability to identify specific differences in similar conditions.” Add how many questions you want (if you don’t it will usually make the exam pretty short) I do 40-50 questions\n\n- find your weak spot then have it create a chart identifying differences in conditions covering those weak areas\n\n-stop using ChatGPT to make tests, they are garbage in comparison\n\n-Put the drinks down, do what you can to sleep…3-4 nights prior to exam just a couple hours each night and a quick review of the reports the morning of\n\nGood luck.\n",
    "score": 140,
    "url": "https://reddit.com/r/StudentNurse/comments/1oqzmql/some_study_advice_from_a_near_final_semester/",
    "created_at": "2025-11-07T16:52:54.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1ljc15p",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I’m seriously debating dropping out of nursing school, and I don’t know what to do anymore",
    "text": "I just failed my second exam in a really competitive nursing program. The class average was high, and of course like usual I am the one who makes the failing score. What’s killing me is that I try. I study like crazy. I make long, detailed study guides. I use active recall, I go to tutoring, I speak to my professors, I use practice questions, quizlet, kahoots, simplenursing, nurse sarah, levelupRN, you name it and I’ve tried it. I literally try everything. But it’s like my brain just can’t keep up.\n\nI have a disability that affects how I process information, and no matter how early I start or how hard I push, it’s like it’s never enough. Everyone else seems to be doing fine, and I’m sitting here wondering what’s wrong with me.\n\nI’ve thought about going to CAPS or mental health services, but honestly, they’ve been useless in the past. I’m just mentally and emotionally exhausted. I’ve been thinking, “What kind of career is going to take someone like me?” If I can’t pass these exams, how the hell am I supposed to pass NCLEX, or even make it to graduation?\n\nI’m at the point where I’m questioning if nursing is even for me. I don’t want to give up, but it’s hard to keep fighting when it feels like I’m always falling behind, even when I’m doing my best.\n\nIf you’ve ever been in this spot, where you care so much but it’s just not working—how did you get through it? Or did you move on to something else?\n\nI don’t know what I’m looking for, honestly. Advice, encouragement, reality check, anything. I just feel so alone in this.\n",
    "score": 124,
    "url": "https://reddit.com/r/StudentNurse/comments/1ljc15p/im_seriously_debating_dropping_out_of_nursing/",
    "created_at": "2025-06-24T14:06:38.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1o9847h",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "I’ve Failed NCLEX 4 Times – I’m Exhausted and Need Advice",
    "text": "\nHi everyone,\n\nI’m feeling completely lost and devastated. I’ve taken the NCLEX four times and failed: •\tFirst exam stopped at 89 questions •\tSecond at 85 questions •\tThird at 139 questions •\tFourth, just two days ago, shut off at 85 questions\n\nOver the past two years, I’ve worked extremely hard: •\tUsed Archer twice, UWorld once, Bootcamp. •\tSolved nearly 7,000 questions and read all explanations for correct and incorrect answers •\tFinished Archer with an overall average of 70% and took detailed notes •\tWatched all of Dr. Sharon’s videos •\tCompleted all 12 Mark Klimek lectures •\tAll my CAT practice tests came back as “PASS” •\tReadiness assessments consistently showed High and Very High\n\nDespite all this, I feel mentally and financially drained. I can’t think clearly anymore.\n\nDo I have any other options? Should I give up, or is there a way to continue and finally pass?\n\nPlease, I desperately need guidance, advice, or any strategies that worked for others in a similar situation.\n\nThank you so much.",
    "score": 98,
    "url": "https://reddit.com/r/StudentNurse/comments/1o9847h/ive_failed_nclex_4_times_im_exhausted_and_need/",
    "created_at": "2025-10-17T17:48:06.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1kh6mrr",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Update on study methods for students with ADHD",
    "text": "So, I had previously posted on this sub on how to study for nursing school when you have terrible ADHD. I specifically posted it to help give me pointers for pathophysiology… and after locking in I got 95+ on my last two exams!  What I learned is that since my attention span is horrible, I have to look at my notes EVERY SINGLE DAY. You may be thinking, “shouldn’t you do that any way” well yes, but the thought of that makes me cry. I’m not talking about looking at them every single day for hours either. What I did is I look at my notes for as long as I can stand it each day. Could be 15 minutes or hours (even when I tried to study for over an hour I ended up on tiktok), no matter the time or place. I have google docs on my phone so if I’m dozing off, I just pull up my study guide and read it so it can put me to sleep. The more you look at it little by little, eventually things will start to click. I have 2-3 weeks between each exam and so right when I finished my last patho exam I booted next weeks notes or chapters to get ahead. So I’m exposing myself to the material for 14+ days straight. If I got bored I uploaded my notes into NotebookLM and told it to “explain thoroughly in Gen Z lingo”, while I scrolled on twitter. The audio is actually fun to listen to when they suddenly bring up “clocking” oncogenes. I also did nclex style practice questions almost every single day. I did read the book but I didn’t *read* the book. For each disorder I just looked up the pathophysiology, why it happens and contributing factors so I never have to open my book after that. Then, I highlight it and then I copy and paste it into google docs and just read that. Whiteboard method does work but I hate actually having to get up and write things when I just want to be lazy. If I didn’t understand the topic, I just closed my eyes and repeated it to myself until it clicked. Before taking the exam I would read over my study guide and notes for an hour straight then full send. I don’t look at my phone at all before taking it. Having discipline is key. I still struggle with it but this is a good balance for me. Find the method that works for you! I thought I was going to fail patho with flying colors, but I’m onto my next semester! Good luck on finals everyone!! Nursing school is hard but you can do hard things! ",
    "score": 86,
    "url": "https://reddit.com/r/StudentNurse/comments/1kh6mrr/update_on_study_methods_for_students_with_adhd/",
    "created_at": "2025-05-07T19:46:10.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1pe6t38",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Y'all this is some BS: students failing because of clincials",
    "text": "So hear this: we have had a lot of clincials absence but not at the students fault. From DHEC showing up (our school policy don't allow us to be present) and instructor cancellation. Some students have missed too many clinical hours this way and are being told they're going to fail this term! Isn't that fucked up? Not the students fault AT ALL!!!! I understand they need seat hours for NCLEX but I don't see how failing the term is a fair solution.\n\nY'all ever heard of something like that? I'm not one of the students but I am mad for them!\n\nEdit: I see a lot of down votes on my replies, feel free to explain your thought process on this. I may disagree but discussion is encouraged. I FULLY understand that students are responsible for the majority of the requirements to ensure they move on. Like in clinicals, you need to FIND experiences, especially to get skills checked off. I do this all the time. I got to do a straight catch on an Indiana pouch this way. \n\nMaybe I need to restate that these students have done all the communication possible with our ADON on this. We just keep getting told she's handling it. Hopefully she's still handling it so people don't fail. \n\nAgain, feel free to comment on your thoughts. I am open to calm discussion. I appreciate everyone's opinion.",
    "score": 76,
    "url": "https://reddit.com/r/StudentNurse/comments/1pe6t38/yall_this_is_some_bs_students_failing_because_of/",
    "created_at": "2025-12-04T17:56:23.000Z",
    "num_comments": 69
  },
  {
    "id": "reddit-1l61m0f",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Passed NCLEX",
    "text": "I just wanted to share that I passed the NCLEX-RN on June 5. There's a lot going on in my life (my wife had our son in May) which I am absolutely delighted about, but I've been so sleep deprived that I had trouble remembering when I had even taken the exam when telling somebody about it yesterday. I just wanted to share the joy about finally becoming a licensed nurse around here with my fellow nursing students. \n\nThe journey does eventually end and we get to move onto the next stage of our lives. Try to remember this the next time you're at clinicals or can't sleep the night before clinicals, or the next time you're doing some bogus homework assignment/vsim/paper/pre-SIM or post-SIM documentation/group assignment/group presentation/preceptorship presentation/making pharmacology flash cards/studying a stack of flash cards/studying ridiculous mnemonics: it *will* all eventually end in you becoming a nurse. \n\nFor any who are interested in how to study for the NCLEX (or at least how I studied): I've been answering questions on yourbestgrade since February to prepare for all the HESIs I had to take in my last semester. I ended up doing about 1,200 questions from February to June, and I always studied the rationales so that it was like I was studying material from all of nursing. But in the period after my last HESI (May 6) to June 5, I only did about 100 questions on YBG, and that was only in the two days before I took the NCLEX. If you've been studying diligently all along and have practiced how to take tests and read all of the questions and answers, you should be okay. \n\nKeep up your efforts and know that you're doing a tremendous job! ",
    "score": 68,
    "url": "https://reddit.com/r/StudentNurse/comments/1l61m0f/passed_nclex/",
    "created_at": "2025-06-08T02:28:51.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1kml67i",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Classmates Cheating and program isn’t doing any about it",
    "text": "Okay so for some context: I just finished sophomore year of my 4 year BSN program. Sophomore year was our first year of actual nursing classes after a full year of prerequisites like bio and chem etc. \n\nThroughout this semester, there has been a group of students that is blatantly cheating on just about every exam. We use ATI and they have some way to get around the lockdown browser, and they also keep their phones on them to look up questions. The teachers are very aware of it, but no one is kicking them out of the program. They have literally caught one person in particular with his phone during exams with chat gpt open and he is still around. He was even allowed to keep the grade he got on that test even though he was caught red handed (the program handbook clearly says that that should be a 0 and it gets reported to the office of academic integrity). \n\nI know I’m not the first person to ever complain about classmates cheating, but I feel like this is ridiculous. \n\nAdditionally, I am one of like 8-10 males in my cohort, and the over half of my male peers are involved in this cheating. I think my professors know I am not involved, so I’m not worried about being accused of cheating. However I feel like it just gives all of the male nursing students a bed rep.\n\nI know I should just keep my head down and do my thing. I’m sure these people will wash out eventually, or atleast they will fail their nclex. But it’s still frustrating that I’m working so hard and got top marks, but they can cheat without repercussions. The professors are all aware of it and they know who is cheating. \n\nIf anyone has any advice I’d greatly appreciate it. ",
    "score": 62,
    "url": "https://reddit.com/r/StudentNurse/comments/1kml67i/classmates_cheating_and_program_isnt_doing_any/",
    "created_at": "2025-05-14T17:30:52.000Z",
    "num_comments": 84
  },
  {
    "id": "reddit-1ikr4gu",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "What’s the first thing you did when you turned in your last final/assignment for school?",
    "text": "I only have a few months left (thank god), and I love hearing what people did to celebrate/enjoy life again when they realized they were done with school, before the nclex! ",
    "score": 48,
    "url": "https://reddit.com/r/StudentNurse/comments/1ikr4gu/whats_the_first_thing_you_did_when_you_turned_in/",
    "created_at": "2025-02-08T16:29:01.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ijls3i",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "If you fail nclex, remember this advice.",
    "text": "I had a student today, she’s going to be a great nurse. But she has severe test anxiety and is worried she will fail her NCLEX. \n\nMy advice to her and any of you who fail NCLEX, yes it will suck, it can be a bit embarrassing to have to tell everyone, but you will succeed and not even care you failed\n\nOne of my classmates failed her nclex, I took mine a week later and passed the first time, stated orientation 2 weeks after that. \n\nShe retook and passed the second time. When she started her job, I was still on orientation. \n\nI do not have any advice for the NCLEX as I took the “old” one, but I’m told the “new” one is “easier” and gives partial credit for SATA. ",
    "score": 47,
    "url": "https://reddit.com/r/StudentNurse/comments/1ijls3i/if_you_fail_nclex_remember_this_advice/",
    "created_at": "2025-02-07T03:34:53.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1oru9up",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Current nurses: what was your timeline from graduation to RN?",
    "text": "Would love to hear from current nurses, what was your timeline post graduation of how long it took you to take the NCLEX and then from there get your first nursing job? ",
    "score": 46,
    "url": "https://reddit.com/r/StudentNurse/comments/1oru9up/current_nurses_what_was_your_timeline_from/",
    "created_at": "2025-11-08T16:52:14.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1od70x2",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Nursing school not so bad?",
    "text": "I am in a ASN program with 2 night classes 1700-1930 and 1 12H clinical day. Currently in my 1st semester. I have been working as a Medical assistant for about 1.5Y and think that experience has been truly helpful in school so far. Currently in a 16W Fundamentals class and I’m breezing through it. I study for an hour maybe the day of day before and just do my PrepU questions. First exam I got a 75% and that was with little to no studying and it was because it was about the history of nursing. The next 4 exams were all 85%+ and I currently have a 86% in the class. \nAll of my classmates are saying this class is very difficult and spend so much time studying. And they ask how I did so well and I really don’t have an answer. Any one else working in the medical field think it makes/ made school easier?\nI’m just kinda nervous because what if they are being to easy on us - (I guess not easy because even someone of my strongest classmates  don’t excel on all exams) but I just hope Fundamentals is not just easier class and the next semester’s difficultly level increases so much that I would fail because I didn’t spend the 1st semester honing in on study skills/habits. \nI just feel like a have in impostor syndrome because I just read/heard so much stuff about how nursing school is so hard and that people spend all their time studying. And so far that has not been my experience. Or should I just pay myself on the back and just think this may really be the field for me and that’s why I absorb the information so well. \nExtra info: My school’s NCLEX pass rate is 100% but I was told they went from 28 students to 20 students who actually finished the program. ",
    "score": 40,
    "url": "https://reddit.com/r/StudentNurse/comments/1od70x2/nursing_school_not_so_bad/",
    "created_at": "2025-10-22T12:34:35.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1m9lqul",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "Why are A.A.S nurses, barely are never mentioned?",
    "text": "Hello all, I am preparing to enroll in a two year A.A.S. program at a very reputable community college in my state. At first, I was excited because I finally felt ready to get started on my career, but then I noticed that I'm only seeing ADN's and BSN's everywhere and also not really on any of the Nursing threads on here either. My concern is due to that fact, am I going to have a problem obtaining employment are good pay as a new graduate? I plan on signing up for a Nurse residency program after graduation and then RN to BSN, but I thought I read somewhere that a A.A.S. Nurse would have to have a little more training than an ADN would.\n\nAlso, when I do research on the topic, it always says that they both are basically the same and are very similar and are leading to the same goal to become a Registered Nurse and can sit for the NCLEX-RN. It will be so helpful if someone could explain this to me or let me know if I'm making a wrong decision. This is kind of stressing me out a little so I would be very grateful if someone could give me some clear insight on all of this.\n\nAlso, ChatGPT lol said that I can take several CLEP exams that would potentially replace prerequisites. I don't know how true that is so again someone please help me out.\n\nThank you very much in advance.",
    "score": 38,
    "url": "https://reddit.com/r/StudentNurse/comments/1m9lqul/why_are_aas_nurses_barely_are_never_mentioned/",
    "created_at": "2025-07-26T05:53:43.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1jkcp9e",
    "subreddit": "StudentNurse",
    "soc_codes": [
      "29-1141"
    ],
    "title": "First semester clinicals = vacuuming an assisted living facility",
    "text": "For clarity, I am not the student. I am an ED RN, I have a family member in nursing school now in an accelerated BSN program. She is in her first semester of clinical and is currently at an assisted living facility spending most of her time busing tables in the dining hall and vacuuming, while she and a few other students collaborate on a 1 hr presentation about hydration for the residents. I may not be getting the full story on what they are doing there, so it may be that there are some education elements she has not shared with me, but I would be inclined to believe my family member that the minority of her time is spent in patient contact hours and preparing to educate residents, and that most of her time is idle or janitorial in nature.\n\nThis is in stark contrast to my experience in nursing school, which was patient contact focused and in a hospital setting from our first clinical assignment.\n\nMy ask of y'all is to inform me about if this tracks and things will pick up/improve in future semesters, or is worth an anonymous email to program administrators about my concern for the quality of clinical students are getting and if the program is meeting their accreditation standards for clinical hours.\n\nEDIT: And just so we are clear, this is a CCNE accredited baccalaureate program through a University that has a 150+ year legacy. I'm shook that this is the quality of experience this person is getting. And she is gonna be a fucking great nurse despite her program's shortcomings. She feels like this isn't right, but not sure what recourse we have while we are still counting on this program to get her through the NCLEX. ",
    "score": 30,
    "url": "https://reddit.com/r/StudentNurse/comments/1jkcp9e/first_semester_clinicals_vacuuming_an_assisted/",
    "created_at": "2025-03-26T14:11:43.000Z",
    "num_comments": 34
  }
]