[
  {
    "id": "reddit-1m7mz28",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Scrub nurses can all kiss my ass.",
    "text": "If it sounds like I'm generalizing, then I am.\n\nNo, I'm not anywhere near your fucking sterile field. We are not in the OR right now. It's up to you to move your shit out of the way so I can get my shit in too, otherwise, this procedure isn't going to start. No, I don't care that you've been working as a scrub nurse since the dawn of surgery and are so unlikeable you have no other avenues to advance your career.",
    "score": 524,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1m7mz28/scrub_nurses_can_all_kiss_my_ass/",
    "created_at": "2025-07-23T22:14:34.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1l4bpf8",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "I’m not a smart respiratory therapist.",
    "text": "Random thought for the day.  \n\nI was a terrible student.  Rarely studied, still got A's and graduated with honors.  Now a decade into this profession ... I know I'm not smart at this job.  I can't tell you this or that equation or algorithm.  I can't tell you why most things work the way they do.  Yet...I'm still the one people call when shit goes sideways.  \n\nSo to all my folks sitting in the back of the room questioning your abilities because the students in the front can rattle off every answer and equation ... don't worry because most of them aren't fun to work with :)",
    "score": 207,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1l4bpf8/im_not_a_smart_respiratory_therapist/",
    "created_at": "2025-06-05T21:50:13.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1o4rvbh",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "I've changed my mind. RTs are very necessary in the hospital.",
    "text": "A few days ago I was on here lamenting the fact that I felt like being an RT was a waste of time and most of most of the things we do can be outsourced to others (Nurses can do nebs, CNAs can handle CPAPs, etc.). The past few days I was proven wrong. I've been in the emergency department dealing with all sorts of patients (had a lady with a hemorrhaging trach, Kids with croup/asthma, CHF patients struggling with desaturating, COPD exacerbations, among others). Sometimes the doctors would call for respiratory to come assess the patient and make recommendations. I felt like Dr. House, knowing the correct diagnosis and treatment that others weren't so sure about. It is a lot more exciting than when I am just walking the floors, doing scheduled nebs. Being an RT can be very rewarding!",
    "score": 201,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1o4rvbh/ive_changed_my_mind_rts_are_very_necessary_in_the/",
    "created_at": "2025-10-12T15:23:29.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1kmt7zr",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Almost cried and had to take a 5 minute break but I somehow passed",
    "text": "If you keep getting answers wrong just realize there’s more simulations and remember you have 4 hours a 5 minute break to regroup yourself after a bad simulation is ok this test is stressful but you got to realize you made it this far and you know it. Btw tutorial systems is better then Kettering for the CSE in my opinion ",
    "score": 167,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1kmt7zr/almost_cried_and_had_to_take_a_5_minute_break_but/",
    "created_at": "2025-05-14T23:03:07.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1kdgrsf",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Shoutout to nehpets99",
    "text": "Let’s recognize a fantastic member u/nehpets99 who basically comments on every post giving great advice and knowledge especially to new RTs. I see it and appreciate it since I’m a new grad and love picking up little nuggets of knowledge every post\n\nNow to remind them to do that Q2 CPT they have been skipping out on ",
    "score": 135,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1kdgrsf/shoutout_to_nehpets99/",
    "created_at": "2025-05-03T00:56:32.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1mxvmz2",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "I just needed to vent.",
    "text": "I withdrew care on another patient today. It's odd how as an RT, I can give a baby their first breath of life, and later, give someone their last. I honestly can't remember half of the people I've terminally extubated throughout my career. I'm often the last face people see at the end, and my voice is often the last one that they hear. It doesn't destroy me, but this job just feels heavy at times. This mantle feels heavy sometimes. My team relies on me. My coworkers, patient families, and patients themselves have told me that they are grateful that I'm here, that I'm the one on shift. While I carry that with pride, it's alot to live up to. ",
    "score": 132,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1mxvmz2/i_just_needed_to_vent/",
    "created_at": "2025-08-23T08:07:22.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1k06acj",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "I got the unicorn new grad job offer and I accepted it!",
    "text": "My graduation is in 25 days and I have just completed the first step of the onboarding process for my dream job! I’m not going to post this anywhere else but I really wanted to let someone know.\n\nAs a new grad I have accepted a job that is…\nFull Time\nNICU\nNights \n\nI am definitely a night person and would rather still be up at 4am instead of getting up at 4am.\n\nI honestly thought it would take a year or more to move into a NICU position but I’m so excited to get to start at my #1 dream position. Now instead of counting down to graduation I will be counting down to my first day of work!!!!!",
    "score": 129,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1k06acj/i_got_the_unicorn_new_grad_job_offer_and_i/",
    "created_at": "2025-04-15T23:29:47.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1lxc93z",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Greetings from your new mod!",
    "text": "To my fellow snot suckers, neb jockeys, and aggressive weaners:\n\nTo my great surprised, yesterday I received a notification inviting me to join the mod team here. I've been an active member here for several years, so it's wonderful to join the mod team.\n\nA little about me: I've been an RT for 10 years (plus 1 where I worked as a student); I got my bachelor's right out of college, did nothing with that for several years, and then stumbled into RT in my late 20s. I've been a traveler for 4 years, and I've worked in 6 different states (7 if you count my 3 weeks in Texas during COVID). I obtained my ACCS in 2019, and earned a master's in respiratory care in 2023. While there are certainly aspects I don't like I'm a huge RT cheerleader and have taught RT students, RN students, med students, pharm students, medical residents, and given in-services to PT, OT, and SLP.\n\nIn 2020 I started PA school, with the hope that I could work pulm/critical care. Albuterol for CHF? Not on my watch! Sadly, PA school was like nothing I'd ever experienced before (or since) and I failed out 80% through didactic. Shortly thereafter, I was invited to help moderate r/prephysicianassistant, where I still help advise how to get into PA school. \n\nI mention that only to say that I'm not some basement dweller out for power like cliché Reddit mods. I'm one of you, and I want everyone to have a good time here, exchange information, and collaborate. While I haven't discussed this with the mod team, my hopes for this sub are: \n\n1) A wiki-style information page covering frequently asked questions (like how to pass the TMC/CSE/whatever the future exam is called). Along with that, posts that ask questions that can be found in the wiki would be directed to the wiki and deleted. \n\n2) Similarly, I want better visibility of the thread with pay info. Posts that ask about pay would be directed to the thread and deleted. \n\n3) The automod. There have been attempts to have the automod do some work. That's fine, but that hasn't always gone well. Posts/comments with any sort of curse word were summarily deleted, and right now any comment deemed a run-on sentence gets flagged and held. \n\n4) In general, I view my role as a moderator as just that, a *moderator*. I wish to moderate content. I'm a referee, deciding if someone is being too rude, or if a patient question crosses the line. That also means I want your input. Is there something you want to see in this sub? Is there something that isn't working? Then I want to hear from you. \n\nKeep in mind that none of my proposed changes are happening any time soon. Between work and life, writing/editing a wiki for this sub can take some time, plus I want feedback from the rest of the mod team. I only want to introduce myself and share with you my hopes for this sub. \n\nThanks! ",
    "score": 114,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1lxc93z/greetings_from_your_new_mod/",
    "created_at": "2025-07-11T17:01:21.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1p2jru0",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Welp, I finally had to do CPR in the wild",
    "text": "Five years as a RT and it finally happened. Wondered when this day would come.\n\nLeaving the grocery store and some guy is ODing on the goddam sidewalk - well actually half way in the bushes. I see someone doing really shitty compressions and overhear he’s had four doses of narcan!? Bystander on phone with 911. Dude looked dead. Friends saying “he’s gone”. \n\nNot so fast. We pull him out of the bush and onto the sidewalk. I tapped friend doing the shitty compressions out and started at it. His friend said he felt a pulse. I felt nothing so kept going. I’ve been in the NICU for a while and forgot how hard an adult chest is! Like holy sh*t. Didn’t help that I literally just came from the gym and my arms were shakey AF. Dude, got another dose of narcan and homey came back. \n\nMan, that sucked. His girlfriend’s big sad blue eyes are burned into my mind. She looked so scared and heartbroken. She seemed so young:( \n\nStanding there, watching the dude’s buddies getting him in chair and dumping water on his head making him mad (kinda comedic). I hear the one bystander ask the other “have you seen anything like this before”. “No”, she says. They’re both visibly shaken and, I’ll admit, so was I. It’s a whole different ballgame when you’re out in the wild and you have nobody else there who knows the things too. \n\nCop shows up and is talking to the bystanders, assessing the situation. I straight dip out. Like Irish Goodbyed it. It was like my RT mode activated. I did the things and like a phantom, straight ghosted the situation. \n\nHere’s the hindsight: He prob OD’d on fent. I didn’t ask. Just assumed. And now I’m asking myself did I put myself in danger? What if I inadvertently got it in my system. Like what are you supposed to do?! He looked dead when I got there. Like blue/purple and empty eyes, mouth agape. I have no idea how long he had been like that. \n\nUgh, I hope I never have to do that again. It’s just so frickin sad.\n\nWould love to hear your CPR in the wild stories too. ",
    "score": 114,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1p2jru0/welp_i_finally_had_to_do_cpr_in_the_wild/",
    "created_at": "2025-11-21T00:14:24.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1m5v1cg",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Where are we going with Respiratory?",
    "text": "I believe a major issue facing the respiratory therapy field today is a lack of direction from our leadership. Ten years ago, we had the AARC’s 2015 and Beyond goals, which laid out clear guidelines for advancing the profession. These goals included:\n\n-Establishing advanced credentials, such as the RRT as the standard and promoting the ACCS specialization.\n\n-Recommending the bachelor’s degree as the entry-level standard for new therapists.\n\n-Developing and implementing the Advanced Practice Respiratory Therapist (APRT) role.\n\n-Positioning RTs as clinical leaders rather than task-based staff.\n\nNow, a decade later, few of these goals have been realized. The APRT program is struggling to gain traction and remains stuck in political and institutional gridlock. The push for a BS degree as the entry-level standard has largely been abandoned. Advanced credentials like ACCS have not become widespread or incentivized.\n\nWe are experiencing a crisis of leadership and vision in our professional organizations. This is not a “future” problem — it is a current emergency. Any roadmap for the profession must begin by addressing our most urgent and immediate need: stabilizing the RT workforce and improving recruitment and retention.\n\nWe currently face several critical challenges:\n\n-Severe staffing shortages across hospitals and long-term care facilities. Many RTs are leaving for nursing, travel positions, or leaving healthcare entirely.\n\n-High burnout, increased turnover, and early career exits.\n\n-RT education programs are struggling to recruit students, and enrollment is declining.\n\n-Wage stagnation continues, despite increasing workloads.\n\n-RTs are being asked to do more with fewer resources, which puts patient safety at risk.\n\nTo begin addressing these issues, the top priority must be workforce stabilization. We need to focus on attracting and retaining new RTs while keeping experienced therapists in the field.\n\nIn the short term, we may need to accept that a step backward is necessary before we can move forward. Hospitals with unrealistic floor workloads may need to shift some routine tasks, such as MDIs or simple nebulizers, to nursing staff. RTs should be concentrated in areas where they provide the most clinical value, such as the ICU, ER, step-down units, tracheostomy care, chest physiotherapy, and airway management.\n\nSmaller community hospitals may face the greatest difficulty. Some may attempt to cut or eliminate RT staffing altogether, especially if they are financially strained. That would be a dangerous move, but unfortunately, it could become more common. In many of these facilities, RTs may soon be seen as a luxury rather than a necessity.\n\nWe may need to reach the bottom before the profession can rebuild. This crisis cannot be fixed overnight. However, once we stabilize the system, we can begin to rebuild the pipeline, refocus RT roles, and grow again — strategically and sustainably.\n\nLooking forward, we should consider shifting our clinical focus more permanently to areas of high value, such as ICU care, step-down management, airways, tracheostomies, and complex therapies. We may no longer have the staffing numbers to support traditional floor therapy workloads, and even travel RTs may not be able to close the gap in the future.\n\nRegarding the APRT, I may be in the minority, but I believe it is a flawed concept — not because of the role itself, but because of how it was executed. We are creating supply before there is demand. Hospitals are not asking for APRTs. Graduates are being produced with no clear hiring path and no established reimbursement structure.\n\nUntil we address the staffing crisis, pay disparities, and the profession’s visibility, the APRT feels like a misplaced effort. As it stands, we are attempting to build a second story on a house with a crumbling foundation. The average RT does not want or need a new degree right now. They want fair pay, better working conditions, and respect — and they need it now, not five years from now.\n\nA more realistic path forward could be:\n\n-Develop clinical ladders within the existing RRT framework.\n\n-Expand protocol-driven care in the ICU and step-down environments.\n\n-Prioritize compensation, retention, and recognition for bedside RTs.\n\t\n-Invest in leadership, education, and research pathways that already exist and can be expanded.\n\nMost importantly, we should explore RT-to-PA and RT-to-perfusion bridge programs. These pathways could offer more promising career advancement opportunities. RTs already have direct patient care experience and a strong foundation in cardiopulmonary physiology. Creating structured bridges to PA and perfusion programs could attract more students to RT programs and give current RTs realistic upward mobility.\n\nThere is no question that we are facing a crisis. The profession lacks leadership, direction, and a unified voice. Without decisive action, the situation will continue to deteriorate. But with honest assessment, strategic thinking, and collaboration, we can stabilize the workforce and build a more sustainable future — one that works for both patients and respiratory therapists alike.\n",
    "score": 111,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1m5v1cg/where_are_we_going_with_respiratory/",
    "created_at": "2025-07-21T21:06:26.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1nxqq7j",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "You guys ever meet one of the most incompetent RTs and wonder how they got their licenses?",
    "text": "Recalling an event that happened last month: It was my first and last time working with this RT during NOC shift at a post-acute facility (2 RTs per shift). I had previously heard from multiple nurses and other RTs that this individual had a reputation for being lazy, frequently disappearing from the facility for extended periods, and accumulating multiple prior write-ups. I witnessed his incompetence first hand during a Code Blue on that same shift.\n\nI was notified by an nurse that a trach patient (that was assigned to the other RT ) was coding. By the time I arrived, CPR had already been in progress for 10 minutes (facility doesn't have microphone announcements to announce code blues, otherwise I would've been there sooner). I saw the RT bagging the trach patient when I got there. I offered to help take over bagging/help with chest compressions and what does he do? He immediately leaves the room instead of staying to help, and goes back to the  RT department to go on his phone.\n\nThe most egregious part, however, was that I immediately noticed the reservoir bag on the BVM was not inflated. Upon inspection, I realized that the other RT didn't even turn on the flowmeter regulator on the oxygen H-tanks (my facility doesn't have flowmeters connected to the wall). In addition, the pilot balloon on the trach was completely DEFLATED, meaning the patient was not ventilated properly at all. In short, the patient was receiving (or the lack there of) ROOM AIR oxygen, NOR was the patient being ventilation properly for the first 10 minutes of CPR. EMT finally arrived and she was transported to the hospital.\n\nI have no idea how he has a license. The charge nurse and I reported the incident to the supervisor, and the last I heard, he was fired. Personally, I think he should lose his license for this level of negligence.\n\nFeel free to share your incompetent healthcare worker stories!",
    "score": 104,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1nxqq7j/you_guys_ever_meet_one_of_the_most_incompetent/",
    "created_at": "2025-10-04T10:45:51.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1jx2dbz",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Doctor did my job ..",
    "text": "Have you ever had a doctor start doing your job? I’ve been an RT for about 8 months. I was cpaping a baby with a mask, and MD asked if I wanted a break since I had been holding mask for awhile. Took a break to get my hand cramps out. I said I could take it back and she said it’s ok right now. I was embarrassed. The baby started doing better. I had a good seal and was delivering the set cpap amount beforehand, but it looked like I maybe was doing something wrong with that outcome(glad the baby was doing better though lol don’t get me wrong). when it comes to ego I’m embarrassed and discouraged has anything like this happened to anyone else? How do I let go of ego when things don’t always go the way they should? \n",
    "score": 96,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1jx2dbz/doctor_did_my_job/",
    "created_at": "2025-04-11T22:24:10.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1lwn4pj",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "A message to preceptors / those willing to teach 💜",
    "text": "As a student, I worked at a level 1 trauma / burn center as a rt tech / rt aide in addition to my clinicals. They truly encouraged learning, they let me tag along to any &amp; everything &amp; help even in little ways like running for supplies. \n\nThe people who let me simply just be around saved a couple lives today! I got to watch them do a serious burn ONE time, I learned about burn ties, airway burns, ventilating, and even how the skin can get so tight they may not be able to breathe &amp; need a faschiotomy. \n\nNow one year later I’m at a level 1 but we aren’t a burn center. We had a BAD complex fire this morning &amp; I went down to help respond with about 4 other people who were all new grads or about the same level of experience that I have. That ONE time I got to help / learn came right back into my head today and I got to give a crash course in real time about burn ties instead of tape / hollister &amp; ventilating smoke inhalation. It wasn’t pretty, it definitely wasn’t smooth, but me &amp; my coworkers were able to at least secure our tubes, not trust the pulse ox, get a COhb, and get the patients stable enough to transfer. \n\nI know taking students or even taking the ones working in the department through school can be a pain in the butt, but that one single thing you let them tag along for can really stick &amp; prepare them better for the real world. \n\nThank you to everyone who doesn’t mind having a shadow that’s “just happy to be here”. Thank you for taking the time to show people and to answer questions. You guys save lives of people you will never even touch. You make the world a better and safer place for anyone who finds theirself sick or hurt. You may never even know it, but you have a huge impact! Thank you thank you thank you ",
    "score": 90,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1lwn4pj/a_message_to_preceptors_those_willing_to_teach/",
    "created_at": "2025-07-10T20:22:01.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1jsim3z",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "I’m going to lose my mind.",
    "text": "I am about to graduate with my degree in rt. And the   Amount of people telling me to no settle for this job or this degree is eating at me slowly. They tell me to go to PA school and to continue my education but I truly have no interest in doing so. I can see why people leave the field and go else where but that just not me. I hear this topic of conversation almost everyday I’m at clinical and it destroying. I’m tired of hearing it.",
    "score": 83,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1jsim3z/im_going_to_lose_my_mind/",
    "created_at": "2025-04-06T01:10:29.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1lmmh28",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "RT got mad at me for helping him. Was I wrong?",
    "text": "\nI am an emergency room nurse. At the ER I worked at, all breathing treatments are done by RT no matter what. Straight to the point, I grab all the nebulizing medications that were ordered and materials to be ready at bedside since I figure the RT was busy. I let the RT know I got the supplies ready for him to give to the patient. The RT responded, \"Why would you do that?\" I told him I figured that he was busy and thought it would be nice to help him. He said, \"Yeah, that's not your job.\" So Im like, ok.... \n\nI have done this in the past for other RTs who have been nice and grateful for the assistance. My intent was to be a team player.  Maybe I should stop helping? Am I crossing boundaries or something? I don't know...\n\nThank you for the kind responses!  That whole situation made me salty, so I needed to let it out somewhere. ",
    "score": 82,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1lmmh28/rt_got_mad_at_me_for_helping_him_was_i_wrong/",
    "created_at": "2025-06-28T13:10:36.000Z",
    "num_comments": 106
  },
  {
    "id": "reddit-1nu0x30",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Fired for giving medication: oxygen",
    "text": "I was fired for increasing oxygen on a freshly transferred PICU patient that was steadily desaturating due to a critical GI bleed.  Oxygen is considered a medication.  I did not have a doctor’s order to increase oxygen.\nI have a new son and I now I have no career.\nIs this justifiable?",
    "score": 75,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1nu0x30/fired_for_giving_medication_oxygen/",
    "created_at": "2025-09-30T02:04:24.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1n16j1s",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Can’t stress enough that “interview really start during clinical”",
    "text": "I keep seeing comments and posts about how tough it is for new grad to secure a job after graduation in SoCal area. While part of this is due to the over saturation and high competition nature of the region but the other part comes down to how a student carry themselves during their clinical rotation. \n\nMay be it just me but from what I observe, the quality and behavior of students keep on going downhill over the years. I cant stress enough for students that their interview process really begin the moment they start their clinical phase at the hospital and it just disappointing to see how some of these students behave. Here are some direct examples that I observe in recent times with our students:\n\nCode Blue:\n-preceptor: “go in and practice CPR”\n-student: “sorry, because of ‘excuses’ I can’t do CPR”\n\nmy personal input: this is your opportunity to practice your skills and also demonstrate your ability to be a team player. This student literally just demonstrate that he/she is not eager to jump in and be a team player and is difficult to work with 🤯\n\n\nIsolation patients:\n-preceptor: “this is your patient, it is a simple Q4 treatments”\n-student: “sorry, my school doesn’t allow me to take care of isolation patients”\n\nmy personal input: 1st dock point is lying cuz I call the school to verify that after getting the feed back from the preceptor. The school said they gave no such restriction. 2nd dock point is isolation patients are part of the norm when working, if this student not willing to go near isolation then may be this isnt the career path for you 🤦‍♂️\n\n\nConfrontation and think you know everything\n-preceptor: “this is how so and so work and done”\n-student: “no you are wrong and this is how I got taught and my way is right” then go and trying to be smart and report to the Lead\n\nmy personal input: regardless if you are right or not, you are a student. You are here strictly to learn, not to argue and get into confrontation. If you want to cross check and debate your point, you can do that at school with your professor. Doing this at clinical simply just show me you are the type that like to challenge authority and don’t want to follow chain of command 😑\n\n\n",
    "score": 67,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1n16j1s/cant_stress_enough_that_interview_really_start/",
    "created_at": "2025-08-27T03:31:25.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1mk7hx8",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Mid-Career crisis.. why didn’t u get out sooner",
    "text": "Semi long post alert. I’m on my 12th year in respiratory and I feel as though I’ve wasted the last 7-8 years of my life in this field. I see everyone saying how flexible and rewarding it is but all I’ve seen is a downward spiral. I work in GA, I’ve worked both rural and city and what I can say is that year after year they have taken away things that we are responsible for and push us lower in hospital ranking. \n\nWhen I first started we were intubating all patients, putting in art lines, weaning our patients, and critically thinking, we had real autonomy. Now in a lot of facilities here you’re lucky to have a protocol to let you critically think to make changes, or you’re waiting on a dr to order it. No one even thinks to ask for your opinion. We hold medical license… just like doctors and it’s worth more than a nursing license. Yet the board that governs us, the AARC, does nothing to advocate for that license be used to its full potential. It’s just a group of our teachers managers and directors that (in my option) are colluding with other professions to bring us down to become nothing more than techs. They want our money but what are we getting in return? Nursing has APRNs doing things that we could do in our sleep, yet we still have nothing other than a RRT.\n\nACCS, NPS, RPFT.. all these credentials mean nothing because no one is paying you extra for it. Management, sales jobs, teaching roles, are all personality based and not off of merit. While you are waiting they have already picked out who they want in that position. Eventually I’m pretty sure nursing will have all of those jobs too because they have some now. I say all this hopefully to inspire the new grads to find “a real job” and don’t stop at respiratory because despite what they tell you it is a dead end job. And if you don’t believe me ask yourself this question. When the world was dying of a respiratory disease, where was the AARC or NBRC advocating for us to get more recognition? They were silent.\n\nCovid was a blessing for a lot of us because we were finally getting paid what we were worth but now on the other side you really see how little we mean to them. People in this group can say it’s not about the money but look at the climate we are in. You need a livable wage that’s not based on overtime and shift diffs. Base pay for RRTs are low and factor in to buying a home getting a car planning a family and retirement. Think financial longevity when picking a career.. not a career that will just have you working forever. I could say so much more but does it matter? We are therapist that are supposed to get paid for our time and mind and not just be NEB JOCKEYS. \n\nI’m breaking this cycle and going back to school… something I wish I would have done years ago if only I would have gotten the most accurate information. ",
    "score": 66,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1mk7hx8/midcareer_crisis_why_didnt_u_get_out_sooner/",
    "created_at": "2025-08-07T18:11:22.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1lvo7n9",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Are you happy with \"just\" being an RRT?",
    "text": "Anyone get tired of being asked \"So what do you want to do after RT?\" or \"Do you want to apply to graduate school?\" etc. Are people happy to work as an RT until retirement? I love what I do now and the amount I get paid for the amount of responsibilities I have is hard to beat. \n\nI am constantly hearing things about not being \"just\" an RT until retirement. I won't lie, I have dabble in the thoughts of PA, Perfusion, or CAA. But then get turned off by it from the thoughts of more schooling, more debt, more responsibilities, and a pause on life. Work life balance is great at the moment and what I make allows me to enjoy my days away from work. \n\nI guess I was just curious what other thoughts were or if they are in a similar situation where people are constantly talking about being more than \"just\" an RT.",
    "score": 64,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1lvo7n9/are_you_happy_with_just_being_an_rrt/",
    "created_at": "2025-07-09T17:06:19.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1hyrxkw",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Wanted to share my pay as a new grad RT in Southern California in 2025 as I’m very happy with the pay for my first two jobs and hope to motivate some of you guys stick in your thought program that this job can pay well!",
    "text": "I graduated from my RT program a couple of months ago and got hired at two different hospitals both per diem. I wanted to share what the starting pay as a new grad is since I know when I was in school I was always so worried about not making enough as I wanted to make after going through such a hard program. However I have to say I am very happy with my pay as a brand new RT and hope I can motivate those still going through all those unpaid clinical shifts and hard tests. I know it is very region dependent and as I live in socal near LA I’m sure the wages are def on the higher end. One of my hospital jobs pays 47$/hr base pay with a 1$ differential for nights and weekends, so if you worked a Saturday night you would get 49$/hr and the last 4 hours of a 12 hour shit is automatic overtime putting those hours around the 70$/hr range so on average a 12 hour shift pays about 55$/hr. My second job has a base pay of 44$/hr and a 3$ night differential, no weekend differential and no OT unless you work over 36 hours. I’m pretty happy with my pay as a new grad hope this is helpful to some of y’all hope if didn’t come of as bragging lol just wanted to share this info as I know how much you might possibly make can be ambiguous. ",
    "score": 62,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1hyrxkw/wanted_to_share_my_pay_as_a_new_grad_rt_in/",
    "created_at": "2025-01-11T08:55:06.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1jzfny5",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "what are the worst times you've embarrassed yourself at work?",
    "text": "I just had such an embarrassing interaction with a doc, I need to hear yall's stories about the worst times you've put your foot in your mouth with a PT or coworker.\n\nI go down to ED to get report. Day RT is one of the best therapists in our department, so I always trust his judgement. He tells me he just started an unnecessary BiPAP at a resident's insistence. Pt comes in fluid overloaded, normal HR, 100% SpO2 on RA, slightly hypertensive and slightly tachypneic. Blood gas completely, textbook normal. Pt pulling Vt of 1600 on 10/5. Resident won't budge, she wants it on for at least an hour. Ok fine, whatever. I go see him after making my equipment rounds, he's fine. Still pulling insane volumes. I have to widen the alarms even further so the V60 stops chirping. Not even 40 min after report, I get a call. \n\n\"Hey it's Sydney (fake name), I just took room 25 off BiPAP, you can come get the machine.\"\n\n\"oh ok, I'll be right there. I don't even know why it was started, it was completely unnecessary.\"\n\n\"hmm.. OK.\" -click-\n\nthat's odd, I thought. I'm pretty tight with Sydney the charge nurse, maybe I've done something to annoy her recently. well, a bit later I end up having to start a HFNC in room 26, which is coincidentally right outside the residents station. I overhear another nurse walk up to the station and say, \"hey Sydney, room 23 is asking if they can eat, is that okay\" \"yeah that's fine\"\n\nin a panic, I check EPIC for who was putting the orders in for the BiPAP in room 25. Of course, it was a resident named Sydney.\n\nI facepalmed so fucking hard lmfao. Turns out Sydney the charge RN isn't working tonight lol\n\nTLDR: got a call from someone to pull a BiPAP. I tell her sure, the BiPAP was unnecessary and I don't know why it was started in the first place. turns out I was talking to the doc who insisted we start it.\n\nanyway let's hear yall's stories.",
    "score": 58,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1jzfny5/what_are_the_worst_times_youve_embarrassed/",
    "created_at": "2025-04-15T01:25:32.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1j6od3s",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Have any of you noticed patient's commenting on Duoneb lately?",
    "text": "I have been an RT for over a decade. In the past I would have a few patients a year, maybe, who had never had a neb before (yay nebs for CHF wheezes) and they would comment on the taste. The patients were very few and far between.\n\nThe last 6 months or so I have had at least a couple people a week mention the terrible taste. I had a COPDer mention it as well. The person had been on duoneb for years and years. They stated they had notice a taste change in the last few months and I told her how I had experienced people saying that the taste was terrible more often. The patient was glad to hear it because they thought they were going crazy. \n\nAnother coworker who has done RT longer than me mentioned it too. \n\nAnyone else seeing this? I wonder what would have changed. \n",
    "score": 51,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1j6od3s/have_any_of_you_noticed_patients_commenting_on/",
    "created_at": "2025-03-08T19:07:17.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1p9o07s",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Should I feel guilty for leaving the profession?",
    "text": "I graduated from my respiratory program in April 2024, and I’ve been working as an RRT at a Level 1 trauma center for exactly a year and half.  During my program, I realized I wanted to pursue physician assistant school.  I applied this cycle, and was fortunate enough to gain an acceptance on my first try. I start my program in January and as excited as I am, I have to admit I feel a little guilty about leaving after a year and a half.  \n\nThis was my only job as an RRT, my experience has been incredible, I became cross trained in the ED, PICU/NICU, and CVICU, and despite the pay and constant staffing shortages, I actually like my coworkers and the facility.  I think clinicals opened my eyes and made me realize respiratory therapists don’t have as much mobility as nursing and I wasn’t sure if I could see myself doing the same thing for the rest of my career.  I also live in a very HCOL area and realized most of my peers have to work 60 hours a week to support themselves. My starting salary as a new grad was $25/hr and they recently bumped us up to $29/hr. My thought is I’d rather go back to school for 2 years if it means improved career satisfaction and quality of life.\n\nI’ve built good relationships with my coworkers and some lament that they always lose good therapists after a short period of time, and I think that attributes to some of my guilt.  ",
    "score": 30,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1p9o07s/should_i_feel_guilty_for_leaving_the_profession/",
    "created_at": "2025-11-29T12:40:25.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1hpqy57",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Is becoming an RT worth it?",
    "text": "\n*Edit* Thank you all for your advice! Please keep it coming! I would like to say that nursing isn’t a career I see myself doing. Major respect but the RN track is not for me. I’m also considering radiology/sonography but would like to go more bedside. Thanks all!\n\nI’m a 19 y/o sophomore on track to earn my bachelor’s in respiratory therapy. I’ve completed most of the prereqs but still have enough wiggle room to change my major if I really want to. Originally, I picked respiratory therapy because I enjoy clinical jobs. I’m a part-time phlebotomist and really like the atmosphere.\n\nMy original plan was to work as an RT for a few years after graduating and then apply to PA school. But now I’m having second thoughts. PA school would mean a lot of extra time and money on my part, and honestly, I’m so ready to graduate that I’m not sure I want to go back for grad school. I’d also have to take a ton of really hard classes, like organic chemistry and biochemistry, on top of my RT curriculum just to meet the PA school prerequisites.\n\nMy question for existing RTs out there is: Are you content with your job, and do you think I should still pursue higher education like PA school? I’ve heard so many conflicting opinions, I’m not sure what to believe. Some people say getting a bachelor’s is a waste of time because they do the same job as RTs with associate degrees. Others say it’s worth it because a bachelor’s is the only way to move into managerial positions.\n\nI shadowed an RT supervisor at a well-known hospital, and he genuinely seemed to love his job. Based on my experience that day, it seemed like something I’d really enjoy.\n\nI’ve also heard a lot of conflicting things about pay. I’m a Type One diabetic, so having a decent salary and great insurance is essential to me. I’ve seen RT salaries ranging from $20–$70 an hour. Making a ton of money isn’t my top priority—I don’t envision myself with kids or a big house—but I’d like to be comfortable.\n\nThanks to anyone who stuck with me through my rambling, I appreciate your insight!",
    "score": 30,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1hpqy57/is_becoming_an_rt_worth_it/",
    "created_at": "2024-12-30T16:26:38.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1ipobu2",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "What is y'all salary??",
    "text": "If ever Canada does becomes the 51st state, how much would I get? \nThere are no difference between RT and RRT when I live (in quebec) there is only one \"level\" of education. I know it is unlikely to happen but I am curious what is the average salary in the US\n\nMe : 6+ years experience, 36$/hour (CAD) (Around 80 000$/year) in Quebec ",
    "score": 22,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1ipobu2/what_is_yall_salary/",
    "created_at": "2025-02-14T23:38:36.000Z",
    "num_comments": 107
  },
  {
    "id": "reddit-1lcbquy",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "How’s the pay/market in NYC?",
    "text": "Is it hard/competitive to find a day shift gig? Also what’s the going rate in NYC? Is 1 RRT salary enough to live comfortably (1 bd/1 bath or studio/1 bath) in the city? ",
    "score": 18,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1lcbquy/hows_the_paymarket_in_nyc/",
    "created_at": "2025-06-15T21:36:09.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1p2l5s3",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "New York RRT Job market",
    "text": "What’s the New York city borough’s ( manhattan, Brooklyn, queens, Staten Island,  Bronx) RRT job market like? Is it as saturated as the nursing job market? The pay is decent from salary surveys I have seen but I don’t know if it makes sense moving to a high cost of living state if the job market for the profession isn’t great. ",
    "score": 15,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1p2l5s3/new_york_rrt_job_market/",
    "created_at": "2025-11-21T01:15:11.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1l77iux",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Respiratory therapist and cost of living and wages in Nashville ???",
    "text": "I currently live in the Bay Area where the coast of living and rent is high. I’m a respiratory therapist making about 100k right now. Thinking about moving to Nashville but what is the realistic and average salary $ per hour over there ? ",
    "score": 14,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1l77iux/respiratory_therapist_and_cost_of_living_and/",
    "created_at": "2025-06-09T15:19:12.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1n6zmfz",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Anesthesia Assistant vs Perfusionist",
    "text": "Has anyone went for anesthesia assistant or for perfusionist? If so can anyone tell me their reasoning and what are the pros and cons please. Like what kind of hours and salary thank you!",
    "score": 13,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1n6zmfz/anesthesia_assistant_vs_perfusionist/",
    "created_at": "2025-09-02T23:51:29.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1kry8f1",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Should I pursue an associate's degree in RT after my bio degree?",
    "text": "Right now I am a second year college student working towards completion of my B.S. in biology. My parents wanted me to become a doctor, but as I battle through my prerequisite classes, I find myself dreading more debt, 6 more years of school, and even higher levels of stress IF I even make the med school cut.  \n\n\nWhile I am pretty conflicted about what I want to do after graduating, I know I don't want to spend another 4 straight years in med school and 4+ more in residency. I also do not want to be stuck working in a lab for $20 an hour as a lab tech.\n\nI find myself more and more looking into 2 year graduate programs that are in the medical field that won't cost another $50-100k. So far RT is at the top of the list, with PA lagging slightly behind (Due to costs and admission being unpredictable).\n\nStrictly in terms of passion, my brother with CF is who got me interested in the world of medicine. Treating other kids like him was one of my primary motivators for going into healthcare. Cost-wise, it seems most degrees cost 10-25k, and the median salary starts at \\~60k and levels out to 80k (at least in WA state where I want to live). Which would give me enough wiggle room to pay off my debt while living frugally. \n\nHave any RTs on this subreddit pursued their associates after completing an unrelated bachelor's degree? What can I expect when I apply to RT programs (specifically if anyone has applied to school in the WA state area)? Are there any good resources I can read as I research this career pathway? \n\n",
    "score": 11,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1kry8f1/should_i_pursue_an_associates_degree_in_rt_after/",
    "created_at": "2025-05-21T13:46:18.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1jed13l",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "RRT in Canada (Ontario specific)",
    "text": "hi guys! i just got accepted into an rt program in ontario for september 2025 :) i always see so many people on this thread talking about healthcare and rt in America, but I wanted to know if there’s any Canadian (Ontario?? 👀) RT’s here who want to share anything! It can be school related, job, career, reccomendations, salaries, tips, tricks, whatever! \n\nI just wanna hear some input by people living in my province or at least in my country lol ",
    "score": 11,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1jed13l/rrt_in_canada_ontario_specific/",
    "created_at": "2025-03-18T19:08:29.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1jd34ir",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Respiratory Therapist Salary",
    "text": "So I’ll be done with my pre requisites this May to be able to apply to the RT program. I’m in good standing, but I do have a backup plan if I don’t get accepted. \n\nI come from a traditional family where people have to give their input on everything. I’m 21, so i’m still a kid to them. Long story short, I’m being told to go RN route because they make more and more opportunities. I don’t like change much, so I don’t mind being in RT plus if I do want to go further then I’m thinking of Perfusionist school anyway. I truly want to go RT route, but if I don’t accepted I’ll go the RN route. \n\nI keep getting told RT’s barely make anything at all, for reference, I live in Northern Virginia. I don’t really understand per diem either and apparently people have 1-2 per diem’s to make more money. How is your schedule if you have your main job + per diem jobs as well? I have tried to research about pay, but I see different salaries in Virginia. Would learning other specialties help make more? For example, learning ECMO? Sorry if they’re dumb questions, but please don’t be mean lol. \n\nHow much do you make a year? If you remember how much you made starting, please let me know! (please say your state too)",
    "score": 10,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1jd34ir/respiratory_therapist_salary/",
    "created_at": "2025-03-17T03:04:45.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1ifkwey",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Can I Teach Middle School on Weekdays and Work as an RT on Weekends?",
    "text": "I'm considering a dual-career path and wanted to get some advice. My plan is to work full-time as a middle school science teacher during the weekdays while picking up weekend shifts (12 hours each on Saturday and Sunday) as a Registered Respiratory Therapist (RRT).\n\nWhy I’m Considering This:\n\nFinancially, it makes sense:\n\nTeacher salary in my area (Louisiana): ~$50K/year\n\nRT weekend shifts: $35/hour × 12 hours × 2 days × 52 weeks = $43,680/year\n\nTotal: ~$93,680/year\n\nI enjoy both teaching and healthcare and want to keep my options open. This might even be helpful if I want to do RT in academia.\n\nDo you think this is realistically sustainable?\n\nHas anyone here worked two professional jobs like this? How did it work out?\n\nWould I be better off just working full-time as an RT with extra shifts, or does having two jobs in different fields have long-term benefits?\n\nAny advice on managing burnout, time management, or making this setup work efficiently?\n\nI’d love to hear any insights from teachers, respiratory therapists, or anyone juggling multiple careers! Thanks in advance.",
    "score": 8,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1ifkwey/can_i_teach_middle_school_on_weekdays_and_work_as/",
    "created_at": "2025-02-02T00:36:19.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1kqhkpb",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "DME RT to DME manager",
    "text": "Hi everyone - young RT here needing some help!\n\nTDLR: What would be a reasonable wage increase from going from the only DME RT to being the DME manager, while continuing my duties as the RT? 4 years as an RRT, 7 months at the DME - no previous DME experience. \n\n\n\nI'm needing some advice here from some of my dme/home medical RTs. I am an RRT and I have been the \"lead respiratory therapist\" but really I'm the only RT. I have probably 1500-2000 patients and we get around 10-20 new patients every month. I get all documents myself such as medical records and DWOs, do all intake and resupply, do all appointments for set up and mask fititngs, as well as working first hand with insurance and some billing. \n\nMy manager is leaving at the end of June. We are a small, local DME located in a pharmacy. My manager originally started the DME department 16 years ago. We are handing off CGMs to the pharmacy. My coworker will learn to be the main diabetic shoe fitter, but she also handles the retail floor and all ordering for compression, urological, ostomy, mobility, etc. I have one person in billing and we just hired someone who is handling our documents - sorting through incoming faxes and uploading them. I'm thinking I will eventually teach her how to screen documents. Not actually reviewing them, but more so checking off; do I have an order? Do I have a sleep study? Etc. I will probably eventually teach her to help pull my supply orders - but I will more than likely have to review the order, check the order and insurance, then hand off for her to fill. \n\nI am going to become the new manager. I will continue being the lead RT with potentially hiring a PRN RT for busier seasons. I will have to learn to accredit, reviewing product and cost, the DME schedule, policies and procedures, etc. I will also be the back up shoe fitter, I test for CFts in June. I will also be tasked with training our newer hire and restructuring the department to deal with being down a person - and a pretty important one haha.\n\nI am 25 and have been at the DME for 7 months. Previously I worked inpatient at a hospital. I have been an RT since summer of 2021 so it's been just about 4 years. The cost of living is bit lower than other places - I live in the midwest. I currently make about 65k a year with an hourly rate. I will now be salaried. It's all very new, it was just brought to me Friday. We have not negotiated a salary yet. Is 85k reasonable? I will essentially have the same responsibilities as I do now plus manager duties.  It can already be a lot to be the only RT during busier supply cycles. I don't want to lowball myself but I also don't want to be greedy.\n\nThanks so much in advance!! I have never had an offer like this and it's definitely a right place at the right time situation. I am a quick learner and usually work pretty efficiently but it sounds like it's going to be a lot for someone like me with less DME experience. ",
    "score": 7,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1kqhkpb/dme_rt_to_dme_manager/",
    "created_at": "2025-05-19T17:26:39.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1oopjvg",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Negotiating Hourly Pay Advice",
    "text": "I am being offered a position at the competing hospital in my city. The initial offer is slightly **less** than my current base pay + the night shift/weekend shift differential is also **less**. I would be losing about $1 hr each night, and $3 hour on weekends. I want to negotiate a higher salary, but am unsure if I should aim for a dollar amount more (ex. $4), or a percent increase more (ex. 10-20%). \n\n  \nI'm worried that if I aim too high initially, they will retract the offer completely, but also that I would be low-balling myself, if I don't ask for enough. For reference, I know that a current employee with 3 years less experience than myself is making at least $1 more.",
    "score": 7,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1oopjvg/negotiating_hourly_pay_advice/",
    "created_at": "2025-11-05T01:21:04.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1nkkqxk",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "NC-RRT to Cath Lab pay?",
    "text": "I am an RRT with 9 years experience and considering a change to the cath lab. Anyone offer some insight on what the pay is like? The recruiter asked me if I had a salary in mind but I honestly don’t know the scale for this and don’t want to get jipped. I have heard going to cath lab is a pay increase for RRT. ",
    "score": 7,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1nkkqxk/ncrrt_to_cath_lab_pay/",
    "created_at": "2025-09-18T21:20:30.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1itre0n",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Anesthesiologist Assistants in Canada???",
    "text": "Hello to everyone who reads this.  Thank you in advance fir your time.  Im new to reddit so forgive me. \n\n I came here to ask about peoples experiences being a Anesthesiologist Assistants in canada. I recently changed my life plan from dreaming of being a physician to having no idea what to do.  I did alot of research and decided that I would get my rn license as it opens up alot of doors. \n\n I recently applied and was accepted into some to accelerated nursing programs so I will be starting in the fall.  After my degree, one of my main end goals is to become a AA.  But honestly i haven't heard alot about this position especially from a canadian perspective. So I have some questions.\n\n1.  I know there aren\"t many programs in canada but they generally require a nursing or RT license with 2 years of experience in critical care.  What is the best critical care specialty that helped you prepare to become a AA? I was thinking of nicu because it really appeals to me, however, would this be a good option as critical care experince for aa school?\n\n2.  Because of fhe competeifion what did you do to stand out on your application?\n\n3  what is your schedule like? Do you work alot or are there other AAs alongside you? How many shifts do you work in a week? How long are they? What are call schedules like?\n\n4.  I know this is personal but what is your salary like?  What are the differencials like OT, on call, day/night pay like?\n\n5.   Please describe what a general day for you is like.  \n\n6. Is there such a thing as travel AAs? If you have travelled what was your experience like?  One of my dreams is to travel around canada lol.  \n\nAgain thank you so much for reading this super long post but i sincerely appreciate it regardless of the response! Thankssss :)",
    "score": 7,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1itre0n/anesthesiologist_assistants_in_canada/",
    "created_at": "2025-02-20T05:45:24.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1lcwuz4",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Help deciding RT vs RN",
    "text": "I’m about to finish pre reqs and deciding between nursing and respiratory therapy now. I used to be an EMT and a CNA, and decided if I go nursing I’ll want to go straight to the ED (cna taught me I couldn’t stand neuro/med surg and the like). While nursing has a better salary and more upward progression, even as an ED nurse I’m worried about burn out since I kinda burned out of ambulance work around COVID. The job of an RT seems way more sustainable, not being bound to a single floor with your boss watching over you 24/7, not doing personal care type nursing tasks, not getting stuck with the same patients for months while still having a nursing type schedule and job security. Obviously the RT salary is much lower, my plan would be to be an RT for a few years and then possibly pursue perfusionist school.\n\nAny advice from yall? Both programs I’d be getting an associates in (currently have a BS in kinesiology but don’t want to be a PT)",
    "score": 7,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1lcwuz4/help_deciding_rt_vs_rn/",
    "created_at": "2025-06-16T16:07:53.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1k5zbg2",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "30 y/o in NY — Considering RT vs RN, Would Love Your Input",
    "text": "Hey everyone,\n\nI’m 30 years old and currently living in New York. I’ve been seriously considering going into healthcare and I’m trying to decide between becoming a Respiratory Therapist (RT) or a Registered Nurse (RN). I still have a bit of time—about a year and a half—before I need to make a final decision, and I want to make the most informed choice possible.\n\nFor those of you currently working as RTs, what would you say are the biggest pros and cons of the job? Also, if you’re comfortable sharing, what’s your salary and how many years of experience do you have?\n\nAny insights about job satisfaction, work-life balance, growth opportunities, or the day-to-day reality would be super appreciated. Thanks in advance!",
    "score": 6,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1k5zbg2/30_yo_in_ny_considering_rt_vs_rn_would_love_your/",
    "created_at": "2025-04-23T13:34:55.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1pqqhnj",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Advice for getting into RT school",
    "text": "Hello, I’m currently in the process of a career change. A couple of months ago, I was told to drop out from optometry school due to my academics. So I’m currently trying to build my life together and about to start working as an optician. Although my family and I are hoping that optician shouldn’t be my forever career, so I’m looking into Respiratory Therapy. Before I went into optometry school this fall, respiratory therapy was one of my backup career choices. \n\nI’m looking for schools in my home state California. Which schools should I apply to if I already have the prereqs? What is the annual salary in California? Also would you say it’s a good long term career?\n\nThank you!",
    "score": 6,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1pqqhnj/advice_for_getting_into_rt_school/",
    "created_at": "2025-12-19T17:08:58.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1n2hd3f",
    "subreddit": "respiratorytherapy",
    "soc_codes": [
      "29-1126"
    ],
    "title": "Career Switch: Research Coordinator to RT",
    "text": "Hi all, I’m currently considering a career switch and would like some more info on work life balance, average income/salary, and overall satisfaction. Seeking advice from those who made a career switch! What drove you to do so etc.\n\nBackground: 28(f) living in Chicago. I was an EMT/ER Tech during the pandemic. Had to leave that field because I got COVID prior to the release of the vaccine and it took me out for months health wise. I didn’t get too much face to face interaction with RTs during that time because of how much a blur each day was. Too young and naive to know what I wanted to do. \n\nI landed in clinical research. Been doing it for some time. I’ve done academic and private research and still use some of my clinical skills to this day. Currently, I’m 9-5 every day in person making $90k. \n\nI’m honestly beginning to hate it. Research as a whole is a tough market. Maybe it’s just my current position at my company. I miss working in the hospitals even when I did research there. I want to feel like I am doing something for people. I want to help people actively. But ultimately I know I have a good salary and benefits. \n\nTrying to gain perspective on career outlook for RTs. Do I climb the corporate ladder or take up a new field? At the end of the day, I need to survive and I have done pretty well for myself. I know it’s not all about money but in this economy it’s tough. \n\nSorry for long message. Just looking for some advice or tips and tricks. Thanks in advance! ",
    "score": 6,
    "url": "https://reddit.com/r/respiratorytherapy/comments/1n2hd3f/career_switch_research_coordinator_to_rt/",
    "created_at": "2025-08-28T16:42:57.000Z",
    "num_comments": 1
  }
]