[
  {
    "id": "reddit-1n7oou4",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Got ghosted for 97 days. Closed $1.3M with a handwritten note",
    "text": "I don’t have anyone IRL I can tell this to without sounding like a clown so… hello internet.\n\nEnterprise SaaS. 7-figure quota. Deal was sitting at legal. Champion leaves. New CFO “re-evaluating vendors.” You know the drill. Then: silence. For. Ninety. Seven. Days.\n\nI did the usual: polite bumps, new thread, forwarded thread, “bumping this to top of inbox,” value adds, case studies, the whole parade. Nothing. Pipeline rotting. Manager asking “any updates?” god I hate that but it works.\n\nDay 98 I snapped (in a calm way). I got a ping on nationgraph that their board was meeting that friday. Clock was ticking. I printed a one-page note on actual paper, signed it with a blue pen like a psychopath, and FedEx’d it to the CFO’s attention. The note said:\n\n“If you’ve moved on, totally fair—please tell me so I can move on too. If not, here are the 3 things blocking value on your side (from your team’s words, not mine):\n\n1. SSO risk sign-off\n2. 90-day opt-out language\n3. Training for the field team before Q4 \n4. Give me a 10-minute ‘no-slides’ call this week and I’ll walk you through how we de-risk all three without changing price. If I can’t, I’ll write the breakup email for you.”\n\nNo deck. No link. I put my cell at the top in huge font like a Craigslist ad.\n\nHis EA called the next morning: “He can do 12:10–12:20 today. Don’t be late.”\n\nWe did it in 7 minutes. He said, “If you include the opt-out and own the training schedule in the MSA, I’ll sign.”  \nFriday 4:36pm: DocuSign ping. $1.3M TCV, $280k year one. Commission pre-tax: $104,000. I sat there staring at my screen like it was a wild animal that wandered into my apartment.\n\nWhat worked (in my very unscientific opinion):  \n– Physical pattern interrupt. Email = background noise. Paper on a desk = “who is this maniac?”  \n– Specific friction list in *their* language. Not “value,” not “synergy.” The three actual bricks in the road.  \n– Risk reversal. I offered to write the breakup email. Takes the pressure off saying “no,” which ironically makes “yes” easier.  \n– Ruthless brevity. Ten minutes. Humans can tolerate ten minutes.\n\nI’m not a wizard. I lost two other deals this quarter that still make my stomach flip. But this one… this one reminded me why we play the game.\n\nIf you’re stuck in ghostland, try getting weird (professionally). Paper. Loom to an EA. A 90-second voicemail to the CFO’s assistant with a single, specific ask. Something that doesn’t look like every other email in the pile.\n\nShoutout to you if you cared enough to read this far. AMA I guess",
    "score": 4227,
    "url": "https://reddit.com/r/sales/comments/1n7oou4/got_ghosted_for_97_days_closed_13m_with_a/",
    "created_at": "2025-09-03T19:38:46.000Z",
    "num_comments": 383
  },
  {
    "id": "reddit-1k5iczf",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Just lost millions in sales due to tariffs",
    "text": "Fucking kill me \n\nThose who messaged me\n\nI work for a manufacture and spent 5 \nFucking months flipping residential new construction builders to our product so many hours conversations getting contractor buy in supplier buy in. \n\nFucking wasted and now I'm way down in my numbers focusing on this specific path and instead of securing my year now I have to scramble to pivot. \n\nFinal edit: I am not a retard therefore I did not vote for trump. You're in the sales sub. If you can't tell what a shitty lying con artist is why are you even in sales? ",
    "score": 2522,
    "url": "https://reddit.com/r/sales/comments/1k5iczf/just_lost_millions_in_sales_due_to_tariffs/",
    "created_at": "2025-04-22T21:38:45.000Z",
    "num_comments": 409
  },
  {
    "id": "reddit-1hpwk0i",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "I'm about to get a $300k Commission check and I can't tell anyone (So I'm telling the Internet) - AMA ",
    "text": "After nearly 20 years in sales, I'm going to have my best earning year yet, finishing at least at 170% of quota, with a final deal outstanding that could push me to 180%+. While it's not my highest percentage to quota to date, my current OTE is the highest it's ever been. This is my 7th year with my current company.\n\nAt my present attainment I'll be receiving a bonus check of $260k in Q1. If this last deal closes, I'll be getting just north of $300k. (previous high single commission check is \\~$170k.)\n\nRole Details:\n\n* Enterprise Software\n* Quota= \\~5M\n* OTE is just under 400k\n* W2 history for this role:\n   * 2024 = $475k\n   * 2023 = $400k\n   * 2022 = $470k\n   * 2021 = $515k\n   * 2020 = $300k\n   * 2019 = $280k\n   * 2018 = $200k\n\n2025 will be more than likely be my best earnings year by far with the \\~250k-$300k paycheck incoming.\n\nWhy am I posting this? Because I'm fucking stoked and I want to tell someone about it, and I can't really yell this from the rooftops IRL. So I guess I'll have to brag on the internet.\n\nI'm happy to answer any questions you might have about my experience, the sales process, or anything else related to my career. I'm currently in a holding pattern until the end of the year, awaiting final signature on that last deal.\n\nSales is a great career if you can find your spot. Keep learning and don't settle for a shitty role/manager.\n\nKeep pushing and I with everyone sales success in the new year.\n\n**Update:** My company is a MAMAA company and we sell a software that every company uses and buys for each of their employees. I sell to the Enterprise segment.\n\nI also just checked our career website and we are not hiring for most regions, there are some international roles available but nothing in the US. For privacy purposes I won't get more specific than that but I'll try to answer other questions that people have.",
    "score": 1686,
    "url": "https://reddit.com/r/sales/comments/1hpwk0i/im_about_to_get_a_300k_commission_check_and_i/",
    "created_at": "2024-12-30T20:25:21.000Z",
    "num_comments": 597
  },
  {
    "id": "reddit-1ksvt6w",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Friendly reminder to dress to match who you are meeting. Not to “impress”",
    "text": "Just sent a rep home to change, a few weeks in the job and we have his first meetings this afternoon. He showed up this morning with Prada shoes, fancy suit, Gucci belt, Rolex dressed to the nines. “Dressed to impress” he stated. I told him he was going to look like an asshole because we are meeting with Midwest small farmers this afternoon, who likely have been up since 4am and will be likely in the same attire they started they day in, will be tired, and really doing us a favor by taking more time to meet with us. I told him we will likely be touring their setup walking through mud from the constant rain we had and shit in barns.\n\nYou can’t win a client by dressing to impressing, you win them by showing up and showing you’re down to earth and care about all the ins and outs of their business. For reference I wore nice-ish jeans, cowboy boots, and a dark polo. Also the kid wanted to take his Mercedes convertible and I told him no, we are taking my Ram 1500. \n\nHe also already had a plan of what to sell them, told him he needs to let the customer talk and we need to cater to his needs. Not ours. We have an idea of what they need from initial convos, and doesn’t matter we have a product paying us 2x on commission. Commission on a sale for a smaller product that fits is better than no sale on a product that pays us 2x. \n\nJust had to vent and share because I think this guy bullshitted his LinkedIn to the max and lied about his qualifications. Not sure why upper management insisted on hiring him. I got the impression right away from our first call he was not as good as he said. ",
    "score": 1392,
    "url": "https://reddit.com/r/sales/comments/1ksvt6w/friendly_reminder_to_dress_to_match_who_you_are/",
    "created_at": "2025-05-22T16:57:30.000Z",
    "num_comments": 196
  },
  {
    "id": "reddit-1mcpill",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "My BDR died yesterday",
    "text": "My BDR died yesterday in a random, tragic accident. It shouldn’t have happened. He moved to my company a year ago to take a step back into a BDR role after being an AM at another tech company. He wanted to be an AE, and he eventually would have made it. He had a big family that he was close with, he was about to move across the country with his girlfriend that he was going to marry, he had a lot of good friends and everyone in the company really liked him. \n\nRemembering that work and sales isn’t everything. Thinking about my loved ones a lot today, and how short life is. I love you, Charlie! ",
    "score": 1314,
    "url": "https://reddit.com/r/sales/comments/1mcpill/my_bdr_died_yesterday/",
    "created_at": "2025-07-29T22:24:43.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1pe3ti7",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Just closed my first million dollar deal",
    "text": "Posting this here because none of my friends work in sales, and I need to tell someone.\n\nI'm in my 20s and sell into financial services. I just got a signed contract sitting pretty at slightly over $1.6m. Total size of the account is likely to grow into $2-3m over the next few years.\n\nI went through hell to get here. From the SDR grind, constant dissapointment, missing targets, watching my peers succeed and do better than me while I felt worthless (with evidence and numbers to show how worthless I was). The only reason I haven't been fired was because I kept improving, slowly but steadily.\n\nThis deal itself took around 10 months, countless demos, several iterations of proposals, people joining and leaving the client's business, everything that could go wrong going wrong.\n\nNever. Give. Up.\n\nTonight to celebrate, I'll be watching \"Eyes Wide Shut\" on my laptop.\n\nHappy selling everyone!",
    "score": 1203,
    "url": "https://reddit.com/r/sales/comments/1pe3ti7/just_closed_my_first_million_dollar_deal/",
    "created_at": "2025-12-04T16:05:06.000Z",
    "num_comments": 242
  },
  {
    "id": "reddit-1km2wwm",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "My VP is Sleeping with my sales rep...advice?",
    "text": "We hired a new junior hybrid AE + lead gen rep (25F) from college 5 months ago\n\nSince then she's generated 0 qualified meetings or sales. \n\nIn the last 1 month she set up a meetung with me and a 'junior shopkeeper' of a retail account. Our target personas are supposed to be CFOs....\n\nShe has no exp and clearly isn't committed to learning as she ignores advice given to her by me and enablement manager. At times she will walk out of the room during call reviews and say I am \"being too much\".\n\nI've wanted her out of the org so we can get a more experienced rep. But my VP (45M) always defends her saying \"the economy is tough and we need to create a culture of cultivating. Not hire and fire\".\n\nThe other night, I saw my VP and new junior rep at a hotel bar. She had her legs cross his and the VP had his hands on her knees.\n\nIt lines up with rumours I heard about the VP buying tickets to an industry conference in Dubai where only him and the junior rep went to \"do some prospecting\".\n\nIs this a battle worth fighting or should i start looking for new jobs?",
    "score": 1193,
    "url": "https://reddit.com/r/sales/comments/1km2wwm/my_vp_is_sleeping_with_my_sales_repadvice/",
    "created_at": "2025-05-14T01:15:56.000Z",
    "num_comments": 404
  },
  {
    "id": "reddit-1n7seem",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Well. I fucking did it.",
    "text": "Took a job as a door to door rep about 6 months ago because I couldn’t get any interest in my resume for B2B SaaS. \n\nPlenty of people on here saying “you’re going to hate d2d, blah blah blah, you’ll be back in 3 months begging to get out of it”.  It was actually a pretty good experience. Learned a lot about sales and myself. \n\nAnd now, here we are. Just received a call from a B2B SaaS startup (series B) that they’ll be sending an offer letter in the next hour. I made it, boys. Started from the bottom and, while I’m still here, at least the ceiling isn’t also the floor. \n\nAt the end of the day I know nobody cares, but hey. I made it into tech sales and I’m pretty fucking happy about it. \n\nEnd rant. ",
    "score": 1025,
    "url": "https://reddit.com/r/sales/comments/1n7seem/well_i_fucking_did_it/",
    "created_at": "2025-09-03T22:02:03.000Z",
    "num_comments": 142
  },
  {
    "id": "reddit-1mlbytm",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "VP made me sit through 6 hours of 'consultative selling' training. Client hung up on me using their exact script",
    "text": "Company brought in some $15k consultant to teach us \"modern selling techniques.\" Spent my entire Tuesday in a conference room learning about \"discovery frameworks\" and \"value-based conversations.\"\n\nHad a call yesterday with a warm lead. Decided to try their fancy discovery questions. \"What's keeping you up at night regarding your current solution?\"\n\nDude literally laughed and said \"Are you reading from a script?\" then hung up.\n\nMeanwhile my desk neighbor who skipped the training (sick day) closed two deals this week just talking to people like a normal human being.\n\nI've been selling for 4 years. I know how to have conversations. But now I'm second-guessing everything because apparently my natural approach is \"outdated.\"\n\nAnyone else feel like sales training makes you worse at selling? Like the more they try to systematize it the more robotic you sound?",
    "score": 1017,
    "url": "https://reddit.com/r/sales/comments/1mlbytm/vp_made_me_sit_through_6_hours_of_consultative/",
    "created_at": "2025-08-09T00:39:39.000Z",
    "num_comments": 325
  },
  {
    "id": "reddit-1jvzz1u",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "CEO sent me an email, I’m cooked",
    "text": "So I’ve been working in this company for 4 months, I’ve been top 10 performer as a closer for them making close to $1M of Rev every month.\n\nUnfortunately since this is B2C, there is also a Customer Service side of the job that I failed miserably by being too busy and not answering the calls of one Customer I closed.\n\nShe ended up leaving a 1 star review on our Website, literally has my name on it, CEO found it, put me in a group with all the Managers and said sort it out by today.\n\nSo am I cooked?\n\nEdit: \nSo turns out I’m an idiot, it ended up being 2 people that had complaints both of which my Manager saved, review got fixed, he said he will review the calls I had.\n\nI’m confusing the client, not following up properly and had a bad streak of tough clients that tipped the bucket over.\n\nLesson learned, pick your battles.",
    "score": 947,
    "url": "https://reddit.com/r/sales/comments/1jvzz1u/ceo_sent_me_an_email_im_cooked/",
    "created_at": "2025-04-10T14:58:20.000Z",
    "num_comments": 474
  },
  {
    "id": "reddit-1kpwcg4",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Just closed the biggest deal of my career and it was all thanks to drilling objection handling.",
    "text": "Context - work in tech. A couple weeks ago I was On the phone with a CIO of a F500 Bank selling him an 800k ARR cloud infrastructure software deal.\n\nI asked him my closing question as directed by my sales script and to my surprise, he said \"hmmmm, i'm not sure, I need to check with my wife\"\n\nI looked at the spouse objection handling response in the script and it said to say \"HAHAHHAHA come on George I thought you were the MAN of the house? Do you really need your WIFE's permission to make a decision?\"\n\nSo i said that and The CIO laughed and said \"you're SO right Adamaria1994. Please send the DocuSign,\"\n\nI sent him the DocuSign for 800k ARR and he signed it right then and there on the phone! As he signed it he said \"i'm the man of the house thank you for reminding me how could i forget!\"\n\nBy the way I was also doing this live in our office while 40 other people in our sales org watched intently like the scene in wolf of wall street! When I hung up the phone everyone cheered and clapped and my CEO promoted to VP of Sales right on the spot! And as a result of this deal we got more funding for our 20m series B!!\n\nMoral of the story is follow your script, listen to the LinkedIn influencers and dont let the spouse objection get in the way of your sales commissions!!",
    "score": 855,
    "url": "https://reddit.com/r/sales/comments/1kpwcg4/just_closed_the_biggest_deal_of_my_career_and_it/",
    "created_at": "2025-05-18T22:29:46.000Z",
    "num_comments": 182
  },
  {
    "id": "reddit-1l0p02c",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Most sales advice is garbage",
    "text": "Unpopular opinion the reason your sales aren't growing isn't because you need better scripts, more objection handling, or advanced closing techniques\n\nIt's because you're following advice from people who haven't sold anything in 10 years.\n\nWhat actually saw from watching 1000+ sales processes:\n\nStop trying to overcome objections prevent them instead. Most objections happen because you didn't qualify properly upfront. If price is always an issue, you're talking to broke prospects\n\nForget always be closing  always be disqualifying. The fastest way to more sales is saying no to bad fits quicker. I've seen reps double their close rate just by walking away from 30% of their opportunities\n\nYour follow-up game is probably terrible. \"I'll follow up next week\" isn't follow-up. It's hoping. Real follow-up has specific value in every touchpoint\n\nSpeed matters more than perfection. A decent response in 5 minutes beats a perfect response in 5 hours. Every single time\n\nStop selling features, start selling outcomes. Nobody cares about your \"robust reporting dashboard.\" They care about \"cutting your month-end reporting from 3 days to 30 minutes\"\n\nThe companies crushing it aren't using secret sales hacks. They're just doing the basics consistently while everyone else chases shiny objects\n\n  \nI know this is not something new but these are fundamentals ",
    "score": 849,
    "url": "https://reddit.com/r/sales/comments/1l0p02c/most_sales_advice_is_garbage/",
    "created_at": "2025-06-01T13:29:50.000Z",
    "num_comments": 164
  },
  {
    "id": "reddit-1i0a5t2",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "The Hardest Lesson I Learned After Burning Out in Sales",
    "text": "\nI'll never forget the day I almost quit sales altogether.\nI was sitting in my home office at 11 PM, staring at my screen, surrounded by endless Automation tech. \nFor months, I'd been working 12-hour days, sending hundreds of cold emails, obsessing over metrics, and trying every \"revolutionary\" sales tool that promised to 10x my results. \nMy tech stack looked like a who's who of sales automation.\nI was doing everything the \"experts\" preached. \nBut my results? Painfully average. \nEach automated sequence, each perfectly crafted template, each \"personalization at scale\" trick... they all started blending together into a soul-crushing routine.\n\nThen something happened that changed everything.\n\nLate one night, exhausted and frustrated, I accidentally sent an unfinished email to a prospect. \nNo pitch. No fancy formatting. Just a raw, honest message about how I'd been researching their company, understood their challenge, and thought I could help.\nI panicked. This wasn't supposed to go out yet. It wasn't \"optimized.\"\n\nBut here's the crazy part: They responded within 10 minutes. At 11 PM.\n\n\"Finally,\" they wrote, \"someone who actually gets it. Let's talk tomorrow.\"\n\nThat mistake taught me what every sales \"guru\" gets wrong: It's not about selling better. It's about connecting better.\n\nSo I did something terrifying. I dropped most of my automation. \nInstead, I focused on:\n-Actually researching every prospect before reaching out (not just mail-merging their company name)\n-Writing emails that felt like they came from a human, not a bot\n-Listening more than pitching\n-Treating each conversation as unique, not just another ticket in the pipeline\n\nThe results? My response rates tripled. But more importantly, I started enjoying my work again. The conversations became real. The relationships became genuine.\n\nHere's the truth: \nPeople don't want to be sold to. They want to be seen, understood, and valued. They can smell automation and fake personalization from a mile away.\n\nSometimes the hardest lessons are the simplest ones. And sometimes your biggest breakthrough comes from a mistake that shows you what was missing all along: genuine human connection.\n\n\nSo guys what are your thoughts on this?",
    "score": 759,
    "url": "https://reddit.com/r/sales/comments/1i0a5t2/the_hardest_lesson_i_learned_after_burning_out_in/",
    "created_at": "2025-01-13T09:18:41.000Z",
    "num_comments": 194
  },
  {
    "id": "reddit-1iujpkh",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Can't. Do. Sales. Any more. Don't know how to do anything else.",
    "text": "In Tech Sales for 15 years. In Tech CONSULTING sales for 5 years. What a shit show. \n\nUnfortunately I have a personality of a trust fund baby, so whenever things get weird I just quit. And then I remember I don't actually have a trust fund and I get another job. \n\nI'm certified freaking everything - Salesforce, Workday, Success factors, GCP, Azure, AWS, Blockchain, QUANTUM COMPUTING, except I don't actually know how to do any of those things to get a job. \n\nI can't even interview for sales jobs anymore. Been trying to do my own thing BUT I DON'T WANT TO DO SALES ANYMORE. I'm so done.\n\nI want to marry a rich guy and write stories and bake pies and grow flowers, EXCEPT I've been in tech sales for 15 years so my personality is shit. I am still KINDA pretty but not \"marry a rich guy pretty\". \n\nThat's it. No moral to the story. This didn't teach me anything about B2B sales. \n\nAlso, I'm running out of money and I need to come up with something like 3 months ago. \n\nSend help? \n\nEDIT: A few of you send me your affiliate link so fck it, send me all your affiliate shit, my last YouTube video got 14 views, so ANY DAY NOW Imma have that media empire. I also got 6 likes on LinkedIn once. Try not to feel starstruck. \n\nSeriously though, if anyone knows of any job that's not sales and I get to keep my clothes on, please reach out \n\n",
    "score": 733,
    "url": "https://reddit.com/r/sales/comments/1iujpkh/cant_do_sales_any_more_dont_know_how_to_do/",
    "created_at": "2025-02-21T05:40:56.000Z",
    "num_comments": 369
  },
  {
    "id": "reddit-1jftb1c",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Here is how those $160k base jobs ruin lives.",
    "text": "Blah blah not all jobs, not all people, it's just me and that's because I suck, I know, whatever \n\nBut here is a story of ME, and a ton of my miserable colleagues. NOT ALL, I'm sure you know a guy who makes $300 and is killing it, good for him and you too are just better than me in all possible ways, I know I know.\n\nOk.\n\nSo you have to understand that $160k job has got to be different from an $80k job, right? Otherwise what, are some companies just stupid and decided to pay $160k instead of $80k? No, of course not. \n\n$160k in my world (NOT EVERYWHERE IN THE WORLD, JUST IN MY WORLD) is a serious promotion. You're now either management or you're still at the bottom of the chain, but it's a much larger chain now. \n\nFor $160k they expect you to do a very different job from the one you do for $80k. So you know how we are all profit centers, right? We need to cover our salary with our sales, and then some. So now you need to cover $160k and then some. So your quota now increases by A LOT. My first quota was $10M. NOT, NOT IN HARDWARE WHERE ONE PIECE COSTS $10M. In God knows what. \"Technology\". Just go sell $10M worth of WHATEVER YOU CAN THINK OF to this market. We provide these 827261518 services. Go get us clients in F1000. Do whatever you want, just keep the profit margin over 40%. \n\nI remember freaking out with the rest of my peers at my first company like that. You get paid really well, you don't really have a boss, NO ONE tells you what to do. You can even get your own people to do your things. Whatever things you want, here are 6 people that work for you now. \n\nYou're a Director now, or even a VP. You've made it :-) that's it. Golden ticket. It's like running your own business and having a salary. \n\nExcept for the day you realize you haven't actually closed a single deal in a year. And they start asking questions. And you start asking yourself a few questions too. \n\nYou HAVE been working. In fact, you have been working a lot. More than ever. Right at about 3 months mark, after you moved to nicer apartment and bought all the things you can now buy, you realize you don't have a SINGLE opportunity. You thought you did, but none of them came anywhere close to any sort of shape of form. You've had some ideas, but you failed. And you don't have anything. ANYTHING. But then you remind yourself that larger deals have a longer cycle and you calm down. But then you freak out again. If a larger deal has a cycle of 6-12 months, and at month 3 you have absolutely nothing, means if you develop a deal TODAY you MIGHT close something at a 9 month mark. Or not :-)\n\nYour boss calls you once a month, he asks one question. How much money you're bringing in this year? He doesn't care about anything else. He doesn't remember your name. He needs to know the amount and close date. \n\nAnd you've got nothing. \n\nAnd you have nothing for a long time. Until you have something. Until your sleepless night pay off and you find that ONE opportunity and it's not your only chance to keep the job. The opportunity is bad and shaky, it's way below your quota, and 10 other companies are going after this deal as well. 10 other people out there NEED this deal to save their jobs. \n\nOnly one of you gonna get it. \n\nSuddenly all that freedom doesn't sound so good anymore. Not having a boss isn't that great. That team they have you they took away already, because you were wasting man-hours while not having any deals. No, you can't get it back now, it's gone, they're working with someone know KNOWS HOW TO THEIR JOB. \n\nYou lose the deal. Maybe you lose the job, maybe you find another one, maybe you stay, doesn't matter. You manage to stay in the game anyway. Maybe you lied and made up fake opportunities. Maybe you lied to your next employer about all the business you did close. Maybe they forgot about you and forgot to fire you. You stay in the game.\n\n Who would give up that salary? \n\nBut not much changes. Time goes by and you haven't closed any deals. Years go by. Maybe you weezeled your way into someone else's deal once or twice. Maybe you've had a few good conversations and \"built connections\". Maybe you got a bluebird order from an old client that one time. \n\nBut the truth is that you haven't sold anything. You, yourself, haven't achieved any results. You work night and day only to fail time after time.\n\nAt some point you decide to work even harder and go ont he road. You're not on a plane 3 times a week and tou take calls at 2 am. Often.\n\nThat \"no\" hits differently when it's your only deal and you've been working on it for 6 months 24/7. And when it's the 6th deal you lose in 3 years. Despite all your efforts. It gets to you. It really gets to you. \n\nYou know you need another job, but you can't even begin to imagine how would you describe what you did for the past 3 years. What did you do? You don't know anymore.\n\nYou don't know who you are. You don't know how you got here. You thought you were good at sales. You have a whole work history to show it. What happened? How could you fail so badly? And what are your options now?\n\nYou're a spoiled depressed brat now when it comes to work. You're NOT going back to cold calling and prospecting. You've worked on $50M deals! You didn't close any of them, but you were there! CEOs of F1000 took meetings with you! You are a VP. Of something. You don't really do anything, but you're working so hard. Are you failing? Are you succeeding? It's not impossible to tell. \n\nRight about this point 2 of colleagues had a heart attack, at different companies, different years, but same time if career. After they both stumbled upon a REALLY LARGE DEAL, that would pay them millions in commissions. \n\nI personally collapsed into a mush of a person 6 months after I got a VP title. Took me 2 full years to recover. \n\nThat's it. Take care of yourselves out there, folks. ",
    "score": 695,
    "url": "https://reddit.com/r/sales/comments/1jftb1c/here_is_how_those_160k_base_jobs_ruin_lives/",
    "created_at": "2025-03-20T16:44:39.000Z",
    "num_comments": 398
  },
  {
    "id": "reddit-1jaoq3w",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Started a new job and closed $110,000 in my first two appointments.",
    "text": "I’m in remodel sales and made the switch from bathrooms to high end windows. I’ve been in the industry for a while but this is by far the biggest ticket item I’ve sold. I make a flat 9% commission. There are several people who break $500k a month in sales right now and I’m pumped to get there too. \n\nI know this sub hates commission only jobs but let me tell you what, I make a ton working for commission only. ",
    "score": 668,
    "url": "https://reddit.com/r/sales/comments/1jaoq3w/started_a_new_job_and_closed_110000_in_my_first/",
    "created_at": "2025-03-13T22:31:25.000Z",
    "num_comments": 196
  },
  {
    "id": "reddit-1i1ykjz",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "If anyone is struggling to find a job, DM me. I’ll do anything I can to help.",
    "text": "Context: I was unemployed for 4 months and finally signed another AE offer. I don’t start until 3 weeks from now. So I have free time and want to give back since a lot of people helped me. Tell me about your situation, background and I’ll help you put a strategy together. Plus give you tips I learned that helped me. Note: I’m not doing this for money and honestly think no one should have to pay for this type of advice.\n\nUpdate: Please DM me instead of commenting since it’ll be easier for me to manage responses there and keep any of your personal details less public.\n\nUpdate 2: I’ll work through the messages this week I’m at around 100 now. Doing my best to make them personalized to each situation, but I created generic information for everyone that I will send by tomorrow, Thursday EOD.\n\nUpdate 3: I put together a ton of tips/videos/tutorials/advice DM me for the link. I may make a separate post with all the advice.\n\nUpdate 4: Lot of people looking for advice getting an SDR job. I added a section on slack and may just make a separate post with all advice. Lot of people asking how to enter sales as a career. This is tough but will do my best to give advice. \n\nUpdate 5: ADDED a bunch of videos to the slack with step by step guides DM me for the link. ",
    "score": 638,
    "url": "https://reddit.com/r/sales/comments/1i1ykjz/if_anyone_is_struggling_to_find_a_job_dm_me_ill/",
    "created_at": "2025-01-15T14:28:46.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1pqw4ux",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Solved: Clients pulling out at the very last minute. \"Let's hold off until Q1\"",
    "text": "Just today I got my last two deals of the year, both telling me they’re not ready and they decided to hold off until next year. I woke up to my supporting teams PISSED, with my VP throwing a BF in Teams (rightly so).\n\nI call the first client using the line “It would be personally meaningful to me if we can proceed before Jan 1st. Between you and I, I needed this to demonstrate the progress behind our hard work this year, versus a failed effort at the close of the year. Can we please proceed with Dec?”\n\n“Yes I can do that for you.”\n\n“I always appreciate your support. I’ll work with your team to close out the final steps.”\n\nCouldn't believe it worked. But I thought why not go 2 for 2? Nothing to lose. \n\nI called my other client's VP who decided to pull out of December, because the main POC we've been coordinating with is leaving the company next week. I've only met this VP twice, one of which was just on Monday where the last thing he tells us is \"let’s hold off until next year”. Since then I've been reaching out over email, can't get a response. Find his number on zoominfo yesterday, called, left a voicemail, no response. So I try one more call today, he takes the call while driving. \n\nI gave him the same line above. His response? \n\n“I appreciate all your teams’ work, yes I can do that for you.”\n\nMy manager later pings me to push out these deals to 2026, I’ve never in my life felt better telling someone “No”.\n\nWhat a fuckin year. Good luck out there on the final stretch.",
    "score": 616,
    "url": "https://reddit.com/r/sales/comments/1pqw4ux/solved_clients_pulling_out_at_the_very_last/",
    "created_at": "2025-12-19T20:56:36.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1j5c2af",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "So today I had success cold calling by….",
    "text": "I was just going through the CRM for profiles not touched in a few years, asking for the point of contact and saying “I’m touching base because REP XYZ is no longer with the company and I wanted to make sure you weren’t expecting anything from them as I inherited their accounts”. Surprisingly this started working extremely well for me and I booked a few qualification meetings for next week. I feel like the people I talked to dropped their guard.\n\nThat’s it, that’s the post. Just sharing a little tid bit I tried out today and based off 1 day of trial and error it got some meetings booked. ",
    "score": 602,
    "url": "https://reddit.com/r/sales/comments/1j5c2af/so_today_i_had_success_cold_calling_by/",
    "created_at": "2025-03-07T01:37:08.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1icxckn",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "A customer from 14 years ago called me and told me this...",
    "text": "I wrote a post the other day about how I landed a sales job by telling them I expected a call at 5pm in the interview...   \n  \nI got a TON of responses and a lot of self doubt and \"how do I get into sales\" type of responses...  \n  \n  \nI wanted to give some background to all those who are just starting out... I did not talk about the beginning of my sales career out of college. Making money is one thing - but when you do it from passion and because you like it it's another thing.   \n  \nYou might not see it, the same way I write here, but you're an inspiration and change lives when you sell the right things and work for a good company...\n\nMy first sales job was selling for a company called “Hotel Coupons” I would meet with random hotels on the side of the highway and get them in our book that was free at rest stops. Sold it for like $329 a month and made 8% of the $329. It wasn’t this awesome cool job but it taught me to grind - and territory management since I had to drive 3 full states.\n\nI wouldn’t drive 150 miles to sit with an owner for them to tell me no. I did it for about 2 years. The salary was $30k and I got 8% of $329 for whatever I sold.\n\nIt was enough to scrape by. It was fun being on the road and get to stay in hotels and tell my friends \"Work pays for it.\"\n\nBut it taught me the grind. I didn’t know what I was doing (now that I look back years later) but I would ask questions to the hotel owners like…\n\n“How many people stayed last night in your hotel? What was your occupancy rate last month/year?”\n\nAnd ask em - “how much do you spend on that billboard on the highway and how much money has it generated for you?”\n\nThey wouldn’t know.\n\nI said “ you can count right? To 25? to 30? what about 50?”\n\nThey’d tell me yes… why?\n\nBecause we could put a coupon in the book and at $79 a night you can count to 25 which is how many coupons on average the other hotels are getting here in the area.\n\nThat’s almost $2,000 extra a month for $329 and you can keep track of it, unlike your billboard. You could even count to 50 - and since there's not that many of your competitors in here I see this as a way to grow.\n\nI had the distribution numbers of how many we printed each quarter, how many times the free coupon book was refilled, and how many we had left over - and would use that to show the demand. \n\nI'd ask them, \"where do most of your guests come from - like what state?\" They'd tell me \"We're the PERFECT halfway point from all the snowbirds from Michigan heading to Florida. \n\nThen we'd break out the calculator on my blackberry lol and at a $79 a night coupon rate they needed 4 in a month to pay for itself. I had to collect the money/check on the spot. I wouldn't leave without the money. \n\nIf they had pushback - I'd just ask em, \"Based on all the problems you told me with your occupancy and struggle getting people in here, what is your plan once I leave and drive back to Kentucky? On my way I'm gonna stop at all the rest of the hotels and get them in the book.\"\n\nSometimes it would work, sometimes not... But I only needed a few at each exit.\n\nI sold a lot that way!\n\nThat was 2011. My best quarter I was 130% over quota. It was fun\n\n\n\n\\---------\n\n  \nFast forward to 2024... I had many many other sales roles - life has changed I still am in sales just working for myself and live in a new country...\n\nLiterally 5 months ago - I kid you not - Mr. Patel on I-24 outside of Illinois at the Hampton Inn called my cell phone and thanked me for how much I changed his life and his business.\n\nI had no idea who he was but he called me and said \"you sold me that marketing coupon book and I’ve bought 3 more hotels and I found your number and wanted to thank you!\"\n\nHe called me 14 years later to tell me thank you 🙏\n\nI wasn’t making much money but I learned a skill that compounds and keeps stacking - while money gets bigger but sometimes we don't realize that we do change people's lives. I never thought much of that job back then. It was just \"my first job out of college\" \n\nBut getting a call 14 years later from someone who remembered who I was and the impact I had on his family, his life, his business meant way more to me than money.\n\nIf you're looking to get into sales you're not gonna land your dream job - but along the way you'll learn, you'll fail, you'll help people, you'll be scammed and taken advantage of, and you'll learn from the good and the bad...\n\nKeep grinding.",
    "score": 590,
    "url": "https://reddit.com/r/sales/comments/1icxckn/a_customer_from_14_years_ago_called_me_and_told/",
    "created_at": "2025-01-29T16:10:45.000Z",
    "num_comments": 109
  },
  {
    "id": "reddit-1hoy1cj",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Cold call the CEO",
    "text": "CEOs love a cold call, more so than other job titles. Reason being is most CEOs respect it. You don't become a CEO without grinding, working and wanting to grow the business. Of course there are outliers but in my time I've always found CEOs are generally more respecting of cold calls AND they never get cold called in comparison to lower down managers. But only if you do it well or course. If you phone up sounding like a weak needy salesperson then your not getting anywhere.\n\nIn my sales, the CEOs basically never involved in the sales excess but I cold call them anyway. The amount of times the CEO refers me to the decision maker is impressive! Then approaching the decision maker is that much easier and chances of success are so much higher calling them being like \"I was speaking to your CEO John and he mentioned x problem and asked me to reach out to you.....\"\n\nMost people find CEOs too scarey to cold call but that's just head trash. \n\nGive it a try!! ",
    "score": 589,
    "url": "https://reddit.com/r/sales/comments/1hoy1cj/cold_call_the_ceo/",
    "created_at": "2024-12-29T15:17:29.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1i6usum",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "People need to hear this about leaving a job",
    "text": "You can do it. It’s not the end of the world. If you budget properly and have your finances in order you will be fine. It’s not a bad look to leave a job and have a resume gap. You can actually sell it as a positive. The big machine wants you to think otherwise because it wants you constantly under its control. I took 6 months off and just started applying and am about to land my next role. Get your bag and do what you want. \n\nFelt the need to rant about this because I always see people operating out of fear when it comes to quitting/leaving without one lined up. IT DOES NOT MATTER. As long as you’ve got your money up do what you want. \n\nRant over now let’s go make more money. \n\nEdit: Accepted a new position with higher base pay than previous job. The only thing to fear is fear itself. ",
    "score": 568,
    "url": "https://reddit.com/r/sales/comments/1i6usum/people_need_to_hear_this_about_leaving_a_job/",
    "created_at": "2025-01-21T22:07:43.000Z",
    "num_comments": 119
  },
  {
    "id": "reddit-1k09r1y",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "I’m on cloud 9 and need to share",
    "text": "Yalllll!!! I sell home improvement remodeling projects, focus on Windows, Doors, and Gutters. It's a 100% commission job, no salary. It's a one call close job- I have one opportunity to demo my product and ask for the sale. No be backs. \n\nToday marks a straight week of closing 100% of my appointments I demo'd and I made close to $12k take home. It's unreal and I'm so surprised. Life changing. Whole crew was hyping me up in the group chat and I'm going out for a nice steak dinner tonight to celebrate. On cloud 9...",
    "score": 566,
    "url": "https://reddit.com/r/sales/comments/1k09r1y/im_on_cloud_9_and_need_to_share/",
    "created_at": "2025-04-16T02:25:57.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1mbjt2y",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Its insane to me how many VPs of Sales cant hold a role over 18 months",
    "text": "I think this is a huge driver as to why sales orgs can get so toxic so quick. The amount of VPs who suck so bad and build careers off of one big logo they worked for 20 years ago is insane. They come in, fire everyone, lower comp and are fired themselves in 12 months. \n\n  \nJust needed to rant. ",
    "score": 553,
    "url": "https://reddit.com/r/sales/comments/1mbjt2y/its_insane_to_me_how_many_vps_of_sales_cant_hold/",
    "created_at": "2025-07-28T15:48:57.000Z",
    "num_comments": 123
  },
  {
    "id": "reddit-1pr4700",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "2.2m deal came in today.. not much else to say - but don't have anywhere else to brag.. (commerical HVAC)",
    "text": "I'm in a longer sales cycle than most of the posts I see here. \n\nThis deal will still need to go through production and startup.. but it's a nice way to move into 26'..\n\nDetails for those interested.. 12m/yr territory for 25' (shipped and invoiced). Up from 10m in 24'. \n\nManage 10 US states - average (noteworthy) sale is around 250k... \n\n~3-6mos sales cycle is typical. Lots of travel, face to face and PPT with a catered presentation style sales. \n\nProbably a bit old school in today's world.. but lots of money to be made in this environment..if you have experience. \n\nWill clear around 250k (honest number) salary + bonus for 25'. Plus retirement and \"deferred\" bonus. \n\nEngineering background selling to other engineers. .. really only posting this because I am drunk celebrating and mostly only ever see SAAS anecdotes here.",
    "score": 542,
    "url": "https://reddit.com/r/sales/comments/1pr4700/22m_deal_came_in_today_not_much_else_to_say_but/",
    "created_at": "2025-12-20T03:20:00.000Z",
    "num_comments": 104
  },
  {
    "id": "reddit-1jix0cr",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "“We are looking for a hunter”",
    "text": "This is a rant. Recruiter reaches out to me with a $100k base $50k commission BD Position in industrial equipment. I tell her I’m not interested in BD or SD roles, I’m looking for a Territory Account Exec/Account Manager role. She tells me sure thing I got the right position for you, and schedules a second call. \n\nDuring the second call, she kept on asking me for cold calling strategies and how I handle cold leads and acquire new leads. I reiterate that I have reached a place in my career where marketing sends me leads which I close 50-60% of the time. Cold generated leads have a 5% closing rate, and I’m NOT interested in doing that. I’ve already toiled for 3 years in shitty BDR/SDR positions, and I’m not looking to go back to being a glorified appointment setter. \n\nI’m more into “growing the business” rather than “starting a business” or else I’d have started a business for myself. \n\nEnd of rant.  \n\n",
    "score": 508,
    "url": "https://reddit.com/r/sales/comments/1jix0cr/we_are_looking_for_a_hunter/",
    "created_at": "2025-03-24T17:53:06.000Z",
    "num_comments": 254
  },
  {
    "id": "reddit-1hycxnw",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "I feel so lucky",
    "text": "I’ve been tossed around, kicked in the nuts, and drained by this career. 4 years of eating absolute shit and I thought it was time to leave it forever. \n\nTook one last attempt at a new gig and I have no one to brag to so I’ll get my thoughts out here. \n\nIt’s incredible. Travel. Partying. 6 fig base. Low stress. Opportunities flowing left and right.\n\nSometimes it’s worth it to keep pushing. My 2 cents.\n\n(Anyways see you all in 6 months when I get PIPed and do it all again)",
    "score": 508,
    "url": "https://reddit.com/r/sales/comments/1hycxnw/i_feel_so_lucky/",
    "created_at": "2025-01-10T19:40:33.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1krokou",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Wish me luck…. $45M deal I’m presenting tomorrow!!!",
    "text": "I’ll follow up afterwards\n\nEdit 1:  Presentation went very well.  We have some items to tie up and then send off by Friday.\n\nThe customer is looking to choose a vendor by the end of the month.\n\nFor those asking, this is for around 250 material handling equipment in warehouses throughout the US as well as around 500 rentals with a minimum of one year.\n\nMargin in my industry is very low and in this deal, around 2% total for the purchases.  The sales rep receives 30% of that number and 1% of the total rental volume.  Rental margin is closer to 35%.\n\nFor myself…. I just started as the sales manager for four regions and have a salary and a small commission.  My cut would be $23,500, however helping close this would give me plenty of roof for negotiations next year.\n\nEdit 2:  This is a very complex deal and would take pages of detail to update.  We were in the lead until the customer asked us to not charge any OT rates on equipment usage as apparently the other vendors have offered.  \n\nWe had to raise rental rates by 20% to accommodate this and with the amount of equipment, that equates to $2M per year.\n\nThe numbers don’t make sense since this is a 3 shift   operation.  The details of the deal are poor at best from the customer (which is standard for them) and there is an extremely high chance of failure for the winner of this deal.\n\nThere was a power failure at one of the warehouses and we would have lost the deal if it wasn’t for this event as we presented the higher rates and a decision was to be made the next day.\n\nThis is now pushed to Wednesday and we could, if we wanted to, honor the original rates, but the complexity of the deal feels too uncertain to move forward.\n\nThe kicker is that the now leader is the company I just left.  It would be gratifying beating my chest as the winner, but after a lot of thought, and some whiskey, the smart move is letting the customer know they are going to be disappointed/devastated with the results of choosing that vendor, and that we’ll be working behind the scenes to help them out when they inevitably will call us for help.\n\nSometimes passing on a deal that you know is inevitable to fail from your competitor is the best move in the long run.\n\nThis is the first time in my 20 year career I’ve had this come so clear and it probably doesn’t happen in many other industry’s, but 4D chess when presented is the opportunity is the play.\n\n\n\n",
    "score": 506,
    "url": "https://reddit.com/r/sales/comments/1krokou/wish_me_luck_45m_deal_im_presenting_tomorrow/",
    "created_at": "2025-05-21T03:53:08.000Z",
    "num_comments": 143
  },
  {
    "id": "reddit-1krzhj5",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "what a “normal” day in sales leadership looks like.",
    "text": "Posted this on LI, thought it might be fun to add here 😂\n\nDay in the life (source, was a sales leader in tech)\n\n- Host team pipeline review meeting. Everyone says “this one might close soon.” Nobody makes eye contact.\n- Try to build a Salesforce report. Accidentally delete something critical. 😱Rename the dashboard “pls don’t touch.” and sit in fear of RevOps. \n- Panic because a VP-level client call starts in 2 minutes.\n- Seller on my team is spiraling. “What even is value?” you’re asked. Talk them off the ledge.\n- Write a lengthy strategy doc (v4) for leadership called “Why We’re Not Hitting Numbers\" (And what we’re going to do without crying* *in my mind)\n- Have a quick tea which is cold &amp; drink it anyway. \n- Meet with XFN partners. No one knows who owns the project or why we're doing it. Agree to circle back.\n- Have lunch: 6 almonds running to another meeting. \n- Have meeting with my manager who asks me to schedule 6 CEO meetings a week from now on because 'we should be in front of clients more'. 💀\n- Message RevOps &amp; ask to fix dashboard I broke earlier. Apologize for existing.\n- High-stakes client call with multiple senior folks who are angry for some reason. Soothe them.  \n- Team session on career goals. Half want your job (why!). You miss being an IC.\n- Realize you haven’t stood up in four hours. \n- Inbox has 91 unread messages from just today. Choose inner peace and try again tomorrow.\n\nAny sales leaders want to chime in on anything I've missed? 🤣",
    "score": 379,
    "url": "https://reddit.com/r/sales/comments/1krzhj5/what_a_normal_day_in_sales_leadership_looks_like/",
    "created_at": "2025-05-21T14:39:26.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1ovyd0c",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Over the years I saved 100% of my commissions and lived off my base",
    "text": "Just my experience, but I always tried to budget living off my base salary (tbh it was easier to do when it’s six figures than when I started). \n\nCommission checks went straight into my 401k, IRA, and then after-tax brokerage accounts. I invested in index funds and those were mostly stock funds like IVV and VTI and VXUS with some tax-free municipal bonds as well. It added up fast and compounded a lot over the years. I even took a few months off a few years ago and came back to work with more money than I started with due to a nice gain in the market. \n\nAfter a little more than 20 years of working and saving my commissions,  I have enough to easily retire early.\nI’ve always been good at sales but let’s face it, it’s a grind on the best of days and I don’t want to do it forever.  \n\nManagement wants you to blow it all and keep working forever. And I’ll admit I did spend some on a couple nice watches, a nice house, vacations, but you can save your way to freedom and this is one way to do it. Hope this helps anybody.",
    "score": 363,
    "url": "https://reddit.com/r/sales/comments/1ovyd0c/over_the_years_i_saved_100_of_my_commissions_and/",
    "created_at": "2025-11-13T11:10:49.000Z",
    "num_comments": 122
  },
  {
    "id": "reddit-1iyrgc4",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Snitches in sales jobs",
    "text": "Why is there always a 40 something divorceé or first time employee in every sales career named Linda, Lauren, LeAnn, Nick, Brian, Emily, Pam, or Steve who isn’t great at selling but is great at gossiping, snitching to the boss, and instigating—whose ambition is unbridled, but whose work ethic is meh? \n\nUsually they idolize Grant Cardone it seems like. Is this some sort of cardinal rule that every corporate job has to have one of these people in 2025, and they have to have one of those names? Noticing a pattern the older I get and can’t ignore it any more. Can’t go on living like this without knowing if anyone else has noticed\n\nNo shade here, I respect the hustle, but it’s too common to be some sort of a coincidence",
    "score": 357,
    "url": "https://reddit.com/r/sales/comments/1iyrgc4/snitches_in_sales_jobs/",
    "created_at": "2025-02-26T16:25:38.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1ic3x3k",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "23 Years Old, No Experience, How I closed the most important sale of my life. How to enter sales career...",
    "text": "Back in 2013 I left my second sales job out of college at LivingSocial - like Groupon. They didn’t pay my 170% to quotation cause I was just closing deals left and right.\n\nThe day the manager told me they couldn’t pay me I called my mom and bought a 1 way flight to NYC (where I was originally from) and stayed with my uncle for a month and a half looking for a new job.\n\nI spent 30 days submitting resumes. I found this headhunter on LinkedIn for a pharma company. I watched that movie where the pharma reps were killing it but I didn’t have experience.\n\nShe told me no way they would hire me. I begged her give me the hardest assignment and put me in front of the hiring manager. I’ll get the job. I begged her. For like a week.\n\nShe caved in and got me in front of the managers at a hotel in NJ.\n\nI was so nervous I spent a month there just doing bull shit interviews. Nothing like pharma sales.\n\nI was last a there were 11 candidates in front of me all my parents age - seasoned sales people.\n\nI got in the little room and they were drilling me with the situational interview questions. I remember one of them threw me off - “if you were a plant what would it be? And why?”\n\nI said a “weeping willow” my dad had one and as a kid we had to move it away from the house cause the roots could crack the foundation looking for water.\n\nI made up some story like I’m a weeping willow because I dig deep to find information and soak it all up like the roots and grow so large because I love to learn.\n\nIt was what I came up with on the spot.\n\nI was nervous I wanted the job I was there for a month and this was my chance.\n\nThe regional director was in the room and we only went through a few questions at this point and I knew just as much as they knew I was the last guy with the least amount of experience - and the head hunter just did me a favor cause I begged her.\n\nHe stepped in casually and said “look we like your resume and there’s a lot of great qualified candidates here - why would we choose you with no medical experience over the others?”\n\nI paused.\n\nI was sweating.\n\nI was nervous.\n\nAnd I said “can I think about this for 30 seconds and gather my thoughts?”\n\nHe said yes take your time I can get you some water.\n\nI was young - I was 23 years old and I knew I was going for a sales job so I needed to just be myself and close em.\n\nI took a sip of water and said…\n\n“The reason why is because the rest of the candidates view this as just another job. I bought a one way ticket from Kentucky to be here. The only reason I’m here is because that lady outside this door saw something in me. Everyone else has a plan B.\n\nI know you guys are hiring and making a decision today by 5pm and I’m the only one here that doesn’t have a plan B and I expect a phone call no later than 5:30pm with an offer letter so I can go back to Kentucky to pack my stuff and start next week.\n\nI appreciate both of your time today and I look forward to hearing from you at 5:30 this afternoon.”\n\nI stood up extended my hand and shook both of their hands and ended the interview myself.\n\nI walked outside and blacked out while the lady asked me how everything went. I told her I screwed up I didn’t know what to say and I sat on the couch to collect my thoughts.\n\nI went home feeling miserable and playing it over and over again in my head feeling like I blew it.\n\nI got a call at 6pm and Bryce (my new manager) told me that was exactly what they were looking for. They needed a salesman who was not afraid to close the deal.\n\nI got the job and entered the medical field as a sales rep!\n\nI’m writing this because I see a lot of people asking questions about entering sales and claiming they don’t t have experience etc. own that shit and be yourself and take a chance!\n\nI hope this motivates at least a few people to go achieve and get what you want with confidence and close your next sale!\n\nI’d love to hear your stories too! I’ll respond to everyone!\n\n",
    "score": 319,
    "url": "https://reddit.com/r/sales/comments/1ic3x3k/23_years_old_no_experience_how_i_closed_the_most/",
    "created_at": "2025-01-28T15:21:26.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1kyleeh",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Sales Manager Told Me To Drop My Hobbies",
    "text": "During my weekly meeting with my sales manager this morning, he told me that I need to change my routine and put my hobbies aside to focus on prospecting and my sales career. Said that I should be exhausted every night from prospecting and researching leads. \n\nI've been with this company for 5 years. I'm in a small region and I'm only allowed to sell my specific products in my specific area. My first 3 years were killer. Last year I was down 20% from the year before. My 3 biggest accounts have slowed down extremely and getting new accounts has been hard. \n\nAside from getting new accounts, my job requires managing existing accounts and their build schedules/quotes/orders and walking jobs to confirm materials before placing orders. \n\nI guess I'm just ranting about being burnt out by my sales manager never being positive and only telling me that I'm not doing enough and that I should stop having a personal life, despite prospecting weekly. ",
    "score": 308,
    "url": "https://reddit.com/r/sales/comments/1kyleeh/sales_manager_told_me_to_drop_my_hobbies/",
    "created_at": "2025-05-29T20:33:00.000Z",
    "num_comments": 208
  },
  {
    "id": "reddit-1j43p7j",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "My HR wants me to PIP someone and I disagree",
    "text": "Currently work as a sales manager, have an employee who I love sending all our shitty accounts to. He’s been around forever, wants to retire in 2-3 years and he’s frankly not a good seller. But when we get accounts (large b2b) assigned to our patch that have a bunch of service issues or legacy contracts that don’t result in sales, I send them to him. He’s great at keeping shit off of my plate and I usually stop hearing any escalations or issues. He finished last year at 52% to plan, I gave a him a 3 and spent an hour justifying how he was a great team player. My bosses boss recalibrated him to a 2 because he hates the idea of not every employee being an allstar and now HR wants me to pip him and put together language for him to exit the company.\n\nI refused yesterday and said clearly no one read my review because I gave him a 3, she(HR) added in the bosses and said I was required to.\n\nI’m torn - the dude knows he’s not great, but in my role 20% of the accounts I have to manage are dog shit and not worth my time. If I had an “allstar” with those accounts they’d quit within a year. I love throwing shit at this guy cause it makes my life so much easier. But I can’t truly defend him as a salesperson and stake my reputation on it with sales leadership. \n\nIt’s so frustrating and terrible in this career that people can force you to fire people even if their management doesn’t agree.\n\n\n**Edit** wow - definitely struck a chord with some of you - it's interesting, I think the biggest pushback is the thought I'm sending him \"All the shitty accounts\" and I can see how I made it seem that way without context of the large amount of orgs we all work in. When some of you are calling on 1000 accounts and only selling to them a few times, I can see getting garbage leads as hitting a nerve.\n\nI don't know much about your industries and you don't know much about mine, but in our group we have about 10-15 accounts total per rep, and it's rare you get a new one. This particular employee was give two accounts with no increase to his quota for them, but I do recognize it takes up more time than they're worth. That being said, had I given the accounts to my other reps, he still would have finished at 52% (in my opinion, obviously there's the smallest chance he missed a large opp because he was focused on these accounts, but if that was the case, we'd more than support him to make sure he had time to focus on his deal). His accounts all had similiar chances of success when we assigned them out 3 years ago, but I admit his peers have had more \"luck\" with their accounts getting massive funding from PEs and IPOs.\n\nThat being said, some of the comments were incredibly helpful, the fact we don't have a CSR or CSM role for accounts like these is glaring. And calling out that the call to PIP him is unlikely to be coming from HR makes sense and I didn't consider that. Our SVP doesn't like this person because he had joked about retiring 5 years ago \"tainting\" him.  I have a call tomorrow with our CSO to discuss this - and - I do want to talk to my CSO about establishing a role for a CSR within our group (and I have the perfect candidate).",
    "score": 308,
    "url": "https://reddit.com/r/sales/comments/1j43p7j/my_hr_wants_me_to_pip_someone_and_i_disagree/",
    "created_at": "2025-03-05T14:00:21.000Z",
    "num_comments": 220
  },
  {
    "id": "reddit-1kkv1p9",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Total Imposter",
    "text": "True confession. I have no idea what I’m doing. I am lucky to have a big account that keeps the orders coming, but I inherited it. I can’t land a new account to save my life.  For the most part I just answer emails and have internal meetings to make sure we aren’t screwing up too badly. I travel the bare minimum just so my boss can see me spending money. Last year I was 60% attainment but made more money than I ever have before, due to some favorable changes to my comp structure. I feel like I suck and really don’t know the first thing about sales. Yet here I am, 5 years into a sales career and so far nobody has noticed that I have no clue. Anybody else? ",
    "score": 305,
    "url": "https://reddit.com/r/sales/comments/1kkv1p9/total_imposter/",
    "created_at": "2025-05-12T15:14:25.000Z",
    "num_comments": 124
  },
  {
    "id": "reddit-1lkc9gs",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Built a $1.2M ARR pipeline, then got laid off in an acquisition. HR seems concerned about what I'll do next.",
    "text": "Hi Folks,\n\nBefore I begin, I want to say that this is my first time posting and that I love this sub!  Now on to the story...\n\nI’m seeking some wisdom from this group regarding a recent layoff from my employer.  I don't know what to do, as it relates to unpaid commissions and potentially strategic termination tied to a company acquisition.\n\nHere's what happened:\n\n1. I was employed as an Outside Sales Representative for nearly 2 years, and built a sales pipeline worth approximately $1.2 million in annual recurring revenue (managed IT services industry).\n2. I was placed on a bullshit Performance Improvement Plan about two months ago, despite continuing to build a strong pipeline and close deals.\n3. Two weeks ago, the company announced it was being acquired.\n4. I was laid off last week, my first layoff ever in my (43m) career. This was just before several of my BIG pipeline deals were expected to close, which were likely to pay out approximately $50,000 in commissions (conservative estimate) in Q3.  By FAR, the biggest my pipeline had ever been.  Losing it made me quite angry...\n5. ... but I was offered a severance package of $8,637, yay. /s\n6. I have not yet signed the severance agreement. It’s valid for 21 days.\n\nBoo-hoo, this kind of thing happens all of the time with acquisitions and layoffs - right?\n\nYes, but this is where I think my story gets more interesting. The day after the initial exit meeting, I posted about my layoff on LinkedIn (nothing bad or naming names, just that I felt \"anger\" about my layoff).  Within an hour, HR called me and threatened (in a nice way) to revoke the severance offer unless I changed the wording of my post (which I did, changing the word \"anger\" to \"disappointment\").\n\nMy guess is that they're worried by the amount of traction my post got on LinkedIn (HR even commented how I got 17 reposts within the hour) and about the potential PR damage I could cause during this sensitive time of their acquisition.\n\nIn hindsight, HR is probably also unnerved about a question I asked at the end of my exit meeting:  \"how long do I have until you shut off access to my accounts?\" (they answered \"about 10-15 minutes\" but it was closer to 20 minutes).\n\nThey likely think I made full use of that time by preserving evidence of my pipeline, exfiltrating at-risk client lists, etc.\n\nI've reached out to some employment law firms for advice but haven't actually talked to a lawyer about any of this, yet (ChatGPT doesn't count, haha).\n\nPart of me wants to take the $8k, shut up about it, and move on.  But the other (currently louder) part of me wants to fight for more money and call out this company's bullshit.\n\nI know it's not illegal what they did and is probably more common than I realize.  But it just fucking suuuucccks.\n\nMy question for this group**:  has anybody been in a similar situation?  How did it play out for you?**\n\nThanks for reading my first post.  Writing it all out was very cathartic, and if anyone has questions, I'm happy to reply to you in the comments.\n\nEDIT: Wow, these are great comments, thank you all!  I tried to reply to everyone, but now I need to go to bed.\n\nEDIT 2: Since people are asking about non-compete and non-solicit language in the agreements, I ingested the 3 docs I have into ChatGPT and found that nothing would prevent me from (for example) negotiating a higher severance, signing it, and then immediately working for a competitor and soliciting the client list. Honestly I was quite surprised to find this. Important to note, this has not (yet) been reviewed by an attorney.",
    "score": 273,
    "url": "https://reddit.com/r/sales/comments/1lkc9gs/built_a_12m_arr_pipeline_then_got_laid_off_in_an/",
    "created_at": "2025-06-25T17:41:51.000Z",
    "num_comments": 233
  },
  {
    "id": "reddit-1knw3mm",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Finally left sales.",
    "text": "After years in sales, I’ve finally had enough.\n\nI’m tired of working for companies that overpromise and underdeliver. They told me their product was the best on the market, but the reality was far from it. I’m tired of being misled during interviews, only to join and discover that everyone is behind on their quota and just trying to stay afloat.\n\nThe job itself has become mind-numbing. Saying the same things every day, hoping something lands. My brain has been switched off for months. The whole industry feels like a game of luck – timing, territory and a bit of talent, sure,  but mostly luck.\n\nWhat’s worse is the complete lack of security. If you miss target for a week, you're already worrying about being let go. There’s no real control, just constant stress and fear.\n\nSo, I’ve made a big decision. I’m going back to university this October to start a degree in Mathematics and Statistics. My goal is to move into something more stable and structured, like finance or insurance, a field where I can actually build a long-term career.\n\nI’ve also accepted a customer support role. Yes, it’s a big drop in salary, but it offers stability. No more chasing quotas, no more worrying about layoffs. Just a chance to focus on my studies and get my life heading in the right direction.",
    "score": 267,
    "url": "https://reddit.com/r/sales/comments/1knw3mm/finally_left_sales/",
    "created_at": "2025-05-16T08:52:38.000Z",
    "num_comments": 138
  },
  {
    "id": "reddit-1jqv5ba",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Sharing a commsison",
    "text": "Hello brain trust,\n\nToday I closed the biggest sale of my young career $413,000. I realize it’s not the largest sale out there but pretty good for selling electrical work and one of the largest sales in the companies history. \n\nWe have a sales engineer who helps us design and build quotes on these higher end projects with more complications. His job is not commission based and he doesn’t expect anything but I feel as if I should give him something as a thank you for his efforts in working with me and guiding me along the way. We likely have a total of 24 hours of time building this proposal.\n\nI am projected to be making $45,000 in commission from this project. What would you consider to a nice gesture for sharing some of the money with him? \n\nAppreciate your feedback. ",
    "score": 251,
    "url": "https://reddit.com/r/sales/comments/1jqv5ba/sharing_a_commsison/",
    "created_at": "2025-04-03T21:42:14.000Z",
    "num_comments": 141
  },
  {
    "id": "reddit-1ix8lbn",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Colleague accidentally shared his comp",
    "text": "Just found out a rep on my team is making 25% more than I am. For context, we have the same exact quota. This rep was hired not that long ago, but we both were external hires. \n\nI’m the top rep on the team and this rubs me the wrong way. I know sharing salary is really a taboo, but had anyone else brought this up with their manager before?\n\nI’m just had my annual performance review and was told I’m currently in line for performance raise, although expecting that to be insignificant. \n\nHow have you all navigated this?",
    "score": 246,
    "url": "https://reddit.com/r/sales/comments/1ix8lbn/colleague_accidentally_shared_his_comp/",
    "created_at": "2025-02-24T18:07:46.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1icgkgq",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Make 200-300k working 25-35 hrs per week or 600k working 50-60hrs per week?",
    "text": "My fellow mentally unstable sales people. I am in a predicament. I've been making about 300k a year for the last few years. Busy times and slower times, but earning only via commissions and last few years have been floating around 300k per year. \n\nCorporate overtake has slowed things down  and will probably make 250ish this year, perhaps maybe 220ish. Saying the same shit over and over again, same objections, same fucking rat race.\n\nI have the opportunity to get into another sales position in another state, about a day drive from where I'm currently at. I will be working 50-60 hrs a week, but multiple sales people under me. Lowest sales guy makes 350k at this new position, highest paid guy does maybe 660k. It will be in a LCOL versus a HCOL area where I'm at now.\n\nI have really great flexibility, can take off time whenever currently. Pretty low responsibility...if I make this move, I will work way more with more responsibility.\n\nI am a single dad, and love the time with my kiddo with my current flexibility... but I'm getting bored. If I make this move (baby momma and kid will come too) I'll lose time with my kiddo, working insanely more, comparatively. What would you degenerates do in this scenario? \n\nThoughts that pass in my mind will be \"tough it out for a few years, save up, invest so I can look at not doing sales anymore\"\n\"The time lost with my kiddo is significant but more money\"\n\"I'll have to move away from family to make this move happen, love where I live\"\n\nWhat would you twisted fucks do in this scenerio?\n\nAlso note... I will not be sharing which locations or industry I'm in sorry 😢 this is not a shit post\n\nEdit***\nThanks for everyone with your thoughts!! I want to clarify a couple things. The kiddo is very young, in kindergarten. When I meant bored, I mean my job itself...saying the same shit over and over again same objections, etc is very boring. I am in third person almost out of my own body as I repeat the same god damn word track I use with everybody and go on auto pilot. It lacks challenge at this point. I don't feel as if I'm growing. I know 300k may seem a lot to some, but lifestyle creep is real, when you're trying to provide your family with the best living situation, kids extra curricular, private school, music lessons, life experiences, etc.\n\nAlso, when you've lived your life at a certain income for so many years, getting your salary cut almost 1/3, hurts.\n\nI would love some insights on parents who made this transition before. Wether it's 100k-&gt;200k but more hours, etc. and how that's affected their relationship their kid and what they would do over. Thank you fellow fucked up sales people",
    "score": 234,
    "url": "https://reddit.com/r/sales/comments/1icgkgq/make_200300k_working_2535_hrs_per_week_or_600k/",
    "created_at": "2025-01-29T00:08:18.000Z",
    "num_comments": 486
  },
  {
    "id": "reddit-1mvonun",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "How has your income changed since going into sales?",
    "text": "4 years ago I was barely getting by working in the field, in agriculture. Loved what I did but knew it was time to move on for financial reasons. Making 39k a year. \n\nFast forward to today.. last week received an offer with 100k base salary and 155k ote from one of the largest tech companies around.\n\nAnd then received a counter offer doubling my salary at my current spot lol \n\nWhat a wild ride it has been. Life changing. Where have you been salary wise and what are you making now? ",
    "score": 210,
    "url": "https://reddit.com/r/sales/comments/1mvonun/how_has_your_income_changed_since_going_into_sales/",
    "created_at": "2025-08-20T19:27:20.000Z",
    "num_comments": 204
  },
  {
    "id": "reddit-1muc7wc",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "If your job is miserable but tolerable stick with it",
    "text": "I am drunk and just going through my feelings. I had a sales job that I had for 5 years but I hated some of the process and lack of support. I quit in january and its been the biggest mistake of my career. Ive had two job since then and the grass is not greener. I regreat quitting my last role so much and now im 32 starting from scratch with a shit base salary. I feel so lost in life and finding another role is so hard right now. I feel like a fucking idiot with how tough my current roles are. I have pissed through my saving and feel like my life is over. I dont know where im going with this but this life shit is hard man. Its better getting a check and being miserable than not having a check and starting from zero. This new role has good oppertunity but starting from zero when I am 32 is just exhausiting man. I feel like I made a huge mistake and would love to help people avoid the mistake I made. Anyways, thats my rant. The only good thing is I met an amazing woman but still need to work on seprating my personal worth versus my sales. ",
    "score": 205,
    "url": "https://reddit.com/r/sales/comments/1muc7wc/if_your_job_is_miserable_but_tolerable_stick_with/",
    "created_at": "2025-08-19T07:59:33.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1lp57g8",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "I've sold $445k but only made $11k in commission this year. SaaS selling to IT. Am I getting fucked?",
    "text": "I'm having a killer year honestly.  Best year I've ever had.  I've been at this company for 5 years now.  Year 1 I was a SDR.  Then I got promoted to AE.  \n\nThis is my first and only real corporate gig, so I've got nothing to base it off. I sell SaaS to IT, pretty technical stuff.  \n\nAnyways, quotas have consistently increased while commissions have consistently decreased, to the point where it's unsustainable.  If I sold this much my second year, I was making 10%, and I'd have earned $44.5 in commission. \n\nBase salary barely increases, they say \"if you want to earn more, sell more!\" \n\nIt's not sustainable.  My job title is the same after 4 years, just added the \"senior\" to my title which came with no real increase in pay.  The only additional responsibilities I got from that is to help the newbies out and train them, which is bullshit. \n\nAfter some research, it seems that industry standard commissions are in the 7-15% range, depending what company and segment you're in (SMB vs EPG vs Fed etc)\n\nAm I getting fucked??  If so, how much am I getting fucked???  How do I not get fucked as much??  Like I said, this is my first corporate gig like this.  I don't have anything to compare it to or any prior experience in corporate b2b sales as I'm only 28 and have been at this company since I was 23. ",
    "score": 191,
    "url": "https://reddit.com/r/sales/comments/1lp57g8/ive_sold_445k_but_only_made_11k_in_commission/",
    "created_at": "2025-07-01T15:50:25.000Z",
    "num_comments": 255
  },
  {
    "id": "reddit-1nufq56",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Best Industry to get into now?",
    "text": "Hello r/sales,\n\nThis is for the older/seasoned folks in here (30 is older to me). I am a young professional with a bachelors degree in business admin and 2.5 years of full cycle sales experience. I want to make more money as the current position I am in would take me forever to see $100k+ a year. I like sales enough to want to stay in it longer however I want a position with very high upside.\n\nWhat industry should I target for my next role? (SAAS, manufacturing rep, medical sales, fintech)???\n\nnote- SAAS seems to have the most upside however, I only see negative posts about how it is trending downwards.\n\nShould I even stay in sales?! I am not afraid of upskilling\n\nGoal salary in 5 years- $150k",
    "score": 190,
    "url": "https://reddit.com/r/sales/comments/1nufq56/best_industry_to_get_into_now/",
    "created_at": "2025-09-30T15:07:46.000Z",
    "num_comments": 291
  },
  {
    "id": "reddit-1i63vq4",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "W2 sales roles without a base salary should be illegal ",
    "text": "Currently job searching and just got out of an interview with a home remodeling company. Started with a phone screen, and they waited to disclose that compensation was 100% commission, mandatory four week training at $100 per day, on five days a week (days of your choice excluding one mandatory weekend day), mandatory two days in office for training an manager check in for zero guaranteed pay. 10-12 leads per week given. Benefits after 90 days.\n\nIn general sounded like a decent role inbound wise, but simultaneously this is a TON of ask for a company offering $0 in guaranteed income. Simultaneously the worst of both worlds 1099 vs W2 compensation. If no base is offered W2 expectations responsibility wise should be flat out illegal.\n\nThank you for joining my talk.",
    "score": 164,
    "url": "https://reddit.com/r/sales/comments/1i63vq4/w2_sales_roles_without_a_base_salary_should_be/",
    "created_at": "2025-01-20T23:02:08.000Z",
    "num_comments": 139
  },
  {
    "id": "reddit-1mhqbny",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Left old job which I hated to a new job I hate even more. Misled by recruiter.",
    "text": "As the headline says. I started a new job last week after leaving my job of 2.5 years. I’m in the manufacturing space. I made decent money at my old job, but it was time to move on. This recruiter came with a great offer, great promises, higher salary huge chance to make some big commission. I interviewed 3x with vp, vp of sales and hr. I accepted the offer for 15k higher base salary. After my first week I realized this was all not true. There are no lead gen tools, no new accounts to transition over, zero marketing. (All things promised in the interview) The office I interviewed in is a different office from the one I am working at and it’s way less nice. I know I’m in sales and prone to doing stupid shit for money but I am freaking out right now. I’m 25 and have a decent savings. Oh I forgot to mention they don’t have a 401k match anymore which was verbally promised to me by the recruiter. I guess I didn’t ask enough questions but I thought I did. How fkd am I? And any advice to move forward? I cannot go back to my old job. ",
    "score": 130,
    "url": "https://reddit.com/r/sales/comments/1mhqbny/left_old_job_which_i_hated_to_a_new_job_i_hate/",
    "created_at": "2025-08-04T21:27:03.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1p1i381",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "If you could pivot your career out of sales, would you?",
    "text": "If you could pivot your career out of sales would you do it? \n\nWhat would it take for you to pivot and what industry would you like to work on it instead? Get paid a regular salary. \n\n",
    "score": 126,
    "url": "https://reddit.com/r/sales/comments/1p1i381/if_you_could_pivot_your_career_out_of_sales_would/",
    "created_at": "2025-11-19T20:00:16.000Z",
    "num_comments": 254
  },
  {
    "id": "reddit-1i2t49k",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "\"If you want to make more, sell more!\"",
    "text": "Hit 132% of quota for 2024. 5 star performance reviews. Plus, I picked up a lot of other work due to headcount reduction and the fact that I had prior experience that could help out (e.g. CRM admin, marketing communications, website updates, etc.)\n\nSo, go into the comp plan presentation expecting a bump in OTE. \n\n\"We're freezing all salaries this year. If you want to make more, you need to sell more. And quota is going up.\"",
    "score": 125,
    "url": "https://reddit.com/r/sales/comments/1i2t49k/if_you_want_to_make_more_sell_more/",
    "created_at": "2025-01-16T16:41:49.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1hulct7",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Brag About Your Year",
    "text": "I feel weird talking to my friends who are hourly/salaried about what I was able to accomplish at work. They typically can't comprehend the shit and rollercoaster I went through. I have very few friends in sales so don't talk accomplishments very much.\n\nLet's make this post a safe space..brag about your successes this year, financially or personally.",
    "score": 106,
    "url": "https://reddit.com/r/sales/comments/1hulct7/brag_about_your_year/",
    "created_at": "2025-01-05T23:59:37.000Z",
    "num_comments": 262
  },
  {
    "id": "reddit-1hwbdzg",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "So long sales. I took an AM spot at my current company. Roast me if you like. ",
    "text": "I’m going from 10% commission on my sales to 5% growth &amp; a salary bump. The book of business the gave me has really nice up swing potential. I’ve spent nearly a decade in sales and for the first time in my life I don’t have to worry about the top of the funnel. \n\nI just wanna say I appreciate you all. I respect the grind and while I’ll still have aspects of sales in my job I finally get to say SEE YA LATER PROSPECTING. \n\n\n\n\n",
    "score": 103,
    "url": "https://reddit.com/r/sales/comments/1hwbdzg/so_long_sales_i_took_an_am_spot_at_my_current/",
    "created_at": "2025-01-08T04:27:28.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1k1kohb",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Haven’t checked my email all week",
    "text": "I don’t know. I just can’t do it.\n\nHave made posts here before of my boss treating us unfairly, publicly shaming us on team calls, and responding to every little mistake with passive aggressiveness and sarcasm.\n\nSmall company that is hurting financially right now. They just cut my salary by 50% and kept my commission rate the same. I can’t find the energy to open up my email and even check to see if anything has happened. This is bleeding into other parts of my life but going to keep this sales focused for now.\n\nHave basically taken this entire week off and don’t feel remotely rested or rejuvenated to get back to work.",
    "score": 103,
    "url": "https://reddit.com/r/sales/comments/1k1kohb/havent_checked_my_email_all_week/",
    "created_at": "2025-04-17T18:56:45.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1pjo8qm",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "What’s the most you’ve seen someone earn on a base salary below $75k?",
    "text": "- **Commission only roles don’t count**\n\n(Purely asking out of curiosity, not looking for career advice.)\n\nJust want to hear about the top performers in your office. \n\nI once worked in telecom, sales team was on a 8/8 split. $8hr + 8% adjusted sales volume. Dogsh*t pay honestly. \n\nTop seller was a reformed criminal. Apparently was a high level drug trafficker at a young age and turned his life around. He made $115k-$120k multiple times during my tenure. \n\nHe was one of the greatest I’ve ever seen at wheeling &amp; dealing. One of the only true “natural salesman” I’ve encountered. He couldn’t turn it off. \n\n\n\n",
    "score": 102,
    "url": "https://reddit.com/r/sales/comments/1pjo8qm/whats_the_most_youve_seen_someone_earn_on_a_base/",
    "created_at": "2025-12-11T04:17:36.000Z",
    "num_comments": 260
  },
  {
    "id": "reddit-1o9brop",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "Am I just bad at sales, or is this normal starting out?",
    "text": "Hey everyone,\n\nI could really use some advice from people in B2B SaaS.\n\nI’m a 22M who just graduated college and have been interviewing for BDR/SDR roles. Last week, I flew out for a 3-day work trial with one of the fastest-growing startups in the U.S. The goal was to book 3 demos a day and if you got close or showed progress, you’d probably get an offer.\n\nI covered my own flight, but they gave me a place to stay and covered food and rides. I went in confident, thinking I could handle it. But wow those 3 days were rough: 8AM to 7PM, back-to-back cold calls, trying to nail the pitch.\n\nThe first two days? Zero meetings. On the last day, I finally booked one and built up a list of interested leads… but it still wasn’t enough to get the offer.\n\nI left feeling pretty defeated. I’ve pitched my own startups to investors before and closed deals in other ways, but cold calling feels like a totally different game. They gave us a script and examples, but it still felt like being thrown into the deep end without real training.\n\nBefore I left, the hiring manager said if I could book 3 demos remotely this week with the leads I collected, we could revisit the conversation. Now I’m debating whether it’s worth grinding out calls from home for a shot at the job. It’s salary + commission, but it’s 6 days a week in-office and sounds intense.\n\nSo yeah… I’m just wondering is this what breaking into sales is supposed to feel like? Or am I just not cut out for this?\n\nEdit: The name of the company is Corgi ",
    "score": 98,
    "url": "https://reddit.com/r/sales/comments/1o9brop/am_i_just_bad_at_sales_or_is_this_normal_starting/",
    "created_at": "2025-10-17T20:08:50.000Z",
    "num_comments": 219
  },
  {
    "id": "reddit-1hnzuxv",
    "subreddit": "sales",
    "soc_codes": [
      "41-3091",
      "41-4011"
    ],
    "title": "After 2 months I finally made the jump!",
    "text": "I started in car sales (I know I know, don't judge) the beginning of this year in late January at 18/19. My goal was too build up some connections, and learn the basics of sales so that I could transition into b2b or a similar role as an sdr/bdr. Well my dealership let about half of their sales team go in October and November, me included, so I had to start applying to jobs. After two months of being unemployed, and my bank hitting zero, I finally landed a job as a full cycle sales representative at an established digital marketing/website design company! \n\n50k base salary with a 5k base raise every year up to 65k, 85k ote the first year, ramping up to 110k in year 3. It's the highest paying job I've ever had, I just wanted to share this as I'm super excited and proud, this community has helped me so so much in the process, so thank you all!\n\nEdit: Just want to shout-out u/longjackthat. You gave me the motivation to do this, thank you!",
    "score": 88,
    "url": "https://reddit.com/r/sales/comments/1hnzuxv/after_2_months_i_finally_made_the_jump/",
    "created_at": "2024-12-28T06:31:52.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1m6zlt6",
    "subreddit": "carsales",
    "soc_codes": [
      "41-4011"
    ],
    "title": "Scheduled a test drive. Car wasn't available",
    "text": "So I found a 2020 Mercedes I wanted to test drive. It's at the local Mercedes dealership. On the dealer's website, I clicked the link \"Schedule a test drive.\" Entered all my information and hit send. Got a text from the sales guy right away and we set a time for me to come in and test drive the car, which was in just a couple of hours. \n\nI arrive at the agreed-upon time, and dude says the car is up on the rack in the service department, but he can show me the car. It might be ready for a test drive later this week. I told him my appointment was to test drive it now, and he said we could go look at it. I thanked him for his time and left. \n\nThat was a frustrating experience. ",
    "score": 36,
    "url": "https://reddit.com/r/carsales/comments/1m6zlt6/scheduled_a_test_drive_car_wasnt_available/",
    "created_at": "2025-07-23T04:14:46.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1pjxsxv",
    "subreddit": "carsales",
    "soc_codes": [
      "41-4011"
    ],
    "title": "Leaving the car business",
    "text": "Has anyone left the car business and if you have what careers or venture did you get into ?\n\nI’ve been in the business for 14yrs make  6 figs but considering leaving, starting to feel burnt out.",
    "score": 8,
    "url": "https://reddit.com/r/carsales/comments/1pjxsxv/leaving_the_car_business/",
    "created_at": "2025-12-11T13:41:42.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1piq9uq",
    "subreddit": "carsales",
    "soc_codes": [
      "41-4011"
    ],
    "title": "Draw Increase Due to Low Sales/Commisions",
    "text": "I’ve been in car sales for about 4 months now. It’s my first job in sales, and overall I’ve been doing pretty well, usually hitting quota and a couple of times I’ve even gone well over it. My managers have said that’s solid for someone new, so I’ve felt good about how things have been going.\n\nThis month’s been a different story, though. We’re a third way through the month, and I haven’t sold a single car yet. My manager says it’s just a weirdly slow time and that things will pick up, but I’d be lying if I said it wasn’t getting to me a little.\n\nHere’s the part that’s got me thinking: they just put me on a higher weekly draw that I don’t have to pay back if I don’t out-earn it. It’s enough to live on comfortably, not extravagant, but steady, and honestly it’s a relief while I’m in this dry spell. The thing is, they’re not offering this to anyone else, just me. I am also not the only one struggling and doing far better than some others.\n\nSo I’m wondering if this is normal. Do dealerships ever do this to help someone through a slow patch or keep them around? Or could it mean something else is going on behind the scenes?\n\nI’m definitely not complaining, it’s nice to have that stability, but I’m curious what others think. Has anyone else seen a setup like this before?",
    "score": 7,
    "url": "https://reddit.com/r/carsales/comments/1piq9uq/draw_increase_due_to_low_salescommisions/",
    "created_at": "2025-12-10T02:01:10.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1nebblr",
    "subreddit": "carsales",
    "soc_codes": [
      "41-4011"
    ],
    "title": "Rate my payplan I'm new",
    "text": "Rate my pay plan just started in a new dealership, it's also 25% commission from the front gross profit and 10% from the finance gross profit. Thank you",
    "score": 7,
    "url": "https://reddit.com/r/carsales/comments/1nebblr/rate_my_payplan_im_new/",
    "created_at": "2025-09-11T15:08:11.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1p7owny",
    "subreddit": "carsales",
    "soc_codes": [
      "41-4011"
    ],
    "title": "Recently let go of first sales job",
    "text": "Hello everyone. So I was recently let go from my first auto sales job. I am now looking to apply at other dealerships and I’m not sure if I should include in my résumé that I have auto sales experience. given the fact that I was let go from my previous job. I was let go during the initial 90 days training period. When I was let go, I wasn’t given much other than “ we can tell that this isn’t gonna work for you”. I did enjoy the sales process and connecting with customers while guiding them through a huge purchase. Also, the possibility of earning a great living. My highest earning pay was 5500 before taxes for 2 weeks. This was for two split deals and six individual sales that I did during my second month. In my third month I had zero sales which is why I’m thinking I was let go. I did leave respectfully and told the sales management team that I appreciated the opportunity. Now my question is should I include this work history moving forward in my resume applications and interviewing process or is it better to leave it out? Any feedback would be greatly appreciated. Thank you, everyone!",
    "score": 6,
    "url": "https://reddit.com/r/carsales/comments/1p7owny/recently_let_go_of_first_sales_job/",
    "created_at": "2025-11-27T01:00:25.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1hwmr0m",
    "subreddit": "carsales",
    "soc_codes": [
      "41-4011"
    ],
    "title": "First day selling on the floor. ",
    "text": "Yesterday was my first day getting to take phone calls and take ups. I sold two cars and feel like this profession is my calling! It was a back and forth over the phone battle with one customer who was honestly just rude and demanding, but was defended infront of the entire dealership when my head sales manager stood up for me and almost kicked him out, the customer ended up apologizing and begging to be sold the car after refusing to pay $150 for a new title that he lost. The second customer was a genuine honest man who was so patient and easy throughout the process. I still struggle with the math of adjusting finance options as numbers really confuse me, but I know ill only get better and learn from the entire experience. \n\nWorking to change the narrative of the “pushy salesman” and give people an experience worth having. Its only up from here.",
    "score": 5,
    "url": "https://reddit.com/r/carsales/comments/1hwmr0m/first_day_selling_on_the_floor/",
    "created_at": "2025-01-08T15:28:30.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1pkfg8n",
    "subreddit": "carsales",
    "soc_codes": [
      "41-4011"
    ],
    "title": "I got hired at a new, bigger dealership",
    "text": "Recently I got hired a Toyota dealership as a sales person (apparently they are the number 1 or 2 grossing dealership  in the southeast). I have 2 years experience in car sales and really crushed it at my last dealership (which was also Toyota) selling on average between 18 and 20 cars a month with over 11 sales people on the floor (this was also with mostly getting KBB ICO leads that were all garbage so I had to prospect most of my leads myself). I also got offered a position at Autonation Honda but turned that down, hopefully I made the right choice there. \n\nThis new dealership feels like a promotion to me, with higher targets and with more sales people (20 total). Leads seem decent and there's a high volume of inquiries daily. Their pay plan is also decent. \n\nI'm writing this because I'm a bit nervous and want to put my mind at ease. The minimum is 14 cars a month to just keep your desk (apparently some jackass got into an argument with a GSM about not producing and he set that target out of spite). I know I can crush it, I'm just worried because it's higher pressure than I'm used to. I'm great at consistently calling customers and my follow up game is top tier but I still feel a little nervous.\n\nHas anyone worked for a similar dealership and what was your experience?  Any advice to help me put my one at ease? Lol",
    "score": 5,
    "url": "https://reddit.com/r/carsales/comments/1pkfg8n/i_got_hired_at_a_new_bigger_dealership/",
    "created_at": "2025-12-12T01:49:38.000Z",
    "num_comments": 6
  }
]