[
  {
    "id": "reddit-1js4xaw",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "My students are getting deported",
    "text": "I have three students in my class from Haiti. I found out yesterday that their protected status is being revoked and they have two weeks to leave the US. \n\nThese kids are seniors, they all have jobs and are just out here to survive. Now they are forced to go back to Haiti where they said it's not safe for them. I wanted to see them graduate, now they'll never be able to walk across the stage. I've been crying for hours yesterday but there's nothing I can do about it. \n\nAnd it hurts me more that the majority of my schools teachers voted for this (super red state). It's disgusting. \n\nWhat am I supposed to tell the class one they notice our students are missing? We aren't allowed to talk politics really, but I can't lie to them. I'm 22, it's my first year teaching, I never thought I'd have to encounter a situation like this. America needs to do better for our children.\n\nEdit: Thank you all for the support, I think my students need it more than I do but I appreciate it none the less. \n\nSome comments mentioned the idea of setting up a fund. I LOVE the idea, but I'll be honest I have no idea how to put something like that in action. If anyone knows how to create something like that please reach out. Thank you again. ",
    "score": 41795,
    "url": "https://reddit.com/r/Teachers/comments/1js4xaw/my_students_are_getting_deported/",
    "created_at": "2025-04-05T14:39:54.000Z",
    "num_comments": 4709
  },
  {
    "id": "reddit-1miopbb",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "It’s over.",
    "text": "Started in service today at my school. It has happened, we had slides directing us that we have to hang the Ten Commandments in our classrooms by Thursday. In addition Anti-Communism TEKS have been added to our history curriculum and our school district cannot sponsor any student clubs based on gender identity or sexual orientation, as well as we cannot call students by any names but the names on their birth certificate. This is fucking shameful man ",
    "score": 37764,
    "url": "https://reddit.com/r/Teachers/comments/1miopbb/its_over/",
    "created_at": "2025-08-05T23:20:45.000Z",
    "num_comments": 1643
  },
  {
    "id": "reddit-1kodco4",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "14 year old 7th grader still can't read. No answer from mom all year until now...",
    "text": "I have a student who is 14 in the 7th grade. He's scoring below literate on all his tests. He won't even do work where we write an essay together and all he has to do is copy off the board. \n\nWe were working on something and his friend was trying to help him (read--let him cheat). He said \"I don't wanna\" and I said \"If you don't do the work here in may, you'll work in Summer School this June.\" \n\nNow mom is finally able to call the school because apparently this is embarrassing to her son. Not the fact that he can't read, not the fact that he's failing all his classes, not the fact that he can't do single digit addition and subtraction without counting his fingers...the fact that I told him not doing work might lead to Summer school. \n\nI'm so sick of these sorry ass parents, and even MORE sick about the fact that the scores from kids with sorry ass parents follow me and not them. ",
    "score": 28623,
    "url": "https://reddit.com/r/Teachers/comments/1kodco4/14_year_old_7th_grader_still_cant_read_no_answer/",
    "created_at": "2025-05-16T22:11:54.000Z",
    "num_comments": 645
  },
  {
    "id": "reddit-1nhb7ja",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Many kids cannot do basic things anymore",
    "text": "I’ve been teaching since 2011, and I’ve seen a decline in independence and overall capability in many of today’s kids. For instance: \n\nI teach second grade. Most of them cannot tie their shoes or even begin to try. I asked if they are working on it at home with parents and most say no. \n\nSome kids who are considered ‘smart’ cannot unravel headphones or fix inside out arms on a sweater. SMH\n\nParents are still opening car doors for older elementary kids at morning drop off. Your child can exit a car by themselves. I had one parent completely shocked that we don’t open the door and help the kids out of the car. (Second grade) \n\nMany kids have never had to peel fruit. Everything is cut up and done for them. I sometimes bring clementines for snack and many of the kids ask for me to peel it for them. I told them animals in the wild can do it, and so can you. Try harder y’all. \n\nWe had apples donated and many didn’t know what to do with a whole apple. They have never had an apple that wasn’t cut up into slices. Many were complaining it was too hard to eat. Use your teeth y’all! ",
    "score": 26265,
    "url": "https://reddit.com/r/Teachers/comments/1nhb7ja/many_kids_cannot_do_basic_things_anymore/",
    "created_at": "2025-09-15T03:26:12.000Z",
    "num_comments": 3242
  },
  {
    "id": "reddit-1parfhf",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "I started doing math times tables in homeroom. Now everyone is trying to switch into my homeroom.",
    "text": "I have a high school senior homeroom. I don’t even remember how it started, but I was appalled that one of my students didn’t know a basic math fact: something like 2 * 7.\n\nSo I started filling homeroom with quizzing students on times tables, giving them minute worksheets, etc. \n\nI then went into doing the same with telling time, cursive, and other really basic shit.\n\nBut now there’s a problem. Word has gotten out. I have students trying to skip their homeroom to go to mine, and parents are emailing me trying to see if they could get their kid into my homeroom. \n\nSo apparently I teach the 3rd grade….\n\nEDIT: whoa, this BLEW UP. Crazy. For those of you saying this is false, I am not trying to imply that this is every student; I am trying to show that this is a problem. There's way too many comments to reply to though, ha! ",
    "score": 22896,
    "url": "https://reddit.com/r/Teachers/comments/1parfhf/i_started_doing_math_times_tables_in_homeroom_now/",
    "created_at": "2025-11-30T19:43:57.000Z",
    "num_comments": 1116
  },
  {
    "id": "reddit-1ny99za",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Student prompted ChatGPT to write about \"homeliness\" and not \"homelessness.\"",
    "text": "The quarter is over. The grades are due. \n\nOne of the seniors turned in an English paper about reducing homeliness when the paper prompt was about reducing homelessness. \n\nEven ChatGPT or whatever AI model called them out.\n\n&gt;Certainly! Here’s a sample academic-style paper on homeliness (I assume you meant “homeliness,” and not “loneliness”).\n\nYep, that was on the page. \n\nI was sure the Latin teacher was going to fall over and die from laughing so much. \n\nI feel like the Senior English teacher should give two zeroes. The first one should be for plagiarism. The second one should be for whatever this was.\n\nI also taught that student for chemistry years ago and know just how lazy she can be because she hates writing. I just didn't expect her to be so inept that she did this. ",
    "score": 22034,
    "url": "https://reddit.com/r/Teachers/comments/1ny99za/student_prompted_chatgpt_to_write_about/",
    "created_at": "2025-10-04T23:47:32.000Z",
    "num_comments": 941
  },
  {
    "id": "reddit-1jlwrw7",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "We are doomed",
    "text": "My school went into a lockdown because allegedly somebody had a gun. The class I was covering started going wild (7th grade so you know they’re some of the worst.) I was telling them to sit down, but being calm won’t working, so I ended up yelling at them. Threatening to get the principal and everything. They would not be quiet. The regular teacher came in, and she couldn’t get them to be quiet either. THEN the principal came in and they STILL weren’t all the way quiet. \n\nAnd this was a real lockdown, not a drill. \n\nThe lockdown was lifted thank God, but if it was an active shooter I can’t imagine what would’ve happened. \n\n\nEdit: I’m actually baffled at how some people are blaming the teachers for the kids behavior… that’s insane.\n\n\nEdit 2: we had a child bring a gun to school on Friday with a thirty round. Nobody was hurt, and from what I heard (I was at an event for the school and had literally just left) the students were well behaved. \n",
    "score": 20045,
    "url": "https://reddit.com/r/Teachers/comments/1jlwrw7/we_are_doomed/",
    "created_at": "2025-03-28T14:47:15.000Z",
    "num_comments": 1250
  },
  {
    "id": "reddit-1oviirp",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "These kids are being raised by parents with zero boundaries",
    "text": "An interaction I had with a 15 year old today:\n\nHim: \"So why were you off yesterday?\"\n\nMe: \"I had a doctor's appointment. But it's not really any of your business.\"\n\nHim: \"Well, just a suggestion, but it might be a good idea to schedule those things in such a way that they don't require taking time off work. Just saying.\"\n\nI just ignored it and walked away. But this is routine with this manipulative shit. Is he disruptive? Not at all, but I would gladly take that over his smarmy, unwanted commentary that I receive on a daily basis. Where does a 15 year old even get the gumption to talk to an adult that way? I would have been mortified to speak to an adult in such a manner when I was his age.",
    "score": 19073,
    "url": "https://reddit.com/r/Teachers/comments/1oviirp/these_kids_are_being_raised_by_parents_with_zero/",
    "created_at": "2025-11-12T21:44:47.000Z",
    "num_comments": 2181
  },
  {
    "id": "reddit-1nin32g",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "This is the single most terrifying subreddit on this site",
    "text": "I can't understand what is happening at the parent level. I don't know if it's just the parents being overwhelmed with work/finances, social media, the phones themselves, or all of the above, but we are witnessing the intellectual and behavioural destruction of a generation. \n\nI struggle to come up with an answer, except that this is the fault of the parents. When children refuse to work without consequences, they become adults who are not worth hiring.\n\nWhen children are not held to any standards, they'll be unable to meet any when they're adults. \n\nI see high school teachers listing all the things their students can't do, and most of them are simple tasks any decent parent should be teaching their child. \n\nMy 11 year old autistic grandson can do most everything on those lists. He can read and write, get dressed and ready for school, knows his address and Mom's phone number. (On the other hand, he used to give me lengthy dissertations on trains. Do you know how many kinds of cabooses there are? He does.)\n\nHis parents are regular working class people. They can do it, with two boys, two jobs, and all the rest of the crap life tosses their way. \n\nWTF is wrong with the current crop of parents? Why are they so ineffective? Don't they understand how they're hurting their own children. ",
    "score": 18674,
    "url": "https://reddit.com/r/Teachers/comments/1nin32g/this_is_the_single_most_terrifying_subreddit_on/",
    "created_at": "2025-09-16T16:58:53.000Z",
    "num_comments": 2303
  },
  {
    "id": "reddit-1k5n20c",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "I interviewed a retired principal today and she said something that made my head spin.",
    "text": "I'm a former middle school teacher who left the profession due to insane parents and useless administration. I am hiring for a part-time position at my current job and today interviewed a former middle school principal. She spoke frequently and highly of her 35-year career in education.\n\nOne of my interview questions is about handling conflicts in the workplace. Her answer was that she never really had conflicts in the workplace. She said her job as a principal was to \"make sure the parents are happy first because when they're happy, the kids are happy and I'm happy.\"\n\nI couldn't roll my eyes hard enough. As annoying as that answer was, it was validation of my feelings towards school administration overall.",
    "score": 15938,
    "url": "https://reddit.com/r/Teachers/comments/1k5n20c/i_interviewed_a_retired_principal_today_and_she/",
    "created_at": "2025-04-23T01:19:16.000Z",
    "num_comments": 404
  },
  {
    "id": "reddit-1kqqb0r",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Student Teacher Has Decided To Not Teach",
    "text": "So we have a student teacher who is currently working with a math teacher. She was in the break room with us just chatting and one of the staff members asked if she had a teaching job lined up for the next school year \n\nShe very calmly stated that after her experience as a student teacher, she has no desire to work in the teaching profession. She plans to go ahead and get a job selling cars working with one of her friends. She says the money's better, the hours are better, and you don't have to worry about being attacked by stupidness. \n\nSmart kid.",
    "score": 15931,
    "url": "https://reddit.com/r/Teachers/comments/1kqqb0r/student_teacher_has_decided_to_not_teach/",
    "created_at": "2025-05-19T23:19:52.000Z",
    "num_comments": 568
  },
  {
    "id": "reddit-1pjpuq6",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Things my students have destroyed this year so far",
    "text": "Tagged as humor but I actually don't find it funny at all.\n\n\nAll my floor lamps. They hate the harsh overhead fluorescent lights and so do I. Most \"cool\" teachers have warm lamps. I did, too... Until I took a sick day a couple of months ago. Guess what? Harsh fluorescent lights for the rest of the year. \n\n\nOne of those box plug-ins that provides additional outlets (not a power strip; a... power box?). Whole thing was busted and a fire hazard. Was scary to remove it.\n\n\nEvery glue stick. They rarely last more than one class day. Sometimes not even one period.\n\n\nCountless pens and pencils.\n\n\nA thesaurus, by writing the N-word on it (on a day I was out sick).\n\n\nThey constantly erased something written in multiple colored ink in nice handwriting on a whiteboard by the door (it was just a list of daily routines so they know which thing to do which day). It now says \"the next time someone erases this, we will do XYZ activity every day instead\" (the one they hate).\n\n\nOh, also... I came back from a sub day this week and someone had hidden an open carton of milk and a half eaten sandwich behind the books on a shelf. Thankfully I caught it before it smelled up the room. \n\n\n\"Mr., will you buy new lamps? Why don't you buy snacks anymore for us? Why are there never any tissues?\"\n\n\nBecause screw you, honestly. Not wasting another penny on y'all other than 98 cent packages of pencils. Which, by the way, you guys go through like hot cakes. Just keep the dang pencil in your backpack? I've given you like 50 each.\n\n",
    "score": 15659,
    "url": "https://reddit.com/r/Teachers/comments/1pjpuq6/things_my_students_have_destroyed_this_year_so_far/",
    "created_at": "2025-12-11T05:45:08.000Z",
    "num_comments": 1141
  },
  {
    "id": "reddit-1mvfv72",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Pride flag on my desk didn’t even survive until the first day of school. I hate what we’ve become.",
    "text": "My tiny pride flag, the only LGBTQ+ item in my room didn’t even make it to the first day of school before someone complained. The principal told me to take it down, despite being the GSA advisor and having a flag like this on my desk for the last ten years. \n\nAt the end of last year, all of the Safe Space stickers I worked so hard to get teachers around the school to adopt came down and now this. It’s enough to make me want to quit before the year even has started. 😞 ",
    "score": 14795,
    "url": "https://reddit.com/r/Teachers/comments/1mvfv72/pride_flag_on_my_desk_didnt_even_survive_until/",
    "created_at": "2025-08-20T14:09:47.000Z",
    "num_comments": 595
  },
  {
    "id": "reddit-1mykyqg",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "The Boys Aren't Alright",
    "text": "I teach high school in the US, mostly freshmen. As I looked at my class rosters this year, I expected more of the same: mostly unfamiliar names of students coming up from the middle school and the occasional surname I recognized as possible relatives of former students I've had prior. But, this year especially, I saw something I've only seen sparingly in my twenty-some years as an educator. Each of my classes contained three to five students, twelve to fifteen total, whom I had last year. As I witnessed these students' self-discipline, work ethic, motivation, and in some cases, attendance from last year, I knew that they had failed first semester. They did not attend summer school. And, for the first time since I've been around, the number of credit recovery classes was greatly reduced due to budget cuts. So these students had to retake my class for graduation credit. \n\nThen something dawned on me that should should have been apparent prior: _Every single one of those dozen-or-so repeaters were boys._ 100%. Not a single young lady had to retake freshman geography. But about fourteen boys, give or take, did. Fourteen out of fourteen. All boys. The implication to me was apparent: this social crisis among boys is is something we can't afford to ignore any longer.\n\nIf you teach, you likely aren't surprised by this. I'm sure by now you've heard that young men are experiencing somewhat of a crisis in regards to education, workforce readiness, success outcomes, and ultimately, quality of life. Numerous studies and publications have been signaling the alarm for over a decade. I'm unsure of this is a uniquely American phenomenon, or Western, or global (maybe educators outside the US can report on this). The resulting impact on society will reach into everyone's lives, regardless if they have children or not. Crime will certainly increase. The social and political effects have already caused incalculable damage to society and will only increase until we figure this out.\n\nSo, why is this happening? What can we do to reverse it? Both as a society, and through smaller measures as individual educators? What are your thoughts or stories surrounding this phenomenon?\n\nThanks for reading.",
    "score": 14698,
    "url": "https://reddit.com/r/Teachers/comments/1mykyqg/the_boys_arent_alright/",
    "created_at": "2025-08-24T03:18:01.000Z",
    "num_comments": 2654
  },
  {
    "id": "reddit-1hul776",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Gaslighting a Student (AKA The Best Lesson I Ever Taught)",
    "text": "I have a student, we’ll name him John. For the past few months, John has been the bane of my existence. Talking nonstop, never seated, needs to be redirected constantly, submits almost no work, on his phone constantly, and when confronted about his test performance, blames me for “not teaching that” (spoiler: I did teach that). \n\nThe lesson: Teach John what it’s like to teach John. So that he didn’t fail the quarter, upon the request of his mother (and admin forcing my hand), I gave an extra credit project. At first I wasn’t too happy about this, but I quickly realized it was a wonderful opportunity. I made him present his project to me and a group of other teachers. During this presentation, my colleague was on his phone the whole time. Myself and another colleague talked over John multiple times. The fourth interrupted with “sorry John, I just need to run to the bathroom really quickly,” just to come back in and interrupt with more questions. To his credit, John powered through the presentation. At the end, I turned to him and asked, “How can I give you credit for this when you didn’t mention X, Y, or Z?” (All things he did, in fact, mention.) “You weren’t very clear about X” (There was a whole slide about X.) We went back and forth, with John getting increasingly frustrated defending himself and complaining about how we weren’t a very good audience. He was turning red explaining that if we just *listened* and let him present, we would’ve seen these things. Interesting. After a few minutes, the realization hit. While he didn’t *say* anything, the lightbulb that went off in his head said everything I needed to hear. \n\nOf course, I’ll grade John on the actual work he turned in, not the presentation. (And I did tell him this, I’m not evil.) But, something tells me next quarter will be a lot smoother, for both me and John.  Here’s to hoping. \n\nFOLLOW UP: \nHere’s the long awaited follow up. In hindsight, I probably should’ve waited a little more than a month to update. We’ve had quite a few snow days, so it doesn’t feel like I’ve had a good amount of actual class time to accurately assess. With that being said, I have to give John a good amount of credit. There has been a fair amount of measurable change. He certainly has not become the perfect student overnight, he still interrupts from time to time, and definitely isn’t seated throughout the whole class period. \n\nWhat has changed though, is John’s ability to read the room, show empathy to his teachers, and self correct. Just this week alone, I can’t count the number of times he has started to behave like John, and without me saying anything, self-corrected. He’ll usually do this will a comment like “I’m driving you insane, aren’t I Ms. MagesticAvocado? My bad. I’ll lock in.” After that point, he’s generally been able to do as he says he will. Considering the fact that these interactions used to derail him for an entire block, I’m happy with this result. He hasn’t received a single write up since his presentation for me, and he’s only been late on one assignment, which was eventually completed to the best of his ability.  While we still have work to do, he’d leaps and bounds ahead of where he was when I met him. And I’m optimistic moving forward. My only hope is things stay this way.",
    "score": 13744,
    "url": "https://reddit.com/r/Teachers/comments/1hul776/gaslighting_a_student_aka_the_best_lesson_i_ever/",
    "created_at": "2025-01-05T23:52:25.000Z",
    "num_comments": 754
  },
  {
    "id": "reddit-1o5mot2",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Sick kids at school = sick teachers at home. When will parents understand?",
    "text": "Wednesday morning, one of my students came in looking visibly pale. I asked if he was feeling okay, and he told me he had thrown up the night before. Forty minutes later he vomited in the classroom. We sent him home immediately, called the parents. Their response? “He only threw up once, last night. We thought it was just something he ate.”\n\nThe next day, two more students started complaining about stomach aches. Both ended up going home after vomiting.\n\nBy Friday night, it hit me. I spent the night hugging the toilet, completely wrecked. Two full days unable to keep anything down, both ends. And to top it off, now my husband has it too. He’s currently running back and forth between bathroom visits.\n\nAt this point, we’ve got at least 8 kids out, two teachers down, and myself. All because some parents thought “he was fine now.”\n\nThis isn’t just a complaint, it’s a plea: If your child is vomiting, has diarrhea, a fever, or any signs of sickness, please, do not send them to school.\n\nWhat’s worse is… this isn’t the first time. And it won’t be the last. Does this happen to you too? Do you usually catch whatever your students bring in?",
    "score": 13688,
    "url": "https://reddit.com/r/Teachers/comments/1o5mot2/sick_kids_at_school_sick_teachers_at_home_when/",
    "created_at": "2025-10-13T15:22:18.000Z",
    "num_comments": 1330
  },
  {
    "id": "reddit-1mnufyf",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Today was our back to school lunch/raffle for staff and I won a car",
    "text": "Today we had our annual back to school lunch for staff. They do a raffle which normally consists of smalls prizes like $10 gift cards, T shirts, coffee mugs, etc. Previous years have had 5 or so winners so no big money was spent. \n\nAt the beginning of the raffle, our superintendent mentioned this year we would have a “big prize” that may or may not be a car. We were all super confused because our district? Giving away a car? The same district the starts teachers at $45,000/year??? No way. \n\nSo he does the drawings for the smaller prizes, then comes the “big prize” drawing and this time he mentions it **is** a car. My name gets picked! They have me come up to the front and say they are bringing the car out now. I’m super nervous and excited because wtf?! Did I just win a car?! This is definitely needed. They bring out the car and it is a…a fucking remote control car for a toddler, the ones they can ride in. \n\nWhat. The. Fuck. I’ve had time to process it and so many things are running through my mind. \n\n1. What a fucking slap in the face to make me and all of us believe there was a car in the drawing. To make me believe I won it for that minute. \n\n2. Why is this even in the drawing?? I am a 5th grade teacher what use could I possible get out of a remote control car meant for toddlers! I have a child that is way too big for it so it’s not like I could give it to him. But even if I had a toddler, why is the “big prize” meant for teachers for a toddler?!? This is all so weird. \n\n4. I looked up the prices of this remote control car and they go for like $200 on Amazon. Why not just make the prize $200?!? I don’t mean to sound ungrateful, but what is the point in this?! \n\n5. What the fuck?! I have never felt so disrespected in my career before. I’m so furious. \n",
    "score": 11299,
    "url": "https://reddit.com/r/Teachers/comments/1mnufyf/today_was_our_back_to_school_lunchraffle_for/",
    "created_at": "2025-08-12T00:42:53.000Z",
    "num_comments": 733
  },
  {
    "id": "reddit-1mmmi4x",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Wife changed schools and went with a new camping theme so I made her a cabin porch to read on for her kids.",
    "text": "People in this world can be very generous towards such an amazing profession. I reached out to local contractors and they let us take their framing scrap wood for free, another saw mill donated the cabin sides, antique shop donated the lantern, shelving came from a local supplier.\n\nLocal cabin builder donated 5lbs of screws. \nA lot of time, but minimal costs to put something in that will hopefully make her new class come in smiling on Monday :) \n\nShe also gives them flashlights to read with the lights off and has a star projector for her ceiling. Her previous kids LOVED reading with the flashlights, so we’re excited to give them a camping theme. \n\n(Fire Marshal approved 👍🏻) ",
    "score": 9598,
    "url": "https://reddit.com/r/teaching/comments/1mmmi4x/wife_changed_schools_and_went_with_a_new_camping/",
    "created_at": "2025-08-10T16:10:29.000Z",
    "num_comments": 318
  },
  {
    "id": "reddit-1p2k3hj",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "We did it folks, we solved bullying!",
    "text": "At our (mandatory, 6am) PD this morning, our discipline team announced that they’d *finally* come up with a solution to the bullying problem. They asked us for ideas weeks ago, I suggested a cellphone ban, harsher penalties for repeat offenders, no longer allowing students to bring in $800 Gucci tennis shoes, all the classics. \nBut of course, those ideas risk parents getting offended, and we can’t have that! \nSo instead, they’re banning the use of slang in school. Words like bruh, cap, 6 7, ect. \nWhose job is it to enforce this? Teachers of course! What are the consequences for using a banned word? No idea! \n \nSo glad they get paid 5X my salary for their genius insights. \n \n \n \nETA: this is a middle school in a rural community where there are only a handful of “rich kids”, the $800 sneakers thing is a bit of an us problem. It’s been a weird trend where some boys from wealthy families have been bringing in their luxury shoes to PE then making a huge deal about getting “John/Jane” germs on them. It’s not about the other kids’ jealousy. ",
    "score": 5817,
    "url": "https://reddit.com/r/Teachers/comments/1p2k3hj/we_did_it_folks_we_solved_bullying/",
    "created_at": "2025-11-21T00:28:41.000Z",
    "num_comments": 313
  },
  {
    "id": "reddit-1ju1q33",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "It’s been 20 years and I’ll never forget this.",
    "text": "I’m 37 years old. And this one moment has always stuck with me. This one moment that I witnessed at 17 years old and I will never forget. \n\nMy friends and I got to art class early. Our teacher was seated at one of the tables working on something. We went over to see what she was doing. She was using a glue gun to draw the outline of various fruits. Banana, apple, blueberry, grapes, watermelon, cherries. We asked her what she was doing. “Just watch” she told us. Class was starting. Students began to file in. We had a new student in class. Her name was Hailey and she was blind. Our teacher sat her down and put the paper she had been working on in front of her. Then she gave her a box of scented markers. Hailey was able to feel the shapes and color them in by smelling and finding the right marker. She was so excited about this project. She looked up and was like 🥹”art is such a joy to me” \n\nIt was a beautiful moment, thanks to an amazing teacher. \n\nAnd I will never forget it.",
    "score": 3786,
    "url": "https://reddit.com/r/teaching/comments/1ju1q33/its_been_20_years_and_ill_never_forget_this/",
    "created_at": "2025-04-08T01:18:06.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1mxd68j",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "I’ve always taught middle school and recently transitioned to high school! One of my new coworkers made a comment in passing that my room looked a little “middle school.” Please be honest with me!",
    "text": "I tried to catch myself by not putting voice level posters and some of the other things I typically do! I also teach three subjects so I was trying to make sure I had the ability to display all of the student work equally! ",
    "score": 3639,
    "url": "https://reddit.com/r/teaching/comments/1mxd68j/ive_always_taught_middle_school_and_recently/",
    "created_at": "2025-08-22T17:43:16.000Z",
    "num_comments": 1438
  },
  {
    "id": "reddit-1mv1503",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "My First Time Setting Up a Classroom. My Theme Was \"Café.\"",
    "text": "So this was my first time making a classroom.  I based it on the cafes and Starbucks that I used to study at when I was in college.  I'm a minimalist, so not a lot of signage (minus my bins for homework, certain supplies, etc.).  I felt like too much would take focus away from where it mattered...my board in the front or wherever I'm pacing around the room during demonstrations.\n\nThere's extra spaces for team studies and small groups, and I arranged my desks for mini Socratic seminars for teams, with the tables able to be pushed together for group projects and labs.\n\nOverall, I was pretty proud of it since I basically had to design and construct it myself over 3 days.  Back to School Night apparently made my classroom the most \"goated\" place in the school (direct quote from my students).   Some teachers even asked if we could have coffee there during breaks and Professional Development Sessions 😅\n\nThoughts?",
    "score": 3113,
    "url": "https://reddit.com/r/teaching/comments/1mv1503/my_first_time_setting_up_a_classroom_my_theme_was/",
    "created_at": "2025-08-20T01:16:40.000Z",
    "num_comments": 308
  },
  {
    "id": "reddit-1njnhe5",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Adult learners changed how I think about education",
    "text": "A nurse comes in straight from a double shift, drops her bag, and asks if we can record the role-play so she can rewatch on her break tomorrow. No grades on the line, only purpose.\n\nIn a leadership workshop, a quiet guy runs a feedback exercise and halfway through switches to a real script he needs for Monday’s meeting. The room leans in; suddenly it isn’t \"practice\", it’s work.\n\nOn Zoom, someone realizes a 12-week certificate is enough leverage to ask for new responsibilities. The chat lights up with drafts of how to phrase the email.\n\nI’ve been taking courses myself through the UK College of Personal Development, and what’s striking is how different the energy feels compared to traditional education. Adults don’t waste time: they apply fast, cut filler, and hold the room accountable.\n\nIf you teach K-12 or higher ed, what’s one habit from adult education you’d import into your class tomorrow?",
    "score": 3034,
    "url": "https://reddit.com/r/teaching/comments/1njnhe5/adult_learners_changed_how_i_think_about_education/",
    "created_at": "2025-09-17T19:55:20.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1id5yii",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Why aren’t parents more ashamed?",
    "text": "Why aren’t parents more ashamed?\n\nI don't get it. Yes I know parents are struggling, yes I know times are hard, yes I know some kids come from difficult homes or have learning difficulties etc etc\n\nBut I've got 14 year olds who can't read a clock. My first years I teach have an average reading age of 9. 15 year olds who proudly tell me they've never read a book in their lives. \n\nWhy are their parents not ashamed? How can you let your children miss such key milestones? Don't you ever talk to your kids and think \"wow, you're actually thick as fuck, from now on we'll spend 30 minutes after you get home asking you how school went and making sure your handwriting is up to scratch or whatever\" SOMETHING!\n\nSeriously. I had an idea the other day that if children failed certain milestones before their transition to secondary school, they should be automatically enrolled into a summer boot camp where they could, oh I don't know, learn how to read a clock, tie their shoelaces, learn how to act around people, actually manage 5 minutes without touching each other, because right now it feels like I'm babysitting kids who will NEVER hit those milestones and there's no point in trying. Because why should I when the parents clearly don't?",
    "score": 2976,
    "url": "https://reddit.com/r/teaching/comments/1id5yii/why_arent_parents_more_ashamed/",
    "created_at": "2025-01-29T22:01:43.000Z",
    "num_comments": 686
  },
  {
    "id": "reddit-1neig1u",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Help!  HS parents don’t believe in deodorant.",
    "text": "Okay, folks.  I’ve been teaching for 23 years and this is a new one for me.  I teach a sharp, sweet, hardworking girl who is almost 17 and smells absolutely awful.  Other kids have started to complain about the general body odor scent in that part of the room.\n\nParents have been contacted in the past and they don’t believe in deodorant or pretty much any preventative/counteractive measures.  It’s not neglect - it’s a choice.  These parents are college educated folks who just for some reason think this is the best route to go.\n\nHave any of you faced this?  What did you do?  What can I do?  I’ve already got her in a back corner of the class near a friend who has apparently learned to deal with it, but other people in that part of the room are less tolerant.\n\nI’d appreciate any thoughts, advice, or commiseration you can offer.",
    "score": 2955,
    "url": "https://reddit.com/r/teaching/comments/1neig1u/help_hs_parents_dont_believe_in_deodorant/",
    "created_at": "2025-09-11T19:41:30.000Z",
    "num_comments": 639
  },
  {
    "id": "reddit-1igf368",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Ed. Dept. Employees Placed On Leave For Attending DEI Training",
    "text": "Dozens of employees who attended a diversity training course that former Education Secretary Betsy DeVos encouraged during President Donald Trump’s first administration have been placed on paid leave as part of Trump’s targeting of DEI programs,\n\nThey would continue to receive their full salaries and benefits and wouldn't be required to do any work-related tasks. \n\nIt's amazing how quickly the new regime is trying to push out employees. At this rate, there will be 12 people working for the federal government by the end of the month.\n\nhttps://www.nbcnews.com/politics/donald-trump/union-official-education-department-employees-leave-dei-training-rcna190337",
    "score": 2863,
    "url": "https://reddit.com/r/Teachers/comments/1igf368/ed_dept_employees_placed_on_leave_for_attending/",
    "created_at": "2025-02-03T02:51:49.000Z",
    "num_comments": 105
  },
  {
    "id": "reddit-1ndrpzz",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "How are we handling Charlie Kirk in school the next day ?",
    "text": "It’s currently 11pm here in the UK, and I’ve just received an email from our Director of Secondary from our multi academy trust  outlining how we should handle tomorrow’s discussions around the news of Charlie Kirk’s death.\n\nI’ve seen the video myself, I’m sure many students across the world have too, but until his email came through I hadn’t even considered the impact this might have in school. I’m sure many of us teach students who supported Charlie, and I think we can all anticipate this being widely discussed when we return. \n\nI’m a young teacher of 22 and this is the first major incident of this kind I’ve faced as a teacher, and I can already see how quickly it could escalate with students holding very different opinions.\n\nI’ve put the email above if anyone can make use of some of the limited guidance and advice given. But truthfully I’m worried about the fallouts and potential discussions and incidents we may witness as we head back to school surrounding this. And I’m sure this is going to be a lot worse in the states. ",
    "score": 2522,
    "url": "https://reddit.com/r/teaching/comments/1ndrpzz/how_are_we_handling_charlie_kirk_in_school_the/",
    "created_at": "2025-09-10T22:05:54.000Z",
    "num_comments": 307
  },
  {
    "id": "reddit-1ng04oe",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Stop doing unpaid work.",
    "text": "A family friend of mine is a teacher, and we recently took a quick trip to Best Buy to pick up a new wireless mouse I needed. I grabbed the mouse in a second, only to see that she had picked up about 5 USBs. I asked why, and she said they were for her students. I threw a Hail Mary and asked her if she'd be compensated, but of course the answer was no. The whole ride back, she was emailing the parents that she bought them. \n\nOn a Saturday. \n\nPlease just don't do this. Y'all need to stand up and just say no, please don't feel obligated to work off the clock. You are not responsible for their school supplies. You should absolutely turn your phone on at 8:55 and off at 3:20. Work your paid prep time but don't give a second more unless YOU want to. \n\nIf work doesn't get done, so be it. Your family needs you much more than your school: the weekend if for them. \n\nEDITED TO ADD: love all your comments. You're all heroes. Wanted to just include the concept of induced demand someone brought up: the reward for finishing your work is often just more work and more stress. It's not worth it. You're more than your job, always remember that. \n\nEDITED AGAIN: I wanted to respond to a common perspective you've all shared: \"maybe she actually wanted to\". Folks, I've seen this woman exhausted, pale, and holding her head almost in tears after a long day. She seems burnt out, and although she hasn't said it, her gas tank looks like it's been running on empty for a while now. I don't want to make it look like I know what it's like to be a teacher because I don't. \n\nBut there has to be another way. You need to be adequately recognized and compensated for what you do. Think of a lawyer billing additional time for a more complicated case. Think of a mechanic increasing their charge because a \"simple\" fix turned out to be more intricate than originally expected. To echo a comment I read: you're not just a teacher. You're a human being with the same stuff we all have - hopes, dreams, goals, hobbies, and a family - that just so happens to be a teacher. \n\nFINAL EDIT: I want to thank everyone who responded to this post. You've all shared such unique perspectives on time management, salary, and education as a whole. I think I'll always come back to this post and reply to comments when I can. From a non-teacher, thank you for caring and commenting. ",
    "score": 2283,
    "url": "https://reddit.com/r/Teachers/comments/1ng04oe/stop_doing_unpaid_work/",
    "created_at": "2025-09-13T15:18:48.000Z",
    "num_comments": 458
  },
  {
    "id": "reddit-1ir2vmr",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Knew this was always the plan....",
    "text": "Trump and the Ed Dept./Office of Civil Rights have now demanded all state's departments of education remove any DEI from every school, or lose funding.  This was always the plan.  Weaponize the government, withhold funding, and punish blue states/cities/districts.  Meanwhile, we've got massive right-wing indoctrination happening through PragerU, Classical Charters, The Heritage Foundation, Ten Commandments, and a host of \"patriotic\" curriculum.  Of course....this is all legal and encouraged.  Money will be funneled in that direction, and any district that doesn't bow to the king will be ostracized and start to crumble.  In my solidly blue district, we'll now prepare for job cuts and frozen salaries over the long term.  What a truly dystopian nightmare we've entered.",
    "score": 2169,
    "url": "https://reddit.com/r/Teachers/comments/1ir2vmr/knew_this_was_always_the_plan/",
    "created_at": "2025-02-16T21:18:11.000Z",
    "num_comments": 244
  },
  {
    "id": "reddit-1npzhnw",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "My son is starting school, am I going to irritate the teacher by maybe going a bit overboard?",
    "text": "My son is just about to start school and we had our first meeting with his teacher. She seems lovely and I’m so excited to be starting his educational journey.\n\nI asked the teacher about if I could bring in some supplies for the class to help out (I’ve heard of teachers buying supplies out of pocket and that sounds atrocious), but maybe I’m going overboard?\n\nI’ve set a rough budget of $300/month for supplies/extras/for the teacher.\n\nMy husband thinks I’m goofy because I ordered 5 cases worth of Lysol wipes, Clorox (bleach free) spray, bandaids, hand sanitizer, Kleenex tissues, paper cups, paper plates, microwave popcorn, pretzels.. I’m thinking I should also get pens, sticky notes, a gift card for the teacher and other miscellaneous supplies. \n\nWe’re high income in a low income district (they automatically provide free breakfast and lunch for all students because so many are poverty level), we’d be paying more for a private program but the districts is considered the best. \n\nIs that too much or can I go wild and it’ll be appreciated? I joked about setting up a monthly delivery to the office (and sending items -coffees and what not- for the office staff as a thank you). \n\nIs there anything else you as teachers would like that I’m not thinking of?\n\nEdit: Thank you all so much for the suggestions and feedback! I really appreciate all of the responses.\n\nEdit 2: When I had asked the teacher she said yes. I made sure to buy the products they use in the school.\n\nEdit 3: It’s actually sad that this doesn’t seem to be the norm. I feel like it’s peanuts. I hope what I’m working to do becomes below average and most others do more.\n\nI’ll be inquiring about joining the PTA, starting fundraisers, hosting dinners on in-service and conference nights, help with funding for field trips for kids that aren’t paid for, Amazon wish lists for classes, providing larger appliances that are needed or just nice to have for staff and seeing about how much I can supply the gym, arts and library. \n\nI appreciate these responses so very much. We were anticipating spending so much more for a private program, so I’d love to help work to continue that this is the best school in our region. You’ve all given me such incredible feedback and ideas, I can’t thank you enough for taking the time to respond.\n\nI’d rather put $12k into this school than a starter tuition which would then escalate. I hope many other parents donate and help out as well so our kiddos and teachers can thrive. You all do incredible work that is sadly under-appreciated and I hope I can help lead a change. My goal is to be the kind of parent I wish I had and you’ve given me so much to help do that. Thank you so much for this. I didn’t except this kind of response. You all really do go above and beyond.",
    "score": 2113,
    "url": "https://reddit.com/r/teaching/comments/1npzhnw/my_son_is_starting_school_am_i_going_to_irritate/",
    "created_at": "2025-09-25T06:30:50.000Z",
    "num_comments": 458
  },
  {
    "id": "reddit-1mhzf1f",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "First day care package for my wife who works at a school.",
    "text": "I plan on doing this next year too, any suggestions for stuff to add next year?",
    "score": 2091,
    "url": "https://reddit.com/r/teaching/comments/1mhzf1f/first_day_care_package_for_my_wife_who_works_at_a/",
    "created_at": "2025-08-05T04:14:23.000Z",
    "num_comments": 138
  },
  {
    "id": "reddit-1nakguc",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "How do you explain to students why the kid on the IEP gets away with stuff?",
    "text": "I have a kid on an IEP with some severe social emotional and impulsivity problems. This kid curses, destroys things on occasion and mouths off to the principal in front of their entire class, they have multiple one on ones because this kid wears even specialists out in the course of a single day, the whole school is kinda bending over backwards for this one student and the police have been called to deal with at least a few situations within the last year.\n\nThe kids in their class kinda hate this kid and have had to deal with them for a few years now and their behavior is not good overall because they see this other kid get away with breaking almost every rule for multiple years, which makes them just..m not care about the rules, since they are not enforced evenly.\n\nWe are supposed to have the counselors talk with students, but this has happened before and the kids see it as so much bullshit and excuses and I really can't blame them much. Our grade's behavior is getting all the teachers in trouble but it mostly all stems from this one student.\n\nWhat do you even do in this situation? \n\n*Edit: because everyone is making assumptions, the student is female, and they do not get severely or sustainedly violent, although a few shins have been kicked and belongings have been thrown, the big issue is verbal abuse and constant unending chatter*\n\n*Edit 2: the majority of the replies seem to be irate parents, and at least a few bots stirring the pot, not anyone who has even a certificate in education*",
    "score": 1995,
    "url": "https://reddit.com/r/teaching/comments/1nakguc/how_do_you_explain_to_students_why_the_kid_on_the/",
    "created_at": "2025-09-07T04:57:50.000Z",
    "num_comments": 790
  },
  {
    "id": "reddit-1nj9zqr",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "I'm a teacher and I can't stand all of the \"this generation is ruined\" whining from a subset of teachers",
    "text": "You want to complain about your specific admin? You want to complain that technology creates challenges? You want to complain about your labor rights, compensation, or benefits? \n\nFine. All of those are valid, legitimate topics for complaint.\n\nCool it with the black and white \"this generation is cooked\" talk. If you aren't up for the challenge, there's the door. You can't write off entire years of children and then use that as an excuse to be lazy and jaded.",
    "score": 1816,
    "url": "https://reddit.com/r/teaching/comments/1nj9zqr/im_a_teacher_and_i_cant_stand_all_of_the_this/",
    "created_at": "2025-09-17T11:01:10.000Z",
    "num_comments": 328
  },
  {
    "id": "reddit-1kexred",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "People are oblivious…",
    "text": "I was at my nephew’s birthday party today. I only see this side of the family 2-3 times a year, so we were all catching up. Not that this matters, but it was all my husband’s family. I mentioned being in grad school to move on from teaching. My husband’s aunt asked why. I started listing various reasons including the crappy salary. She said “well, you make a lot of money for only working 9.5 months out of the year.” I just told her that I normally work 45-50 hours a week because I can’t get my work done with only 40 hours a week. Thankfully someone changed the subject after that. \n\nIf you’re not a teacher, you have no clue what we go through. Sure, we have holidays and summers off. But that’s never enough time for me to get the mental rest I really need. ",
    "score": 1620,
    "url": "https://reddit.com/r/Teachers/comments/1kexred/people_are_oblivious/",
    "created_at": "2025-05-04T23:39:41.000Z",
    "num_comments": 140
  },
  {
    "id": "reddit-1iwdh5i",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Why does my wife with 2 MS degrees and 17 years of experience make 48k?",
    "text": "Governor Ron DeSantis continues to highlight Florida’s increasing education budget, yet much of that money never makes it into teachers’ paychecks. Instead, it’s funneled toward raising starting salaries while veteran educators—the foundation of the system—are left with stagnant wages. The referendum funding that’s supposed to help is nothing more than a public opinion gamble, leaving teachers’ financial security in the hands of voters rather than treating education as the essential service it is. No teacher should have to rely on the hope that their community values education enough to ensure they get paid fairly. Every child deserves access to a quality education, and that starts with retaining experienced, well-compensated teachers—not leaving them to wonder if their next raise will be on the ballot.\n\nThis is bigger than just a budget—it’s an entire generation at stake. The decisions being made today will shape Florida’s future workforce, economy, and society for decades. The state proudly claims to be ranked #1 in education, but step into any high school English classroom and the reality tells a different story. Basic literacy issues persist, with students struggling to sound out simple words. A decade ago, education outcomes were stronger. Now, national data confirms a steady decline in literacy, comprehension, and critical thinking.\n\nTeachers are walking away because the job is unsustainable. Workloads have tripled, classrooms are overcrowded, and yet the pay sits at $48,000 with an unreliable bonus system tied to a referendum. Why would anyone take on a high-stress, high-responsibility job for that salary when they can find better pay with less stress elsewhere? At this rate, Florida isn’t just facing a teacher shortage—it’s heading toward an educational collapse, where students are left behind because leadership values talking points over real investment in schools.\n\nThis isn’t about politics; it’s about common sense. Even those who support DeSantis should recognize that if Florida doesn’t address this now, the long-term consequences will be devastating. A population that lacks basic comprehension, a workforce that can’t meet future demands, and an economy weakened by a lack of skilled labor. Teachers are professionals who shape the next generation, and they deserve compensation that reflects their worth. If Florida continues to neglect this, the cost won’t just be failing schools—it will be a failing society.",
    "score": 1327,
    "url": "https://reddit.com/r/Teachers/comments/1iwdh5i/why_does_my_wife_with_2_ms_degrees_and_17_years/",
    "created_at": "2025-02-23T16:07:18.000Z",
    "num_comments": 618
  },
  {
    "id": "reddit-1jrhek7",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Facebook reminding me that many people are clueless when it comes to teachers and our salaries.",
    "text": "I was scrolling on facebook and saw a post made by a teacher on reels where she joked about how quick her money disappears during the summer. She used an audio that gets rid of music measures, but basically said her salary started at $123,456.78\n\nI commented on it, lightheartedly saying it was a cute video but many teachers make no where close to $123k.\n\nAccording to many many comments on facebook, I am wrong. In fact according to them most of us make six figures. And if we aren't we are either a first year teacher, need to relocate, or we need to go back to college and get our masters and doctorate 😅",
    "score": 1174,
    "url": "https://reddit.com/r/Teachers/comments/1jrhek7/facebook_reminding_me_that_many_people_are/",
    "created_at": "2025-04-04T17:22:01.000Z",
    "num_comments": 355
  },
  {
    "id": "reddit-1prcszu",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "I hate Martyr teachers",
    "text": "Martyr teachers are another reason this career field sucks. They go over the top for every single thing and attempt to set the expectation at a level that isn’t sustainable and it oftentimes makes normal teachers look lazy. Martyrs want to follow every single thing admin asks them to do, even if it makes their job so much harder. They work overtime and do admins job for teachers salary. They do all the things parents want them to (post tiktoks, always taking a million pictures, allowing parents to come in and micromanage them, making their classrooms unrealistically engaging/fun. They have zero boundaries and it sets the tone in society that this should be the exception for teaching although society doesn’t understand that we don’t have the proper support for martyr style teaching to be sustainable. Then they burn out quick and wonder why. \n",
    "score": 1038,
    "url": "https://reddit.com/r/Teachers/comments/1prcszu/i_hate_martyr_teachers/",
    "created_at": "2025-12-20T12:02:41.000Z",
    "num_comments": 344
  },
  {
    "id": "reddit-1jv94ix",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "The most TONE DEAF email I’ve ever received from the district",
    "text": "My superintendent was re-elected this year, and promised to do what he can to raise teacher salaries. Our union president sucks and folds SO quickly to the district at bargaining, so we ended up with a 200 dollar raise. In the meantime, the superintendent raised his own salary by 42,000 fucking dollars. I’m in my 6th year teaching, and I make 48,700.\n\nYesterday I got an email with a flyer for a presentation that the EAP is putting together for us. The topic?\n\nHabits to Improve Financial Wellness\n\nAre you fucking forreal??\n\nI’m taking a leave of absence at the end of this year, it is long overdue but omfg the AUDACITY. I have a white hot rage in my chest that I just can’t seem to get rid of.",
    "score": 1017,
    "url": "https://reddit.com/r/Teachers/comments/1jv94ix/the_most_tone_deaf_email_ive_ever_received_from/",
    "created_at": "2025-04-09T15:51:17.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1kvzkbo",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "What is the most out-of-touch comment you ever heard from a district admin? I’ll go first",
    "text": "Not building level, mind you.\n\nMy charter school was recently taken over another charter. Well, more like chewed up, swallowed and slowly digested. To the point where it’s like please just end my suffering.\n\nI was looking over the salary schedule with the assistant superintendent, and for my experience and, The number I was quoted for my salary next year was rather low. \n\nI voiced this to the assistant superintendent, and he looked me in the face and said \n\n\n“Well, we’ve had teachers willing to take a pay cut to work with us.” 😵‍💫 \n\n",
    "score": 911,
    "url": "https://reddit.com/r/Teachers/comments/1kvzkbo/what_is_the_most_outoftouch_comment_you_ever/",
    "created_at": "2025-05-26T17:02:44.000Z",
    "num_comments": 229
  },
  {
    "id": "reddit-1k8ylrh",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "So Trump wants to replace us with AI.",
    "text": "Dude I am about to finish my first year of teaching and I’m terrified I’m not going to get to finish my time in this career. The wife and I are considering moving to the EU, but I worry American teachers aren’t very in demand…are we fucked?",
    "score": 836,
    "url": "https://reddit.com/r/teaching/comments/1k8ylrh/so_trump_wants_to_replace_us_with_ai/",
    "created_at": "2025-04-27T07:47:50.000Z",
    "num_comments": 244
  },
  {
    "id": "reddit-1m4pozo",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "“Ma’am, I didn’t do my homework… but I prayed for you last night.” I almost cried.",
    "text": "I’m a teacher in the Philippines. I don’t make much, and lately I’ve been dealing with stress, insomnia, and debt.\n\nI showed up to class yesterday exhausted—probably looked like a ghost with lipstick.\n\nOne of my students walked up, eyes down, and said, “Ma’am… I didn’t do my homework.”\n\nI just nodded. I didn’t have the energy to scold anyone.\n\nThen she continued:\n“But I prayed for you last night. I think you’re sad.”\n\nIt hit me so hard.\n\nI think this job breaks and heals me at the same time.\n\nI may be poor in salary, but I’m rich in moments like these.\n\nJust needed to let this out somewhere teachers would understand.",
    "score": 755,
    "url": "https://reddit.com/r/Teachers/comments/1m4pozo/maam_i_didnt_do_my_homework_but_i_prayed_for_you/",
    "created_at": "2025-07-20T14:02:43.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1kqubyy",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "How I Feel Right Now",
    "text": "I teach high school (and 1 middle school class) of publications (yearbook) and journalism (2 separate classes, and I normally have five classes total).\n\nI was told a few weeks ago that I didn’t have the required amount of students to be considered full time. I’m losing my health insurance, around $30k in salary (I’m now hourly…or will be next school year), I’m losing my classroom, and I’m not allowed to have any overtime.\n\nHere’s the thing: our yearbook is an absolute work of art. We are so far ahead with technology and our yearbooks don’t look like the cookie cutter yearbooks that everyone does (you know, a few pics on a page along with a long ass story…we put tons of pics on the pages and a few sentences of what the page is/what the event is/how the sports team did). \n\nEvery year, I use my fall, winter, and spring breaks to work on it. Creating the yearbook is a full time job, and we have won numerous awards.\n\nI’m broken right now. The only reason I’m staying is because my child goes to the school and I don’t want to move her (thankfully I still get my discount for her tuition).\n\nFor the past 10 years, I have given this school everything…my time, my love for the students, my photography and graphic design talents, everything. So when the shit started rolling downhill and I was at the bottom, this decision literally broke my heart. I can’t stop crying because this is at the forefront of my mind.\n\nI can’t leave because if I do, I lose the tuition assistance (I had to give them an answer right then in the meeting, and since my child is the most important thing in my life, I want to make sure she gets a stellar education).\n\nI just needed to vent. I don’t feel any better, but if you’ve ever been put in this situation, please share because right now I feel like an absolute failure.",
    "score": 614,
    "url": "https://reddit.com/r/teaching/comments/1kqubyy/how_i_feel_right_now/",
    "created_at": "2025-05-20T02:41:46.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1jhqhgb",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Unpop Opinion: Teaching may not be a walk in the park nor make me a millionaire but it's certainly one of the better jobs to have in society..",
    "text": "Before I make my point, I want to point out...\n\n1. I worked before in fast food, trucking, retail and substitute teaching for many years respectively\n2. I'm in my 6th year as a classroom teacher\n3. I acknowledge all teaching jobs aren't created equal, esp. throughout USA. Some areas pay close to minimum wage while forcing 3rd-world working conditions while other areas pay over six figures. I work in a blue state with decent pay and benefits so this is just from my perspective, so obviously this may not apply for everybody. \n\nYes, the job may be stressful at times. \n\n* It's mentally draining having to multitask and do the work of 5-10 people while teaching, having to print/make copies, grade papers, monitor students, model lessons and answer phone calls from the office all at the same time without the benefit of being able to clone yourself in TEN. \n* I dislike the fact that I \\[can potentially\\] get blamed for EVERYTHING that happens (i.e. student noncompliance, poor work ethic, questionable parenting, etc.) \n* I dislike the fear and nervousness of unannounced classroom observations and my value being determined by \"numbers\"\n* I have a hard time working for delusional admins who expect miracles to be performed and expectations being unclear and always shifted and changed last-minute\n\nBut everytime I'm having a \"terrible\" day I always look back and stay grateful for what I DO have. \n\n* I work 6 hours a day (5 actually teaching) and &lt;190 days a year compared to most jobs (8+ hours a day, \\~250 days a year). \n* I DO spend most of my day active and under stress but I'm so preoccupied with my delivery, performance and meeting deadlines that I rarely if ever, have time to look at the clock. I'd a million times rather be preoccupied than be standing in a spot or a room for 8+ hours where ONE workday feels like an ETERNITY like most other jobs do. \n* My hard work is ACTUALLY benefitting society...CHILDREN. Kids who are mostly starved of love, guidance and affection (figuratively speaking of course) and look up to me as a role model and important figure in life. Unlike most jobs where their hard work is going to make some greedy billionaire richer so he can buy his 15th yacht. \n* My job is secure and \\[almost\\] guaranteed, especially after tenure. I am salaried and my income is stable. I don't have to worry about a cheap greedy manager/owner slashing my hours or benefits for their own personal gain. I don't have to work 2+ jobs to put food on the table or a roof over my head.\n* I have a decent union that makes sure my job abides by labor laws. Our time is respected. Apart from lesson planning and miscellaneous paperwork, nobody takes advantage of us or makes us work a minute later compared to many jobs who break laws and blackmail their employees so more work can get done for less pay. \n* Decent Pension, 401k and Roth IRA options. Many jobs offer none of these and who knows if SS will even exist in the future?\n* No manual labor. My job is arduous at times but when you relatively compare yourself to tens/hundreds of millions of people around the world baking in the 100-degree sun 12 hours a day, 6-7 days a week while getting paid PENNIES, I'm grateful to have what I have. \n* Personal time consumed for Lesson Planing and paperwork varies by job and location, but that time is OPTIONAL and FLEXIBLE. You can plan in your lunch period, before work or the afternoon from your house. Also as the years go by and you gain experience, the time you spend lesson planning gradually diminishes\n\n  \nDo I wish teachers were respected more and things changed for the better? Yes. \n\nDo I wish my pay was higher? Yes. \n\nTeaching may not be the easiest or highest-paying job in the world, but despite all the negatives, there's alot of positives and overall I'm grateful to be where I am today. How do you guys feel?",
    "score": 551,
    "url": "https://reddit.com/r/Teachers/comments/1jhqhgb/unpop_opinion_teaching_may_not_be_a_walk_in_the/",
    "created_at": "2025-03-23T03:41:44.000Z",
    "num_comments": 132
  },
  {
    "id": "reddit-1mf7dga",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "What do I do? Am I trapped?",
    "text": "I am completely at a loss and have been sobbing in my house all afternoon. \n\nI accepted a position over a month ago with a local district under the impression I would be receiving a specific salary. I live in Ohio so I have to abide by the July 10 deadline for freely resigning without the boards approval. Well last week, after July 10, I was informed that they would be regressing my salary due to not accepting my post graduate credits. \n\nI never once doubted them taking my credits as my prior district did and the DOE recognized them for my licensure requirements. I really cannot financially afford to make less and have been losing sleep, hair, and weight worrying about it. Well today, I put in my resignation (very professional in verbiage) expressing a bit of the situation and how I would not be able to continue with the district due to financial hardship. \n\nI received an email which was unpleasant in tone and honestly seemed punitive stating that they are denying my resignation and will not allow me out of the contract. I did respond back laying out some facts and what not along with asking them to reconsider. \n\nI just don’t know what to do if they do not respond today as I would be required to go in Monday for an orientation. We have not started school and I have completed no work for them. I just am at a loss that I could be forced to remain in this contract or potentially get my license suspended. How would you expect a teacher to respond to that or enjoy coming into work after that? I do have other options within education in different districts which would pay more but I’m worried the state will come after my license. I don’t even know how to respond if they truly deny my resignation. \n\nI just don’t know what to do and am very discouraged and sad. \n\nEdit: This is the verbiage in my signed contract which was signed in June and I was not informed until July 23 of a change “Notice will be given annually, no later than July 1, to each Teacher who holds a contract valid for the succeeding year as to the salary\nto be paid such Teacher during such year.”\n\nEdit 2: thank you everyone for your advice! I have let them know that I will not be reporting for the 25/26 school year and any further communication will come from my legal counsel. I also got offered my dream job and that district is going to attempt to help me out! The thought of working at that school after all of this was making me sick so I feel better after sending that last email. ",
    "score": 506,
    "url": "https://reddit.com/r/Teachers/comments/1mf7dga/what_do_i_do_am_i_trapped/",
    "created_at": "2025-08-01T20:29:46.000Z",
    "num_comments": 152
  },
  {
    "id": "reddit-1n4f3a2",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "The \"teacher shortage\" is a misnomer",
    "text": "(EDIT: I am fully credentialed in the state of California and have taught here for 2 years. Some people misunderstood and thought I only held a Texas license)\n\nYes, there is a \"teacher shortage,\" but as someone who moved from Texas to California a few years ago and who is facing an endless loop of the temporary contract/hiring freeze game, I don't think people outside of education get it. I mean, if I had a special education credential of any kind I may have a lot of choices. If I were credentialed to teach Spanish, too. \n\nI'm really frustrated because I am SO overqualified with over 20 years of experience, awards, achievements, blah blah blah, and I WANT to teach EL newcomers which has historically been a difficult position to fill, but there is ZIP out there that I am credentialed to teach. And people are like \"simply move,\" as if I can just uproot my entire family's life. \n\nI really, really don't want to sub and I really, really don't want to teach at a charter. Hell, even charters and private schools are pretty dry right now. Declining enrollment has me pretty bummed out. \n\nAnyway, just wanted to commiserate with anyone in the same situation. I thought I was done hustling and grinding with a more stable job, but here I am with 21 years of experience and a master's degree sadly applying to charters an hour away and sadly looking at the meager salary of online ESL teachers.",
    "score": 459,
    "url": "https://reddit.com/r/Teachers/comments/1n4f3a2/the_teacher_shortage_is_a_misnomer/",
    "created_at": "2025-08-30T22:58:07.000Z",
    "num_comments": 195
  },
  {
    "id": "reddit-1hubeaf",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "My push back against judging parents. ",
    "text": "Someone posted a post about their judgement towards students' work ethic and how these students are simply the product of poor parenting.\n\nI want to critique this. As a teacher, I don't really judge parents. I take it a step further: I judge our entire society and its **failings**. Children are the creations of their parents, and their parents are the creations of society. And whatever subliminal messaging the parent recieved, the child will recieve.\n\nOn the internaitonal stage, the United States rarely ranks highly when it comes to k-12 education, and we especially rank low when it comes to math scores. (sorry for being American centric. I am American; therefore, this is the only country I can speak on).\n\nLet's say a parent comes from a lower socioeconomic background. *Their* parents were not able help them on their education and their mom and dad were always busy working at their low-paying jobs. This parent would go to school, and they struggled in reading and writing AND math and science. They graduated high school with a 1.8 GPA. After they finish high school, they work at the local factory or Mcdonanld's, and at 23, they have a child.\n\nThe cycle of low achievement and low educational prosperity continues in their child. Now you are probably thinking, how is this the fault of American society?\n\nThe schools the parent and child went to didn't have enough funding. The teachers were given a low salary. The class sizes were too big. Because of issues with funding, there weren't any paras or teaching assistants to ease the burden off the teachers. The low-paying job the parent worked didn't assist them with going back to school. They didn'tget any PTO; therefore, if they try to stay home with their kids, they will lose money.\n\nAll of these problems are societal and governmental issues that state and federal governments can help allievate.\n\nAs educators, we need to understand something really important about our education system: we are working within a country that doesn't prize educational achievement for **ALL** of its citizens. Therefore, how I can I throw my nose up in the air at a child or parent who obviously weren't even given a fighting chance to begin with?\n\n**TLDR: As an educator, start seeing the bigger picture. The problem with contemporary American education is more than \"bad parenting.\" It is a societal problem that starts all the way at the federal level.**",
    "score": 457,
    "url": "https://reddit.com/r/Teachers/comments/1hubeaf/my_push_back_against_judging_parents/",
    "created_at": "2025-01-05T16:56:49.000Z",
    "num_comments": 130
  },
  {
    "id": "reddit-1oxzqo8",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "What's your unpopular opinion about teaching? Things you think but can't exactly say in a staff meeting?",
    "text": "I'm unsure if my opinions are unpopular, but these are things I've encountered during my time working in schools.\n\n1) Getting a teaching job is actually pretty hard.  I think it's a competitive field.  Having a Masters degree increases your chances heavily instead of just having a BA+credenital especially when it comes to good districts.\n\n2) First year teachers struggle with classroom management because they're creating a lot of lesson plans / units / curriculum from scratch.  It's very hard not to have down time as a first year teacher and the down time is what makes kids behaviors go sideways.  You're also trying to figure out what lessons have a high buy and and what lessons just flop from the jump.  All the routine, discapline and structure in the world isn't going to mean anything if you can't keep those kids meaningfully busy everyday.\n\n3) Department chairs and veteran teachers typically have the easiest classes.  New teachers are typically stuck with the remedial freshman who are bouncing off the walls.  My department chair taught 12th grade honors classes.  She was always heavily praised for how great her classroom management was, but her kids were all very well behaved and self motivated / college bound.  I think she was kind of oblivious to what our new guy was going through with his inclusion classes.\n\n4) Subbing isn't a good way to get in the door.  I've met a lot of credentialed subs who were passed over for contracted positions.  I also think long term subbing is a scam with all the work of teaching with half of the pay.\n\n5) Cellphones fried attention spans, but I think the real reason why there's so much apathy in teenagers nowadays is because school doesn't equal money anymore.  A lot of their parents and older siblings have student loan debts and are working low paying jobs.  Naturally they look at that and look at school as being outdated.\n\n6) Chatgpt and AI are going to get stronger and stronger in the next few years.  Every person I've met who works in tech is heavily confident that AI is going to completely change how we use the internet here very soon.  Google is 100 percent all in, and telling juniors and seniors to not use it is like telling them to take a horse and buggy to school instead of a car.\n\nI think there should be classes on how to use and navigate AI.  I spent the summer messing around with chat GPT and it's insanity on what it's capable of doing.  It can do a week's worth of graduate level research in 5 seconds with pinpoint accuracy.\n\n7) Coteaching doesn't work well.  It's usually one person doing all the lesson planning, teaching and grading while the other person sort of just sits there and maybe circulates here and there.  Ironically my coteacher was the most apahetic student I've had: always came in tardy, scrolled on his phone and dipped out a few minutes early.  I don't remember him actually teaching anything.  I felt resentful that he was getting paid the same salary I was without...really doing anything?  The weirdest thing was: I was struggling so much with this inclusion class that I complained to the head of the SPED department on the coteacher saying he wasn't helping and would just scroll all period.  She said \"Sounds like you need to learn how to motivate him more.\"  WHY THE FUCK IS IT MY JOB TO MOTIVATE A SALARIED THIRTY YEAR OLD?\n\n8) Some teachers are control freaks to an unhealthy level.  I'm unsure if this field attracts that personality type of if they become that way over time from this job.  I period subbed for this lady's government class during my prep.  I had a brainfart moment and told the kids to answer questions 1-4 when in reality she wanted them to answer 1-5.  I didn't notice until the bell rang.  She absolutely blew up my email the next school day acting like I commited a felony.  A piece of me wanted to tell her off, but I like not being fired.\n\n9) Mentor teachers should be paid to take on a student teacher.  I also think they should be trained on how to support a student teacher.  The lady I was placed with refused to give up any control at all and it was almost impossible to do the things I had to do for the TPA.  Those 4 months were absolutely stressful.\n\n10) The kids make or break this job.  If you work with good kids you connect with, teaching can be hillarious, fun, rewarding and even easy at times.  One year the kids were a total breeze and I truly felt like I was stealing money from this district since my job was so easy.  If the kids are blatanly disrespectful, resentful and rude...it's going to really hurt your mental health.  I put on 40 lbs last year dealing with all the stress. I always get nervous the day before a new school year knowing my fate is decided by the attendance sheet.\n\n11) Schools varry a lot.  There's several high schools in my community and they all seem like they have different vibes / cultures.  People always tell me admin creates the culture, but idk if that's true.  It's definitely very weid how one HS can be an uplifting and fun place while the one a few miles away feels like a prision.\n\n12) Teachers always say how much they love collobrating with other teachers, but everytime I ever asked for something my emails were left on read. I always thought it would be cool to collaborate and do projects with different departments, but I could never get anything to happen.  I kinda just gave up and became an antisocial island even though during the interview process they told me they don't like antisoical islands and like collobrating.\n\n13) I worked at a school with a 5 minute passing period.  The behaviors there were total shit.  I worked at a school with a 9 minute passing period, and the kids and staff seemed a lot less aggetated.  If I was admin, having a longer passing period would be the very first thing I would do for school culture.  Gives us all a breather to get ready for the next class, pee, greet students at the door, decompress / whatever.\n\nWhat are some things you think / noticed?",
    "score": 402,
    "url": "https://reddit.com/r/Teachers/comments/1oxzqo8/whats_your_unpopular_opinion_about_teaching/",
    "created_at": "2025-11-15T18:56:17.000Z",
    "num_comments": 426
  },
  {
    "id": "reddit-1mtwf7g",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "We need to be paid better—",
    "text": "One of the biggest delusions of our society is a teacher’s salary.\n\n$40-70a day for childcare— that’d be $1,120-1,960 a day if we were given the child care rate.\n\nBut for some reason we get paid less for doing more for more students?\n\nIf you paid teachers the same rate, who wear so many more hats- they’d finally be compensated at the rate they should.\n\nThe fact they’re paid unlivable wages for holding the fabric society together should piss you off.\n\nGet ahold of your union, take up leadership roles and start demanding more pay.\n\nIt’s not just for yourself- it demonstrates that education is valuable and worthy.\n\nIf you need help finding the next steps, please ask me.  I helped our union get one of the largest pay increases in its history.",
    "score": 382,
    "url": "https://reddit.com/r/Teachers/comments/1mtwf7g/we_need_to_be_paid_better/",
    "created_at": "2025-08-18T19:47:51.000Z",
    "num_comments": 167
  },
  {
    "id": "reddit-1kiwu4i",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "F you Florida",
    "text": "Wrapping up my first year as a classroom gen ed/3rd grade teacher. My salary increase next year will be $150. That’s an extra 40 cents a paycheck. \n\nImagine hating public education and teachers so much that you won’t even give them $1 more on their paycheck for a year’s earned experience.\n\nMy next raise will be 3 years from now. Next salary bump? Oh, that’ll be $500. Per paycheck? No. Just $500 for the year.\n\nFlorida’s “save our teachers” bill is high comedy too. They want the starting salary to be 65k, but that’s how much teachers with 25 years of experience make! Not to mention, if Florida will start a teacher at 65k, you better believe the next pay scale increase will be 10 cents every 5 years.\n\nI know it’s bad for teachers everywhere, but it doesn’t have to be 40 cents bad. I’m moving to the northeast for the 26/27 school year. F this and F you Florida.\n\n",
    "score": 377,
    "url": "https://reddit.com/r/Teachers/comments/1kiwu4i/f_you_florida/",
    "created_at": "2025-05-09T23:50:03.000Z",
    "num_comments": 182
  },
  {
    "id": "reddit-1hxetv3",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Fuck it I’m doing it my way",
    "text": "So I am getting let go from my job after I was forced to do these really boring lessons and was micromanaged and lied to every step of the way by a two faced principal. Seeing that this is my second to last day and nothing will save my job, I said ‘fuck it. I am doing the fun lessons that I was originally not allowed to do.’ I did a lesson on corporate social responsibility and how legos used it. The kids absolutely loved it and were entirely engaged. Not one student went to the bathroom and it was amazing to feel like I was actually teaching my students something interesting. \n\nMost of these admins are so clueless and literally have no idea what they are doing. They only care about perserving their job and overinflated salary and are willing to step on anyone that gets in their way. They cater to the parents regardless of what is truly best for the child and have played a huge hand in the demise of the American school system. Never lose your love of teaching regardless how of how much these shiney admin jobs might pay ❤️",
    "score": 374,
    "url": "https://reddit.com/r/Teachers/comments/1hxetv3/fuck_it_im_doing_it_my_way/",
    "created_at": "2025-01-09T15:08:35.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1oum2ng",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "1055 AZ Teachers Have Resigned Since July",
    "text": "In a new report released by the Arizona Department of Education (ADE), 1,055 teachers have resigned since July 1. More than 4,200 teaching positions remain vacant, with a majority of them being filled by substitutes or other part-time solutions.\n\nIn a poll sent to school districts and charters, of the 4,200 teaching positions that remain vacant, 30% are being covered by long-term substitutes, nearly 24% are filled by existing teachers who are working through their prep or planning time and nearly 23% are covered by “agency temporary personnel,” ADE said. After that, about 1,400 positions remain completely unfilled.\n\nI'm not shocked that AZ is having this issue. Starting salary in a district I began my career in was $34,700. In over 20 years, that starting salary has gone up only $8k. What a joke. If they paid a living wage and treated teachers with respect, then the shortage wouldn't be so large.",
    "score": 320,
    "url": "https://reddit.com/r/Teachers/comments/1oum2ng/1055_az_teachers_have_resigned_since_july/",
    "created_at": "2025-11-11T21:26:50.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1lwqt6b",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Job offer revoked",
    "text": "Was offered a job in a district that has a good reputation and was low balled for salary. Was told they’d only honor 3yrs of my experience bc I was from another state. This information wasn’t on the district website (or else I wouldn’t have applied) and I’m assuming they’re not honoring more years due to budget cuts. Anyway, I asked if there was any way I could speak to someone in HR to see if we could discuss it since I had the experience that the school/district was looking for and bc I was very interested in the position (the salary that they were offering just wouldn’t work, especially since I was already taking a pay cut in general). The principal explained the next steps in the hiring process, said that someone from HR would call me with the job offer and we could discuss everything. Two days later I get a call from the principal (not HR) saying that she spoke to HR and that they decided to go with a different candidate. It was a huge slap in the face bc I was super excited to work for this district. I know nothing is set in stone until contracts are signed, but there wasn’t an inclination that they’d revoke their verbal offer. It all felt very shady and made me dislike the education field even more than I already do. It’s disgusting how cheap these districts are. And they wonder why teachers are leaving in droves. Rant over. ",
    "score": 311,
    "url": "https://reddit.com/r/Teachers/comments/1lwqt6b/job_offer_revoked/",
    "created_at": "2025-07-10T22:52:45.000Z",
    "num_comments": 125
  },
  {
    "id": "reddit-1nschwp",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Just a reminder, this sub is mostly people venting",
    "text": "I say this as a teacher. Venting is important, but this sub makes it look like teaching is the worst career ever. Frankly, once you find the right school and the right admin - that's far from the truth. I know that's a big \"once\" because there are nightmare stories out there and this sub favors them.   \n  \nOverall, it's still a very viable, more or less recession-proof career with good benefits, middle-class salaries, and a great pension. Obviously, this is heavily dependent on districts and mainly whether you're in a strong union state or not.  \n  \n99% of our headaches at work come from other adults - be it admins or parents, and the former folds to the craziest of the latter. Every job has BS bureaucracy, and education administration tends to be particularly frustrating, but it's not just education. Crazy parents have always existed, but if you have competent administrators, they should shield you from that. 99% of parents are awesome and just want the best for their kids - the crazies are just the loudest. \n\nMost of the kids are awesome, and even though we see a lot of posts about crazy behaviors here, most of them are awesome. They're kids and will do kid stuff, but if they don't have an admin or a parent enabling them, 99% of them will recognize it and take accountability. \n\nPlenty of people in education love their job, plenty work it as just a job for the pension, it's just not represented here. If I were in university right now, I would still choose this line of work. I wouldn't tell people not to do so, as long as they are aware of the realities of the bureaucracy/behaviors ",
    "score": 296,
    "url": "https://reddit.com/r/Teachers/comments/1nschwp/just_a_reminder_this_sub_is_mostly_people_venting/",
    "created_at": "2025-09-28T02:01:56.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1ogpmwx",
    "subreddit": "Teachers",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "If every teacher suddenly got that raise to at 80k salary minimum nationwide, would you roll your eyes at all the people suddenly wanting to become teachers? How do you think it would change the profession and the kind of people who enter ?",
    "text": "Idk what i shoulda tagged it as.\n I think at the start id think some ppl were disingenuous and I may have a sly comment,  but I guess the bump in ppl wanting to be teachers is what we want so id wait and see how it works out over time. \n",
    "score": 263,
    "url": "https://reddit.com/r/Teachers/comments/1ogpmwx/if_every_teacher_suddenly_got_that_raise_to_at/",
    "created_at": "2025-10-26T16:54:59.000Z",
    "num_comments": 393
  },
  {
    "id": "reddit-1lg8sg7",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "A parent complained about me",
    "text": "Yesterday the principal had a talk with me, because she received a very long e-mail from a parent complaining about me. It was very detailed and nasty, describing various things I have been doing wrong, and how her children are heavily demotivated for my subject. \n\nI was gutted. The things she described were incredibly twisted and far from the truth and what I stand for as a teacher. I don’t even have any way to defend myself since the e-mail wasn’t addressed to me. I even saw the mom in school that day and she was smiling at me as if nothing had happened and when I told her I’m always available to speak, she showed no interest. \n\nI have been doing anonymous student feedback and never heard about the issues mentioned in the email. I feel so terrible, my teaching reputation has been hindered and I have no way of defending myself. \n\nUpdate: Thanks to everyone for your compassion. I still have a lot of resilience to build. The principal was very reasonable and I had another chance to explain my perspective. She also said she does plan to do observations next school year. She will try to schedule a meeting with the mother in September with me and another person present. My salary will be reduced this month due to this incident, because otherwise she would have to put this into my file.🙄 I foster cats and use a lot of my own money for saving them so thanks to these privileged rich people for reducing my salary to even less🤦‍♀️\n\nUpdate 2: had a meeting with the mom and the principal. It was terrible and full of insults and hate adressed towards me. Clarifying my good intentions was of no help as this was seen just as empty excuses and I was still seen as a villain by the end of the meeting. I cried during most of it and was told to just sit quiet and listen. - that speaking up for myself would actually confirm the bad accusations. The mother also did not want to shake hands with me and gave an evil glare instead. I’m not sure I can do this job, I was planning to slowly transition into tutoring full time but this might be the time to do it.😢",
    "score": 243,
    "url": "https://reddit.com/r/teaching/comments/1lg8sg7/a_parent_complained_about_me/",
    "created_at": "2025-06-20T16:46:18.000Z",
    "num_comments": 135
  },
  {
    "id": "reddit-1lq0vsk",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Is it worth it to join a teacher's union?",
    "text": "When I was a student in high school not too long ago, I came across a random flyer that said join the teachers union of my state and includes a voice on the team, higher salary, etc., though I find it ironic that dues are about $50 or $100 depending on joining local or national chapter. Based in Virginia.\n\nUpdate: I joined. Speaking as someone who recently accepted my first classroom teacher job! It will be my first year btw!",
    "score": 204,
    "url": "https://reddit.com/r/teaching/comments/1lq0vsk/is_it_worth_it_to_join_a_teachers_union/",
    "created_at": "2025-07-02T16:48:35.000Z",
    "num_comments": 549
  },
  {
    "id": "reddit-1j3yz3k",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "This is Gross...",
    "text": "Just ran across this from our state DPI report. Teacher salaries (in green) vs general bachelor and graduate degree salaries. \n\nName another profession that pays LESS and LESS, year after year, ignoring the impact it has on society, our economy, tomorrow's workforce, the impact the profession can have on future need for economic support programs, etc\n\nHow dense are those in charge of the $$$ to think slashing education funds won't be detrimental down the road.  🙄\n\nTeacher shortage?? \n\n,, ... F it.... Pay em less... \n\nIdiots\n",
    "score": 163,
    "url": "https://reddit.com/r/teaching/comments/1j3yz3k/this_is_gross/",
    "created_at": "2025-03-05T09:03:44.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1oxzrbw",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "What's your unpopular opinion about teaching? Things you think but can't exactly say in a staff meeting?",
    "text": "I'm unsure if my opinions are unpopular, but these are things I've encountered during my time working in schools.\n\n1) Getting a teaching job is actually pretty hard.  I think it's a competitive field.  Having a Masters degree increases your chances heavily instead of just having a BA+credenital especially when it comes to good districts.\n\n2) First year teachers struggle with classroom management because they're creating a lot of lesson plans / units / curriculum from scratch.  It's very hard not to have down time as a first year teacher and the down time is what makes kids behaviors go sideways.  You're also trying to figure out what lessons have a high buy and and what lessons just flop from the jump.  All the routine, discapline and structure in the world isn't going to mean anything if you can't keep those kids meaningfully busy everyday.\n\n3) Department chairs and veteran teachers typically have the easiest classes.  New teachers are typically stuck with the remedial freshman who are bouncing off the walls.  My department chair taught 12th grade honors classes.  She was always heavily praised for how great her classroom management was, but her kids were all very well behaved and self motivated / college bound.  I think she was kind of oblivious to what our new guy was going through with his inclusion classes.\n\n4) Subbing isn't a good way to get in the door.  I've met a lot of credentialed subs who were passed over for contracted positions.  I also think long term subbing is a scam with all the work of teaching with half of the pay.\n\n5) Cellphones fried attention spans, but I think the real reason why there's so much apathy in teenagers nowadays is because school doesn't equal money anymore.  A lot of their parents and older siblings have student loan debts and are working low paying jobs.  Naturally they look at that and look at school as being outdated.\n\n6) Chatgpt and AI are going to get stronger and stronger in the next few years.  Every person I've met who works in tech is heavily confident that AI is going to completely change how we use the internet here very soon.  Google is 100 percent all in, and telling juniors and seniors to not use it is like telling them to take a horse and buggy to school instead of a car.\n\nI think there should be classes on how to use and navigate AI.  I spent the summer messing around with chat GPT and it's insanity on what it's capable of doing.  It can do a week's worth of graduate level research in 5 seconds with pinpoint accuracy.\n\n7) Coteaching doesn't work well.  It's usually one person doing all the lesson planning, teaching and grading while the other person sort of just sits there and maybe circulates here and there.  Ironically my coteacher was the most apahetic student I've had: always came in tardy, scrolled on his phone and dipped out a few minutes early.  I don't remember him actually teaching anything.  I felt resentful that he was getting paid the same salary I was without...really doing anything?  The weirdest thing was: I was struggling so much with this inclusion class that I complained to the head of the SPED department on the coteacher saying he wasn't helping and would just scroll all period.  She said \"Sounds like you need to learn how to motivate him more.\"  WHY THE FUCK IS IT MY JOB TO MOTIVATE A SALARIED THIRTY YEAR OLD?\n\n8) Some teachers are control freaks to an unhealthy level.  I'm unsure if this field attracts that personality type of if they become that way over time from this job.  I period subbed for this lady's government class during my prep.  I had a brainfart moment and told the kids to answer questions 1-4 when in reality she wanted them to answer 1-5.  I didn't notice until the bell rang.  She absolutely blew up my email the next school day acting like I commited a felony.  A piece of me wanted to tell her off, but I like not being fired.\n\n9) Mentor teachers should be paid to take on a student teacher.  I also think they should be trained on how to support a student teacher.  The lady I was placed with refused to give up any control at all and it was almost impossible to do the things I had to do for the TPA.  Those 4 months were absolutely stressful.\n\n10) The kids make or break this job.  If you work with good kids you connect with, teaching can be hillarious, fun, rewarding and even easy at times.  One year the kids were a total breeze and I truly felt like I was stealing money from this district since my job was so easy.  If the kids are blatanly disrespectful, resentful and rude...it's going to really hurt your mental health.  I put on 40 lbs last year dealing with all the stress. I always get nervous the day before a new school year knowing my fate is decided by the attendance sheet.\n\n11) Schools varry a lot.  There's several high schools in my community and they all seem like they have different vibes / cultures.  People always tell me admin creates the culture, but idk if that's true.  It's definitely very weid how one HS can be an uplifting and fun place while the one a few miles away feels like a prision.\n\n12) Teachers always say how much they love collobrating with other teachers, but everytime I ever asked for something my emails were left on read. I always thought it would be cool to collaborate and do projects with different departments, but I could never get anything to happen.  I kinda just gave up and became an antisocial island even though during the interview process they told me they don't like antisoical islands and like collobrating.\n\n13) I worked at a school with a 5 minute passing period.  The behaviors there were total shit.  I worked at a school with a 9 minute passing period, and the kids and staff seemed a lot less aggetated.  \n\nWhat are some things you think / noticed?",
    "score": 137,
    "url": "https://reddit.com/r/teaching/comments/1oxzrbw/whats_your_unpopular_opinion_about_teaching/",
    "created_at": "2025-11-15T18:57:02.000Z",
    "num_comments": 266
  },
  {
    "id": "reddit-1lzpvki",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "I’m now considered poverty in my state",
    "text": "Hi! I’m currently going to school to become an early elementary teacher. I just got a job as a paraprofessional to kick start my experience in education. \nI just received my letter of intent and my salary is listed as $19,152. This is nonnegotiable. \nIs this normal? Is this really our system? I knew it was bad. I’ve heard how stupid I am for pursuing education. Is it worth it? \nI’m going to have to maintain two job and be a full time college student. Please help. Advice, support, resources? ",
    "score": 130,
    "url": "https://reddit.com/r/teaching/comments/1lzpvki/im_now_considered_poverty_in_my_state/",
    "created_at": "2025-07-14T15:44:53.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1i2eph0",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "New teachers should be paid less and the extra money should be given to older teachers??",
    "text": "I work in a public school system (tons of behaviors low support, etc.). Today I was at a PD and heard an older teacher state that the district needs to be paying new teachers less than they do now and that money should be given to older teachers. Am I the only one who thinks this is wild? I’m a first year teacher who does get paid decently compared to others I see around the country. But for what I have to deal with on a daily basis (fights, disrespect, angry parents) I do not get paid enough. I am 100% of the belief that more experience=more pay. But at the same time why is our solution to take away from the people who are as a whole probably struggling and working the hardest? What are your thoughts?\n\nEdit: my district does pay based on experience. This specific teacher thinks new teachers salary should be lowered and the extra money should be given to older teachers. She already makes a lot more than me😭",
    "score": 96,
    "url": "https://reddit.com/r/teaching/comments/1i2eph0/new_teachers_should_be_paid_less_and_the_extra/",
    "created_at": "2025-01-16T02:30:23.000Z",
    "num_comments": 155
  },
  {
    "id": "reddit-1neaoou",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "I’ve realized I like making money",
    "text": "So I know we’re not in it for the money or whatever but I’ve realized I get a feeling of happiness and relief whenever I receive a paycheck… I just realized I wish my paycheck was a bit bigger it sucks cuz I feel like in most teaching jobs the salary base is between 50-60k and I wish I was making closer to 70k. I feel like districts are making it harder to move up the pay scale. Does anyone else share similar feelings??!!! I wish I had the skills to be in a career that made more money and unfortunately I don’t think this career is sustainable for young single people or people from a non wealthy family. \n\nThe one good thing about working at a charter for me was getting pretty decent holiday bonuses and higher than average pay but I couldn’t make it through do to how toxic it was. The only way to make more in this field is to become admin. ",
    "score": 42,
    "url": "https://reddit.com/r/teaching/comments/1neaoou/ive_realized_i_like_making_money/",
    "created_at": "2025-09-11T14:42:49.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1oy8sk1",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Do you validate?",
    "text": "Background: I live in California, I have a Bachelors Degree, and i work at a high school. \n\nIt seems that school districts each have their own unique way of honoring, validating, and compensating for teacher education usually outlined in a PDF salary schedule. \n\nOn the strict side, I hear of some districts who will ONLY honor your masters degree if it’s in the subject youre going to teach. \n\nOn the flexible side, my school district is willing to honor ANY 60 credits post bachelors as long as it benefits your professional development. Meaning, you could take a few years and take a class here and there at a college/university until you hit +60 without ever getting a masters degree. \n\nIn the middle of the spectrum, some schools will only honor a bonafide masters degree (as opposed to a “choose your own adventure” journey) but don’t care what it’s In as long as you have one. \n\nWhat goes on at your school district? ",
    "score": 33,
    "url": "https://reddit.com/r/teaching/comments/1oy8sk1/do_you_validate/",
    "created_at": "2025-11-16T01:26:49.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1kpb8c1",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "supervisor gave me very bad feedback",
    "text": "23 year veteran teacher; 25 in education; what should I do? My new supervisor gave me horrible feedback. Never in 25 years have I gotten this. I really just want to run from this profession. How after so many years am I getting negative feedback? Granted it is May. But I feel humilated. Do I just suck it up? Should I let my bruised ego get in the way of working a few more years and waiting 9 years for my full pension? Or should I quit early, get another job, and collect my pension later? I have to work with this person closely. It is very uncomfortable. I could find another job tomorrow but will get a huge paycut. I hate this so much about this profession. Why can't my years of service be accepted in a new district and get rewarded in a comprable salary? ",
    "score": 31,
    "url": "https://reddit.com/r/teaching/comments/1kpb8c1/supervisor_gave_me_very_bad_feedback/",
    "created_at": "2025-05-18T04:01:55.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1hn1o72",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "I don’t like teaching ",
    "text": "I have a good mentor, good admin, supportive coworkers, and the students are overall pleasant. But I feel dread every morning. I don’t know if I am teaching the content correctly since I’m mostly alone. I use the curriculum resources but when I compare to other subject area teachers they’re teaching differently. I’m concerned that I’m not doing enough and my students won’t pass the end of course exam. \n\nEdit: I think I do like teaching but I should add I’m extremely unhappy with my salary. I live in an expensive city and most of my paycheck goes towards living expenses. I got a scholarship/loan that I have to repay through service but I feel like if I just got a higher paying job I’d be able to repay that. I am considering living with my parents to be able to afford my life which is making me even more unhappy. ",
    "score": 31,
    "url": "https://reddit.com/r/teaching/comments/1hn1o72/i_dont_like_teaching/",
    "created_at": "2024-12-26T23:55:35.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1j7m59z",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Clock in clock out?",
    "text": "Thought I would have some fun and find out if anyone else in the country has to clock in and clock out with a badge as a salaried contracted teacher? I'm fairly certain my district is quite unique in this and they love to flex their muscles with it at every opportunity. For instance, coaches MUST PHYSICALLY clock out (even though it will automatically clock you out at the end of your contract hours) or they can accuse you of \"double dipping\". The amount of money made \"per hour\" for coaching is less than $2 an hour (it's a stipend/contract for coaching the season). \n\nBasically, we all know it's ridiculous and a freaking joke but I was wondering if this goes on elsewhere? I've never held a contract in any other district but I was educated in several states and I don't feel like this is what my teachers dealt with. 🤣",
    "score": 30,
    "url": "https://reddit.com/r/teaching/comments/1j7m59z/clock_in_clock_out/",
    "created_at": "2025-03-10T00:31:21.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1iamz21",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "What should I know about teaching in an all-girls Catholic school as a first time male teacher?",
    "text": "In continuation of my previous post and redditor u/26kanninchen's  excellent comment, for context I have decided to accept a new job teaching High School Latin at an all-girls Catholic School that as best as I can tell is a \"Status Symbol\" school. Without giving away too much details, it's located in a major American city in a very affluent suburb with good public schools. And my new school charges outrageous tuition (which is how I got a much higher than expected salary!) and markets itself on sending all their students to college. But what should I know specifically about teaching High School Latin in this kind of an all-girl's school?  I should also mention that most of my students are White (a small percentage is black and hispanic) and very few are Asians while I am a 35 year old male of South-East Asian descent.\n\nIt's daunting switching to a new career in a specific environment so any advice is very much appreciated!\n\nP.S here is my previous post [What should I know about teaching in a Catholic School as a first time teacher?](https://www.reddit.com/r/teaching/comments/1i2s5lw/what_should_i_know_about_teaching_in_a_catholic/)\n\nand  u/26kanninchen's excellent comment on the different kinds of Catholic Schools: [Comment](https://www.reddit.com/r/teaching/comments/1i2s5lw/comment/m7h5uzz/)\n\n  \n\\*Edit\\* Thanks for all the comments. They've been very helpful, and much appreciated. Please keep them coming!",
    "score": 27,
    "url": "https://reddit.com/r/teaching/comments/1iamz21/what_should_i_know_about_teaching_in_an_allgirls/",
    "created_at": "2025-01-26T18:59:48.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1pcgeos",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "HR backtracking on written statement that they will pay me more for getting licensed",
    "text": "Hi! I’m a teacher in Louisiana. I moved here last summer and accepted a teaching job. Before I accepted I asked HR through email if I would be offered more if I am licensed to teach in LA, as I was certified in my previous state (not a requirement here) They confirmed in writing that they do offer more for being licensed, so once I obtained my license I would send it to them and they could revise my salary offer. I went through hell trying to get my license for the last 6 months, finally obtained it, sent it to Hr and now the same person is telling me they don’t offer any increase in salary for being licensed. I sent back their own email stating they would revise my offer if I was licensed, but they’re ghosting me. What can I do from here? Has anyone ever experienced this?",
    "score": 24,
    "url": "https://reddit.com/r/teaching/comments/1pcgeos/hr_backtracking_on_written_statement_that_they/",
    "created_at": "2025-12-02T18:33:39.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1p5q7ur",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Best states for teaching?",
    "text": "Hi there! I’m a fifth year high school English teacher with a B.A. My fiancée is also an English teacher in high school with 8 years experience and a master’s degree. I’m certified in gifted and talented, coach rugby and am the color guard instructor with the marching band. He is a football coach who is also sped certified, though he would very much like to stay in the gen ed classroom. \nWe both teach at the same school in South Carolina, where I make about $62,000 as a fifth year with only an undergraduate degree. We’re looking to move to start fresh together in a new state—we like our lives, but I’m keen to get out of here for personal and political reasons, and he’s agreed to begin looking for a new place to live. \nWhere would you recommend applying/living as a teacher? Preferably, we would want somewhere in which we would not take a huge pay cut, or where the salary is equivalent with the cost of living—for reference, we live in a nice two bedroom apartment and pay $1,900 in rent each month (which is a little high). We’d also like to look into buying a house. Ideally, this dream place would not be too overbearing with overseeing/micromanaging teachers. Any recommendations would be greatly appreciated—thanks in advance!",
    "score": 22,
    "url": "https://reddit.com/r/teaching/comments/1p5q7ur/best_states_for_teaching/",
    "created_at": "2025-11-24T19:15:29.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1m0dza7",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "everyone’s criticising me wanting to become a teacher",
    "text": "Currently in my second year of my bachelors in Biochemistry in the UK and planning to do my PGCE almost straight after to become a secondary school science teacher, I’ve thought about this since I was a kid I’ve always loved the idea of teaching and truthfully it’s the only career path that actually excites me and it just feels like the right fit. \n\nHowever, I’ve also always been quite studious and academic and I’m the first in my family to go to University and every-time I mention to a family member even my dad and other close member of my family they seem disappointed in my choice, like they expected more from me, or that they don’t think teaching is a respectable profession. It makes me upset because it’s all I’ve ever wanted to do and my brother says I’ll be “wasting my intelligence” not that I believe this to be true because I have always appreciated every teacher I’ve ever had, and my Dad thinks I’m better off choosing a career in Biotech or Pharma for the bigger salaries.\n\nHow do I get over this judgement from other people? The only person who supports it is my mum because she can clearly see it’s what makes me happy, I don’t want to work in a science lab forever, even if the pay is great.",
    "score": 22,
    "url": "https://reddit.com/r/teaching/comments/1m0dza7/everyones_criticising_me_wanting_to_become_a/",
    "created_at": "2025-07-15T10:15:19.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1nnydln",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Teacher salaries",
    "text": "Hi I’m currently a college student getting my degree in elementary education and a masters in gifted and talented. I was wondering what the base salaries are for the states around me. I can’t decide where I should settle down after college is done. Currently I reside in NW Arkansas, I am open to any states in the surrounding area. What are some of the salaries y’all had starting out with your teaching career in your state? Also if anyone has a masters in gifted and talented what are the options to do with that? ",
    "score": 21,
    "url": "https://reddit.com/r/teaching/comments/1nnydln/teacher_salaries/",
    "created_at": "2025-09-22T20:57:13.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1p7hfq1",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "How often does your salary increase and by how much?",
    "text": "Curious about this. Google gives me percentages, which isn't helpful.\n\nI'm in FL. We're on a performance-based pay schedule. Effective (basically the minimum, since if you score below this, you're at risk of losing your job) in my district is a $1000 raise. Highly effective (extremely difficult to get in some districts and presumably predetermined and limited for the veteran teachers) is $2000.",
    "score": 20,
    "url": "https://reddit.com/r/teaching/comments/1p7hfq1/how_often_does_your_salary_increase_and_by_how/",
    "created_at": "2025-11-26T19:44:58.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1ldtrdv",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Salary reduction after signing contract due to increased rate for health insurance.",
    "text": "Is there a way to get out of my contract without them holding my license in CA? Third year teacher. My first two years at this school, employer paid premium. Now I am being told my salary will decrease by 7k. I am past the window to cancel insurance and get my own. I also commute 40 mins to work so if I factor in gas, I would make the same working in fast food/retail. I have an insane workload and have since my first year, teaching 6 preps. I applied at a different school but was rejected. I am in hiring process for a federal job, but can't get the medical paperwork they need and they may soon enter a hiring freeze.",
    "score": 17,
    "url": "https://reddit.com/r/teaching/comments/1ldtrdv/salary_reduction_after_signing_contract_due_to/",
    "created_at": "2025-06-17T17:46:45.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1l6nicz",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Should I become a high school teacher?",
    "text": "I’m 23 with a bachelors in Economics (3.1 GPA) and have a corporate sales/analyst job making under 6 figures. I am looking at my future options, and the corporate ones in my field either require a graduate degree or significant progress climbing the corporate ladder, which seems harder and harder as time goes on but does have higher salary upside.\n\nMy main reasoning for looking into high school teaching is twofold. The first is that I enjoy working with people who are facing a problem, especially if they are reluctant to learn from me or are stuck in their ways in general. I’ve worked with children and young adults in a tutoring capacity that isn’t directly relatable to teaching of course, but my interest in teaching is certainly there and so is my level of patience, and not to mention I am more than okay, closer to impressed with high school teacher salary.\n\nThe second is that high school teaching seems to be a somewhat reliable way for me to invest in myself through graduate degrees. The school systems near me (NJ) all have, after your first year of teaching, a $50,000 / year tuition reimbursement system. To me, this seems like a more reliable (but not easy) way for me to earn my graduate degrees with 1-2 classes each semester during the school year and more during the summers, though I don’t know how “free” these summers actually are for teachers, as much as most people like to hype them up.\n\nThis will help me earn a masters and PhD (hopefully) within 10-15 years which I will use to either become a college professor (a dream job of mine, though I understand how hard it is to actually get that job) or work in a corporate/federal setting in my field (economics) in a consulting or an analyst related role.\n\n\nTL;DR:\n\nI am a 23 year old male with a bachelors in economics with a 3.1 GPA. \n\nI am looking at high school teaching as more of a work-study type program where I can get my grad degrees while working and receive tuition reimbursement, while earning a wage I could be content with.\n\nI see this as a 10-15 year plan as I get my masters and PhD in either Economics or Statistics. I do not see this directly as my long term career, but more of a 10-15 year job to begin my career and progress towards either becoming a college professor or a better corporate position as either a consultant or analyst. From there, it would also be nice to have teaching as a fallback option once I’ve already put 10-15 years into the stepwise teacher salary schedule.\n\n\nMain questions I’d like answered if possible:\n\nWhat are you main stressors in high school level teaching?\n\nAre the summers really “time off”? I understand some need a part time job, but assume for this case that I will not. Will I have enough time to get my graduate degrees?\n\nIs the tuition reimbursement all it’s chalked up to be? Or is there a catch?\n\nAnd finally, if you were in my shoes, would you take the risk and stick it out with corporate and maybe get an MBA down the line to advance your career, or would you work more directly toward graduate degrees while working in a high school teaching setting, assuming that’s even possible?\n\n\nThank you very much for reading this far or even at all, I truly appreciate any and all help with this decision.\n\n\n",
    "score": 12,
    "url": "https://reddit.com/r/teaching/comments/1l6nicz/should_i_become_a_high_school_teacher/",
    "created_at": "2025-06-08T21:32:35.000Z",
    "num_comments": 206
  },
  {
    "id": "reddit-1kr2ea6",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Is it worth teaching anymore…",
    "text": "Hi I was a middle school math teacher but I left and right now unemployed. I am just doing gig work like Amazon Flex, DoorDash, Lyft, and etc. I have been selling old things I don’t need just for extra cash. I have 4 years of teaching experience which means nothing at this point.\n\nBeing honest here, I haven’t put my degree in a frame. It still sits at the bottom of my night stand as a daily reminder of my mistake. \n\nI used to think that I could be that one teacher that could inspire children to dream big and never give up. I am a big anime nerd here so bare with me here. \n\nI wanted to believe I could be like Iruka sensei from Naruto or Koro sensei from Assassination Classroom. The reason I brought up these two teachers is because they shared my belief that if one person believes in you then that changes the trajectory of your life. \n\nIf you don’t understand the references, then let’s get true stories involved. Does anyone remember the movie Front of the Class? It tells the real story of how Brad Cohen, the teacher with Tourette’s syndrome became one of the best teachers that the students and staff loved and admired. \n\nFrom fiction to nonfiction, these teachers are what I aspired to be… the teacher I never had.\nI guess reality had to remind me that just because your passionate about Math not everyone will share that same enthusiasm. \n\nEspecially people who don’t seem to have a fundamental understanding of the basic four operations. \n\nWhen people decide to pursue teaching as a career, maybe someone should have added a disclaimer stating that in America you are 95% disciplining students and 5% teaching if any percent at all. Essentially teaching is baby sitting with a salary and you get the added benefit of administration and parents that don’t treat you as a human being.\n\nI have been to multiple job fairs for school districts and decided to be honest and transparent with the recruiter or principal that was there. It turns out that the saying “ The truth will set you free.” is wrong in the sense of job hunting. So I guess lying really well must be the way up the food chain and if you have a reference or two that speaks highly of you that can help. \n\nTeaching is treasured and honored in other countries. Just do a quick Google search and you will see what I mean. \n\nI guess what I’m trying to say here is that the United States culture of education is wrong and broken. Many people of old in the past have stated similar thoughts of the matter yet no one listened. \n\nThe funny thing about this is that if you were to Google search The Great Resignation, especially talking about education is this term anywhere else in the world?\n\nThe answer is NO.\n\nDo you know why that is the case? Couple of reasons emerge one reason is that the culture understands education doesn’t start from school it starts from home. The only thing school should be is a reinforcing ground for positive behaviors but now it is a festering ground full of negative and destructive behaviors. \n\nI understand why this is still happening. So I guess the best thing to do is be like the Lorax…Unless…\n\n\n\n\n\n\n\n",
    "score": 10,
    "url": "https://reddit.com/r/teaching/comments/1kr2ea6/is_it_worth_teaching_anymore/",
    "created_at": "2025-05-20T11:22:30.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1kltigk",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "This year has been a nightmare.",
    "text": "I am a first year teacher who really needs some help. I teach in a private Christian school that is run by a pastor with no education background, he was previously a police officer. He is extremely political and is very outwardly unfriendly if someone chooses to not speak about their political opinions. I have a rule that I don't talk politics at work even if I agree with it, it just isn't something I like to do, and it bothers him that I won't speak on my opinions like the other teachers do. He often tells me I'm just too liberal. Just to reiterate... I have never once spoken on anything political with anyone I work with and I don't put anything political on my social media.\n\nThere have been five incidents this year in which he has come to me and said that \"the board\" is unhappy with me and that they don't believe I can/am do(ing) my job. After speaking with multiple members of the board I have discovered this has never once been brought up in discussion and that no-one would even agree with the sentiment. My students all improved this year in their state testing scores as well as their end of course exams; I am proud of them, and for sure know that he was never once correct in saying any of that to me. He went so far as to say that the board would be bringing in a new teacher for the final quarter to do a writing workshop with the kids because they weren't confident in me. This was also a lie, she is the teacher who will be taking over for me next year and since all of our students have 3 study halls daily (yes, literally 3 study halls every single day) she requested to come in and do anything with them to help get them through the day and to get to know them. He agreed to do this BUT only if he could completely remove my middle school students from my class and have them solely work with the new teacher. This was shot down by the principal as well as myself because we were in the middle of reading books together and it wasn't fair to just end the projects they were doing and give them zeros, which is what he requested that I do. So he agreed to allow them to do the writing workshop during one of their multiple study halls.\n\nWell now it's the end of the year and this new teacher has dozens of assignments that need to be graded and put into the grade book for students' transcripts. I have been informed that she will be grading them and that I would be responsible for putting the grades in under my name. I have completely refused as it is unethical for me to put those grades in as if I was the one who did them. I have never even seen the assignments. I also don't know if that's even legal to do. My grade book has already been closed and recorded for the past week. Is this something they can make me do? If I refuse to do it can he revoke the rest of my salary and not pay it out over the summer? How do I go about getting the borderline harassment from my boss to end? I still have a few months left in my contract.",
    "score": 10,
    "url": "https://reddit.com/r/teaching/comments/1kltigk/this_year_has_been_a_nightmare/",
    "created_at": "2025-05-13T18:30:37.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1ldvuu5",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Getting job with masters degree?",
    "text": "A few people have told me to hold off on getting my masters until I’m employed (I’ll be first year) because schools won’t wanna hire me so they won’t have to pay more vs someone with just a bachelors?? Is that really a thing? I’ll be working in Michigan the district around the area that has the highest salary bump from BA to MA is 3k",
    "score": 9,
    "url": "https://reddit.com/r/teaching/comments/1ldvuu5/getting_job_with_masters_degree/",
    "created_at": "2025-06-17T19:06:11.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1mo9pki",
    "subreddit": "teaching",
    "soc_codes": [
      "25-2021",
      "25-2031"
    ],
    "title": "Anyone left and came back?",
    "text": "I taught for seven years before having my daughter. I was in a testing a grade for all of my career. Between behaviors and the test being the center of everything I felt burned out and hated teaching. In 2022 when my daughter was born I left and started working in early intervention. I enjoy it. I get to make my own schedule and it has more earning potential than teaching as well, but right now I’m only working 2-3 days a week so I’m not making what I was teaching.  It also doesn’t have any benefits and I deal with last minute cancellations. I also work on a referral system so some months are better than others. But as I said  do love this job. However, my husband and I’d like to pay off most of our debt so I thought about returning to the classroom. We’re currently living on his income and we’d be able to throw most of my teaching salary at our student loans and cars and have it all paid off in several years. So has anyone taken time off after hating teaching and returned and loved it again? There are times I really miss it but just unsure.",
    "score": 9,
    "url": "https://reddit.com/r/teaching/comments/1mo9pki/anyone_left_and_came_back/",
    "created_at": "2025-08-12T14:07:20.000Z",
    "num_comments": 29
  }
]