[
  {
    "id": "reddit-1nx8q56",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "How do y’all deal with “only here for relaxation” clients?",
    "text": "I get these clients extremely rarely but I got another one last night. I’d never seen her before and started asking standard consultation questions and she looked at me like I was insane and said “UHHHH, I get facials to RELAX.” It really threw me off, I skipped the rest of the consultation, did our most basic relaxing facial and kept quiet so she could relax. Afterwards when my receptionist asked her how her service was she grimaced and said “it was okay.” My regular clients consistently tell me I give the most luxurious relaxing facials but these random relaxation clients always seem unhappy! Feedback? Advice? Thank you estie community💗",
    "score": 401,
    "url": "https://reddit.com/r/Estheticians/comments/1nx8q56/how_do_yall_deal_with_only_here_for_relaxation/",
    "created_at": "2025-10-03T19:29:27.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1oq5vdb",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "I got fired",
    "text": "I got fired from my esthetician job of 5 and a half years. I worked for a medical spa as one of two estheticians and worked solely on commission, and received no hourly pay. Keep that in mind. For the first 4 years I was misclassified as a 1099 and got screwed over big time when it came to taxes. Last summer I finally got switched to a W2 but was still working on commission only. Every year my (ex)boss throws a big Halloween event and we close the spa early to allow time to decorate (there was always a separate group of people that decorated) and we go home and get dressed and come back to work the event that evening for 3 hours. I have never once gotten paid to work this event but have never minded working it bc it wasn’t that big of a deal to me. So fast forward to day of event. We closed at 12:00 to “decorate” for the event that begins at 4. I only had one client that morning. I came, I performed the facial, I cleaned up, and I left. I then get a text from the owner/boss at 11:30 saying that it was “mandatory for my job” to be here to decorate for the event. I responded that I have never been asked to decorate nor do I get paid to do that or even work the event (which is all true). Her only response, “you’re fired”. FIRED!! Bc I called her out on her own bullshit!!! Every SINGLE OTHER EMPLOYEE GETS PAID HOURLY PAY. SHE WANTED ME TO WORK FOR 7-8 HOURS FOR FREE WHILE EVERYONE ELSE GOT PAID! She then stated i was being “disloyal” to her by doing so and told me to come get my shit. So that’s exactly what I did. I went up there, grabbed all my stuff, and walked out. Haven’t heard from ANYONE up there since. It’s like I vanished off the earth. \n\nNow my question is, would I qualify for unemployment? Since she just fired me seemingly for no reason? I am in Texas which I know is an “at-will” state.. but there’s gotta be something here right? ",
    "score": 217,
    "url": "https://reddit.com/r/Estheticians/comments/1oq5vdb/i_got_fired/",
    "created_at": "2025-11-06T17:55:16.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1n2teyx",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Leaving esthetics and never looking back",
    "text": "I got my esthetician license at 22 years old and I am turning 25 in a couple of months and I have been working so hard towards this career in esthetics. I know this is not universally the case for everyone and a lot of people thrive in this industry and I applaud them for that! But I have been seriously struggling financially these past three years to the point where I can no longer try and make this work. I am literally living paycheck to paycheck sitting for hours in between clients with very inconsistent paychecks. I was torn because i love what I do and it is truly rewarding. But it’s either work for a chain spa and make crappy money with no benefits or open up your own suite and be your own boss which requires so much money to even start. I feel as though I was fed a false narrative in esthetics school and on social media that this career was something that could make me financially free and that could not be farther from the truth. I now just got a job in healthcare and put in my two weeks at my current job. I feel as though this is not talked about enough and that this profession is glorified ",
    "score": 64,
    "url": "https://reddit.com/r/Estheticians/comments/1n2teyx/leaving_esthetics_and_never_looking_back/",
    "created_at": "2025-08-29T00:46:37.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1lq9ff7",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "From Solo Room Rental to a 5-Room Studio: How My Wife Grew Her Esthetics Business with Google, Not TikTok",
    "text": "My wife started Royal Glow Beauty and Esthetics in 2023, renting one room inside someone else’s salon. Just her, her tools, and zero clients.\n\nBy June 2025, she opened her own licensed 5-room salon suite. She still works solo (just one room for herself), but she rents out the other rooms to fellow beauty pros. That gives her some passive income and helped stabilize things financially without taking on employees.\n\nRight now, she brings in about $3,000/month in service revenue working just a few hours a day. Most mornings and afternoons she’s running our teenage daughter to baton and band practice, so the business has to fit around real life — not the other way around.\n\nThe suite she moved into wasn’t pretty. Old floors, ugly lights, badly painted walls. We renovated it ourselves — new paint, lighting, and vinyl plank floors — all for under $4,000. Also bought a lot of stuff from local auction sites. It’s not high-end, but it feels clean, calming, and personal. We even made all the signage with a Cricut.\n\nWhat didn’t really work:\n\n* Instagram. We posted consistently, but it didn’t bring in many clients.\n* Google Ads (at first). Not profitable on the first visit.\n* Clients getting lost in the building due to multiple entrances.\n\nWhat actually helped — especially in the last 6 months:\n\n**Google Business Profile + Local SEO**  \nWe didn’t touch this the first year. Now it’s her #1 source of new clients. We fully built out her Google Business Profile, post updates twice a week, and built simple landing pages for facials, dermaplaning, and Rezenerate. She now shows up for “facials near me” and similar searches in our area, and most new bookings come directly from Google.\n\n**Google Ads (long-term view)**  \nWe run a focused search campaign for high-intent terms like “Boardman facial” or “Rezenerate facial near me.” First-time appointments usually don’t cover the ad cost, but a good percentage rebook. Over time, the lifetime value makes the ads worth it. We now use ads to keep the calendar steady and trust the experience to do the rest.\n\n**Automated, personalized review requests**  \nWe built a simple follow-up system using [Make.com](http://make.com/), Twilio, GPT, and some code. It sends a custom text to each client the day after their appointment — with their name, service, and a thank-you message — plus a review link. It sounds like Kim wrote it herself.\n\nShe had 12 reviews before. In the past month, she’s added 10 more — just from the system running quietly in the background.\n\n**Solving location confusion**  \nThe building has multiple entrances, and clients were getting lost. We made a quick one-page site showing a photo and map of the correct door, and added that link to her Square confirmation and reminder texts. It cut down confusion and reduced late arrivals significantly.\n\n**Cricut signs and personal touches**  \nEvery door label, room sign, and window decal was made on a Cricut. It’s not designer-polished, but clients love the handmade, cozy feel of the space.\n\n**If we were starting over, here’s what we’d do differently:**\n\n* Pick a more SEO-friendly name. Something like “Royal Glow Skin Spa” might’ve helped us show up faster in search as, from what I've seen, it seems to still factor into search placement.\n* Set up GBP and review collection from day one. We waited way too long.\n* Track where bookings come from earlier. It took months to figure out what was actually working.\n\nWe’re still figuring things out, but we’ve made real progress — and the business fits our life in a way we’re proud of.\n\nI'm not an expert, but I'd be happy to give more info about more things we did, including:\n\n* Review automation\n* Landing page layout\n* Suite build-out on a tight budget\n* Local SEO and Google Ads for bookings\n\nJust let me know. Happy to share.  \nHer business is [Royal Glow Beauty &amp; Esthetics](https://royalglow.net/) in Boardman, OH if you want to see the live site.",
    "score": 51,
    "url": "https://reddit.com/r/Estheticians/comments/1lq9ff7/from_solo_room_rental_to_a_5room_studio_how_my/",
    "created_at": "2025-07-02T22:33:29.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1j9vepv",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Think Twice Before Working for EWC",
    "text": "I bring this to Reddit because I'm hoping some esthetician out there will read it and know before she walks into an interview at any European Wax Center owned by Ballast Wax, what the real story is.\n\nI won't say what level waxer I am, or which location I'm at, however, I've been an employee of the Ballast Wax owned franchise for more than two years and girl, I hope this helps you make an informed decision, as the add put out on Indeed won't accurately outline the job offer.\n\nI've been an esthi for over ten years. I have been an employee who shows up on time, I rarely ever call out, I'm reliable, I follow the rules, I'm fuckin' good at what I do, and I bring in a crazy amount of business.\n\nA month ago, I'd have told you that out of the several different EWC locations I've worked at, the Ballast Wax owners were the best. The most fair. The most understanding and kind to their employees. \n\nWhen one of the owners comes to the center to do quarterly check-ins, it's been an incredibly positive experience. I've felt seen and heard as an employee, and was led to believe that I was honestly part of the best team I've ever had the privledge to work for.\n\nI pulled in approx 60k after taxes in 2024, with a yearly average of about 10%, meaning me by myself, I pulled in 600k in profit for the company as an indivudual. Monthly, I was grossing 5k, not counting the cash tips, and I was able to do this working 30-35 hours a week. No lie.\n\nI was able to keep my head above water, save a little bit of money here and there during post-pandemic times, and seriously felt like I was finally gaining stability, and I still had time to have a life.\n\nOut of the blue, and with no warning, zero explanation from Ballast Wax, I got called into the office to be told by our saint of a manager, that our pay structure was changed effective on the very next pay period, which was a few days away.\n\nNo warning, no time to save up to pad my now non-existent savings, no reason why, no time to prepare myself to work double the hours to make the same amount I'd been making in half the time. No time to find another job, and trust me girl, if I'd had that time to prepare, I'd have been looking because the disrespect, the unprofessionalism, and the expectation that I just bend over and accept a pay cut of that size... if I'd had time to prepare, I'd have said fuck that, and left.\n\nSeems kind of like it was planned to be that way, don't it?\n\nIt used to be that you'd make so much per hour, and be given a sliding scale commission of 5-18% based on product sales, service dollars, rebooking, services per ticket, services per hour, and it meant that you had not only incentive to do better, but actually have an active hand in how much money you could earn. \n\nYou had goals! You saw your numbers move up and down, and it felt good to hit a new high, or go from 7% to 15% commission and know that you'd be able to pay for your kid's dental insurance, or finally get new tires on your car so you could continue to drive safely to and from work, or splurge on some new work shoes to keep your feet and legs from hurting so bad, or hell, buy your kid a goddamn birthday present.\n\nNow, at least at the Ballast Wax owned franchises, you'll make your hourly rate, tips, and 5% flat commission.\n\nThat's 5% no matter what your experience level is. No matter how long you've been an esthi or how long you've worked for the franchise. No matter whether you're full-time or part-time. It doesn't matter if you're Blue Level, or Red Level, everyone gets 5%, end of, zero discussion.\n\nIf you tell your clients what's up, your good ones will be kind and tip you in cash. If they don't, your tips go on your check, and those mother fuckers get taxed, so that really sweet number at the end of the pay period, the tips that make up the bulk of your income? Slashed down by the tax man.\n\nMy manager did a projection of what my next check might look like based on my previous numbers. '\n\nIt was ONE THOUSAND DOLLARS LESS.\n\nMeaning, I went from $2,500 per pay period with my then 30-35 hours per week, to $1,250.\n\nThis number was including my tips and hourly rate, so if I wanted to make that same $2,500 paycheck, I'd have to increase my work hours to 60+ hours a week.\n\nWhich is exactly what I had to do. Double the hours, for the same pay.\n\nIn the last two weeks of hellish pre-spring break on our new 5% comission flat rate, I saw 127 clients, performed 384 services, and worked a total of 120 hours for the pay period.\n\nI did 8k in service dollars.\n\nMy commission for busting my ass, driving 2 hours round trip, dragging my ass in the house at the end of the day so tired I could barely stand up straight, all for the anxiety panicked hope that working that many hours will earn me what I need to pay my rent, my bills, buy groceries AND gas to get to work?\n\n$400.\n\nMeaning, with this commission rate divided over the two-week pay period, divided by the number of clients I saw, I got paid $3.10 per person in commission, just on waxing services.\n\nIn service dollars alone, Ballast Wax made $7,600 from my labor for the pay period.\n\nProduct sales are no longer part of the commission structure either, btw. It's now a flat \"bonus\" amount per UNIT.\n\nSo, you sell 0-8 products per pay period, you get $0 of \"bonus dollars\" on your check.\n\nSell 9-12 products $20 dollars bonus\n\nSell 13-15 = $30\n\n16-18 = $40\n\n19-22 = $50\n\n23-27 = $60\n\n28+ units will be $60 + $3/unit &gt;28\n\nIf your SPT (service per ticket) for the pay period is 1.9 or greater, you'll earn a really sweet $400 bonus on your check. This is the max bonus you can earn now.\n\nBut any experienced esthetician knows how the day-to-day schedule fluctuates, and keeping that 1.9 is neither realistic, nor a goal you can actually meet. You have zero control over how many services your client will add on, unless you're being an asshole and pressuring them into it. Clients no-show. It's a slow day, a rainy day, a snow day, shit happens and you only have a handful of clients, and none of them want add ons.\n\nSo your Saturday might have been bangin, and everyone said yes to add ons, you nailed 1.9! But on Monday, you only had five clients, and two of them no-showed. Congrats, your SPT just dropped to 1.2, meaning you get $0 bonus on your check.\n\nI'm no expert, but it sure seems to me that the business itself will begin to see a rapid decline in employment once your employees realize they're literally slaving away to make sure the franchise owners don't lose any profit, but those employees are burnt the fuck out, tired, and forced to choose between whether or not they get groceries, or fill up their gas tank to get to work because they're living paycheck to paycheck, out here like so many of us right now, struggling to make ends meet.\n\nSeems to me, that if you want to keep the employees doing the bulk of that business, you know, the ones bringing in 8k and ensuring you have the most profitable two weeks of the year, the ones who are individually making you 600k per year, you might not take a dump on their front porch and tell them how great this new pay structure is working at your other centers.\n\nBut wait, there's more!\n\nA memo went out to all the centers owned by Ballast Wax on the new Attendance Policy. Pretty much everything on the new policy change is legit. Consequences for tardiness, excessive absences, failure to call in, the difference between planned absences and sick days.\n\nTotally cool. All reasonable. Hell, I hate it now that when someone is late, and they've been an employee long enough to know how long it takes them to get to work, and how traffic is between their place and the shop to manage their time accordingly, but are consistently late and texting the group chat to ask someone else who did manage their time appropriately and were not just on time, but early, to turn their pot on and make sure it's ready for them when they finally arrive.\n\nI'm all for consequences for being late, because right now, there are none, because oh wait, you can't afford to fire anyone and lose out on all that business!\n\nBut down at the bottom, the last new policy really impressed me. It's called \"On Call Policy for Missing Coverage.\"\n\nVerbatim: \"We want to support work/life balance for our teams, while at the same time being able to run the business and service guests.\"\n\nSounds legit so far, right? Wanting the business to keep going and clients getting their services. That's 100% reasonable.\n\n\"With that said, it's been reccommended across the network that each center establish an 'on call system,' in which the associates work as a team to cover shifts when associates call out or have planned time off. What has been proven to aid in the goal of always having coverage is adding all associates to a list based on SENORITY, with senior wax speciliists at the BOTTOM of the list, and newer specialists at the beginning. When an associate calls out, others will be 'on call' based on the order of the list. If, for any reason, you are unable to fill in when called, your name will be skipped and called upon during the next instance. If you are continuously being skipped, this will be noted in documentation and could result in 1 point due to lack of teamwork.\n\n\"Point assessments for lack of teamwork are treated in the same fashion as the attendance policy, meaning lack of teamork will be documented and could lead up to and include termination. The goal is not to punish, but for all associates to work together as a team and for our guests to be taken care of. EWC has a reputation to uphold, and we need to ensure we have proper systems in place to keep the business at full opperation when associates are not able to work their designated shifts. The absence policy is administered at the discretion of the franchisee and Ballast Wax Management Team. Emergencies, weather, and circumstances surrounding call offs and absences will be considered before points are accrued by the associate.\"\n\nNow, if you read that the way I did, it sure sounds like you can't have another job, or a life, or children, or the ability to drop everything and come in no matter how far away you live, no matter if you have other responsibilities to deal with on the days you don't work, or god forbid, plans. Not really a supportive \"work.life\" balance, now is it?\n\nI read that as saying, if one of your co-workers calls out sick, even if it's your day off when the phone tree gets activated and your name is at the top of the list, you can only say no so many times before you'll be fired due to \"lack of teamwork.\"\n\nThat number of times you can be skipped before being fired is 6, by the way.\n\nThis isn't a corporate policy, it's a policy created by the owner of the franchise, which they are totally within their rights as the business owner to create.\n\nHowever, new potential wax tech, you may want to think twice before accepting a full time position within the Ballast Wax network, because the juice ain't really worth the squeeze. There's no healthcare, no extra benefits, and just FYI, full-time is considered 25+ hours a week. Part-time is 24 hours or less.\n\nThe only difference between the part-time 'bonuses' and full-time are the product sales. So as a part-time tech, the highest goal for product bonuses is 15 units for a $30 bonus per pay period.\n\n30 dollars, is the difference counted between someone who's been an esthetician for two months, versus the 10+ year vet who's been with the company two or more years.\n\nPart-time or full, you'll be up to your elbows in vag 6-12 hours at a time, and depending on how fast you can get that Brazilian done, you'll be getting paid $1.00-3.00 a pop in commission.\n\nApprox $2 per product sale, and the cheapest full size product on the shelf (not counting travel size, which is considered half a unit) is $16\n\nThe average sustainable SPT is about 1.5, and at that rate you'll be getting $40 per pay check (that's $20 a week) as a bonus. Even if you're fully booked and seeing 24 clients in 6 hours, does that extra twenty bucks feel like a bonus to you? Sure, every little bit counts, but considering the type of work you do, gross, dusty, stinky, straight up nasty work, is it really worth it?\n\nI've been asking myself that a lot lately.\n\nIf you feel that's worth it, go for it. All you gotta do is show up and work, and the reputation of EWC being a consistent experience no matter which store in the US you work at, brings the clients in for you.\n\nBut keep your expectations in check, babe. The nature of the business is that it's unreliable at best, and when recession hits, people start finding ways to save, and the first thing to go are the luxuries. The majority of folks I see tell me their Brazilian is necessary to their survival. But their brows? Their inner thighs? Underarms? All those extra little add ons that will get you closer to your 1.9 goal? They can just shave that, and they will.\n\nThe truth is, no matter how many repeat clients you have who faithfully book every four weeks, you've got twice that many who will stand you up, show up late, be rude, nasty, FILTHY, and you'll have pay-periods were the weather keeps people safely at home, or the center shut down, and you can't pick up enough extra shifts to cover the difference.\n\nI love my team, the women I work with are genuinely the best, but at the end of the day, my relationships with my co-workers aren't paying the bills, my franchise owners have shown their true greed driven colors, and I hope to god you get an HONEST accounting of what it's like to work for a franchise like EWC from the hiring manager.\n\nFacts: When it's good, it's great. But girl, when it's bad, it's so hard to show up and do your best, knowing that your franchise owners are willing to cut your check down by a thousand dollars, be totally okay with you working double the hours for the same amount of pay, cutting corners on the quality of supplies you need to provide the best service possible, just to maintain their own personal profits when maybe, they shouldn't have bought up a bunch of new franchises before giving the ones they already owned, the corporate required refresh they deserve.\n\nThis week, I heard from a client who surfs reddit and the finance network (their words) 50 EWC locations in California are about to get shut down. Meaning clients will travel farther, you might travel farther if you're going to continue working for the franchise in Cali, and as the next recession continues to get closer every day, you might be better off somewhere else.\n\nBut hey, hopefully those franchise owners will pay you better, because it's up to the individual franchise owner to decide how they pay their employees.",
    "score": 47,
    "url": "https://reddit.com/r/Estheticians/comments/1j9vepv/think_twice_before_working_for_ewc/",
    "created_at": "2025-03-12T21:31:21.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1kfufpp",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "I’m officially leaving the industry",
    "text": "Someone please tell me they can relate so I know I’m not the only one… I’m around 3 years in, 27 years old and I’m broke. I’m just in such a saturated area and even though I’m at a busy salon where I get the chance for referrals from stylists all the time, I post ads once a week, I leave my cards with EVERYONE I interact with in public, I network, I post every day, I do referral specials, discounts, etc I still cannot fill my book in any sense. To be completely transparent I only made $23,000 last year and that was even less than the year before. So with all that said, I’m going to be attending online school to finish my bachelors degree for the next year and a half. I’m just heartbroken because I do love my job and I’m pretty good at what I do, but I can’t possibly have a living off of this. The market is so incredibly saturated in my area, and people just do not want to spend money on these things anymore.",
    "score": 36,
    "url": "https://reddit.com/r/Estheticians/comments/1kfufpp/im_officially_leaving_the_industry/",
    "created_at": "2025-05-06T03:00:10.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1n84j9f",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Feedback on the home studio I created for my GF",
    "text": "I used to have a home office lol. But my GF has been doing so well with her private client business that I decided to give it up in order to give her a home studio. I love that she is branching out on her own since she’s been at the same clinic for years and deserves her own business. Unfortunately, an entire clinic space and everything that entails is not in the cards for me or us financially atm so I’m using what I have. A commercial red light setup is in the works but they are pretty expensive. Other than that, what would you change, add or remove? Any feedback is greatly appreciated! Thank you! \n\nHere’s a list of small details I’m personally proud of: the 1 of 10 Gray Malin photo, the Frette cashmere throw on the chair, the silk rug, the water and cookie station, and the playlist I made for her. ",
    "score": 31,
    "url": "https://reddit.com/r/Estheticians/comments/1n84j9f/feedback_on_the_home_studio_i_created_for_my_gf/",
    "created_at": "2025-09-04T08:27:13.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1oq6rk1",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "No questions to ask...",
    "text": "...just want to tell fellow estheticians, in case no one has told you lately, that you're doing a great job. \n\nOur jobs are hard. Don't get me wrong, I love what we do. I've been doing it a long time and I still enjoy it as much as I did when I first started. I'm thankful for that. But some days just hit harder than others. Especially if you're exhausted and have nothing to give. It's incredibly difficult to pour from an empty cup and we're in the position of giving. \n\nI was doing a facial yesterday and the client was blissfully snoozing away and all I wanted in that moment was to be a client. So I think I'll be making a facial (and maybe a massage!) appointment for myself in an attempt to refill what's not there at the moment. \n\nI hope you have a good day today. And if you're not, it's OK and it will pass. Remember to take care of yourself too. \n",
    "score": 30,
    "url": "https://reddit.com/r/Estheticians/comments/1oq6rk1/no_questions_to_ask/",
    "created_at": "2025-11-06T18:27:43.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1kjievl",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Why I Walked Away From Rhonda Allison",
    "text": "TL;DR: I joined RA’s Aesthetic Grad Program and invested over $2,700 into their Pro Youth, pigmentation, and acne lines, expecting a mix of pro and retail sizes. Instead, I received three large boxes of mostly retail — no true pro sizes. When I asked why, I was told it was to “set me up for success” by letting me test their products, and that I’d need to pay $516 more for pro sizes. After I pushed back, they lowered it to $350. I chose to return everything—and still had to pay nearly $100 in return shipping. They’re now updating the program, but only after I escalated the issue. It felt like damage control, not genuine support. I can’t recommend RA to solo estheticians.\n\n⸻\n\nFull Story:\n\nI want to share my experience with Rhonda Allison (RA) so other solo estheticians can make informed decisions about where they invest their time, energy, and money.\n\nWhen I first connected with RA, I was excited. The brand presents itself as clinical, professional, and esthetician-forward. I was told that by joining their “Aesthetic Grad Partnership,” I would receive both backbar and retail sizes—an ideal way to start building a functional treatment room.\n\nInstead, I received three full boxes of mostly retail products—full-size retail, travel sizes, and even sample-size vials. There were no true professional sizes for core products like cleansers, toners, or moisturizers. This made it impossible to operate professionally without opening dozens of small bottles in every service.\n\nRA does have professional sizes, but they didn’t send any. When I asked why, I was told this was intentional—to let me “test the products” first. But I had already invested over $2,700. If that level of commitment doesn’t qualify me for a proper professional setup, I don’t know what does.\n\nWhen I expressed frustration, I was told I could upgrade to pro sizes for $516. After pushing back, they reduced it to $350, but it still felt like a squeeze for more money—not an effort to genuinely resolve the issue. I didn’t want to “test” anymore. I wanted to treat. This felt like a way to offload retail inventory, not support a new esthetician.\n\nWhen I chose to return the items, I was told I’d have to pay return shipping—and potentially a restocking fee—despite the miscommunication coming from their end. I escalated the issue all the way to the CEO. In the end, I still had to cover nearly $100 in return shipping.\n\nThe experience left me emotionally drained, disappointed, and deeply frustrated. I felt like a transaction—not a partner.\n\nSoon after, I connected with a different brand. The contrast was immediate. I felt heard, respected, and supported. The rep was calm, transparent, and collaborative. It reminded me that practitioner-first partnerships do exist, and that I wasn’t asking for too much.\n\nThe CEO later informed me that RA will now offer both backbar and retail options to new grads—but this came only after I voiced how misled I felt and pushed hard for change. It didn’t feel like a proactive decision to uplift estheticians—it felt like reputation management after being called out.\n\nRA may change their program for future estheticians, and that’s great. But it doesn’t change how I was treated.\n\nIf you’re a solo esthetician, especially one building your studio from the ground up, you deserve better. Choose brands that see you as a partner—not just a purchase.",
    "score": 26,
    "url": "https://reddit.com/r/Estheticians/comments/1kjievl/why_i_walked_away_from_rhonda_allison/",
    "created_at": "2025-05-10T19:36:41.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1m0r6bs",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Esthy job posting required recent photo to be considered…",
    "text": "Ran across a promising job posting recently well, until I got to the bullet point that required a recent selfie to be considered as a candidate. It’s like they don’t even care how discriminatory that comes across as. What are your thoughts on requiring pics to get an interview? \n\n",
    "score": 25,
    "url": "https://reddit.com/r/Estheticians/comments/1m0r6bs/esthy_job_posting_required_recent_photo_to_be/",
    "created_at": "2025-07-15T19:25:42.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1koyji6",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "I got a bad review and don’t know how to recover emotionally. I feel like a fraud.",
    "text": "I work for a facial spa and got a 1 star review from a client I recently saw. She got a facial and a 30 min extraction enhancement. I have never felt comfortable with extractions, and I didn’t see many comedones on her skin to begin with, so I recommend a superficial peel instead, but she wanted extractions. I performed the extractions by applying a scaling gel and going over areas of congestion with an ultrasonic tool and getting out the few extractable comedones there were.\n\nAt the end, she was very unhappy with the redness and irritation of her skin. She asked me recommendations to help the redness do down. I suggested using cool globes if she had them or safely icing her face (not ice straight on the skin). She wasn’t satisfied with that answer.\n\nAlso, I asked her if she exfoliated at home. She did not, so I explained how exfoliants work and why I thought it would be good to incorporate it into her routine and how it could help address her concerns even better than extractions. I recommend one of the products we sell at the spa. In her review, she said I was pushing products in her to hide the fact I was inept at my job.\n\nI’m upset. I have less than a year of experience as an esthetician, and though this is my first bad review from a client, I’ve already had more than a handful of bad facials and unhappy clients and real mistakes I’ve made. I don’t know if this is normal. I feel like an absolute fraud, and as much as I love being in the industry, I don’t feel adequate enough to be here.",
    "score": 21,
    "url": "https://reddit.com/r/Estheticians/comments/1koyji6/i_got_a_bad_review_and_dont_know_how_to_recover/",
    "created_at": "2025-05-17T17:35:16.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1os6rjr",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Seeking advice after a bad experience at Ulta Brow Bar",
    "text": "Hi! I’m posting here in hopes of getting some advice from someone who has worked at Ulta Benefit Brow Bar and knows how I can best address what happened. \n\nToday I went for a brow lamination and shape service. I have had many, many waxes and laminations over the years at various Ultas so I have a good idea of what to expect. \n\nThe individual providing the service was very nice and assured me she has been doing this for years and that brow lamination is actually her favorite service to provide. \n\nFirst, she waxed and trimmed my brows. I found this odd since others have always done the wax last, but I thought “whatever, she’s the expert”.  \n\nFast forward to the end, she handed me the mirror and my brows looked crazy. Like not even brushed, not trimmed correctly, one side cut shorter than the other side. \n\nI’m definitely no expert, but I’ve had this done enough times to know this was drastically different. I’m very introverted and people pleasing, so I didn’t make a big deal of it at the store. I just said thank you, paid, and left. I know they’ll grow back and it’s not a huge problem in the long term, but I am unhappy that I paid so much for something that wasn’t done very well in my opinion. Am I overreacting or would you feel the same way? \n\nAnyway, I’d love some advice on how (or if) I should go about addressing this. Can I write a complaint to Benefit or Ulta? I’m really not trying to be mean, I just think this person needs more training and tbh I would like some sort of compensation or store credit. \n \nTLDR: I got brows done poorly at Benefit Brow Bar and I want to know who I should seek out to file a complaint with and if it will even do anything or if I’m being unreasonable. ",
    "score": 21,
    "url": "https://reddit.com/r/Estheticians/comments/1os6rjr/seeking_advice_after_a_bad_experience_at_ulta/",
    "created_at": "2025-11-09T01:44:37.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1lqtsdj",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Are esthetician schools really honest about how tough this path is?",
    "text": "I’ve been doing some deep thinking and research, and I’m genuinely curious: Do you feel like esthetician schools are *fully honest* about how hard this career can actually be?\n\nThere’s a lot of emphasis on the beauty, creativity, and freedom side, but barely any real conversation around:\n\nHow saturated the industry is in certain areas. and how hard it is to get hired right out of school, especially without experience, and how competitive it is to build a loyal clientele unless you land in a high-traffic or upscale location, and how emotionally and physically demanding the job is (you’re on your feet all day, performing, keeping up energy) And how *much selling* is required once you’re hired?  \n  \nThat last one hit me hard. Nobody tells you that once you’re working, especially in a franchise setting like Massage Envy or Hand &amp; Stone, you’ll be expected to push memberships and retail products constantly. It's a full-on sales job, often with unclear commissions or quotas. And from what I’ve seen, a lot of estheticians end up at the front desk just trying to hang on until they eventually burn out and walk away, confused about what just happened.\n\nIt seems like the women who’ve been around and are much older and, built a reputation and landed in the higher-end spas are the ones who get to stay. But even then, it looks like a hustle.\n\nFor me, I know going solo is probably the best bet long-term but let’s be honest: that takes *a lot* of money, financial stability, business knowledge, marketing, sales skills, and being in a location where people will *actually spend money* on this kind of “luxury” service. Not everyone is in that kind of situation.\n\nSo I’m asking the community: What do you *wish* someone had told you before you started esthetician school? Is there a better path? Or is it just something you figure out (and survive) as you go?\n\n",
    "score": 20,
    "url": "https://reddit.com/r/Estheticians/comments/1lqtsdj/are_esthetician_schools_really_honest_about_how/",
    "created_at": "2025-07-03T16:20:12.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1ozidm7",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Please help",
    "text": "Hi everyone, I’m looking for clarification and advice from anyone familiar with microneedling devices.\n\nI booked a microneedling package with someone because her Facebook post said she uses SkinPen. During my consultation I specifically asked about SkinPen again, and nothing was mentioned about not having it.\n\nAfter my appointment I was editing a TikTok video I recorded and noticed the pen used on me was silver, short, and looked more like a Dr. Pen style device rather than a SkinPen. My skin also wasn’t red at all after the microneedling, which seemed strange because every other time I’ve had microneedling I left looking very flushed. This time my skin looked exactly the same as when I walked in.\n\nWhen I asked her about it she claimed it was “an older SkinPen,” but as far as I know SkinPen has only had one model since 2018 and it is navy blue. I cannot find any record of a silver SkinPen ever existing.\n\nAnother thing that worried me was the aftercare. As soon as the treatment ended she applied azelaic acid, vitamin C, and SPF on my freshly needled skin. I’m not certified in microneedling so I don’t pretend to know everything, but I do know you are not supposed to apply acids or vitamin C for at least seven days after true microneedling because the skin is still healing and it can lead to irritation or complications.\n\nShe refunded the remaining two sessions but refused to refund the session I received, saying I got a full service even though it wasn’t the device I paid for.\n\nI’d really appreciate any clarification from people who know more about microneedling than I do. Does this seem like misrepresentation, or am I misunderstanding something?",
    "score": 19,
    "url": "https://reddit.com/r/Estheticians/comments/1ozidm7/please_help/",
    "created_at": "2025-11-17T14:55:15.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1ld18z9",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Ingredients Master Study Sheet",
    "text": "hi everyone! i posted this as a reply to [someone else's post](https://www.reddit.com/r/Estheticians/comments/1l7rc6s/comment/mx1pqs4/?context=3) about a week ago on tips starting at your first job out of school, especially remembering so many ingredients. i shared the link to the sheet i wrote up on that post, but i thought i'd share it on its own as well since there was some interest!\n\n  \nthis is what really helped me when i was first learning - my teacher gave us a whole packet with ingredients in alphabetical order. i filled in every single one, then when i got my first job out of school and was reviewing the product line, i added the top 2-3 ingredients from each one and filled out my packet if they weren’t in there already. i know it sounds overwhelming - but reviewing it every single time i came across an ingredient really helped to check back and my memory was so much better when i hand wrote the information!!\n\n  \nlong story short, this is a google doc you can make a copy of to study your ingredients, make personal notes, etc and add your own ingredients!\n\n[https://docs.google.com/document/d/1ElIrPqtlpxzXRq4kVVWZtEOZzQaRrRU-lBmERYa8y8A/edit?usp=sharing](https://docs.google.com/document/d/1ElIrPqtlpxzXRq4kVVWZtEOZzQaRrRU-lBmERYa8y8A/edit?usp=sharing)",
    "score": 19,
    "url": "https://reddit.com/r/Estheticians/comments/1ld18z9/ingredients_master_study_sheet/",
    "created_at": "2025-06-16T18:51:11.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1orq10o",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "45 years",
    "text": "In March 2026, I will celebrate my career of 45 years as a Licensed Facialist/Esthetician.   \nThis is a big milestone for me and I want to celebrate.  Looking for ideas.  Thank you in advance. ",
    "score": 18,
    "url": "https://reddit.com/r/Estheticians/comments/1orq10o/45_years/",
    "created_at": "2025-11-08T13:56:09.000Z",
    "num_comments": 4
  },
  {
    "id": "reddit-1i2xay8",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Got fired from European Wax center",
    "text": "So I’d been working there 2 months and I kept quiet to myself because I didn’t really know anybody. I would watch videos and the things they told me to correct, I did. My reviews had gotten better and I started reaching my sales goal I just didn’t interact with the managers there because I wanted to keep a low radar. Well today they informed me I wasn’t a good fit and I should’ve progressed more and they terminated me. Idk I feel like it was a blessing but I just feel like shit because this was my first esthetician job and I just wanted to be good at it ",
    "score": 18,
    "url": "https://reddit.com/r/Estheticians/comments/1i2xay8/got_fired_from_european_wax_center/",
    "created_at": "2025-01-16T19:38:07.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1nr2elb",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "The washing machine broke at the spa I work at.",
    "text": "I guess cutting towels is fine but like they ran out of nearly everything yesterday and the head LE didnt think this could be a problem today?? Also why i hate spa owners who actually dont know how the treatment room works. The owner only brought large towels thinking it would suffice. Now they are asking LEs to cut huge towels which im sure will be difficult since they are so large and we only have children's scissors at the spa. Even with regular scissors it would be hard to be honest. We already are so low on towels and now we are just gonna ruin the ones we have.",
    "score": 17,
    "url": "https://reddit.com/r/Estheticians/comments/1nr2elb/the_washing_machine_broke_at_the_spa_i_work_at/",
    "created_at": "2025-09-26T14:11:38.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1jc5d39",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "ULTA BEAUTY",
    "text": "You’d think working at Ulta would be nice while trying to gain clientele? Well wrong. I just had one of the most interesting interviews the other day at Ulta  and was complete thrown off by their expectations of their employees, let alone the way I was expected to show up to my interview in full glam and the lady called me out for wearing little makeup.. like wouldn’t you think an esthetician would want to look clean and fresh??? i literally have my lashes done all the time and fill in my eyebrows and put a little powder and highlight on for this interview but she said I would need to wear more for the next interview 😭 anyways she starts telling me they only ever hire 1 esthetician for the brow bar, full time 11-7 or even sometimes 8 with only mondays off which isn’t even bad, BUT they expect you to have 2 clients an hour every single day in order to meet your goal you have to make. She started asking me if I had clients of my own that I can bring in… like if I had 2 clients an hour I wouldn’t be looking for a side job anyways?? and they charge $30 a brow wax and $100 for brow laminations &amp; you only collect tips off of the service😭 absolutely not girl",
    "score": 17,
    "url": "https://reddit.com/r/Estheticians/comments/1jc5d39/ulta_beauty/",
    "created_at": "2025-03-15T21:14:18.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1pbgbt1",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Can’t get a job",
    "text": "A month ago today I got fired from my med spa job of five years and since then I have found it IMPOSSIBLE to get another job in this industry at least as a W2 employee. I have had ONE interview two weeks ago and haven’t heard back. One other opportunity I have called 3 times and they told me to just “hang in there” …. Huh!!!! I understand in this economy it’s going to be incredibly difficult to even afford a facial or a massage. So now I’m stuck wondering “is that it? Am I done being an esthetician?” I cannot afford to be a 1099 and work for myself. Anyone else in the same boat? ",
    "score": 16,
    "url": "https://reddit.com/r/Estheticians/comments/1pbgbt1/cant_get_a_job/",
    "created_at": "2025-12-01T15:52:52.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ir9tt0",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "being a lash artist is causing me severe mental health issues",
    "text": "im in a private suite all day by myself no coworkers &amp; most of my clients just sleep during their lash appointment. theres barely any socialization &amp; now when im in social settings or around alot of ppl i panic im finding it very hard to stay relaxed during silent sessions, i get a knot in my throat &amp; cant stop swallowing. i wonder of my clients can hear me…im so tired of being quiet all day i want to scream i want to talk i want to connect with ppl i paid 3500 for a marketing company to get my lash clients &amp; im grateful, i was able to quit stripping. but now i feel like i have my “dignity” but am so anxious all the time. i have ptsd &amp; now because of my lash work i feel anxious doing any kind of work. i miss being a junior stylist blowing hair &amp; assisting other artists, running around a salon shampooing hair fetching tea, i miss the high speed &amp; sitting down hunched over in one position is driving me crazy. i cant supoort myself on an assistants salary…please help. i thought about switching to waxing but i dont know how to get waxing clients &amp; its been years &amp; years since ive done it although i wax off everything myself &amp; do my own brazilians. the marketing company i hired is only for lash extensions. &amp; please dont say therapy ive been various therapists for years now &amp; coaches &amp; they give me tools that help me cope but has not gotten rid of symptoms. i also tried psych meds, only made anxiety worse. please help, any advice ideas much help. i want to maintain the same standard im living now ",
    "score": 16,
    "url": "https://reddit.com/r/Estheticians/comments/1ir9tt0/being_a_lash_artist_is_causing_me_severe_mental/",
    "created_at": "2025-02-17T02:51:38.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1pjlhje",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "TDLR reporting!",
    "text": "Well well well. About 6 weeks ago, I posted in this thread that I was fired from my job as lead esthetician at a med spa. I have since then been REJECTED unemployment and am in the process of filing an appeal. In the initial texts being fired from my boss, she said “I have four lined up for your job, come get your shit.”  Fast forward to TODAY and I find out via Facebook/the company’s website; SHE FORCED HER OTHER DAUGHTER TO GO TO ESTHETICIAN SCHOOL! AND IS ALLOWING PEOPLE TO BOOK WITH HER ONLINE AT THE SPA FOR PAID FACIAL SERVICES!!!! The OLDEST daughter was also forced to be an esthetician alongside me, and now that I’m not there, now the youngest daughter is being forced to be one because the owner/their mother CANT AND WILL NOT HIRE AN ACTUAL ESTHETICIAN! I have now filed two anonymous reports to TDLR and would love to hear y’all’s thoughts about how long you think this might take and how many reports I should make lol. ",
    "score": 15,
    "url": "https://reddit.com/r/Estheticians/comments/1pjlhje/tdlr_reporting/",
    "created_at": "2025-12-11T02:03:27.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1l9twos",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Just Launched My Sticker Brand for Beauty Pros✨ Would Love Your Thoughts!",
    "text": "Hey everyone! After months of designing, testing, and obsessing over finishes and colors, I finally launched my own sticker brand — Taurus Touch Studio!\n\nA brand dedicated to the \"in-between\" moments of beauty pros—between clients, appointments, career levels, and personal/business growth. Taurus Touch Studio is here for the *real* moments in beauty—not just the glam. We're the in-between wax strips, late-night inventory runs, and “omg where’s my tweezers?” kind of brand.\n\n🌈 Printed on premium white vinyl\n\n💧 Laminated with a glossy finish\n\n✨ Weatherproof + scratch resistant\n\n🖤 Inspired by Chicano culture + San Diego roots\n\nI’d love for you to check them out and let me know what you think — I’m still small, still learning, and any feedback means the world.\n\n[https://www.instagram.com/taurustouchstudio/](https://www.instagram.com/taurustouchstudio/)\n\nThanks for creating such a cool space here! ",
    "score": 15,
    "url": "https://reddit.com/r/Estheticians/comments/1l9twos/just_launched_my_sticker_brand_for_beauty_pros/",
    "created_at": "2025-06-12T18:26:13.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1n0ulkc",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Should I report my workplace to state board for insufficiently handling a mouse problem?",
    "text": "About two weeks ago I noticed mouse poop in our snack bin (that I had eaten out of the week before 🤢) and notified my manager immediately.They disposed of the snack bin and pest control came a few days later and laid traps but we still kept finding mouse poop in the storage room, in the treatment rooms including countertops and ON TOP OF THE WAX POT LID, and we discovered they had made a nest out of toilet paper in the box we keep the paper hand towels, it looks like the nest was cleaned up but they expect us to keep using them. Last night I went to go grab a box of gloves and mouse poop I hadn’t noticed rolled off of it. There was more poop in a box of gloves that was already opened too. They claimed that a biohazard team was coming in to do a deep clean but that was over a week ago and nothing has happened. I am absolutely disgusted and it feels like they’re trying to save money by not replacing contaminated supplies and taking greater measures to handle the problem.\nI’ve given them two weeks to handle it but at this point I feel like I need to report it to state board and/or the health department. My only worry is that we would get shutdown permanently and there’s not really anywhere else hiring right now, or that they would find out it was me and retaliate. What do I do?",
    "score": 14,
    "url": "https://reddit.com/r/Estheticians/comments/1n0ulkc/should_i_report_my_workplace_to_state_board_for/",
    "created_at": "2025-08-26T19:00:02.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1m1c2f0",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "First Out Of School Offer Letter",
    "text": "Hi fellow Estis! I graduate Esthetician school at the end of this month, and I have been in an interviewing process with a local independently owned high-end Medspa for the past month. They found me through my social media and initiated the hiring process without me seeking them out. I really connect with everyone there and think it will really suit me, I agree with their values and the way they run things.\n\nI just received my offer letter last night. It stated that:\n- I will be a part time, W2 employee with a 90 day reevaluation period\n- Training on \n      • Laser Hair Removal\n      • Hydrafacial\n      • Skinpen Microneedling\n      • ZO Skin Health, Skinceuticals, SkinBetter, Alastin, Colorscience &amp; Epinonce product training\n      • Face Reality Acne Bootcamp course after the 90 days (I expressed to them I want to specialize in acne so they added this which they don’t traditionally don’t offer these services)\n- 30% commission on services\n- 20% commission on retail &amp; laser hair removal treatments\n- 100% tip retention \n- Hours available Tuesday-Friday with a 2 Saturday per month commitment.\n\nIs this a good offer? I’m already certified in Microneedling but I want to further my education since I feel like it lacked. \nI don’t really know anyone else in this industry so just looking for some guidance. I live in Indiana as a reference as well if that means anything. \nI am hugely attracted to this role for all the included education. I want to eventually end up solo but gaining experience and knowledge is really important to me.\n\nThank you for the help in advance!! &lt;3",
    "score": 14,
    "url": "https://reddit.com/r/Estheticians/comments/1m1c2f0/first_out_of_school_offer_letter/",
    "created_at": "2025-07-16T13:04:31.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1n1icm7",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "my teacher put menthol and arnica gel inside me. lotion. and a mask after my brazilian",
    "text": "Hi so I got a brazilian yesterday, (i’m an esthetician student) All was fine and good but the wax gives me a reaction. I would insert the picture but i don’t know if that’s allowed.\n\nANYWAY. the last time i got a brazilian we used the russian pearl or white russian. something like that. and it made me break out in hives. now this teacher is not my main instructor. she’s only with us on tuesdays and nobody in our class likes her. like she’s genuinely a rude person and she says she’s blunt (you’re not blunt you’re just rude)\n\nso the last time she gave me an ointment and put it on me and it helped. now this time it was burning bad and inflamed. i’ll add a picture but only zoomed in on the specific part. so we called her in to show her the reaction. she claimed it was the satin release oil and that i’m allergic to almonds (i’m not..?)\n\nso she got some menthol and arnica gel and said she was going to put it on to cool it and it would help. i said okay and i trusted her. imagine my surprise while im butterflying. she goes straight up and into the vaginal opening.\n\nmy friend macy who did the brazilian on me looked at me in horror. and i looked back because what the fuck. she asked if it felt better and i said it was burning. so she grabbed some lotion. and put it inside there too. me and macy were looking at each other with fear on our faces.\n\ni told her it was really burning and she said “let me think. i’ll be right back.” and she leaves the room\n\nMacy turns to me and said “dude she put that right into your vaginal cavity.”\n\nI was silent because i was in shock. i wanted to cry because of the pain.\n\nnow my teacher comes back with an oat jelly mask and once again. puts it inside me. so i’m giving her a little bit of the benefit of the doubt. she does brazilians all day everyday and she’s probably not thinking about where her hands are going.\n\nnow i went to pee later i wiped and found oat mask inside of me. so i went to her and said “hey i found mask inside of me.”\n\nand she goes “you’ll be fine.”\n\nbut when it comes to a brazilian you have to pay attention. i’m in so much pain right now and itching like crazy from that. what do i do?\n\n",
    "score": 13,
    "url": "https://reddit.com/r/Estheticians/comments/1n1icm7/my_teacher_put_menthol_and_arnica_gel_inside_me/",
    "created_at": "2025-08-27T14:19:48.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1nbxfh5",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Who wears gloves for facials?",
    "text": "I've been in the business for 26 years and haven't ever used them other than for Bikini waxing. But I see almost everyone using them now? I like to feel the skin as I work and I don't understand how it's possible with gloves on. *I do guard my fingertips for extractions, of course. ",
    "score": 12,
    "url": "https://reddit.com/r/Estheticians/comments/1nbxfh5/who_wears_gloves_for_facials/",
    "created_at": "2025-09-08T19:32:41.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1ovdown",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Why are so many estheticians burning out and what actually helps?",
    "text": "Hey Girlies, \n\nMost of us got into beauty because we *love* the artistry and helping people feel like their best selves. But when you’re juggling clients, marketing, and payroll, that creative spark can fade fast.\n\nBetween staying on top of every trend (laminations, hybrid stains, lifts) and keeping a steady team, many amazing estheticians end up doing more admin than actual esthetics.\n\nI’ve seen this pattern a lot: incredible talent stretched thin by the business side. Some have found relief in structure, systems, memberships, or even joining brands that take the operations load off so they can get back to the craft.\n\nCurious to see how everyone here’s managed burnout... What's helped you protect your *passion* and your *peace* while running your business?",
    "score": 12,
    "url": "https://reddit.com/r/Estheticians/comments/1ovdown/why_are_so_many_estheticians_burning_out_and_what/",
    "created_at": "2025-11-12T18:47:01.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1lpubrc",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "1.5 years licensed, no job yet. Is it time to move on?",
    "text": "I graduated from esthetician school 1.5 years ago and got licensed in two states (I live near the border). Shortly after, I started applying for jobs. After a lot of radio silence, I accepted a front desk receptionist position at a spa chain with the promise of moving into an esthetician role when one became available.\n\nI soon found out there were already two other receptionists who had been hired under the same promise. Still, I stuck it out—taking any training, education, or advice I could get from the experienced estheticians there, all while continuing to interview elsewhere.\n\nDespite my best efforts (cold calling, walking in to apply in person, following up by email, etc.), my job search was pretty discouraging. At one interview, they literally forgot about me in the waiting room for almost two hours.\n\nEventually, I landed an esthetician position—but they wanted me to work front desk for the first 4-6 weeks to learn their packages and how the business operated. I completed all their training, came in early, stayed late, and basically did whatever I could to prove myself. They assured me that lack of experience was fine and they’d train me.\n\nThen I noticed they posted a new ad online looking for an “experienced esthetician.” Within a week, my hours were cut. I got a call from the new manager saying they’d done a “two-week trial” with me (something I’d never been told about or seen in my offer letter), and they decided to stick with their existing estheticians. I was never even allowed to do a demo, never got proper training, and spent maybe five minutes total with the lead esthetician. When I asked if it was something I did or didn’t do, the manager just said, “It had nothing to do with you.”\n\nNow, I’ve applied to nearly every job within a 25-mile radius—most of them multiple times. I keep my resume updated, work on my skills, stay current with industry knowledge, and keep my professional socials active. But I haven’t heard back from a single place, not even for an interview.\n\nI’m honestly starting to think I should give up on this entirely and look into other schooling. Has anyone else been in a similar spot and managed to pull through? Is there anything more I can do before throwing in the towel completely?",
    "score": 11,
    "url": "https://reddit.com/r/Estheticians/comments/1lpubrc/15_years_licensed_no_job_yet_is_it_time_to_move_on/",
    "created_at": "2025-07-02T12:17:14.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1lb8z3z",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Depressed esthetician working at resort spa",
    "text": "I’ve been working at my spa since we opened, and it is my first esthetic job. I am so greatful, and I’ve also worked hard to get my position but I still can’t help but feel like I’m not good enough to be there. I’m still having trouble learning specific ingredients and selling product, and that makes me feel worse because I feel like I’m not prepared. I doubt every facial I do, and have a hard time being confident in my techniques. \n\nWith that being said, I have life stuff going on as well and am very depressed. I’m having a really hard time trying to fake being happy when I meet the guests, or even caring about their stay or service or skin because I’m unhappy. I feel like I’m stuck between a rock and a hard place, I don’t work enough to be full time to get health insurance to afford going to a therapist. The health insurance I have rn doesn’t cover anything. \n\nI feel ugly and worthless in an industry where every person is judging you based off your appearances. I don’t even think I could get a different job doing something else bc of my anxiety. \n\nIs there anyone else who has delt with something like this? And how do you cope everyday? ",
    "score": 11,
    "url": "https://reddit.com/r/Estheticians/comments/1lb8z3z/depressed_esthetician_working_at_resort_spa/",
    "created_at": "2025-06-14T13:41:07.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1ivuksp",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "currently in esthetics school",
    "text": "currently in esthetics school and noticed the other girls were talking about instagram accounts and i was wondering if this was a necessity to getting clients? i was thinking of starting one once i was out of school and starting my career, but i didn’t know if i should start one now? ",
    "score": 10,
    "url": "https://reddit.com/r/Estheticians/comments/1ivuksp/currently_in_esthetics_school/",
    "created_at": "2025-02-22T22:13:32.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1n21zlf",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "I’m about to start my first job as an esthie!",
    "text": "I’m about to start my new job as an esthetician. I’m an employee. The shop I’m working at isn’t a spa it’s actually a hair salon and the manager is letting me have a booth in the back of her spa. They’re letting me have a lot of freedom. Making my own service menu. However they asked me to only start off with a few facial services to start with as this is also an experimental situation for her as well having a booth for an esthetician. I have so many questions and am so nervous. Maybe I’m overthinking and being silly but I keep asking myself questions like:\n\nWhat if I forget how to do some of the services I learned in school?\nWhat if I accidentally cut or irritate the clients skin?\nWhat products should I use?\nI learned with PCA and Dermalogica, should I just use that?\nHow do I write a consent form?\n\nI know I’m being silly I’m just so anxious. I wanna be the best. But obviously I’m fresh out of school so I know the basics still. \n\nFellow booth/suite renters, did you all feel the same way starting out?",
    "score": 10,
    "url": "https://reddit.com/r/Estheticians/comments/1n21zlf/im_about_to_start_my_first_job_as_an_esthie/",
    "created_at": "2025-08-28T03:43:05.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1pio68e",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "I recently got a job as an esthetician but I hate waxing.",
    "text": "I dont really mind armpits waxing leg waxing and stuff like that i dont enjoy it but its whatever. But I hate waxing faces and I do not want to do Brazilians. But my boss wants me to train and learn it because ive never done it ive only watched it at school i know im going to hate it. \n\n  \n\n\n  \nAnyone the same? What should I do?",
    "score": 10,
    "url": "https://reddit.com/r/Estheticians/comments/1pio68e/i_recently_got_a_job_as_an_esthetician_but_i_hate/",
    "created_at": "2025-12-10T00:27:10.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1o2m1t8",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Am I crazy?  I need advice",
    "text": "I’m a solo esthetician for 12 years. This year I’ve slowed down so much it’s like years ago when I was building up. I’ve been looking for a part time job so I can supplement the income loss but the job market is horrible.  \n\nI’ve had an idea. I rent my room out of a hair salon. I’m the only renter and only esthetician. Our front desk girl is pregnant and will be leaving in a few months. I’m thinking of talking to the salon owner about possibly helping out at the front desk 15-20 hours a week. I love being at this salon. I get along with everyone here. No drama. Would it be a bad idea to try to get hired here part time?  Would the stylists think that’s weird?  ",
    "score": 9,
    "url": "https://reddit.com/r/Estheticians/comments/1o2m1t8/am_i_crazy_i_need_advice/",
    "created_at": "2025-10-10T00:04:27.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1nqol7k",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "what do you wish you knew before you started your career in esthetics?",
    "text": "hello all! i've never posted to this subreddit so i'm so sorry if this is one of hundreds of posts like this that you see LOL. i figured this would be a nice place to ask this question.\n\ni'm 17 years old, currently in school for massage therapy, but it is definitely not my cup of tea at *all*. i've been thinking about esthetics since i was 14, but i'd like to withdraw from my massage program and take some time to truly research esthetics and know what to expect. \n\nto help me with this, i'd like to ask you all, what do you wish you knew before you stepped into the world of esthetics? anything helps me even in the slightest bit, whether it's tips for school or realistic expectations to have for the first few years post-graduation, etc. i truly appreciate any info i can get right now.\n\ni plan to start my esthetics journey when i feel both confident and informed enough, and when i sort out my massage therapy situation😩 once again, anything at all helps!! much love &lt;3",
    "score": 8,
    "url": "https://reddit.com/r/Estheticians/comments/1nqol7k/what_do_you_wish_you_knew_before_you_started_your/",
    "created_at": "2025-09-26T01:31:04.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1mzlj10",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Would esthetician school be an option for me?",
    "text": "I’m 18 with POTS and Orthostatic Hypotension. I’ve been through a few careers i’ve wanted to do in my lifetime, such as a doctor, owning a bakery, and now having my own place where I could do hair, lashes, and nails. I can’t do baking or medical careers anymore due to my health. i’ve worked as a cake decorator for a while but I had to quit due to my medical issues. I can’t stand for 8 hours a day 5 days a week. Would esthetician school be an option for me? I know hair isn’t an option in esthetician school but I could also just do lashes and nails for a long time and when I’m old and rich possibly go back and do cosmetology. In high school, I also was in a medical academy and journalism so I have a bit of medical and marketing knowledge. I can stand for a few hours without sitting typically but sometimes it’s hard. Sometimes I have to eat an abundance of salt at random times or sit down because I know i’m about to pass out. I don’t know how often standing or walking or running is in esthetician school. I also don’t really know what I could do after. I would love a home salon but I currently live with my boyfriend and his mom and I’m not so sure they would like their extra room being used with random people for me. I’m not reliable enough to work at an actual job due to my medical issues. Any advice or knowledge would be extremely helpful.",
    "score": 8,
    "url": "https://reddit.com/r/Estheticians/comments/1mzlj10/would_esthetician_school_be_an_option_for_me/",
    "created_at": "2025-08-25T09:09:34.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1ihna1h",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "For trans estheticians",
    "text": "I am trans and have not had a legal name change (and now likely won’t be able to for the next 4 years) so I was curious how strict the spas/clinics/spaces you’ve worked in have been regarding having your legal name everywhere? \n\nI know cosmo boards have some strict laws about needing the displayed license name and the name on your name tag as your legal name, but I’m curious to hear real world experiences about how that’s worked in actual job spaces. \n\nI would at least like to have the name I go by on my name tag and in the appointment system for clients but I guess I don’t really know how that works. I guess this would also apply to people who go by a nickname - have your workplaces allowed that for name tag + appointments? \n\nFor context, I’m located in MN. ",
    "score": 8,
    "url": "https://reddit.com/r/Estheticians/comments/1ihna1h/for_trans_estheticians/",
    "created_at": "2025-02-04T17:34:23.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1j3ruft",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Advice for fiancé ♥️",
    "text": "\nHi everyone,\n\nMy fiancé recently graduated from esthetician school and is  in the process of planning her  career path. She has a couple of questions for those with experience:\n\n1. Income: What’s the typical income range for someone just starting out? Are there differences between salaried positions versus commission-based roles that she should be aware of?\n\n\n2. Work Environment: From your experience, which settings—such as high-end spas, salons, medical spas, or other environments—offer the best opportunities for new estheticians? What factors should she consider when choosing her first workplace?\n\n\n\nShe doesn’t have Reddit and I just want to support her in anyway I can :)  Any advice &amp; insight  to help better her journey that y’all  can share based on your own experiences or industry knowledge would be greatly appreciated Thanks in advance for your help ! \n",
    "score": 7,
    "url": "https://reddit.com/r/Estheticians/comments/1j3ruft/advice_for_fiancé/",
    "created_at": "2025-03-05T01:47:57.000Z",
    "num_comments": 11
  },
  {
    "id": "reddit-1mjffsc",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Too late to start over in a new career?",
    "text": "Hi! I’m 26f and I currently hold a degree in psychology but due to some trauma in my previous psych related job, I don’t want to ever enter that field again. I’ve been working part time as a beauty advisor at a beauty retailer that’s specific to my country (Canada) for about 2 years now but I’ve always been interested in skincare, nails, waxing, etc. my parents want me to get a “real” career so I can make better money than I do now and I’ve always been interested in esthetics. The program I’m looking at starts in November and goes to July and then I need 2 years working full time in a salon to get my hours to get my full estheticians license. My mom said that she won’t be paying for my schooling (even though they said once I pick something they’ll either cover it or help cover it) because she apparently knows 4 people that went to school for it and never did anything with it. So I’ll be having to cover it on my own, potentially with student loans which is ok because in Canada they’re 0% interest and the program qualifies for them. \n\nI have some real plans for once I’m done my schooling, already considered other courses I could take for it in addition to what the program offers. I know I’d be learning makeup artistry while in school which fits in perfectly for my current part time job. \n\nI’m just wondering if you think it’s too late for me to get started on this at 26 (27 in April) or if it’s worth it anyway, I honestly don’t have a lot going for me right now because the job market for literally anything else in my city is brutal. \n\nI was thinking I would plan on contacting salons for my training hours about halfway through to try and get something lined up for as soon as my program is done. \n\nAny thoughts or advice is welcome, thanks in advance! \n\nETA: I know clients trauma dump and talk about unhinged things sometimes during services, that’s not a concern for me at all, I’m still more than capable of listening to people’s stories and help people out who are seeking advice. The trauma from my previous psych related job was a direct traumatic situation that I was involved in, listening to people’s trauma dumps does not bother me at all ",
    "score": 7,
    "url": "https://reddit.com/r/Estheticians/comments/1mjffsc/too_late_to_start_over_in_a_new_career/",
    "created_at": "2025-08-06T20:17:16.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1n7m6qf",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Going to school!",
    "text": "Hello! I’m about to start school in a few weeks and I’ve heard all sorts of things about school a lot of them negative. ( I’m not letting this deter me) but the biggest complaint is lack of teaching and certification of different services while still in school. My esthetician school gave me this when enrolling showing the list of all the services we will be taught/certified in. So now my question is. Is this not normal?",
    "score": 7,
    "url": "https://reddit.com/r/Estheticians/comments/1n7m6qf/going_to_school/",
    "created_at": "2025-09-03T18:05:12.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1i94pt2",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Esthetician Cosmetic Industry",
    "text": "Is anyone working in the cosmetic chemist industry as an esthetician without a chemistry degree?  I love the skincare side of esthetics more than clientele, but don’t know how to pursue a career in it without a chemistry degree.",
    "score": 7,
    "url": "https://reddit.com/r/Estheticians/comments/1i94pt2/esthetician_cosmetic_industry/",
    "created_at": "2025-01-24T20:10:49.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1mwouuv",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "A rant. Is the Esthetician career really that saturated?",
    "text": "Because I feel like cosmetology is a similar career, in beauty. Except I don’t hear cosmetologist saying it’s over-saturated. Are estheticians just having very high expectations straight out of the gate? Are they not working hard enough? So therefore they’re not getting the results they want and then say it’s over saturated? The projected job growth is 70% over 10 years according to The O Net.org website. On Bureau of Labor Statistics it says it’s an estimated 10% growth over 10 years. \n\nPlease share your experiences after leaving esthetician school. \n\n1. How long did it take you to find a job out of school?\n2. If you set up your own business how long did that take? \n3. Were you making money you were happy with when leaving school?\n4. How long did it take before you were making the money you wanted?\n5. What was the dollar amount that you were happy/ comfortable with? \n6. How much training/ certification/ extra studying have you done since leaving esthetician school? \n7. What was the post-school product/ tool/ certification that helped you grow your business or get paid more by your employer? \n\n**Edit: I live in Southern California. ",
    "score": 6,
    "url": "https://reddit.com/r/Estheticians/comments/1mwouuv/a_rant_is_the_esthetician_career_really_that/",
    "created_at": "2025-08-21T22:09:58.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1k4ylfx",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Is it worth it?",
    "text": "So, I just turned 30 this past year. I’ve been in the restaurant industry since I was 19 and I feel like I’ve hit rock bottom. I want to change my career path as I feel stuck and I don’t want to be in the industry for that much longer. \n\nI was wondering, would it be too late for me to start esthetician school now? \n\nAny school recommendations around Los Angeles (Pasadena) besides Paul Mitchell? \n\nHow rewarding is it for you guys and has anyone gone through this change? \n\nThank you! \n\nPS: I’m hoping to find useful advice not rude comments. ",
    "score": 5,
    "url": "https://reddit.com/r/Estheticians/comments/1k4ylfx/is_it_worth_it/",
    "created_at": "2025-04-22T05:18:52.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1ppwdr1",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "What’s the most abundant job market location?",
    "text": "For context: I live in a major city, and all of the jobs are 90% advanced esthetician, and 10% esthetician.  On top of that, within the small amount of esthetician jobs that don’t require an advanced license, they are usually receptionist jobs that were marketed as esthie jobs. I guess I am pretty frustrated, and have looked into getting my advanced license, but every school I’ve found requires you to start over, even IF you’re licensed. I really want to find an esthie job here that isn’t advantageous with scheduling and also is actual esthetic position, but it’s starting to feel impossible. Luckily my husband’s career requires moving, and we do get to kinda choose where we go. Where have yall found luck in getting a job you love? ",
    "score": 5,
    "url": "https://reddit.com/r/Estheticians/comments/1ppwdr1/whats_the_most_abundant_job_market_location/",
    "created_at": "2025-12-18T17:17:30.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1jrmfut",
    "subreddit": "Estheticians",
    "soc_codes": [
      "39-5094"
    ],
    "title": "Product development career",
    "text": "Does anyone have advice for getting into skincare development? I am very interested in skin and product chemistry and ultimately want to create my own product line. I’d love to get into product development but I don’t know where to start. I am also an esthetician in an area where there aren’t a lot of resources. Thanks!",
    "score": 5,
    "url": "https://reddit.com/r/Estheticians/comments/1jrmfut/product_development_career/",
    "created_at": "2025-04-04T20:55:00.000Z",
    "num_comments": 3
  }
]