[
  {
    "id": "reddit-1iidf15",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Asked to remove DEI language from my org’s website",
    "text": "Welp, it finally happened. The national office of the small non-profit I work for has asked the whole organization to remove any DEI related language from our website and social media.  Not because their stance on supporting DEI has changed, but because they are afraid that the current administration will cut our federal funding.\n\nThis goes beyond removing any “diversity and inclusion” statements. They are asking us to remove all individual instances &amp; variations of the words diversity, equity, and inclusion.\n\nI’m pushing back. I won’t win, but I’ll push back anyways.\n\nI’m mostly here to commiserate I guess. But advice is appreciated if you have it. \n\nEDIT: You guys are awesome. There are so many unique perspectives shared here and I truly appreciate you all. Thank you. If anyone is curious about an update, I’m still pushing back and slowly getting a handful of others on board. I’m thankful to be surrounded by good people at my org. For anyone else dealing with this, clearly there’s a lot of support and insight on this sub. We WILL get through this eventually. ",
    "score": 3821,
    "url": "https://reddit.com/r/nonprofit/comments/1iidf15/asked_to_remove_dei_language_from_my_orgs_website/",
    "created_at": "2025-02-05T16:04:30.000Z",
    "num_comments": 176
  },
  {
    "id": "reddit-1iv7j5r",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Megathread: Judge blocks Trump admin from ending DEI-related grants, contracts, and other federal funding",
    "text": "Nothing like big news at the end of the day on Friday! \n\n**Please keep the discussion about this news to this megathread, not new posts. You're welcome to share other articles about Trump's efforts to ban DEIA in comments here, including ones less directly about this particular court ruling.**\n\n* \"[Judge Halts Implementation of Trump Anti-DEIA Executive Orders Nationwide](https://democracyforward.org/updates/judge-halts-nationwide-the-implementation-of-trump-anti-deia-executive-orders/),\" Democracy Forward statement (they brought the lawsuit)\n\n* \"[‘Arbitrary and discriminatory’: Judge blocks Trump’s effort to deter DEI programs](https://www.politico.com/news/2025/02/21/federal-judge-ruling-blocks-trump-administration-dei-funding-00205585),\" *POLITICO*\n \n* \"[Judge blocks Trump administration from terminating DEI-related grants](https://www.nbcnews.com/politics/donald-trump/trump-administration-blocked-terminating-dei-related-federal-grants-rcna193285),\" *NBC News*\n \n* \"[Judge temporarily blocks Trump administration from carrying out certain anti-DEI directives](https://www.cnn.com/2025/02/21/politics/judge-temporarily-blocks-trump-dei-directive),\" *CNN*\n\n* \"[Federal judge temporarily blocks Trump DEI executive orders](https://thehill.com/regulation/court-battles/5158768-federal-judge-temporarily-blocks-trump-dei-executive-orders/),\" *The Hill*\n\n* \"[Trump Administration Updates: Judge Blocks Trump’s D.E.I. Crackdown](https://www.nytimes.com/live/2025/02/21/us/trump-news),\" *New York Times* ([archived version](https://web.archive.org/web/20250222032752/https://www.nytimes.com/live/2025/02/21/us/trump-news))\n\n* \"[Judge largely blocks Trump’s executive orders ending federal support for DEI programs](https://apnews.com/article/dei-diversity-equity-inclusion-trump-federal-judge-5b04fbc742bd32adf98ca108b4b12b37),\" *AP*\n\n* \"[Federal Judge to Trump: No, You Can’t Ban DEI](https://www.motherjones.com/politics/2025/02/federal-judge-trump-dei-order-blocked/),\" *Mother Jones*\n\n* [Read the ruling](https://storage.courtlistener.com/recap/gov.uscourts.mdd.575287/gov.uscourts.mdd.575287.44.0_2.pdf)\n\nKeep in mind: \n\nThis ruling was made in a case related to two executive orders Trump issued on January 20 and 21. Since then, there have been other executive orders and other cases. \n\nAnd, the Trump admin isn't going to give up its attacks, so this is good news, but how good we don't know yet.\n\nSome related readings:\n\n* \"[Nonprofits Sue Over Trump’s “Anti-Equity” Orders](https://nonprofitquarterly.org/nonprofits-sue-over-trumps-anti-equity-orders/),\" *Nonprofit Quarterly*, 2/21/2025 (disclosure: I wrote this)\n\n* \"[The Great Resegregation: The Trump administration’s attacks on DEI are aimed at reversing the civil-rights movement](https://www.theatlantic.com/politics/archive/2025/02/trump-attacks-dei/681772/),\" *The Atlantic*, 2/22/2025 ([gift link](https://www.theatlantic.com/politics/archive/2025/02/trump-attacks-dei/681772/?gift=Je3D9AQS-C17lUTOnl2W8CfbS33sf5rPuBaDA0rzwEA&amp;utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=share))\n\n* [Previous megathread about the federal funding freeze](https://old.reddit.com/r/nonprofit/comments/1ic8vm2/megathread_news_relevant_to_nonprofits_about_the/) and the first week of news about it.\n\n*Updated 2/22/2025 with additional articles.*",
    "score": 1215,
    "url": "https://reddit.com/r/nonprofit/comments/1iv7j5r/megathread_judge_blocks_trump_admin_from_ending/",
    "created_at": "2025-02-22T01:47:06.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1k1c3fu",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "AmeriCorps is being disbanded by DOGE — anyone else feeling this gut punch?",
    "text": "I’m reeling a bit today with the news that AmeriCorps — including VISTA, NCCC, State &amp; National, and AmeriCorps Seniors — is being disbanded by DOGE. It’s hitting me harder than I expected.\n\nI’ve spent my career working in national service in one capacity or another, and have witnessed firsthand the incredible things national service does for members, organizations, and communities. Sure — it wasn’t perfect, and like anything, there was room for improvement, but overall it was a force for good.\n\nI thought I’d throw this out here: anyone want to use this thread to brainstorm how we can “get things done” without AmeriCorps? New models, grassroots support, partnerships — whatever ideas you’ve got. I think that DOGE has underestimated us... our resilience and dedication. I, for one, will not go quietly.",
    "score": 677,
    "url": "https://reddit.com/r/nonprofit/comments/1k1c3fu/americorps_is_being_disbanded_by_doge_anyone_else/",
    "created_at": "2025-04-17T12:55:41.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1joxgpu",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "\"We're making a difference\" doesn't pay my rent",
    "text": "anyone else fucking tired of your passion being weaponized against you??\n\nAfter 7 years in this sector, I've realized something: nonprofits that truly value their mission would value the people carrying it out.\n\nat my last org --we were expected to work 50+ hour weeks while being told \"we can't afford raises this yr\" Meanwhile, I discovered our ED just got a $30k \"retention bonus\" on top of her six-figure salary (im no where near that), and when I raised concerns about staff burnout and turnover, I was told I \"wasn't committed enough to the mission.\"\n\nI left. Now at a smaller organization where the ED actually fought the board to increase our salaries to match inflation. She told them point blank: \"If we can't pay a living wage, we shouldn't exist.\"\n\nThe difference is night and day. Our staff doesn't turn over every 12 months (yeah -- it's actually possible) We have institutional knowledge. We have time and energy to innovate. Were actually MORE effective while working reasonable hours.\n\nStop normalizing exploitation. Stop accepting \"that's just nonprofit work\" as an excuse. The whole \"do more with less\" mentality is actively harming the communities we claim to serve by burning out the best people in the field.\n\nanyone else found an org that actually walks the talk or am i just unbelievably lucky for this to be my second org? Or have y'all jumped ship to consulting/corporate XD",
    "score": 652,
    "url": "https://reddit.com/r/nonprofit/comments/1joxgpu/were_making_a_difference_doesnt_pay_my_rent/",
    "created_at": "2025-04-01T14:49:42.000Z",
    "num_comments": 63
  },
  {
    "id": "reddit-1kjcz88",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Failed Gala",
    "text": "I just want to share my shame. We hosted a gala last night. I hate galas, but my board insisted we needed one. So, of course, I spent that last year planning one. I spent hours and hours prepping and preparing, especially after a member of my board said, “This has to be absolutely perfect!”  \n\nWell, it wasn't. The setup went well, and I felt prepared and got the check-in volunteers trained and on the computers. \n\nThen, the fundraising software refused to work. When one volunteer logged in, it would kick all the other volunteers off. So a line of 200 people backed up. I had volunteers grab drinks and appetizers and walk the line to give attendees, which helped. But then, when someone checked in with their info, the bidding component of the platform would freeze up and loop back out to the login screen. People couldn't bid on our auction items. \n\nThe chef wanted to hand-prepare the appetizers for each guest, which meant dinner was late being served. We talked about a double-sided buffet, but then the chef wanted to hand-serve each guest, so it was a single side buffet. What the literal f?!? \n\nBecause of the nature of our work/gala, we had to go with a specific type of food, but people vouched for this chef. \n\nIt keeps getting better. People stole our live auction items. And no one bid on one of our silent auction items even after I talked to two of my board members to say, \"Bid no matter what,\" so it creates a sense of completion. \n\nI planned every detail, sent detailed communications, and had extensive conversations with every speaker, lead staff/volunteers, the emcee, entertainment, and the chef. \n\nWhere did I go wrong? Advise and shared gala horror stories needed. (I hate working for a nonprofit right now 🫠)\n\nEdited: no one bid on our live auction, not silent. \n\nFollow-up edits/comments:  \n1. First of all, thank you. This thread was full of great advice to learn from, and I appreciate it. \n\n2. Thank you to everyone who was straightforward in their comments. Reading them made me realize it was not as big of a failure as I first thought.\n\nIt was a success. We came out net positive even after factoring in staff time, creating a ton of great connections, and people were there for the mission. This post was more about my internal observations and feelings.\n\n3. To the people who said how unprofessional, there is a difference between being unprepared and unprofessional. We did not have a contingency plan for the software—that was my biggest mistake. My team was professional. I walked the line, thanked everyone for attending and their patience, got to catch up with everyone, and met new people to tell them what we do and why their presence and support were essential to us. \n\n4. Lessons learned: If possible, hire an event planner and have contingency plans. \n\nI reread all the software planning docs and rewatched the training videos, and everything was set up as it should have been. I’ll call the platform tomorrow to figure out what happened. \n\nLuckily, this is not our biggest fundraising event, which we have done for 40 years. We have that one down to a science, with all the contingency plans in place. \n\n",
    "score": 547,
    "url": "https://reddit.com/r/nonprofit/comments/1kjcz88/failed_gala/",
    "created_at": "2025-05-10T15:31:58.000Z",
    "num_comments": 195
  },
  {
    "id": "reddit-1iagrbx",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Anybody else contacted by the federal Office of Personnel Management?",
    "text": "I received an email from a friend at a sister organization.  It stated that the OPM is starting to monitor the email communications of progressive orgs - particularly those who donor support DEI work.  The message warned others to be in the lookout for opm.gov email addresses in our emailing systems.  \n\nLo and behold, this week, someone from OPM signed up to receive our emails.  I googled the name, and there is chatter about this person all over the internet.  \n\nI try to avoid paranoia, but I’ll admit it feels a little sinister. \n\nUPDATE:  I think the most likely explanation of this is that some people who are opposed to the shutdown of federal DEI programs are signing up individuals, who are managing that shutdown, to receive newsletters from orgs that do DEI work.  I found chatter about that specifically tied to the email address we found in our email system.  ",
    "score": 423,
    "url": "https://reddit.com/r/nonprofit/comments/1iagrbx/anybody_else_contacted_by_the_federal_office_of/",
    "created_at": "2025-01-26T15:05:46.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1iefxze",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "How are y’all coping with the political chaos",
    "text": "Y’all these are some hard times. \n\nI’m a director level staff at a civil rights focused org and not only does all this impact our work, but everyone on our team has been personally impacted on the state and federal level policy shifts over the past month. \n\nI try to keep a brave face on in front of the staff, but all of this is awful on every level. How do we prevent burn out in times like these? About half our staff has birthright citizenship and mixed status families- one of them got targeted for a mass harassment campaign from anti-immigrant extremists. A third of our staff impacted by the anti-trans policies that have been issued. We had to turn off all our social media comments because we’re just being swarmed with the most vile, hateful, trash that you’ve ever seen.\n\nOn top of all the personal impact, the folks we serve in our professional capacity are also having a rough time (to say the least) and come to our staff for help, but there’s a lot out there we just don’t have the power to change right now. we’re doing our best with harm reduction work, but it’s still really heartbreaking. \n\nI’m sure we’re not the only organization going through this kind of thing. How are you all coping with this? How are you supporting your staff? How are you giving hope to the communities you serve so they can at least try to survive until things get better? ",
    "score": 349,
    "url": "https://reddit.com/r/nonprofit/comments/1iefxze/how_are_yall_coping_with_the_political_chaos/",
    "created_at": "2025-01-31T14:26:05.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1hss6kt",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "NPO worker protip: Do the job. Do only the job. Don't go above and beyond as your regular level of effort.",
    "text": "I've seen a lot of burnout posts in this sub lately and I cannot possibly stress this enough: **do not make giving 110% your normal**.\n\nAbove and beyond should be rare and reserved. If you always go above and beyond, that's not beyond anymore, that's your normal and you are setting the expectation that the volume of productivity you are displaying while working yourself to the bone is your level of normal. This means you can never slow down or you'll be seen as slacking off or failing to meet standards. This also means the times when above and beyond is really necessary, you won't have anywhere to go and you also strip yourself of the ability to be recognized for putting forth more when needed.\n\nIf nearly everyone else around you is producing at 90%, you produce at 90%. Period. You go to 100% when you need to, and you save anything about 100% for extremely extraordinary circumstances.\n\nThis is especially true when you start a brand new job. Your impulse might be to go all out to impress the new overlords, but you again will be setting an unsustainable expectation of your baseline.\n\nDo the job. Do ***the*** job and no more. Don't do more than the job with anything remotely resembling regularity. If the job requires you to go 110% to have any hope of accomplishing the workload you've been given, start applying to other jobs and once you have interviews, tell your current boss it's too much and you need relief. If they don't get you any help, take another position.\n\nRemember that in 100 years, maybe in 10 years, maybe even in one year, nobody is going to remember how many nights and weekends you put in to get that report done early. Your children aren't going to sit around the kitchen table reminiscing fondly about the time you missed their birthdays and dance recitals and whatever else because you burned yourself out trying to impress the fifth Executive Director your NPO had in four years because they can't keep anyone long term.",
    "score": 334,
    "url": "https://reddit.com/r/nonprofit/comments/1hss6kt/npo_worker_protip_do_the_job_do_only_the_job_dont/",
    "created_at": "2025-01-03T17:44:02.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1ole0k7",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Sense of Dread In the Non Profit World",
    "text": "Is anyone just waiting for the other shoe to drop? I work in a homeless shelter/housing provider/medical respite program non profit. Our funding is barely federally funded but our clients rely on the programs. It feels like every day lately we are just waiting for the other shoe to drop. \n\nThe snap issues were a prime example. We scrambled to find a way to keep clients stable. We have a plan to enact if it goes as bad as we all think it will. \n\nBut now we are just waiting and watching for that shoe to drop. \n\n\nAnd I know other orgs are feeling it about funding, new laws, even the impact of ICE.\n\nSorry I just needed to vent. Those sitting in happy corporate world seem oblivious to the turmoil we are facing and like to minimize it. ",
    "score": 329,
    "url": "https://reddit.com/r/nonprofit/comments/1ole0k7/sense_of_dread_in_the_non_profit_world/",
    "created_at": "2025-11-01T03:29:01.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1l4exso",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Laid off",
    "text": "Well, I got laid off from my nonprofit job today. Our funding was cut in more than half due to loss of two large grants and my whole team is getting cut. They’ve offered me a part time position and to continue my health insurance for at least the next 6 months, so I’m going to take that for now. This sucks majorly and just wanted to vent to people who might understand.",
    "score": 318,
    "url": "https://reddit.com/r/nonprofit/comments/1l4exso/laid_off/",
    "created_at": "2025-06-06T00:21:07.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1ic8vm2",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Megathread: News relevant to nonprofits about the federal goverment pause on federal grants, loans, and other financial assistance programs",
    "text": "#UPDATE 2/18/2025 This is too much for the volunteer mods to maintain. But please continue to add news as new comments here rather than new posts. Posts are for discussion, not news links.\n\nModerator here. This megathread has expanded beyond the original intent. It will try to encompass news about the various federal funding freezes and the other chaos being caused by the Trump administration that effects nonprofits. Reddit post titles can't be edited, so it is what it is.\n\nThere's a lot of confusion, panic, speculation, and fear mongering out there. This is a fast-changing situation. This megathread will stick to credible sources. Since there are already hundreds of articles about this, we'll pick just a few, and you can google for others. When something is paywalled, we'll include a link to an archived copy.\n\nThis is not legal or professional advice. Consult your own legal counsel before making decisions.\n\n**If you have *credible* news or resources to share that are relevant to nonprofits, rather than a new post, please add it in a comment here or [message the mods](https://www.reddit.com/message/compose?to=%2Fr%2Fnonprofit)**. However, per the r/Nonprofit rules (and to help the mods vet what's shared), add more than just a link. Provide some context so that visiting the link isn't necessary. If it's paywalled and you can share a gift link, that's appreciated.\n\n&amp;nbsp;\n\n#UPDATE 2/7/2025\n\n**Mod note:** Bottom line, the Trump administration is on a clear path to have nonprofits lose federal funding and be unable to get future funding unless they actively disavow diversity, equity, inclusion, and accessibility; support re-segregation; cooperate in deporting and incarcerating immigrants; deadname trans people and ban them from services; deny climate change and other science; support abortion bans; stop providing birth control; and other human and civil rights horrors. Will you be complicit in these harms?\n\nAlso, moving older stuff to another place because of Reddit's post character limit and going to have to stop including excerpts.\n\n&amp;nbsp;\n\n**as of 6:00pm ET / 3:00pm PT**\n\n* [**Trump Issues Sweeping Memo to Defund Nonprofits, NGOs**](https://nonprofitquarterly.org/trump-issues-sweeping-memo-to-defund-nonprofits-ngos/), *Nonprofit Quarterly*, 2/7/2025\n\n* [**Office on the Violence Against Women fiscal year 2025 funding opportunities have been withdrawn**](https://www.justice.gov/ovw/open-notices-of-funding-opportunities), Department of Justice, 2/7/2025\n\n&amp;nbsp;\n\n**as of 2:00 pm ET / 11:00 am PT**\n\n* \"[**EPA employees who work on environmental justice are put on leave**](https://www.npr.org/2025/02/06/nx-s1-5289331/epa-employees-who-work-on-environmental-justice-are-put-on-leave),\" *NPR*, 2/7/2025\n\n* \"[**DOT’s Plan to Distribute Funding by Birth and Marriage Rates Would Leave Communities Most In Need Behind**](https://www.urban.org/urban-wire/dots-plan-distribute-funding-birth-and-marriage-rates-would-leave-communities-most-need),\" *Urban Institute*, 2/7/2025\n\n* \"[**American chaos: standing up for health and medicine**](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736\\(25\\)00237-5/fulltext), The Lancet, Volume 405, Issue 10477, 2/8/2025\n\nAnd a little catching up:\n\n* \"[**Domestic violence nonprofits rocked by Trump funding freeze**](https://19thnews.org/2025/02/trump-funding-freeze-domestic-violence-nonprofits/),\" *The 19th*, 2/6/2025\n\n* \"[**Trump's attacks on USAID spark fear that lifesaving care will become 'transactional'**](https://theintercept.com/2025/02/06/trump-rubio-usaid-state-department/), *The Intercept*, 2/6/2025\n\n* \"[**Abandoned in the Middle of Clinical Trials, Because of a Trump Order**](https://www.nytimes.com/2025/02/06/health/usaid-clinical-trials-funding-trump.html?unlocked_article_code=1.u04.NZSU.wdt9Xun4Ksoi&amp;smid=url-share), *New York Times*, 2/6/2025\n\n* \"[**‘It’s tectonic’: U.S. foreign aid freeze deals a blow to research around the globe**](https://www.science.org/content/article/it-s-tectonic-u-s-foreign-aid-freeze-deals-blow-research-around-globe),\" *Science*, 2/5/2026\n\n* \"[**Workers at NASA Told to ‘Drop Everything’ to Scrub Mentions of Indigenous People, Women from Its Websites**](https://www.404media.co/nasa-dei-drop-everything-executive-order/),\" *404 Media*, 2/2/2025\n\n&amp;nbsp;\n\n**as of 12:00 pm ET / 9:00 am PT**\n\n* \"[**Trump Orders Federal Agencies to Review All Funding for NGOs**](https://www.bloomberg.com/news/articles/2025-02-07/trump-orders-federal-agencies-to-review-all-funding-for-ngos),\" *Bloomberg News*, 2/7/2025\n\n* ”[**Mentions of trans kids scrubbed from national child safety clearinghouse website**](https://www.theverge.com/policy/608278/ncmec-removes-reports-lgbtq-transgender-children-government-funding-threats),\" *The Verge*, 2/7/2025 - props to [independent journalist **Marisa Kabas** for originally breaking the news](https://bsky.app/profile/marisakabas.bsky.social/post/3lhkny4mjdk2r)\n\n* \"[**A Constitutional Crisis?**](https://www.nytimes.com/2025/02/07/briefing/a-constitutional-crisis.html),\" *New York Times*, 2/7/2025 ([archived version](https://archive.ph/DtYBX))\n\n* \"[**Elon Musk’s DOGE is feeding sensitive federal data into AI to target cuts**](https://www.washingtonpost.com/nation/2025/02/06/elon-musk-doge-ai-department-education/),\" *Washington Post*, 2/7/2025\n\n&amp;nbsp;\n\n#UPDATE 2/6/2025\n\n&amp;nbsp;\n\nEvergreen resource: [**Lawsuits Related to Trump Admin Executive Orders**](https://www.courtwatch.news/p/lawsuits-related-to-trump-admin-executive-orders), *Court Watch*, updated regularly\n\n&amp;nbsp;\n\n\"[**'We are one community': LGBTQ+ nonprofit aims to unite communities targeted by Trump**](https://www.santafenewmexican.com/news/local_news/we-are-one-community-lgbtq-nonprofit-aims-to-unite-communities-targeted-by-trump/article_4569b5b4-e3e4-11ef-8f8e-df71962a0459.html), *Santa Fe New Mexican*, 2/5/2026\n\n   &gt; \"How to 'resist?'...The Human Rights Alliance of Santa Fe believes the answer lies in...'intersectionality,' the overlap between marginalized communities. The alliance, a local nonprofit primarily focused on the needs of the LGBTQ+ community, brought together nearly 200 people this week, with representatives from a range of groups, including immigrant rights organizations, LGBTQ+ advocates, aid organizations and public officials.\"\n\n&amp;nbsp;\n\n\"[**Trump admin finally agrees to restrict Elon Musk's team's access to the Treasury Department**](https://www.the-independent.com/news/world/americas/us-politics/elon-musk-trump-doge-treasury-payment-systems-b2693303.html), *The Independent*, 2/6/2025\n\n  &gt;\"DOGE surrogates Marko Elez, 25, and Tom Krause may continue to have ‘read-only’ access to the Bureau of the Fiscal Service.\"\n\n* \\**record scratch*\\* \"[**DOGE Staffer [Marko Elez] Resigns Over Racist Posts**](https://www.wsj.com/tech/doge-staffer-resigns-over-racist-posts-d9f11a93),\" *Wall Street Journal*, 2/6/2025 ([archived version](https://archive.ph/k1FGs))\n\n* Props to [Nathan Tankus (*Notes on the Crisis*)](https://www.crisesnotes.com/treasury-secretary-bessents-lawlessness-sorry-readers-read-and-write-code-still-seems-in-play/), [*WIRED*](https://www.wired.com/story/elon-musk-associate-bfs-federal-payment-system/), and [*Talking Points Memo*](https://talkingpointsmemo.com/edblog/musk-cronies-dive-into-treasury-dept-payments-code-base) for their persistence investigating who at DOGE has had access to this data. \n\n&amp;nbsp;\n\n**The new U.S. Attorney General issued 14 memos to Department of Justice employees.** It's difficult to describe the orders in these memos as anything other than shocking. Before digging into the details and going into panic mode, start with the *Slate* article for an analysis of why some of these orders are illegal and unconstitutional, and will likely face a flurry of lawsuits. To learn about all other memos, head to the *Lawfare* article, but brace yourself for some toxic stuff. \n\nAgain, **don't panic** and **don't comply in advance**.\n\n* \"[**Pam Bondi Instructs Trump DOJ to Criminally Investigate Companies That Do DEI**](https://slate.com/news-and-politics/2025/02/pam-bondi-trump-doj-memo-prosecute-dei-companies.html),\" *Slate*, 2/5/2025 ([archived version](https://web.archive.org/web/20250206112455/https://slate.com/news-and-politics/2025/02/pam-bondi-trump-doj-memo-prosecute-dei-companies.html))\n\n* \"[**Justice Dept. Releases Slate of Memos from Attorney General Bondi**](https://www.lawfaremedia.org/article/justice-dept.-releases-slate-of-memos-from-attorney-general-bondi),\" *Lawfare*, 2/6/2025\n\n&amp;nbsp;\n\n[**USAID Workforce Slashed From 10,000 to Under 300 as Elon Musk’s DOGE Decimates Agency**]\n(https://www.wired.com/story/doge-guts-usaid-workforce/),\" *WIRED*, 2/6/2025\n\n   &gt;The US government’s primary foreign aid organization is losing the vast majority of its staff, forcing the agency’s lifesaving work to screech to a halt...The move leaves only 12 people in the agency’s Africa bureau and eight people in its Asia bureau.\"\n\n&amp;nbsp;\n\n\"[**NOAA Employees Told to Pause Work With ‘Foreign Nationals’**](https://www.wired.com/story/noaa-employees-foreign-nationals/),\" *WIRED*, 2/5/2025\n\n   &gt;\"A number of federal employees at the National Oceanic and Atmospheric Administration (NOAA), the US federal agency that monitors and models the oceans and atmosphere for the purpose of predicting changes in climate and weather, have received orders to temporarily cease communicating with foreign nationals, including those working directly with the US government.\"\n\n&amp;nbsp;\n\n\"[**Services for disabled Americans, trans youth and refugees feel the squeeze from Trump’s early actions**](https://www.cnn.com/2025/02/06/politics/nonprofits-funding-trump-freeze/index.html),\" *CNN*, 2/6/2025\n\nAlso [*mod note: there are so many articles and stories, but just grabbed a few*]:\n\n* \"[**U.S. nonprofits still reeling from federal funding freeze**](https://www.marketplace.org/2025/02/06/us-nonprofits-still-reeling-from-federal-funding-freeze/), *Marketplace*, 2/6/2025\n\n* \"[**Community Health Centers Are Closing Amid Funding Confusion**](https://www.newsweek.com/community-health-center-funding-closure-virginia-trump-2027276),\" *Newsweek*, 2/6/2025\n\n* \"[**Virginia community health centers close over federal funding access**](https://www.vpm.org/news/2025-02-04/virginia-community-health-centers-close-federal-funding-grant-access),\" *VPM*, 2/4/2025\n\n* \"[**Health centers brace for chance of limited funds**](https://www.lagrandeobserver.com/health-centers-brace-for-chance-of-limited-funds/article_61607554-2f54-5428-8449-e667018f51e2.html),\" *The Observer* (Oregon), 2/6/2025\n\n&amp;nbsp;\n\n\"[**The World’s Richest Men Take On the World’s Poorest Children**](https://web.archive.org/web/20250206031627/https://www.nytimes.com/2025/02/05/opinion/usaid-spending-trump-musk.html),\" opinion by Nicholas Kristof, *New York Times*, 2/5/2025 ([archived version](https://archive.ph/6NCXo))\n\n   &gt;\"To billionaires in the White House, it may seem like a game. But to anyone with a heart, it’s about children’s lives and our own security, and what’s unfolding is sickening.\"\n\n&amp;nbsp;\n\n#UPDATE 2/5/2025\n\n\"[**Foreign Aid Freeze Leaves Millions Without H.I.V. Treatment**](https://www.nytimes.com/2025/02/05/health/trump-usaid-pepfar.html),\" *New York Times*, 2/5/2025\n\n   &gt;\"President Trump’s pause on aid, and the gutting of the primary aid agency, could jeopardize the health of more than 20 million people worldwide, including 500,000 children, experts say.\"\n\n&amp;nbsp;\n\n[**Journalist Prem Thakker** posted on Bluesky](https://bsky.app/profile/premthakker.bsky.social/post/3lhhlimm34s23) that:\n\n   &gt;\"Department of Education sends directive to all employees banning grants to Diversity, Equity, and Inclusion initiatives. Orders review of \\*all\\* grants — issued or not.\"\n\n&amp;nbsp;\n\n[**Musk’s DOGE Team Mines for Fraud at Medicare, Medicaid**](https://www.bloomberg.com/news/articles/2025-02-05/musk-s-doge-team-mines-for-fraud-at-medicare-and-medicaid-agency), *Bloomberg*, 2/5/2025\n\n   &gt;\"The DOGE representatives have gained access to payment and contracting systems...They have also been working to cancel diversity, equity and inclusion-focused contracts at [Centers for Medicare and Medicaid Services] and more broadly across the Department of Health and Human Services.\"\n\nAlso [**Journalist Marisa Kabas** posted on Bluesky](https://bsky.app/profile/marisakabas.bsky.social/post/3lhh5njc2w222) that:\n\n   &gt; \"DOGE now has full access to HHS Payment Management System, I’ve learned. The system distributes almost $1 trillion per year in grants (largest in the govt) and supports all of NIH, CDC + many other public health initiatives. Musk guy Luke Farritor is actively delaying payments to recipients.\"\n\n&amp;nbsp;\n\n[**Journalist Erin Reed** posted on Bluesky](https://bsky.app/profile/erininthemorning.com/post/3lhh7qpjygk27) that:\n\n   &gt;\"State attorneys general from California, Colorado, Connecticut, Delaware, Hawaii, Illinois, Maine, Maryland, Massachusetts, New Jersey, New York, Nevada, Vermont, and Wisconsin advise Trump's EO banning trans care is unlawful, hospitals should provide care. Big counter salvo!\"\n\n* [Read the statement from the attorneys general](https://riag.ri.gov/press-releases/attorney-general-neronha-and-14-attorneys-general-issue-joint-statement-protecting)\n\n&amp;nbsp;\n\n**Keywords the Trump administration is telling the National Science Foundation it must remove from all government websites and other materials.** The list is included in this [*mod note: anti-science, racist, transphobic, misogynist, propagandistic, and horrible in so many other ways*] [report by the U.S. Senate Committee on Commerce, Science, and Transportation](https://www.commerce.senate.gov/services/files/4BD2D522-2092-4246-91A5-58EEF99750BC). You may want to spare yourself reading the hateful report — the keyword list is at the very end.\n\n&amp;nbsp;\n\n**National Oceanic and Atmospheric Administration is being targeted.** For context, NOAA freely provides essential weather monitoring, storm warnings, climate monitoring used to provide lifesaving services and relied on by many nonprofits. NOAA includes the National Weather Service. \n\n* [**This DOGE Engineer Has Access to the National Oceanic and Atmospheric Administration**](https://www.wired.com/story/doge-engineer-noaa-data-google-musk-climate-project-2025/), *WIRED*, 2/5/2025\n\n   &gt;\"Sources tell WIRED that NOAA employees were ordered to give an engineer from Elon Musk's DOGE task force access to all of the agency's Google sites by the end of business Wednesday...The agency has long been a target of conservatives; the Project 2025 policy tome calls for it to be broken up and downsized, and for the work of the National Weather Service—which sits within NOAA—to be largely privatized.\"\n\n* [**Doge staffers enter Noaa headquarters and incite reports of cuts and threats**](https://www.theguardian.com/us-news/2025/feb/04/doge-noaa-headquarters), *The Guardian*, 2/4/2025\n\n   &gt;\"Staffers with Elon Musk’s 'department of government efficiency' (Doge) reportedly entered\" NOAA headquarters and the Department of Commerce \"inciting concerns of downsizing at the agency.\" A former NOAA official \"noted it had been a longtime goal of corporations that rely on NOAA data to prevent the agency from making the data public, instead of giving it directly to private corporations that create products based on it, such as weather forecasting services.\"\n\n&amp;nbsp;\n\n\"[**Nonprofit’s lawsuit over the federal funding freeze is part of an ‘avalanche’ of litigation**](https://apnews.com/article/nonprofit-lawsuit-executive-order-federal-funding-grants-b61b41392b10c95ce35da511ead92124),\" *Associated Press*, 2/5/2025\n\n   &gt;\"It’s the start of what nonprofits expect will be a deluge of court actions, as civil litigation promises to be a powerful tool civil society groups plan to use to push back.\"\n\n&amp;nbsp;\n\n**as of 11:00am ET / 8:00am PT**\n\n[**EPA lifts spending freeze on some environmental funding**](https://www.politico.com/news/2025/02/05/epa-spending-freeze-climate-funds-00202518), *Politico*, 2/5/2025\n\n   &gt;\"The Environmental Protection Agency...directed agency officials to allow the disbursement of funds from at least some programs under the bipartisan infrastructure law and Inflation Reduction Act that had been paused since Jan. 20.\" However, the \"spending freeze [remains] in place for a broad array of funding under the IRA.\" A person who works with state governments said the EPA is \"flagrantly disregarding the law. It is outrageous.\"\n\n&amp;nbsp;\n\n#UPDATE 2/4/2025 \n\nThings at USAID continue to be reeeeeaaaaaallllllyyy bad:\n\n* [**USAID staff 'en masse' put on administrative leave via email**](https://abcnews.go.com/Politics/live-updates/trump-second-term-live-updates?id=118389757&amp;entryId=118463826), *ABC News*, 2/4/2025\n\n* [**State Department moving to evacuate USAID staff worldwide**](https://abcnews.go.com/Politics/live-updates/trump-second-term-live-updates/?id=118389757&amp;entryId=118457128), *ABC News*, 2/4/2025 *[mod note: \"evacuate\" is not what you think it means, the staff and their families are being recalled from other countries to the U.S. with just days notice, and if they refuse to leave, they will be forcibly removed by the military*]\n\n* [**USAID upheaval is paralyzing global delivery of food and medicine**](https://www.nbcnews.com/news/politics-news/trump-usaid-upheaval-paralyzing-global-delivery-food-medicine-rcna190565), *NBC News*, 2/4/2025\n\n&amp;nbsp;\n\nand it's not going well at the National Science Foundation either:\n\n* [**Science funding agency threatened with mass layoffs**](https://www.eenews.net/articles/science-funding-agency-threatened-with-mass-layoffs/), *E&amp;E News by Politico*, 2/4/2025\n\n   &gt; NSF, \"one of the United States’ leading funders of science and engineering research is planning to lay off between a quarter and a half of its staff in the next two months.\" An official told *Politico* that \"cutting the $10 billion grantmaking agency in half would 'gut the intellectual center of U.S. leadership in science and technology.'\"\n\n* [**‘It’s Surreal’: Trump’s Freeze on Climate Money Sows Fear and Confusion**](https://www.bloomberg.com/news/articles/2025-02-04/-it-s-surreal-trump-s-freeze-on-climate-money-sows-fear-and-confusion), *Bloomberg*, 2/4/2025\n\n   &gt;\"'This is all a very deliberate agenda, and chaos is the strategy,' says Rachel Cleetus, policy director of the climate and energy program at the nonprofit Union of Concerned Scientists.\"\n\n&amp;nbsp;\n\n[**Journalist Chris Geidner** posted on Bluesky](https://bsky.app/profile/chrisgeidner.bsky.social/post/3lherfprokc2o) that:\n\n   &gt; \"Federal lawsuit filed challenging Trump's executive order against gender-affirming medical care for those under 19, as well as the Jan. 20 EOs funding ban. The lawsuit is backed by the ACLU, Lambda Legal, Jenner &amp; Block, and Hogan Lovells. \n\n* [Read the lawsuit filing](https://storage.courtlistener.com/recap/gov.uscourts.mdd.575545/gov.uscourts.mdd.575545.1.0_1.pdf)\n* PFLAG's [announcement on Bluesky](https://bsky.app/profile/pflag.org/post/3lheqrr5hks2j) and [FAQ about the lawsuit](https://pflag.org/resource/pvt-faqs/)\n\n&amp;nbsp;\n\n[**Doctors Sue Over Trump Health Agencies’ Removal of Online Data**](https://www.bloomberg.com/news/articles/2025-02-04/doctors-sue-over-trump-health-agencies-removal-of-online-data), *Bloomberg*, 2/4/2025\n\n   &gt;Doctors for America, a nonprofit membership organization \"representing thousands of US doctors is suing the Trump administration over the sudden removal of public health data from government websites, arguing it creates a 'dangerous gap' in information available to track disease and diagnose patients.\"\n\n* [Read the lawsuit filing](https://assets.bwbx.io/documents/users/iqjWHBFdfxIU/r3GWTnqnZHCc/v0)\n\n&amp;nbsp;\n\n#UPDATE 2/3/2025 \n\n**Good news, though again, this is far from over and enforcement is still a problem. Keep calling your representatives about this and the other issues.**\n\n**The judge has granted a temporary restraining order in the case brought by a coalition representing nonprofits, public health orgs, and small businesses.**\n\n* [**Judge puts another block on Trump spending freeze**](https://www.politico.com/news/2025/02/03/trump-federal-funding-freeze-011315), *Politico*, 2/3/2025\n\n   &gt; The judge \"issued a temporary restraining order...after expressing concern that the blanket freeze on federal spending may be lingering at some agencies despite two court orders to pause it during ongoing lawsuits.\" The judge \"acted after some nonprofits reported that they continued to be hampered by the freeze and still couldn’t access promised funding.\"\n\n* [Read the judge's 30-page order](https://ecf.dcd.uscourts.gov/cgi-bin/show_public_doc?2025cv0239-30) - notably, the judge characterized the Trump administration's actions \"disingenuous\" and the funding freeze \"potentially catastrophic\"\n\n&amp;nbsp;\n\n**There was a hearing this morning in the case brought by a coalition representing nonprofits, public health orgs, and small businesses.** The judge is \"inclined\" to issue the requested temporary restraining order,  and will make a ruling before 5:00pm ET today, when the previously granted administrative stay expires. The judge also noted that she's concerned that the administration is still implementing the spending freeze, despite that there are two orders halting the freeze.\n\n* [**Journalist John Hawkinson** did a live thread on Bluesky](https://bsky.app/profile/johnhawkinson.bsky.social/post/3lhbvunx6sc2e) with details from the hearing. [**Journalist Chris Geidner** also explained](https://bsky.app/profile/did:plc:36eqtmzysqf7wsslczw4uxcd/post/3lhc3ag3uj22z) where things are at.\n\n&amp;nbsp;\n\n[**N.Y. Attorney General Warns Hospitals Against Canceling Transgender Care** (gift article link)](https://www.nytimes.com/2025/02/03/nyregion/ny-attorney-general-transgender-care.html?unlocked_article_code=1.uE4.HvjA.s2RsEbp65qxV)\n\n   &gt;\"The New York attorney general, Letitia James, has warned New York hospitals that complying with the White House’s executive order to end gender-affirming medical care for transgender youth could well violate...anti-discrimination laws in New York by denying care to pediatric transgender patients.\" \n\n&amp;nbsp;\n\n[**USAID’s future appears bleak as Musk and Trump work to dismantle agency**](https://www.cnn.com/2025/02/03/politics/usaid-washington-workers/index.html), *CNN*, 2/2/2025\n\n   &gt;\"USAID’s headquarters was closed for the day, with employees told in an email to remain at home...Logos and photos of its aid work have been stripped from building walls. And its website and social media accounts have gone dark.\"\n\nAlso:\n\n* [Can the President Dissolve USAID by Executive Order?](https://www.justsecurity.org/107267/can-president-dissolve-usaid-by-executive-order/), *Just Security*, 2/1/2025\n\n   &gt; \"No, not lawfully.\"\n\n&amp;nbsp;\n\n**The U S. Department of Justice has issued a notice of compliance with the temporary restraining order** in the state case. [**Journalist John Hawkinson** posted on Bluesky](https://bsky.app/profile/johnhawkinson.bsky.social/post/3lhbpuahuyc2e) that:\n\n   &gt; \"It is incredibly broad! Covering not just the State plaintiffs but all awardees/recipients, and 'all federal agencies,' not just the named defendants.”\n\n* [Read the DOJ memo](https://storage.courtlistener.com/recap/gov.uscourts.rid.58912/gov.uscourts.rid.58912.51.1.pdf)\n\n&amp;nbsp;\n\n\" [**Omaha nonprofit caught up in political storm after Trump administration allegations**](https://omaha.com/news/local/omaha-nonprofit-caught-up-in-political-storm-after-trump-administration-allegations/article_5ddb75ee-e28e-11ef-9915-6b117c4af06f.html),\" *Omaha World-Herald*, 2/3/2025 ([archived version](https://archive.ph/Evzxo))\n\n&amp;nbsp;\n\n#UPDATE 2/2/2025\n\nThe Musk takeover\n\n* \"[**Elon Musk vows to cancel grants after gaining access to US Treasury payment system**](https://www.ft.com/content/27ba0a6a-0d9b-4e08-8329-730b581c0481),\" *Financial Times*, 2/2/2025\n\n   &gt;\"Elon Musk has vowed to unilaterally cancel hundreds of millions of dollars’ worth of government grants after apparently gaining access to review the US Treasury’s vast payments system, a move that prompted the sudden resignation of [David Lebryk], one of the department’s most senior officials...[Musk] boasted on his social media site X that he was 'rapidly shutting down...illegal payments' [*mod note: see next article, the illegal payment claim is a lie*] after a list of grants to Lutheran organisations was posted online. The threat came after Musk appeared to confirm...that DOGE had access to the Treasury system, which disburses trillions of dollars each year.\"\n\n* [\"**Musk ‘could shut off welfare programmes’ after gaining access to $6 trillion payment system**](https://www.telegraph.co.uk/world-news/2025/02/02/musk-donald-trump-doge-us-treasury-block-welfare-payments/),\" *The Telegraph*, 2/2/2025\n\n   &gt;\"Mr Musk did not provide any evidence for the claim that the Treasury instructed employees to approve payments to known fraudulent or terrorist groups.\"\n\n* [**Musk Says DOGE Halting Treasury Payments to US Contractors**](https://www.bloomberg.com/news/articles/2025-02-02/musk-says-doge-is-rapidly-shutting-down-treasury-payments), *Bloomberg*,  2/2/2025\n\n    &gt; \"Musk...called USAID 'a criminal organization' that should 'die.'\" [*mod note: another lie, USAID is not a criminal organization*]\n\n&amp;nbsp;\n\n[**National Science Foundation update**](https://new.nsf.gov/executive-orders) as of 12:00pm ET on 2/2/2025: \n\n&gt;\"Access to the Award Cash Management Service (ACM$) has been restored and the system is available to accept payment requests\" in compliance with the temporary restraining order (TRO). However, \"The TRO does not impact the ongoing review of our award portfolio to identify active grants in the context of recent Executive Orders.\"\n\n&amp;nbsp;\n\n[**Deborah Pearlstein**, a director at Princeton University School of Public and International Affairs, posted on Bluesky](https://bsky.app/profile/debpearlstein.bsky.social/post/3lh7jojg2i222):\n\n&gt;\"Multiple HHS employees reporting receiving this memo today via email - notifying them of the ct's order Friday barring spending freezes based on the OMB memo or any Exec Order, concluding \"The court's order is in effect and must be complied with.\" \n\n&amp;nbsp;\n\n#UPDATE 1/31/2025\n\n**The judge in the state case has granted the temporary restraining order prohibiting OMB and federal agencies from freezing funds for the 22 states and DC who brought the suit.** OMB has to notify all agencies and their employees, contractors, and grantees by 9am Monday 2/3/2025. The administration may not reissue, adopt, or implement the policy under any other name or through a different agency. There will be further hearings on a possible injunction. \n\n* [Read the temporary restraining order](https://storage.courtlistener.com/recap/gov.uscourts.rid.58912/gov.uscourts.rid.58912.50.0_3.pdf)\n\n* Thanks to journalists [**John Hawkinson**](https://bsky.app/profile/johnhawkinson.bsky.social/post/3lh2weyo7z22c) and [**Chris Geidner**](https://bsky.app/profile/chrisgeidner.bsky.social/post/3lh2wbbbyws2r) for posting about this on Bluesky.\n\n&amp;nbsp;\n\n[**MSNBC columnist Paul Waldman** posted on Bluesky](https://bsky.app/profile/paulwaldman.bsky.social/post/3lh24rj4mxs2m) that \"Department of Transportation orders all personnel to \"identify and eliminate\" every order, directive, rule, regulation, policy, notice, guidance document, funding arrangement, or program that even mentions climate change, diversity, or environmental justice\"\n\n* [Read the DOT memo](https://www.transportation.gov/briefing-room/signed-secretarial-memo-re-implementation-executive-orders-addressing-energy-climate) *CAUTION: The document includes possible misinformation, disinformation, and propaganda; hateful, inflammatory, and derogatory language; and claims that may be factually or legally incorrect.*\n\n&amp;nbsp;\n\n#UPDATE 1/30/2025\n\n[**Freelance journalist John Hawkinson** posted on Bluesky](https://bsky.app/profile/johnhawkinson.bsky.social/post/3lgyh2uwal22c) that the plaintiffs and government in the two cases related to the federal funding freeze have filed various things they were required to file today. There are other fillings due from the parties tomorrow and over the weekend.\n\nAlso:\n\n* [**How Trump’s Vaunted Smash-and-Grab Plan Crashed and Burned**](https://newrepublic.com/article/190928/trump-project-2025-omb-memo), *The New Republic*, 1/30/2025\n\n&amp;nbsp;\n\n\"[**Freelance science journalist Michael Greshko** posted](https://bsky.app/profile/michaelgreshko.bsky.social/post/3lgycgwdqks2d) on Bluesky that:\n\n&gt; \"The National Science Foundation (NSF) sent out an email update on its hold on funding, as the NSF conducts a compliance review with Trump's anti-DEI executive orders. Funds are still held up, and the ACM$ web portal is still down...there are early-career researchers who aren't getting paid as a result of this freeze, as the ACM$ (Award Cash Management Service)—the portal through which awardees actually get their money—remains shut down.\"\n\nAlso:\n\n* \"[**National Science Foundation suspends salary payments, leaving researchers unable to pay their bills**](https://www.statnews.com/2025/01/30/trump-funding-freeze-national-science-foundation-suspends-salary-payments),\" *STAT*, 1/30/2025\n\n&amp;nbsp;\n\n\"[**EPA cuts off IRA solar money already under contract**](https://www.eenews.net/articles/epa-cuts-off-ira-solar-money-already-under-contract/),\" *E&amp;E News by Politico*, 1/30/2025\n\n&gt; \"Recipients of the $7 billion Solar For All program were locked out of...EPA’s online grant management portal, called the Automated Standard Application for Payments, or ASAP.\"\n\n&amp;nbsp;\n\n\"[**An Update on this Week’s Federal Grant and Loan Pause**](https://endhomelessness.org/blog/an-update-on-this-weeks-federal-grant-and-loan-pause/),\" National Alliance to End Homelessness, 1/29/2025\n\n&gt; \"eLOCCS and other accounting systems used by federal grantees to draw down grant funds are now accessible. It is our understanding that agencies are proceeding with disbursements.\"\n\n&gt; The stop-work order on entities delivering technical assistance under HUD’s Community Compass and National Homeless Data Analysis Project Grants (NHDAP) has been lifted. This does not include technical assistance halted as a result of last week’s Executive Order, ’Ending Radical and Wasteful Government DEI Programs and Preferencing.’\"\n\n&amp;nbsp;\n\n#UPDATE 1/29/2025\n\nThings are not yet clear. The OMB memo being rescinded is still a win, but the administration appears to be playing games and freezing funds, continuing to cause more confusion and chaos.\n\nBasically, the administration has rescinded the OMB memo, but it is justifying keeping funds frozen by pointing to Trump's executive orders.\n\nA group of states had filed a request for a temporary restraining order (TRO) of the OMB memo, and this afternoon it had a hearing before a judge. The Department of Justice (the Trump administration's lawyers) argued the TRO request is moot because the OMB memo has been rescinded. The states basically argued that the [President's Press Secretary made statements](https://bsky.app/profile/hayesbrown.bsky.social/post/3lgvn4rclos2g) that seem to indicate that rescinding the memo was just to get around the court's injunction, federal agencies are still being told to follow the memo's directives and freeze funds, and OMB can issue similar new directives because the executive orders are still in effect. The judge is having the parties come back tomorrow with responses. \n\n**Journalist** [**Chris Geidner** posted on Bluesky](https://bsky.app/profile/chrisgeidner.bsky.social/post/3lgvrei6yus2n) about the TRO hearing in more detail.\n\n\"[**Judge Poised to Block Trump’s Federal Funding Freeze**](https://www.democracydocket.com/news-alerts/nonprofits-sue-trump-administration-over-federal-grants-freeze/), *Democracy Docket*, 1/29/2025\n\n&gt; The judge \"ordered the plaintiffs to file a revised order for a temporary restraining order, to properly ask to halt any freeze on federal funds, rather than just the now-rescinded memo.\"\n\n&amp;nbsp;\n\n\"[**Trump White House rescinds memo freezing federal grants after widespread confusion**](https://apnews.com/article/donald-trump-pause-federal-grants-aid-6d41961940585544fa43a3f66550e7be),\" *Associated Press*, 1/29/2025\n\n&gt; \"'This is an important victory for the American people whose voices were heard after massive pressure from every corner of this country—real people made a difference by speaking out,' said Sen. Patty Murray, D-Wash. 'Still, the Trump administration—through a combination of sheer incompetence, cruel intentions, and a willful disregard of the law—caused real harm and chaos for millions over the span of the last 48 hours which is still ongoing.'\"\n\n&amp;nbsp;\n\n\"[**White House revokes spending freeze in face of legal challenges**](https://www.reuters.com/world/us/white-house-revokes-spending-freeze-face-legal-challenges-2025-01-29/),\" Reuters, 1/29/2025\n\n&gt; \"Even though it did not take effect, Trump's order appeared to shut down payments for those who depend on federal aid to cover their expenses. The Medicaid health plan for lower income Americans had resumed payments...The payment system for housing authorities was still not functioning...'The chaos, I’m here to tell you, has not died down this morning,' Murray said...'We will fight this in the courts, yes, but President Trump needs to back down from this reckless order that is hurting Americans and just follow the law as Congress wrote it.'\"\n\n&amp;nbsp;\n\n\"[**Wednesday Update on Federal Grant and Loan Freeze**](https://endhomelessness.org/blog/wednesday-update-on-federal-grant-and-loan-freeze/),\" National Alliance to End Homelessness, 1/29/2025\n\n&gt; \"As of 9:00 AM [mod note: we assume this is ET] today, eLOCCS, used by funding recipients to draw down grant funds, remains inaccessible.\"\n\n&gt; \"All HUD Technical Assistance Has Been Stopped. As of 5:00 PM yesterday, all entities delivering technical assistance under HUD’s Community Compass and National Homeless Data Analysis Project Grants have been ordered to stop work. Not only will this be of significant cost to the communities that these TA providers support, but some TA providers have abruptly lost their ability to work.\"\n\n&amp;nbsp;\n\n\"[**Medicaid payment systems back online after outage**](https://www.politico.com/news/2025/01/29/medicaid-payment-systems-online-00201244),\" *Politico*, 1/29/2025\n\n&gt; National Association of Medicaid Directors said \"the group was notified that Medicaid is exempt from the funding freeze.\"\n \n&amp;nbsp;\n\n\"[**NSF Implementation of Recent Executive Orders**](https://new.nsf.gov/executive-orders),\" U.S. National Science Foundation, 1/28/2025\n\n&gt; \"All review panels, new awards and all payments of funds under open awards will be paused as the agency conducts the required reviews and analysis...All NSF grantees must comply with these executive orders, and any other relevant executive orders issued, by ceasing all non-compliant grant and award activities...In particular, this may include, but is not limited to conferences, trainings, workshops, considerations for staffing and participant selection, and any other grant activity that uses or promotes the use of diversity, equity, inclusion and accessibility (DEIA) principles and frameworks or violates federal anti-discrimination laws.\"\n\n&amp;nbsp;\n\n#About the OMB order\n\n***CAUTION: The OMB documents include possible misinformation, disinformation, and propaganda; hateful, inflammatory, and derogatory language; and claims that may be factually or legally incorrect. The legal standing of this action is yet to be determined.***\n\n&amp;nbsp;\n\n[**OMB memorandum M-25-13: Temporary Pause to Review Agency Grant Loan and Other Financial Assistance Programs**](https://www.documentcloud.org/documents/25506391-m-25-13-temporary-pause-to-review-agency-grant-loan-and-other-financial-assistance-programs/#document/p1), 1/27/2025\n\n   &gt; A footnote in the memo says it should not be “construed to impact Medicare or Social Security benefits” but does not mention Medicaid.\n\nAlso:\n\n   * \"[**Breaking: Catastrophic OMB funding memo**](https://www.thehandbasket.co/p/omb-memo-freeze-federal-grants-scoop),\" *The Handbasket*, 1/27/2025 - props to Marisa Kabas for first reporting the story\n\n   * \"[**White House pauses all federal grants, sparking confusion**](https://www.washingtonpost.com/business/2025/01/27/white-house-pauses-federal-grants/),\" *Washington Post*, 1/27/2025 ([archived version](https://archive.is/XOcr9))\n\n&amp;nbsp;\n\n**OMB list of possibly affected programs:** \"[**Instructions for Federal Financial Assistance Program Analysis in Support of M-25-13**](https://www.documentcloud.org/documents/25506813-govdoc20250128-263582/#document/p1),\" 1/28/2025 ([via NAHRO](https://www.nahro.org/news/omb-pauses-federal-financial-assistance/))\n\n&gt; Q: Is this a freeze on all Federal financial assistance? A: No, the pause does not apply across-the-board. It is expressly limited to programs, projects, and activities implicated by the President’s Executive Orders, such as ending DEI, the green new deal, and funding nongovernmental organizations that undermine the national interest.\n\nAlso:\n\n   * [**Trump administration memo announces abrupt freeze on broad swath of federal payments**](https://www.newsfromthestates.com/article/trump-administration-memo-announces-abrupt-freeze-broad-swath-federal-payments),\" *News from the States*, 1/28/2025\n\n   &gt; \"A separate memo from OMB lists off the programs that will be paused temporarily while it reviews which federal spending it deems appropriate. The list includes the Department of Agriculture's tribal food sovereignty program, Head Start, the Veterans’ Affairs Department’s suicide prevention and legal services grants, the Low-Income Home Energy Assistance, or LIHEAP, program, and numerous sexual assault prevention programs within the Department of Justice.\"\n\n&amp;nbsp;\n\n**OMB FAQ about the memo:**: [no document title](https://www.nahro.org/wp-content/uploads/2025/01/OMB-QA-M-25-13-1.pdf), undated\n\n&amp;nbsp;\n\n**Related - General Services Administration memo:**\n[**GSA memorandum: Acquisition pause**](https://www.gsa.gov/system/files/GSA%20Directive%20to%20Pause%20Acquisition%20and%20Lease%20Actions.pdf), 1/24/2025\n\n   &gt; \"All contracting officers and lease contracting officers (1102s and 1170s) are instructed to suspend the execution of any new GSA-funded obligations, including new awards, task and delivery orders, modifications, and options except as noted.\"\n\nAlso:\n\n* \"[A new memo halts all General Services Administration-funded contract awards, a move that raises questions about scope and legality as industry leaders look for clarity](https://www.washingtontechnology.com/contracts/2025/01/gsa-procurement-pause-sparks-confusion/402560/),\" *Washington Technology*, 1/28/2025\n\n&amp;nbsp;\n\n#Take action\n\n* Some representatives have been asking nonprofits who find they are locked out of a federal grant portal or reporting system to screenshot the lockout and send it to their office. Contact your representative's office for the best way to submit this information.\n\n* **National Council of Nonprofits** is [requesting stories](https://www.councilofnonprofits.org/form/effects-executive-actions-nonprofits) about how Trump’s executive orders and actions are impacting nonprofits and the people and communities they serve. ***Note:*** *Thanks to NCN for hearing this mod's concerns. The form now allows anonymous submissions, information is encrypted while being transmitted, and NCN says it \"stores information securely.\"* ***Be careful what you share.*** *Do not share information that could put you, your nonprofit, or those it serves at risk of repercussions or other harm. Also, remember that your computer, phone, or device and your internet provider may also store information.*",
    "score": 309,
    "url": "https://reddit.com/r/nonprofit/comments/1ic8vm2/megathread_news_relevant_to_nonprofits_about_the/",
    "created_at": "2025-01-28T18:46:38.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1mimjca",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "I quit today",
    "text": "It's been a long road with a toxic, manipulative boss who has overloaded me and repeatedly told me my role is not a priority for the organization.\n\n I'm part time at a grand ole 29.5 hours a week (in my area full time is 30. The only difference is that at 29.5 I get no benefits and no PTO!) I've asked to be moved to full time for well over a year. OR to take some things off of my plate because I can't manage it all. Shame on me for being competent and hardworking because they loved what I had to offer. For reference I'm a former executive director who took a part time entry level role to have more time with my kids. From the beginning it was clear this was not a part time role. I've voiced this concern since day 2. But really enjoy the job and my coworkers so I kept making it work. (Again, shame on me I shouldn't have)\n\nAbout a month ago I sought out my manager and told her I'm drowning, this has to change or I quit. They made grand promises and agreed to help shift things to other full time teammates. We scheduled weekly meetings to check in. It's been a month. I've left each of these meetings with more work. Last week I sent an email reiterating that I needed to see more immediate change in workload or I would leave and would like to discuss next steps. My boss entered into our next one on one saying I was throwing around severe accusations and \"telling myself a story that wasn't true.\" That we've made a lot of progress in our meetings because we came up with a plan for how we would start prioritizing things better and planned for that to be implemented in the next six months. \n\nLaughing, I reiterated I asked for a life raft and you made a plan to make a life raft in six months. She buckled down and started with the \"This is just how nonprofits are, you should be happy you have a job. Offering a part time job was better than no job!\" \n\nRight then and there I quit, with a promise to take two weeks to document what I'm working on and update team members with pertinent information. \n\nThis boss had the actual audacity to start crying! \"This came out of nowhere. Can I ask you to at least reconsider your final day because our biggest fundraiser of the year is right around the corner and I at least need you to stay for that. I don't know how to manage all of this.\" \n\nAnd that friends is why. You can't hold the workload for two minutes without crying. I've been doing it (and doing a damn good job at that) for over a year. I'm done holding you together. You're on your own. I debated staying because I don't want to punish my team who will have to pick up the pieces, but I held the line because if the organization is riding on the back of a part time employee that's a BIG problem. I'm a team player, but if you're not going to prioritize me or my role then I'm done prioritizing it as well. ",
    "score": 300,
    "url": "https://reddit.com/r/nonprofit/comments/1mimjca/i_quit_today/",
    "created_at": "2025-08-05T21:51:17.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1j65fqs",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Megathread: Trump will try to ban employees of nonprofits involved in activities the administration feels are \"improper\" from Public Service Loan Forgiveness (PSLF)",
    "text": "Another Friday afternoon, another Trump administration attack on the nonprofit sector. ~~The actual executive order has not yet been released, so I'll make an update when it does with more clarifying articles and resources.~~\n\n**Please keep the discussion about this news to this megathread, not new posts. You're welcome to share other articles and have other discussions about Trump's attacks on the nonprofit sector here or in the previous megathreads linked below.**\n\nAs with just about every Trump executive order, this will doubtless face lawsuits as it is very likely in violation of Constitutionally protected free speech and other laws.\n\n&amp;nbsp;\n\nUpdate with a new batch of articles now that Trump signed the executive order:\n\n* \"[**'See you in court': Trump moves to revise eligibility for some student loan forgiveness**](https://www.usatoday.com/story/news/education/2025/03/07/trump-student-loan-relief-forgiveness-executive-order/81973679007/),\" *USA Today*, 3/7/2025\n\n* \"[**Trump signs executive action targeting public service loan program**](https://www.npr.org/2025/03/07/nx-s1-5321313/trump-executive-action-public-service-loan-program),\" *NPR*, 3/7/2025\n\n* \"[**Trump signs executive order limiting eligibility for Public Service Loan Forgiveness**](https://thehill.com/homenews/education/5182839-trump-signs-executive-order-limiting-eligibility-for-public-service-loan-forgiveness/),\" *The Hill*, 3/7/2025\n\nAnd if you must, here's [the executive order](https://www.whitehouse.gov/presidential-actions/2025/03/restoring-public-service-loan-forgiveness/), though be aware that it includes misinformation, disinformation, and propaganda; hateful, inflammatory, and derogatory language; and claims that are factually or legally incorrect. The legal standing of this action is yet to be determined.\n\n&amp;nbsp;\n\n* \"[**Trump to sign executive order limiting Public Service Loan Forgiveness program**](https://www.cnbc.com/2025/03/07/trump-says-hell-sign-order-limiting-public-service-loan-forgiveness.html), *CNBC*, 3/7/2025\n\n* \"[**Trump Threatens To Gut PSLF In Student Loan Forgiveness Executive Order**](https://www.forbes.com/sites/adamminsky/2025/03/07/trump-threatens-to-gut-pslf-in-student-loan-forgiveness-executive-order/),\" *Forbes*, 3/7/2025\n\n* \"[**Trump Will Modify Public Service Loan Forgiveness Via Executive Orde**r](https://www.forbes.com/sites/shaharziv/2025/03/07/trump-will-modify-public-service-loan-forgiveness-via-executive-order/),\" *Forbes*, 3/7/2025\n\n* \"[**Trump order would deny student loan relief to nonprofit workers engaged in ‘improper’ activity**](https://apnews.com/article/public-service-student-loan-forgiveness-trump-457a24f8dba3c52dfe58f1e72ba61fa4),\" *AP*, 3/7/2025\n\n* \"[**Trump says he's ending Public Service Loan Forgiveness for nonprofits involved with 'improper' activities**](https://finance.yahoo.com/news/trump-says-hes-ending-public-service-loan-forgiveness-for-nonprofits-involved-with-improper-activities-212520977.html),\" *Yahoo! Finance*, 3/7/2025\n\n&amp;nbsp;\n\nPrevious megathreads:\n\n* [Megathread: Three court rulings against Trump admin in cases involving the federal funding freeze, foreign aid/USAID, and refugee admissions/funding](https://reddit.com/r/nonprofit/comments/1iyal9s/megathread_three_court_rulings_against_trump/), 2/25/2025\n\n* [Megathread: Judge blocks Trump admin from ending DEI-related grants, contracts, and other federal funding](https://reddit.com/r/nonprofit/comments/1iv7j5r/megathread_judge_blocks_trump_admin_from_ending/), 2/21/2025\n\n* [Megathread: News relevant to nonprofits about the federal government pause on federal grants, loans, and other financial assistance programs](https://reddit.com/r/nonprofit/comments/1ic8vm2/megathread_news_relevant_to_nonprofits_about_the/), 1/28/2025\n\n&amp;nbsp;\n\nEdit to add: a useful subreddit is /r/PSLF",
    "score": 272,
    "url": "https://reddit.com/r/nonprofit/comments/1j65fqs/megathread_trump_will_try_to_ban_employees_of/",
    "created_at": "2025-03-08T01:03:50.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1kqjpz2",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Megathread: Big news - Judge rules the Trump administration and DOGE takeover of the U.S. Institute of Peace was illegal",
    "text": "Back in February/March, the [Trump administration violently took over the U.S. Institute of Peace](https://nonprofitquarterly.org/the-trump-takeover-of-the-us-institute-of-peace-what-nonprofits-need-to-know-and-how-to-prepare/), an independent nonprofit organization. \n\nOn March 19, a judge [ruled](https://storage.courtlistener.com/recap/gov.uscourts.dcd.278529/gov.uscourts.dcd.278529.39.0_2.pdf) the Trump administration and DOGE's actions were illegal and the actions taken against USIP are to be undone. The judge was scathing in their [memorandum opinion on the ruling](https://ecf.dcd.uscourts.gov/cgi-bin/show_public_doc?2025cv0804-40), calling Trump's efforts a \"gross usurpation of power.\"\n\nHow and when the takeover will be reversed is unknown. And, the Trump administration will almost certainly appeal this decision.\n\n# UPDATE 5/21/2025\n\nUSIP acting president George Moose has been able to get back into the nonprofit's headquarters building [per a Bluesky post](https://bsky.app/profile/altusip.bsky.social/post/3lppcybcuus2y]\n\n* \"[Judge Rules Trump Takeover of Nonprofit a “Gross Usurpation of Power](https://nonprofitquarterly.org/judge-rules-trump-takeover-of-nonprofit-a-gross-usurpation-of-power/),\" *Nonprofit Quarterly*, 5/21/2025 (disclosure: I wrote this for NPQ)\n\n&amp;nbsp;\n\n**5/19/2025**\n\n* \"[Judge strikes down DOGE takeover of the U.S. Institute of Peace](https://www.nbcnews.com/politics/doge/judge-strikes-doge-takeover-us-institute-peace-rcna207741),\" *NBC News*, 5/19/2025\n\n* \"[Federal judge overturns Trump’s efforts to take over and cripple US Institute of Peace](\nhttps://www.cnn.com/2025/05/19/politics/us-institute-of-peace-judge-overturn), *CNN*, 5/19/2029\n\n* \"[DOGE Loses Battle to Take Over USIP—and Its $500 Million Headquarters\n](https://www.wired.com/story/usip-doge-headquarters-building-ruling/),\" *WIRED*, 5/19/2025\n\n* Read the judge's [ruling](https://storage.courtlistener.com/recap/gov.uscourts.dcd.278529/gov.uscourts.dcd.278529.39.0_2.pdf) and [memorandum opinion](https://ecf.dcd.uscourts.gov/cgi-bin/show_public_doc?2025cv0804-40)\n\n\n&amp;nbsp;\n\nPrevious megathreads:\n\n* [Megathread: Trump administration's attacks against nonprofits, including US Institute of Peace, Harvard University, Vera Institute of Justice, *gestures at everything*](https://reddit.com/r/nonprofit/comments/1k2h2m8/megathread_trump_administrations_attacks_against/), 4/18/2025\n\n* [Megathread: Trump will try to ban employees of nonprofits involved in activities the administration feels are \"improper\" from Public Service Loan Forgiveness (PSLF)](https://reddit.com/r/nonprofit/comments/1j65fqs/megathread_trump_will_try_to_ban_employees_of/), 3/7/2025\n\n* [Megathread: Three court rulings against Trump admin in cases involving the federal funding freeze, foreign aid/USAID, and refugee admissions/funding](https://reddit.com/r/nonprofit/comments/1iyal9s/megathread_three_court_rulings_against_trump/), 2/25/2025\n\n* [Megathread: Judge blocks Trump admin from ending DEI-related grants, contracts, and other federal funding](https://reddit.com/r/nonprofit/comments/1iv7j5r/megathread_judge_blocks_trump_admin_from_ending/), 2/21/2025\n\n* [Megathread: News relevant to nonprofits about the federal government pause on federal grants, loans, and other financial assistance programs](https://reddit.com/r/nonprofit/comments/1ic8vm2/megathread_news_relevant_to_nonprofits_about_the/), 1/28/2025",
    "score": 264,
    "url": "https://reddit.com/r/nonprofit/comments/1kqjpz2/megathread_big_news_judge_rules_the_trump/",
    "created_at": "2025-05-19T18:49:17.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1lpdab0",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Nonprofit boards and personality disorders",
    "text": "Do nonprofit boards attract people with personality disorders? \n\nI've served on boards (secretary, treasurer) and as staff or consultant at numerous nonprofits. My work often involves accounting cleanup, so I frequently find myself in nonprofits that already have issues, including a lack of internal controls, non-compliance, and poor record-keeping. \n\nEvery one of these disordered orgs has had severely narcissistic personalities at the helm of the board, with people-pleasing treasurers, secretaries, and at-large members doing all of the work or none at all. There's a lot of board meeting time spent \"visioning\" but little on fundraising or using their connections in business and government to build new partnerships. While boards are busy visioning, what I've seen are EDs doing their utmost to keep the org going while board leadership interferes with operations, HR, and accounting.  \n  \nAnd the fact that every tiny nonprofit must have these volunteers, with no experience running a nonprofit or even being on a board, who are only required to \"give or get\" a couple of hundred dollars to hold sway over the entire organization, seems to recreate this same personality dynamic over and over.  \n  \nIs it just me? Am I seeing this \"everywhere\" because I am in the nonprofit dredges? My mission is to help nonprofits maximize their funding by streamlining accounting/operations, but I'm so burnt out dealing with board crazy I want to give up and return to construction accounting. ",
    "score": 243,
    "url": "https://reddit.com/r/nonprofit/comments/1lpdab0/nonprofit_boards_and_personality_disorders/",
    "created_at": "2025-07-01T20:59:08.000Z",
    "num_comments": 99
  },
  {
    "id": "reddit-1mdi57t",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "thoughts on AI in the nonprofit space??",
    "text": "what is with everyone advocating for and proudly using chatgpt for everything. I work in the progressive nonprofit space so I do expect a certain standard of “politic” from all my coworkers, members, etc. i don’t expect a lot just baseline stuff (anti trump, lgbtq friendly, etc). \n\nwhy does almost EVERYONE turn a blind eye to AI??? the impacts are countless - i could write a dissertation. bad for the environment and water, creates sacrifice zones / environmental justice communities, labor impacts, non ethical content creation, also it MAKES PEOPLE DUMBER. but it seems like even the farthest left and crunchiest of granola seem to have a “oh well drop in the bucket” mentality. to me this is sooooo frustrating and antithetical to the work. i don’t care if it saves you an hour, respectfully \n\nwhat do you think? \n\nThank you all for the responses!! this definitely gave me some different perspectives. and for those coming at me …don’t be mad at me for pointing out YOUR unethical behavior. shrug ",
    "score": 228,
    "url": "https://reddit.com/r/nonprofit/comments/1mdi57t/thoughts_on_ai_in_the_nonprofit_space/",
    "created_at": "2025-07-30T20:51:53.000Z",
    "num_comments": 136
  },
  {
    "id": "reddit-1j10t6m",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Please read this book",
    "text": "tl/dr: Read this book: Emergent Strategy by Adrienne Maree Brown. \n\nI’m sharing this book because it’s been super helpful in reducing my anxiety and helping me to get clear about what to do, and how to shift priorities in the face of all of the current uncertainty and terror. And I’m hoping others might find it helpful too ♥️\n\nI’ve been thinking and feeling so much about how to fight back against the horrifying state of the US government—how to protect people we serve, and our organization, weighing compliance with safety, how to stay true to my own principles and retain integrity as a person and in practice. \n\nI leaned later in my life that I am a systems-thinker meaning I’m able to move between the big-picture and all of the variables, to individual variables, and to understand and FEEL how each can impact the other. In my NP work, this often translates to balancing the material needs, emotional needs and emotional capacity of clients and staff, with the practical requirements of grants, contracts and organizational policies (in order to bend the latter to serve the former). \n\nMy systems thinking/feeling capacity grew from my need for hyper-vigilance to stay/be safe as a child. As I’ve grown to understand myself I’ve come to view it as a super-power. I also know that when safety is under threat and the variables are too unknown, or there are too many, this means I’m constantly scanning for variables and unable to land or act. The current threat to specific groups of people and all of the uncertainty of what is actually possible, has left me in a state of anxiety-induced/inducing variable-scanning in an attempt to assure safety and continue to do work from a place of integrity, hope and whole-heartedness. And it’s just not possible to anticipate all of the variables, or even make best guesses. And it’s definitely not sustainable emotionally. \n\nAll of this is to say, I’m re-reading Emergent Strategy by Adrienne Maree Brown, and it’s sooooooo helpful. It’s helping me reorganize my systems thinking/feeling into something possible and hopeful. It’s about shifting our relationship with change in order to work from a place of possibility and abundance; about building resiliency and hope into change management in order to stay nimble and adaptive. It’s about the strength we have as individuals and communities—to support each other, move together and be each others safety nets. \n\nI’m totally not doing this book justice—it’s not just lovey-dovey philosophical idealism. It’s a practical guide for adapting to change with integrity. \n\nThis is a great summary (or just read the book:)  https://fortelabs.com/blog/emergent-strategy-organizing-for-social-justice/",
    "score": 214,
    "url": "https://reddit.com/r/nonprofit/comments/1j10t6m/please_read_this_book/",
    "created_at": "2025-03-01T14:36:20.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1l40eb1",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "As a grant admin....my biggest career fear is coming true.",
    "text": "Since Day 1 of being in grant world (govt and foundation) my biggest motivator has always been that my work is keeping good people doing good work employed - and service continues on serving. I find new grants - new people able to meet growing needs in our community. and I've done that....dozens of new foundation grants and a dozen of new government grants (not including ARPA/pandemic money).\n\nI knew this new administration would challenge that and made every effort to insulate us....but we still have to lay off people. Its not a lot, and it includes my team...but they're still my people. Am I the only one thats feeling that gravity on the shoulders? 😢",
    "score": 213,
    "url": "https://reddit.com/r/nonprofit/comments/1l40eb1/as_a_grant_adminmy_biggest_career_fear_is_coming/",
    "created_at": "2025-06-05T14:20:01.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1lajif3",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Immigration Nonprofits at Risk",
    "text": "An email from our security officer this morning reads, in part:\n\n\"A publicly available map, created by an unknown third party, is currently circulating online and appears to list locations associated with immigrant advocacy organizations across the United States and around the globe.\"\n\nWhile our org was not specifically named, many of our office location and partner office locations were on the map. I have not personally seen it, and do not know what platforms the map is circulating on.\n\nAs a result, ALL our offices across the globe are temporarily closed, ALL employees have shifted to remote work, and we have been instructed not to come to the offices for any reason.\n\nIf you work with an immigration related nonprofit, please be safe. Keep your clients safe. Share this information with your safety officers/directors. \n\nThank you.\n\nEdit: Got the map! https://www.arcgis.com/apps/mapviewer/index.html?layers=e9c86e1180724412ac5f35e46445de7b\n\nEdit 2: the map, which is circulating online, was created by a group called S2 Underground, a self-described freelance intelligence agency. ",
    "score": 193,
    "url": "https://reddit.com/r/nonprofit/comments/1lajif3/immigration_nonprofits_at_risk/",
    "created_at": "2025-06-13T15:55:41.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1iyal9s",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Megathread: Three court rulings against Trump admin in cases involving the federal funding freeze, foreign aid/USAID, and refugee admissions/funding",
    "text": "**Please keep the discussion about the news about these rulings to this megathread, not new posts. You're welcome to share other articles about Trump's efforts to freeze federal funding to nonprofits in comments here, including ones less directly about these particular court rulings.**\n\n&amp;nbsp;\n\n* \"[For Trump, 3 court losses in 90 minutes](https://www.cnn.com/2025/02/25/politics/trump-court-losses-immigration-spending-freeze/),\" *CNN*\n\n* \"[Judge extends block on Trump administration’s sweeping freeze on federal funding](https://apnews.com/article/judge-blocks-trump-federal-funding-freeze-alikhan-484747ed8d8199f3fd029104dfd1cc3c),\" *AP*\n\n* \"[Federal Judge Extends Halt To Trump’s Federal Funding Freeze](https://www.democracydocket.com/news-alerts/federal-judge-block-trump-federal-funding-freeze/),\" *Democracy Docket*\n\n* \"[Judge indefinitely blocks Trump’s plan to freeze federal aid](https://thehill.com/regulation/court-battles/5163543-trump-federal-aid-freeze-blocked/),\" *The Hill*\n\n* \"[Judge orders Trump administration to quickly release stopped up foreign aid](https://thehill.com/regulation/court-battles/5163469-trump-administration-blocked-foreign-aid-ruling/),\" *The Hill*\n\n* \"[Judge Gives Trump Administration Deadline to Release Foreign Aid](https://www.nytimes.com/2025/02/25/us/politics/judge-trump-foreign-aid.html),\" *New York Times*\n\n* \"[Judge tells Trump administration it has less than 2 days to resume USAID funding](https://www.npr.org/sections/goats-and-soda/2025/02/25/g-s1-50701/usaid-freeze-judge),\" *NPR*\n\n&amp;nbsp;\n\nRead the rulings:\n\n* [National Council of Nonprofits v. Office of Management and Budget](https://s3.documentcloud.org/documents/25544201/spending-freeze-pi.pdf) re federal funding freeze\n\n&amp;nbsp;\n\nPrevious megathreads:\n\n* [Megathread: Judge blocks Trump admin from ending DEI-related grants, contracts, and other federal funding](https://old.reddit.com/r/nonprofit/comments/1iv7j5r/megathread_judge_blocks_trump_admin_from_ending/)\n\n* [Megathread: News relevant to nonprofits about the federal goverment pause on federal grants, loans, and other financial assistance programs](https://old.reddit.com/r/nonprofit/comments/1ic8vm2/megathread_news_relevant_to_nonprofits_about_the/)",
    "score": 185,
    "url": "https://reddit.com/r/nonprofit/comments/1iyal9s/megathread_three_court_rulings_against_trump/",
    "created_at": "2025-02-26T00:32:49.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1k2h2m8",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Megathread: Trump administration's attacks against nonprofits, including US Institute of Peace, Harvard University, Vera Institute of Justice, *gestures at everything*",
    "text": "The Trump administration's attacks against nonprofits have really escalated in the past week or so. There are a lot of articles about these stories, these are just a few to get you started. I may update this if relevant news breaks.\n\n**Please keep the discussion about these and related events to this megathread, not new posts. You're welcome to share other articles and have other discussions about Trump's attacks on the nonprofit sector here or in the previous megathreads linked below.**\n\n*Disclosure: I'm one of the r/Nonprofit moderators. I am also now occasionally writing articles for the* Nonprofit Quarterly. *My most recent article is included below.*\n\n# Update 4/24/2025\n\n* \"[Trump to target ActBlue in presidential memorandum]\n(https://www.politico.com/news/2025/04/24/trump-to-target-actblue-in-presidential-memorandum-00307251),\" *Politico* 4/24/2025 ([ActBlue may be used by](https://support.actblue.com/campaigns/faq/actblue-account-use-policy/) Democratic candidates, PACs, committees, 501(c)(4) organizations, and the company also runs ActBlue Charities, a fundraising product for 501(c)(3) organizations)\n* \"[Environmental groups say Trump administration violated their free-speech rights](https://www.npr.org/2025/04/23/nx-s1-5369362/trump-funding-freeze-climate-environmental-justice-free-speech),\" *NPR*, 4/23/2025\n* \"[White House says it’s not targeting green groups’ tax status](https://www.politico.com/news/2025/04/22/white-house-says-its-not-targeting-green-groups-tax-status-politico-00304240),\" *Politico*, 4/22/2025 (if you believe this, I have a timeshare to sell you)\n \n# As of 4/18/2025\n\n* \"[The Trump Takeover of the US Institute of Peace—What Nonprofits Need to Know and How to Prepare](https://nonprofitquarterly.org/the-trump-takeover-of-the-us-institute-of-peace-what-nonprofits-need-to-know-and-how-to-prepare/),\" *Nonprofit Quarterly,* 4/17/2025\n* \"[What would it mean for Trump to revoke Harvard’s tax-exempt status?](https://www.theguardian.com/us-news/2025/apr/18/trump-harvard-irs-tax-status),\" *The Guardian*, 4/18/2025\n* \"[NIH said to have halted awarding of new grants to more top universities](https://www.statnews.com/2025/04/18/nih-halts-grants-to-universities-with-frozen-funds-harvard-columbia-northwestern-cornell/),\" *STAT*, 4/18/2025\n* \"[DOGE sought to assign a team to an independent nonprofit group](https://www.washingtonpost.com/national-security/2025/04/15/doge-musk-nonprofit-vera-institute/)\" (about the Vera Institute of Justice), *The Washington Post*, 4/15/2025\n* \"[AmeriCorps members who respond to disasters and help nonprofits are let go in DOGE cuts](https://apnews.com/article/americorps-volunteers-fema-doge-05b1d1cd53e0b5b9f64c17eaba7adf95),\" *AP*, 4/16/2025\n* \"[\\[California Governor\\] Newsom sues DOGE over AmeriCorps cuts, saying it ‘gives the middle finger to volunteers’,](https://www.politico.com/news/2025/04/17/gavin-newsom-sues-doge-americorps-cuts-00298200)\" *Politico*, 4/17/2025\n* \"[Law firms, universities and now civil society groups are in Trump’s sights for punitive action](https://apnews.com/article/trump-tax-exempt-crew-environmental-groups-harvard-5e1e0ffacfa040ccdeaf4e43fb72b5fe),\" *AP*, 4/17/2025\n\n \n\nPrevious megathreads:\n\n* [Megathread: Trump will try to ban employees of nonprofits involved in activities the administration feels are \"improper\" from Public Service Loan Forgiveness (PSLF)](https://old.reddit.com/r/nonprofit/comments/1j65fqs/megathread_trump_will_try_to_ban_employees_of/), 3/7/2025\n* [Megathread: Three court rulings against Trump admin in cases involving the federal funding freeze, foreign aid/USAID, and refugee admissions/funding](https://reddit.com/r/nonprofit/comments/1iyal9s/megathread_three_court_rulings_against_trump/), 2/25/2025\n* [Megathread: Judge blocks Trump admin from ending DEI-related grants, contracts, and other federal funding](https://reddit.com/r/nonprofit/comments/1iv7j5r/megathread_judge_blocks_trump_admin_from_ending/), 2/21/2025\n* [Megathread: News relevant to nonprofits about the federal government pause on federal grants, loans, and other financial assistance programs](https://reddit.com/r/nonprofit/comments/1ic8vm2/megathread_news_relevant_to_nonprofits_about_the/), 1/28/2025",
    "score": 185,
    "url": "https://reddit.com/r/nonprofit/comments/1k2h2m8/megathread_trump_administrations_attacks_against/",
    "created_at": "2025-04-18T22:09:56.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1jr3unr",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Feeling defeated after annual gala….",
    "text": "Event director who’s been in non profit nearly 20 years. Just wrapped up our annual gala - raised $355k of a goal\nOf $500k. \nHad our board/committee wrap up meeting and it was nothing but complaining about petty things.  I had 3 very high caliber people tell me it was the best event they’d been to in years… but the petty complaints have me feeling petty. When someone work $25M complains about paying $18 for parking- it feels like I can’t win. \nI started applying for other jobs within an hour of the meeting. \nJust need some reassurance from those in the industry and to be talked off my ledge. \nI’ve been working 60hour weeks for 2 months and I’m freaking exhausted. ",
    "score": 184,
    "url": "https://reddit.com/r/nonprofit/comments/1jr3unr/feeling_defeated_after_annual_gala/",
    "created_at": "2025-04-04T04:52:46.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1p75vtu",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "A humble request to hiring managers and those with employment decision-making power in these difficult times",
    "text": "With millions in the international development and NGO sector still out of work after having the rug pulled out from under us, I humbly ask that when you see someone with “too much experience” in the pile for one of your jobs that you don’t toss us out. I get in the old days that someone with a master’s or with a decade of experience would be “too expensive” or “won’t stay” in your eyes, but these days it’s not the case. Please give us a chance at the entry-mid-level jobs if we apply for them. I see how much the pay is, I see the requirements and I’ve still applied. If it looks odd to you, take a pause and think, “maybe this person lost their job due to the Great Orange terror and I should give them at least a shot.” If we mess up the interview, fine, then don’t hire us, but please give us a shot. The positions out there are fewer, and likely are entry level or high executive level, so those of us in the middle are really struggling. \n\nI lost my job in March as it was USAID funded and after applying to hundreds of positions, still have nothing. I’m struggling to pay bills and put food on the table. Most of the people I worked with are in the same boat. I have two master’s, speak 5 languages, and have a decade of experience at NGOs and the UN working in human rights, and currently I’m a night janitor at a school (which I am so thankful for, but obviously it hurts). I would love to do anything back in non-profit work. \n\nI just humbly ask that you don’t forget these are unprecedented times, so that guy with a decade of experience and two master’s applying for your 40k job may really need a chance. Please don’t discount us. \n\nThanks, and wishing all of you guys the best with keeping up what you’re doing. ",
    "score": 177,
    "url": "https://reddit.com/r/nonprofit/comments/1p75vtu/a_humble_request_to_hiring_managers_and_those/",
    "created_at": "2025-11-26T11:57:25.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1lf0v36",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Let go - completely blindsided",
    "text": "I’ve worked at my organization for a few months shy of 7 years in comms/public relations, and I got fired yesterday. To say I’m blindsided would be an understatement (and to my boss who I’m pretty sure is on here…if you think this is me it probably is. You should reach out, I’m kind of not ok). I’m not sure what I’m trying to accomplish here. Partly soothe myself, partly to serve as a reminder/warning to others like me. \n\nThe work has been difficult and varied at times, but I genuinely could say I loved my job. I stuck it out through the pandemic when I was one of only two employees. I kept the wheels turning through leadership changes, loss of our development person (when I picked up our FR work in addition to my own with zero additional compensation), PR nightmares, the works. I’ve been incredible proud of the work I have done both independently and as part of the team that has now grown to 5 full time and 4 seasonal staff. \n\nFor the past year I have been working remotely from another state after being forced to relocate for my husband’s job. I did not ask to work from here. When I informed my organization 18 months ago that the move would be coming they asked if I would be willing to stay on. At that time I was still doing development in addition to my comms work and we were only a team of 3. I was more than happy to keep my job, and the understanding I had with my boss is that if/when the arrangement stopped working from either side, there would be a conversation about how to proceed. I relocated a bit later, and since then have been mostly remote but in-person about twice a month (traveling back on my own dime—luckily I had free accommodations).  \n\nAt every check point over the last year, the feedback I received has been exceptional. I have the employee evaluations to prove it. I’m in the middle of stewarding some enormous projects, including an organization rebrand that I have managed entirely independently. One week ago I presented at our EOY board meeting (July-June FY) and got glowing feedback...from a board and leadership that I now know had *just* voted to let me go. I was gearing up to ask for my first raise in two years at my next evaluation and have been compiling a list of my accomplishments. But instead I signed onto my standing check-in meeting yesterday to be greeted by not just my boss, but my board president, who told me they decided to separate from me and find a local person to fill my role. My last paycheck will be July 30th, regardless of when I chose to make my last day of work even if that’s today. I think they feel that’s being generous, essentially a month severance. But of course if I’m willing to work with them on a transition they’d loooove that because they still think so highly of me.\n\nI’m devastated on so many levels. Being fired hurts so bad. I’ve never been let go before, and it being geography related doesn’t make it any less painful even if I can logically understand the need for a local person in my role. I’m very lucky to have a partner and support network so financially I’m not totally screwed. But I really genuinely love my job and my team, and being discarded like this has broken me a little bit. I’m using that hurt to give myself the strength to advocate for myself and negotiate a softer landing. I know I’ll figure it out and probably be better off in the long run. But I don’t want to go. I want to see my projects through. I want to keep working on this mission that I genuinely believe in. This has been as close to a dream job as I ever expected to have and I guess I’m just grieving. \n\nI never thought I was irreplaceable, no employee is. But I certainly thought I was more valued than this. I thought my loyalty and hard work over the last 7 years had earned me a certain level of respect and insulation. I was wrong. I got comfortable, and it was a mistake. One I won’t make again. \n\n",
    "score": 175,
    "url": "https://reddit.com/r/nonprofit/comments/1lf0v36/let_go_completely_blindsided/",
    "created_at": "2025-06-19T03:35:16.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1mulgwi",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Missed chance with billionaire. What would you do?",
    "text": "My non-profit had a donor (a known billionaire) give $1k in back to back years in 2020 and 21. There is no record of why the gifts came in and there is no record of stewardship. So basically criminal negligence for the folks involved back then. The ED and fundraising team have turned over since then, so there is no institutional knowledge of the gifts either. \n\nThere is no reason to not try to make the most of it now, so I'm curious as to what this sub thinks gives us the highest chance for renewing the relationship. I'm thinking of having our ED write a letter to thank for the past support and provide an update on our work since then. But without any context it just seems like shooting an arrow in the dark.  I have no clue what they may be most responsive to. Thoughts?",
    "score": 173,
    "url": "https://reddit.com/r/nonprofit/comments/1mulgwi/missed_chance_with_billionaire_what_would_you_do/",
    "created_at": "2025-08-19T15:21:04.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1l1okjb",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Thoughts on the recent op-ed \"We do not need any more nonprofits\"",
    "text": "https://www.oregonlive.com/opinion/2025/06/opinion-we-do-not-need-any-more-nonprofits.html\n\nI think it's an excellent, concise op-ed even though I don't agree with every point. \n\nI think we do need much more consolidation and getting rid of silos in the industry, but we actually need support to make that happen from funders.\n\nAbout 10 years ago I worked for an organization that was trying to get a collective started to handle nonprofit HR and accounting for smaller organizations. Funders said it was an amazing idea and honestly got kind of obsessed with it and we pieced together a little bit to make it happen, but nowhere near enough. I know a couple of places have made this work, but it's been very tough going. \n\nI also can't remember a time I've seen a merger go truly successfully, especially at the three or five year mark. That almost always comes down to leadership not having the skills they need to integrate a totally new organization/program. \n\nBut I think the community here seems pretty clear whenever someone wants to pop up starting another new nonprofit - the work is often duplicative and unnecessary. More about the founders ego and an unwillingness to build partnerships than a true need in the community.",
    "score": 172,
    "url": "https://reddit.com/r/nonprofit/comments/1l1okjb/thoughts_on_the_recent_oped_we_do_not_need_any/",
    "created_at": "2025-06-02T17:48:04.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1pkv3jl",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Moving away from big gala-style fundraisers",
    "text": "Hey everyone, my organization ($2.6mil annual budget, 20 fulltime staff) has hosted a large gala-style fundraising dinner for more than 20 years. It's exactly what you expect: cocktail hour, silent auction, raffle, seated program with speeches and awards, and a paddle raise. It's seen varying levels of success over the years, this year grossing about $320K and netting about $175K, lower than previous events. Over the past few years, it seems that some of our corporate and foundation sponsors are moving away from event sponsorships in favor of direct funding to programs with measurable impact. Of those who DO still sponsor the event, it's pulling teeth to get them to attend and/or fill their seats (over a quarter of sponsors this year did not use their seats at all). The sense among my team is that it might behoove us to scale down the event to some kind of luncheon or cocktail hour and ask most sponsors and donors to support our programs in other ways. We think it would save us a LOT of planning hours that can be spent doing other forms of fundraising, save probably $100K in expenses, while still retaining most (albeit not all) of the net dollars. What's the trend here? Are big galas still en vogue? Has anyone had success in scaling down an event and still retaining some funding? Or any failures?? Appreciate others' perspectives on this!",
    "score": 172,
    "url": "https://reddit.com/r/nonprofit/comments/1pkv3jl/moving_away_from_big_galastyle_fundraisers/",
    "created_at": "2025-12-12T15:43:31.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1l4zukz",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "For hiring folks: how’s it going?",
    "text": "We’re hiring an entry level, part time digital comms associate and the applicant pool is kinda freaking me out about the economy. \n\nFolks who are WAY overqualified are applying. And I don’t mean a few folks who have some experience- I mean over 30 within 24 hours with advanced experience- ton of folks with masters degrees, years of experience, etc.\n\nOur org is well respected and we have never had an issue hiring because the salary ranges are fairly high for our area and the benefits are very good, even for part time employees. Still, this is a position designed to be entry level, zero experience, completely trained from the ground up- essentially intern level- and we have so many applicants who are seasoned professionals applying. \n\nSo many director level applicants applying for an entry level position feels kinda like I’m seeing the canary in the coal mine about a rough economy ahead. Is anyone else seeing these type of hiring patterns? ",
    "score": 169,
    "url": "https://reddit.com/r/nonprofit/comments/1l4zukz/for_hiring_folks_hows_it_going/",
    "created_at": "2025-06-06T18:33:16.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1hvgku0",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Feeling Betrayed By My Non-Profit",
    "text": "I’ve posted before, questioning my salary as a Communications Director at a non-profit. I am a jack of all trades. I’m expected to do newsletters, press releases, graphic design, attend all events, social media, and create lots of other literature. I make $45K. I recently learned that I would get a 2% cost of living increase. They think I can do more. Most others received 2.5%. I’ve never experienced anything like this before. There’s a $1M a year operating budget. There is one person making more than anyone else with a lower title. He gets a lump sum bonus and a big salary increase. Very corrupt. I’m very sad about this situation. Your thoughts, please. ",
    "score": 160,
    "url": "https://reddit.com/r/nonprofit/comments/1hvgku0/feeling_betrayed_by_my_nonprofit/",
    "created_at": "2025-01-07T02:03:40.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1idvflo",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Anyone else feel like a jack of all trades, master of none?",
    "text": "I've been in the health nonprofit world for about 12 years, progressively building my career. When I first started, I knew I wanted to be in health NPOs, and I ended up finding a niche market in rare/rare-er diseases. In general I've loved my career, but I'm becoming a bit frustrated with my current situation. \n\nObviously, due to rare diseases impacting a much smaller amount of people, even with NPOs that have a well-established national reach (USA), they still have a much smaller budget and much smaller staff than NPOs that have larger patient populations. \n\nBecause of very small staff sizes, we often pick up the slack between departments (often these \"departments\" are literally only one or two people), even more so than what is already a very common problem in the NPO world at large!\n\nLately I feel as though I'm in a jack of all trades, master of none situation. I've picked up so many years of various skills in different areas (development, advocacy, communications, etc.), but I always end up in roles where they aren't specifically in one major department. (For example, I'm currently a regional senior manager and my job is a crazy blend of helping with everything in my region, from working with patients and clinics, recruiting volunteers, planning events and fundraisers,  promoting/creating promotional materials for said events, donor and corporate development, political advocacy, etc.)\n\nI am tired of feeling like I'm being pulled in 50 directions while not seeing the upward progress that I want, and recently realized that I should really pick a lane and move forward with more focus. The problem is, I'm not quite sure how to do that or where to start.\n\nHas anyone else been in a situation like this and gotten out of it into a more focused track? If so, how? \n\nAlso, has anyone worked with a career coach who specializes in NPO careers, and did it help? Career coaches are pricy! I'm willing to pay to work with one if I am fairly confident it will be a benefit to my career, but I've heard mixed things from friends who have previously hired a career coach, so I'm wary.",
    "score": 160,
    "url": "https://reddit.com/r/nonprofit/comments/1idvflo/anyone_else_feel_like_a_jack_of_all_trades_master/",
    "created_at": "2025-01-30T19:38:13.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1l05dg1",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Why is free or underpaid labor the norm?",
    "text": "Hey everyone,\n\nJust had to vent and get some perspective here.\n\nThe nonprofit I work for just lost a major donor. Their reason? They felt like we were overpaying the full time staff and not \"utilizing free volunteers enough.\" The full time staff that were \"overpaid\" all work other part-time jobs to make ends meet. Despite being frugal, they still live paycheck to paycheck.\n\nBasically, they wanted us to stretch every dollar to the extreme, while our team runs on fumes and our programs barely stay afloat.\n\nHere’s what’s really messing with my head: I work a full-time job to subsidize my nonprofit work. I’m volunteering my nights and weekends to keep this mission alive, while my day job pays my rent. I want this to be my full-time work. I want to make a real impact and do good for a living. But the way things are set up, it feels impossible. I’m completely burnt out trying to do both.\n\nWhy is it that people in corporate America can make six-figure salaries doing actively harmful things and no one bats an eye?\n\nBut when we in nonprofits try to pay staff fairly to retain talented people who care deeply and do critical work, suddenly it’s \"greedy\" \"too much\" and we should just \"find more volunteers.\"\n\nWhy is this the standard? Why is our work undervalued like this? Why are we expected to accept poverty wages, burn out, and rely on free labor for work that requires skill, expertise, and commitment, while people in harmful industries are rewarded with high salaries and resources?\n\nHas anyone else dealt with this? Would love to hear your thoughts, stories, or advice. I want to make this my career but all the nonprofits I have interviewed for are only interested in free volunteers. ",
    "score": 149,
    "url": "https://reddit.com/r/nonprofit/comments/1l05dg1/why_is_free_or_underpaid_labor_the_norm/",
    "created_at": "2025-05-31T19:27:30.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1o98lwf",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Leaving nonprofit spaces",
    "text": "People that have successfully ventured out of nonprofit spaces, what roles were you looking for in corporate? How did you tailor your resume/CV to do so? I have spent the majority of career in nonprofs but am considering making the jump to corporate. Looking for all insight and tips!  ",
    "score": 124,
    "url": "https://reddit.com/r/nonprofit/comments/1o98lwf/leaving_nonprofit_spaces/",
    "created_at": "2025-10-17T18:06:36.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1irj4or",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Is anyone else mildly afraid for their job ? Not sure if I should switch careers - nonprofit to nonprofit but totally different career trajectory.",
    "text": "I currently work in a state / gov funded nonprofit focused on maternal health in marketing. I love it - the people, the mission, the work we do…it’s vital. \n\nHowever - with the state of the USA…I’m a bit afraid. Our current state gov is strong, but it’s an election year.\n\nI have the opportunity to apply for an associate director position at another nonprofit - completely different field. This is a community nonprofit , and this new position would be working with community members and doing community outreach. \n\nI do have a small amount of sway in the hiring process as I worked for this nonprofit in college and have maintained relationships with the director and other departments - I routinely send them information on programming my job has, and pass off print materials for them to distribute. I also get coffee at least once a month with my old boss - she’s the one who tipped me off to the position opening up.\n\nPros of where I am currently - my hours are solid , allowing me to pick up a consistent side gig for a good amount of extra money. My net salary this year with my full time and part time  combined was $79K. \n\nI am my own manager - department of me, COO and directors are very supportive and give me a lot of creative leeway.\n\nCons of where I am - stability. My job is NOT tied to any specific grant, but maternal health (perinatal through postpartum) is on the chopping block.\n\nPros of new gig - stability - not tied to any gov funding.\n\nI know the staff - we all get along for the most part.\n\nCons - I would need to be flexible, unable to pick up steady hours , would be a pay cut. \nThis job is offering $65 as the max, and I can probably negotiate $67, but guarantee of being able to take solid / regular hours somewhere else wouldn’t be guaranteed \n\n\nCan be a little petty amongst mid level full timers and part timers , but I’ve always been good and leaving pettiness at the door.\n\nEdit - clarity &amp; details. ",
    "score": 121,
    "url": "https://reddit.com/r/nonprofit/comments/1irj4or/is_anyone_else_mildly_afraid_for_their_job_not/",
    "created_at": "2025-02-17T12:51:36.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1kxe8w8",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Nonprofit Sector Overall Lack of Empathy",
    "text": "I have worked in the nonprofit sector for my entire career. I have held several front-line jobs in after-school programs, case management, and community outreach, among others. One thing I noticed when I transitioned into administration is that, for the most part, the adults I worked with lacked empathy for their colleagues and the people they supervised. This was especially true for Executive Directors who care more about high networth donors than whether their programs are successful, and that their staff do not slip into being the people who need services. \n\nI know there is an immense amount of pressure on nonprofit leaders, but humanity seems to get thinner the higher up you go. Some of the comments my colleagues in leadership have made seem like the worst kind of elitism that most would associate with tech bros or finance bros. It seems that people who are NOT from the community in which they serve are the worst offenders of this. One of the most recent offenders of this was a debate by the CEO about whether a few program staff and program participants should attend an person event and the organization's annual Gala. I am all for program staff and program participants attending because it shows them a part of the organization's work that is usually only reserved for people with financial means. Showing staff and program members a large organization's event could inspire someone to grow into a role that could change not just their circumstances but also their community. Their argument was, \"But those spaces cost us money!\" Keeping in mind that the guest list for those who would attend for free would cost the organization three times as much, with no promise of a return on investment/invitation. What resulted was the continued exploitation of a program member to give a \"I could not have done it without this organization\" speech, which did nothing but continue to build on stereotypes. \n\nThat short-sighted thinking leads me to believe that many in leadership positions in the nonprofit sector, because it makes them feel better about their six-figure salaries being less exploitative than those in the corporate space. They feel good that they can \"change the world\" from behind their desk and only show up when it's time for a photo-op.",
    "score": 116,
    "url": "https://reddit.com/r/nonprofit/comments/1kxe8w8/nonprofit_sector_overall_lack_of_empathy/",
    "created_at": "2025-05-28T11:05:02.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1okgd25",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Fell apart at the offer stage",
    "text": "Hoping for some opinions on this. I was offered an Executive Director role recently that would require a major move for me and my family to a relatively isolated city with a high cost of living. I was the board’s unanimous choice, and everyone seemed excited and aligned. The organization did not provide relocation assistance or health insurance, so I asked for the top end of their advertised hiring salary range, because that would be necessary to make it work for me, and it wasn’t outside what they had budgeted and publicly announced for the role. \n\nThey said they couldn’t do it. They also would not give me even 12 hours to consider the offer and give them an answer after I received their offer in writing. I had asked for three additional days for my husband to work out approval from his company to go remote, because before we knew that detail I could not know for sure whether this was doable or not. It wouldn’t make sense to move if my husband couldn’t keep his job. Ultimately, we couldn’t agree on an offer and I had to decline, which means they ended up having to wait those three days (or longer) anyway. \n\nCan someone please help me understand this scenario from a nonprofit board hiring committee perspective? Why would they publish a salary they can’t afford? Why wouldn’t they give a candidate time to secure an answer she could actually stand by and not possibly have to rescind later due to being rushed? I’m completely baffled.",
    "score": 112,
    "url": "https://reddit.com/r/nonprofit/comments/1okgd25/fell_apart_at_the_offer_stage/",
    "created_at": "2025-10-31T00:23:27.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1kn6zpb",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Am I about to be fired?",
    "text": "So I am a salaried employee who was recently put on a PIP for “time sheet violations.” I have a punch in time, but I also have to keep track of my time manually and submit a written report.\n\nMy boss told me I had to write in manually in 15 minute increments; ie couldn’t write in 9:06, it had to be 9:00.\n\nSome days I punched in at 8:56 and left at 4:56, some I punched in at 9:04 and left at 5:04, but I always wrote 9-5 on my sheet as that is what I was told to do.\n\nNow my boss is accusing me of wage theft and although she said there isn’t currently any worry about losing my job, PIP seems like a step in the wrong direction.\n\nAm I crazy that this seems extremely harsh for a salaried employee? I know the company is having revenue issues, are they trying to find an arbitrary way to get me to leave?",
    "score": 108,
    "url": "https://reddit.com/r/nonprofit/comments/1kn6zpb/am_i_about_to_be_fired/",
    "created_at": "2025-05-15T12:30:45.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1lsqfzb",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Impact of Executive Compensation on Program Delivery",
    "text": "I work at a midsize nonprofit, and it is quite top heavy in terms of executive compensation. The CEO makes half a million per year, and many other senior leaders command $300–400K each. Whenever we get new funding, it feels like it just disappears into leadership salaries instead of going towards actual programs.\n\nThose of us at the Director level are working very long hours, and we can’t get the staffing support we need because “there’s no budget for that”. Well, that’s only true because so much money is tied up paying leadership.\n\nThe senior leaders also talk constantly about the mission. But if they truly cared about it, they’d realize that their supersized salaries get in the way of accomplishing the mission. I think top salaries at small and midsized nonprofits shouldn’t exceed $250K. I know people argue we’d never attract top talent with lower pay, but our leaders aren’t transformative. They’re just entrenched. I think we could get the same level of performance from leadership at a much lower price point. And doing so would free up a small fortune that we could devote to programs, which would have a tremendous impact. ",
    "score": 97,
    "url": "https://reddit.com/r/nonprofit/comments/1lsqfzb/impact_of_executive_compensation_on_program/",
    "created_at": "2025-07-06T02:24:31.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1hsbpc2",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "My boss gave me a fist bump instead of a raise…",
    "text": "I work for a non profit that has a decently large budget. This is my first job out of college and just wrapped up my first full year on salary. If we include my internship I’ve been here for a year and a half. When I accepted the position I accepted for 13k less than what the max salary range was. I did so thinking I could prove my self blah blah blah. I took on more work that was in my description, surpassed miles stones and did really well on my EOY review. As a result I am getting more work! Yay! (I’m actually fine with this I like growing my skills.) But when I asked for a raise to reflect the extra work, my boss said no immediately but fist bumped me for “asking the thing.” No consideration. I asked if I could have more PTO instead, she said she’d think about it but nothing has come of it. \n\nI’ve been seriously pouting over the holidays and rage applying at other places. But I love my job I just want to be paid fairly. What would your next steps be in this situation? ",
    "score": 91,
    "url": "https://reddit.com/r/nonprofit/comments/1hsbpc2/my_boss_gave_me_a_fist_bump_instead_of_a_raise/",
    "created_at": "2025-01-03T02:24:37.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1l51km0",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Professionalism and Non-Profits: do we really have to live this way?",
    "text": "This is mostly a rant. But also, any insight is always helpful. Sorry, it is long. It's been A DAY. \n\nI'm relatively new to non-profit, 18 months. I am in a mid-management role and started during a time of great, almost dynastic levels of leadership change, including my role. I have worked in a deeply corporate environment for most of my career, and I will give non-profit at least my non-profit (technically a CAA) an edge on being a mentally healthier place to work for me. The pay sucks, the benefits are meh at best, but my team (I work in Planning) is generally a great group of introverted weirdos who are very smart and talented but also draw cartoons on our white board describing our frustrations of the moment. The electric skull eel of stress is its constant centerpiece. \n\nBUT, holy hell, the lack of general professional decorum and standards. I'm not talking like business casual and not chatting at the water cooler, 80s-90s concept of professional decorum. I'm talking people so unable to handle any sort of bump in the road or negative but constructive criticism that I've dealt with more people crying in my office in 18 months than in my entire 25-year career. Leadership that cannot handle the pressure that comes at their level without snapping at staff. I spend so much time talking about people's FEELINGS, literally more time is spent on this than my actual job, and this is coming from both people above and below my role. \n\nThere has to be something between the toxic fake smile, always be sunny (especially as a woman) world of institutional corporate life (that I got in a lot of trouble because I'm not a smiler and NO ONE has ever called me \"sunny\". Blunt and lacks diplomacy, sure. But light up a room with my breezy happy-go-lucky demeanor, not even on the good drugs) and the absolute pandering to straight up rude behavior over usually perceived slights, or meltdowns over obsticals or being asked to actually show up consistently as full WFH is in the past (unfortunately) and for what it's worth our dept. culture is very dependent on in-person interaction and brainstorming. \n\nAll of my coworkers are either non-profit lifers or at the beginning of their careers, so I understand that my POV on all of this is uniquely colored. But don't they forking realize that a smidge of \"grow-up, it's not about you it's about the mission\", or that \"setting boundaries doesn't mean being a straight-up b-yatch\", or that \"tip-toeing around everyone's big, quite frankly main character syndrome, feefees\" is not just not professional, but actively taking us away from HELPING PEOPLE. At first, I thought it was a generational thing. Up until recently, I was the only person over 40, the only GenXer, on the team, but as we've added on, I've learned the lifers my age also seem to need a lot of feelings processing on the clock, stressing over interpersonal interactions in a way that absolutely baffles me. If I got butt hurt and needed a therapy session everytime a member of leadership in my old wolrd was a pompous dick to me, snapped at me, or gave me a cold shoulder over some perceived slight, I would have never gotten any thing done. The idea that I'm having to say stuff like \"how did that email make you feel?\" to someone who makes $25K more than me is nuts. \n\nAnd this, from what I am hearing from the career non-profit people I work with, is just how it is. I mean, do we REALLY HAVE TO LIVE LIKE THIS? Could there be something to take from corporate environments, where work is first, feelings a distant second?",
    "score": 90,
    "url": "https://reddit.com/r/nonprofit/comments/1l51km0/professionalism_and_nonprofits_do_we_really_have/",
    "created_at": "2025-06-06T19:44:52.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1iy44aj",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "How did you go about leaving the nonprofit field?",
    "text": "I don't want to leave the nonprofit field; this is my chosen career path. But I'm pretty concerned about layoffs in my org coming sometime this year due to likely federal grant cuts. I'm already hearing about how difficult the job market is for nonprofit folks, and only going to get worse with federal layoffs and cuts. So while I'm still job searching for a nonprofit role (program coordinator/director level), I'm starting to consider the possibility of having to look outside of nonprofits/education/research, at least for the next few years.\n\nThere are frequent posts in this sub asking how to transition into nonprofit work from other sectors, but I'm asking the opposite. If you left the nonprofit field, where do you go from there? How did you transfer your skills and experience? Did you have to start back at an entry level position in a new field? ",
    "score": 87,
    "url": "https://reddit.com/r/nonprofit/comments/1iy44aj/how_did_you_go_about_leaving_the_nonprofit_field/",
    "created_at": "2025-02-25T19:55:02.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1nq414q",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Nonprofit program shutting down; a bit of reflection",
    "text": "This is something I’d like to get off my chest. I’m 39, and have prioritized nonprofit or passion work throughout my life. I’ve strongly felt that my job should be my identity, and the most meaningful way to make a positive impact on the world. Most of my work has been in climate change, rural development, and food security.\n\nThe last three years I’ve been in management, alongside a group of academic leaders. There were several flags raised early about granting, budgeting and fundraising by myself, and I thought that by highlighting and actively working on the problem executive leadership would step in. They did not, and I took on these problems myself with no additional pay. This lack of strategic focus continued to be a problem to the point where my director was asked on three separate occasions to resign, by fellow leaders and by an advisory board (not the BoT). She refused, and you can predict where things went. \n\nI found myself making the mistake that I had continually warned others about; trying to step up and cover for a boss who was refusing to do their job, in service of the larger cause. It was a great opportunity to learn how to develop donors, which I appreciated, but at the same time I didn’t realize how deeply overworked and burnt out I had become. My program is effectively ending this year due to lack of funding and budgeting. I, along with a significant amount of people, will be laid off, so I have been trying to help them transition with recommendations and advice, and have been actively interviewing outside of the nonprofit sector for jobs where I can prioritize my mental health and create a better sense of distance from my work.\n\nI don’t regret trying to save a cause I am passionate about but I would advise others to really think about how it impacts their quality of life, and the importance of working for a competent manager and someone who demonstrates real leadership. I also don’t regret fighting for a program and a cause I do believe in, and trying my hardest until the very end to support the teams on the program. I do regret replacing my financial security with a sense of a moral calling, but life is all about learning lessons. I wish I had spent more time balancing work with the rest of my life, which I didn’t see as as meaningful as my nonprofit cause.\n\nI’m writing this up in hopes that it sparks something in someone in the same place. I had a moment at an event, where I had physically positioned high profile potential donors in front of an executive, to encourage the executive to kindle a relationship. They failed to even introduce themselves, despite having been prepped on donors in attendance, and fully understanding the financial strain we were under and the critical need for fundraising. If leadership cannot make an effort, you cannot fix them. I’d encourage people in the same position to see the signs for what they are and to value themselves and their own career and financial stability. On the bright side - in the future I will be spending more time hiking and sailing, and just being present in the world. I’m grateful I still have had time to learn and benefit from this lesson. \n\nI’d love to hear if others have similar (or completely different) stories.\n\n",
    "score": 81,
    "url": "https://reddit.com/r/nonprofit/comments/1nq414q/nonprofit_program_shutting_down_a_bit_of/",
    "created_at": "2025-09-25T11:19:02.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1pmerow",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "The dog that caught the (grant) car",
    "text": "I’m in a professional service industry (with a lot of experience with federal rule/legal compliance) and wrote a 5m dollar federal grant for my organization. We, uh, won it! I wrote myself as the manager because I understand the project activities better than anyone (I designed them) and someone with my professions licensure is key to carrying out most of the project. \n\nMy org has a grant writing dept and several people in HR with experience managing grants but none of them thought this grant was winnable and refused to assist and basically said “lol good luck.” Well, now I’m overseeing it (starting Jan 1).\n\nI want to do the best job possible and so far have the EdDept site on grant management and Myfedtrainer on my list. \n\nIs there any other places I should be looking? The grant does have tuition and training reimbursement written in but not for the grant manager. That said, my position description is still my actual profession (covered by grant) with new responsibilities of grant management added in. \n\nMy org’s finance, payroll, HR, and budget departments are well versed in federal grants and will provide support. However, I’ll be responsible for overseeing the projects and activities, and ensuring grant compliance/reporting. \n\nAny guidance is greatly appreciated! Winning this grant has given me direction in my career that I lost years ago. I would love to make this my professional focus going forward. ",
    "score": 80,
    "url": "https://reddit.com/r/nonprofit/comments/1pmerow/the_dog_that_caught_the_grant_car/",
    "created_at": "2025-12-14T14:02:29.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1i3pcdd",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "FINALLY employed",
    "text": "as we all know the job market right now is *rough.* I took a leap of faith and moved across the country ( still south, just in the deep south now lol) 9 months ago. Throughout these months I worked a string of part-time jobs not really related to the arts or non-profit work but gained some amazing experience (I was a baker for a bit, how fun). *ANYWAY* I recently accepted a full-time resource specialist position with a small arts non-profit right near my house, health benefits and all the works. I even negotiated my salary! I am 24, have an M.A in arts edu and have worked with non-profits in the past. I was honestly starting to lose confidence in myself...but now I am feeling an immense amount of relief and so so much joy.\n\nthat all aside, I was wondering what advice you all may have for someone who has worked for non-profits in the past (part time/volunteer work) and is now putting on her big girl shoes. happy to provide specifics about the job if that will help generate some advice tidbits",
    "score": 73,
    "url": "https://reddit.com/r/nonprofit/comments/1i3pcdd/finally_employed/",
    "created_at": "2025-01-17T20:03:55.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1nhqzvs",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Is contracting out for everything the end of the reliable nonprofit career?",
    "text": "I work for a very large food bank. When I first started it was common to run into people who had worked their for 5 to 20+ years. Over the last two years or so I have noticed less fiscal and social investment in staff with an increased reliance on contractors, especially when we lose staff who do a specific role, with no posting to attempt to fill that role. Maybe I'm just suffering from burnout or afraid of losing my own job, but is this a common trend across nonprofits, corporate America, etc.?",
    "score": 66,
    "url": "https://reddit.com/r/nonprofit/comments/1nhqzvs/is_contracting_out_for_everything_the_end_of_the/",
    "created_at": "2025-09-15T16:42:52.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1miu1o7",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Lost my nonprofit job today just two months in",
    "text": "For background, my entire 20+ year career has been spent across public and private sector orgs; this was my first nonprofit job. My previous position was eliminated in May due to budgetary constraints. I was supremely lucky to land this new role with a local nonprofit in just two weeks. I was leading their fund development efforts. I guess I wasn’t raising money fast enough because today I was called in and let go. The reason: budgetary constraints.\n\nI know the nonprofit landscape is rough right now, but am I crazy to think that their financial situation must have been pretty dire already if they had to let me go after just two months when I was the only person leading their fund development efforts? Like, that can’t be normal, right?\n\nThey have let several other people go in my short time there and the ED mentioned more than a few times that they were struggling financially, but what kind of miracle did they expect me to work?",
    "score": 64,
    "url": "https://reddit.com/r/nonprofit/comments/1miu1o7/lost_my_nonprofit_job_today_just_two_months_in/",
    "created_at": "2025-08-06T03:28:24.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1pjwos9",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Unable to really live comfortably on nonprofit salary",
    "text": "Love what I do but with student loans I am not really able to live comfortably. I was always told to chase passion over money but then now it feels like I never have enough money despite relatively good benefits and healthcare plan. I don't know how they expect us to function in a high cost of living city. Unfortunately my skill set/interests are not really geared towards \"money making\" careers.\n\nI guess I have to accept being poor forever because I have no interest or talent in accounting, sales, coding or engineering.",
    "score": 61,
    "url": "https://reddit.com/r/nonprofit/comments/1pjwos9/unable_to_really_live_comfortably_on_nonprofit/",
    "created_at": "2025-12-11T12:48:53.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1kpulv5",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "I like my grants job, but I'm tired of the low pay and lack of upward mobility--what to do next?",
    "text": "I have a Bachelor's degree in English and a Bachelor's degree in journalism; I then went on to get a Master's degree in English with the thought that I would continue on in my schooling, get a PhD in English, and become a professor. I did get a Master's degree, but for a variety of reasons, I left academia and starting working on an alternative career. After so long thinking I would spend my life as a professor, however, I feel like I've floundered in my career path, and I'm not sure what to do.\n\nAfter adjuncting for a little bit, I was able to get a job grant writing. I accepted that the low pay was just a part of pivoting into a new career field, and that with experience my pay would go up. After three years of making about $15 an hour, I was able to get a job as a Grants Manager for $55,000, spent 3 years doing that, and ended my position making $60,000. After making a move to a different part of the country, I had to take a less than an ideal Grants Writer position...making $55,000 again (the job market was absolutely horrible late 2024, and I just needed any job so I could make our expensive move).\n\nAfter 7 years in non-profit development and working my butt off to get a professional certificate, I'm sick of being underpaid and unappreciated while my friends make over $100,000 a year in their corporate jobs. \n\nIf you were me, what would be your next steps? I'd stay in non-profit work if I could figure out a way to make a salary that's more commiserate with my education and experience, but most non-profits I've interviewed with act like someone who has largely worked in grants could never make the move over to annual, major, planned, etc. giving (even though I have some experience in many aspects of development, not just grants). And grants jobs in the area all seem to pay the same: $50,000-$60,000.\n\nI'm very open to taking more short classes for the purpose of gaining skills, but I'm not in the financial position to stop working and go back to school for long periods of time. Some of the skills I've gained along the way during my career include project management, experience with CRMs, and design.",
    "score": 55,
    "url": "https://reddit.com/r/nonprofit/comments/1kpulv5/i_like_my_grants_job_but_im_tired_of_the_low_pay/",
    "created_at": "2025-05-18T21:11:56.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1nmrvck",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "UPDATE to Telling your boss/team you’re leaving",
    "text": "I [posted](https://www.reddit.com/r/nonprofit/s/9GkJv4MMlr) a few days ago asking for advice about telling my boss, who leads an already understaffed team that has overextended itself, that I’m leaving for a better opportunity. \n\nI told her and I think she realized she’d blown it- she told me that she’d been working on getting me a promotion/raise (which did match with some offhand comments she’d previously made, though only after a lot of lobbying on my part) and asked if I wanted a counteroffer- I said no as I didn’t think they could match my current offer, but she gave it anyway. As it happens she was very nice about it, and I think realized that if she’d agreed to the promotion I asked for when I started taking on more work this situation probably wouldn’t be happening. \n\nThe counteroffer is much better than I expected it to be, though in fact not as good as the new place’s offer. But it does change the salary percentage difference from 25% to 6%. There are other fringe benefits to the new job’s offer that my current workplace doesn’t have, but if I’m honest I’m attached to the work where I am in a way that I’m not sure I will be in the new place. I also really like the philanthropic policies and scope where I am as opposed to where my new job takes me.\n\nI talked it over with family (who all work in corporate/healthcare settings) and they all said “go where they’ll pay you more and treat you better.” The instinct that brought me into nonprofit work in the first place, though, is making me hesitate now that the financial differences between the two roles have narrowed to this extent. I’m pretty sure I know what I’m going to do but at the same time- I’ve been curious to know what other nonprofit professionals think of this situation. Is it important for you to consider mission and impact when making these final decisions, or do you look at it purely practically? ",
    "score": 54,
    "url": "https://reddit.com/r/nonprofit/comments/1nmrvck/update_to_telling_your_bossteam_youre_leaving/",
    "created_at": "2025-09-21T13:23:51.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1p6urc0",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Rant - Foundations and salaries",
    "text": "Just a rant about foundations that don't cover salaries.This results in creative budgeting but it would be so much cleaner and easier if they just covered the God-bless-America salary, especially if they want to pay for programs.\n\nGrrr.",
    "score": 52,
    "url": "https://reddit.com/r/nonprofit/comments/1p6urc0/rant_foundations_and_salaries/",
    "created_at": "2025-11-26T01:30:19.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1iua9qm",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "First job turning me off from ever working in non profit again",
    "text": "Hi all,\n\nThis is a bit of a rant looking for validation and a bit of looking for advice. I started working at a mid-size environmental non profit back over the summer in communications. At first I was extremely motivated, excited, and filled with idealism. However, months later I find myself cynical, burnt out, and eager to GTFO. I’m not sure if this is just my organization or the industry in general. \n\nThe things turning me off are an upper management team extremely resistant to any sort of change or progress. Anytime any of the younger people or even more experienced ones suggests an idea it’s immediately shut down, almost with contempt. I feel like I was hired to do a job and bring innovative ideas (literally in my job description) but then whenever I try I’m shut down. \n\nAdditionally, the organization seems a lot more shallow than I thought. We definitely have founders syndrome. Some of the upper management is inappropriate and unprofessional get our HR person does not care.  HR just sends out threatening and confusing memos, and tries to get staff to work outside of their hours, on weekends, etc. as if your whole life should be dedicated to the organization. \n\nIt doesn’t help that I’m autistic and this is a very unclear, chaotic, and disorganized environment with a lot of hostile social politics. This job is my first full time job out of college and is ruining my mental health. I’m not sure if it’s just the organization, the way the whole industry is, but it has be so turned off from ever working in non profit or even the environmental field again. I used to be insanely passionate about this subject area, but now this experience has me considering switching careers and going back to school entirely. \n\nTLDR: is it just me, the organization, the industry, something else, or all? ",
    "score": 46,
    "url": "https://reddit.com/r/nonprofit/comments/1iua9qm/first_job_turning_me_off_from_ever_working_in_non/",
    "created_at": "2025-02-20T21:43:22.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1kki6h5",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Burned Out Nonprofit Leader— Advice for Switching Careers?",
    "text": "I'm 35 and have spent my entire career in small nonprofits, most recently in fundraising roles. I have an MSW and 8 years of senior organizational leadership and supervision experience. As a fundraiser I brought in over $9M in capital funding during the span of 15 months to renovate a homeless shelter, and last year I increased my old organization’s operating budget by 20%.\n\nAfter 8 years at my old gig I recently left for another org. I’m one month in and it’s the most toxic place I’ve ever worked, which is saying a lot. The person in my role before me rage quit by sending a 10-page letter to the entire org about my boss's misconduct and micromanagement, which I learned about AFTER accepting the job. I also negotiated a PTO increase that my boss is now trying to reneg on, despite having it in writing in my offer letter.\n\nI’m one bad day away from rage quitting and looking to make a pivot ASAP. I’m hoping to leave behind nonprofits altogether. What I want is better pay (at least $125k), a less toxic work environment, and more work-life balance and time off. Bonus points if it’s partially or entirely remote and there are opportunities for advancement.\n\nAny suggestions? I’d love input on what I might be a good fit for and what immediate next steps I can take to make it happen.\n\nSince I’ve been in nonprofits my whole career, I’m unfamiliar with what roles outside the sector might be a good match for my skill set. I honestly DGAF what I’m doing as long as it pays well, doesn’t leave me drained, and gives me space to pursue other passions. Some things I’m good at are:\n\n* **Fundraising &amp; Grant Writing:** Secured over $9M in public/private funding, including multi-year government and foundation grants.\n* **Leadership:** Substantial experience supervising teams, building systems, managing budgets, and leading strategic planning efforts.\n* **Communications:** Several years experience developing compelling messaging and drafting newsletters, appeals, branding efforts, and social media. Demonstrated success at growing subscriber bases and engagement.\n* **Relationship Management:** Built and maintained partnerships with donors, foundations, businesses, and elected officials.\n* **Training &amp; Public Speaking:** Facilitated large-scale volunteer training programs and frequently spoke at events.\n* **Tech &amp; Data Savvy:** Managed multiple CRMs, newsletter tools, websites, and donation platforms. Personally manage a Linux server, NAS, and smart home setup.\n\nWhat is my best path forward for leveraging all of this and moving into a more chill career with better pay that I can tolerate? Thanks in advance to anyone willing to share ideas or guidance.",
    "score": 45,
    "url": "https://reddit.com/r/nonprofit/comments/1kki6h5/burned_out_nonprofit_leader_advice_for_switching/",
    "created_at": "2025-05-12T02:51:39.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1lis1fr",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Is now a bad time to look for another job?",
    "text": "I work in finance/HR/operations, and have been at the same organization for over 7 years. The work itself is fine, and I get to work from home 4 days a week. I have small kids so it works well for my schedule. We haven’t really been affected by federal grants thankfully. \n\nHowever, after having my responsibilities increase, I practically had to beg for a promotion, which wasn’t really a promotion since it was just a title change and no real increase. I see staff in development and programming who are younger than me get promotions and higher salaries. There is no room for real growth, since I could never replace my supervisor and they will never want to leave. Most of the time I can tell myself it’s worthwhile for the WFH alone, but sometimes I feel super  undervalued. \n\nMy question is: would it be a terrible idea to look for another nonprofit operations job right now? Or is it my only chance for an actual salary increase and the chance for some self respect? I would appreciate any advice! ",
    "score": 42,
    "url": "https://reddit.com/r/nonprofit/comments/1lis1fr/is_now_a_bad_time_to_look_for_another_job/",
    "created_at": "2025-06-23T20:49:53.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1kls1w4",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Any “volunteers” on here that really are more like unpaid employees?",
    "text": "I have been the executive director of a small, regional nonprofit for two years. The role comes with a minuscule stipend, and I work full time in a corporate career, doing all the nonprofit work on nights and weekends. I didn’t even apply to this role - I was just a volunteer when the previous ED was fired, and I love the organization so I stepped up into the leadership role. \n\nI manage a budget of about $250,000 so it’s not a small endeavor. We work with youth, we own expensive equipment and vehicles, we have many sponsors, overall it’s just a ton of work and intricacies and responsibilities. During our busy season I spend upwards of 35 hours per week on it. \n\nIn my tenure I feel proud of the progress I made - starting an involved board of directors, greatly reducing our debt, getting our first ever grant, and starting some new initiatives. Everyone agrees the organization is doing the best it ever has. But it seems like my positive work has only served to increase the expectations of everyone involved to a point where I’m not sure if I can sustain it. \n\nWe have about 40 “staff” (again, volunteers who get tiny stipends) and serve young adults. We also have a board who cares a lot about the organization but hasn’t engaged in any meaningful fundraising efforts so far (I’m working on it haha). I am peppered constantly with questions and “feedback” of all the ways we need to improve. \n\nStaff want more pay, better lodging for overnight events, more free stuff. The board wants more fundraisers, more grants, more donors and sponsors. In the past the org was a complete mess and people were grateful for any little positive thing; now that we are functioning normally everyone wants things handed to them on a silver platter. \n\nI do enjoy my work with the organization and it’s a huge part of my social life. I know the work I do has an impact. But I feel burnt out and tired of having such a huge responsibility and pressure from people who largely just complain about problems and don’t take efforts to solve them. I feel like my dedication and hard work made everyone forget I am just a volunteer. I don’t necessarily need more money or more appreciation/recognition. I feel like I just need everyone to lower their expectations. \n\nHas anyone ever been in this position? I’d love any advice. ",
    "score": 42,
    "url": "https://reddit.com/r/nonprofit/comments/1kls1w4/any_volunteers_on_here_that_really_are_more_like/",
    "created_at": "2025-05-13T17:34:07.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1lqc9du",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "How to resign",
    "text": "I’ve been a grant writer for a nonprofit PAC for a little over four years now. I’ve been quietly looking for a new gig as the culture where I am is just really bad. Today I got a job offer and I’m taking it!\nAnyway, I became the grant writer after teaching elementary school for 25 years. Quitting teaching is simply not renewing a contract at contract time. So I’ve never quit or resigned from a job. \nAny tips or pointers? I’m so nervous - my boss will be shocked. And, quite frankly, fucked as I do a large portion of her job despite getting half her salary. But the nonprofit and grant world is small where I live - so I need to be careful!",
    "score": 40,
    "url": "https://reddit.com/r/nonprofit/comments/1lqc9du/how_to_resign/",
    "created_at": "2025-07-03T00:46:01.000Z",
    "num_comments": 28
  },
  {
    "id": "reddit-1mk3h8a",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Should I quit? I’m tired and discouraged",
    "text": "I am the Executive Director of a small state-wide nonprofit. September 1 marks my 2-year anniversary with my organization and my 2-year contract is up for renewal. I have not received a new contract but my board president met with me last month and said everyone is very pleased with my work. I’ve made  significant improvements to our operations and reduced our deficit.  \n\nDepending on how our board meeting goes next week, I may opt to start looking for another job. From the time I started discussing this position, the emphasis has been on increasing funding and expanding membership. When I was interviewing with the\nBoard I told them they needed to update their website and branding. The current website is a disaster and the logo is dated and illegible. I worked on this project for a year and a half, found some funding, and issued RFP’s to potential consultants. (FWIW I have a background in graphic design) \n\nLast May the board voted unanimously to proceed with the rebranding project. We are meeting next week to discuss the first round of proposed logos. I’m getting comments back from the Board this week.  Now, half of the Board seems to be saying, “wE WanTed yOu 2 fiX eVeryThing but wE didN’t wAnt yoU to aCtuuulY cHanGe AnYthiNg!” I’m honestly in complete despair and sort of done with the drama.\n\nThere are many other reasons I’m frustrated. I have two part-time staff members. We get PTO but no other benefits. There were four other people pre-COVID. The board seems to expect me to do everything the other four worked on and still be the chief fundraiser. There are not enough hours in the day. There are 20 people on the board and less than half participate. \n\nTo be clear, this board approached me and asked me to interview. They had effectively been without an ED for over a year. This is my “retirement” job after a career in the private sector. I’ve been a member for a long time, support their goals, and have a lot of things I would still like to accomplish. \n\nBut I’m really tired. Advice?\n\nEDITED TO ADD: Thank you to everyone who responded. You all have helped clarify my thinking and assured me that I’m not crazy for feeling this way.  Molto Grazie!",
    "score": 40,
    "url": "https://reddit.com/r/nonprofit/comments/1mk3h8a/should_i_quit_im_tired_and_discouraged/",
    "created_at": "2025-08-07T15:41:04.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1kz8ffw",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Salary survey: what’s “high pay” for the industry? Have salaries grown significantly?",
    "text": "Hey friends! I know there are likely studies on this, but interested in what you all consider \"high pay\" for experienced senior staff in the nonprofit sector. I'm just curious. Is $100k significant to you? $150k? Or is that crazy high (or low!) in your region/experience? Would love to hear your tales of salary growth and surprises too. Seems like salaries for directors and C-suite have gotten MUCH higher over the last 5 years - has anyone else noticed that?\n\nFrom my perspective, $120k is a solid salary for director level work and $200k is a gold mine. Beyond that you've got to be in the C-suite at a big org. Interested in if that tracks for others.",
    "score": 37,
    "url": "https://reddit.com/r/nonprofit/comments/1kz8ffw/salary_survey_whats_high_pay_for_the_industry/",
    "created_at": "2025-05-30T16:20:22.000Z",
    "num_comments": 72
  },
  {
    "id": "reddit-1p7g7rn",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "I’m a volunteer manager and this job is breaking me after just 5 months",
    "text": "I’m actively job hunting again because I am genuinely miserable where I am. The job market sucks, so I’m stuck hanging on for now, but honestly — I’ve only been here five months and I already feel completely burnt out.\n\nHere’s a taste of what I’m dealing with:\n\nMy line manager doesn’t meet with me. I haven’t had a meeting with him in over a month. When I first started, I had a different line manager who openly told me he used to oversee volunteering but “didn’t want it anymore.”\n\nSo now everything is slipping through the cracks, and I’m somehow expected to keep this whole thing afloat with zero communication.\n\nWork gets dumped on me last minute. Tasks go through multiple higher-ups and only land on my desk when they suddenly become “urgent,” even when they have nothing to do with my actual role. This happens weekly. \n\nI am literally running the entire volunteer programme alone. No team. No support. No one else doing this.\n\nBefore I started, they had nobody in the role for a year and a half and only 2 volunteers.\nIn five months, I’ve grown that to around 20–25 volunteers and increased activity from roughly 10 hours a week to 25–30 a week — on my own.\n\nAnd despite this, they’re talking about wanting the workforce to be 50% paid staff and 50% volunteers. With one person managing all of that. Make it make sense.\n\nThe workload is insane.\n\nIf I actually tried to do everything they expect, I’d end up working seven days a week. The expectations are genuinely delusional.\n\nOn top of volunteering, I also run placements and work experience.\n\nApparently one human being can just run multiple departments simultaneously.\n\nI also run another entire programme for young volunteers.\n\nI have to interview them, train them, develop them, attend their forums and representation events, and basically manage a whole separate pathway — again, alone.\n\nAnd I’m responsible for recruitment too.\nInterviewing volunteers, writing role descriptions, attending recruitment events, onboarding, DBS checks, training — all me.\n\nI deliver training sessions as well, but that’s honestly just one more thing on the never-ending list.\n\nI didn’t even know what my volunteering targets were supposed to be. No one told me for months. I was building a programme completely blind.\n\nThen out of nowhere, I get an email — from someone who isn’t even my manager — saying the board were “really unhappy” with our volunteer numbers and they expect a significant rise with only one quarter left.\nLike… maybe if the programme hadn’t been abandoned for 18 months, and maybe if I wasn’t doing three people’s jobs, the numbers wouldn’t be an issue?\n\nI only found out after that email that the target is 400 hours a month — which includes corporate volunteers I have zero control over. So that was fun to learn.\n\nI don’t even have a budget.\n\nI’ve had to buy things for volunteers out of my own pocket because I literally have no way to reward or recognise them otherwise.\n\nThey say “lean on us for support,” but the second I do, they either avoid it, make me feel like a burden, or brush it off.\nSLT are all extremely buddy-buddy with each other too, so raising concerns feels impossible.\n\nChristmas chaos is a whole other nightmare.\nHalf the time I only find out what’s happening from our comms person or - I’m not joking - from our own social media posts.\nThen I’m expected to magically pull volunteers together with no notice.\n\nIt’s a 37.5 hour job on paper, but it’s eaten my entire life.\n\nLate nights, stress, weekend spillover, constant pressure.\n\nPlus I commute on top of it, which doesn’t help the work-life balance at all.\n\nHonestly, I left my last job in tears because I loved it so much (also in non-profit and a lower salary - only reason I left was because my contract ended)\n\nWith this one? I am counting down the minutes until I can escape.\n\nJust needed to vent. Has anyone else started a job and immediately realised the whole structure is broken and you’re basically being set up to fail?",
    "score": 36,
    "url": "https://reddit.com/r/nonprofit/comments/1p7g7rn/im_a_volunteer_manager_and_this_job_is_breaking/",
    "created_at": "2025-11-26T18:58:25.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1lt7xao",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "HELP! I’m being underpaid",
    "text": "30, M \nBoulder, CO\n\nBeen at this organisation for well over 3 years. Joined at the bottom of the pyramid and rose to become a manager in 2 years. I just realised that, marketing folks are paid 20% less than the researchers which is fine but my paycheck hasn’t increased by more than 5% since my last promotion to Manager. \n\nI looked at the marketing and communications salary chart for manager and I make about 12000 dollars lower than the base salary and 15000 dollars lower than the median salary for my role. My organisation just laid off 25% but I was safe. How do I put it across as a concern and to whom and how? I’m helpless. It’s a lot of money that I don’t get annually and my reporters make almost the same amount that I do. It’s sort of embarrassing. ",
    "score": 35,
    "url": "https://reddit.com/r/nonprofit/comments/1lt7xao/help_im_being_underpaid/",
    "created_at": "2025-07-06T18:12:44.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1ibr6hj",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Development pay somehow getting worse?",
    "text": "Not actively looking right now. But, I keep getting the usual recruiter emails and LinkedIn messages for positions. For the last year, all of the lateral moves from my current position seem to have a salary range that is 20-30% less than what I started at with my role in 2018. The position one above mine is often less pay than I make now.\n\nAlso, my org posting the same position level as I started at 30k less than what I started 6 1/2 years ago. Just trying to understand what's happening here.\n\nJust curious to what all you have seen.",
    "score": 35,
    "url": "https://reddit.com/r/nonprofit/comments/1ibr6hj/development_pay_somehow_getting_worse/",
    "created_at": "2025-01-28T02:23:27.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1iep2pt",
    "subreddit": "nonprofit",
    "soc_codes": [
      "11-9151",
      "21-1099"
    ],
    "title": "Do I Lose My Job When a Non-Profit Grant Runs Out?",
    "text": "Hi everyone,\nI work for a non-profit (newbie), and my salary is funded by a 2-year grant. I’m wondering—what happens when the grant ends? Will I lose my job, or is there usually a plan for securing new funding? Any advice or experiences would be helpful! Thanks.",
    "score": 32,
    "url": "https://reddit.com/r/nonprofit/comments/1iep2pt/do_i_lose_my_job_when_a_nonprofit_grant_runs_out/",
    "created_at": "2025-01-31T20:55:28.000Z",
    "num_comments": 49
  }
]