[
  {
    "id": "reddit-1mvid8s",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "[Breaking] AWS Cloud Chief says \"replacing junior employees with AI is one of the dumbest things I've ever heard\". The tide is shifting back.",
    "text": "&gt;Matt Garman, Amazon's cloud boss, has a warning for business leaders rushing to swap workers for AI: Don't ditch your junior employees.  \n...  \nThe Amazon Web Services CEO said on an episode of the \"Matthew Berman\" podcast published Tuesday that replacing entry-level staff with AI tools is \"one of the dumbest things I've ever heard.\"  \n...  \n\"They're probably the least expensive employees you have. They're the most leaned into your AI tools,\" he said.  \n...  \n\"How's that going to work when you go like 10 years in the future and you have no one that has built up or learned anything?\"\n\n[https://www.businessinsider.com/amazon-cloud-chief-replacing-junior-staff-ai-matt-garman-2025-8](https://www.businessinsider.com/amazon-cloud-chief-replacing-junior-staff-ai-matt-garman-2025-8)\n\nSlowly, day by day, the AI hype is dying out as companies realize it's basically just a faster google search.\n\nWhat are your thoughts?",
    "score": 6869,
    "url": "https://reddit.com/r/cscareerquestions/comments/1mvid8s/breaking_aws_cloud_chief_says_replacing_junior/",
    "created_at": "2025-08-20T15:42:44.000Z",
    "num_comments": 354
  },
  {
    "id": "reddit-1k41ad2",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Reminder: If you're in a stable software engineering job right now, STAY PUT!!!!!!!",
    "text": "I'm honestly amazed this even needs to be said but if you're currently in a stable, low-drama, job especially outside of FAANG, just stay put because the grass that looks greener right now might actually be hiding a sinkhole\n\nLet me tell you about my buddy. Until a few months ago, he had a job as a software engineer at an insurance company. The benefits were fantastic.. he would work 10-20 hours a week at most, work was very chill and relaxing. His coworkers and management were nice and welcoming, and the company was very stable and recession proof. He also only had to go into the office once a week. He had time to go to the gym, spend time with family, and even work on side projects if he felt like it\n\nBut then he got tempted by the FAANG name and the idea of a shiny new title and what looked like better pay and more exciting projects, so he made the jump, thinking he was leveling up, thinking he was finally joining the big leagues\n\nFrom day one it was a completely different world, the job was fully on-site so he was back to commuting every day, the hours were brutal, and even though nobody said it out loud there was a very clear expectation to be constantly online, constantly responsive, and always pushing for more\n\nHe went from having quiet mornings and freedom to structure his day to 8 a.m. standups, nonstop back-to-back meetings, toxic coworkers who acted like they were in some competition for who could look the busiest, and managers who micromanaged every last detail while pretending to be laid-back\n\nHe was putting in 50 to 60 hours a week just trying to stay afloat and it was draining the life out of him, but he kept telling himself it was worth it for the resume boost and the name recognition and then just three months in, he got the layoff email\n\nNo warning, no internal transfer, no fallback plan, just a cold goodbye and a severance package, and now he’s sitting at home unemployed in a terrible market, completely burned out, regretting ever leaving that insurance job where people actually treated each other like human beings\n\nAnd the worst part is I watched him change during those months, it was like the light in him dimmed a little every week, he started looking tired all the time, less present, shorter on the phone, always distracted, talking about how he felt like he was constantly behind, constantly proving himself to people who didn’t even know his name\n\nHe used to be one of the most relaxed, easygoing guys I knew, always down for a beer or a pickup game or just to chill and talk about life, but during those months it felt like he aged five years, and when he finally called me after the layoff it wasn’t just that he lost the job, it was like he’d lost a piece of himself in the process\n\nTo make it worse, his old role was already filled, and it’s not like you can just snap your fingers and go back, that bridge is gone, and now he’s in this weird limbo where he’s applying like crazy but everything is frozen or competitive or worse, fake listings meant to fish for resumes\n\nI’ve seen this happen to more than one person lately and I’m telling you, if you’re in a solid job right now with decent pay, decent hours, and a company that isn’t on fire, you don’t need to chase the dream of some big tech title especially not in a market like this\n\nRight now, surviving and keeping your sanity is the real win, and that “boring” job might be the safest bet you’ve got\n\nBe careful out there",
    "score": 5385,
    "url": "https://reddit.com/r/cscareerquestions/comments/1k41ad2/reminder_if_youre_in_a_stable_software/",
    "created_at": "2025-04-21T01:00:37.000Z",
    "num_comments": 535
  },
  {
    "id": "reddit-1ohnh7q",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "[BREAKING] Amazon to layoff 30,000 corporate employees in one of the largest layoffs in its history",
    "text": "&gt;Amazon is planning to cut as many as 30,000 corporate jobs beginning Tuesday, as the company works to pare expenses and compensate for overhiring during the peak demand of the pandemic, according to three people familiar with the matter.\n\n&gt;The figure represents a small percentage of Amazon’s 1.55 million total employees, but nearly 10% of the company’s roughly 350,000 corporate employees. This would represent the largest job cut at Amazon since around 27,000 jobs were eliminated starting in late 2022.\n\n&gt;Managers of impacted teams were asked to undergo training on Monday for how to communicate with staff following notifications that will start going out via email tomorrow morning\n\n&gt;\n\n[https://www.reuters.com/business/world-at-work/amazon-targets-many-30000-corporate-job-cuts-sources-say-2025-10-27/](https://www.reuters.com/business/world-at-work/amazon-targets-many-30000-corporate-job-cuts-sources-say-2025-10-27/)\n\nWhat are your thoughts on this?",
    "score": 5348,
    "url": "https://reddit.com/r/cscareerquestions/comments/1ohnh7q/breaking_amazon_to_layoff_30000_corporate/",
    "created_at": "2025-10-27T19:09:59.000Z",
    "num_comments": 1312
  },
  {
    "id": "reddit-1mrujpf",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "4 years at Big tech. Being likeable beats being productive every single time",
    "text": "**TL;DR: Grinding harder made me less productive AND less likeable. Being calm is the actual cheat code.**\n\nI'm 4 years deep at a big tech company, and work-life balance has been absolutely brutal lately. For the past year, I went full psycho mode—trying to crush every single task, racing through my backlog, saying yes to everything.\n\n**Plot twist: It made me objectively worse at my job.**\n\nHere's what I didn't expect: When you're constantly in panic mode, your nervous system goes haywire. You become that coworker who's stressed, short with people, and honestly just not fun to be around.\n\n**And here's the kicker—being pleasant to work with is literally the most important skill in Big Tech.**\n\nThink about it: The people who get shit done aren't grinding alone in a corner. They're the ones other people WANT to help. They get faster code reviews. They get invited to the important meetings. They get context shared with them freely.\n\nWhen you're stressed and snappy? People avoid you. Your PRs sit in review hell. You get excluded from decisions. You end up working 2x harder for half the impact.\n\n**The counterintuitive solution: Embrace strategic calm.**\n\nI started doing less. I stopped panic-working. I took actual lunch breaks. I said \"I'll get back to you tomorrow\" instead of dropping everything.\n\nResult? My productivity went UP. My relationships improved. My manager started praising my \"executive presence.\"\n\n**In Big Tech, your nervous system IS your competitive advantage.** Stay calm, stay likeable, and watch opportunities come to you instead of chasing them down like a maniac.\n\nAnyone else discover this the hard way?",
    "score": 4954,
    "url": "https://reddit.com/r/cscareerquestions/comments/1mrujpf/4_years_at_big_tech_being_likeable_beats_being/",
    "created_at": "2025-08-16T12:58:17.000Z",
    "num_comments": 356
  },
  {
    "id": "reddit-1m1uw9v",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I just watched an AI agent take a Jira ticket, understand our codebase, and push a PR in minutes and I’m genuinely scared",
    "text": "I’m a professional software engineer, and today something happened that honestly shook me. I watched an AI agent, part of an internally built tool our company is piloting, take in a small Jira ticket. It was the kind of task that would usually take me or a teammate about an hour. Mostly writing a SQL query and making a small change to some backend code.\n\nThe AI read through our codebase, figured out the context, wrote the query, updated the code, created a PR with a clear diff and a well-written description, and pushed it for review. All in just a few minutes.\n\nThis wasn’t boilerplate. It followed our naming conventions, made logical decisions, and even updated a test. One of our senior engineers reviewed the PR and said it looked solid and accurate. They would have done it the same way.\n\nWhat really hit me is that this isn’t some future concept. This AI tool is being gradually rolled out across teams in our org as part of a pilot program. And it’s already producing results like this.\n\nI’ve been following AI developments, but watching it do my job in my codebase made everything feel real in a way headlines never could. It was a ticket I would have knocked out before lunch, and now it’s being done faster and with less effort by a machine.\n\nI’m not saying engineers will be out of jobs tomorrow. But if an AI can already handle these kinds of everyday tickets, we’re looking at serious changes in the near future. Maybe not in years, but in months.\n\nHas anyone else experienced something similar? What are you doing to adapt? How are you thinking about the future of our field?",
    "score": 4724,
    "url": "https://reddit.com/r/cscareerquestions/comments/1m1uw9v/i_just_watched_an_ai_agent_take_a_jira_ticket/",
    "created_at": "2025-07-17T01:42:34.000Z",
    "num_comments": 1126
  },
  {
    "id": "reddit-1mcop22",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I quit CS and I’m 300% happier.",
    "text": "I slaved 2 years in a IT dev program. 3 internships, hired full time as dev (then canned for being too junior), personal projects with real users, networking 2x per month at meetups, building a personal brand. Interviewing at some companies 5x times and getting rejected for another guy, 100’s of rejections, tons of ghost jobs and interviews with BS companies, interned for free at startups to get experience 75% which are bankrupt now, sent my personal information out to companies who probably just harvested my data now I get a ton of spam calls. Forced to grind Leetcode for interviews, and when I ask the senior if he had to do this he said “ nah I never had to grind Leetcode to start in 2010.\n\nThen one day I put together a soft skill resume with my content/sales/communications skills and got 5 interviews in the first week.\n\nI took one company for 4 rounds for a sales guy job 100% commission selling boats and jet ski’s.\n\nThey were genuinely excited about my tech and content and communication skills.\n\nThey offered me a job and have a proper mentorship pipeline.\n\nI was hanging out with family this last week and my little 3 year old nephew was having a blast. And I just got to thinking…\n\nThis little guy doesn’t give 2 shits how hard I am grinding to break into tech.\n\nLife moves in mysterious ways. I stopped giving a shit and then a bunch of opportunities came my way which may be better suited for me in this economy.\n\nLife is so much better when you give up on this BS industry.\n\nTo think I wanted to grind my way into tech just to have some non-technical PM dipshit come up with some stupid app idea management wants to build.\n\nFuck around and find out. That’s what I always say.\n\nEdit *** I woke up to 1 million views on this. I’m surprised at the negative comments lol. Life is short lads. It takes more energy to be pressed than to be stoic. Thanks to everyone who commented positively writing how they could relate to my story. Have a great day 👍",
    "score": 4497,
    "url": "https://reddit.com/r/cscareerquestions/comments/1mcop22/i_quit_cs_and_im_300_happier/",
    "created_at": "2025-07-29T21:51:06.000Z",
    "num_comments": 868
  },
  {
    "id": "reddit-1mg2r6y",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "The era of AI slop cleanup has begun",
    "text": "I’m a freelance software engineer with about 8 years of experience mainly in early stage startups. At this point, I have a pretty steady flow of referrals. I don’t take every project on and not every one works out, but enough do that I can do it more than full time. \n\nLately, though, I have noticed a large increase in projects where they paid a ton of money for an internal software and it does not work well at all. Tons of errors, unreasonably slow, inefficient and taking up a lot of resources, and large security flaws. At first, I thought maybe people just hired bad developers. The bar is pretty low to call yourself a developer or even a software engineer anyways, but I’m seeing the same problems now on multiple projects. \n\nWhen I take on a project on, I always sign an NDA and look at their codebase to look at some upfront issues that I can bring up because, most of the time, the people hiring me aren’t technical and don’t understand what the problem is. This is probably the 5th time now that a lot of the code was obviously AI generated. Comments in the code that were obviously written by AI, algorithms that are inefficient and make no sense, cluttered data structures, inconsistent coding patterns, etc. The overall thing is that, yes it mostly works, but does so terribly to the point where it needs to be fixed. \n\nIt might be a few years before we start to see this on an enterprise scale, but I’m noticing this becoming a serious problem for small businesses and startups, especially when the founders / people are in charge aren’t technical enough to identify this ahead of time. ",
    "score": 4210,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1mg2r6y/the_era_of_ai_slop_cleanup_has_begun/",
    "created_at": "2025-08-02T22:10:24.000Z",
    "num_comments": 474
  },
  {
    "id": "reddit-1k6x5fv",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Where tf is this industry headed? Layoffs again.",
    "text": "Just had layoffs at the startup I work at. We’re valued at 3.8Bn. Grew close to 28% YoY. Had a great team. We were working well together. I could honestly see no issues. And yesterday? Layoffs. One of my closest friends and teammates was impacted. Maybe he wasn’t putting in crazy hours but was extremely capable and knew what he was doing. Are we gonna pip people for wanting a work life balance?! \n\nWhat hurts more is the manner in which it’s done. We were texting until 4 yesterday and at 5 - his slack is deactivated. Not even a farewell. Nothing. It’s like he just vanished into thin air. \n\nFuck this industry and fuck this company. Fuck the “leaders” who reduce people to mere numbers on this excel sheets. Fuck this shit. \n",
    "score": 3397,
    "url": "https://reddit.com/r/cscareerquestions/comments/1k6x5fv/where_tf_is_this_industry_headed_layoffs_again/",
    "created_at": "2025-04-24T16:51:34.000Z",
    "num_comments": 473
  },
  {
    "id": "reddit-1jvk5td",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Why I left big tech and plan on never coming back.. EVER.",
    "text": "I used to think landing a job at a big tech company would be the peak of my career. Everyone made it sound like once you got in, your life was set. Prestige, money, smart people, meaningful work. I bought into the whole thing. I worked my ass off to get there. Leetcode, system design prep, referrals, rejection after rejection. And when I finally got the offer, I remember feeling like I had won the lottery.\n\nThat feeling didn’t last long.\n\nWhat I stepped into was one of the most toxic, mentally draining environments I’ve ever experienced. It didn’t happen all at once. It crept in. The first few weeks were exciting, but then the cracks started to show. The pressure was insane. The deadlines were borderline delusional. There was this unspoken expectation to be available at all times. Messages late at night. Work bleeding into weekends. No one ever said it out loud, but if you wanted to be seen as serious, as someone who \"got it,\" you had to sacrifice everything else.\n\nThe culture was a constant performance. I couldn’t just do my job. I had to sell it. Everything I worked on needed a narrative. Every project had to be spun into something that could fit neatly into a promotion packet or a perf review. I wasn’t building software. I was building a case to not be forgotten. Because every quarter, someone got labeled as underperforming. It didn’t always make sense who it was. Sometimes it was the quietest person on the team. Sometimes it was someone who just had the wrong skip manager. Everyone smiled in meetings but no one felt safe.\n\nThe politics were unbearable. Influence mattered more than clarity. Visibility mattered more than functionality. Everything had to be socialized in just the right way to just the right people. One wrong Slack message or a poorly timed piece of feedback could nuke months of work. And if you didn’t know how to play the game, it didn’t matter how smart or hardworking you were. You were dead in the water.\n\nWork-life balance was a joke. I was constantly anxious, constantly behind, constantly checking messages like something was going to blow up if I missed a ping. I stopped sleeping properly. I stopped seeing friends. I stopped caring about things I used to love. My weekends were spent recovering from the week and bracing for the next one. And the whole time I kept telling myself it was temporary. That it would get better. That if I just made it to the next level, it would all be worth it.\n\nBut it never got better. The pressure just got worse. The bar kept moving. The layoffs started. The reorganizations. The endless leadership changes. Half my team vanished in one cycle. I remember joining a Zoom call one morning and realizing I didn’t even know who my manager reported to anymore. People were disappearing mid-project. Morale was a punchline. Everyone was scared but pretending they weren’t. Everyone was tired but still smiling in team standups. I started to feel like I was losing my grip.\n\nWhen I finally left, I didn’t feel free. I felt broken. It took months before I stopped checking my calendar every morning out of reflex. I still have dreams about unfinished sprints and last-minute roadmap changes. I still flinch when I see a Slack notification.\n\nPeople glamorize these jobs because of the compensation and the brand names. But no one talks about the cost. I gave that place everything and it chewed through me like I was nothing. Just another seat to fill. Just another cog in the machine. I left with more money, sure. But I also left with burnout, insomnia, and a genuine hatred for the industry I used to be passionate about.\n\nI don’t know if I’ll go back to big tech. Right now I’m just trying to feel like a human again.",
    "score": 2883,
    "url": "https://reddit.com/r/cscareerquestions/comments/1jvk5td/why_i_left_big_tech_and_plan_on_never_coming_back/",
    "created_at": "2025-04-09T23:38:44.000Z",
    "num_comments": 438
  },
  {
    "id": "reddit-1kqglzc",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "STEM fields have the highest unemployment with new grads with comp sci and comp eng leading the pack with 6.1% and 7.5% unemployment rates. With 1/3 of comp sci grads pursuing master degrees.",
    "text": "[https://www.entrepreneur.com/business-news/college-majors-with-the-lowest-unemployment-rates-report/491781](https://www.entrepreneur.com/business-news/college-majors-with-the-lowest-unemployment-rates-report/491781)\n\n  \nSure it maybe skewed by the fact many of the humanities take lower paying jobs but $0 is still  alot lower than $60k.\n\nWith the influx of master degree holders I can see software engineering becomes more and more specialized into niches and movement outside of your niche closing without further education. Do you agree?",
    "score": 2844,
    "url": "https://reddit.com/r/cscareerquestions/comments/1kqglzc/stem_fields_have_the_highest_unemployment_with/",
    "created_at": "2025-05-19T16:49:36.000Z",
    "num_comments": 592
  },
  {
    "id": "reddit-1k7a3y8",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Reminder: The people on this sub who say that \"AI will replace Software Engineers\" are most likely unemployed new grads.",
    "text": "I've had this convo way too many times.\n\n**Person:** \"AI is going to replace us! It can literally code new features in seconds\"\n\n**Me:** \"Oh, what kind of features are you talking about?\"\n\n**Person:** \"Well, I created a TODO app in 10 minutes with it\"\n\n**Me:** \"Oh.. what about a feature for a production-grade, enterprise level application used by real users?\"\n\n**Person:** \"Well considering it helped me in my TODO app so much, it could easily help there too\"\n\n**Me:** \"Oh.. do you have any experience with working on these kinds of systems?\"\n\n**Person:** \"No....\"\n\n\n\nPlease, for the love of god, if you don't have any actual experience as a software engineer, shut up about AI.",
    "score": 2712,
    "url": "https://reddit.com/r/cscareerquestions/comments/1k7a3y8/reminder_the_people_on_this_sub_who_say_that_ai/",
    "created_at": "2025-04-25T02:25:52.000Z",
    "num_comments": 370
  },
  {
    "id": "reddit-1ix1rsz",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I Just Got Laid Off – But It Might Actually Be the Best Thing That’s Happened to Me!",
    "text": "Guys, I am absolutely freaking out right now, and I had to share. So, here's the deal:  \n\nThe last couple of months at my company have been *rough* – a ton of layoffs, and I was just waiting for the other shoe to drop. I had this sinking feeling I might be next, so I started job hunting in January (safety net, right?). Fast forward to last Friday, and I land this AMAZING job offer. Great pay, better benefits, the whole shebang. I was stoked, it felt like such a perfect fit, and I was already planning to resign today.  \n\nBut guess what just happened? My SVP called me *just now*. The conversation went something like this: \"Tough decision, but we're having to let you go, and we want to part on good terms.\" And to add a little salt (or should I say sugar?) to the wound, they’re offering me *five months* severance pay.  \n\nI’m literally screaming in excitement because not only did I dodge a bullet with the layoffs, but now I’ve got an even better opportunity lined up. It’s like the universe had my back!  \n\nSo yeah, I'm still processing all this, but I just wanted to share this wild, unexpected turn of events with you all. It’s crazy how things work out sometimes.  \n\nHere's to new beginnings!",
    "score": 2686,
    "url": "https://reddit.com/r/cscareerquestions/comments/1ix1rsz/i_just_got_laid_off_but_it_might_actually_be_the/",
    "created_at": "2025-02-24T13:16:16.000Z",
    "num_comments": 159
  },
  {
    "id": "reddit-1k4dbtu",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I gave up after 2 years and took the easy way out",
    "text": "I was laid off in May 2023. I have 10 YOE, CS degree, and am a US citizen. I spent 4 years in the startup world as a Frontend Developer and 6 years at a F500 as a Senior Fullstack Engineer.\n\nOver the last two years I made it to 18 final rounds. I lost count of the amount of applications and interviews total. I was always just a bit short on aligning perfectly with their stack, a year too short on a certain technology, wrong cloud platform, etc. I got a part-time job, lived frugally, stretched my emergency savings / severance and told myself that the next one would surely be the one. I was so close, third time must be the charm or fourth or fifth, etc. \n\nI hid my unemployment from my family out of shame for 2 years. Then when April came around I was staring down the barrel of my 2 year mark of employment with nothing left in my savings. I confessed to my father with humility and asked for help. I am now starting as a Systems Engineer at a family friend's company next month after 2 rounds of interviews. I didn't even have to solve algorithms or draw up system designs. I am a bit ashamed of taking advantage of nepotism. I didn't see a light at the end of the tunnel anymore. I was exhausted and saw a lifeline being thrown and took it. I guess I am sharing this on a throwaway just to confess and in case others would find my story interesting.\n\n\nEdit: To answer some comments\n\n- This is very much a nepo hire, not networking. The family friend is the CTO.\n- I did reach out to my network just not to my father because I didn't want to worry or disappoint my parents.\n- Yes it was a mistake to wait so long, I just always felt like the next one would be the one.",
    "score": 2674,
    "url": "https://reddit.com/r/cscareerquestions/comments/1k4dbtu/i_gave_up_after_2_years_and_took_the_easy_way_out/",
    "created_at": "2025-04-21T13:19:16.000Z",
    "num_comments": 355
  },
  {
    "id": "reddit-1mdcl9n",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Genuinely what the HELL is going on?",
    "text": "The complete lack of ethics driving this entire AI push is absurd and I’m getting very scared. Is everyone in tech ghoul? Nobody cares about sustainability or even human decency anymore it seems. The work coming out of Google right now is so evil it’s hard to believe this is the same company from 2016. AI agents monitoring and censoring us based on whatever age they determine we are. The broader implications are mind numbing. There is no way engineers can be this detached from the social contract to make stuff like this what are y’all doing fr??????? I mean some of you work at palantir tho so. It’s all fun and games til it’s not. \n\n\n\nEDIT: This is not about YouTube but the industry as a whole. I’m 25 bear with me if I sound naive but the apathy over the last two years has lead me down a road of discovery. It genuinely just feels weird working with some of the most influential yet evil people on earth and like nobody says anything….even if not in the name of strangers, maybe their kids, their families, the planet. We all have more power than we like to believe. It’s hot and it’s only going to get hotter…..\n\nEdit: examples of nonsense \n\nhttps://x.com/culturecrave/status/1950636669507674366?s=46",
    "score": 2615,
    "url": "https://reddit.com/r/cscareerquestions/comments/1mdcl9n/genuinely_what_the_hell_is_going_on/",
    "created_at": "2025-07-30T17:20:37.000Z",
    "num_comments": 672
  },
  {
    "id": "reddit-1n6nk56",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Uncle Bob predicts a reverse bubble pop for CS jobs",
    "text": "AI is in a bubble just like the the dotcom bubble in the year 2000. Internet is one of the greatest technological advancements of all time - but it was in a bubble because tons of investment flowed into it, companies over hired, and most companies just didn't make it. the ones that did changed the world forever\n\n  \nSame is happening with AI. Tons of investment flows in, but companies are doing the opposite with hiring. They are ***under hiring*** because of the expectation that AI will replace employees (it wont). So when pops, companies will rush to hire talent back up. I agree",
    "score": 2566,
    "url": "https://reddit.com/r/cscareerquestions/comments/1n6nk56/uncle_bob_predicts_a_reverse_bubble_pop_for_cs/",
    "created_at": "2025-09-02T16:04:46.000Z",
    "num_comments": 463
  },
  {
    "id": "reddit-1j2wrdv",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Wiped my company's production DB last week.",
    "text": "**Preface**: 8 YoE, Big company (where I work) acquired a small but very successful product last year. I recently moved over to this product to help integrate it into our suite of software.\n\n**Story**: Unfortunately, this product lacked any sort of staff tooling, so support requests were more often than not accomplished by running SQL directly on the production database (💀).\n\nOne of the most standard requests was updating product codes that were _specific_ to a user's account, i.e. a given product code for one user would not work for another user. The SQL boiled down to:\n\n    UPDATE \"users\"\n    SET \"product_access_codes\" = \"...\"\n    WHERE \"users\".\"id\" = '289571032';\n\nLast week, while on-call, I wake up to an \"urgent\" request to enable a user's product codes in time for a demo \"very soon\". Having done this countless times, I whip up and run the following:\n\n    UPDATE \"users\"\n    SET \"product_access_codes\" = \"...\";\n    WHERE \"users\".\"id\" = '289571032';\n\nNotice anything? Well I didn't until I saw the dreaded \"12857294 rows affected\" result. There is truly no stronger stimulant than the realizing that you just bricked the production database by overwriting the user table with bad data. \n\nAfter coming to terms with the reality of my situation over the next 10 seconds (felt like 10 hours) I hit up our SRE team and give them the bad news.\n\n**Outcome:** Luckily for me, our SRE team had backups configured such that we were able to restore the database to the state ~2 minutes before my mishap. Total downtime ended up being ~20 minutes while we ran the restore.\n\nAfter the dust settled I'm glad to report I did not in fact lose my job. I _did_ feel incredibly embarrassed, but equally thankful for my coworkers being empathetic and understanding that mistakes can happen. My EM blamed the situation more on our lack of tooling, so we sliced up some time last week to write our first version of staff tools.\n\n**Takeaway**: Doesn't matter how many times you've done something or how long you've been in the game, fuck-ups do happen and often when you feel the most complacent. This was a query I'd written many times over; the early morning request plus the urgency led me to get complacent and cut corners.\n\nMore importantly though, in retrospect, **always turn off autocommit in your production DB sessions**. I could have avoided the entire situation had my SQL instead been\n\n    \\set AUTOCOMMIT off\n    BEGIN;\n    UPDATE \"users\"\n    SET \"product_access_codes\" = \"...\";\n    WHERE \"users\".\"id\" = '289571032';\n\nUpon seeing the syntax error and rows affected output I could have just ran `ROLLBACK` and avoided the whole situation. I honestly wanted to write this post mainly just to call out the fact that anytime you run SQL in production it should be wrapped in an explicit transaction.",
    "score": 2564,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1j2wrdv/wiped_my_companys_production_db_last_week/",
    "created_at": "2025-03-03T23:29:44.000Z",
    "num_comments": 397
  },
  {
    "id": "reddit-1ojbebq",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Just pushed my first PR for my new job at Azure after leaving AWS!",
    "text": "After ~~being asked to leave~~  **voluntarily** departing from AWS last week to search for new opportunities, I am happy to state that I found a new job at Azure!\n\n \n\nI'm meeting my new team later this afternoon for onboarding, and I wanted to leave a good first impression before that meeting, so I coded my first PR and self-approved it a few minutes ago to show that I'm a go-getter who takes initiative! It was just a one-line change for some DNS settings and I ran it through chatGPT and everything checked out! They are going to be so impressed with me! There were some pipeline warnings that initially prevented me from releasing it to the higher environments, but I managed to find a workaround by borrowing the credentials from my coworker’s laptop!\n\n\n\nDo you have any other suggestions for what to do before my meeting? It feels good being part of an amazing team and help keep the internet alive!",
    "score": 2539,
    "url": "https://reddit.com/r/cscareerquestions/comments/1ojbebq/just_pushed_my_first_pr_for_my_new_job_at_azure/",
    "created_at": "2025-10-29T17:49:00.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1i8p6am",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Hacks to get hired at Amazon",
    "text": "Hey, I’m a software engineer at Amazon and want to share some hacks on getting hired.\n\nCouple points: \n1) Please do not message me\n2) I have participated in many interviews, this is my experience, the morals of these cheats or whether you have success is up to you.\n\n\n\n First, the coding rounds (not including OA) does not allow you to run your code, it’s basically a blank text editor. Many interviewers cannot really tell if your code will run, they just see if it “looks correct”. I’ve seen a lot of candidates get hired by borderline writing pseudocode. The lesson here is to waste zero time wondering about nit-picky details like if your loop is off by one, or what that built in method to convert an int to a string is… they care about SPEED and just that you have the right idea.\n\nSecond, Amazon treats their LPs like the holy texts. But the only thing that really matters is delivering to please your superiors no matter what. This means put customer obsession, deliver results, and ownership above all else. These are the rules you live by. You tell these people that you skipped Christmas because you had to fix an open source dependency to unblock some random guy in Indian if you have to…\n\nHonestly I hate this company but if this helps you get hired I’m happy for you, just know that if you do get hired and you BS’d using my tried and true formula, you may get pipped.",
    "score": 2504,
    "url": "https://reddit.com/r/cscareerquestions/comments/1i8p6am/hacks_to_get_hired_at_amazon/",
    "created_at": "2025-01-24T06:23:02.000Z",
    "num_comments": 313
  },
  {
    "id": "reddit-1kslf3b",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "After 4 years at Google, here's my honest take on why their work culture and processes didn't work for me.",
    "text": "I recently left Google after nearly four years. I wish I could say it lives up to all the hype, but it didn't. I honestly felt like I did some of the worst work of my career there. The environment, the processes, and team dynamics simply didn't align with my approach for how to collaborate and ship software. I've been reflecting on exactly why I wasn't able to make it work for me.\n\nJust to brace you, I know just how ranty this is going to sound. I'm not writing this as a condemnation of Google, because I know there are people that thrive and enjoy working there. This is just my own personal perspective on it. Take it with a grain of salt.\n\n# Agile is a Sin\n\nI come from companies that do agile processes. It's not perfect, but it's empowering and very adaptive to change. I've been told that agile processes do not scale. So when I joined Google, I was extremely interested in learning how and what Google does to ship software. They must be doing something slightly different or better to ship software at scale, right?\n\nWrong. They quite literally don't have processes around collaboration. It's basically waterfall. Product writes up a doc. Gets buy-in from leadership. Tosses it at engineering. And then we never see them again, so we're left to implement it as we see fit.\n\nIt is literally the most expensive and high risk software development I've seen in my entire career. They basically have blind faith they've hired super smart people that will just magically build the perfect product. Which to be fair, they do quite literally have a lot of *rock star* developers. But relying on purely heroics to ship software is a recipe for burn out and knowledge silos.\n\nAlso, they don't ship software. Deadlines are arbitrary. There are so many times when we approach a deadline only for \"X\" feature needs to absolutely be there on release so we'll just push out the release. I think deadlines are stupid, so I don't want to pretend like I care about them. But I do care about shipping software. The sooner you ship, the sooner you can start to learn and prove that your core assumptions are right or wrong. So to ship sooner, you need to downscope. If your MVP (minimal viable product) requires several really difficult features to implement, maybe it's not an MVP anymore. But then again, I guess no one called it an MVP, but me, who is used to shipping software regularly.\n\n# The Doc Machine\n\nSo, if you're not regularly shipping software, how can you possibly measure impact?\n\nDocs.\n\nEndless docs.\n\nCountless docs.\n\nSo many docs that it can be impossible to find what doc says what you did.\n\nGoogle's mission is to \"organize the world's information.\" Internally in Google, they generate a lot of information in docs, and it's very hard to search and find the information you're looking for.\n\nWhat's the point of docs no one reads? Well, since software doesn't get shipped, I assume it just acts as a laundry list of links when attempting to show impact for your performance reviews or promotions. You might not have shipped anything, but at least you left a paper trail of what you didn't ship.\n\nYou want to know the worst part of it? They want you to write a doc on a system you don't understand. So you write it up, make some assumptions and send it out for approval. No one reads it to approve it. Let's say you get your single approver and start implementing. Guess what, your core assumption is wrong. The data isn't in the right place, or the data you thought had what you needed, doesn't. Now you need to rewrite the doc.\n\nWhat's the point of getting approval? What's the point of a doc that is wrong from the start? What's the point of upfront design that is wrong? Why not just implement and find out what actually is going on and make it work?\n\nThe point is, it's just theater to make it look like we're doing our jobs. Why isn't the software the evidence we're doing our job?\n\nI'm not trying to say docs are bad, and everything should just be tribal knowledge. But I am saying docs that need to be rewritten from the get-go are a waste of time.\n\n# Bad docs\n\nIronically, despite needing to write so many docs to implement things. When you read other people's docs, you might notice something. They're very high-level. They're more like a thesis, then like actual documentation on how to use an API.\n\nWhat is the point of docs that don't answer how to use an API?\n\nFocusing on the high-level philosophy of a service is honestly distracting and unhelpful. I think I understand why this happens. It's hard to keep docs up to date. So if you keep them high-level, they won't become obsolete or need to be updated. But I don't care about your thesis defense; I just want to use your software to solve my problem.\n\nAnd I know Google can write good docs. [Angular](https://angular.dev/overview) has fantastic documentation. [Proto Buffers](https://protobuf.dev/overview/) have great docs. Both of these are made by Google. I guess the difference is they're public facing and Google doesn't prioritize internal docs like they do their external facing ones.\n\n# A Culture of Silence\n\nSo, there is a lot of lip service towards how open Google is. Say how they're trying to encourage employees in fireside chats to not ask anonymous questions so that leadership can follow up with the individual to gain more context. (This, by the way, does not prevent people from asking anonymously, which they do.)\n\nThere is also a culture of no-blame retrospectives. They don't run regularly, even when I advocate for them. And worst of all, when we finally do run retrospectives, we don't discuss challenges and problems we are encountering. So, what's the point of a retrospective that doesn't talk about pain points and mitigation strategies? From my perspective, it just looks like theater and a way to paint a false view that everything is good and we have nothing to complain about. Or worse, that we are helpless and we really cannot change anything.\n\nComing from companies with genuinely open cultures where we fostered candid and open discussions, it's baffling to me that no one seems willing to put in the minimal effort to improve everyone's lives.\n\nIt is better to be positive about a broken system and keep the status quo than it is to ask people to put in a laughable small level of effort to make everyone's life better. Not everything is going smoothly all the time. And assuming we **want** it to run smoothly, we should probably discuss the pain points and workarounds or solutions to them. Knowledge silos are bad. More open discussions can reduce knowledge silos which reduces the burden on individuals and gives everyone a balance for job responsibilities.\n\n# A Culture of Bottom-Up (but only if it's top-down)\n\nSo, in meetings with leadership. They emphasize that our *bottom-up culture* is how we do such great work. And by *bottom-up*, they apparently mean *top-down*.\n\n# When Bottom-Up Meets Brick Wall\n\nSo, let's say our UXR (user experience research team) has come up with an obvious gap in our offerings. What would you do? Perhaps gather some people from multiple disciplines and brainstorm a solution. Or maybe you just get leadership and design in a room and iterate on who knows what behind closed doors for literal months, before you ever even involve engineering. And for those few months, you pull engineering off their current teams in a large-scale reorg and don't give them marching orders instead just give them a bunch of vague ideas of what they might want to build. Like...what is engineering supposed to do? Build against an invisible moving target? The answer is, that is exactly what we do. Not because it's a good use of our time, but because we have nothing better to do and we have no input into the vision of the product.\n\nSo let's say, you're an engineer, like yours truly, and you think that process is stupid, and instead you really do want to try to implement a bottoms up initiative. So maybe, see a feature, we originally spec'd out but was dropped because they didn't see the current value in implementing it. But it sounds kind of cool, and shouldn't be that difficult to get an MVP for this feature. Maybe you go to reach out across teams, pull in people that own data you need, a team that works on Android and iOS, and try to get people from the backend team so you can make an e2e MVP to demonstrate this feature is doable. Also, act as a test bed to show smaller agile processes work and probably how we should handle work in the org.\n\nSounds pretty encouraging, right? But here is the real problem, one of the teams is a no-show. Not only are they a no-show, they also refuse to work with you and ignore your messages. You escalate to your manager and tech lead, and that team also ignores them too. You work with the other teams and implement everything, but say the one thing to tie everything together and make it work e2e. Let's say a backend team refused to work with you. So, naturally, offer to do the work for them. And they tell you to not do that. Because it's not my code base, I'm not on call, and I don't have to maintain it. So what do you do?\n\nWhat I did was create a video demo that made it look like it should work and presented it to leadership. We were reorged before this demo was even presented, so the feature died on the vine.\n\n# The Only MVP Is Minimum Viable Plausible Deniability\n\nLet's say that you do still believe in the rhetoric that, *the organization really does believe in bottom-up*. So you take some time and write up a doc (which is an activity you don't enjoy but if that's how the game is played, and you want to play ball, you do it). The doc outlines an open source initiative that is coincidentally attempting to solve the space we just tried to fill. But since there's an open-source community trying to solve the same problem space, maybe we can just leverage that and even help them grow at the same time. Anyway, it was super nice to have leadership hear me out, but they didn't want to go with it, because it turns out that one of the reasons we hamstrung our last project was because we were attempting to skirt a legal definition that the open source project is tackling head on. Suddenly, it made more sense: The original project was destined to fail, not because it was a bad idea, but because they were trying to handicap the implementation to avoid legal scrutiny.\n\nFundamentally, we're not trying to build good software or solve problems. We're just trying to do something without bringing legal scrutiny to Google.\n\nI understand getting sued sucks, and the law is often weaponized against Google. But why handicap ourselves? There are so many other ideas out there. Why not pursue things that are higher value and lower risk? I cynically believe it could just be virtue signaling to investors, to show Google is trying new things and still taking risks. But their risks seem high-risk, low-reward, compared to the normal practices I'm used to, which focus on mitigating risk and prioritizing high value. Taking risks here seems to be about signaling growth, but are they truly growing? Wouldn't the more obvious path be to take the calculated legal risk to solve a real problem and potentially achieve genuine growth? I don't know; I'm not in leadership. I just had a worm's-eye view of the machine.\n\n# Grassroots Agility, Stomped by Apathy\n\nLet's say you came from an agile background and you even believe it. Because you've seen it solve very obvious communication issues that you see arise in large organizations. You've experienced it firsthand, you know it works. You go and explain it to your manager, they say that there are organization issues and leadership is resistant to change. They don't discourage you from trying, but they kind of set the expectations that nothing will change. But, what else are you supposed to do? Nothing?\n\nSo you have a meeting with your skip manager (your manager's manager) once again advocating to adopt agile processes and maybe get more stakeholder buy-in. And they give you the advice to do it locally with your team. You know, \"bottom-up\" kind of stuff.\n\nYou present it to the team. They hate it. They don't want processes. They don't want collaboration or more communication. They say agile practices are dehumanizing and that we are not interchangeable cogs in the machine. A bit of a disservice towards agile processes. But they are willing to try some of the ceremonies.\n\nBut literally, for any reason whatsoever, they cancel meetings, like retrospectives or stand-ups. Maybe we need more time to finish a feature, or maybe it's a holiday, or we get reorged. And we never start up the meeting again, at least until I ask for it. Followed by it once again being canceled at the drop of a hat. And no one cares. They don't see the value in it. And to be honest, the ceremonies are toothless because we don't discuss actual problems, we don't discuss work progress to reduce knowledge silos, and action items are never done and are also usually not meaningful anyway.\n\nThe reason people don't see the value of agile processes is not that it's not a good framework to address communication gaps, but because just doing the ceremonies without the communication makes them pointless. There is value in the ceremonies if they're being used to address the problems. But actively ignoring the problems, even with ceremonies, means we're now just wasting people's time.\n\n# Bottom-Up, Top-Down, and Going Nowhere\n\nIf there is a bottom-up culture at Google, it is self sabotaging. There is so much momentum for the status quo that actual process change is near impossible. The only change that appears to work is a top-down mandate, which they try every year with constant reorgs and get the same results.\n\n# There is No Team in I\n\nSo, coming from an agile background (I know I sound like I'm in a cult, with how much I bring it up, but bear with me), I've come to the understanding that I as an individual do not necessarily matter. It's about putting aside ego and working together on a larger goal. This also comes with a nice benefit of distributing responsibility, and reducing burn out.\n\nThat's pretty damn *ungoogley*. At Google, they're rugged cowboys. They pull themselves up by the bootstrap and don't care about your collaboration. You need to own everything. Your work, your feature, your project, your process, your career. No one is here to help you. You need to just do it yourself. Which is ironic, as [googley-ness](https://staffeng.medium.com/being-googly-62b75dd642df) should theoretically not embody it. But the performance evaluation surely doesn't emphasize trying to make teamwork work.\n\n[A bus factor](https://en.wikipedia.org/wiki/Bus_factor) of 1 is seen as a positive thing. It means you've made yourself invaluable. You are the sole point of contact, and despite that sounding like a lot of annoying responsibility, it's perceived as good because you *own* it.\n\nI hate knowledge silos. I do not believe it makes anyone more valuable. I fought against the hoarding of knowledge. I'd include people into meetings to make sure I'm not the only one with context. I'd ask stupid questions and repeat talking points in meetings to make sure I understood and we were aligned. These are all considered negative things at Google. Because it is seen as wasting everyone's time in the meeting. It is better to repeat yourself with several dozen 1:1s (or I guess write yet another doc no one will read) than it is to talk it over in a group and make sure there is no ambiguity.\n\nIt could just be me though. But it sure felt like it, when my manager said I was *\"leaning on others too much.\"* How else am I supposed to read that?\n\nI've never seen such an environment that is literally so hostile to collaboration.\n\n# Performative Theater\n\nI hate 1:1s. I think they're a waste of time. I would even argue that most 1:1s are a waste of time in every context. I'm probably being hyperbolic, as I'm sure there must be cases where 1:1s are beneficial. But I'm struggling to think of one right now.\n\n1:1s are a bottleneck to communication. And judging by how often my 1:1s were canceled with my managers, I'd have to say they don't value them either.\n\nSo, I'm a huge advocate for openness and transparency. And after one reorg (I went through 5 reorgs in my 4 years at Google, and been through 7 managers, chaos is the norm) leadership was attempting to be more open and transparent and so allowed anyone to join their meetings. So, since I felt like I did not have enough context to understand their decisions, I joined those meetings.\n\nWhen they asked if everyone had context on a doc, I was the only person to raise my hand and said I did not. I guess this was a sin to acknowledge my own ignorance, because it turns out after the next meetings I was removed from the subsequent meetings. I asked my manager if I could be brought back to gain more context, and he told me I had enough context to do my job. While probably true, I had a suspicion that my work was not very high priority. Maybe we should work on something else. Anyway, this taught me that it's all optics. I think my manager wanted to control the narrative. If he wasn't there to be a middle man, what is his job? Like, seriously, what *is* his job? I still don't understand what value he brought.\n\n# Tech Debt Forever\n\nTo say Google's code base is complex is an understatement. Not only is it complicated, it's also a mess. Not only is it a mess, but it's also poorly documented. And not only that, but it actively fights you as you make changes and try to understand it.\n\nCryptic compile errors. Cryptic build errors. Cryptic run time errors. And just when you think you've finally got it working. There are blockers on merging the code because of invisible linting errors you didn't know you were violating. Or there is some weird test case that broke, but only after 3 hours of running tests in the CI pipeline. Or maybe, you just want to delete some code, but it turns out that the code you're trying to delete has a different release schedule, so it cannot be deleted with other code. And the other code is dependent on the first bit of code that you cannot delete being deleted. The code is constantly fighting you. And maybe if we could discuss these issues in a group, we could understand the problems quicker or come up with strategies to mitigate them...but it turns out talking about how much it sucks to write code is frowned upon. So you just need to keep it to yourself. And I'm left wondering, *am I the problem?* Is my career a lie? Do I have imposter syndrome if I don't actually know what I'm doing? It makes you question everything.\n\nSo I talked with my director (the skip’s manager) about my challenges. And I was candid about it. And he said, \"It sounds like you need mentorship.\" And I said, that's exactly what I need. And he said he'd help get me some. I messaged him every week for a few months. He offloaded this responsibility to my manager, who naturally, did nothing. By the time I left, I made the request 8 months prior. I was clearly not getting the mentorship I asked for. My manager's *wonderful* feedback was, \"maybe you should find your own mentorship.\" And it does make me wonder, \"what is *your* job if it is not to help me do *my* job better?\" Anyway, I also was unable to find mentorship on my own. And it does make me wonder, does anyone truly understand the beast that is Google's complex internally built tech stack with poor documentation? Even the internal AI that is usually pretty good at explaining some of the code, will just straight-up hallucinate how the code works and then it becomes very hard to understand. The AI will tell you a very convincing lie, but you won't know it's a hallucination or how to possibly fix it, because the documentation is poor and the only way to learn how it really works is to reverse-engineer it by performing code archaeology.\n\n# I'm out\n\nSo I left Google. It was amicable. This was, of course, also only my personal experience in my particular organization. I've been told different parts of the org and different teams are said to have different cultures. Heck, even some people might even thrive in the culture I described. But it's not for me.\n\nThey gave me severance, which was honestly extremely nice. I tried so hard to bring cultural change to Google, but there is no willingness to change. Honestly, with the amount of money they're printing with ads and search, there is no pressure for them to make any changes.\n\nThere is a clear cultural mismatch between what I value and what Google values. Even if Google pays lip service that they value the same things I value, their actions clearly show they do not. And so, I am honestly happy to be free from them and given the time to look for a place that values what I want.\n\nI used to believe I was *a mercenary for hire to the highest bidder*. But you know what? Apparently, within reason. I just want to work, collaborate, and iterate on software. Is that asking for too much? The one thing I can take away from my time at Google is that I now have a clearer understanding of what I'm looking for in my next step.",
    "score": 2400,
    "url": "https://reddit.com/r/cscareerquestions/comments/1kslf3b/after_4_years_at_google_heres_my_honest_take_on/",
    "created_at": "2025-05-22T08:13:58.000Z",
    "num_comments": 399
  },
  {
    "id": "reddit-1mmx040",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "The computer science dream has become a nightmare",
    "text": "https://techcrunch.com/2025/08/10/the-computer-science-dream-has-become-a-nightmare/\n\n\"The computer science dream has become a nightmare\nWell, the coding-equals-prosperity promise has officially collapsed.\n\nFresh computer science graduates are facing unemployment rates of 6.1% to 7.5% — more than double what biology and art history majors are experiencing, according to a recent Federal Reserve Bank of New York study. A crushing New York Times piece highlights what’s happening on the ground.\n\n...The alleged culprits? AI programming eliminating junior positions, while Amazon, Meta and Microsoft slash jobs. Students say they’re trapped in an “AI doom loop” — using AI to mass-apply while companies use AI to auto-reject them, sometimes within minutes.\"",
    "score": 2397,
    "url": "https://reddit.com/r/cscareerquestions/comments/1mmx040/the_computer_science_dream_has_become_a_nightmare/",
    "created_at": "2025-08-10T23:07:52.000Z",
    "num_comments": 563
  },
  {
    "id": "reddit-1l0wg36",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Big tech engineering culture has gotten significantly worse",
    "text": "Background - I'm a senior engineer with 10yrs+ experience that has worked at a few Big Tech companies and startups. I'm not sure why I'm writing this post, but I feel like all the tech \"influencers\" of 2021 glamorized this career to unrealistic expectations, and I need to correct some of the preconceived notions.\n\nThe last 3 years have been absolutely brutal in terms of declining engineering culture. What's worse is that the toxicity is creating a feedback loops that exacerbates the declining culture.\n\nSome of the crazy things I've heard\n\n* \"I want to you look at every one of your report and ask yourself, is this person producing enough value to justify their high compensations\" (director to his managers)\n* \"If that person doesn't have the right skills, get rid of them and we'll find someone that does\" (VP to an entire organization after pivoting technology direction). \n   * I.e. - It's not worth training people anymore, even if they're talented and can learn anything new. It's all sink or swim now\n* \"If these candidates aren't willing to grind hundreds of leetcode questions, they don't have mental fortitude to handle this job\" (engineers to other engineers)\n   * To be fair, I felt like this was a defense mechanism. The amount of BS that you need to put up with to not get laid off has grown significantly.\n* \"Working nights and weekends is expected\" (manager to my coworker that was on PIP because he didn't work weekends).\n   * I've always felt this pressure previously. But I've never heard it truly be verbalized until recently.\n\n  \nFinal thoughts\n\n* Software engineering in big tech feels more akin to investment banking now. Most companies expect this to be your life. You truly have to be \"passionate\" about making a bunch of money, or \"passionate\" about the product to survive.\n* Don't get too excited if your company stock skyrockets. The leaders of the company will continue to pinch every bit of value out of you because they're technically paying you more now (e.g. meta) and they know that the job market is harsh.\n* Prior to 2022, Amazon was considered the most toxic big tech company. But ironically, their multiple layers of bureaucracy and stagnating stock price likely prevented the the culture from getting too much worse, whereas many other companies have drastically exceeded Amazon in terms of toxicity in 2025. IMO, Amazon is solidly 50th percentile in terms of culture now. If you couldn't handle Amazon culture prior to 2022, then you definitely can't handle the type of culture that exists now.",
    "score": 2393,
    "url": "https://reddit.com/r/cscareerquestions/comments/1l0wg36/big_tech_engineering_culture_has_gotten/",
    "created_at": "2025-06-01T18:42:37.000Z",
    "num_comments": 505
  },
  {
    "id": "reddit-1l157qe",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "How to deal with a dev who works constantly?",
    "text": "I am a mid-level dev on a team and we recently hired another mid-level dev. He is really nice, but is constantly working. I am seeing him commit code at 2 am, 7am, 3pm, 10pm etc. And he is taking most the tickets in the backlog. He completed an entire epic in 3 days working overnight. It's starting to make what was once a great team environment feel hyper competitive and stressful, as I have to scramble just to get work before he gobbles up several more tickets. And now I'm spending more time just reviewing his work than doing my own. In standup he is getting praised as a 'superstar', but in my view he is making the work environment a bit toxic.\n\nI want to bring this up to my lead at my next 1:1, but I'm not really sure how to phrase it as I dont want to be viewed as petty or lazy. Any advice?",
    "score": 2184,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1l157qe/how_to_deal_with_a_dev_who_works_constantly/",
    "created_at": "2025-06-02T01:08:46.000Z",
    "num_comments": 684
  },
  {
    "id": "reddit-1o29tge",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Thanks to all the AI coders out there, im busier than i've been in years",
    "text": "I've been freelancing on the side for more than couple years now, mostly helping startups and smaller teams fix bugs, add features, the usual stuff.\n\nUsed to be maybe 1 or 2 projects a month. Now I'm turning people away because there's too much work coming in. And I'm pretty sure I know why.\n\nAbout 70% of the requests I get now are basically \"we built this with AI and it doesn't work, can you fix it?\"\n\ntbh I'm not mad about it. The money's good and the issues are usually pretty straightforward once you dig in. Last few weeks alone I've seen zero input validation, hallucinated libraries that don't exist, payment logic that does the opposite of what the comments say. The security stuff is wild. Apparently 45% of AI-generated code has vulnerabilities and I believe it.\n\nDon't get me wrong, people hired me to clean up messy code before AI too. But it used to be like 1 in 10 projects. Now it's most of them. And the pattern is always the same, looks clean, runs fine once and then falls apart when complexity hits.\n\nMy income's up like 40% from last year and I barely market myself anymore. People just find me when their vibe-coded MVP starts breaking under real use.\n\nSo yeah, thanks AI. Best thing that happened to my side hustle. Hope this keeps up:)",
    "score": 2122,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1o29tge/thanks_to_all_the_ai_coders_out_there_im_busier/",
    "created_at": "2025-10-09T15:59:28.000Z",
    "num_comments": 280
  },
  {
    "id": "reddit-1i2cdfc",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "A Graybeard Dev's Guide to Coping With A.I.",
    "text": "As someone has seen a lot of tech trends come and go over my 20+ years in the field, I feel inspired to weigh in on my take on this trending question, and hopefully ground the discussion with actual hindsight, avoiding panic as well as dismissing it entirely.  \n  \nThere are lots of things that used to be hand-coded that aren't anymore. CRUD queries? ORM and scaffolding tools came in. Simple blog site? Wordpress cornered the market. Even on the hardware side, you need a server? AWS got you covered.\n\nBut somehow, we didn't end up working any less after these innovations. The needed expertise then just transferred from:\n\n\\* People who handcoded queries -&gt; people who write ORM code\n\n\\* People who handcoded blog sites -&gt; people who write Wordpress themes and plugins\n\n\\* People who physically setup servers -&gt; people who handle AWS\n\n\\* People who washed clothes in a basin by hand -&gt; people who can operate washing machines\n\nEvery company needs a way to stand out from their competitors. They can't do it by simply using the same tools their competition does. Since their competition will have a budget to innovate, they'll need that budget, too. So, even if Company A can continue on their current track with AI tools, Company B is going to add engineers to go beyond what Company A is doing. And since the nature of technology is to innovate, and the nature of all business is to compete, there can never be a scenario where everyone just adopts the same tools and rests on their laurels.\n\nLearn how AI tools can help your velocity, and improve your code's reliability, readability, testability. Even ask it to explain chunks of code that are confusing! Push its limits, and use it to push your own. Because at the end of the day/sprint/PI/quarter or fiscal year, what will matter is how far YOU take it, not how far it goes by itself.",
    "score": 1975,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1i2cdfc/a_graybeard_devs_guide_to_coping_with_ai/",
    "created_at": "2025-01-16T00:33:09.000Z",
    "num_comments": 272
  },
  {
    "id": "reddit-1mrfgm2",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Junior devs not interested in software engineering",
    "text": "My team currently has two junior devs both with 1 year old experience. Unlike all of the juniors I have met and mentored in my career, these two juniors startled me by their lack of interest in software engineering.\n\nThe first junior who just joined our company-\n\n•\t⁠When I talked with him about clean coding and modularizing the code (he wrote 2000+ lines in one single function), he merely responded, “Clean coding is not a real thing.”\n•\t⁠When I tried to tell him I think AI is a great tool, but it’s not there yet to replace real engineers and AI generated codes need to be reviewed to avoid hallucinations. He responded, “that’s just what you think.”\n•\t⁠His feedback to our daily stand up was, “Sorry, but I really don’t care about what other people are doing.”\n\nThe second junior who has been with the company for a year-\n\n•\t⁠When I told him that he should prioritize his own growth and take courses to acquire new skills, he just blanked out. I asked him if he knew any learning website such as Coursera or Udemy and he told me he had never heard of them before.\n•\t⁠He constantly complains about the tickets he works on which is our legacy system, but when I offered to talk with our EM to assign him more exciting work which will expand his skill sets, he told me he was not interested in working on the new system which uses modern tech stacks.\n\nI supposed I am just disappointed with these junior devs not only because after all these years, software engineering still gets me excited, but also it’s a joy for me to see juniors grow. And in the past, all of the juniors I had were all so eager to seize the opportunities to learn.\n\nEdit: Both of them can code, but aren’t interested in software engineering.",
    "score": 1784,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1mrfgm2/junior_devs_not_interested_in_software_engineering/",
    "created_at": "2025-08-16T00:28:13.000Z",
    "num_comments": 861
  },
  {
    "id": "reddit-1n7zuba",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "A 5 min weekly habit completely changed my performance review and got me a bigger raise",
    "text": "I know like me a lot of y’all are coming up on your performance reviews or they just passed and I wanted to talk about a habit that I feel like a lot of people might not know about. \n\nWhen performance reviews came around I would spend hours searching slack and jira tickets about what I did the last year, it was incredibly frustrating. About two or so years ago I got a new manager that taught me about brag documents, basically you fill it out through out the year to have all your accomplishments in one document. We did monthly summaries, every month I’d fill out what I did for the month and send it to my manager. It helped a lot during last year’s performance review. Unfortunately, I started filling out my monthly summaries a month later or a few weeks after the week ended cause I was so busy. Still helpful but still stressed me out when I’m trying to focus on coding.\n\nI realized doing it weekly is the hack. Choose the same time every week for me it’s Friday at like 3 and I take 5 mins to log the top accomplishments from the week. Made it easier to make a habit of it rather than forcing myself to write a big review later in the month or year. \n\nFeel free to use this template, it’s simple but gets the job done. \n\n- win: shipped X / fixed Y\n- before / after: 310ms / 190ms \n- metric: \n- who benefited: \n- evidence: link/screenshot \n\n\nIve used notion, google doc and sheet and kudos notes and honestly they all work fine. Use what you feel the most comfortable with and will help you keep the habit up. \n\nif you track wins, what changed for you at review time? any tricks to keep the habit going in month 5–6 and beyond?\n\nTL;DR: track your accomplishments weekly, it makes it easier to remember what you did the last week rather than year. ",
    "score": 1596,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1n7zuba/a_5_min_weekly_habit_completely_changed_my/",
    "created_at": "2025-09-04T03:43:00.000Z",
    "num_comments": 180
  },
  {
    "id": "reddit-1nq5npn",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "My coworker uses AI to reply to my PR review and I hate it",
    "text": "I'm not against him using AI to write code (even though the code he produces clashes with the style, is harder to review, and has been known to not actually solve the bugs.) Given English is not his first language, and he isn't the best written communicator, I'm glad he's finding a tool that enables him to be productive.\n\nHowever, sometimes I'll spend 20 minutes writing a comment on his PR... giving context to some niche code path, how it interacts with other code paths, verbally retracing the conditions that can produce the bug, linking to historical commits helping us both understand the recent changes, etc.\n\nThen I'll get back 5 paragraphs of perfect English with a jovial tone saying my points are *so* valid and here's why my coworker made this change, and this and that...\n\n&gt;Thanks for the detailed feedback and for raising these points. I've looked through the logic, and I think we're on the same page. Here’s a breakdown of how this change fits in with your observations.\n\n&gt;You're absolutely right about the intended system behavior, especially regarding the FooClass workflow and how our SQL query is supposed to handle errors. The core issue we're hitting is a subtle race condition that causes a panic before our self-healing logic can engage.\n\n&gt;The \"Stuck Bar\" Problem &amp; FooClass: Your instinct is correct the foo.error IS NULL check in our query is designed to prevent exactly the kind of loop you described (link). The problem is that the current code panics before it ever gets a chance to call executeBaz(). Because the error state is never saved to the database, the query picks up the same problematic record on every run, leading to a crash loop.\n\n&gt;\\[Three more paragraphs\\]\n\n&gt;In short, this change is a defensive fix that ensures our state is updated correctly, allowing the rest of our robust logic (like the SQL query) to function as intended. It addresses the immediate panic while still validating your points about the overall system design.\n\nClearly my coworker took my painstaking reply, fed it into some model with a prompt like \"reply to this\", and copy/pasted it back.\n\nNow instead of trying to work through the language barrier, I'm forced to interact with yet another chatbot instead of a human.\n\nThe future is here and I hate it.",
    "score": 1491,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1nq5npn/my_coworker_uses_ai_to_reply_to_my_pr_review_and/",
    "created_at": "2025-09-25T12:39:18.000Z",
    "num_comments": 369
  },
  {
    "id": "reddit-1n5xc3s",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I’m told that our “engineering-focused” culture is offputting to women",
    "text": "I’m a computational scientist working at a biotech company at a level equivalent to a Principal/Staff IC at a software company. The world of scientific computing is famous for shoddy software: think one-off Python/R scripts with a single 10k line `__main__()` function, zero version control, and no semblance of engineering or coding rigor. While this is the unfortunate norm in most of academia and industry, the computational biology division of my company differentiates itself by eschewing this trend and acting like a real tech company. We take pride in having a very well-engineered codebase, and it’s a large factor in the company’s success in a very competitive market. The company’s customers consistently tell us that we have the best software and analytical methods in the field, which is a big reason why they use our products.\n\nThe computational biology division is about 90% men. About 25% of our hires are women, but their tenure at the company is much shorter than men’s (median of 2.5 years, compared with 5.5 years for men). A VP at the company (“Velma”) was tasked with improving this attrition discrepancy, and she met 1:1 with all senior members of the division, including myself.\n\nVelma told me that the reasons women give for leaving are not the usual suspects, like bro-y culture, intellectual dismissal, outright sexism, etc. Instead, she said that the overwhelming reason women are dissatisfied is our focus on “engineering minutiae” (her exact words). She gave an example of an interaction I had with “Susan” on our team. Susan wrote a tool that used O(n^(2)) memory, which worked fine on test data but blew up on real data. Rather than implement a simple algorithmic fix that would let it run in O(n) memory, Susan’s solution was to just provision a VM with a ludicrous amount of RAM (&gt;1 TB). I was responsible for reviewing her code, and she pushed back when I told her this would be unacceptable for production use. (Her pushback was along the lines of “the biggest AWS VM has 32 TB of RAM, so until we hit that I don’t see any problem.”) Furthermore, according to Velma, Susan was actually very upset that I asked her to implement the O(n) fix, feeling that I was “trying to run circles around her by showing off my knowledge of obscure CS trivia.” That said, Susan did not directly voice this displeasure to me, and with some guidance, ended up implementing the fix. Her tool now runs great in production. \n\nMy 1:1 with Velma was eye-opening. Thinking back, there is a definite pattern of women on the team writing code that is generally scientifically sound but poor from an engineering/CS standpoint. I did not realize that women specifically were consistently being put off when asked to address these problems. (The opposite problem crops up with some men on the team, whose code is overoptimized and overengineered to the point of unmaintainability. From what I can tell, they are not upset when asked to simplify things — the worst reaction I heard was something along the lines of “that was a bloody clever piece of code and it’s a pity people aren’t willing to take the time to understand it.”)\n\nVelma agreed wholeheartedly that we would not change our rigorous engineering standards, and that there is no quick-fix to this problem. She just asked that I be aware of it, and reflect over the coming months over potential ways we can address it. Given the fairly nuanced and levelheaded takes I’ve seen here on gender issues in tech, I thought I’d ask this sub for any advice or experience. Thanks so much!\n\nEdit: Thanks for all the great replies! Lots of things to think about. One common thread I want to address: I've seen several comments saying that this is jumping to conclusions based on a one-off anecdote. I only listed the Susan story as an example; Velma gave several other such examples, so she's not basing her conclusions on a one-off. Velma is being extremely rigorous about identifying this as a systemic problem; she went through transcripts of all of the division's exit interviews over the last few years, and interviewed multiple current team members.",
    "score": 1477,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1n5xc3s/im_told_that_our_engineeringfocused_culture_is/",
    "created_at": "2025-09-01T18:54:44.000Z",
    "num_comments": 667
  },
  {
    "id": "reddit-1pt4yxh",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I miss having juniors around",
    "text": "Juniors are some of the most creative thinkers in this industry because they haven't been conditioned to use tools and techniques that have matured over time. They're more malleable to new tech. Their solutions come from a place of curiousty rather than ego and it just feels nice to help someone else grow in their career.\n\nI miss being a mentor, I miss having study groups for certs, I miss my friends that were laid off this year and last :(",
    "score": 1461,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1pt4yxh/i_miss_having_juniors_around/",
    "created_at": "2025-12-22T17:10:35.000Z",
    "num_comments": 172
  },
  {
    "id": "reddit-1lb5ktb",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I really worry that ChatGPT/AI is producing very bad and very lazy junior engineers",
    "text": "I feel an incredible privilege to have started this job before ChatGPT and others were around because I had to engineer and write code in the \"traditional\" way.\n\nBut with juniors coming through now, I am really worried they're not using critical thinking skills and just offshoring it to AI. I keep seeing trivial issues cropping up in code reviews that with experience I know why it won't work but because ChatGPT spat it out and the code does \"work\", the junior isn't able to discern what is wrong.\n\nI had hoped it would be a process of iterative improvement but I keep saying the same thing now across many of our junior engineers. Seniors and mid levels use it as well - I am not against it in principle - but in a limited way such that these kinds of things are not coming through.\n\nI am at the point where I wonder if juniors just shouldn't use it at all.",
    "score": 1444,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1lb5ktb/i_really_worry_that_chatgptai_is_producing_very/",
    "created_at": "2025-06-14T10:30:56.000Z",
    "num_comments": 521
  },
  {
    "id": "reddit-1n74jad",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Finally got an offer after a layoff as a 50+ year old SWE",
    "text": "Giving some feedback about the current job market for old guys like myself.\n\nGot laid off two months ago after 25+ years as a generalist Staff/Principal back-end SWE. My company  decided to cut the whole domestic US team to move the work to Eastern Europe.\n\nI remember getting job offers in 1-2 weeks back in the day, before all the crazy AI/COVID over-expansion layoffs. The market is super different now. I sent out about 100 applications and was seriously depressed  by the lack of responses.\n\nBut then, over the last few weeks, the floodgates opened! I was suddenly slammed with interview requests for jobs I'd applied to a month ago. I did seven full interview loops and landed two offers—one from a FAANG-adjacent company and the other from a well-funded startup. Both packages are better than anything I've ever gotten before.\n\nUPDATE 9/4:\n\nAccepted an offer from the startup which is well funded by a big name SV VC for 270K base + 440K options (toilet paper). The FAANG  just didn't have as interesting work and was afraid that I would be just another cog in a giant machine and I can't stand big company politics.",
    "score": 1425,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1n74jad/finally_got_an_offer_after_a_layoff_as_a_50_year/",
    "created_at": "2025-09-03T03:43:33.000Z",
    "num_comments": 134
  },
  {
    "id": "reddit-1on84au",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "AI won’t make coding obsolete. Coding isn’t the hard part",
    "text": "Long-time lurker here. Closing in on 32 years in the field.\n\nPosting this after seeing the steady stream of AI threads claiming programming will soon be obsolete or effortless. I think those discussions miss the point.\n\nFred Brooks wrote in the 1980s that no single breakthrough will make software development 10x easier (“No Silver Bullet”). Most of the difficulty lies in the problem itself, not in the tools. The hard part is the essential complexity of the requirements, not the accidental complexity of languages, frameworks, or build chains.\n\nCoding is the boring/easy part. Typing is just transcribing decisions into a machine. The real work is upstream: understanding what’s needed, resolving ambiguity, negotiating tradeoffs, and designing coherent systems. By the time you’re writing code, most of the engineering is (or should be) already done.\n\nThat’s the key point often missed when people talk about vibe coding, no-code, low-code, etc.\n\nOnce requirements are fully expressed, their information content is fixed. You can change surface syntax, but you can’t compress semantics without losing meaning. Any further “compression” means either dropping obligations or pushing missing detail back to a human.\n\nSo when people say “AI will let you just describe what you want and it will build it,” they’re ignoring where the real cost sits. Writing code isn’t the cost. Specifying unambiguous behavior is. And AI can guess it as much or as little as we can.\n\nIf vibe coding or other shorthand feels helpful, that’s because we’re still fighting accidental complexity: boilerplate, ceremony, incidental constraints. Those should be optimized away.\n\nBut removing accidental complexity doesn’t touch the essential kind. If the system must satisfy 200 business rules across 15 edge cases and 6 jurisdictions, you still have to specify them, verify them, and live with the interactions. No syntax trick erases that.\n\nStrip away the accidental complexity and the boundaries between coding, low-code, no-code, and vibe coding collapse. They’re all the same activity at different abstraction levels: conveying required behavior to an execution engine. Different skins, same job.\n\nAnd for what it’s worth: anyone who can fully express the requirements and a sound solution is, as far as I’m concerned, a software engineer, whether they do it in C++ or plain English.\n\nTL;DR: The bottleneck is semantic load, not keystrokes. Brooks called it “essential complexity.” Information theory calls it irreducible content. Everything else is tooling noise.",
    "score": 1418,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1on84au/ai_wont_make_coding_obsolete_coding_isnt_the_hard/",
    "created_at": "2025-11-03T10:19:52.000Z",
    "num_comments": 255
  },
  {
    "id": "reddit-1lwk503",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Study: Experienced devs think they are 24% faster with AI, but they're actually ~20% slower",
    "text": "Link: [https://metr.org/blog/2025-07-10-early-2025-ai-experienced-os-dev-study/](https://metr.org/blog/2025-07-10-early-2025-ai-experienced-os-dev-study/)\n\nSome relevant quotes:\n\n&gt;We conduct a randomized controlled trial (RCT) to understand how early-2025 AI tools affect the productivity of experienced open-source developers working on their own repositories. Surprisingly, we find that when developers use AI tools, **they take 19% longer than without—AI makes them slower.** We view this result as a snapshot of early-2025 AI capabilities in one relevant setting; as these systems continue to rapidly evolve, we plan on continuing to use this methodology to help estimate AI acceleration from AI R&amp;D automation \\[1\\].\n\n\n\n&gt;Core Result\n\n&gt;When developers are allowed to use AI tools, they take 19% longer to complete issues—a significant slowdown that goes against developer beliefs and expert forecasts. This gap between perception and reality is striking: **developers expected AI to speed them up by 24%, and even after experiencing the slowdown, they still believed AI had sped them up by 20%.**\n\nIn about 30 minutes the most upvoted comment about this will probably be \"of course, AI suck bad, LLMs are dumb dumb\" but as someone very bullish on LLMs, I think it raises some interesting considerations. The study implies that improved LLM capabilities will make up the gap, but I don't think an LLM that performs better on raw benchmarks fixes the inherent inefficiencies of writing and rewriting prompts, managing context, reviewing code that you didn't write, creating rules, etc.\n\nImagine if you had to spend half a day writing a config file before your linter worked properly. Sounds absurd, yet that's the standard workflow for using LLMs. Feels like no one has figured out how to best use them for creating software, because I don't think the answer is mass code generation.",
    "score": 1398,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1lwk503/study_experienced_devs_think_they_are_24_faster/",
    "created_at": "2025-07-10T18:23:57.000Z",
    "num_comments": 363
  },
  {
    "id": "reddit-1mha63e",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Aren't you tired of being a \"resource\"?",
    "text": "I liked my company — I was employee 600 (engineer ~150) at a place that's now 3000 employees and tens of billions in valuation \n\nI worked hard, they gave me nice promotions, and lots of ownership and equity, and it was great. \n\nBut now that I'm senior enough to manage people (and by that I mean literally a single intern), the vibes are off. My 1-on-1s with anyone in management is now about:\n\n- what projects are we funding this quarter?\n- how are we going to frame our metrics for leadership?\n- does [person a] have bandwidth for this?\n- do you think [person b] is *good*?\n\nI just came here to build stuff... I hate performance reviews, I hate kickoff meetings, I hate \"stakeholders\" and \"leadership\", and I hate defining growth areas for my intern who y'all judge way too much!\n\nThe only stakeholder that should matter is the customer, and when every single one of their zendesk tickets is complaining about the same fucking thing I'm inclined to just fix it!!!! I do not want to have a project doc, and a kickoff meeting, and an assigned PM, and director signoff. Just. let. me. fix. the. thing. \n\nPlease tell me I'm not the only one who feels this way\n\nedit: this post has 500 upvotes and 450 downvotes, so I assume only half of you feel this way 😂😭",
    "score": 1363,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1mha63e/arent_you_tired_of_being_a_resource/",
    "created_at": "2025-08-04T10:52:09.000Z",
    "num_comments": 146
  },
  {
    "id": "reddit-1pi82ib",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "After 7 years at the same org, I’ve started rejecting \"Tech Debt\" tickets that don't have a repayment date.",
    "text": "I've been noticing a pattern over my 7 years at this org (currently Lead System Test), and it's killing our velocity.\n\nWe use \"Technical Debt\" as a catch-all for two very different things.\n\nThere's the **Intentional Debt** (we skipped an abstraction to close a deal), which is fine. That’s a mortgage. We bought the house.\n\nBut then there's the **Toxic Debt**—the accidental complexity, the god objects, and the flaky tests that we just \"retry 3 times\" in the pipeline instead of fixing.\n\nThe issue is that devs treat the toxic stuff like it's a strategic decision. They assume they can pay it down later, but the complexity grows faster than they can fix it. Since I’m the one designing the system tests that have to navigate this mess, I’ve started pushing back.\n\n**My new rule:** If you want to log it as \"Debt,\" it needs a Repayment Date. If you can't give me a date, it’s not debt; it’s a defect, and we prioritize it as such.\n\nDoes anyone else have a hard line for distinguishing between \"we chose speed\" and \"we were sloppy\"?",
    "score": 1353,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1pi82ib/after_7_years_at_the_same_org_ive_started/",
    "created_at": "2025-12-09T13:57:15.000Z",
    "num_comments": 194
  },
  {
    "id": "reddit-1hz6iuu",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Summary of my recent job search and offer - SWE 20+ yoe",
    "text": "There's been a great deal of panic about the job market here and in r/cscareerquestions , so I thought I'd share my experience.\n\nFor a point of reference, I'm an older dev (56), no degree, no FAANG, I got started 24 years ago. Target salary range 160-170k, fully remote.\n\n* Job search began: December 2\n* Applications/Resumes Sent: About 40\n* Number of interviews: 2 (4 with the company that hired me, 1 with another. That was one that had reached out to me).\n* Offer accepted: January 10. (so 1 month of search, but the company that hired me began that process after the first week of searching)\n* I only used LinkedIn. \n* I only applied to jobs for which my skills were an extremely close match. I sometimes made exceptions for opportunities in industries where I have a lot of experience (usually in ecommerce or education). The one that hired me was a combination of both good tech match and vertical experience (ed related)\n* I focused on companies in my NYC area so I could sell the advantage of being able to meet onsite as needed. But I did not hear back from any of those, despite it seeming like a solid strategy.\n* I ignored job listings older than a few days, focusing on brand new listings with fewer than 150 applicants\n* I tailored my resume for each listing by removing tech completely unrelated to the requirements\n* I excluded all but the last 15 years of experience to avoid ageism and dated tech\n* I studied Leetcode problems every day, and made great progress. I was not asked to code on my interviews.\n* I researched the living sh\\*t out of the company's history, mission and products.\n* When it was my turn to ask questions, I always asked my interviewer what they thought would be most challenging for me about the position. By the next phase, I made sure I could demonstrate expertise in that area.\n* I wrote thank you notes to every interviewer",
    "score": 1284,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1hz6iuu/summary_of_my_recent_job_search_and_offer_swe_20/",
    "created_at": "2025-01-11T21:35:58.000Z",
    "num_comments": 305
  },
  {
    "id": "reddit-1nbfh94",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Are daily standups ever actually about unblocking?",
    "text": "Every SWE says: \"Standups aren't status reports, they're for unblocking\". And that's true in theory, that's the textbook. The whole idea in agile is a quick daily sync where people share progress, surface blockers, and get help before issues snowball. It's supposed to be lightweight, team-driven, and focused on collaboration rather than accountability to a manager.\n\n\nBut in the 9 companies I've worked at, standups have always been status reports. Every single one of them. People go around the room listing what they did yesterday and what they'll do today, often phrased more to sound productive than to actually solve problems. Managers (and people who don't contribute to the standup) are always present. Rarely does anyone bring up a blocker, and when they do, it usually gets handled later in chat or a side conversation. The ritual ends up feeling more about reporting up than working together.\n\n\nSo I wonder: has anyone here actually experienced a standup that truly functioned the way agile describes it? Should we redefine the meaning of \"daily standup\" to adequately portray what happens in practice?",
    "score": 1279,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1nbfh94/are_daily_standups_ever_actually_about_unblocking/",
    "created_at": "2025-09-08T05:36:15.000Z",
    "num_comments": 474
  },
  {
    "id": "reddit-1jqp3s3",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I now spend most of my time debugging and fixing LLM code",
    "text": "My company got on Claude a year ago.\n\nI am the one who introduced it to the team and got us a subscription.\n\nIt was great for quickly mocking up UI to feedback from customers. It was great for parsing and interpreting Chinese datasheets for me.\n\nMaybe 6 months ago I started added to massive pull requests from senior engineers. One in particular was a huge refactor submitted by the CTO.\n\nI noticed that every line was preceded by a comment. I noticed that suddenly we were using deprecated methods. Mixing CPP versions. Stuff that didn't make a whole lot of sense.\n\nI tried to push back. I did my job, requested changes, called out where methods seemingly did nothing.\n\nAhh well we're coming up on a deadline so let's just merge it and review in a later sprint.\n\nNow we're seeing subtle regressions creep in. Edge cases not considered. The long tail of AI-generated code, extended by AI is now consuming the majority of my days.\n\nIs this the future of our industry? Just my company? I feel like I'm wasting my life 8 hours per day reviewing and fixing shit LLM code and it's starting to really get to me.",
    "score": 1249,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1jqp3s3/i_now_spend_most_of_my_time_debugging_and_fixing/",
    "created_at": "2025-04-03T17:49:15.000Z",
    "num_comments": 154
  },
  {
    "id": "reddit-1k28hdq",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Mods removing the post about unionization",
    "text": "What an incredibly lame decision. What rule did discussing unionization within our industry break? What do you personally have to lose by tech workers unionizing? \n\nSure, those posts are rife with vehement opposition and support for both sides, but unless you personally gain to lose something by people simply *discussing* unionization, then I see nothing wrong with letting the discussion flow.\n\nOur industry within the US has witnessed mass offshoring and mass layoffs as the norm for entire teams of tech workers the second the profit line stops going up. \n\nWe are stronger when we bargain together.",
    "score": 1239,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1k28hdq/mods_removing_the_post_about_unionization/",
    "created_at": "2025-04-18T16:01:40.000Z",
    "num_comments": 107
  },
  {
    "id": "reddit-1p1v1wr",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I am done posting here, got an offer after 8 month laid off, I am moving on my with my life.",
    "text": "Got an offer after 8 month laid off, thank you for all your help here.\n\nOffer is at Coinbase, YOE 4\n\nBase 179,300  \nBonus: 5% = \\~8,000  \nRSU: 75,000 per year\n\nTC: About 263k\n\nI was hella depressed here that I may not get a job again, but it worked out boys, just keep grinding and a chance will come.\n\nThank you again, and in 2 days I will delete this account, get off reddit, and move now with my life. I love y'all!",
    "score": 1200,
    "url": "https://reddit.com/r/cscareerquestions/comments/1p1v1wr/i_am_done_posting_here_got_an_offer_after_8_month/",
    "created_at": "2025-11-20T05:30:14.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1o643iz",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I am blissfully using AI to do absolutely nothing useful",
    "text": "My company started tracking AI usage per engineer. Probably to figure out which ones are the most popular and most frequently used. But with all this “adopt AI or get fired” talk in the industry I’m not taking any chances. So I just started asking my bots to do random things I don’t even care about.\n\nThe other day I told Claude to examine random directories to “find bugs” or answer questions I already knew the answer to. This morning I told it to make a diagram outlining the exact flow of one of our APIs, at which point it just drew a box around each function and helper method and connected them with arrows. \n\nI’m fine with AI and I do use it randomly to help me with certain things. But I have no reason to use a lot of these tools on a daily or even weekly basis. But hey, if they want me to spend their money that bad, why argue. \n\nI hope they put together a dollars spent on AI per person tracker later. At least that’d be more fun",
    "score": 1198,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1o643iz/i_am_blissfully_using_ai_to_do_absolutely_nothing/",
    "created_at": "2025-10-14T02:51:18.000Z",
    "num_comments": 301
  },
  {
    "id": "reddit-1m78mov",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Big Tech reality in U.S is just unbeliaveble.",
    "text": "I just came across a post of a junior developer with 2 YOE with a $220,000 TC at Google. He got offered a $330,000+ TC at Meta. I have so many questions...\n\nI live in South America and while some things are similar compared to U.S, I've never seen in my life someone with 2 YOE doing the equivalent of $18,000 a month. That’s the kind of salary you might earn at the end of your career *if* you're extremely skilled.\n\nIs that the average TC for developers with 2 YOE or this is just at FAANGs?\n\nHow hard it is to get this kind of job in U.S? We know the market is terrible right now (and not only in U.S) but when I see this kind of posts, I question whether that's true. The market is terrible or the market is terrible for new-grads?\n\nFor context: we have FAANGs here too, but you would never make that amount of money with 2 YOE and the salary is way lower than $18,000 per month for absolutely any kind of developer role.\n\nEdit: unbeliavable\\*. Thanks for all replies!",
    "score": 1159,
    "url": "https://reddit.com/r/cscareerquestions/comments/1m78mov/big_tech_reality_in_us_is_just_unbeliaveble/",
    "created_at": "2025-07-23T13:00:51.000Z",
    "num_comments": 451
  },
  {
    "id": "reddit-1l5apme",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Got an offer from Meta - here are my tips",
    "text": "Landed a job at Meta earlier this year (got lucky with timing before the Feb 10 layoffs lol).\n\n**Job summary:**\n```\nPosition: Mid-Level Software Engineer L4\nTC: $350k (193 base, 29 bonus, 128 stock/year)\nYOE: 2.5 years\n```\n\n**The interview process:**\n* Phone screen: 2 leetcode problems in 45 mins\n* Final: 2 leetcode rounds (same format as phone screen) + 1 behavioral round + 1 system design round\n* Total Time: 5 hours\n\nFrom initial contact to offer signing took 2 months.\n\n**The framework that worked:**\n\nWith 2 problems in 45 minutes, you really only get 22 minutes per problem. Here is how I would break it down.\n\n1. **Understand the problem first (3 mins)** \\- restate it back, walk through examples, ask about constraints.\n2. **Don't code immediately (5 mins)** \\- discuss approaches starting with brute force, explain why it's bad, then work up to optimal solution. DO NOT IMPLEMENT THE BRUTE FORCE SOLUTION. You don't have time for that.\n3. **Get buy-in (10 mins)** \\- make sure interviewer agrees with your approach before coding. I write pseudocode comments first as an outline, then flesh it out. A common failure pattern is coding something that the interviewer doesn't understand.\n4. **Wrap up (2 mins)** \\- explain time/space complexity, offer to write tests for edge cases, or move on to the next problem.\n\n**How I prepared:**\n\n* Use Blind 75. It has good coverage over all problems.\n* I DID NOT buy leetcode premium. If you study and understand the patterns, it doesn't matter what problem you get.\n\nI know the market is ass right now and the competition is rough, but stay disciplined and the hard work will pay off! I was looking for a job for 9 months until I got this opportunity lmao. Ask me anything!\n\n**Soft Plug:**\n\nBuilding a [website](https://chenaaron3.github.io/drawcode/) to visualize code! Mainly targeted towards beginners.",
    "score": 1145,
    "url": "https://reddit.com/r/cscareerquestions/comments/1l5apme/got_an_offer_from_meta_here_are_my_tips/",
    "created_at": "2025-06-07T02:56:59.000Z",
    "num_comments": 286
  },
  {
    "id": "reddit-1kr8clp",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "AI Slop PR's are burning me and my team out hard, anyone else experiencing this?",
    "text": "Background: Current role is a TL (dev/manager hybrid at this place), my team has a large amount of domain ownership so we are constantly pinged for PR reviews.\n\nLately there has been a huge push for teams to adopt tools like Cursor, the problem is that while yes they can generate code, it is just lately rapidly becoming an endless stream of AI slop.\n\nIn the last few weeks:\n\n* Multiple 5k+ line PR's that should be sub 100 lines\n* PR's that have tons of changed files that in some vibe coding iteration were dropped or my new favourite thing endless redirection where multiple things don't actually do anything.\n* Very scary PR's where the AI did something extremely dangerous i am assuming to make tests work or something. For example one of the PR's actually did such a very subtle change where it aborted early in a middleware basically skipping most of AuthZ, then mocked out a good chunk of the AuthZ in tests which caused tests to pass. \n* AI hallucinating external services, then mocking out the hallucinated external services. Forcing me to go look up other repos/service maps and validate that yes this api endpoint actually exists. \n* AI's ignoring project architecture and structure, dumping files everywhere, or ignoring coding styles. \n\nThe problem is that these PR's are becoming exhausting as they keep touching on my teams domain, so we are required to review and approve them. Pretty much nobody wants to talk about this, nobody wants to discuss this fact. Today a junior came and dropped a 10k PR that is just all over the place, i just rejected it, pretty saying \"this issue does not need 10k LoC changed, and i am not going through this.\" \n\nHowever instead of well addressing the issues of lack of critical thinking or just copy and pasting a story in, instead i am getting push back for being too strict. My entire team has been complaining about this, on average my team of 6 is getting around 30 PR's a day from various teams now.\n\n*EDIT* To clarify a few things:\n\n* I have told them my issues in detail with other managers this specifically affects my team and a few others who are not discrete feature specific teams as our domain is much larger. Most don't care since it doesn't actually affect them and they specifically care about increasing their own velocity. Our bosses do not care and just want us to go faster.\n* We have several large monolith java applications, these code bases are not pretty but do have a decent test suite. Cursor specifically has huge issues with some of these project's structure where it will often just stuff into the first folder with a matching name it seems to find. \n* We do have code rules however they are nowhere near as well documented and enforced.",
    "score": 1143,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1kr8clp/ai_slop_prs_are_burning_me_and_my_team_out_hard/",
    "created_at": "2025-05-20T15:53:15.000Z",
    "num_comments": 371
  },
  {
    "id": "reddit-1nt1n2s",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Am I the only one on here who feels like shit will get done when it gets done, and that stressing about it will only make things worse?",
    "text": "Context: I was just reading through [this post](https://www.reddit.com/r/ExperiencedDevs/comments/1nsmx8g/missed_deadline_on_unfamiliar_tech_how_bad_is_this/) written by a redditor who's been working on a particular task at their job for over a month, a task which was \"supposed\" to take 1.5 weeks, and everyone in the top comment was dogpiling on her and downvoting her, saying she's broken her manager's trust, etc.\n\nFirst of all, Jesus you people, I thought this sub was supposed to be on the workers' side, or at least, helping to support one another. Secondly, I just left a job that had this exact kind of mentality and team dynamic and let me tell you, it is not fun, it is not sustainable, and I don't think I was any more productive at that job than I was at previous jobs where they gave me:\n\n* well-defined tasks,\n* ownership over the solution,\n* freedom to make my own technical decisions, and finally\n* the time and space to figure it out for myself, and to just \"let me know when it's finished\"\n\nTHAT'S trust. Not this bullshit about consistent delivery. Not every technical problem CAN HAVE \"consistent delivery\". Anyone who's working in this field knows that some problems involve bashing your head against the wall for 8 days until you suddenly have a eureka moment, and then the solution comes together in 40 minutes. That's life. And if you think that in this hypothetical situation, the employee \"wasn't adding value\" during those 8 days, then allow me to share with you the stonecutters credo:\n\n&gt;When nothing seems to help, I go and look at a stonecutter hammering away at his rock perhaps a hundred times without as much as a crack showing in it. Yet at the hundred and first blow it will split in two, and I know it was not that blow that did it, but all that had gone before.\n\nAlso, for the record, fuck poker planning, and fuck the concept of \"supposed to take X long\". If you give me a task, I'll tell you how long I think it'll take ME to do it, and you bet your ass I'll complete it as fast as I possibly can, and if I'm stuck, I'll ask people for help. Oh, you say some other colleague can do it in half the time? Great, then give the task to him, and let's just keep adding onto all of the tribal knowledge that only lives in that guy's head, and keep jacking up the bus factor of our team. Oh, what's that, he's swamped and can't take on the extra work? Ok, so I guess you're stuck with me then; the guy whose skills you apparently deemed good enough during my 7 interview rounds for this job. I will do the best possible job I can for you, but I'm not that other guy. I am me, and I am always learning, always improving, and if you give me time &amp; space to develop a deep understanding of the codebase, our architecture, our team processes, etc., I'm positive that I will soon grow to a place where I can complete tasks like this in 1.5 weeks!\n\nShit will get done when it gets done, and it won't go any faster with a manger constantly harassing the employee about delays and \"consistent delivery\". In fact, it will probably just make things worse, because now instead of having a calm, clear mind devoted to solving the technical problem at hand, the employee is wasting precious cycles locked in fear-based thinking, increased cortisol levels, and reduced blood flow to the brain.",
    "score": 1094,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1nt1n2s/am_i_the_only_one_on_here_who_feels_like_shit/",
    "created_at": "2025-09-28T22:29:18.000Z",
    "num_comments": 205
  },
  {
    "id": "reddit-1m7zo73",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Has anyone actually seen a real-world, production-grade product built almost entirely (90–100%) by AI agents — no humans coding or testing?",
    "text": "Our CTO is now convinced we should replace our entire dev and QA team (~100 people) with AI agents. Inspired by SoftBank’s “thousand-agent per employee” vision and hyped tools like Devin, AutoDev, etc. \nFirstly he will terminate contract with all outsource vendor, who is providing us most dev/tests\nWhat he said us\"Why pay salaries when agents can build, test, deploy, and learn faster?”\n\nThis isn’t some struggling startup — we’ve shipped real products, we have clients, revenue, and complex requirements.\nIf you’ve seen success stories — or trainwrecks — please share. I need ammo before we fire ourselves.\n----Update----\nAfter getting feedback from businesses units on the delay of urgent developments, my CTO seem to be stepback since he allow we hire outstaffs again with a limited tool.\nThat was a nightmare for biz.",
    "score": 894,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1m7zo73/has_anyone_actually_seen_a_realworld/",
    "created_at": "2025-07-24T09:20:38.000Z",
    "num_comments": 663
  },
  {
    "id": "reddit-1ki0i60",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "I'm so tired",
    "text": "Lately, I’ve been coming to terms with the fact that I’m not a great developer.\n\nI’m solid at tracking down problems and fixing them - debugging is actually fun for me. Stepping through code and unraveling bugs feels like solving a puzzle.\n\nBut when it comes to greenfield projects or building new features, it’s a slog. I’m starting to question whether I even want to keep doing this - between the rough job market and needing a decent salary, I feel stuck.\n\nWhat kind of work can a moderately competent problem-solver with decent scripting skills do to earn a living - without spending all day cranking out mediocre code?\n\nI’d love to start something of my own. Finding a real problem, building a solution that helps people, and having them actually want to pay for it - that’s the dream.\n\nedit:\nI just wanted to say thank you to everyone who commented. I really appreciate how kind everyone has been - it's encouraging.\n\nI've received some good advice and plan to explore a couple of different options. I recognize that I'm massively burnt out. I'd love to quit my job and disappear for a while, but that's not a realistic option at this stage in my life. I'm going to make a concerted effort to start taking better care of myself - and hopefully, I can rediscover a modicum of the passion I used to have for this profession.\n",
    "score": 850,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1ki0i60/im_so_tired/",
    "created_at": "2025-05-08T20:34:54.000Z",
    "num_comments": 162
  },
  {
    "id": "reddit-1i3vhze",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Why don’t engineers have unions?",
    "text": "I know historically our jobs have been very lucrative and our working conditions have been pretty good especially the last 10 years or so. However, given the recent turn with how companies are treating engineers now (mass layoffs, offshoring, low ball offers, forcing quitting with in-office policies, etc) im not sure why we dont have unions. I’ve heard of practices from companies that post fake jobs with a posted salary to see how many people apply. Then they repost the same listing with a lower salary to see if people still apply. Rinse and repeat to get an idea of how low they can get offers. \n\nNow you can say these practices are all fair game for companies. Sure. But on our end as engineers/workers so is unionizing. ",
    "score": 812,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1i3vhze/why_dont_engineers_have_unions/",
    "created_at": "2025-01-18T00:45:03.000Z",
    "num_comments": 644
  },
  {
    "id": "reddit-1mix5a4",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Anyone get schadenfreude seeing your old job struggle to hire your position?",
    "text": "Left my old role nearly 2 months ago and they of course had my position posted within days of me leaving. It only stayed up a few days.\n\nI just saw the position pop up again. Having been on their side before, I’m almost certain they couldn’t find anyone decent and decided to repost it.\n\nTheir problem: they are basically looking for a tech lead at a low end senior salary. I was doing tech lead work because I’d been pushing for that position. But despite being told I’d be getting the title and salary bump, they ended up saying they’d only be able to give me the title but no bump. And that’s how I ended up leaving.\n\nAnyways, I find it amusing that they are struggling to hire for their unrealistic expectations.",
    "score": 668,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1mix5a4/anyone_get_schadenfreude_seeing_your_old_job/",
    "created_at": "2025-08-06T06:21:55.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1m9n8ew",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Got Laid Off 12 Days Ago and Signed an Offer Today - Here's My Sankey Diagram",
    "text": "*tl;dr: Title,* [Diagram Here](https://imgur.com/a/5THOIEU)*. 5 YoE, no FAANGs. I have a B.S. in CS + Bio from Berkeley. Primarily Healthcare SWE experience. Job market is not that bad for Senior SWEs. TC &gt;$100k + Fully Remote. I'm a US Citizen.*\n\nI always see the doom and gloom from this sub regarding layoffs and the struggles of people finding a job and wanted to add a counter-story. I got laid off from my job on July 14th. It was an absolute gut punch and all of my worst fears came true. I saw all the posts from people with years of experience struggle with finding a job and thought I was absolutely screwed going into the market. Thankfully, either I have a really good skill set or people are being overly pessimistic (though it is most likely a combination of both.)\n\nI do think that there is still merit to the doom and gloom though. When looking for a job, there were barely any new grad, entry level, or junior level job postings. Most of the jobs that I saw started at senior and made their way up but it seems that the market for mid and senior level roles is still relatively healthy. Almost every position that I interviewed for was hybrid, with a good chunk being 5 days a week in person. A very small minority were fully remote.\n\nAs for how I went about that job search, the day I got laid off I got an invite to a \"Mandatory Meeting\" with my boss + some random person that I didn't know at exactly 9AM. I knew then it was over and immediately started polishing my resume and applying to every company that I could think of. I went directly to the career page and found jobs that I thought that I was qualified for. I may have applied to every company that I can think of, but I only applied to roles that matched my skillset. Every single job that I applied to was either directly on the company page or LinkedIn jobs sorted by last 24 hours.\n\nI did NOT use any AI - this includes auto-apply software or even tuning my resume. Everything was done by hand, manually by me. The only \"automation\" that I did was sign up for a [greenhouse.io](http://greenhouse.io) account so that my name, email, and other info was autofilled by them.\n\nThe first 48 hours was the hardest because it was just sending applications into the void without knowing if it would yield anything. Then starting Wednesday that same week, I started getting interview requests and stopped applying to new jobs. I did not ask my network for any references as I was not desperate yet.\n\nFor context, I am in the San Francisco Bay Area and work in the biotech industry (and if you're on r/biotech, biotech is equally screwed as tech, if not more.) The job I got is in the healthcare field but unrelated to the job I previously had. TC is a nice bump up from my previous position but I will not share it since people in real life know what my Reddit handle is (but I can say that it is more than $100,000 but less than $1,000,000.) I have 5 years of experience as a Software Engineer in various healthcare companies ranging from small startups to large companies with both a CS and biology degree from UC Berkeley.\n\nOf course, this is just one data point. YMMV\n\nTo those still hunting, good luck.",
    "score": 532,
    "url": "https://reddit.com/r/cscareerquestions/comments/1m9n8ew/got_laid_off_12_days_ago_and_signed_an_offer/",
    "created_at": "2025-07-26T07:24:27.000Z",
    "num_comments": 108
  },
  {
    "id": "reddit-1pq2cb6",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Levels FYI 2025 report is out",
    "text": "https://www.levels.fyi/2025/\n\nObviously this leans more towards big tech but TC is still increasing. Sorry Doomers! Other interesting things were that senior/principal pay increased much more than junior/mid level. US and India market both had TC increases while Canada and Europe got screwed.",
    "score": 524,
    "url": "https://reddit.com/r/cscareerquestions/comments/1pq2cb6/levels_fyi_2025_report_is_out/",
    "created_at": "2025-12-18T21:11:11.000Z",
    "num_comments": 175
  },
  {
    "id": "reddit-1n2v5rt",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "SF Bay Area - The job market is cooked",
    "text": "Lately, I’ve been wanting to vent about how rough my interviews have been. I’m still employed, but actively looking for a new opportunity where I can learn and grow. Recently, I spoke with a recruiter about a senior-level role. They asked what total compensation (TC) would make me consider leaving my current position. I gave them my exact number, and they immediately said it was fine—they wanted to fast-track me through the hiring process.\n\nI had a conversation with the hiring manager, and it ended with him outlining the next step: a CoderPad interview. So I assumed my intro landed well.\n\nBut the next day, I checked their careers page and saw the same role reposted—this time with a noticeably lower salary range. That gave me a bad feeling. Sure enough, I woke up this morning to an email saying they’ve decided to pass on me.\n\nAlso worth noting: most company I’ve spoken to so far has explicitly told me they don’t ask Leetcode-style questions. And they’ve all said the final stage would be an onsite.",
    "score": 523,
    "url": "https://reddit.com/r/cscareerquestions/comments/1n2v5rt/sf_bay_area_the_job_market_is_cooked/",
    "created_at": "2025-08-29T02:08:34.000Z",
    "num_comments": 132
  },
  {
    "id": "reddit-1ixjjhr",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Laid off, got an offer, rescinded, couple months later, 3 offers, which one would ya take?",
    "text": "Got laid off from my job, then got an offer, but was rescinded. Was living off unemployment, but now have 3 offers.\n\nWhich one would ya take? Any advice from people would be helpful. \n\n\nDatadog: NYC\n- 265k TC \n- 15k sign on \n- 280k total TC\n\nCoinbase: NYC (remote) \n- 260k TC\n- 25k sign on \n- 285k total TC  \n\nMeta: NYC \n- 280k TC \n- 35k sign on \n- 315k total TC \n\nI have 3 YOE and used all 3 offers to negotiate higher and higher on all, I think I got very lucky and this top band or would like to think. \n",
    "score": 495,
    "url": "https://reddit.com/r/cscareerquestions/comments/1ixjjhr/laid_off_got_an_offer_rescinded_couple_months/",
    "created_at": "2025-02-25T01:54:03.000Z",
    "num_comments": 211
  },
  {
    "id": "reddit-1m6sm84",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Stay at Google or jump to n+1 at Meta?",
    "text": "Im currently a junior swe at Google with 2 yoe. Current recurring TC is ~220. \n\nI have a swe-2 offer from Meta for around 340k, 370 if counting signing bonus.\n\nI know this seems like a braindead question, but considering that I currently only work around 30 hours a week and have a great manager, is the higher comp worth the risk? The new team is not in ads or monetization, so wlb shouldn’t be completely horrible, but the engineer I talked to on the team told me to expect working around 45-50 hours a week.",
    "score": 409,
    "url": "https://reddit.com/r/cscareerquestions/comments/1m6sm84/stay_at_google_or_jump_to_n1_at_meta/",
    "created_at": "2025-07-22T22:45:30.000Z",
    "num_comments": 201
  },
  {
    "id": "reddit-1ipt66n",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "It is possible to remain an IC into old age?",
    "text": "I'm probably older than most people here - I'm 40. I'm a staff level engineer at a mediocre company. I am making out okay. 200k tc in lcol geo\n\nWhen I look at the long term trajectory for my career - I am honestly not sure if it is possible to stay gainfully employed as an individual contributor into my late 50s and up until retirement age of 65.   I see very few to no people of that age still working as engineers.  It seems borderline impossible to keep up with the rapidly changing skillsets required for software development as you get into late ages and your brain slows down.  (I think my brain is already slowing down)\n\nI do see many managers  and directors in that age range. But few to no ICs. \n\nI'm trying to figure out if it is necessary for me to transition into management or some other aspect of technology to sustain the next stages of my career.",
    "score": 401,
    "url": "https://reddit.com/r/cscareerquestions/comments/1ipt66n/it_is_possible_to_remain_an_ic_into_old_age/",
    "created_at": "2025-02-15T04:01:38.000Z",
    "num_comments": 236
  },
  {
    "id": "reddit-1khdirh",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "What to do about a dead weight on the team?",
    "text": "We were hired about the same time; she was hired as a Senior with 7 YOE from household F500 companies with an impressive resume. We were originally on different projects, but  6 months after hiring, we were brought to the same team, under another developer for a project that is due this month. \n\nSince then, her only contribution has been to run stand-ups; basically scheduling weekly meetings and asking people what they do in the meetings. Worse still, she regularly misses those stand-ups, locking people out of meetings, and only to comes up with pathetic excuses like \"plumber at my door\" or \"sorry I lost track of time\" (she is fully WFH). Her technical expertise is a puddle, even for things she supposedly has years of experience in. For instance, not knowing how to use modern python dependencies manager (poetry/pdm/uv), or not being able to use Typescript for frontend development. Her PR reviews are outright atrocious: she commented that we shouldn't be committing .gitignore. I can't even say a positive thing about her work ethic either. She would take several weeks to fix a simple PR and generally do everything to avoid having to work. Image files too large to put on cloud? It's a blockage for this week. Upsampling the image to make it smaller? Nah she will just try again till the connection times out and report as a problem... \n\nWhen she was hired, she was supposed to be the most senior and our team lead. When the lead for our project resigned, I became the team lead since she was \"not familiar with our code\" enough, despite the project being developed from the ground up, when she and I joined the team. I assigned her a ticket in January, which is a simple \"serialise the data to a suitable format\" involving calling the equivalence of \\`df.to\\_csv\\`. That ticket has yet to be completed. \n\nAt first, I was not too unhappy, coming from a shittier workplace with a much worse pay. However, now that the deadline for the project is approaching, I am feeling much jaded from the whole experience. Basically 99% of the contribution comes from me: code design, implementation, CI/CD, testing, documentation, deployment. Her employment has been near 18 months and she has not written more than 100 lines of code. She is also fully WFH with at least 20% higher salary.\n\nShould I oust her to our director, or should I just look  for another job?",
    "score": 399,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1khdirh/what_to_do_about_a_dead_weight_on_the_team/",
    "created_at": "2025-05-08T00:51:43.000Z",
    "num_comments": 193
  },
  {
    "id": "reddit-1o9imyz",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Escaping Legacy Tech: Landed 2 AI Offers After 8 Months of Prep (250k+ TC)",
    "text": "For the past 9 years, I’ve been stuck in legacy tech. I built niche monolithic apps with no exposure to distributed systems or system design. Time flew by, and I got pigeonholed in outdated “dinosaur” companies.\n\nTrying to leave my job was incredibly demoralizing. Thousands of job applications and a painfully low callback rate. I was discouraged by this and even more, by my background and lack of modern systems experience. I really felt like I was stuck at a dead end. \n\nI posted here asking how long it takes to prep for system design interviews from 0.  Many replies were disheartening, like “you need real on-the-job experience.” But it turns out…you don’t—at least not to pass interviews. \n\nHere’s what I did while working full-time:\n\nLeetCode (6 months): Focused on the top 150 problems, revisiting and practicing each one 4-5 times. (I failed many, many interviews along the way).\n\nSystem Design (1.5 months): Started from almost zero and crammed, studying about 15 systems deeply, mainly through videos and practice.\n\nApplications: Sent out over a thousand applications with very low callback. Landed interviews mostly through headhunters. \n\nInterviews (6 months): Juggled my full-time job while going through processes with 45 companies (failing most of them early on).\n\nIt was brutal: endless rejections, self-doubt, and burnout. But I just landed 2 solid offers in AI (around 250k+ TC).\n\nIf you’re in a similar rut, know that it is absolutely doable with consistent effort. You can break free even without the “right” background. AMA if you have questions!",
    "score": 374,
    "url": "https://reddit.com/r/cscareerquestions/comments/1o9imyz/escaping_legacy_tech_landed_2_ai_offers_after_8/",
    "created_at": "2025-10-18T01:09:36.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1oe2h0h",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "4-Day work week trial period. Is this industry standard?",
    "text": "Hi Devs, \n\nSo I work a a large tech company probably biggest in my country . They recently announced a volunteer trial 4-day work week program. However the details of it seem bizarre to me and I am wonder if this is how other places have implemented the policy too. \n\nSo the basis is 4 days a week any monday thursday or friday can be taken off. The expectation is you'll work 32 hrs a week, but be as productive with the expectation that you will also become more productive (which makes sense, this is the whole point of these programs) However, you will lose also 20% of your salary and time off accrual for sick, vacation and personal days. The trial is 1 year so once you start youre also stuck for the year.\n\nSo to me this seems like they want more work done in less time for less pay??? \n\nAm I crazy or does this not defeat the entire purpose of implementing this policy? Its supposed to provide better balance and mental health, but this seem so counterinitiative. \n\n  \nWould love to hear from other devs who have had a chance in a 4-day work week environment, how did your org implement it? Did it stay? Did it work for you?",
    "score": 366,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1oe2h0h/4day_work_week_trial_period_is_this_industry/",
    "created_at": "2025-10-23T12:53:05.000Z",
    "num_comments": 178
  },
  {
    "id": "reddit-1lio5hs",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Stay at Google vs Meta NYC",
    "text": "Currently L4 at G with ~3 YOE 300k TC. Got an offer at Meta NYC:\n\nBase: 193k\nRsu: 450k\nBonus: 29k\nTC: 335k + 35k signing\n\nI really want to go to NYC but wondering if I should just stay at G and look to internally transfer instead. Reading a lot of the negative discussion around Meta is giving me cold feet especially since the TC increase is minimal. The team at Meta more aligns with my interests and where I want to take my career in the future though.\n\nPlus, my org at google is currently offering voluntary layoffs, so I could potentially take that and get a nice severance before moving to Meta. That plus the free relocation offered by Meta makes this move financially more appealing.",
    "score": 363,
    "url": "https://reddit.com/r/cscareerquestions/comments/1lio5hs/stay_at_google_vs_meta_nyc/",
    "created_at": "2025-06-23T18:20:37.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1ljo8op",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Anyone else just content with where they are?",
    "text": "I’ve been developing software professionally for 20 years. I’ve done startups, retail, small companies, large companies, the whole spread. I’ve been with the same company for about 5 years and am currently a Lead. The job pays well (Midwest salary), the benefits are insanely good, work-life balance is great, I get a dependable bonus, and love working with the team on modernizing a decades-old monolith to browser-based tech. It’s a great mix of architecture-esque planning work, interactions with business, and coding.\n\nFor years I’ve had managers trying to push me into management. I’m not wholly against this except for the fact that nearly every company I’ve worked for has turned management over every few years. Being on the delivery side at least has the illusion of stability. Since I had a kid almost 7 years ago stability has taken on elevated importance. Can’t hop around startups any more.\n\nAll that said, I just like where I’m at. I like still having a foot in the weeds and problem solving. Keeps me sharp. It feels like IT is always in this state of wanting more. Anyone else content and just wanting everyone else to chill sometimes?",
    "score": 360,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1ljo8op/anyone_else_just_content_with_where_they_are/",
    "created_at": "2025-06-24T21:55:46.000Z",
    "num_comments": 104
  },
  {
    "id": "reddit-1oy3pl1",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Senior HFT/Quant Trading Engineer with 10+ YoE: Job Search Experience and Sankey in Late 2025",
    "text": "Sankey: https://i.imgur.com/0zOk1wv.png\n\nWanted to add a data point of my experience applying in late 2025 as a Senior with a well-defined domain expertise in quantitative and low latency trading. I was laid off ~1.5 months ago from my previous firm and worked with a specialized headhunter who focuses on placing prop trading SW and FPGA engineers. I didn't personally submit any applications—everything was handled by my HH. We applied to eight firms/quant funds in a targeted fashion. My HH's relationship with certain firms allowed me to bypass a few bureaucratic HR stages and get in front of hiring managers immediately.\n\nThis was my first time on the market as a Senior and my interview experience mostly aligned with how I chose to prepare. The mix of questions I encountered was roughly 9:1 domain-specific C++ to LeetCode-style DSA. There were a bunch of questions on deep C++ features, trading-specific minutiae (exchange protocols, executing a low latency strategy on a particular exchange), lock-free algo knowledge, etc. Ironically, the rounds that tripped me up the most _were_ LeetCode-style questions, so I regret not doing more than the 10-15 questions I practiced but overall my preparation was accurate.\n\nI withdrew from the interview process at three firms since I received a solid offer from a firm I liked (on a desk/team I liked as well). I anticipate I would've gotten another 1-2 offers had I seen those through to the end but I was satisfied.\n\n* Timeline from start of search to offer: 1 month\n* TC: ~$500K\n* Location: Chicago\n* Preparation: 10-15 LeetCode questions and implementing dozens of lock-free/high-performance data structures in C++. Reading a few intermediate to advanced C++ books to refresh (think Nicolai Josuttis, et al.). Playing around with some language features in the newer standards (C++23/26).",
    "score": 355,
    "url": "https://reddit.com/r/cscareerquestions/comments/1oy3pl1/senior_hftquant_trading_engineer_with_10_yoe_job/",
    "created_at": "2025-11-15T21:39:41.000Z",
    "num_comments": 136
  },
  {
    "id": "reddit-1l3g1im",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "There is something broken in the hiring process.",
    "text": "We had a Senior SWE req open for a few weeks through a third party hiring agency (not my choice, I don't like hiring agencies) and the best we could find was some guy at the end of his career with a spotty employment history (lots of employment gaps, lots of short stays) over the past decade. We got tons of AI generated and fake applicants. We are just looking for a generalist C/Python/Go/Microservices role and are willing to teach people on the job as long as they have good problem solving / debugging skills. We are also in what I'd consider a desirable sector (Cybersecurity).\n\nThe problem is that we've consistently had hiring related issues, and basically all hires since I've started have ended up being bombs to the point where we've had to hire foreign contractors to fill positions. This has been over 5+ years of me working at my current company.\n\nWith the amount of people complaining that they cannot find jobs, especially new grads, why are we having such challenges finding hires? We provide a competitive base salary (near the bottom of our region's range but still competitive), benefits (standard benefits package) and competitive TC which is driven entirely by RSUs. On top of this we are 100% Remote with anything in office being handled by 5 people who live local (includes myself). We are posting to LinkedIn and have a strong LinkedIn presence. The job postings are posted by our company and not the hiring agency. The listing passes my filter for \"I'd apply for this\".\n\nThe only thing I can think of is that we are not \"Big Tech\". I work at a small company (&lt;50 employees). Is this hurting access to the job pool? Are our recruiters being too restrictive in filtering? Are AI-driven applicants stealing spots non-AI driven applicants would be normally populating?\n\nDo you have any experience with this? It's driving me insane.",
    "score": 329,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1l3g1im/there_is_something_broken_in_the_hiring_process/",
    "created_at": "2025-06-04T20:23:13.000Z",
    "num_comments": 267
  },
  {
    "id": "reddit-1orfucw",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Mid Level Engineer's Job Hunt Experience",
    "text": "After all the doom and gloom of the market I wanted to post my experience. Especially since I am younger in my career (4 years) in comparison to many here who are job hunting. I recently went through the whole shebang and wanted to shed some light for those who are definitely not a junior but may not be a senior yet.\n\nTLDR: I started searching in late July. Sent out about \\~80 applications until mid August which is when the interviews started to kick in. Out of those 80 I had 5 callbacks (i.e. actual chances to interview). I went through the interview process with 4 out of 5 companies and received 4 offers. The offer I accepted was a significant pay increase both base salary wise and especially total compensation.\n\nOkay so the details\n\n**Why'd I start searching?**\n\nI started searching because I reached a tipping point in frustration at my previous role mainly due to my apathetic coworkers, blame-oriented management, and because of where I am in life outside of work. What I mean by that last part, is that I am young and have no big responsibilities, which allows me to take the risk of making a large jump in my career and even going somewhere to \"grind\". I also recognized that I was starting to stagnate in most facets of an engineering career such as pay, technical expertise, and breadth of knowledge. \n\nI very clearly defined what I **needed** and **wanted** in my next job, those being:\n\n* **needed** to be in a different industry\n* **needed** to make at least the same total compensation\n* **needed** the new team to pass the \"vibe check\"\n* **needed** the job to not be through a contracting agency\n* **wanted** to have a different tech stack\n* **wanted** to be in the same city I was or a specific other city\n* **wanted** to be closer to hardware instead of pure software\n* **wanted** to make more than current total compensation\n\nNOTE: *One thing that is not a* ***need*** *or* ***want*** *for me here that is different than many other people is WLB. This just isn't super important to me at this point in my life and I am hungry to grow.*\n\n**How did I apply?**\n\nWith this and an updated resume I set off on my job hunt. I won't go too into details about my resume simply because I don't have an anonymized version. I don't really think my resume was the biggest differentiator here. However, it was parse-able for ATS systems and contained a ton of \"key word\" technologies like Kafka, AWS, React, Springboot, Kubernetes, etc.\n\nI had a pretty simple routine. I'd go grab a coffee and some breakfast in the wait room or a private area. Then I'd spend the first \\~45min-1hr of every work day applying or preparing/studying. Leetcode and practicing my behaviorals was how I studied in the beginning but once I was comfortable with any easy level problems I kind of just stopped leetcoding. IMO, there's heavy diminishing returns with leetcode very quickly. For applying, I first created a list of companies I was fairly confident hit my **needs** and **wants** and scoured their careers pages. After that, it was just straight LinkedIn jobs. Of the 4 interviews I went through 3 of them came from Linkedin and 1 came from direct careers page. As far as applying I sought after anything that hit my **needs** that was recently posted (last week?). I very quickly ran out of recently posted jobs that hit my needs which is when I set my goal of 5 applications every workday. So like the first 30 minutes of this routine would be applying, then the latter half would be searching for postings for the next day. Near the end of my 80 applications I was really struggling to find jobs that were worth applying to and called it quits, then I started getting interviews.\n\n**Interviewing**\n\nOut of the 80 applications I got 5 different companies wanting to interview which really surprised me after hearing how bad the market was. I really think this came down my tech stack, my location, my willingness to go in office, the fact I am \"cheap\" to hire compared to seniors, my pickiness of where I applied, and just dumb luck.\n\nThe 1 company I declined to interview with was simple, they didn't meet by **need** to make at least the same total compensation. I also already had other interviews lined up and did not have the bandwidth to prepare for another even if I was just gonna use it as practice.\n\nSo for the 4 I had I started studying fairly hard. Some light leetcode, working on THREE different personal projects, behavioral, and company research. Once I finished my first interview and bombed my first ever system design portion that was then added on as well. Out of this preparation I think studying the companies and really honing in on my behavioral helped the most. There's a base level of competency expected via leetcode or other technical interviews, but once that is met I think these matter so so so much more. Studying the companies really helped me prepare for what the interview was going to be like and if there was specific tech or problems they'll bring up give me foresight.\n\nThis is also where there was the most turmoil.. Companies either got the process over with immediately and wanted an answer with 1-2 days OR they would flip flop around on scheduling because of various issues. For 2 of the companies the jobs either got filled half-way through the process OR the job went away completely due to budget cuts or restructuring. While, in my instance, both of these companies came back with other opportunities it really scared the shit out of me and I could see how unstable the market was. \n\nAll interviews had at least these portions:\n\n1. HR screening\n2. Technical test (leetcode, practical, something else)\n3. Behavioral test\n\nDuring this time is also when I'd conduct my \"vibe checks\" of the teams. Like is often said this is your opportunity to interview them as they are doing to you. 2/4 of the companies failed the vibe checks hard. You could just tell I'd be walking into an impersonal dumpster fire. If I did not have a chance to interview with the direct team I'd be working with, I flat out wouldn't work there regardless. That's too big a risk in my eyes.\n\n**Accepting offer**\n\nI'll just quickly lay out the companies:\n\n* Company A - Big company in different industry, same enterprisey tech stack, fair total comp, lowest base pay, vibe check was utterly failed\n* Company B- Direct competitor to my current company in big banking, same enterprisey tech stack, high total comp, highest base pay, vibe check was off\n* Company C - Startup vibe of company but matured (10+ yrs old), different industry and tech stack, total comp was the lowest of all but the base pay was nice, vibe check passed\n* Company D - More of a true start up (again mature) but gearing up to go public in next couple of years, different industry and tech, total comp was fairly close to company B, base pay was second highest, and I would have worked much closer to hardware\n\nWhen I first started getting offers, company D was one of the ones who dropped out of interviewing. So I initially accepted C. It was the least pay of all 4 but that's not what I was after, I was after growth and learning, plus I still made more than my current job.\n\nLiterally the day I accepted the offer company D reaches back out saying the position was open again. This was a dream company for me so we went through the process and I ended up getting the offer. I accepted it and renege company C which understandably ghosted me as soon as I sent that email. This again scared the piss out of me because the instability in the market made me worried who I accepted would just rug pull me and be like \"jk you have no job\". \n\n**Conclusion:**\n\nI know without a doubt I was very lucky in my search. My interviews expected me to have way more ownership and breadth than I would have expected for someone at my level, luckily I did have that experience. In retrospect I think the biggest differentiators for my success in the search was being really picky on the jobs I applied to, willingness to be in office, and a lot of ownership/breadth from previous role. I didn't end up taking the highest paying job because that wasn't what was most important to me. So far the new role has been great and filled a lot of void I was missing at my previous role, but only time will tell if it was the right choice!",
    "score": 325,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1orfucw/mid_level_engineers_job_hunt_experience/",
    "created_at": "2025-11-08T04:13:41.000Z",
    "num_comments": 83
  },
  {
    "id": "reddit-1iite9s",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "What makes a staff/principal software engineer?",
    "text": "We (Series A startup) are currently hiring for a senior level (7+ years if I had to put a number) at minimum among many positions we have open. We get some candidates that are really experienced, often with back to back 2-3 year gigs “tech lead” or “manager” (and back and forth often). \n\nOne particular candidate sees himself as staff/principal and had salary expectations beyond what we had in mind for a senior. Our compensation are currently being guided by our VC, so I’m going to assume it’s “fair”. My personal feeling is that the compensation is also pretty fair. \n\nI am all for the candidate seeing himself as higher level. I gave him my assessment for what I deem for minimum requirements for a senior level. However, I am struggling to know what level beyond that real means, esp for hiring someone new. \n\nFrom my past experience, I’ve seen what a staff level is like: code output, quality etc. but this was for someone who I already work with. \n\nI am curious how people here \n\n1) hire externally for staff+ level \n\nand \n\n2) pitch themselves as staff+ level for new employers?",
    "score": 306,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1iite9s/what_makes_a_staffprincipal_software_engineer/",
    "created_at": "2025-02-06T03:41:21.000Z",
    "num_comments": 108
  },
  {
    "id": "reddit-1jrlbdj",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Leave my current recession-resistant job for Big Tech?",
    "text": "Not trying to brag I'm just curious for some advice: I recently received an offer for a FAANG company on a team that sounds really interesting (Kindle devices) and has a really great TC. However, if would require me to move 3000 miles to a city I've never been to and don't really know anyone and it would also require me to leave my stable job at a big bank. With possible economic instability looming, does it make sense to take this leap? It would really suck to move to this HCOL city just to get laid off immediately especially in a tough job market, but I feel like the career opportunity is hard to say no to. My team really likes me so there's a solid probability I could get my job back if I needed to, but if they implement a hiring freeze, they may not be able to. Any helpful thoughts?\n\n  \nEdit for extra details:\n\nI am 24 with 3 YoE.\n\nPay bump is $110k TC in MCOL city to $270k in HCOL city (Seattle).\n\nI currently have \\~$35k in cash and more in stocks but who knows what that will be worth for a while lol. Also considering selling my car since I would like to live in a walkable part of the city which would give me \\~$15k.",
    "score": 295,
    "url": "https://reddit.com/r/cscareerquestions/comments/1jrlbdj/leave_my_current_recessionresistant_job_for_big/",
    "created_at": "2025-04-04T20:06:50.000Z",
    "num_comments": 160
  },
  {
    "id": "reddit-1iy34xp",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "135,000 TC to 75,000 to TC",
    "text": "Background: No college degree, graduated bootcamp 2 years ago, found job at small start-up offering 135,000 TC and worked for 1.5 years. I got extremely lucky as the interview process was very straight forward (no leetcode, no system design) just talk about a project I've worked on.\n\nSituation: Start-up ran out of money and needs funding. They owe me close to $70,000. I've been jobless for three months. I haven't had the chance to study leetcode or system design questions thoroughly and would basically start from square one. Haven't received any leads in terms of interviews. However, I have a extended family member offering a job that offers 75,000 salary at a small local company. If I take the job, I would expect to stay there long term, at least 1 - 2 years as it's a close family member.\n\nMy biggest regret is not leveling up my skills while at the start-up and now I have 0 confidence in the job market.\n\nShould I test the market or just take the job?",
    "score": 288,
    "url": "https://reddit.com/r/cscareerquestions/comments/1iy34xp/135000_tc_to_75000_to_tc/",
    "created_at": "2025-02-25T19:14:19.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1luotui",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "My (American) company is opening R&amp;D efforts in India.",
    "text": "I hope this title/post isn’t taken the wrong way, but we all know that there are a ton of talented engineers in India that can be hired for relatively low cost. Our new CTO has enacted a hiring freeze, and just announced that we’ll be opening R&amp;D efforts in India, and I’m concerned what this might mean for the safety of my job. For context, our engineering team is roughly 200 people, made up of SE1-3s, and some Seniors.\n\nFor anyone who has worked at a company that has gone through something similar, I guess my questions are:\n\n1. How long after “opening R&amp;D efforts” might it take until the new engineers are actually hired?\n\n2. Is it more likely that they will be brought in to replace people, or to supplement what we already have?\n\n3. If people are replaced, which people are most likely to be replaced? Will it be performance based, salary based? A mix of both?",
    "score": 287,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1luotui/my_american_company_is_opening_rd_efforts_in_india/",
    "created_at": "2025-07-08T13:39:38.000Z",
    "num_comments": 232
  },
  {
    "id": "reddit-1n38m5y",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Are US devs shackled to the US job market?",
    "text": "I have 20+ YOE with a little management experience but am mostly IC tech leadership. We have been trying to think of plans to live outside of the US in case shit really hits the fan (we are non white and Muslim). But the salaries in the US are so high compared to the rest of the world I don't know how we can seriously do this without a big hit to our quality of life. Any expats here or people who have moved out of the US? Did you have to make compromises? ",
    "score": 281,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1n38m5y/are_us_devs_shackled_to_the_us_job_market/",
    "created_at": "2025-08-29T14:15:10.000Z",
    "num_comments": 424
  },
  {
    "id": "reddit-1ppv153",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Got laid off last year for the first time in 12 years. Experienced the worst job search of my career. Here's the Sankey.",
    "text": "[2024 Job Search Sankey](https://i.redd.it/wwa5kzx1nz7g1.png)\n\n\n\n[Here’s my previous post](https://old.reddit.com/r/ExperiencedDevs/comments/rqpfir/the\\_result\\_of\\_my\\_passive\\_job\\_search\\_over\\_the\\_past/) where I got the job I was laid off from. I was there for two and a half years and I hadn’t interviewed at all during that time.\n\n  \n\n\nIt took me four months to get an offer and I managed to get two of them in the same week. One was from an early seed stage startup and the other was Meta. I accepted Meta for more immediate TC and stability, but then I got laid off again just before hitting my year mark. I just finished interviewing again and this time the results are much better. Waiting for the last potential offer/rejection to come in before I post that Sankey.\n\n  \n\n\nOverall the system design interviews were my biggest weakness again like in my previous search. Hellointerview helped a lot with that and I ended up paying for two mock interview sessions with them. Those are painful but worth it.\n\n  \n\n\nBesides system design interviews, though, I got rejected a lot in the initial round for not having enough depth in particular tools. I’ve been working in developer tools and infrastructure for most of my career and a lot of places I was applying to wanted much deeper experience with Kubernetes, Terraform, and AWS. I had worked with all of those at the previous two jobs I had in the 6 years prior to this search, but hadn’t really dug in deep on them and it showed in those early screens.\n\n  \n\n\nI also got several rejections in the final rounds towards the end where the feedback was that I did very well but someone else just had a bit more relevant experience so they were getting the offer. I even had one recruiter say that the hiring manager tried to get headcount approved to extend offers to me and the other candidate but got denied and I was the second choice.\n\n  \n\n\nHere’s the details of the two offers I did get:\n\n  \n\n\n**Seed stage startup**\n\n* Salary: $190k\n* Target bonus: 10%\n* Equity: $88k in options\n* Remote\n\n\n\n**Meta**\n\n* IC5\n* Salary: $215k\n* Target bonus: 15%\n* RSUs: $710k over 4 years\n* TC: ~$425k\n* Hybrid 3x/week\n\n\n\n[Sankey source](https://sankeymatic.com/build/?i=IIBxBsEsFMBMAIDaA2AHAXXgOQPbwE7QDOIOAdkdAFCgQwKIDsArJgErQBW0AxgC5wqAeiHwAhkSIBXALaQyAc3Hhw8HADN4fABbRxPHtBACEYsFB5i%2BkckQLEp4E%2DHnxLKogBp4UkLCt6kJpkvMREYvgAnjTm9EgATBjwAMJiKvAA7qKEPPhSkAL4MXRwCZgA8mRQIeKSYTLQZHzFUKWIAIyYABJipuCEvZEuTdD4AG4wGaXqOPhaugQ44NS0rQzx7Lx5BaP2JOSwgqtxHZgAkmQFkGlavNqX7otSZLBUVD19A7BD8oUT0FMEDM5jo9PglnpTvAONx%2BIIqBxcvlCntSC82ht4ABxbQ4IgmN6I7YohqSMQKUoNJDtZAAFkwAHUCtpYIQMgitsjdqTwhSEFSUElUuksvYkTsikSuXMeeTKZDaUkcXiCVKJfBZXyNZD2vToVxeKrOerNfKkHrKtU9BJKJIGk0OeKSWE5fydedLtYbgIePdII9wc9XlRhapRTlibsoQAVMQAaz0uKpNsgCjI9uaocy2WNKI6AE5NrCCVnw7mo8xOvALldvXcHjdAy8Q2kwzmnVGAMyM5msgEtkXtyNzJgVKrya11O2NTOt7Ni4fU1jY3H4%2BGxhPwJOToip9MzsrwJk6PvsjeJnDJyR7jPUouGwTnreXnc3g%2BITEAMXkjZwQaoT7brUu5preULHiybLiOoKJiAYRjWIoajqOooyEtAcG6Agf58FoeAyEMIR8Bksxxne%2BrFoIHCYaUOF4RqhHQMRpHkbgqK2NQVA1l6qg%2Bn6AZ%2Di8CTIPecKvNx1y8fW%2Dq%2DkG1J6t%2BZCyc2El1r6DaqE2DDtAADJgypruJnqSbc6kyZpgkMMugEvsBb4OqpUlmQJcngb2bJccZan8cp2ljlawH1DObyWhOgXTk0SDdhRD6vKFNQ2kFkWIHqEGnlQ8U7kluEpR6tZOT5Fn%2Dpl4VEGB0WKb5byVUVQkdMuMKxVQNVPHVmJpVBYgwbscGGMY8hKBoqFFC1WnkeUKFoaNlnkdGGEyBqVi%2BgNbxzWIC0yEt2gDeNk1FBle3kcA8HGIIE3DeRAAivBWsGABcjVifAADEyTJDpH06VQd1sYQ%2BwUHoz2MLSwPA99pZDtKL0AEbMDwtLxIw30dQCL35vmqDqIwnbfcdfXOM9H2fp%2BH3feduyEzpPD5qTd2OaZhWtQglO0swtPTXJlOMLAtPXTwt0vR9CO0yjGTQbBJ2IYNh3PYcYg0%2DmuOxKUlOfV9D0Yb6tFSLhfD4YxzH4GRqufd9arOmSWpUibtMlYlEW4c9nbxNDnY6Ujd0GQTyDc8g0DqzZV4gfukVOy7btI7uABeehi%2B0%2BbxF9W7wLpqBfZt%2BAKK4qjtPEVAECnedaCnqD59D8CJ1Q0NKDwSyzC9KGN%2Bo%2Bd8PgYgUCAEQHlgVBkDghyZIX%2BfaPAbP5yQcE7SwZezIccxJ6Cyb57X4D189qAb5v%2Bc4J3PAFEM7RUOoq9izwUjjFY596DpAB0zD5%2DIuj4AU6jggtfARBSzRuHXczPejADFZqF3vveAt9WZUHAGISIdFZ49R1peKw%2Dp86cCkPiIIMDn5ZwoNgFBaDrDqEiI0WAdge72DGKMSgCg24gBHmQqwH9lpkFrjICATFiB63gCELu%2BJIFiGhtAcAdgV5rzVqTLckAB5kO2gobQUBZG4VvtPeAMwmjqDgnocIFAAC0lBn7N3gFaCee8kK3yLoQKB1gKHRz0O0XS%2BdNppgwSnUmUCBHgCUsmMAGF8B2AAJrj0gDHFOyB85TFTNoXCtJXH8MEWMNIUhrTeIiP4%2DO6hHDgBADkSAu5yDwACfAUgu5rB5PcTgdkmRoARKiTE9xRSrh5LEAgtIe4wHjy1smBBaTIC%2BNwgI4E1B4DQwGHGUgvwK5fXieARJKjZibVwgAck8DfBZ%2BcsnQHUJAAAHvABZqz4DSBQts3ZqzF7QCGpQXCYh4ChKGW0tw9yEDpyYtcjMNgKDtwTJEeZ%2Dp8n5ygOgmQ0M0jt0MKkmQOAKHwGOKUbRt8dK6R0swbwcKb66niCDKgEKoW%2DWIGiSgYCb5Ip0p2fMKLb66WYLSLFkK9Dm25C6K2ehtHtDvp2ZAyBvAUpBtS7FdLNZYTUDreiBEuFMRIkbQlH12ioGRfAVFnZUCJBxnylIc4ywdjmKitO8R8ztC5WihFOk86qrtlOMqB5UXMHzMwZAnZyU3zdgik1tLqxeQKhpJm8rb7WvZfEA18R44%2BxpVCr2pR4U2vzLSA17RGAIvvqq0W4seqSx2kNXYqK7HxFtTG5AGND6qo5kJBVMrs0Gp0nqzsvLXWB1fKBS14DaT5kVQGukjBQmqses4eF7Qq3lsVcwF1UKk3worS2qVaBEghr0OTLV8LkAVrlai41iRS6qrxghcNRKkXsodanZgCbXV8wFqOn2DqdKs3aIeqFHxlBfB%2BCMcYkxpj11BIsZY3qb60jzagaNn6PqJEVqqtaG0to7UzagTs1rz0XtQAW119K5h%2DTRIcBAqLkDxE7O2h1aBkDWqAA)\n\nEDIT: Explaining my terrible labels: \n\n* Withdrew after accepting offer: I used this for the companies I withdrew from once I accepted Meta's offer.\n* Rejected: means the company rejected me at some point\n* Ghosted: the recruiter stopped responding to me without an outright rejection\n* Call w/ recruiter: Only used this if it was the first step before anything else after either applying or getting their email or LinkedIn message. A few places slipped this and I also used it to distinguish between getting rejected or withdrawing before or after talking to the recruiter on the phone.",
    "score": 276,
    "url": "https://reddit.com/r/cscareerquestions/comments/1ppv153/got_laid_off_last_year_for_the_first_time_in_12/",
    "created_at": "2025-12-18T16:24:43.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1m77jaq",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "15 years of experience, still a senior backend engineer. Is it bad?",
    "text": "I started working when I was 16 on a freelancer platform, to make a little bit of extra money, emigrated and switched to full time at 18. From 26 to 31 years old I took time to take a degree in mathematics, and then a 1 year course in business administration, formally a mix between a PhD and an MBA in econometrics, which was a waste of time TBH, but I was still working part time as a freelancer. Now I'm 37 so it makes roughly 15 years of experience. I also have a couple of successful startup + cash out under my belt.\n\nA few years ago I got promoted to tech lead, but after a few months I asked to switch back to senior backend because I was spending too much time managing people instead of dealing with tech problems. I always thought that what matter is money, and currently I feel like I have a good salary.\n\nAm I wrong in thinking I can be an engineer forever? Should I be more career focused? I got the doubt because I see some of my coworkers became directors, head of, .... While I roughly have the same title since forever, but I both hate and am bad at political / people topics\n\nEDIT: Thank you all for your kind words. I guess I was being a bit anxious about getting old LOL ",
    "score": 272,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1m77jaq/15_years_of_experience_still_a_senior_backend/",
    "created_at": "2025-07-23T12:10:44.000Z",
    "num_comments": 185
  },
  {
    "id": "reddit-1jqlr8h",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Reset Salary Ranges?",
    "text": "Is it just me or does it look like maybe salary ranges are being reset at a lot of companies for otherwise highly skilled positions? For instance, I’m seeing principal level engineer positions at, say, $120k-135k base? Depending on org, that’s almost a terminal position for engineering so that feels a bit low for the amount of responsibilities and experience expected. Maybe nothing new for a lot of companies but feels like a devaluation in the value software engineers provide and demand in the economy. ",
    "score": 270,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1jqlr8h/reset_salary_ranges/",
    "created_at": "2025-04-03T15:41:03.000Z",
    "num_comments": 192
  },
  {
    "id": "reddit-1koj548",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Real talk - what is people's appetite for forming a software developers union/guild/association?",
    "text": "A few disparite thoughts: \n\n- Software engineering has identity of being a meritocracy, with these very high salarys for the people right at the top of the game. There's the thought that 'well that could be me'. So this leads to people working on side projects out side of work etc, because 'I just need to be better than the other developers, then I can I get the 500K job'. Great for the employers. \n- We've probably all worked with other software developers who we thnk aren't particularly good, and there's a thought that the purpose of a union/association/guild shouldn't be to uphold mediocre standards. \n- I think agile is suffocating the profession. It's before my time, but I think previously software developers had more power in determining how things got done, because they were able to get together and plan it out. Now, it's all broken down into Jira tickets and the developer is just assigned 'do this thing'. It means we get shoddy solutions and the job sucks. \n\n",
    "score": 262,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1koj548/real_talk_what_is_peoples_appetite_for_forming_a/",
    "created_at": "2025-05-17T03:09:14.000Z",
    "num_comments": 339
  },
  {
    "id": "reddit-1jly2pd",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "As a HM, how can I encourage my prospective hires to negotiate their offers",
    "text": "My company has standard offer/signon bands, and recruiters will tend to leave headroom for offer negotiations.\n\nNot all candidates negotiate, especially women, and leave money on the table. As their future manager and it's not my money, nor do I manage budgets, I'd like them to max out their comp. It's much easier for them to get that bag at hire, as there really isn't any possibility to change their salary outside of the basic merit/promo cycle, and those increases are much smaller than what they can negotiate up at hire.\n\nWondering how this community handles this situation?",
    "score": 261,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1jly2pd/as_a_hm_how_can_i_encourage_my_prospective_hires/",
    "created_at": "2025-03-28T15:43:47.000Z",
    "num_comments": 114
  },
  {
    "id": "reddit-1jbbe7e",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "An Ode to the Lost Magic of the 2010s ZIRP startups",
    "text": "It really is incredible how suddenly the world changes. Many of us are now unemployed, facing layoffs, taking salary cuts and enduring grueling work environments to try and get through the worst tech recession since 2008.\n\nI myself now work in a fusty, old and stable government department in Europe.\n\nBut I once worked for a couple of 2010s ZIRP startups. And what places they were.\n\nPeople from across Europe and the world would rock up to these places and bring their seductive cocktail of cultural insight, experiences and languages. And they were motivated primarily to create something new and cool. The types who would have hated the fusty corporate offices that many of us now flee to in search of job security.\n\nAnd the energy was explosive. Sure most of their companies didn't make much profit or, in many cases, even  revenue - but the magic was palpable. Not least because the company socials brought together so many people from different cultures and countries.\n\nLove, friendships (and even startup founder partnerships) were forged in these places. And this magic was often sparked overseas at global socials that the startups flew everyone to so that we could all party in foreign lands. I myself was flown to New York alongside everyone else in the London office to party for three days. It was crazy.\n\nMuch of that magic was captured in photographs that disappeared not long before those bankruptcies were declared.\n\nMany of those people have since moved on to more sensible lives, corporate jobs and the bright beginnings of early middle age.\n\nBut for a moment, it was magic.",
    "score": 257,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1jbbe7e/an_ode_to_the_lost_magic_of_the_2010s_zirp/",
    "created_at": "2025-03-14T19:00:32.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1jifwyk",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Having A LOT of difficulty attracting/keeping engineering managers at my start up after years as an IC developer. Any advice?",
    "text": "Update: People seem hung up on the wrong thing here. We pay a competitive salary for a start up manager ($350K + options), it's just low compared to an engineering manager job at like Google. FAANG EM salaries, even for front line managers, are often $600 K a year  \n  \nI have about 20 years experience in the tech industry (16 with big tech/FAANG companies, 4 with startups), mostly as an IC developer.\n\nAbout 18 months ago I co-founded a start up and it has gone pretty well and now we have 15 developers. This is a lot for me to manage and, to be honest, I am not the best people manager. It's one of the reason I have gone back to being an IC developer over and over again.\n\nI have been trying to attract engineering managers to the company and both of the first two I have hired have left at after a few months, citing me as the reason.\n\nThe first one never really seemed to know what he was doing at the company, and really seemed to have a lot of trouble dealing with ambiguity.\n\nThe second one, who came directly from big tech, seemed EXTREMELY uninterested in doing and hands on work, and actually went to the CEO and tried to take my job.\n\nI have reached out to some decent managers in my network I had in big tech but none of them want to work at the level of pay we can offer.\n\nThe reality is I am going to be a lot more technical than any manager I hire under me unless I promote one of the engineers on the team.\n\nAnyone have any experience with this kind of problem? Any advice on going from IC developer to start up executive and trying to attract engineering managers and keep them happy?",
    "score": 239,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1jifwyk/having_a_lot_of_difficulty_attractingkeeping/",
    "created_at": "2025-03-24T01:54:51.000Z",
    "num_comments": 211
  },
  {
    "id": "reddit-1hp08cs",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Google or Apple for FTE SWE New Grad Role?",
    "text": "Hey guys! I had previously made a post about another company but I was fortunate enough to get opportunities from both Apple and Google starting after I graduate in May 2025. For some background, I am a US citizen (not from a top school) and had 2 previous internships at Big Tech companies.\n\nThe Apple offer is in the Bay Area and the good thing is that I already know which team I will be working for and it’s pretty interesting. For Google, I’m still in PA matching since I interned in Cloud but assuming I do receive the offer (which apparently should happen), it will most likely also be in the Bay Area (where I interned at) and in Cloud, but I won’t know what team I will be in yet. \n\nApple TC is around 200k and Google is around 215k. \n\nI was wondering what your opinions were regarding the state of these companies currently? What do you guys think is the better company to work for, more value resume wise, etc? What would you guys choose? Thanks! ",
    "score": 238,
    "url": "https://reddit.com/r/cscareerquestions/comments/1hp08cs/google_or_apple_for_fte_swe_new_grad_role/",
    "created_at": "2024-12-29T17:00:05.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1jizrqq",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Bloomberg offered my Senior SWE???",
    "text": "I interviewed at Bloomberg earlier this month. I did 4 interviews over 2 days. According to my recruiter I passed all of them. However I didn’t get the offer for an entry level position, they offered me a chance to interview for Senior SWE with only 2 years of experience. Am I being set up for failure? What should I study? My recruiter said I’ll have multiple rounds of DSA and single rounds of system design/hiring manager conversations.\n\nThe team I was matched with is the Data and Analytics Gateway Platform Team.\n\nAnyone have any insights?\n\n2 YOE | 95k TC",
    "score": 237,
    "url": "https://reddit.com/r/cscareerquestions/comments/1jizrqq/bloomberg_offered_my_senior_swe/",
    "created_at": "2025-03-24T19:40:46.000Z",
    "num_comments": 84
  },
  {
    "id": "reddit-1m2dbq7",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Differences I see from my experience in Defense, MAANG and Big tech industries.",
    "text": "Hey all,\n\nIm 7 YOE. I have worked in the defense industry my first few years (RTX, Lockheed Martin, BAE, etc), then during the hiring height of 2020-2022 I went to FAANG-level company and spent a few years there in their cloud based system. THis year I got laid off and after a few months I was able to get a job in a big tech cloud based system. I wouldnt consider my current company FAANG level but id say most people would know it. I will pre-face this that it is my experience. Im not saying every project in each industry is like this, I've known people in AWS who claim to not have to do anything past 5 pm and get great reviews and bonuses.  I know people in defense who say they work a shitload of hours to get things done.\n\nHere are some of the differences I've seen from all three jobs:\n\n# Onboarding:\n\nDefense - didnt really have an onboarding. It was just kind of, build and run the system. I remember they gave me a task to change the headers of a few files just as an excuse to get me to build.\n\nFAANG - they bascially gave me an onboarding doc, that didnt even seem official. It was just a doc that got passed around with steps. I was surpriused nobody had ever took time to put it in a version control style doc system. It was just in the middle of some doc sharing system online.\n\nCurrent: to my surprise their onboarding was the best and most chill. They gave me clear indiciation of where they expect me to be. The first week was just 3 hour courses each day of onboarding for my company. The second week was a self paced class for onboarding for my team. The videos were very instructive, and easy to follow along and my favorite part was they basically gave us guidelines for how to get promoted.\n\n# work life balance:\n\nDefense - probably had the best work life balance of the bunch. I never had to think about work after 5pm. By 6 the building was a ghost town with a few stragglers. They worked on a 9/80 schedule so I had 3 day weekends 2-3 times a month (26 times a year). I could also work for extra PTO, where if I worked extra hours one week I could save it in a \"extra time\" bank and use it as future PTO.\n\nFAANG - definetely the worse of the 3 so far. It was expected ot be available practically 24/7. I went to that FAANG company because I had heard it was one of the few that you coould have a life, but I never realized that cloud was the exception to that rule. People were respodning to emails late at night, getting on calls late, responding on vacation, etc. THey were cool about taking time off but it felt like if you weren't drinking the kool aid and doing 10x more like verybody else was doing, it wouldnt go well for you.\n\nCurrent - still early to tell but it seems that there isnt as much of a \"work late\" culture here. People set their own times, some work a bit later but Ive never seen any crazy discussions happen at 11 pm like I did in my last job. A few principal engineers have gone on vacation and not yet have I seen any of them get on a call or message thread to answer any type of question.\n\n# Expectiations:\n\nDefense - really didnt have much expectations. I practically worked 20 hours, coasted the rest, was my team's scrum master, etc and over excelled in their eyes. There was no real due date on things because contracts in defense last multiple years. I remember when I got there the expectation was to complete the project within my first year. It took 3 years to finish and nobody batted an eye.\n\nFAANG - expectations were very high. If you were finishin up with a major task, theyd throw another one at you before you were even done with the first. Seemed even as aJr/mid-level I was expected to lead meetings, always be available, etc. I worked way more at this job than I did at defense and felt like i was underperforming because if I did 8-10 hours, most others did 10-12 hour days. In reviews it seemed like I was compared to my teammates, not so much compared to what the expectation of the job was.\n\nCurrent - again still early. But seems like their expectations are pretty fair. A quote from the first day I like was \"if you want to be the person that does 40 hour weeks and gets your job done, you can have a long career here. If you want to be the person that does 50+ hour weeks here for that quicker promotion, you can do that but just respect your work-life balance\".\n\n# Time and meetings:\n\nDefense - hardly had any meetings. We did standup evertday (except fridays) for 30 minutes but it mostly lasted 15 minutes. We hardly went over. I never learned the concept of parking lot until I got to FAANG lol. It was in office so just walking to someone's desk was really just the norm.\n\nFAANG - seemed like if your day didnt have 4 hours of meetings, you were underperforming. Everything was a discussion. Parking lot would take an extra hour and most of it was discussing things that I felt didnt really have to take that long. At times some of my tasks were pushed back due to someone wanting to discuss about one simple change. If you had to talk to someone, it was hard to get them on a call and when you did they didnt appreciate their time being wasted. In meetings it seemed everyone was stressed to have the meeting finish.\n\nCurrent - seems nobody is really stressed about meetings. Parking lot items get resolved pretty quickly. Everybody doesn't mind hopping on a call and lasting an hour with you.\n\nEdit: someone asked for interview styles. I wont give exact details but ill say more or less how it was.\n\n# Interview:\n\nDefense: I was a college grad so I got invited to an all day hriing event by the company. It seemed like the interviews didnt ask anything technical, they jsut wanted to get ot know me. At the end of the day they had me list my favorite teams and told me theyd let me know. I've interviewed for other defense companies, tbh there were no leetcode questions or anything like that. Technical questions were more like \"what is OOP?\" or how I would design a simple code.\n\nFAANG - first was a pre-round codesignal style question to see if I knew what I was doing. Once I passed that I went through 2-3 rounds of interviews asking leetcode style questions and then a manager meet.\n\nBig tech - similar to faang. Pre-interview exam to make sure I knew what I was doing. Once I passed that it was 2-3 rounds of code/system questions.\n\nEdit 2: people asked about TC\n\n# TC\n\n\\- Defense: as a college grad in a HCOL state I started at about 78k wiht a 5k bonus. Within 4 years and 1 promotion I was making 90k and yearly bonuses that was around 5k-8k.  No stock. I know people who jumped to other defense company and they are around 120k. Promotion seemed like it happened every 2-3 years.\n\n\\- FAANG - I never got promoted in my few years though I doubt I deserved it in their eyes. I never really saw anybody get promoted really. Like one mid level SWE had been working more than most seniors and she didnt get promoted. AS for TC it was about 220k between base stocks and signing bonus. I moved to a low COL state shortly after joining and my base pay dropped by 20k so it ended up being around 200k\n\n\\- Current company - TC is about 200k with just basepay and stock (no signing bonus) but according to them, im promised up to 10% bonus that would bring my total pay to around 215k.\n\n# Benefits\n\n\\- Defense: 3 weeks of accrued PTO. But since there was timsheet we technically were not allowed to do overtime. A work around was if I worked 90 hours in a 2 week period, I could use 10 hours and save it in a special bank that I could use later on. So If in a 4 week period I worked 200 hours, I could set 40 hours to that special bank. And if I had a 2week vacation I could use the special bank for the first week and my regular PTO for the second week. It was good benefits outside of that, tuition reimbursement which I used to get my master's degree without taking on more debt. Discounts on personal travel (it wasnt amazing but good enough) etc.\n\n\\- FAANG - Unlimited PTO. Some of the best benefits i've ever seen will probably will ever have. There were multiple different types of reimbursement programs for almost anything. Discount codes on almost any store that were actually pretty good discounts. Similar benefits when it comes to tuition reimbursement, etc.\n\n\\- Big tech - unlimited PTO. Again good benefits, just not as good as FAANG. Company will give random 3 day weekends to employees that they announce pretty early so people have it prepared.",
    "score": 231,
    "url": "https://reddit.com/r/cscareerquestions/comments/1m2dbq7/differences_i_see_from_my_experience_in_defense/",
    "created_at": "2025-07-17T17:13:44.000Z",
    "num_comments": 97
  },
  {
    "id": "reddit-1opy48c",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "High TC Remote First companies?",
    "text": "I’m at 350k TC and am looking for possible next steps.  I’m at a tech lead / senior 2 level, and WLB (rarely more than 40 hours a week) is important.  Tech stack is JVM (Java, Kotlin, Scala) with a heavy emphasis on big data and distributed systems.  \n\nIt seems like most of the companies I used to look at potentially working at one day (Google, etc…) have gone RTO.",
    "score": 201,
    "url": "https://reddit.com/r/cscareerquestions/comments/1opy48c/high_tc_remote_first_companies/",
    "created_at": "2025-11-06T12:53:28.000Z",
    "num_comments": 133
  },
  {
    "id": "reddit-1l7gvxl",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "How can I tell if it's time to leave my company?",
    "text": "First job - been here 5.5 years.\n I'll try to break it down as simply as possible:\n\nPros:  \n\n* Free to come and go as I please (start time, end times, hours worked)\n* Manager and skip don't micromanage - let me plan my tasks\n* Great relationships with people in key positions - I'm currently building a course on few subjects to lecture the entire R&amp;D department\n* Potential to climb ladder, clear path - I'm a Senior now, can pivot to TL if wanted\n* Job is 25 minute bus commute from home\n* Above average pay for the field - getting stock refreshers but small amounts (cleared 120k with bonuses this year in a MCOL-HCOL area)\n* People are very friendly - lots of people I'm close with at work\n\nCons:\n\n\n* Company is doing poorly - stock has dropped 90% since its peak in 2021, no recovery in sight\n* Previous stock refreshers (1-3 years ago) dropped significantly in value\n* Really good engineers are getting poached by FAANG, no clear replacements for them in a niche field\n* Less than good people are jumping ship to other companies\n* Company is stingy with new stock refreshers - which makes me feel like there's no point in committing to it - if I'm busting my ass I should be in position to get rich if the company climbs out of the hole - this isnt the truth.\n\n\nIm having troubles convincing myself to use logic and get up and apply for the FAANG poachers - they're offering 50% more salary with a brand new stock package worth 100-150k over 4 years. Has anyone else been in a place like this and made the move?",
    "score": 190,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1l7gvxl/how_can_i_tell_if_its_time_to_leave_my_company/",
    "created_at": "2025-06-09T21:20:33.000Z",
    "num_comments": 62
  },
  {
    "id": "reddit-1p0wz9w",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Backend software engineer in oil and gas, long term career advice needed",
    "text": "I’m currently working as a backend software/data engineer in a mid sized oil and gas company. Depending on how well we do my TC is anywhere from 200k - 240k. I live in a MCOL city.\n\n\nThe company I work for is great in terms of work life balance, it is 5 days in the office with on call rotation, but we do have 6 weeks PTO and another 1 week of sick days. We also surprisingly don’t do layoffs, we’ve never had layoffs even when oil hit negative during covid.\n\n\n\nI currently have 4 years of experience in software and before that I was an electrical engineer with 4 years of experience. I’ve been with this company for almost 4 years now.\n\n\nRight now I’m currently a Senior within the company but probably out in the market I’d be considered a mid level. I’m working my way up in the company pretty quick and I have a good relationship with my manager. I believe within 3 years I’ll be at a manger role with my TC somewhere around $350k.\n\n\n\nIn terms of the work I do, it’s a variety of backend work from API development, to ETL’s, managing database schemas/SP’s, and working with real time data. The tech stack on the backend is mostly Python with a little bit of .NET, I’ll be dabbling in GO soon as well for our realtime data calculations from RMQ. On the database side I’ve pretty much worked with every sql/nosql database you can think of. \n\n\nI’ve been thinking about my long term career growth. I’ve seen posts about people making 500k - 1m TC and would like to work towards that. I’m absolute dogshit at LC, however at work I’m able to architect out solutions for new projects and solve issues quickly. \n\n\nI would say I still have room to grow here, I’m still learning new things and have the freedom to introduce new technologies. Wondering what I need to do to prepare for that next big jump? And how’s my career here so far?\n\n",
    "score": 186,
    "url": "https://reddit.com/r/cscareerquestions/comments/1p0wz9w/backend_software_engineer_in_oil_and_gas_long/",
    "created_at": "2025-11-19T03:35:38.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1mfuvay",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "What's going on in the world of small, local software companies?",
    "text": "Hello!\n\nI took a sabbatical in 2023 to focus on a different career outside of tech, intended to take a break for about 6 months but things have been going well enough that it turned into 2 years and counting.\n\nAnyway, I was thinking about dipping my toe back into the industry next year. I don't really want to work at a FAANG company, and I don't really need huge TC. I'm pretty content to work at a smaller company that isn't doing anything in the AI realm, a company that makes \"boring\" software with a \"boring\" tech stack.\n\nDoes anyone know what that world is like right now? I'd be pretty content to take an $80k/year TC package doing, say, PHP if it meant I didn't have to go through months of screenings and assignments competing with 200 other resumes. Or are even the small companies inundated with applicants, doing 4+ rounds of interviews for mid-level positions?\n\nThanks!",
    "score": 179,
    "url": "https://reddit.com/r/cscareerquestions/comments/1mfuvay/whats_going_on_in_the_world_of_small_local/",
    "created_at": "2025-08-02T16:32:36.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1p92cy3",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "2025 Front End Job Search Experience -&gt; Offer",
    "text": "**Here's my job and interview experience in 2025. 14yoe.** To not bloat the main thread, some topics will be in comments below.\n\nI was working at a fintech company and they did huge layoffs after acquiring 2 companies, nearly every engineer from our division was cut. it frikin sucks but it is what it is.\n\n350 applications -&gt;  18 recruiter calls -&gt; 12 tech screens -&gt; 3 final rounds -&gt; 1 offer;\n\ni applied to practically every single front end position in existence.\n\nSankey diagram here [https://i.imgur.com/pwHagNt.png](https://i.imgur.com/pwHagNt.png)\n\nTime elapsed: 3 months.\n\nI landed an offer with Marvell Semiconductor as Staff UI Architect!\n\nThis position is unique- hybrid of Front End Engineering + UI/UX Design. I was tested on designing UI's for semiconductor (switches, data center etc) data visualization, as well as javascript fundamentals. I initially asked, wouldn't you want a graphic designer since bulk of the work is UI/UX design? but they said no, they could never understand the technicals of FE dev nor EE. they wanted someone who knew UI/UX design, FE, AND EE. So i was a unique fit for the role.\n\n**Stats:**\n\n\\-TC: Years 1-4: 248k -&gt; 276k -&gt; 303k -&gt; 330k (Includes estimate of guaranteed refreshers)\n\n\\-High level role with Data Center Network UI design + some front end dev\n\n\\-4 days a week, 30mi commute 10AM-2:30PM, avoids traffic, 45mins. On call for overseas folks 8-10PM. + Occasional travel overseas to india.\n\n\\-highly rated on glassdoor, low layoffs compared to peers\n\n\\-incredibly smart EE folks; I studied EE in college but pivoted to FE dev and now this is almost going back to my roots.\n\nInterview:\n\n\\-I didn't even expect a call back, the position seemed out of my league, but behold, i did. Told recruiter my background in FE dev, not a pro UIUX designer but i know the concepts and i work with them. Said he'll get back to me and the next week they want me for a GIGA HARDCORE FINAL ROUND with 6 directors/vps/staff engineers. \n\n6 1:1's PLUS a presentation to all 6.\n\nOh my god I’ve never got grilled on UX design this hard in my life. \n\nOne of the directors (PhD from MIT) asked me: Say aliens are invading earth. You need to design a control panel for a missile defense system that is user friendly to the operators. Button? Console; command line etc? What’s the design like, how about communication? How do u communicate to others, alarm system? Should there be a mute button? If the operator is in a hurry and needs split second decision how do u ensure the cleanest UI design? Security?\n\nAnother director (ex-AWS) asked: Say u have a data center with servers and switches that transmit data, but data can be failed / low quality / bad transmission, design a gui for this.\n\nVP asked me: Say there’s a bar graph. X axis is quality and Y is number of items. Title of graph is “amount of items of various qualities over the past 24 hours”. Now, we don’t like this presentation and instead want the X axis to be time. But we still want to show the data for quality/# , so we’re adding another data point. How do we display the graph now?\n\nStaff FE dev grilled me on js fundamentals such as closures and promises. I fumbled on a few questions but managed to get most, explaining thought process.\n\nCrazy interviews, hiring manager told me as a closing thought \"This position is challenging to fill\" and i had that thought RACING in my head 24/7. what could it mean? Did he like me and i'm a contender? Or did it mean \"this is a tough role to pass\"; i asked chatGPT and it said \"THIS IS A HUGE GREEN SIGNAL\" i was like lolwut really? ok then!\n\nWeek later recruiter emails me \"I wanted to connect with you regarding feedback and next steps\" im like NEXT STEPS?? GG? lets fkin goooooooooo. and boom offer.\n\nCraziest part is i couldn't prepare for these UI questions, came leftfield, i just winged it and somehow i had enough intuition to pass them. Recruiter told me many candidates were able to pass coding, but struggled/froze on the Design Mission Control System design question. I guess i have some semblance of talent in UI design?\n\nUpdate 12/18/25 - been 2 weeks, i've gotten the repo of the data center network ui prototype vibe coded by offshore folks and i've been tasked to improve it. So far it's all dev work.\n\n\\----\n\nSome FE coding questions I had this year:\n\n**Discord -** tech screen - failed\n\nCreate a UI for a formula parser that has fields a, b, c. You can type numbers in the field and the output of the fields would be those numbers, but you can also type letters in the fields and they would add up the numbers stored. For example in field A if you type 3 the output of field A is 3. \n\nThen if you type A in field B the output of B is 3. In field C if you type in AB you get 6 (3+3) the reqs were so ambiguous so it took me awhile to understand the problem. NO AI, write on own IDE with screenshare.\n\n**Crunchyroll** \\- tech screen - passed\n\nCreate a react app that renders a collection of anime titles and its image, from json data;\n\nfor(var i=0; i&lt;5; i++) setTimeOut console.log(i) \"trick\" question whats the output and why?\n\n**Crunchyroll -** final coding round - failed\n\nPolyfill the \"getElementsByClassName\" function. Aced system design though, the interviewer was impressed.\n\n**Walmart -** tech screen - ghosted\n\nWrite a \"deepclone\" function that copies an object with variable depth and contains anything, including other objects, arrays etc.\n\n**Oracle -** tech screen - failed (passed question but they chose another candidate with more backend exp)\n\nCreate a react app that displays a credit card, with buttons to switch which cc to view, cc data comes from json. Clicking on cc will replace the text with X's- X's correspond to how many words there are, so FIRST LASTNAME will be XXXX XXXX.\n\n**Anduril -** tech screen - failed \n\nYou know in your IDE the directory structure, with folders and files? Given a pic/mock of that, Build it.\n\n**Amazon -** https://www.reddit.com/r/cscareerquestions/comments/1iudddy/rainforest_loop_experience_frontend_l5_12_yoe/\n\n\\---\n\nClosing thought: It's rough out there for Front End devs. There are fewer positions than before, but way more AI/ML positions. However, FE dev compensation is still competitive, u just needa know so much.\n\nI'm not incredibly smart or talented, most other engineers are more brilliant than I. The biggest source of my success is the resilience to failure. The amount of rejections and failures is so high  but every time, i write down what went wrong, study it, and gain knowledge, so over time every failure builds up to more and more knowledge.\n\n*^(Note: I didn't run any of this thru AI.)*",
    "score": 167,
    "url": "https://reddit.com/r/cscareerquestions/comments/1p92cy3/2025_front_end_job_search_experience_offer/",
    "created_at": "2025-11-28T18:33:21.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1idqdxs",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "(meta) Let's talk about rule 3: No General Career Advice",
    "text": "It seems like many interesting and highly relevant to SWE folks posts seem to be deleted via Rule 3. The examples listed in the sidebar are:\n\n&gt;No general career advice, including \"should I take company/role X or Y\", questions about hot markets, equity, salary, FAANG, job titles, interview questions, or negotiations.\n\nand\n\n&gt;Any career advice thread must contain questions and/or discussions that notably benefit from the participation of experienced developers. Career advice threads may be removed at the moderators discretion based on response to the thread.\"\n\n&gt;General rule of thumb: If the advice you are giving (or seeking) could apply to a “Senior Chemical Engineer”, it’s not appropriate for this sub.\n\nHowever it seems like this rule gets applied far too broadly in this sub. It feels like what it actually is interpreted to be is, \"if answers might apply to other people in other industries, it's probably a Rule 3 violation.\"\n\nFor example: [https://www.reddit.com/r/ExperiencedDevs/comments/1icxkmr/is\\_being\\_the\\_wildcard\\_developer\\_a\\_good\\_or\\_bad/](https://www.reddit.com/r/ExperiencedDevs/comments/1icxkmr/is_being_the_wildcard_developer_a_good_or_bad/) was deleted this way recently. It was one of the more interesting and applicable to SWE folks I've seen here but because it tangentially is relevant to other fields, it was deleted. Responses here absolutely benefit from the participation of experienced developers, as called out by the sidebar. \n\nWhat I'd like to see is a lessening of how broadly Rule3 is applied. I struggle to understand why the above was deleted but of the [top posts](https://www.reddit.com/r/ExperiencedDevs/top/?t=year) from the last year, so many of those are still present. Of the last year top 10:\n\n* [https://www.reddit.com/r/ExperiencedDevs/comments/1g0m8mb/be\\_aware\\_of\\_the\\_upcoming\\_amazon\\_management/](https://www.reddit.com/r/ExperiencedDevs/comments/1g0m8mb/be_aware_of_the_upcoming_amazon_management/) \\-- Amazon has many non-tech managers and this is far more than tech-specific\n* [https://www.reddit.com/r/ExperiencedDevs/comments/1b89gqf/the\\_cto\\_of\\_my\\_company\\_challenged\\_all\\_engineering/](https://www.reddit.com/r/ExperiencedDevs/comments/1b89gqf/the_cto_of_my_company_challenged_all_engineering/) \\-- this applies to all managers. As someone who was a different engineer type before being a dev, the same root problem applies to all managers - many managers exist who have NO idea what their team does and cannot do even the most basic of job tasks.\n* [https://www.reddit.com/r/ExperiencedDevs/comments/1gz9ksj/my\\_senior\\_engineer\\_interview\\_experiences/](https://www.reddit.com/r/ExperiencedDevs/comments/1gz9ksj/my_senior_engineer_interview_experiences/) \\-- this is just blatantly an interview question/experience Rule3 violation\n* [https://www.reddit.com/r/ExperiencedDevs/comments/1gtoe56/after\\_5\\_years\\_of\\_working\\_in\\_tech\\_ive\\_surmised/](https://www.reddit.com/r/ExperiencedDevs/comments/1gtoe56/after_5_years_of_working_in_tech_ive_surmised/) \\-- this is the case in most engineering disciplines\n* [https://www.reddit.com/r/ExperiencedDevs/comments/1fic0db/amazon\\_moving\\_to\\_five\\_days\\_a\\_week\\_inoffice/](https://www.reddit.com/r/ExperiencedDevs/comments/1fic0db/amazon_moving_to_five_days_a_week_inoffice/) \\-- this applies to all amazon employees. FAANG is also explicitly called out as a Rule3 violation\n* [https://www.reddit.com/r/ExperiencedDevs/comments/1g6j7vi/overwhelmed\\_at\\_new\\_faang\\_job/](https://www.reddit.com/r/ExperiencedDevs/comments/1g6j7vi/overwhelmed_at_new_faang_job/) \\-- most of the comments/discussion apply to anyone joining a new job and overwhelmed. FAANG is also explicitly called out as a Rule3 violation\n\nSo of the top 10 posts in the last year, 6 of them seem to be Rule 3 violations as well (but not deleted). As someone who was a different engineer in my first career (though not a chemical engineer, as the sidebar lists), all those threads apply just as well to my prior engineering discipline. And by the definition of Rule3 seems they should have been deleted.\n\nThis is just an example of the inconsistency in how it's applied.\n\nAn additional and even more fundamental problem with how Rule 3 is applied is that the further you go in your career, the less specific to \"tech\" and the more intermingled tech/people/processes are for the types of questions/discussions you have. And these are the types of discussions which get deleted with some regularity here. The impact here is it feels like r/ExperiencedDevs is more like r/MidlevelDevs because essentially everything in the staff+ category and much of the senior+ category has a lot of overlap with other engineering disciplines and end up deleted.\n\nThe specific changes I want to see:\n\n1. lessen enforcement of Rule 3 when it's pretty clearly a discussion that is beneficial and related to SWEs. I would not be in favor of deleting any of the above, for example, even though I believe they are current Rule 3 violations. Because even though the advice is basically generic engineering advice, it's still beneficial for devs.\n2. Remove the \"general rule of thumb\" section from the sidebar.\n3. Clarify somewhere what this means: \"notably benefit from the participation of experienced developers\" because most of the Rule 3 violations I comment in seem to fully fit this. So either remove this text entirely or define more what this means.\n\n",
    "score": 164,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1idqdxs/meta_lets_talk_about_rule_3_no_general_career/",
    "created_at": "2025-01-30T16:08:38.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1nxnvqk",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "How common is it for managers to act more like secretaries?",
    "text": "In my organization, the engineering managers function more like secretaries. They book meetings, handle logistical issues, conduct initial interviews with new hires (nothing technical), and set our salaries. The managers I’ve had have never had a good idea of what I’m actually doing. They don’t know much about the product and have probably never looked at the code. In my experience, whenever they try to make decisions on their own, things tend to go awry.\n\nIs this common? I feel like it would be much better to actively encourage engineers within the teams to take on managerial roles while still doing some of the team’s actual work. But about 4 out of 5 manager hires in my company come from outside. Maybe it’s a Sweden thing.",
    "score": 163,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1nxnvqk/how_common_is_it_for_managers_to_act_more_like/",
    "created_at": "2025-10-04T07:46:43.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1plps1i",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Two offers, how much does tech stack matter?",
    "text": "Company A: 95k TC, fully in person working with Python, AWS, dockers, K8s. 25 minute commute\n\nCompany B: 100k TC, fully remote, Java 21 + spring and AWS (some migration from on-premises)\n\nI would like the remote offer but I wonder if I’d be hurting myself long term taking that. K8s seems harder to learn alone and so many postings have it listed. End goal is to work remote.\n\nHow easy is it to switch from Java enterprise dev later? The Java market seems very saturated… thoughts?",
    "score": 162,
    "url": "https://reddit.com/r/cscareerquestions/comments/1plps1i/two_offers_how_much_does_tech_stack_matter/",
    "created_at": "2025-12-13T16:42:56.000Z",
    "num_comments": 104
  },
  {
    "id": "reddit-1jb9e9i",
    "subreddit": "cscareerquestions",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Amazon vs DoorDash New Grad",
    "text": "I recently received an offer from DoorDash and Amazon (AWS) for new grad.\n\nAmazon:\n- AWS, Team TBD\n- Location: Seattle \n- TC: ~$175k first year\n\nDoorDash\n- Team TBD, I give preferences later \n- Location: SF\n- TC: ~$200k first year\n\nAny advice on how career advancement/growth, job security, culture, etc. looks like at both companies would be great. I haven't heard the best things about WLB for both but it would be interesting to compare the two. I do not have info on what teams I would be joining at either company at the moment. Thank you!\n",
    "score": 161,
    "url": "https://reddit.com/r/cscareerquestions/comments/1jb9e9i/amazon_vs_doordash_new_grad/",
    "created_at": "2025-03-14T17:27:12.000Z",
    "num_comments": 92
  },
  {
    "id": "reddit-1kk3ydg",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "How are people over 50 finding it changing jobs?",
    "text": "I moved country so had to take a step back in my career, UK (outside London I mean) had much less options and salary than New York. Have a reasonable role but probably have to change roles in a few years and wondering how those over 50 find that process? ",
    "score": 158,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1kk3ydg/how_are_people_over_50_finding_it_changing_jobs/",
    "created_at": "2025-05-11T15:42:49.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1outkzi",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Is the dream of moving to the US for big tech dead?",
    "text": "28M. 5 YOE. I work for an American company while living in Canada. When I joined it wasn’t terribly uncommon for them to do TN Visa’s if you went from Junior -&gt; Senior internally. Fast forward to today, they slashed all salaries, never do relocations and there’s lots of immigration uncertainty in the US. I now want to jump ship but am nervous about the market.\n\nHow hard is it to get a role/relocate to the US (Seattle, SF, Austin, NY) with 5 YOE?",
    "score": 148,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1outkzi/is_the_dream_of_moving_to_the_us_for_big_tech_dead/",
    "created_at": "2025-11-12T02:46:06.000Z",
    "num_comments": 120
  },
  {
    "id": "reddit-1mgx00l",
    "subreddit": "ExperiencedDevs",
    "soc_codes": [
      "15-1252",
      "15-1253"
    ],
    "title": "Company getting acquihired. What should I expect as a tech lead?",
    "text": "Our small (-25 person) startup is getting acquired by a much larger late stage startup in a similar space. We’re a strategic acquisition as we focus on a smaller but growing niche. \n\nI lead the technical side of a product that is core to the value proposition of the company and I am identified as a key person for integration into the acquirer.\n\nBeing at the acquiring company in a former role, I saw that the exec team of the acquired usually gets Director/VP titles, but what happens to the ICs?\n\nI’m currently making below market rate and would probably fetch 1.3-1.5x my salary if I were to go for roles at larger companies. Should I expect anything beyond a salary bump (maybe not to 1.5x)? Maybe a signing bonus conditional on staying for a year, etc.?\n\nTrying to understand what a “fair” offer would be. “Just” getting another normal employment contract doesn’t seem very appealing to me, and I’d almost rather start my own company in the same space if I felt the offer wasn’t very good.",
    "score": 144,
    "url": "https://reddit.com/r/ExperiencedDevs/comments/1mgx00l/company_getting_acquihired_what_should_i_expect/",
    "created_at": "2025-08-03T22:47:55.000Z",
    "num_comments": 75
  }
]