[
  {
    "id": "reddit-1pbxbri",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "Snow Bear - 11,000 Drawings",
    "text": "Hey everyone just wanted to share this here. I spent the last 3 years working on this(although I started on it years before that) and the last year taking it to festivals. \n\nHappy to now be able to share it with everyone. Approximately 11,000 Drawings. Animated in TVPaint. I painted the Backgrounds in Photoshop. \n\nLink is here https://www.youtube.com/watch?v=xOXolSQcEb4",
    "score": 76023,
    "url": "https://reddit.com/r/animation/comments/1pbxbri/snow_bear_11000_drawings/",
    "created_at": "2025-12-02T03:03:48.000Z",
    "num_comments": 1732
  },
  {
    "id": "reddit-1mr2w0m",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "Coco from Witch Hat Atelier",
    "text": "I’m new to animation! I decided to go with a short loop for my first finished piece. \nThe most fun part of the process was doing the shadows and lighting by far. Though inbetweening the lineart was a close second; it’s really satisfying. \n\nAnywho, the source material is a very lovely manga, you guys should check it out! \n\n\n",
    "score": 6217,
    "url": "https://reddit.com/r/animation/comments/1mr2w0m/coco_from_witch_hat_atelier/",
    "created_at": "2025-08-15T16:32:14.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1ptojvg",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "Check out this amazing shapeshifting animation from Riverskin, an upcoming short film by Clément Doranlo",
    "text": "Full breakdown is coming soon: [https://80.lv/articles/watch-this-awesome-fluid-shapeshifting-creature-animation](https://80.lv/articles/watch-this-awesome-fluid-shapeshifting-creature-animation)",
    "score": 6100,
    "url": "https://reddit.com/r/animation/comments/1ptojvg/check_out_this_amazing_shapeshifting_animation/",
    "created_at": "2025-12-23T08:10:03.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1nfd2ji",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "This is how Steam can ruin more than 10 years of your work",
    "text": "More than 10 years ago we started creating Planet Centauri, a 2D sandbox with terraria as main inspiration.\n\nWe released the EA many years ago and this is our start just before the 1.0 release :\n\n103 400 units solds  \n138 675 Wishlist\n\nthe sells seem incredible but it's not with so many years behind, when you work for 10 years and have to paid many people helping you with the ten of thousands of monsters frames animations and thousands of pixel art items, you don't have much left on your wallet at the end.\n\nSo we were eager for the release of 1.0 because with so many wishlists, the game's visibility would be good, we would appear in the new and trending categories due to sales, etc...\n\nThe 1.0 happen in december 2024... we sold... 581 units in 5 days.\n\nThe game didn't even appear on page 2; we were invisible; the release was a total flop. And we never understood why until today.\n\nWe just received this mail from Steam \n\n\\------------------------------------------  \nSteam Launch Wishlist Email Issue\n\nHi there, We found a bug that impacted a very small number of game releases (less than 100 since 2015) where wishlist email notifications for the launch of a game were not sent. Unfortunately your game Planet Centauri was among those included. We intend for this feature to work for every game and we’re inviting you to a Daily Deal as a way to help make up for lost visibility from your launch day.  \n\\------------------------------------------\n\nIt's incredible to win the lottery like this: 100 games impacted in 10 years out of the 86,000 games on Steam. And to reward you, we're giving you 24-hour visibility (which is nothing special; there are 6 slots available for this visibility every day of the year for various Steam invitations).\n\nI don't even have the strength to be angry. We've been so frustrated, disgusted, and in total confusion . Now we know, we understand better, it's unfair, and we can't change anything. We've started a second project because it's financially impossible to continue patching our game, and we're moving forward, because it's the only thing to do.\n\nThis article was my way of expressing my anger, I guess, but also to see all the problems that a platform holding 99% of the PC gaming market can cause when the cogs don't work as they should.\n\nHave a nice day everyone, may luck be better to you",
    "score": 5741,
    "url": "https://reddit.com/r/gamedev/comments/1nfd2ji/this_is_how_steam_can_ruin_more_than_10_years_of/",
    "created_at": "2025-09-12T19:55:02.000Z",
    "num_comments": 554
  },
  {
    "id": "reddit-1mra07c",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I joined PirateSoftware's recent game jam, and I highly recommend against participating in future ones",
    "text": "about 3 weeks ago, I thought \"fuck it, why not join the pirate jam 17\". yeah, the drama wasn't great, but it's a jam, so I may as well.\n\noh boy. what a mistake.\n\nFirstly, community voting was turned off. This is standard for game jams - members of the community play and rank games, and in return they get a boost in visibility. Not so in pirate software's community. This feature was entirely disabled - nobody was able to decide community ranking except for the mods.\n\nJudging was entirely decided by pirate's mod team. and oh boy, they made a *very* strange set of decisions. They admitted to spending only 5 minutes per game, and selected a list comprised of many amateurish games.\n\n**PirateJam 17 Winners!**\n1. https://mauiimakesgames.itch.io/one-pop-planet\n2. https://scheifen.itch.io/bright-veil\n3. https://malfet.itch.io/square-one\n4. https://neqdos.itch.io/world-break\n5. https://jcanabal.itch.io/only-one-dollar\n6. https://moonkey1.itch.io/staff-only-2\n7. https://voirax.itch.io/press-one-to-confirm\n8. https://yourfavoritedm.itch.io/one-last-job\n9. https://fechobab.itch.io/just-one-1-bit-game\n10. https://gogoio123.itch.io/one-hp\n\nOf the top-10, several of these games were *very poor*, Inarguably undeserving if the position. #2, 5, and 9 are all barely playable, and #1 and 8 are middling. Much better games were snubbed to promote these low quality entries; the jam had no shortage of talent, but the the top-10 certainly did.\n\nFurthermore, when I left my post-jam writeups on game #2, it was deleted by the moderators of the jam and I was permanently banned from all pirate software spaces. The review is gone, but the reply from the developer remains, and it seemed anything but offended. you can see for yourself.\n\nThe jam is corrupt. I don't know what metrics were used to determine the winners, but they are completely incomprehensible. \n\nTL:DR \n- pirate software's game jam was poorly run\n- all games were only played for 5 minutes\n- the majority of winners spots were taken by *very* weak games\n- significantly better games got no recognition \n- all of this was decided by the mods without transparency \n- any criticism of the winners results in a ban \n\n\nEDIT: there seems to be some fuckery with linking to games I actually liked. I haven't played every game in the jam, but some of my favourite entries were probably \n\nhttps://itch.io/jam/pirate/rate/3746553 (number 6 best game, my pick for #1)\n\nhttps://itch.io/jam/pirate/rate/3758456\n\nhttps://itch.io/jam/pirate/rate/3765454\n\nhttps://itch.io/jam/pirate/rate/3737529\n\nhttps://itch.io/jam/pirate/rate/3747515\n",
    "score": 4491,
    "url": "https://reddit.com/r/gamedev/comments/1mra07c/i_joined_piratesoftwares_recent_game_jam_and_i/",
    "created_at": "2025-08-15T20:52:37.000Z",
    "num_comments": 595
  },
  {
    "id": "reddit-1l32utm",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Do not, i repeat !!DO NOT!! use Arial in your projects. It can become very nasty for you",
    "text": "So we received this official memo: \n\n&gt; We’ve just received formal communication from Monotype Limited regarding the licensing of several fonts, including but not limited to:\n\n&gt;* Agency FB,\n&gt;* Agency FB Bold,\n&gt;* **Arial**,\n&gt;* Constantia (Regular, Bold, Italic, Bold Italic),\n&gt;* Digital Dream Fat,\n&gt;* Farao / Farao Bold,\n&gt;* HemiHeadRg-BoldItalic,\n\n&gt;Important: While fonts like Arial may be bundled with Windows, they are not considered native fonts within Unreal Engine or Unity. According to Monotype, even using Arial in your project requires a paid license, with fees reportedly reaching ~€20,000 per year of usage for developers, publishers, or any party involved.      \n\nSo... yeah. If you like your project or your finances, DO NOT USE ARIAL IN YOUR PROJECTS. Unless you want to pay hefty licensing fees\n\nEdit: Dont make it personal. Im not affected by this in any way. Im always using free open fonts and checks my assets licences. This post was made for people who are using Arial in their projects. I just want people be aware about it and avoid possible unpleasant situations. Thank you",
    "score": 4366,
    "url": "https://reddit.com/r/gamedev/comments/1l32utm/do_not_i_repeat_do_not_use_arial_in_your_projects/",
    "created_at": "2025-06-04T11:13:10.000Z",
    "num_comments": 439
  },
  {
    "id": "reddit-1m85zq8",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Op-Ed: The Same Fucks Who Fucked Steam Just Fucked Itch.io",
    "text": "TLDR\nItch.io shadowbanned all NSFW games after pressure from payment processors triggered by anti-porn group Collective Shout.\n\nAnother platform folds to moral panic and money threats… thousands of creators screwed, again.\n\n…\n\nFuck. \n\nFuck fuck fuck.\n\nThis time, the Fucks in question are Collective Shout, an Australian moralist outfit hellbent on policing what fucking adults can see, play, and create.  \n\nThey didn’t need to petition governments or weaponize law enforcement… they just went straight to the payment processors.\n\nSuper Effective.\n\nThey cried “rape games” (which, I mean... yeah) and “child abuse” (which… I guess… yeah) and aimed their sights at Visa, MasterCard, and PayPal… who immediately clutched their pearls and threatened to cut ties. \n\nItch.io, bastion of weirdness and freedom (NSFW and otherwise), panicked and pulled the fucking plug. De-listings and shadow bans for every deviant.\n\nAdult content? \nDeindexed. \nHidden from browse and search. \n\nOne day it was there… the next, it wasn’t.\n\nNo warning. \nNo appeal. \nNo nuance. \n\nJust \"Fuck you people and your perverted creations, we can't lose Visa and Mastercard\".\n\nYou don’t need to ban content if you can just strangle the creators’ ability to get paid. \n\nYou don't need to win the argument if you simply disrupt payment processing.\n\nItch.io is obligated to \"protect the platform\" at the expense of the creators. \n\n“We must prioritize our relationship with payment partners… this is a time critical moment…” \n\nTranslation: we bent the knee, hard because money trumps all.\n\nItch.io isn't (or wasn't) just another store. \n\nIt is (or was?) the space for messy, marginalized, experimental, erotic, queer, and transgressive game devs. Games about consent, kink, power, identity… all the things that won't fit neatly on a Nintendo eShop shelf. It was raw. It was weird. It was fucking alive.\n\nAnd now it’s been sanitized by a bunch of moralizing fucks \n\nCreators: YOU HAVE BEEN BETRAYED. \n\nPuritanical or Perverse, YOUR work built the ecosystem. They built their name and their position in the marketplace by literally using your work. \n\nNow your work has been deemed an inconvenience by a platform because interlopers injected themselves into a conversation and a commerce and a culture they have no part in, other than to moralize. Developers are being quietly shoved into a dark corner because some self-righteous fucks threw a tantrum.\n\nItch.io just showed the world that the rebel indie storefront will literally betray an entire group of creators if some assholes game the system.\n\nWake the fuck up. \n\nThis won’t stop here. IT NEVER DOES. \n\nThe weapons used to erased NSFW games today will be purposed tomorrow to erase whatever else the fucks decide is “inappropriate.” \n\nThey don't have to be right. \nThey don't have to be consistent. \nThey don't even have to make sense.\n\nThey just have to threaten the money.\n\nThese FUCKS are just getting started. ",
    "score": 3894,
    "url": "https://reddit.com/r/gamedev/comments/1m85zq8/oped_the_same_fucks_who_fucked_steam_just_fucked/",
    "created_at": "2025-07-24T14:32:06.000Z",
    "num_comments": 901
  },
  {
    "id": "reddit-1pmo8h5",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Expedition 33 devs attempts to join the indie scene are harmful",
    "text": "I don't want this post to look like hate, especially after the TGA, but I think it's important to talk studios attempts to stick into the indie scene. It's actually hurts indie itself.\n\nNote: I played the game and I like it. And the devs are great for managing to build something like this, but...\n\nFor the last few months there’s been constant praise of the people from Sandfall Interactive. I have no problem with that. The nuances appear when people start trying to turn this into a \"lesson\" or draw wrong conclusions from it. For example:\n- \"Wow, a team of about 30 people made this game!\". This has already been discussed a bunch of times. A lot of key people in terms of art and animation were outsourced. Pretending they don't exist is...questionable.\n- \"They're true indie, they even recruited the team on Reddit!\". Only 2 persons on the team came from Reddit.\n- \"They've got a small indie publisher, Kepler Interactive\". Yeah, if you conveniently forget at least $120 million in investment from NetEase.\n- The recent nonsense about how they \"learned to code from YouTube\" isn’t even worth commenting on.\n- \"Their budget is only 10 million!\". Well...that's because they didn't include actor fees in that number, since \"the publisher covered that part\" (and some other things). Handy, huh?\n\nI don't understand why they're playing this game of half-truths and omissions, given that people already like them without all that.",
    "score": 3671,
    "url": "https://reddit.com/r/gamedev/comments/1pmo8h5/expedition_33_devs_attempts_to_join_the_indie/",
    "created_at": "2025-12-14T20:34:26.000Z",
    "num_comments": 155
  },
  {
    "id": "reddit-1m7qex3",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "itch.io seems to have straight up wiped ALL adult games on the platform shadow banning them. Itch is a major traffic driver for us NSFW devs. More people lost their income today... :( First steam now itch",
    "text": "RIP NSFW DEVS :(\n\n  \nUPDATE: We also noticed games getting completely removed now, not just shadow banned.\n\n\nItch official update: https://itch.io/updates/update-on-nsfw-content\n\n",
    "score": 3465,
    "url": "https://reddit.com/r/gamedev/comments/1m7qex3/itchio_seems_to_have_straight_up_wiped_all_adult/",
    "created_at": "2025-07-24T00:46:55.000Z",
    "num_comments": 723
  },
  {
    "id": "reddit-1ix993g",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "A big scam company just stole my whole game from steam, ripped it and sold it as their own on Playstation and other consoles.",
    "text": "Hey guys,\n\n[UPDATE HERE](https://www.reddit.com/r/PS5/comments/1j3hbhv/a_big_scam_company_just_stole_my_whole_game_from)\n\nHope everyone is doing well. I posted this also on r/PS5 and [Twitter](https://x.com/steelkrill/status/1895142098644746704) to hopefully bring more light to the situation. So recently I have released [The Backrooms 1998](https://store.steampowered.com/app/1985930/The_Backrooms_1998__Found_Footage_Survival_Horror_Game/) on Playstation, Xbox, Steam and Nintendo switch. I was pretty happy with myself and all that, you know? Been in development for quite a while and being a solo developer and having my game finally on consoles is always awesome to see haha.\n\nAnyway .. Someone commented on one of my videos and violently (big thanks to him!) asked me why am I releasing the same game with it's name changed on consoles and I got a little bit confused. I explained that this game was never on consoles before and I have just released it now and they provided a link to a video - and behold ... long story short this company called \"COOL DEVS S.R.L\" stole my whole game, ripped it, pasted some bad AI crap on it as a cover, literally made a BAD version of it and just published it on consoles and sold it to trick players into buying it.\n\nThey stole the whole game as it is alongside the music, sounds, voice lines and everything else. They only changed the monster and the picture on the frame lol..\n\nVideo Link to the fake game: [https://youtu.be/VJr6rL-geTU?t=745](https://youtu.be/VJr6rL-geTU?t=745)\n\nVideo Link to my game: [https://youtu.be/7tWYhFfXNBM?t=561](https://youtu.be/7tWYhFfXNBM?t=561)\n\nAlso, this is a link to their Nintendo Page so you can see what kind of \"games\" they do: [https://www.nintendo.com/us/search/#cat=gme&amp;f=softwarePublisher&amp;softwarePublisher=COOL%20DEVS](https://www.nintendo.com/us/search/#cat=gme&amp;f=softwarePublisher&amp;softwarePublisher=COOL%20DEVS)\n\n**EDIT:** For anyone that's not seeing a difference, sorry I should have provided [these images comparation ](https://imgur.com/gallery/big-scam-company-just-stole-whole-game-from-steam-ripped-sold-as-own-on-playstation-other-consoles-MRjOZTN)a bit earlier. The reason it feels a bit different is because post processing, and because they made a worst version of it but everything is literally stolen.\n\n**EDIT 2:** Doing further research and it seems they have also a couple of posts [here](https://www.reddit.com/r/PS5/comments/1h4stst/worlds_shadiest_developer_strikes_yet_again/) and are known in the PS5 community. One mentioned is the company that actually approached me. I think they are all basically the same one, *but I am not going to point any fingers.*\n\n**EDIT 3 (Latest):** Thank you all for your kind comments, help and everything else. I am currently still seeing what can be done and in contact with my video game lawyer so I will try to keep you updated. We have already submitted a DMCA and working with my publisher on this one - and for now the game is taken down from PlayStation and Xbox but it's still up on Nintendo Switch. In the meantime ... If you can report [the fake game](https://www.nintendo.com/us/store/products/backrooms-horror-escape-switch/), that would be awesome. If you bought it by mistake, please see if you can refund it. If you can share this, that would be awesome as well so more people will know about this and not get tricked. I will try my best in posting this to other subreddits to make more people aware. From what I uncovered, this is a whole big scam where they open a bunch of companies (mostly around the S.R.L) and upload fake games/scam games in order to trick buyers to buy them. Heck, I don't even want the money they stole I just want them to refund them back to the buyers if we can somehow catch them. This ain't right and I think more people needs to be aware of this. It seems they have additional companies (4, 5 or maybe even 6+) that are maybe tied to this scam... This is not fair on developers and not fair on the players. I still can't believe that someone as big as Sony, Xbox and Nintendo are letting this slide. It's sad.\n\nThe funny thing is I saw this game before on the store and I LITERALLY spoke about how these scam devs are mostly stealing popular games on steam and uploading them consoles .. and I had no idea it was one of my own game that they stole. I do not understand how consoles platforms allow these type of scams going on and rub it under the carpet. This is hurtful to smaller indie developers, and hurtful to players that gets scammed by buying these games thinking they are real games.\n\nAlso, they are doing this with other games.\n\nWe have already working on finding out more info about them, and submitted a DMCA request to remove the game off the stores, right now it's down from PlayStation and Xbox but still up on the Nintendo store unfortunately. Hopefully they will also remove it soon as well.\n\n**Another important detail that may have ties or not:** I got contacted last year by a VERY sketchy publisher wanting to publish my game on consoles. I declined. They were sketchy and after checking their games they had very similar games to this fake company. They are both registered in S.R.L and they got banned from consoles recently.\n\nCould this be the same guys? Stole the game right after I refused to publish it with them. Not sure, but hopefully we can find out.",
    "score": 2860,
    "url": "https://reddit.com/r/gamedev/comments/1ix993g/a_big_scam_company_just_stole_my_whole_game_from/",
    "created_at": "2025-02-24T18:35:10.000Z",
    "num_comments": 325
  },
  {
    "id": "reddit-1mafnwp",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Collective shout is trying to internationally destroy games and things classed as “NSFW”",
    "text": "As you may know or not know the collective shout organisation is an Australian “feminist” organisation that has pushed platforms like steam and itch.io to delist their nsfw games. In doing so itch.io completely delisted all their nsfw games which has pretty much ruined some devs livelihood and a way of income. \n\nI had been doing some digging and managed to find out the Collective Shout is linked to a organisation here in the Uk known as ceaseUK as they both signed to open payment process. \n\nBoth Melinda Tankard Reist who is the movement director for Collective shout and Gemma Kelly who is the  head of Policy and Public affairs for ceaseUK are both on the letter. \n\nJust recently ceaseUK managed to push a law into the uk which regulates all NSFW content on all platforms and has to have the user either take pictures or use a id to verify they are of age to access the NSFW content including subreddits on substance abuse help or sexual abuse help subreddit.\n\nIf you are reading up until this point please know that this is no longer attack on only gamers or game devs, these people are trying to regulate the entire internet to their liking ",
    "score": 2853,
    "url": "https://reddit.com/r/gamedev/comments/1mafnwp/collective_shout_is_trying_to_internationally/",
    "created_at": "2025-07-27T06:52:17.000Z",
    "num_comments": 400
  },
  {
    "id": "reddit-1i4baw4",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "How a friendly debate saved League of Legends millions in server costs",
    "text": "Hi everyone,\n\nI'm Robin, the tech director for League of Legends. I wanted to share a dev blog from one of Riot's principal software engineers, Tomasz Mozolewski, that might interest you all.\n\nThis started as a casual debate between game tech (me) and services tech (Tomasz) over a pint of Guinness. We were discussing best server selection algorithms. What began as friendly banter ended up saving League millions of dollars annually—with just a few lines of code.\n\nThe result? A simulation proved that neither of our initial assumptions were correct.\n\nIf you’re curious about the technical details or have any questions, I’m happy to chat!\n\n[Riot Tech Blog: Improving performance by Streamlining League's server selection](https://www.riotgames.com/en/news/tech-blog-cpu-usage?fbclid=IwZXh0bgNhZW0CMTEAAR0YsTeRilrLHYn29VUNRLaRkCPZtGxD0Q5gcEop0NKj2pvlMAGjiPV-KWs_aem_VkPwWmRsvWHwuh4nqxNKsg)",
    "score": 2479,
    "url": "https://reddit.com/r/gamedev/comments/1i4baw4/how_a_friendly_debate_saved_league_of_legends/",
    "created_at": "2025-01-18T16:33:20.000Z",
    "num_comments": 139
  },
  {
    "id": "reddit-1j3zr6n",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Someone stole our game from itch.io, renamed it, and now it’s #1 in the App Store - what can we do?",
    "text": "Hi everyone,\n\nWe’re a small indie team, and we recently participated in Brackeys Game Jam 2025.1, where we made a game called Diapers, Please!. We released it on [itch.io](http://itch.io), and to our surprise, the game started getting some organic attention, especially from TikTok.\n\nBut today, we discovered that someone literally stole our game, wrapped it in a WebView, uploaded it to the App Store under a fake name (\"My Baby Or Not!\"), and now it’s sitting at **#1 in the Casual category in several countries,** all without our permission. There’s already a TikTok with the fake game name that has over **1.4 million views**.\n\n* They didn’t change the assets or gameplay at all - it’s a direct copy from itch.io.\n* They’re making money from it, while we have zero control.\n* We’ve already filed a DMCA with Apple [here](https://www.apple.com/legal/intellectual-property/dispute-forms/index.html), but we’re wondering: **what else can we do and will Apple be on our side?**\n\nHas anyone here dealt with this kind of situation before? We’d appreciate any advice or insights.\n\nAlso, if anyone’s curious, here’s the real game: [https://voltekplay.itch.io/diapers-please](https://voltekplay.itch.io/diapers-please)\n\nThanks in advance for any advice and for letting us vent.\n\n**\\[March 8 UPDATE\\] Our Steam page is now live! If you’re interested in the game or want to support us, please consider adding it to your wishlist!** [https://store.steampowered.com/app/3572310/Ministry\\_of\\_Order](https://store.steampowered.com/app/3572310/Ministry_of_Order)\n\n\\[UPDATE 1\\] Thief made game paid at app store. Apple contacted me that they just sent my complaince directly to thief and \"Apple encourages the parties to a dispute to work directly with one another to resolve the claim.\"\n\n\\[UPDATE 2\\] Thief's game page reached #1 in top paid games of appstore. Apple don't wont to respond to it.\n\n\\[UPDATE 3\\] Lawyers told us that there is no chance to pursue the thief in the court, the best result for us can be that apple will delete thiefs game and account.\n\n\\[UPDATE 4\\] Thief removed most popular paid clone from app store! Also, he remove illegal copy of Kiosk game too! But his account still online and apple haven't responded anything about deleting it. Bad news - more clones UP in app store, atm we have found 3 of them (thnx to you guys for sending me DMs).\n\n\\[FINAL UPDATE\\] All copies that we found so far was removed, Apple answered to me that \"We can confirm that the following app was removed from all territories. We trust this resolves your concerns.\" But thiefs accounts is still alive and those who sold our game for 60k$ will receive that money, so I continue my dispute with Apple.\n\nCurrently removed stolen copies:\n\n* [https://apps.apple.com/us/app/diapers-please-game/id6742812517](https://apps.apple.com/us/app/diapers-please-game/id6742812517)\n* [https://apps.apple.com/us/app/thats-my-baby-or-not-game-3d/id6738090723](https://apps.apple.com/us/app/thats-my-baby-or-not-game-3d/id6738090723)\n* [https://apps.apple.com/us/app/my-baby-or-not/id6742455066](https://apps.apple.com/us/app/my-baby-or-not/id6742455066)\n* [https://apps.apple.com/us/app/diapers-please/id6741484140](https://apps.apple.com/us/app/diapers-please/id6741484140)\n\nThiefs accounts:\n\n* [https://apps.apple.com/lk/developer/marwane-benyssef/id1758988688](https://apps.apple.com/lk/developer/marwane-benyssef/id1758988688)\n* [https://apps.apple.com/us/developer/tasawar-hussain/id1667284631](https://apps.apple.com/us/developer/tasawar-hussain/id1667284631)\n* [https://apps.apple.com/us/developer/sawsan-andrew/id1779282000](https://apps.apple.com/us/developer/sawsan-andrew/id1779282000)\n* [https://apps.apple.com/us/developer/fouad-santhosh/id1800660851](https://apps.apple.com/us/developer/fouad-santhosh/id1800660851)",
    "score": 2471,
    "url": "https://reddit.com/r/gamedev/comments/1j3zr6n/someone_stole_our_game_from_itchio_renamed_it_and/",
    "created_at": "2025-03-05T10:03:12.000Z",
    "num_comments": 329
  },
  {
    "id": "reddit-1ipbtts",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I watched someone play my game for 2 hours on Twitch",
    "text": "Just an absolutely surreal experience.\n\nFirst off, getting feedback from the streamer and the chat was super helpful (both positive and negative). It was also incredibly insightful to watch someone casually play the game while going in completely blind.\n\nBut above all, it just feels *so validating* to know that someone chose to take two hours out of their day to engage with something that I made - even more so because I haven't really promoted my game (outside of some posts on Bluesky). I've barely cracked 300 wishlists, so the fact that a stranger saw the potential in my work based solely off the work itself - no marketing, no hype, just that first impression... just unreal.\n\nSorry for the ramble. I know I'm not a professional developer, only some hobbyist, but the attention-craving artist within me really needed to do whatever the reverse of venting is\n\nedit: here's a link for the people asking about the game, I wasn't sure if it was against the rules or not: https://store.steampowered.com/app/2873860/",
    "score": 2415,
    "url": "https://reddit.com/r/gamedev/comments/1ipbtts/i_watched_someone_play_my_game_for_2_hours_on/",
    "created_at": "2025-02-14T14:31:29.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1k2vsgx",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "By pure luck, the first person to play my game was a huge twitch streamer and I sh*t my pants",
    "text": "Some time ago, I was working on my game while watching the stream of my favorite German Twitch streamer, Bonjwa, as I always do. There were about 7k live viewers. He had just finished a placement for Final Fantasy and had some downtime before the next one. I had just released an early demo for my Serious Sam-like shooter, so I casually wrote in the chat, \"Hey, check out the game Slyders! :D\"\n\nThis is what happened next: [https://youtu.be/k-TgbNc\\_9ps?t=79](https://youtu.be/k-TgbNc_9ps?t=79)\n\nBy pure chance, he actually read my post and searched for the game on Steam. I think my heart stopped at that moment because no one, except for a few guys on r/DestroyMyGame, had played my game before. He watched just a couple of seconds of the trailer and burst out laughing. I wasn't sure if it was because he thought it looked trashy or genuinely fun.\n\nThen, to my absolute shock, he downloaded and started the game. At that moment, I was sitting on the edge of my seat, and then I ran out of my room, probably out of embarrassment. What if he finds a huge bug? What if he just laughs at the crappy game and at this delusional developer?\n\nEventually, I stood in the doorway and watched the stream from about 4 meters away. Thankfully, everything worked fine at the beginning, and he started to enjoy the game. After a couple of minutes, he actually began laughing with joy, he was REALLY into it. He cheered as he blasted and shot his way through the map and even made comments about how much he loves the game.\n\nHe played through the first map and even started another run, ultimately playing for about 40 minutes, even though the demo only had 15 minutes of actual playtime! He did encounter an annoying UI bug after some time, but it didn’t matter.\n\nI was so excited when the stream ended that I couldn't sleep that night. I ended up walking through the city until morning. \n\nIn terms of wishlist numbers, it was a boost, though nothing super spectacular. It added about 350 wishlists.\n\nAnyway, for me, this was the first time someone played my game on stream and it wasn’t just anyone, it was my favorite streamer, and he loved my game. That meant a lot to me :D\n\nThe Slyders demo looks a lot different now, I went into a more cartoonish so if you want to check it out, here you go: [Slyders on Steam](https://store.steampowered.com/app/2607870/Slyders/)",
    "score": 2400,
    "url": "https://reddit.com/r/gamedev/comments/1k2vsgx/by_pure_luck_the_first_person_to_play_my_game_was/",
    "created_at": "2025-04-19T13:03:22.000Z",
    "num_comments": 105
  },
  {
    "id": "reddit-1md3zw7",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Itch.io is 'actively reaching out to other payment processors' after pressure from credit card companies to curtail NSFW content, and that compared to Valve, it has 'limited ability to push back'",
    "text": "",
    "score": 2160,
    "url": "https://reddit.com/r/gamedev/comments/1md3zw7/itchio_is_actively_reaching_out_to_other_payment/",
    "created_at": "2025-07-30T11:24:52.000Z",
    "num_comments": 341
  },
  {
    "id": "reddit-1omg0yp",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I hate gamedev youtubers",
    "text": "Not just any gamedev youtubers, but the ones who made like 3 games and a total revenue of like $10k.\n\nThey be talking about how to find succes as a game developer and what the best genres are, like if you think all of this is actually good advice then why don't you use your own advice.\n\nI btw love small gamedev youtubers who share their journey regardless of how much money they have made. But if you're a gamedev youtuber talking about how to find succes and what to do, I better see you making at least money to pay basic living expenses.",
    "score": 1974,
    "url": "https://reddit.com/r/gamedev/comments/1omg0yp/i_hate_gamedev_youtubers/",
    "created_at": "2025-11-02T12:29:47.000Z",
    "num_comments": 490
  },
  {
    "id": "reddit-1loa9wx",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "The real cost of playing a video game isn't money, it's time.",
    "text": "I saw a post talking about how little people value the work that goes into video games, that a video game that took a whole team hundreds of hours of work costs as much as a coffee on sale, but people still are arguing about whether it's worth buying.  \n  \nBut this is argument is a little misleading, I think I hear this quite often about games \"it's so cheap, it's less than &lt;this other thing you commonly buy&gt;\", but the thing is, price is often not what's actually causing people to avoid buying the game. It's time.  \n   \nImagine you buy a cup of coffee, and it took you 5 hours to drink it, and at the end of it you felt more hungry/tired than when you started.  \nthat's what playing a bad video game is like.  \n  \nwhen you buy food you are guaranteed to get some value out of it, even a movie can be just passively consumed in the background, but video games *demand* your time.  \n  \nSo the standards are always going to be way higher. But this also means that if a game is good and worth playing and has good word of mouth. You can probably get away with charging a decent price.",
    "score": 1946,
    "url": "https://reddit.com/r/gamedev/comments/1loa9wx/the_real_cost_of_playing_a_video_game_isnt_money/",
    "created_at": "2025-06-30T15:20:17.000Z",
    "num_comments": 185
  },
  {
    "id": "reddit-1jtrhku",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I've made over 1,280 input icons for use in your games! (public domain, CC0)",
    "text": "More than a year ago I started creating icons attempting to make the biggest and most up-to-date package available. After several updates my package now includes and covers;\n\n- Xbox 360, Xbox One &amp; Xbox Series\n- PlayStation® 1 – 5\n- Steam Deck\n- Steam Controller\n- Nintendo Switch\n- Nintendo Switch 2\n- Nintendo Wii\n- Nintendo Wii U\n- Nintendo Gamecube\n- Playdate\n- Keyboard &amp; mouse\n- Touch gestures\n- Generic controls\n- Flairs\n\nEach of the included icons come in SVG format, two PNG sizes, in two spritesheet sizes *(including XML)* and two fonts *(TTF and OTF)* with character map! The package also includes an overview, and best practices on using the icons. Best of all, it's completely free. No charge, no need to credit - just use them in your project without any worry.\n\n**Download:** &lt;https://kenney.nl/assets/input-prompts&gt;\n\nI'd love feedback, or ideas on how to make the package even better!",
    "score": 1911,
    "url": "https://reddit.com/r/gamedev/comments/1jtrhku/ive_made_over_1280_input_icons_for_use_in_your/",
    "created_at": "2025-04-07T17:49:37.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1m9wqns",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Don't let Collective Shout win !",
    "text": "A group of 10 Karens in Australia have just screwed up the whole gaming industry. Unbelievable... Next will be LGBT content, violent content... I imagine it's already ruined, even for GTA 6, with its sexual content...\n\nAll NSFW content from steam and Itchio is removed.\n\nWe need to put pressure on VISA and Mastercard too.\n\nSign the petitions: [https://www.change.org/p/tell-mastercard-visa-activist-groups-stop-controlling-what-we-can-watch-read-or-play?recruiter=16654690&amp;recruited\\_by\\_id=6f9b8fd0-a37f-0130-4829-3c764e044905&amp;utm\\_source=share\\_petition&amp;utm\\_campaign=psf\\_combo\\_share\\_initial&amp;utm\\_term=psf&amp;utm\\_medium=copylink&amp;utm\\_content=cl\\_sharecopy\\_490659394\\_en-US%3A8](https://www.change.org/p/tell-mastercard-visa-activist-groups-stop-controlling-what-we-can-watch-read-or-play?recruiter=16654690&amp;recruited_by_id=6f9b8fd0-a37f-0130-4829-3c764e044905&amp;utm_source=share_petition&amp;utm_campaign=psf_combo_share_initial&amp;utm_term=psf&amp;utm_medium=copylink&amp;utm_content=cl_sharecopy_490659394_en-US%3A8)\n\n[https://action.aclu.org/petition/mastercard-sex-work-work-end-your-unjust-policy](https://action.aclu.org/petition/mastercard-sex-work-work-end-your-unjust-policy)",
    "score": 1852,
    "url": "https://reddit.com/r/gamedev/comments/1m9wqns/dont_let_collective_shout_win/",
    "created_at": "2025-07-26T15:52:13.000Z",
    "num_comments": 385
  },
  {
    "id": "reddit-1ktr560",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "My Patreon's Animated Announcement",
    "text": "I created this animation to announce the launch of my Patreon!\n\nThis community has been a huge help in giving me the confidence to believe my personal project can be a career path. I hope, that little by little, the amount of time I'll be working on it will boost with people's support. I love my commission work, and I've met incredible clients over the years, however sometimes they are all I do. That's not an optimal balance for me.   \nI must thank you for watching what I've been posting for the last months and for commenting. Even if I didn't answer to everyone (I've been quite busy), every word was read and felt.   \nIf you want to check my Patreon page check my links. (i don't think I should share it here)  \nSorry for my self promotion, hope it's not a problem! ",
    "score": 1760,
    "url": "https://reddit.com/r/animation/comments/1ktr560/my_patreons_animated_announcement/",
    "created_at": "2025-05-23T18:40:06.000Z",
    "num_comments": 25
  },
  {
    "id": "reddit-1nwd0m9",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I was threatened with legal action after forking an open source game",
    "text": "Hey guys, I’m the owner of [https://frontwars.io](https://frontwars.io) ( https://store.steampowered.com/app/4002270/FrontWars/ ) which is a fork of OpenFront.io.\n\nRecently this post was made\n\n[https://www.reddit.com/r/gamedev/s/SdmyOKuTKy](https://www.reddit.com/r/gamedev/s/SdmyOKuTKy)\n\nA lot of the things said by the author there were untrue and so was his video.\n\nI have made my own response video to address everything and show my side of the story with evidence\n\n[https://youtu.be/GCxFnV6WCMs?si=gFRQusLwfn\\_eVTFN](https://youtu.be/GCxFnV6WCMs?si=gFRQusLwfn_eVTFN)\n\nI was getting a lot of abuse from some people, so thought it was important to show my side, but I also want to say thanks for some people who could see I hadn’t violated the license.\n\nI hope you watch my video and then judge the situation yourself from the evidence",
    "score": 1754,
    "url": "https://reddit.com/r/gamedev/comments/1nwd0m9/i_was_threatened_with_legal_action_after_forking/",
    "created_at": "2025-10-02T19:13:48.000Z",
    "num_comments": 258
  },
  {
    "id": "reddit-1iq0mmh",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "PSA: Most animated horse assets you can buy are subpar in terms of anatomy and not good enough if your target audience includes \"people who like horses\"",
    "text": "I'm making this post because I have repeatedly seen people recommend a certain asset and then refuse to believe me when I say it has subpar horse animation. I want to help people do a better job of including horses in their games AND invite devs to leverage the noticeably starved audience of horse girl gamers to their advantage. \n\n**\"I absolutely can't afford anything else\" or \"I'm not targeting horse girls so it's good enough for my purpose\"**\n\nCool, valid, understandable, then this post isn't aimed at you. I'm aware some people will keep using Horse Animset Pro and be happy with it, that's fine. \n\nAlso note that I am talking about the animation quality with regards to horse anatomy, not any other aspect of the asset's usability. I haven't myself worked with these assets, I evaluate them based on how they make your game *look*. I understand that usability and feature breadth is crucial for actual development, I just think it would be great if devs didn't have to choose between usability and correct anatomy. \n\n#The Problems with Horse Animset Pro\n\nHorse Animset Pro (HAP) is a game-ready animation pack and riding system available for Unity and Unreal. It gets widely used when any small dev team needs a horse, and unfortunately is also widely used in games that are supposed to be *about* horses, such as [My Horse: Bonded Spirits](https://store.steampowered.com/app/2376970/My_Horse_Bonded_Spirits/), [Horse Club Adventures](https://store.steampowered.com/app/1518820/Horse_Club_Adventures/), [My Life: Riding Stables 3](https://store.steampowered.com/app/1962150/My_Life_Riding_Stables_3/) or [Spirit: Lucky's Big Adventure](https://store.steampowered.com/app/1270720/DreamWorks_Spirit_Luckys_Big_Adventure/). \n\nThe rig and animations are really unfortunate, and not in a \"stylized but informed\" way but in a \"ignores basic leg functionality\" way. \n\nOne main issue is that the horse's forelegs are bent at the knee in various situations where it would be physically impossible for the foreleg to be bent on a real horse. For a horse's foreleg to carry weight, the knee joint locks in a straight position. \n\nA few concrete examples: \n\n* [Walk](https://i.redd.it/1lenul5t24je1.png) and [Canter](https://i.redd.it/eziiib3o24je1.png) each have their moments where the knee is bent while the fetlock is lowered (i.e. obviously carrying weight) \n* In the [rearing animation](https://www.reddit.com/user/AliceTheGamedev/comments/1ipb6wm/horse_animset_pro_rearneigh_animation_in_slow/) (called \"Neigh\" in the pack), the horse bends its knees before lifting its forehand into the air, which is impossible and wrong. In reality, the power to rear up comes from the hind end, as you can see in [this reference](https://www.reddit.com/user/AliceTheGamedev/comments/1ipav6p/gif_of_horse_rearing_in_slow_motion_for_animation/). (note also that the forelegs only bend once they're in the air, i.e. no longer carrying weight)   \n* The \"Idle Look\" Animation in HAP is a particularly bad example where the forelegs bend at random and the horse looks [impossibly crouched](https://preview.redd.it/l3grxnh314je1.png?width=630&amp;auto=webp&amp;s=ac3b442718c4a1b2e3d2245d07df45bc12dabf9c) as a result. \n\nIf you're not very familiar with horses, these examples may not look overly egregious to you, but for anyone with an eye for horse locomotion, it's pretty jarring. It's not so much one single horrible error, but a dozen details that give the horse an overall wobbly and gummy appearance that's just entirely not representative of an actual horse's movement. (and yeah horses can be wonky goofballs don't get me wrong, but like... there's still rules of physics and anatomy they follow) \n\n\n#Other Animated Horse Assets\n\nI haven't reviewed every horse asset out there in depth, but unfortunately, despite the issues with HAP, there's much worse examples out there. \n\n* This [Ultimate Horse Riding System](https://www.youtube.com/watch?v=BGnk0Ly5krE) for Unreal advertises its IK solution with examples of the bent forelegs s-curve AND includes an example of the horse's forelegs bending entirely the wrong way around, [see here](https://preview.redd.it/bigwkdzn4aje1.png?width=653&amp;auto=webp&amp;s=9d91751181006670540e892e542ab1befd5f2508). \n* There's a handful of other \"animated horse\" assets on the Unity and Unreal stores including ones that feature completely wrong gaits/footfalls and often a complete disregard as to how weight-bearing works for a horse's body. I could spend days listing individual issues, so let me just summarize by saying I have never found any animated horse asset that *doesn't* feature egregious anatomical errors in its promotional material.   \n* [Horse Herd](https://assetstore.unity.com/packages/3d/characters/animals/mammals/realistic-horse-herd-231231) is an (imo) much better-looking alternative that's been out on Unreal for a while and just got released for Unity as well. While it's not perfect, the basic movements look vastly better in that one and I would be interested in hearing how it compares to HAP in terms of usability/features from someone who has worked with both. \n* Just as another fun worst-of highlight, [here's a 400$ \"horse anatomy\" model](https://www.turbosquid.com/3d-models/3d-rigged-tail-jump-model-1386937) that features an elongated dog's skull instead of any actual equine anatomy, along with another wide variety of issues such as out of place muscles, front-facing predator eyes and of course some faulty weight-bearing logic on top. \n* There's this \"[realistic horse with animations](https://www.fab.com/listings/95db4dc3-2f1b-456d-b3d1-8c924c728633)\" for Unreal that I have the least amount of issues with ([deep dive here](https://www.themanequest.com/blog/2024/7/14/new-high-quality-horse-asset-for-developers-this-animated-horse-by-aragon-3d-is-now-available-in-unreal-marketplace)). So far I haven't seen any finished games use it and I can't speak to its usability though, would be interested in hearing experiences!  \n\n#Common Issues in Horse Animation\n\nAnimating horses isn't easy, they're weird giants who walk on their fingernails and have no muscles in their legs. Still though, there's definitely a lot of quality reference footage out there (the first moving picture ever was about capturing how a horse's gallop works), as well as equestrian communities who are happy to provide more specific video footage. \n\nThe main thing people get wrong is **weight distribution** and **impact absorption**: When landing (e.g. from a jump or after rearing), the impact is absorbed *not* through bending the knees, but through the shoulder, elbow and fetlock joints. [Here's a helpful animation that illustrates the right and wrong ways.](https://www.reddit.com/user/AliceTheGamedev/comments/1ipy6gl/horse_foreleg_impact_absorption_reference_made_by/). [Reupload by original creator on bsky](https://bsky.app/profile/brendanbody.bsky.social/post/3lth4rugrqk22) \n\nThe way a horse's legs stand, lift and absorb weight are often mixed up or otherwise badly applied. I've made [this illustration](https://preview.redd.it/9f6vvr8gpaje1.jpeg?width=1024&amp;auto=webp&amp;s=0d99aefa26293f9e303a3b652231f5baa7206ee7) to try and show the most common problems (on the right) as well as how things *should* look and work. \n\n([Horse anatomy diagram](https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/Points_of_a_horse.jpg/500px-Points_of_a_horse.jpg) in case the names of bones/joints confuse anyone)\n\nAnother problem is that even when basic movements and gaits (meaning walk, trot, canter, gallop) are correct, people will invent impossible movements for idle animations instead of using reference footage. Horses do a lot of things that can be used for \"idling\" though, and you *can* find references if you know what to look for! They can scratch themselves, graze, look around, shake their head, paw at the ground, twitch their ears, lift a hindleg to relax, lower their head to doze, flick their tail and much more. I'll admit that finding video of all that in neat and labelled uploads isn't always super straightforward, but you can always go over to e.g. /r/horses or /r/equestrian and ask if anyone has video of their horse doing a specific thing. \n\nIt's worth noting that these issues aren't exclusive to indie games and cheap assets: even AAA games like Ghost of Tsushima feature [examples of horrible horse leg anatomy](https://images.squarespace-cdn.com/content/v1/5b981d61ec4eb7dc9c7aac8a/4d95f901-4f10-4b95-830d-52986630ebae/vlc_2023-04-25_21-48-27.png?format=1000w). \n\n#Context and Background\n\n**\"Why is this worth caring about?\"**\n\nIn short: \"people who like horses and play video games\" are a significant target audience that is worth taking seriously if you're looking for a market niche that's starved for good content. The best summary of indicators and sources I have is [here in a talk I gave last year at devcom](https://youtu.be/wiOPrh27ytY?si=8OO9Rt_MiMm_2K80&amp;t=524). \n\nAlso note that in case anyone reading along has the tech art and asset store skillset to make a competitor for HAP, I believe there's a strong business case here! \n\n**\"Who are you even and why should I listen to you?\"** \n\nI've been doing market research and deep dives into horse games and horses in games for over 6 years now through my website The Mane Quest. I'm also a game dev generalist with a focus in producing and marketing and have worked in the games industry for a decade now – you can find credentials and links in the pinned \"Contact info\" post on my profile. That being said: I am of course not infallible in either horse anatomy OR game animation considerations, so if you do know more than me on these issues (i.e. how we can further improve horse animation and help people get it right), PLEASE do add your wisdom in this thread 🙏\n\n#Further Reading\n\nI write a lot about this topic so if you want to know more, check out some of the following links: \n\n(these links go to my website The Mane Quest, which is not monetized)\n\n* [Adding Horses to your Game: Tips, Resources, Do’s and Don’ts](https://www.themanequest.com/blog/2024/7/16/adding-horses-to-your-game-tips-resources-dos-and-donts)  \n* [Horse Animation: Guides, References and Resources](https://www.themanequest.com/blog/2024/9/6/horse-animation-guides-references-and-resources)  \n* [8 Common Horse Mistakes I Want Game Developers to Stop Making](https://www.themanequest.com/blog/2021/8/22/8-common-horse-mistakes-i-want-game-developers-to-stop-making)    \n* [Comment on \"why is horse animation so often off in games\" on this subreddit](https://www.reddit.com/r/gamedev/comments/1ios7yl/ive_been_wondering_about_this_for_ages/mcp8ykz/)\n* Come join /r/gameswithhorses to follow discussions in this niche genre and stay up to date with horse game news\n\n**TL;DR:** Popular horse assets have very wonky anatomy and if you have any intention of making your game appealing to horse-loving gamers (of which there are many), it's worth looking into alternatives or making your own animations.",
    "score": 1752,
    "url": "https://reddit.com/r/gamedev/comments/1iq0mmh/psa_most_animated_horse_assets_you_can_buy_are/",
    "created_at": "2025-02-15T12:47:48.000Z",
    "num_comments": 185
  },
  {
    "id": "reddit-1mawk6u",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Payment Processors Are Forcing Mass Game Censorship - We Need to Act NOW",
    "text": "Collective Shout has successfully pressured Visa, Mastercard, and PayPal to threaten Steam, [itch.io](http://itch.io), and other platforms: remove certain adult content or lose payment processing entirely.\n\nThis isn't about adult content - it's about control. Once payment processors can dictate content, creative freedom dies.\n\nLearn more and fight back: [stopcollectiveshout.com](http://stopcollectiveshout.com)\n\nEDIT: To clarify my position, its not the games that have been removed that concerns me, its the pattern of attack. I personally don't enjoy any of the games that were removed, my morals are against those things. But I don't know who's morals get to define what is allowed tomorrow.",
    "score": 1690,
    "url": "https://reddit.com/r/gamedev/comments/1mawk6u/payment_processors_are_forcing_mass_game/",
    "created_at": "2025-07-27T20:24:01.000Z",
    "num_comments": 273
  },
  {
    "id": "reddit-1mt91kf",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "16yo watched 6 hrs of C++ on YT; knows C++ now &amp; wants to dev his own game. WTF??",
    "text": "My girlfriend’s son wants to get into game development. I gave him a textbook on learning C++ for game development. [For the record I’m not a programmer but have dabbled here and there].\n\nHe said he doesn’t need that book since he just watched six hours of how to program C++ on YouTube and therefore knew everything that was in the book. I asked him have you written “hello world” program. He said no. I asked him what were the different classes of integers. He couldn’t name one. I asked him what the range of a double was and he had no idea what a double was. They were on the first page of the book.\n\nThen when I showed him some of the games in the book which were terminal games, he said he didn’t need to learn how to do them because he was gonna develop something like Elder Scrolls. He was gonna leave school and do that and not even go to university.\n\nHe downloaded unity engine and got some figure to run from one spot to another. Then I heard him yell out “man I’m so fucking smart. “. He used AI to code it. \n\nNow I can’t throw him off the balcony to give him a reality check or crack him over the head because I love his mother.\n\nWhat can I say to him from game development/C++ programming point of view to knock him down a few rungs?\n\n[edit: anyone thinking I’m gonna hit a 16-year-old over the head obviously missed the point. And anyone thinking this is a rage bait, it’s not. The reality is this kid was going to leave school this summer and not go back because he thought he could make a living and become a millionaire from designing and developing a game all by himself after watching six hours of YouTube. I have been encouraging him given by the fact that I gave him a book and websites and asking him to show me what he’s written. At the same time, I think a reality check about the gaming industry could be in order and that’s what I was hoping for here… because he was actually going to leave school and his mother did not want that for him.]\n\n[edit 2: anyone who thinks I’m trying to discourage him from his passion has misread the post. Asking game devs for the reality of the gaming industry and why it might be better to stay at school and get a computer science degree is a far cry from telling the kid he needs to stop coding. I never said anything of the sort and never would discourage someone from their passion.]",
    "score": 1668,
    "url": "https://reddit.com/r/gamedev/comments/1mt91kf/16yo_watched_6_hrs_of_c_on_yt_knows_c_now_wants/",
    "created_at": "2025-08-18T01:48:49.000Z",
    "num_comments": 813
  },
  {
    "id": "reddit-1mhf7om",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Developing games at Tencent - 01",
    "text": "I’m a game developer from China, and I’ve been working at Tencent Games for quite a few years now. To many people overseas, the Chinese game industry might seem a bit mysterious. From what I’ve seen, Chinese developers rarely share their experiences or ideas in open-source communities the way many Western developers do.\n\nThere are several reasons for this. Culturally, we tend to be more conservative. Language is another barrier—many of us aren’t confident in our English. And honestly, our working hours are pretty long. Most people just want to eat and sleep after work (just kidding… kind of).\n\nLet’s talk about working hours first. Personally, my schedule is already considered quite relaxed: I work from 9:30 AM to 6:30 PM, with a break from 12:30 PM to 2:00 PM. That’s around 8 hours a day, and I don’t work weekends. But that’s not typical—different teams and projects have very different paces.\n\nMany of my colleagues start their day around 10 AM, grab lunch at 11:30 or 12, and only really get into work around 2 PM. Then they work until 6, take a dinner break, and keep working until 8 or 9 at night. Most people don’t get home until after 10. A lot of young people in this industry stay up late and wake up late—it’s just how things are.\n\nAs for development, we mostly use Unreal Engine 5 now. Tencent is known for offering relatively high salaries. From what I’ve heard, average income for developers here is often higher than in many parts of Europe or even Japan and Korea. If you're a developer from abroad and want to chat, feel free to drop a comment!\n\nI think the pace and mindset of development can vary a lot between companies. Tencent started by making mobile games—and made a fortune doing it. So the business model here is more like a production factory. Just as many people view China as the factory of the world, Tencent could be seen as a giant game factory.\n\nThis factory succeeded through production efficiency and a massive domestic user base. Our top-earning games are *Honor of Kings* and *Game for Peace*. These two alone make more money than many well-known AAA titles. You can see people playing them all over China—from first-tier cities like Beijing and Shanghai to small towns and even rural areas.\n\nFor many young people, these games aren’t just entertainment—they’re social tools. Mobile gaming has become the most accessible form of entertainment for many people, especially those without the means for other leisure activities. Everyone has a smartphone, so on public transit you’ll see people either scrolling through social media, watching videos, or playing games. That’s what most young people do during their commute.\n\nBecause China has such a huge population and long commutes, the market here is fundamentally different. User behavior, lifestyle, and population structure have shaped a completely unique gaming ecosystem—with its own business models and types of games. That’s why I think cross-cultural communication in this industry is essential.\n\nLooking at the industry overall, China’s game market reached a saturation point a few years ago. Back then, as long as you got a game launched, it would make money. Why? Because Tencent owns WeChat—the Chinese equivalent of WhatsApp—and WeChat could drive massive traffic to any game it promoted. And usually, the games it promoted were Tencent’s own.\n\nSo even if a game wasn’t great, people would still play it—and spend money—simply because it was there. With such a large population, even a small percentage of paying users could generate huge revenue.\n\nBut around 2019, that golden era came to an end. Even though the pandemic brought temporary growth, especially in gaming, mobile games didn’t see the same momentum. In recent years, the industry’s overall growth has started to slow.\n\nTencent realized this and began focusing more on original content—especially AAA games. These are a different beast compared to mobile games. Mobile games were often copied or adapted ideas, where success relied more on execution and operations than creativity. But AAA games require original ideas, large-scale production, and a completely different pipeline.\n\nTencent is now trying to “bite into that cake,” even though most people believe AAA games aren’t as profitable. Their business model isn’t as ideal as mobile games, but the mobile game market is no longer what it used to be. Short videos and social media have eaten away at people’s attention. Young players simply don’t have the time or money they once had.\n\nSo if Tencent wants to grow, it needs to bet on creativity, originality, and new directions—even if the road is harder.\n\n...",
    "score": 1667,
    "url": "https://reddit.com/r/gamedev/comments/1mhf7om/developing_games_at_tencent_01/",
    "created_at": "2025-08-04T14:38:01.000Z",
    "num_comments": 259
  },
  {
    "id": "reddit-1lfd9z6",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I Analyzed Every Steam Game Released in a day - Here’s What Stood Out",
    "text": "Hey everyone,\n\nI decided to do a small analysis of every game release on Steam on June 2nd, 2025 (i chose this day because there was lot of release, not many free games and only indie titles, i'm not affiliated in any mean to any of these games) and check how much they grossed after 16 days. The goal isn’t to shame any game or dev : I’m mostly trying to understand what factors make a game succeed or flop.\n\nI wanted to see if common advice we hear around here or from YouTube GameDev \"gurus\" are actually true:  \nDoes the genre really matter that much? Is marketing the main reason why some game fails? How much does visual appeal or polish influence the outcome?\n\nI’m also basing this on my personal taste as a player: what I find visually attractive or interesting in the trailers, what looks polished or not...\n\nIt’s not meant to be scientific, but hopefully it can spark some discussion!\n\nThere was 53 games sold on this day, I split them into five categories based on their gross revenue (datas from Gamalytic) :\n\n1. **0 (or almost 0) copies sold - 13 games**\n2. **Less than $500 gross revenue - 18 games**\n3. **$500 – $2,500 gross revenue - 10 games**\n4. **$5,000 – $20,000 gross revenue - 10 games**\n5. **More than $20,000 gross revenue - 2 games**\n\n# 1. Zero copies sold (13 games)\n\nAlmost all of these are absolute slop full of obvious AI-generated content, 10-minute RPG-Maker projects, one-week student assignments, and so on. I still found three exceptions that probably deserved a bit better (maybe the next category, but not much more):\n\n* [A one-hour walking simulator](https://store.steampowered.com/app/3694740/Bean_Sidhe/) : mostly an asset flip and not very attractive but seem like there was some work done in the environments and story.\n* [A hidden-object game](https://store.steampowered.com/app/3766950) from a studio that seems to have released the same title ten times (probably an old game published elsewhere).\n* [A zombie shooter ](https://store.steampowered.com/app/1984800/DecayZ_Origin/)that looks better than the rest : nothing fantastic, but still look much better than the rest of this category. It apparently had zero marketing beyond a handful of year-old Reddit posts and a release-day thread. It's also 20€, which obviously too much.\n\n# 2. $20 – $500 gross revenue (18 games)\n\n* **7 total slop titles** (special mention to the brain-rot animal card game built on top of a store-bought Unity asset). I also included a porn game.\n* **6 generic looking but not awful games** that simply aren’t polished enough for today’s market (terrible capsule under one hour of gameplay..., I'm not surprised those game falls in this category)\n* **2 niche titles** that seem decent (a tarot-learning game and a 2-D exploration platformer) but are priced way too high. Both still reached the upper end of this bracket, so they probably earned what they should.\n\n**Decently attractive games that flopped in this tier:**\n\n* [Sweepin’ XS](https://store.steampowered.com/app/3596030/Sweepin_XS/) : a roguelite Minesweeper. Look quite fun and polished; it grossed $212, which isn’t terrible for such a small game but still feels low. Capsule is kinda bad also.\n* [Blasted Dice](https://store.steampowered.com/app/3232520/Blasted_Dice/) : cohesive art style, nice polish, gameplay look interesting, but similar fate. Probably lack of marketing and a quite bad capsule too.\n\n**And a** ***very*** **sad case:**\n\n* [Cauldron Caution ](https://store.steampowered.com/app/2991890/Cauldron_Caution/): highly polished, gorgeous art, decent gameplay, just some animations feels a bit strange but still, it grossed only $129! Maybe because of a nonexistent marketing ? If I were the dev, I’d be gutted; it really deserved at least the next bracket.\n\n# 3. $600 – $2,500 gross revenue (10 games)\n\nI don’t have much to say here: all ten look good, polished, fun, and original, covering wildly different niches : Dungeon crawler, “foddian” platformer, polished match-four, demolition-derby PvP, princess-sim, PS1-style boomer-shooter, strategy deck-builder, management sim, tactical horror roguelike, clicker, visual novel..., really everything. However I would say they all have quite \"amateur\" vibe, I'm almost sure all of them have been made by hobbyist (which is not a problem of course, but can explain why they didn't perform even better), most of them seem very short also (1-2 hours of gameplay at best).\n\nHere is two that seemed a bit weaker but still performed decently :\n\n* [Tongue of Dog](https://store.steampowered.com/app/1990540) (foddian platformer) : looks very amateurish and sometimes empty, but a great caspule art and a goofy trailer.\n* [Bathhouse Creatures](https://store.steampowered.com/app/3209920/Bathhouse_Creatures/) : very simple in gameplay and art, yet nicely polished with a cozy vibe that usually sells good.\n\nAnd one which seem more profesionnal but didn't perform well :\n\n* [Pretty  Sweet! Healing guardian](https://store.steampowered.com/app/3120000/Pretty_Sweet_Healing_Guardian/) : a princess management game with a very cute artstyle. I don't really get why he didn't do better.\n\n# 4. $5,000 – $20,000 gross revenue (10 games)\n\nMore interesting: at first glance many of these don’t *look* as attractive as some in the previous tier, yet they’re clearly successful. Common thread: they’re all decent-looking entries in “meta-trendy” Steam niches (anomaly investigation, \\[profession\\] Simulator, management/strategy, horror). Also most of them look really profesionnal. Two exceptions:\n\n* [Zefyr: A Thief’s Melody ](https://store.steampowered.com/app/1344990/Zefyr_A_Thiefs_Melody/): a large-scale 3-D adventure that looks great and polished.\n* [Time Guard - The Red Menace](https://store.steampowered.com/app/3536610/Time_Guard__The_Red_Menace/) : a point-and-click from a Czech studio making adventures since 1997; appears to be a remake or port.\n\nTwo titles I personally find \"\"weaker\"\" (would more say \"hobbyist looking\") than some from the previous tier but still performed well :\n\n* [My Drug Cartel](https://store.steampowered.com/app/2861950/My_Drug_Cartel/) : mixed reviews and bargain-bin Stardew-style UI, but the cartel twist clearly sparks curiosity, and management sims usually sell.\n* [Don’t Look Behind](https://store.steampowered.com/app/3721080/Dont_Look_Behind/) **:** a one-hour horror game, a bit janky yet seem polished; the niche and probably a bit of streamer attention did the job.\n\n# 5. $20,000 – $30,000 gross revenue (2 games)\n\nSmall sample, but amusingly both are roguelike/roguelite deck-builders *with a twist*:\n\n* [Brawl to the West ](https://store.steampowered.com/app/2870150/Bagarre__louest/): roguelite deck-builder auto-battler; simple but cohesive art.\n* [Voidsayer](https://store.steampowered.com/app/2754370) : roguelike deck-builder meets Pokémon; gorgeous visuals, I understand why it was sucessfull.\n\n# Conclusion\n\nFour takeaways that line up with what I often read here and from YouTube \"gurus\":\n\n1. **If your game isn’t attractive, it almost certainly won’t sell.** A merely decent-looking game will *usually* achieve at least minimal success. Out of 53 titles, only one (Cauldron Caution) truly broke this rule.\n2. **Genre choice is a game changer.** Even amateurish titles in trendy niches (anomaly investigation, life-sim, management) perform decently. Attractive games in less popular niches do “okay” but worse than trendy ones.\n3. **More than half the market is outright slop or barely competent yet unattractive.** If you spend time on polish, you’re really competing with the top \\~30 %: half the games are instantly ignored, and another 15–20 % just aren’t polished enough to be considered.\n4. **Small, focused games in the right niche are the big winners.** A large-scale project like *Zefyr* (likely 3–5 years of work) only did “okay,” while quick projects such as *Don’t Look Behind* or [Office After Hours](https://store.steampowered.com/app/3207300/Office_After_Hours/) hit the same revenue by picking a hot niche.",
    "score": 1537,
    "url": "https://reddit.com/r/gamedev/comments/1lfd9z6/i_analyzed_every_steam_game_released_in_a_day/",
    "created_at": "2025-06-19T15:12:10.000Z",
    "num_comments": 238
  },
  {
    "id": "reddit-1jargbs",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "We're two indie devs. Our first Steam game made $2.1M, hit #117 today. AMA!",
    "text": "Hi r/gamedev,\n\nWe’re two indie devs who spent a few months exploring ideas before settling on a train dispatching simulator. The niche existed, but no game really focused on it. We launched in Early Access, spent three years there, and released 1.0 a year ago. Today, we hit #117 on Steam’s Top Sellers - our best rank ever.\n\nTotal gross revenue have passed over $2.0M few months ago.\n\nSome key lessons from the journey:\n\n* **Early Access was valuable for funding, but also came with baggage.** If we had the money, we wouldn’t have done it. Big changes hurt our reviews because players hate drastic shifts. We lacked a clear roadmap early on, which made things harder. If we did it again, we'd release 2.0 instead of changing so much post-launch.\n* **Gradual release helps build a strong community.** Releasing on [itch.io](http://itch.io) first was valuable. Transitioning to a Steam demo helped even more. Don’t be afraid to release something for free. If you finish the game properly, players will buy it.\n* **Start early, share everything.** We started showing the prototype after 14 days. Just put your game out there. Try different things, whatever you can think of. The more you showcase, the better. Ask for feedback.\n* **If you have money, test ads.** We started spending on wishlists, and it worked well for us. If you're in a position to experiment, try different platforms and track what brings results.\n* **Scaling a team remotely worked better than expected.** We brought in new people fully remote, and it was easier than we thought. It also gave us a chance to learn about different cultures, which we really enjoyed.\n* We are running ads 24/7 on Meta. Sometimes on Reddit as well.\n\n**EDIT: Most common questions:**\n\n1) Ads, targeting, spend\n\nYou just don't develop the game, you develop the marketing along. We've ran 80 campaigns past year, trying normal ads, meme ads, AI generated ads, in-game footage ads, everything you name it. We doing this all the time past 5 years. We develop not just our game but our marketing campaigns. We are at $0.07 per click with $3 CPM and around 4-6% CTR. Monthly spend around $3k.\n\n2) Idea stealing when releasing early\n\nIt's not happening. Your idea doesn't deliver success. It's your hard work, your choices, effort and expertise that will deliver it. Don't worry about it. Also don't worry about the piracy. Focus on your success and not on the stuff that is not helping you to deliver it.\n\n3) Remote work\n\nCreative development like game development or marketing require live feedback and interactions. Text (slack, discord, teams) is your enemy, voice &amp; video is your friend.",
    "score": 1508,
    "url": "https://reddit.com/r/gamedev/comments/1jargbs/were_two_indie_devs_our_first_steam_game_made_21m/",
    "created_at": "2025-03-14T00:37:55.000Z",
    "num_comments": 331
  },
  {
    "id": "reddit-1m46xk5",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "False AI accusations are destroying real creative work",
    "text": "I understand the concerns around AI in game dev. Protecting artists and creative work matters. But the current witch hunt is starting to harm artists and developers who aren’t using AI at all.\n\nI have been in the industry for 10+ years, and I hand draw all my game art. It’s unique, stylized, and personal, yet I’ve still had people accuse me of using AI, leaving hate comments and trying to \"cancel\" our games.\n\nI have learned to document the whole process and post how I draw the game art, but honestly, it’s frustrating. False accusations can seriously damage someone’s career, even if they have spent years building their skills and putting real time into their game.\n\nPeople should be more cautious before accusing someone of using AI, you might end up hurting the very creators you’re trying to protect.",
    "score": 1447,
    "url": "https://reddit.com/r/gamedev/comments/1m46xk5/false_ai_accusations_are_destroying_real_creative/",
    "created_at": "2025-07-19T21:00:49.000Z",
    "num_comments": 495
  },
  {
    "id": "reddit-1met9rc",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Gamedev is not a golden ticket, curb your enthusiasm",
    "text": "*This will probably get downvoted to hell, but what the heck.*\n\nRecently I've seen a lot of \"I have an idea, but I don't know how\" posts on this subreddit.\n\nTruth is, even if you know what you're doing, you're likely to fail.  \nGamedev is extremely competetive environment.  \nChances for you breaking even on your project are slim.  \nChances for you succeeding are miniscule at best.\n\nEvery kid is playing football after school but how many of them become a star, like Lewandowski or Messi? Making games is somehow similar. Programming become extremely available lately, you have engines, frameworks, online tutorials, and large language models waiting to do the most work for you.\n\nThe are two main issues - first you need to have an idea. Like with startups - Uber but for dogs, won't cut it. Doom clone but in Warhammer won't make it. The second is finishing. It's easy to ideate a cool idea, and driving it to 80%, but more often than that, at that point you will realize you only have 20% instead.\n\nI have two close friends who made a stint in indie game dev recently.  \nOne invested all his savings and after 4 years was able to sell the rights to his game to publisher for $5k. Game has under 50 reviews on Steam. The other went similar path, but 6 years later no one wants his game and it's not even available on Steam.\n\nCogmind is a work of art. It's trully is. But the author admited that it made $80k in 3 years. He lives in US. You do the math.\n\nFor every Kylian Mbappe there are millions of kids who never made it.  \nFor every Jonathan Blow there are hundreds who never made it.\n\nAnd then there is a big boys business. Working \\*in\\* the industry.\n\nBetween Respawn and \"spouses of Maxis employees vs Maxis lawsuit\" I don't even know where to start. I've spent some time in the industry, and whenever someone asks me I say it's a great adventure if you're young and don't have major obligations, but god forbid you from making that your career choice.\n\nGames are fun. Making games can be fun.  \nJust make sure you manage your expectations.",
    "score": 1213,
    "url": "https://reddit.com/r/gamedev/comments/1met9rc/gamedev_is_not_a_golden_ticket_curb_your/",
    "created_at": "2025-08-01T10:50:48.000Z",
    "num_comments": 358
  },
  {
    "id": "reddit-1pb59sc",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "I love animation, it's my career and passion, but I just find Zootopia 2 being the most successful film of ALL TIME just a little... hard to believe?",
    "text": "",
    "score": 1045,
    "url": "https://reddit.com/r/animation/comments/1pb59sc/i_love_animation_its_my_career_and_passion_but_i/",
    "created_at": "2025-12-01T06:10:59.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1lxd6y2",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "How I Made One Million Dollars In Revenue As A Solo Indie Game Dev",
    "text": "I've been working as a solo indie game developer for the past 7+ years and wanted to share an educational video as to how I did it my way.\n\n[https://youtu.be/r\\_gUg9eqWnk](https://youtu.be/r_gUg9eqWnk)\n\nThe video is longer than I wanted and more casual. It's not meant to be entertaining. It's not meant to get clicks or views. Its sole purpose is to share my indie dev story and lessons learned after leaving my corporate career and becoming a full time indie game dev. It's my Ted Talk that I never got invited to do.\n\nI'd love to hear your thoughts on the video (if you can get through it) and if you have any ideas on how to come up with good game ideas or what I should make next please share!\n\nIf this video looks familiar, well that's because it is. I liked another post on here and it inspired me to finally do this video I've been wanting to do for a LONG time now. Thanks to the guy who made this [topic](https://www.reddit.com/r/gamedev/comments/1lnr07f/how_i_sold_over_200k_copies_over_3_games_as_a/) on here.",
    "score": 937,
    "url": "https://reddit.com/r/gamedev/comments/1lxd6y2/how_i_made_one_million_dollars_in_revenue_as_a/",
    "created_at": "2025-07-11T17:37:52.000Z",
    "num_comments": 131
  },
  {
    "id": "reddit-1kowbqv",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Using unreal engine made me lose all love for game dev",
    "text": "I have loved programming with everything in my soul for my whole life. I love the idea of making video games but using unreal engine has killed this.\n\nI have a class for uni where we need to make a game in UE5, today I needed to do an assignment using the navmesh functionality in unreal... it took me like 5 hours to get the most basic shit working. The level of abstraction is insane, people explain how to use unreals features like it's a preschooler your convincing to eat their food.\n\nIt's nondeterministic, everything is different every time. Just because the navmesh worked on my computer this morning does not mean it still works the same night.\n\nBefore this class I loved everything about programming, I wanted to learn more about how everything works, but I hate all the abstraction on all of the tools we have to use. For context I love programming in C, in fact right now I'm making a game in C from scratch using only SDL as a sort of hobby project. Rendering, lighting 3d projection all from scratch, and I love it. Is this cool? Yes. Does it have any practical value in game dev? No.\n\nAre all my skills wasted in game dev? Are there any game dev jobs that don't involve using a massively abstracted tool like unreal and I get to work with what's actually happening? I love using opengl, directx, and those sorts of things buy no one wants a opengl dev. Everyone hiring wants experience with unity or unreal and I despise the idea of trying to get someone else's badly documented tool to behave when I could just write one myself. I'm a wheel expert in a world full of cars.\n\nDo these sorts of jobs exist in game dev? Am I looking in the wrong places or do I need to find a new career path?",
    "score": 683,
    "url": "https://reddit.com/r/gamedev/comments/1kowbqv/using_unreal_engine_made_me_lose_all_love_for/",
    "created_at": "2025-05-17T15:58:11.000Z",
    "num_comments": 569
  },
  {
    "id": "reddit-1k9gfpu",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Good game developers are hard to find",
    "text": "For context: it’s been 9 months since I started my own studio, after a couple of 1-man indie launches and working for studios like Jagex and ZA/UM.\n\nI thought with the experience I had, it would be easier to find good developers. It wasn’t. For comparison, on the art side, I have successfully found 2 big contributors to the project out of 3 hires, which is a staggering 66% success rate. Way above what I expected. \n\nHowever, on the programming side, I’m finding that most people just don’t know how to write clean code. They have no real sense of architecture, no real understanding of how systems need to be built if you want something to actually scale and survive more than a couple of updates.\n\nAlmost anyone seem to be able to hack something together that looks fine for a week, and that’s been very difficult to catch on the technical interviews that I prepared. A few weeks after their start date, no one so far could actually think ahead, structure a project properly, and take real responsibility for the quality of what they’re building. I’ve already been over 6 different devs on this project with only 1 of them being “good-enough” to keep.\n\nCurious if this is something anyone can resonate to when they were creating their own small teams and how did you guys addressed it.\n\nEdit: to clarify, here’s the salary &amp; benefits, since most people assumed (with some merit to it) that the problem was on “you get what you pay for”. Quoting myself from those comments:\n\n“Our salary range is between 55k-70k. Bear in mind this is in Europe and my country’s average salaries for the same industry is of 45k-60k, depending on seniority. We also offer good benefits:\n\nPolicy of fully remote work with flexible working hours, only 3 syncs per week (instead of dailies), 30 days of paid vacations (country standard is 22 days), health insurance + a couple other benefits, and the salary is definitely above market average.”",
    "score": 662,
    "url": "https://reddit.com/r/gamedev/comments/1k9gfpu/good_game_developers_are_hard_to_find/",
    "created_at": "2025-04-27T22:32:41.000Z",
    "num_comments": 336
  },
  {
    "id": "reddit-1plm098",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "7 years trying to live off my own games: what went right, what went wrong, and what finally worked",
    "text": "Hi! My name is Javier/Delunado, and I’ve been making games for around 7 years now, mostly as a programmer and designer. Warning! This is going to be a long post, where I’ll share both my professional journey and some advice that I think might be useful for making your own games.\n\nI’ve always really enjoyed working on my own projects, and even though I’ve worked for others as an employee or freelancer, I’ve never stopped dreaming about being able to live off my own games. I’ve tried several times: going full-time using my savings, and also juggling indie development alongside other jobs.\n\nFinally, in July 2025, I self-published a game called *Astro Prospector* together with two other people. It has done genuinely well, well enough that it’s going to let us live off this for a long time. Said like that, it sounds simple, but the reality is that it’s been a tough road: years of attempts, learning, effort, and a pinch of luck.\n\n# Background\n\n# 2017\n\n* I started a Computer Engineering degree in Spain in 2017. I had always loved video games and computers, and I had tinkered a bit with Game Maker and similar tools before, without really understanding what I was doing. In my degree second year, once I had learned a bit of programming, I teamed up with my classmate and best friend at the time, and we started making mobile games in Unity just for fun. We published a couple of games, *Borro* and *CryBots* (they’re no longer on the store, but I’m leaving [a couple of screenshots here](https://drive.google.com/drive/folders/1-Fhz6lE1sX8XgzDul4bd_tPLefXP0_K4?usp=sharing) out of curiosity)\n\n# 2018–2019\n\n* Making those Unity games taught us a ton. Not just programming or design, but especially what it means to FINISH a small game. To publish it, to show it to people, to do a bit of marketing. It was an incredible and funny experience that gave us a more holistic view of what game development really is. So, naturally, thinking we were already grizzled gamedev veterans, we decided to make a muuuch bigger project for PC and consoles, called *We Need You, Borro!*. This would be a sequel to our first mobile game: an adventure-RPG whose main mechanic was inspired by the classic *Pang*. This time, we also had an artist helping us out. The project was scoped at around 1.5 years of development. A terrible idea, if you ask present-day me, haha.\n* My friend and I lived together, and we balanced classes and other obligations with developing the game. This is where I started learning about community management and marketing in general. I ran the studio’s account, called *TEA Team*, and it helped me better understand what it actually means to promote a game on social media. On top of that, we took part in a couple of fairs where we showed the game to people. It was my first time attending in-person events, and the experience was amazing. I fell in love with the indie dev scene and its people. At one of those fairs, showing a demo of the game, we even won an award alongside much more well-known games like *Blasphemous*. It was surreal to take a photo with our award next to the director of *The Game Kitchen*, holding his. Even more surreal to remember it now lol.\n* At the same time, we created and started growing the *Spain Game Devs* community, first as a Telegram group and later with an additional Discord server. The idea was to have an online community for Spanish game developers to discuss development, show projects, ask for help, etc., since nothing quite like it existed back then. Small spoiler: that community is still alive and active today, and it’s the largest dev community in Spain. But we’ll come back to that later!\n\n# 2020\n\n* COVID hit. I’ll keep this part brief, but between the pandemic and some personal issues, the development of *We Need You, Borro!* and the *TEA Team* studio had to come to a halt. Those were tough months: remote classes weren’t the same, and Borro’s development slowly faded out until it died. Even so, I always try to look at moments like these through a positive lens. When one door closes, a window opens! You can play the [last public demo of the game here](https://delunado.itch.io/we-need-you-borro).\n* After those turbulent months of change, I focused my gamedev path on two things. On one hand, I teamed up with two other devs, [PacoDiago](https://soundcloud.com/pacodiago) (musician) and [Adri\\_IndieWolf](https://adri-indiewolf.itch.io/) (artist), to make jam games and a few small projects under the name *Alien Garden*. It was fun, and even though we never managed to release a commercial game, we did several jam games and had a great time. I learned a lot, and it allowed me to keep practicing and improving. My favourite game made with the team is probably [Clownbiosis](https://delunado.itch.io/clownbiosis).\n* On the other hand, I wanted *Spain Game Devs* to grow. I wanted a place where people could come together and feel close to fellow developers. Beyond running internal activities and promoting the community on social media, I decided to organize the *Spain Game Devs Jam*. It would be an online jam (still not that common pre-pandemic) focused on developers from Spain. In short, I spent around three months working daily to secure sponsors for prizes, streamers to play every single submitted game, and so on. It was intense and stressful work, but it eventually became the biggest jam ever held in Spain, with around 700 participants and 130 submitted games. The jam was repeated annually, each time more ambitious, until 2024, when it didn’t take place for reasons I’ll explain later.\n\n# 2021\n\n* I kept studying, making games in my free time, and running *Spain Game Devs*. That year, [Bitsommar](https://www.youtube.com/watch?v=0go21cA0CTM) took place, an event in northern Spain that brought together a small group of Spanish developers for a week of pure relaxation. No coding, no working, just resting and bonding. It was a wonderful experience, and I met a lot of amazing people. Among them was Julia “Rocket Raw”, a Spanish developer who, together with Raúl “Naburo”, founded the young studio [Dead Pixel Games](https://deadpixeltales.itch.io/).\n* Due to life happening, a few months later I ended up staying over at Julia and Raúl’s place. They had been toying with an idea to present at *Indie Dev Day*, an incredible Spanish indie-focused event held every year in Barcelona (now called [Barcelona Game Fest](https://bcngamefest.com)). It seems they were having some trouble with their current programmer. While I was in the shower (where all great ideas are born) I had the brilliant thought of offering myself as a programmer for the project they had in mind, in case they didn't wanted to continue with its current one. They said they’d think about it. A month later, they wrote back saying yes, let’s give it a shot. It’s worth mentioning that, like everything else I’ve talked about so far, this project wasn’t paid, and we had no income of any kind. The idea was to work towards getting that funding through sales of the game or interest from a publisher.\n* The best part? There was only one month left to get the demo ready and present it at the event. So we went all in for an intense month of crunch, creating the project from scratch. For having just one month, it turned out pretty good, I must say. The game was called *Bigger Than Me*, a narrative (mis)adventure about a boy who becomes a giant when he hears the word “Future”. We presented the project at the event, and I remember it very fondly. People loved it, the event was amazing, I finally met many devs in person, and I made friendships that I still have today.\n* From there, at the end of 2021, we decided to move forward with *Bigger Than Me*. The plan was to develop a vertical slice and start looking for a publisher to secure funding. The projected timeline was one year for the vertical slice and publisher search, and another year to finish development once funding was secured. On top of that, I was still studying, and my teammates were working day jobs just to survive while we made the game. Precarious, to say the least.\n\n# 2022\n\n* Throughout 2022, I focused on working on *Bigger Than Me*, finishing my degree (I took an extra year, 5 instead of 4, because of COVID), and continuing to learn about gamedev by joining jams and running the *Spain Game Devs* community. Throughout 2021 and into 2022, we kept showing *BTM* and talking to publishers.\n* The critical moment came during that year’s *Indie Dev Day*. We brought *Bigger Than Me* again, with a booth and an improved version. We won some awards there and at other events. People loved it, and I genuinely think it had potential. But it was a narrative adventure. And narrative adventures… don’t sell. Or so every publisher told us. Another important point was that we still hadn’t released any commercial game as a team, and publishers weren’t fully convinced about the project’s viability.\n* We came back home empty-handed after pitching to many publishers, both in person and online. The game wasn’t considered profitable, and even though it had quality, the market wasn’t going to absorb it. A few weeks later, we made the decision to stop the project: there was no realistic chance of securing funding, and it didn’t make sense to continue without it. It was really hard… but necessary. We decided to rest for a few weeks before doing anything else. [This was the last public demo of Bigger Than Me](https://deadpixeltales.itch.io/bigger-than-me).\n* In the last months of 2022, alongside wrapping up *BTM*, I also finished my degree. My final project was a complete overview of the history of Artificial Intelligence techniques for video games: things like A\\*, GOAP, steering behaviours, etc. At that time, LLMs and similar tech weren’t as mainstream, so I only mentioned them briefly. It taught me a lot about gamedev AI and became a solid asset for my résumé.\n* After graduating, I started looking for a job in the game industry. My dream was still to release my own games and live off them, but in the meantime, I had to eat. I decided to look for a company working with VR for a very specific reason: I didn’t really like VR. That way, I hoped the job would just be what paid the bills, without fully satisfying my passion, leaving that passion for indie development in my free time. I ended up working for about a year at [Odders Lab](https://odderslab.com/).\n* It’s now December 2022. Some time after cancelling *Bigger Than Me*, and to clear our heads a bit, we decided to take part in [Thinky Jam 2022](https://itch.io/jam/thinky-games-are-for-everyone/entries), a jam focused on puzzle and “thinky” games. It lasted around 11 days, and we took it pretty calmly. We made a game called [Stick to the Plan](https://deadpixeltales.itch.io/stick-to-the-plan-jam), a kind of sokoban where you don’t push boxes, but instead control a dog who loves loooong sticks and has to maneuver them through the levels. The game turned out really well and got an amazing reception on itch.io.\n* Surprised by how well *Stick* was received, we decided, after some reflection, to turn it into a full commercial game. It had several things going for it: prior validation, simple development, very controlled scope, and a relatively short timeline. It also had one big drawback: it was a puzzle game. Selling a puzzle game is really hard. It’s probably one of the worst genres to sell, right next to… narrative adventures :). Still, we decided to go for it, mainly to have a game released on Steam and be better prepared for a future project. The studio was renamed from *Dead Pixel Games* to *Dead Pixel Tales*, also as a kind of rebirth symbol, haha.\n\n# 2023\n\n* The full development of *Stick to the Plan* started in January 2023. Throughout that year, while juggling my job at Odders, Spain Game Devs, and the occasional game jams, I worked on *Stick* whenever I could. Net development time was about 6 months total, spread across 2023, until we finally released the game in September. Worth stressing: at no point did we get paid while making it. The expectation was to earn money after launch.\n* In July 2023, I left Odders Lab. Honestly, my stress levels had been climbing nonstop since I started working on *Bigger Than Me*, and it reached an unsustainable point. I decided to quit the stable, comfy job and use my savings to go full time and finish *Stick to the Plan*. This was the first time my savings hit zero because I took the self publishing leap.\n* That same month, we released a small game: [Raver’s Rumble](https://deadpixeltales.itch.io/ravers-rumble). It was paid by *Brainwash Gang,* and it’s a mini game based on one of the characters from their game *Friends vs Friends*. It was a full week of work, and they paid us around €1000 (in total, not per person. So probably like 9$ the hour lol). I won’t go into too much detail, but communication with the company was kind of rough, and I ended up finishing the job pretty stressed, basically crying while fixing the last bugs, because of how much work we crammed into one week plus everything else going on in my life.\n* [Stick to the Plan](https://store.steampowered.com/app/2334280/Stick_to_the_Plan) launched as a self published Steam release in September. We got help from [SpaceJazz](https://www.spacejazzgames.com/), a publisher focused on the Asian market that supported us with translation and promotion in some regions of Asia. Later, we did the Nintendo Switch port, and SpaceJazz published it globally on that console. As of today, about two years later, *Stick* has sold around 5,000 copies on Steam. I don’t have Switch data, but it’s probably around 4,000\\~ copies at most. As you can see, that’s nowhere near enough to feed three people for even three months. But we had released a real game!\n* After launching *Stick*, with barely any rest, we started working on prototypes and ideas. Turns out there was a small publisher that funded games from small teams to be made in about 6 months, and they were interested in us. We just needed to land on an idea they liked and we could get funding. So we spent September, October, and November prototyping several ideas in parallel.\n* This potential publisher was looking for replayable games, genres that allow creativity. Think *Balatro*, *Slay the Spire*, *Dome Keeper*, etc. The big drawback was that the Dead Pixel team leaned heavily toward thinky, narrative, puzzle heavy games. The roguelite / deckbuilder-ish designs we tried didn’t really shine. But eventually we found a small prototype: a mix of *Stacklands* x *Detectives*. It was pretty fun, and we felt it had something to it, a nice blend of narrative investigation and roguelite structure. However… the publisher didn’t fully buy it.\n* After 3 months of unpaid work on prototypes that got discarded, with almost no rest after *Stick*, the whole team was completely burnt out. Our expectations with the publisher were pretty low at this point, even though at the start it looked like everything would work out. We spent 3 months prototyping, and it led nowhere.\n* As a last shot, we attended [BIG](https://www.bilbaogamesconference.com/) in December, an event held in Bilbao. We didn’t have a booth, but we did pay for business passes so we could set meetings with publishers. We brought a more refined version of that *Stacklands* x *Detectives* prototype and showed it to friends and professionals. On top of that, we had meetings with several publishers. Among them, Big Publisher A and Big Publisher B (I’d rather not name them here) were very interested. They really liked the idea.\n* After the event, both publishers emailed us a few days later. How weird, a publisher reaching out to you instead of the other way around, haha. Long story short, Big Publisher B eventually dropped out, and Big Publisher A seemed interested in moving forward. A few weeks passed.\n\n# 2024\n\n* The situation was kind of unreal. After months of precarity and fighting just to survive off our own games, it felt like everything was finally coming together. We had an interesting idea. A big publisher seemed ready to sign. If things went well, we’d be living off our own games and shipping something amazing.\n* But on the other hand, I was done. The weight of the months, the years, had taken a huge toll on my mental health. I developed chronic stress over time, with pretty serious physical and mental consequences. I had been saying for a while, “yeah, I’m going to seriously start reducing stress.” But I never did. There was always just a bit more to do. We were always “almost there.” After thinking about it for a long time, and as painful as it was, I decided to leave Dead Pixel Tales.\n* It was an incredibly hard decision. After years of struggle, we were about to sign with a big publisher. We had a good game in our hands. Everything looked good. But if I didn’t leave then, I was going to leave in the middle of development, and not in a nice way. And I didn’t want to abandon the team halfway through production. So, as much as it hurt, in January 2024 I told the team how I was feeling and that I had to step away. I’d help them find a replacement programmer, or finish whatever they needed for a few weeks. But after that, I had to distance myself for my health.\n* The team kept working on the game. I don’t know the details of what happened with Big Publisher A and the project. I really hope they can ship the game someday.\n* Throughout January 2024 and part of February, I rested. On top of leaving Dead Pixel, I also dropped several other commitments I had. I decided to stop running *Spain Game Devs Jam* and minimize the organizational work there. I started therapy. Little by little my mental health improved, and today I’m doing much, much better in comparison, even though I still deal with some little leftovers every now and then.\n* In February, I started working at [Under the Bed Games](https://underthebedgames.com/), an indie studio that was in the process of finishing and releasing [Tales from Candleforth](https://store.steampowered.com/app/2200410/Tales_from_Candleforth/). My savings ran out completely for the second time, and I needed to work again. The team, around 8 people total, welcomed me with open arms.\n* I worked there from February to October. I learned a ton, used both Unreal and Unity, and it was a really enriching experience, both technically and in terms of team management. Special mention: we got mentorship from [RGV](https://es.linkedin.com/in/r-g-v), a Spanish software veteran who knows a LOT and has gamedev experience too. It radically changed how we program and how we understand processes &amp; teams, and it helped me massively later on.\n* That year I went to Gamescom for the first time with Under the Bed. It was an incredible (and exhausting lol) experience. One of the reasons we went was to meet publishers and secure funding for the next project.\n* After a few tough months, we didn’t get the funding. It sucked, but there was no choice: everyone got laid off in October, and the game we’d been working on for half a year was cancelled. Another misery for the indie developer. But again: one door closes, another window opens.\n* At Under the Bed, my main teammate was [Raúl “Lindryn”](https://lindryn.itch.io/). Besides being a great person and programmer, he’s the director of Guadalindie, an indie event held in southern Spain every year. I also had the honor of joining [MálagaJam](https://malagajam.com/), the organization behind [Guadalindie](https://guadalindie.com/), which also hosts the biggest in person *Global Game Jam* site in the world, and I’ve been able to help with their events since.\n* When Under the Bed closed, Lindryn and I decided to make a small project for fun, to practice and boost the portfolio a bit. It was basically a miniaturized *Factorio* without conveyor belts: a resource management game where you place units that throw resources through the air and pass them along to each other.\n* Remember that publisher we made a bunch of prototypes for at *Dead Pixel Tales*, who ended up taking none of them? Well, they came back. They messaged me because they were looking for games again. I told Lindryn, and a bit rushed but trying to seize the opportunity, we prepared the project to pitch. We brought Álvaro “Sienfails” onto the team too, a young but insanely talented artist who had worked with us at Under the Bed.\n* We rushed a pitch deck for the publisher, and it went pretty well. The game was called *Flying Rocks*, and they liked the idea. It had a goofy medieval fantasy tone, keeping the addictive optimization core of games like *Factorio* but simpler, aimed at people who wanted to get into the genre. Plus, we had a few mechanics that allowed for emergent situations I still hadn’t seen in other factory games.\n* Long story short, we spent several months working on *Flying Rocks* prototypes and mini demos for the publisher. Everything was always great according to them, but there was always just a little more needed. A little more. A little more. We were focused on making the game mechanically interesting rather than polishing the visuals, because we understood the idea had to stand on its own first, and then we’d go deeper on the rest. After 3 months of work, and after 3 different demos, we couldn’t keep doing this because we ran out of money. We even had a contract draft ready to sign, but “the investors weren’t convinced.” We told them: either we sign now, or we have to stop. We never signed, and the project went on hold. If you feel like it, you can try [the latest prototype we made](https://delunado.itch.io/flying-rocks) for the publisher here (password: *rocky dwarf*).\n* During those months I got hooked on [Scientia Ludos’ channel](https://www.youtube.com/@ScientiaLudos). In several videos, he argued that signing with a publisher generally isn’t worth it, that we could do everything ourselves as a studio. Mixing that with [Jonas Tyroller’s](https://www.youtube.com/@JonasTyroller) advice and [How To Market a Game](https://howtomarketagame.com/) saying that the best marketing is “making a good game,” and being a bit bitter and angry about all the time lost with the publisher, I decided that in 2025 I was going to release a game. I was going to self publish it. And it was going to go WELL. And it did. Self fulfilling prophecy!\n\n# 2025\n\n* In January of that year, I started researching the market, determined to find a profitable game to make with a small team. I stumbled upon *Nodebuster*, which I already knew of but had never played. I’ve played idle games my whole life: on Kongregate, on itchio, etc. I love them. When I started playing *Nodebuster* and digging into the emerging genre of “active incremental,” I knew: this is what we have to do.\n* This emerging genre perfectly matched what we had available: a small team, making small but distilled games, in a niche where there wasn’t much quality yet, and that we personally loved. By late January, I started prototyping *Astro Prospector* and pitched it to my *Flying Rocks* teammates. I wanted them to make it with me, and everything clicked.\n* Development started in February, and we set the game’s deadline for June. Around 5 months. That way, the goal was crystal clear, and we could shape the game around it.\n* I’d like to talk in depth about the strategy and the process we followed in a longer article, so I’ll keep it short here. We made a demo for friends and acquaintances, then iterated on it. That became the public demo on itchio alongside the Steam page. Later, we published an improved version of the demo on Steam. And in July 2025, the game released, 15 days later than planned, not bad. You can take a look to the [game here](https://store.steampowered.com/app/3503440/Astro_Prospector/).\n* Even though we didn’t work with traditional publishers, I did team up again with SpaceJazz, the Asia focused publisher who helped us with *Stick to the Plan*. They handled promotion in China and Japan, and it’s been a really pleasant relationship.\n* After launch, which went far beyond our expectations (we hit 1200 concurrent players in the first hours), we rested for a week, then shipped a patch fixing bugs and such, then rested two more weeks. When we got back to the office, we decided to work on a free update and include a new survivos/roguelite mode, for people who felt the story mode (5 hours) was too short.\n* In November, three months later, we released the roguelite mode. I’ll be honest: I enjoyed making the incremental mode more than this one, but it still turned into an interesting package, especially as a huge free addition to an existing game. But yeah, I definitely like making incrementals more than roguelites lol.\n* Even though both launches went really well, the month before each one was pretty rough in terms of stress (each launch is a big weight on your shoulders. Also, this is the third time I got broke on my self-publishing attempt, so you can imagine lol). And the weeks after, despite the joy, there’s this uncomfortable feeling, kind of like a “post partum” slump. But then it gets better.\n* As of today, 13/12/2025, we’ve sold almost 100,000 copies. I’m writing this while on vacation, in “low performance mode.” I have money in the bank now, time to rest, and I can finally breathe. After 7 years, I made it. And even after making it, I still feel like this is just a small step on the long road ahead…\n\n# Advice\n\nBelow are a few tips or observations that, looking back, helped me get here. There’s no special order.\n\n* Ever since I started doing stuff in gamedev, I’ve been sharing my progress on social media and in groups. Experiments, project updates, tips and problems, etc. This helped a lot of people in my local scene know who I am, and it helped me meet a lot of people. But it has to be done GENUINELY. Not sharing with a marketing agenda behind it. Sharing as a curious human. Sharing FOR OTHERS, not for yourself.\n* Even though everyone sees things differently, for me it has been crucial to work with small teams to ship projects. Not just in terms of quality, but in a human way too. If one day you’re feeling down, the team supports you. If there’s something you don’t know, maybe they do. You laugh more, everything is more fun. It has its hard parts and you need to know how to work as a team, but it’s worth it. I don’t think I’m built to be a lone wolf, even though I’d like to try it at some point.\n* When I worked at *Under the Bed*, we had a month where we prototyped different games to decide what was next. A piece of advice I got back then, and tried to apply, was to make prototypes in a way that they cannot be reused. For example, we were using Unity, so we decided to prototype in Godot. That way you stop trying to do things “properly” so you can reuse them, and you can focus on moving fast and prototyping what you need.\n* If there’s one thing I’ve learned, it’s that creativity isn’t something that appears when you lock yourself in a room and think for a long time, isolated from the world. Creativity is just the infinite, chaotic remix of things that already exist. For *Borro*, we took *Pang* and added Action RPG elements. For *Astro Prospector*, we took *Nodebuster* and added bullet hell elements. Don’t be afraid to take inspiration from something that already exists to build a foundation. I’m not talking about copying, I’m talking about improving it in your own style.\n* One of the key things in *Astro Prospector’s* development was that even before we fully knew the core mechanics, we already knew the release date. Anchoring a goal and sticking to it was KEY for controlling scope, knowing where to cut, and when. This was inspired by [Parkinson’s Law](https://en.wikipedia.org/wiki/Parkinson%27s_law), which basically says that work behaves like a gas: it expands to fill the time you give it, just like gas expands to the limits of its container.\n* Early validation saves ton of work. Demos, prototypes, jams, small tests with real players helped me avoid going all in on ideas that were not really working.\n* Be careful if gamedev is both your hobby and your job. In my case, it is, or at least it was. It’s important to have hobbies beyond making games, and it’s important to socialize often. Spending too much time in front of a computer takes a real toll.\n* I’ve always believed that the wisest person is the one who learns from other people’s mistakes. It’s true that some mistakes are hard to truly internalize unless you suffer them yourself, but try to pay attention to what does NOT work for others, think about why, and avoid repeating it.\n* Take care of the people around you, and surround yourself with people who take care of you. None of this would be real without a family that supported me, a partner who put up with me, and friends who trusted me. Never neglect them.\n* When planning projects and games, don’t try to design a perfect plan from start to finish. Make weekly plans, keep a high level idea of where you want to go, stay agile, actually agile, not fake Scrum agile (please). Always ask yourself: what is the smallest step I can take right now in the right direction?\n* Shipping something small beats dreaming forever about something big. Almost every meaningful step in my career came from finishing and releasing something, even if its not good, it sold poorly or just failed. Also, constraints are a superpower. Deadlines, small teams, limited scope. Most of the good decisions in *Astro Prospector* came from clear limits, not from infinite freedom.\n* Meritocracy does not really exist. Beyond my family, I owe all of this to the public, high quality services I was lucky to grow up with. Education, healthcare, support systems. Fight for them.\n* Publishers are not villains, but they are not saviors either. Promises without contracts are just that: promises. Protect your time and your energy. And even if you sign with a publisher, do it because you REALLY need it.\n* Take care of your mental health. Please. If there’s one thing you should take away from all of this, it’s this. If skydiving is a high risk sport for the body, doing business is a high risk activity for the mind. Burning yourself out is not worth it. Learn from my mistakes. Success does not erase the damage. Even when things finally go well, your body and your mind remember the years of stress. Act early, not when it’s already too late.\n\nHuge thanks for reading. I’ll keep an eye on the comments and DMs to answer any questions or thoughts. You can also contact me via Discord or Telegram (@delunado\\_dev).\n\nHope everything’s going great in your life. Big hug :)",
    "score": 620,
    "url": "https://reddit.com/r/gamedev/comments/1plm098/7_years_trying_to_live_off_my_own_games_what_went/",
    "created_at": "2025-12-13T13:58:26.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1iu35c3",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "How to get 93k wishlists with 0$ spent on marketing (first game experience)",
    "text": "Hi there \\^\\_\\^\n\nMy name is Maria and I’m one of the 3 devs of [Urban Jungle](http://s.team/a/2744010). My friends and I started working on UJ as a hobby project in October 2023 and right now it's sitting on Steam with **93k WLs**. I already did a series of [posts](https://www.reddit.com/r/Unity3D/comments/1i3cv9a/last_january_ive_created_steam_page_for_my_first/) on r/Unity3D about our game dev journey, but I wanna share my experience with marketing here, cuz it's not tied to the game engine \\^\\_\\^\n\n**TL;DR:**\n\n1. **If your game is cute, translate it to Japanese**\n2. **Festivals work really well**\n3. **Networking is key**\n4. **1 demo is not enough, make more!**\n\nSoooo as a self-proclaimed marketing unprofessional of our lil group, I just want to share my experience while it’s still kinda fresh, because I strongly believe that other indies can do this as well.\n\nAs title states, **we’ve gathered 93k WLs with 0 budget.** But it’s clickbait, cuz we’ve spent 25$ for programming course and we bought a 25$ cat asset pack from Unity Asset Store. But aside from that, we haven’t spent ANY money on the game until we reached 50k. Only our time. And sweat. And tears. Other 43k WLs are affected by our publisher, but I really don't know how much.\n\nIn this post I’ll just share our WLs numbers and marketing beats that I associate with this numbers.\n\n**1. Our first 1000 WLs**\n\nSteam page of Urban Jungle went live on January 3rd 2024. It was translated into English, Russian, Japanese, Spanish and Chinese using Google translate. We hoped to get 100 WLs in a month, but Japanese twitter account u/IndieFreakJP made a post about us and it exploded. We had 1k on January 6th. \n\nWe quickly created twitter account and started posting about game too. \n\nI understand now, why Chris Zukowski always tells to translate Steam page into as many languages as possible. Our game is cute and cozy and it went viral among Japanese players. Twitter is a big social media for them, so arigatou gozaimas\n\n**2. 9000 and the first demo**\n\nAs we still were in shock after Steam page launch success, we started preparing the playable demo. In February 2024 we launched it, even though it was clunky, super simple and lacked polish whatsoever. We thought that pretty screenshots can create false expectations, and being gamers ourselves, we know, that gameplay is the king. \n\nAnd to our surprise, players loved it. They gave feedbacks, told that game is too easy, had weird bugs, but overall they wanted to play it. \n\nWe localized our demo to English and Russian, because we speak these languages, and our friend translated it into Japanese as well. So our most active supporters, I mean, Japanese players, were able to play demo too. \n\nEvery cozy gamer and game developer knows about Wholesome Games. They are huuuuge in terms of visibility. So we wrote them an email, and Matthew was so kind that he reposted a tweet about demo launch on their page. \n\nContent creators and streamers supported our lil game too and played it so much that we appeared as Top-2 in New &amp; Trending Demos on Steam. And speaking as a developer, it was a bad demo. But it was enough to prove our concept and vision.\n\nFirst demo was active till April 2024 and we slowly reached 9k wishlists that way\n\n**3. 17000 and networking**\n\nIn April we rebuilt the game almost completely and launched the second demo. And it was so much better gameplay wise.\n\nOur twitter account had \\~300 followers at that time. But the second demo launch tweet gained a lot of visibility and I still don’t know why. I think it’s a combination of accidental good photos and text that was written using very simple words and a lot of expression. Not usual “selling” tweet vibes, I mean.\n\nAnd this launch was more successful than the first. Big content creators noticed Urban Jungle and we got great videos from GamerGirlGale, CozyTeaGames, etc. It was like a dream come true, because I watch their videos and I play games they recommend. It was like an acceptance into the coolest club of the cutest games. \n\nWe experimented with TikTok and Reddit too, but tiktok videos didn’t perform that much and took too much time, also we live in Thailand, so English-speaking videos didn’t perform that well. But reddit was surprisingly good. It didn’t have enormous visibility, but our players are on Reddit and visibility to wishlist ratio was the highest here. \n\nWhile the demo was out, getting us wishlists, I decided to do some networking. I tried to reach other indies on Twitter and ask for their advice on marketing. And a lot of them answered. \n\nWe contacted Doot &amp; Blipbloop, who created Minami Lane, SlavaDev making Monterona, Keith from the team of Spirit City and Yulia, developer of Woodo. They helped us with support, kind words and advice, so I highly encourage you to speak to other indies. We’re all on the same boat and can, for example, cross promote each other. \n\nWith the increasing amount of devs that we know, we started to notice memes, challenges and trends and started to post them. And one meme surpassed our demo launch tweet, hitting 20k in visibility and 1k in likes.\n\nAnd in the end of the May 2024, we had 17k wishlists\n\n**4. 50000 and festivals**\n\nPreviously mentioned Chris Zukowski has discord channel How To Market a Game. And there is Holy Grail for all indies - spreadsheet with all upcoming festivals for game developers. \n\nStarting from January I’ve applied to ALL festivals that could feature Urban Jungle. I did it religiously, checking this spreadsheet every week for new entries. I skipped festivals that required an application fee, and the ones where our game wouldn’t fit. Applications to festivals open months before the date itself, so it’s really important to keep an eye on them. \n\nAlso if application is already closed, but you believe that your game fits this festival perfectly, it is still worth a try to apply anyway. I did so for the Women Led games festival, and wrote them an email that we missed the deadline. And organizer, Charmaine, replied that there are still 2 slots available. And with this slot we became a part of Summer Game Fest. \n\nAt the end of May 2024, Urban Jungle was featured in Pillow Fort Showcase, Cozy &amp; Family Friendly Games by Rokaplay, Guerilla Collective and Women Led Games. Three of them had feature on the first page of Steam. \n\nWe launched the third demo and new trailer before the beginning of the festivals and just went adrift. \n\nAnd by the end of June 2024, we had tripled our wishlist amount and reached 50000 WLs with 0$ spent on marketing (I didn't have a salary u know).\n\n**5. 80000 and Gamescom**\n\nSince June, we've been working with Assemble Entertainment and they will publish Urban Jungle and help us with marketing on release and post-launch support. We’re very happy to work with them, cuz now we can focus more on development and release of the game. They even helped us to get the spotlight in Guerilla Collective even before our agreement was signed. \n\nI stepped away a lil bit from marketing, but events where I signed up previously still helped us a lot in August-September 2024 and we got into TinyTeams and Wholesome games festivals.\n\nAnd then our publisher said \"Hey, you're nominated as The Most Wholesome game on Gamescom\" and we're like WHAT?! We didn't go there, traveling from Thailand to Germany would cost us months of rent, so we just got messages from Assemble Ent, how players are coming to the booth, how's their experience with the fourth demo (yeah, we love demos). We didn't win in nominated category, but the winner, Tavern Talk, totally deserved it. We were just happy to be there ahaha. And a lot of devs asked if we or publisher paid any money to get nominated, but we didn't. Assemble Ent just applied our game and it was chosen by the jury.\n\nIn the end of September 2024, we had 80000 WLs.\n\n**6. 93000 and SNF, release, porting, etc aaaaaaaah**\n\nLast year in January we dreamt of 1000 wishlists in the first month and our craziest wish was to have 7000 on release. 93000 is a hilariously crazy amount for a tiny team of 3 friends making their first game.\n\nAlso we know that wishlist amount is not equal to game sales. Everything can go wrong anytime. But these numbers really help with finding publishers and with motivation. It’s a very humbling thought that there is that amount of people who believe in you. And we’re beyond happy to know that so many players are waiting for our silly game about house plants. \n\n**Small tips &amp; tricks**\n\n1. Networking. Meet other indies, cross promote your games and just be friends. We live in Thailand, and this summer we’ve met awesome developers from Bangkok and Chiang Mai. Developing your games in the US or Europe is not the same as in SEA. There are cultural differences, taxes, legal stuff etc, so it’s good to ask someone about all of this. \n2. Networking. Again. Festival organizers are on Twitter. If they know about you, they’ll notice your application. Pillow Fort was very kind to accept us to their showcase in a twitter comment. And Rokaplay reposted our tweets too. Wholesome Games knows every cozy game developer in the world. They should know about you. \n3. Even a bad demo is a good demo. If you have a Steam page, your chances to get into festivals increase. If you have a demo, it increases even more. Also content creators can play it and create videos about it.\n4. We tried to contact content creators and streamers using e-mail in the beginning of development, but very few of them answered. But when the demo was released, small creators supported us and it led to big creators to notice us too. So small creators are the goal, they are the best, we love them with all our hearts\n5. Use memes and trends. #screenshotsaturday works well for us and occasional memes work well too. For example, there was a challenge \"Never stop 3d modeling\" in twitter and we got 30k impressions from it and 1k likes.\n\nJust fun fact: Urban Jungle was featured in Thai Facebook account with 6 million followers. But it was account of home appliances store. UJ is the only game in their feed. I don't know what happened, but it was very delightful :D\n\nSo, that’s everything that I wanted to share. We'll publish our 5th demo soon, and we'll see how well it will perform in Steam Next Fest. So count this post as one of my marketing attempts :\"D And release is around the corner too. We're totally not in panic, we're just really-really tired and over caffeinated.\n\nAlso, we got a lot of questions addressing our visual style and its pipeline. It’s very easy by the way, so pls let me know if I should make a post about it too.",
    "score": 603,
    "url": "https://reddit.com/r/gamedev/comments/1iu35c3/how_to_get_93k_wishlists_with_0_spent_on/",
    "created_at": "2025-02-20T16:53:59.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1je5dm0",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I learned the hard way why prototyping can make or break indie games",
    "text": "After over a decade in indie game dev, I've seen prototyping save (and sometimes nearly ruin) my projects. I'm sharing what I've learned the hard way, hoping it helps some of you avoid similar headaches.\n\nWhen I started out, I thought thorough planning on paper was enough; great ideas clearly defined should work, right? Wrong. Time after time, I've found that no amount of fancy documentation replaces building rough versions of mechanics and seeing if they're fun or not.\n\nLook at FTL: Faster Than Light! The devs prototyped their core roguelike spaceship mechanics super early. Because of this, they immediately knew which mechanics were engaging, and which just sounded cool on paper but sucked in practice. They avoided tons of painful rework and nailed the gameplay experience from the start.\n\nWith my own games, when I prototyped early, I quickly discovered what ideas genuinely worked versus what was awful when played. But here's the kicker, I've also skipped prototyping (usually when under time pressure or feeling overconfident), and every single time, it came back to bite me with expensive, frustrating rework.\n\nBut prototyping isn't some magic bullet either. I've struggled with the other extreme, getting stuck in endless prototyping hell (\"just one more tweak!\") and failing to commit. Early in my indie career, my perfectionism disguised as caution left me spinning my wheels for months. It felt productive, but it wasn't, it was just fancy procrastination. I've since learned to prototype just enough to validate core ideas and then force myself to move forward.\n\nNow, you! Has prototyping improved your games? Or maybe you skipped it and regretted it later? Have you struggled, like me, with knowing when to stop tweaking and commit?",
    "score": 595,
    "url": "https://reddit.com/r/gamedev/comments/1je5dm0/i_learned_the_hard_way_why_prototyping_can_make/",
    "created_at": "2025-03-18T13:48:47.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1jzympm",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Today I lost hope. I feel like I’ll spend my whole life working in a factory.",
    "text": "I’ve been learning game development for 8 years. In the last few years, I’ve lived in a cheap, crappy room, spending all my time improving my skills and portfolio. I had no time to chill or relax, because before and after my warehouse and factory jobs, I focused on improving myself.\n\nI invested all my savings to get into a 5-days-per-week internship. They told stories about how many interns got hired afterward, but when the period ended, they just said “thank you” and told me the contract was over.\n\nI’ve sent around 200 resumes. I even paid for a professional resume service — still, I landed zero interviews. Some people called me, seemed super interested in hiring me, then ghosted me. Last week, I had an interview appointment, but two hours before it, I got a message saying HR was sick and they had to cancel. Two days ago, they texted me that they changed their minds and won’t be hiring anyone.\n\nI work for €1600 a month, in a job I hate, surrounded by people I have nothing in common with. I feel like I’ll live my whole life in a low-quality, tiny room, working for a low salary in a job that’s destroying me mentally. There’s no hope for me. I’m still learning backend development — [ASP.NET](http://ASP.NET) Core — instead of just chilling after work. But I honestly don’t believe my life will have any value. I don’t see the purpose of keeping it this way.",
    "score": 568,
    "url": "https://reddit.com/r/gamedev/comments/1jzympm/today_i_lost_hope_i_feel_like_ill_spend_my_whole/",
    "created_at": "2025-04-15T18:03:19.000Z",
    "num_comments": 250
  },
  {
    "id": "reddit-1o5myja",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "This felt dumb… until it worked: $14.99 demanded extra depth it seems",
    "text": "I didn’t see it at first.\n\nToday, my Early Access sits at **Positive** on Steam and has 12,000+ wishlists. The release is planned for Dec 2.\n\nI started with a tiny Flash-style sim 4 years ago. Scope crept, like all other projects. I shipped a beta; players \"liked it\" but said it wasn’t deep enough for a sim.\n\nI built a full research tree and expanded further. Shipped a demo. New feedback: “We expect about $0.50 per hour of play. So I would pay $9.99 for this. I was targeting $14.99 for my first indie and didn’t want to disappoint players, so I added Challenge Mode, Career Mode, and took goals from 10 to 70, plus a deep story, rivals, and a Zachtronics-style histogram are coming for the release.\n\nPlayers are seeing the progress. Comments turned mostly positive on Steam for EA players. The lesson I learned from this is that your price is a promise, so match it with real depth and replay.\n\nIf I could redo one thing, I’d set depth targets before beta and guard scope harder. How would you balance scope, depth, and a $14.99 price?",
    "score": 550,
    "url": "https://reddit.com/r/gamedev/comments/1o5myja/this_felt_dumb_until_it_worked_1499_demanded/",
    "created_at": "2025-10-13T15:31:52.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1mtmgsf",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Postmortem: My first game with a total budget of $246 and a 6 month development timeline made over $3,000 in it's first week",
    "text": "**Game Details**\n\n* Title: Mythscroll\n* Price: $12.99 USD, with a 2 week 15% launch discount\n* Genres: Text-Based Sandbox CRPG\n* Elevator pitch: Mythscroll is a D&amp;D-inspired text-based CRPG featuring deep character building, choice and stat-based encounters with branching outcomes, and turn-based combat with a variety of fantasy/mythological creatures.\n* Steam page: [Mythscroll Steam Page](https://store.steampowered.com/app/3700080/Mythscroll/)\n\n**Budget breakdown - Total budget: $246**\n\n* Steam fee: $100 (will be reimbursed since I reached over $1k revenue)\n* Capsule art: $130, hired an artist from reddit\n* Kenney assets(used for map icons, ui borders, and custom cursor): $0 (got free on a special sale event)\n* Hand pixeled pixel art backgrounds: $2, itch asset pack (I plan to tip the artist I bought this pack from more once I get paid for the game)\n* Achievement icons: $6, itch asset packs\n* Fonts: $0, found free fonts with commercial permissions\n* Audio: $0, found free audio with commercial permissions\n* Marketing: $8, for one month of Twitter/X premium, probably not worth it imo, i stopped paying for it after one month\n\n**Timeline breakdown**\n\n* February 18th 2025: started developing the game\n* April 30th 2025: published store page to Steam and started sharing the game on various social accounts(x, threads, bluesky, reddit) a couple times a week\n* Gained around 700 wishlist over about a month of this\n* May 28th 2025: launched demo to Steam - 720 wishlists at the time of launching demo, demo launch only brought in 133 wishlists over the course of it's launch week\n* June 9th - 16th: participated in Steam Next Fest (2,727 total wishlists by the end, nearly 2k wishlists gained from Next Fest\n* Released game: Monday, August 11th 2025 - 3,385 total wishlists at launch\n* 99 copies sold on launch day, 1 positive review, $1,126 gross revenue\n* 51 copies sold the second day, 4 more positive reviews, and 1 very long and detailed negative review left towards the end of the day\n* 20 copies sold the third day, sales momentum was seemingly hurt significantly by the 1 negative review, as visibility didn't drop off nearly as much as sales did on this day. People were still seeing the game, but way fewer decided to buy.\n* 13 copies sold the fourth day, one more positive review and one more negative review came in\n* 4 copies sold the fifth day, this day was Friday, and I released a content and bug fix update as well. I also had 2 people reach out to me on my discord server about the game saying that they really were enjoying it, and I swallowed my pride and asked them to leave a review on Steam.\n* On the sixth day, both people who I asked to leave a review on Steam, left a positive review, and a third person from the discord who was upset about losing an item upon dying in the game, left a not recommended review, which is a bit of a bummer, but did bring me to 10 paid reviews, so I got my review score, 70% mostly positive. On this day I sold 32 copies, hitting the 10 review mark really does seem to make a difference.\n* On the seventh day (yesterday) I sold 70 copies. At the end of the seventh day I had sold a total of 289 copies and reached $3,228 in gross revenue. I also gained over 1,000 wishlists over launch week too, reaching around 4,400 total wishlists by the end of the seventh day.\n\n**My Takeaways**\n\n* I think making a very niche text-based game actually helped me reach my goals, because I had relatively small goals. I've seen people advise against making games like this because not a lot of people play text-based games, so the market is just tiny, which is fair and true, but my goals were small enough that the advice wasn't really applicable to me. I wasn't trying to sell thousands of copies, just like, make enough money so it would be as if I had a part time job during these past 6 months. I think/hope this style of game development is sustainable for me as well, because I actually really enjoy it, since it is both my work and my fun I often spend 12+ hours a day on it, and don't really take days off unless I have plans, because it's like, if I was taking time off work I'd want to do my hobby, and this is also my hobby lol. So, I can get a lot done in just 6 months. And then I can start a new project and not get burnt out on the old one. I already have my next 2 game ideas lol, both very different from my first one.\n* I don't think posting on social media made a big difference for this game, which makes sense since it's not very visually marketable. Except for my first post on the pcgaming subreddit that had a crazy upvote to wishlist conversion rate for some reason, I never really correlated my social media posts to a jump in wishlists. However, I did notice on the weeks I didn't post at all, I seemed to get less daily wishlists on average. So I feel like each social media post probably brought in a few wishlists, which does add up over time, so I guess I'd say it's worth it since it's free and doesn't take long.\n* I started game dev from game jams, I think this was good and bad for me. Good because I learned scope and how to set a timeline with planned deadlines from the start of the project, and stick to it, and release the project. Which, I did. The bad thing is though, since I am so inflexible on the release date once it's set, I released the game probably a few weeks before I should have, so I have content updates planned for every Friday of this month.\n* Reviews are everything, early on at least, it seems like they can make or break the game. I am currently incredibly anxious because just 1 more negative review will tip my game into \"mixed\" which I am trying my best to avoid. Currently 2 of the 3 people who left a negative review have responded positively to the updates I've already made and have planned, but neither have changed their review yet.\n\n**My Current Concerns**\n\nReviews and returns. As previously mentioned, I'm currently at 7/10 score on Steam and at risk of becoming overall \"mixed\". Also, my current return rate is 14-15%, which from what I've seen is on the higher end of average, and half of the returns are for the reason of \"not fun\" which stings, but I did expect and kept trying to prepare myself for, I know it's a really niche type of game, that doesn't even necessarily appeal to most people who enjoy text-based games.\n\nThere is no dialogue or deeply immersive descriptions in the game. One of the major inspirations for this game, other than D&amp;D, is Bitlife, in terms of the \"text-based\" style of the game. It is meant to be a sandbox game where your imagination and personal storylines fuel the moment to moment gameplay, and the game is there in support of that. I tried to communicate that with the tags, I don't use any \"lore\" or \"story\" tags, and I do use the \"sandbox\" and \"simulation\" tags. I haven't yet figured out how to communicate it better in the description of the game though, which I think would help with reducing the refund rate and frequency of negative reviews.\n\n**EDIT:**\n\nI have a lot of people fairly pointing out that my salary/hourly wage isn't included in the budget, I elaborate more on this in a few comments but my living expenses were fully covered during these past 6 months, and I was not, and would not have, made any sort of decent hourly wage if not working full time on this game.\n\nBefore starting this project I was already not really working much, just a handful of hours a week, and sometimes not even that. I didn't initially say this in the post because it's obviously shameful, in a brief defense of myself I want to say that in the first couple years of our relationship I was the one working full time paying most bills, with him working part time or in school or just doing other things for a bit, and then it was pretty balanced for awhile, but I started to have a harder time and the roles started to switch in the past couple years.\n\nBut this money that the game is making now will be going towards me contributing to our bills again, which is what I meant in the comment where I said \"if every game I make does at least this well, I can keep doing this\", because I only really need to make enough money to pay for about half of our living expenses during the time I make the game. We never planned on living on just his income forever, I just asked if he'd take a chance and let me do this and he agreed, and it is now doing well enough that I plan to start my next project in September.",
    "score": 523,
    "url": "https://reddit.com/r/gamedev/comments/1mtmgsf/postmortem_my_first_game_with_a_total_budget_of/",
    "created_at": "2025-08-18T13:44:41.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1ox1yak",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "We released our game with 13,000 wishlists. It made $36,000 gross revenue in the first week!",
    "text": "One and a half year ago we quit our jobs to make indie games full-time. What could go wrong? We want to take this opportunity and share a bit of our experience and learnings.\n\n**First some context:**  \n  \n**Game:** Tiny Auto Knights (async PvP auto battler, think Super Auto Pets but with a 3x3 grid)  \n[https://store.steampowered.com/app/3405540/Tiny\\_Auto\\_Knights/](https://store.steampowered.com/app/3405540/Tiny_Auto_Knights/?utm_source=reddit&amp;utm_campaign=postmortem)\n\n  \n**Prior experience**  \n**-------------------**\n\nWe're a team of 3 programmers and have met at our prior employer where we mainly did mobile ports of PC / console titles (*Titan Quest*, *Wreckfest* and *Spongebob: The Cosmic Shake* to name a few). So we're definitely not beginners and have already shipped some games (on mobile). And while the games we worked on had some cool IPs and were cool games in general, we wanted to do our own games and also wanted to do games for PC, as those are the games we play ourselves.\n\nWe spent the first month or so with the bureaucratic nightmare of founding a company (we're from Germany) and doing a few game jams to find a game concept we want to develop to a full game. As we played quite a bit of Super Auto Pets in our lunch breaks, we had the idea to do something similar and \"fix\" some of the things we didn't like about the game. This prototype was also our most successful game jam project and so we decided to bring this game to full release. This was around August / September 2024.\n\n**Numbers, numbers, numbers**  \n**----------------------------------**\n\n**Timeline**  \nSteam page: December 27, 2024  \nPublic playtest: January 17, 2025  \nSteam demo: May 15, 2025  \nFull release: November 7, 2025\n\n**Numbers before release**  \nDemo players: \\~12,500  \nDemo playtime: 53min median | 2h59min average  \nWishlists 1 day before release: \\~**12,000**  \nWishlists when hitting the release button: \\~**13,000**\n\n**Numbers now (1 week after release)**  \nWishlists: **18,507**  \nGross revenue: **$36,887**  \nUnits sold: **5,309**  \nReviews: 118 total | 98 positive | 20 negative | 83% positive  \nPlaytime: 1h29min median | 3h48min average\n\n  \n**Learnings**  \n**-----------**\n\n**Playtests**  \nGive your game to players and let them give you feedback! Use itch, use the Steam playtest feature, use conventions and indie dev meetings. This feedback is super important to make a good game and make course corrections before it's too late. This will also help you to get fans and super-fans. Those are people that love your game so much that they will tell their friends about it. If you have the chance to go to a gaming convention and exhibit your game there, use this. It's probably not worth it for promoting, but it's super useful to watch fresh people play your game and see where they struggle. A must have for a good onboarding/tutorial. It's also a great opportunity to meet other indie devs.\n\n**Demo**  \nIf you don't have one of those:   \n\\- super beautiful graphics  \n\\- a proven record of amazing games  \n\\- you're famous  \nyou won't get a lot of wishlists without people actually playing your demo (or watching an influencer play the demo). We had less than 2,000 WL before releasing the demo and most of them came from the public playtest before. Make a good, polished demo and update it regularly and you're off to a good start.\n\n**Festivals**  \nI don't know if it was something specific about our game or the festivals we were in, but we didn't really see a big boost from them. Would still apply for all of them, but don't expect wonders.\n\n**Content creators**  \nWe contacted over 400 content creators a few weeks before release and gave them a pre-release key. We made a curated, hand picked list of content creators playing similar games or indie games in general. Unfortunately none of the bigger content creators made content on the release day. We got some videos with 1-3k views and had some streamers with less than 200 viewers play the game on release day and a few days afterwards. But a lot of the smaller content creators (less than 500 views/video on YT) made content and they were really happy that we gave them access to the game.  \nWe're not really sure why the game wasn't picked up by any bigger content creator (yet). The demo got a video from Olexa (\\~35k views) and two videos from German creator Maxim (both videos \\~20k views).\n\n**Launch discount &amp; bundles**  \nWe went for $14.99 and a launch discount of 35% to get back under $10 for the first two weeks. The thinking here is that $10 is an important mental barrier for buying new games. We also reached out to a lot of devs with similar games to make bundles. This worked really well. We managed to get a bundle with Backpack Battles, which helped a lot with sales. But the best part is that we actually stayed in contact with a lot of those devs and are regularly chatting about our current and future projects. You can just reach out to other indie devs and they will often respond and will be happy about it!\n\n  \n**So was it worth it?**  \n**---------------------**  \nWe found estimates for the first year of revenue to be around \\~4x of the first week. With \\~$36k gross in the first week, this will bring us to $144k gross in one year. Let's subtract refunds, VAT, Steam's 30%, cost for localization, our Asian publisher's cut, etc and we will have maybe $50-60k. We worked approximately 15 months on this game with 3 full time devs.  \nDividing the $60k by 45 (15 months \\* 3) we would have each earned a salary of \\~$1,3k/month. And that's before income taxes, health insurance etc.  \nSo as a standalone project it wasn't really worth it. But we see it as the first of many games and a solid start. If you want to earn a lot of money, don't make games.  \nBut we want to make games.\n\n\n\nPlease don't hesitate to ask questions, we're open to share our numbers where possible.",
    "score": 477,
    "url": "https://reddit.com/r/gamedev/comments/1ox1yak/we_released_our_game_with_13000_wishlists_it_made/",
    "created_at": "2025-11-14T16:57:10.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1jzqql6",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "The 42 Immutable Laws of Gamedev by Paul Kilduff-Taylor. Which ones hit home, and which ones you disagree with?",
    "text": "I was listening to the last episode of **The Business of Videogames** podcast by Shams Jorjani and Fernando Rizo (this is literally the best podcast for indies that nobody seems to know about), and they had **Paul Kilduff-Taylor** as a guest, the founder of Mode 7 who has been into gamedev for more than 20 years. On the podcast, he talked about [an article he wrote a while ago](https://modecollapse.substack.com/p/42-essential-game-dev-tips-that-are) where he laid out 42 tips on gamedev (title of the article is: *42 Essential Game Dev Tips That Are Immutably Correct and Must Never Be Disputed by Anyone Ever At Any Time!*). During the podcast, he is pressed on some of the tips (e.g. the one on no genre is ever dead) and goes into more depth on why he thinks that way.\n\nHere are the 42 tips he wrote. Which ones hit home for you, and which ones you strongly disagree with?\n\n1. Use source control or at least make regular backups\n2. Your game is *likely* both too boring and too shallow\n3. Your pitch should include a budget\n4. Your budget should be justifiable using **non-outlier** comparators\n5. A stupid idea that would make your friends laugh is often a great concept\n6. Criticise a game you hate by making a good version of it\n7. Changing a core mechanic usually means that you need a new ground-up design\n8. Design documents are only bad because most people write them badly\n9. Make the smallest viable prototype in each iteration\n10. Players need an objective even if they are looking to be distracted from it\n11. No genre is ever dead or oversaturated\n12. Games in difficult categories need to be doing something truly exceptional\n13. Learn the history of games\n14. Forget the history of games! Unpredictable novelty arises every year\n15. Great games have been made by both amazing and terrible coders\n16. Be as messy as you want to get your game design locked…\n17. …*then* think about readability, performance, extensibility, modularity, portability…\n18. Procedural generation is a stylistic choice not a cost-reduction methodology\n19. Depth is almost always more important than UX\n20. Plan for exit even if you plan to never exit\n21. Your opinion of DLC is likely not based on data\n22. There’s no point owning your IP unless you use it, license it or sell your company\n23. PR will always matter but most devs don't understand what PR is\n24. People want to hear about even the most mundane parts of your dev process\n25. Be grateful when you win awards and gracious (or silent) when you don't\n26. Announce your game and launch your Steam page simultaneously\n27. Get your Steam tags right\n28. Make sure your announcement trailer *destroys* its intended audience\n29. Excite, intrigue, inspire with possibilities\n30. Your announcement is an invitation to your game’s community\n31. Make “be respectful” a community rule and enforce it vigorously\n32. Celebrate great community members\n33. Post updates *at minimum* once per month\n34. Community trust is established by correctly calling your shots\n35. Find an accountant who understands games\n36. Understand salaries, dividends and pension contributions fully\n37. Find a lawyer you can trust with anything\n38. Read contracts as if the identity of the counterparty was unknown to you\n39. A publisher without a defined advantage is just expensive money\n40. Just because you had a bad publisher once doesn’t mean all publishers are bad\n41. “Get publisher money” is hustling. “Make a profitable game” is a real ambition\n42. Keep trying - be specific, optimistic and generous",
    "score": 382,
    "url": "https://reddit.com/r/gamedev/comments/1jzqql6/the_42_immutable_laws_of_gamedev_by_paul/",
    "created_at": "2025-04-15T12:33:56.000Z",
    "num_comments": 194
  },
  {
    "id": "reddit-1o8bvsq",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "How the heck are indie developers, especially one-man-crews, supposed to make any money from their games?",
    "text": "I mean, there are plenty of games on the market - way more than there is a demand for, I'd believe - and many of them are free. And if a game is not free, one can get it for free by pirating (I don't support piracy, but it's a reality). But if a game copy manages to get sold after all, it's sold for 5 or 10 bucks - which is nothing when taking in account that at least few months of full-time work was put into development. On top of that, half of the revenue gets eaten by platform (Steam) and taxes, so at the end indies get a mcdonalds salary - if they're lucky.\n\nSo I wonder, how the heck are indie developers, especially one-man-crews, supposed to make any money from their games? How do they survive?Indie game dev business sounds more like a lottery with a bad financial reward to me, rather than a sustainable business.",
    "score": 362,
    "url": "https://reddit.com/r/gamedev/comments/1o8bvsq/how_the_heck_are_indie_developers_especially/",
    "created_at": "2025-10-16T17:05:57.000Z",
    "num_comments": 317
  },
  {
    "id": "reddit-1ju2qh9",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Make something small. Please. Your (future) career damn near depends on it.",
    "text": "I see so many folks want to make these grand things. Whether that is for a portfolio piece or an actual game. So this is my 2 cents as someone who has been in multiple AAA  interviews for candidates that range from juniors to Directors. \n\nMotivation always dies out after the first couple months in this industry. It's fun, flashy, cool, etc. at first but then it's a burden and \"too hard\" or \"over scoped\" when you are really neck deep in the shits. I really think it's killing folks chances at 1. Launching something and 2. Getting their foot into the industry. Trying to build something with complex systems, crazy graphics and genre defining gameplay is only going to make you depressed in a few short months.\n\nNow you feel like you wasted months and getting imposter syndrome from folks talking about stuff on Linkedin.\n\nInstead, take your time and build something small and launch it. Something that can be beat in a hour, maybe 2. Get feedback or simply just look at what you made and grow off that. 9/10 you know exactly where the pain points are. Reiterate on the design again, and again, and again until you are ACTIVELY learning from it.\nFinish something small, work on a beautiful corner. You can learn so much by simply just finishing. That's the key. You can have the most incredibly worded resume but that portfolio is and will forever be king. I need to know I can trust you when shit is HOT in the kitchen to get the work done. We are all under the gun, as you can see looking at the window at the industry.\n\nOf course there are the special game dev god chosen ones who we all know about but you should go into this industry thinking it \"could\" happen to you. Not that it \"will\". Start small, learn, create, fail and do it again. You got this. Don't take yourself out before you even begin.",
    "score": 359,
    "url": "https://reddit.com/r/gamedev/comments/1ju2qh9/make_something_small_please_your_future_career/",
    "created_at": "2025-04-08T02:09:41.000Z",
    "num_comments": 100
  },
  {
    "id": "reddit-1jpxj9c",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "My Very First Game Development Job (1999)",
    "text": "Hi I'm one of the creators of Call of Duty, A distinction held by only 27 people, This story is about how I landed my very first Game development job:\n\nI never knew in a million years that I would get to become a game developer.  I didn't see it back then.  There were ingredients that came together almost miraculously to jar me into action.\n\nI was a kid working on something like my 3rd or 4th year of Burger King, I worked hard to afford myself a Gaming PC, one equipped with 3dfx graphics, Celeron 300a (I think mine overclocked all the way to 450!), and a good-sized monitor (19Inch Beast of a CRT) that I would lug to a local LAN party club.\n\nI was pretty good at working software. I gravitated towards programming and CAD/CAM classes in high school. The curriculum was generally too easy.  In a Basic programming class, I did my own thing and created a program that would bounce lines like the screensavers of that time would.  In another class I created animations using HyperCard transitions and entertained the whole class.\n\nAn AutoCAD teacher gave a File cabinet of work to do at your own pace. I finished the work in 2 weeks and used that class as my sleep class. (stayed up too late playing Quake). I nearly failed this class, the teacher wanted me to reach higher “You should be designing Rocket Ships, not sleeping”.  He allowed me to pass on the condition that I helped him draw up a plan for his friend at my Lunch Hour. I was strained on my credits, so this was critical for me to pass high school!  The circumstance of my low credits in high school was that I missed a year for bereavement so I couldn’t afford any missed credits. It was truly a difficult time.\n\nAnother teacher teaching CAM (Computer Aided Manufacturing?) did the same, working through all the curriculum in a short amount of time. Having nothing left to do, the question came up, What Do you want to do? There was a small opportunity there to leave my Kush job at Burger King to work at a Computer Case building plant drawing plans, but I did not get the job.\n\nAt my LAN party, a friend had a surprise announcement.  HE was doing LEVEL DESIGN Remotely for a company in the UK.  He showed me his Unreal demo that he used to apply for the contract, it was a pretty basic challenge to which I don't remember much of the details but surely, I could create a one room area and apply for myself.  I had an answer to the question my CAM Teacher had asked me.\n\nThis teacher heard my plan and allowed me to lug my own Personal Computer into the classroom to try and learn how to create Unreal Levels so that I could apply myself to this job. I was working right out of Highschool after I submitted my own demo.  A lush organic Cave that had water in it, and mosquito’s buzzing around.  A button down beneath the water opened the door above inside the cave to allow you to escape.\n\nThe contract I was on was paid per-level and the game was to be Unreal on the PSX. That’s PlayStation 1! I was zipping through “stages” and getting paid. How awesome! Unreal back then, was all about CSG operations.  There were a handful of primitive shapes you could use to carve out the world. Wanting more organic terrain with the limited number of polygons we had to work with I came up with a tricky method of creating terrain that didn’t just look like skewed boxes and primitive shapes carved out (this would rapidly increase the polycount).  I could the technique the “Blob Method”, this involved taking a 3-sided pyramid (all triangles) and duplicating it until I had a cube made of triangles, from there I would duplicate the cube and union it so I could get more triangles, then each vertex would be pushed out to create organic terrain.  This madness would persist throughout my career as a Level Designer.  I did things that nobody in their right mind would do.  Maybe I’ll talk more about that in future story time.\n\nThe project was ultimately cancelled, while disappointing it gave me a ton of real-world experience.  Recently I was approached about this for a “revival project”, It amazes me how passionate fans of these games can be.",
    "score": 353,
    "url": "https://reddit.com/r/gamedev/comments/1jpxj9c/my_very_first_game_development_job_1999/",
    "created_at": "2025-04-02T19:31:49.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1ohihpl",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "What in the God's name have I been making for 12 f-ing years?",
    "text": "Yesterday I published a [half-joking post](https://www.reddit.com/r/gamedev/comments/1ogyb7b/dear_soloindie_game_developers_would_you_be_so/) on this subreddit, and it got some traction. However, the comment that received even more upvotes than the post itself was this:\n\n*\"12 years on a mobile game? What are you making?\"*\n\nThere were quite a few others, like the one I created my title from: *\"What in God's name have you been making for 12 f\\*cking years?\"*, or another one: *\"If you've developed a mobile game for 12 years, it's probably going to be bad\"*.\n\nSo, I decided to actually answer the question and share the story of my game - especially since such long-term projects are pretty unusual these days, and most solo/indie developers seem to focus on shorter development cycles.\n\nAnd you can decide how bad the game turned out to be.\n\nI'll try to answer all the main questions:\n\n* What game am I making?\n* Why has it taken so long?\n* Why do I keep working on it?\n* How much money has it earned so far? and even\n* How do I promote my game?\n\n# TL;DR\n\nI started making an idle/incremental game **back in 2013** and released it as a Flash game on Kongregate **in 2016**. It turned out to be quite successful, got a lot of traction and **earned a decent profit** from in-app purchases over the next four years, while I focused completely on fixing bugs, adding features, and creating more and more content.\n\n**In 2020**, when Flash technology died, I decided to port the game to Unity and publish it on mobile. **In May of this year (2025)**, I finally released it on Google Play. Currently I'm still working on it (and probably will keep doing so).\n\n# Wrong assumption\n\nOne wrong assumption that commenters are probably making is that when I say I've been working on the game for 12 years, it means the game is still not released.\n\nThat's not true! The first version of the game was released back in 2016, 3 years after I started developing it. I mean, it's still a pretty long development cycle, just not 12-years long, right?\n\n# What game am I making?\n\nAt the end of 2013, I stumbled upon **Cookie Clicker** \\- an idle/incremental game that had just been released at the time - and I completely fell in love with the concept.\n\nHowever, as a game developer, I instantly found hundreds of aspects that could be added or improved to make the game even better. I guess many people here know exactly what I'm talking about.\n\nSo, I got to work right away. And that's how my own idle/incremental game was born. I called it **Get a Little Gold**, because instead of baking cookies, players collect gold by clicking on a stone in the middle of the screen.\n\nAt that time, idle games were almost non-existent. Name any popular title in this genre, and I'm 100% sure it was released after I started working on mine. *Clicker Heroes, NGU Idle, Antimatter Dimensions, Trimps*, even *Adventure Capitalist* \\- all of these came out after 2013.\n\nSo **Get a Little Gold** was one of the pioneers of its genre, and many concepts that are now widely used were first introduced in my game. For example, challenges and multiple layers of prestige.\n\n# Why did it take so long?\n\nDespite looking simple on the surface, the game is actually quite deep and packed with content that gradually reveals itself as players progress, prestige, and unlock new layers, modes and upgrades. In its current state, it will likely take you 3-4 months just to reach the late midgame and unlock all the main modes.\n\nMoreover, in 2014 (a year after I started working on the game) my daughter was born. That made me absolutely happy, but it also affected my productivity not in the best way.\n\nUnsurprisingly, it took me **3 full years** to create and balance the first version of the game before finally publishing it on Kongregate.\n\nPlayers on Kongregate seemed to really enjoy the game, and that motivated me to keep improving it and adding more content like new challenges, modes, and unlocks. So I kept working on it for the **next 4 years**, releasing about **40 major updates** (almost one per month!).\n\nUntil, in 2020, Flash Player was discontinued (stopped working in browsers), and I ended up with a popular and loved game that couldn't be played anymore.\n\nThat's why I decided to port my game to Unity and bring it to mobile devices. Honestly, I always thought idle games were a perfect fit for mobile, but I'd never had the chance to make one. The end of Flash felt like a sign that it was finally time.\n\nHowever, to do that, I first had to learn Unity and C#, since I'd only ever worked with Flash and its ActionScript 3 programming language before.\n\nIt took me **about a year to learn Unity and another one to rewrite nearly half of the game**, when russia invaded my country and launched missiles on my hometown. The war terminated development for a full year. During that time, I created another short project about the russian invasion - but that's another story.\n\nI returned to working on **Get a Little Gold** in mid-2023 and kept developing it until, finally, in **May 2025**, I finished the port and released it on Google Play.\n\n# Why do I keep working on it?\n\n**Get a Little Gold** is my most successful project so far. Before that, I had made a few smaller games, but none of them ever reached the numbers that Get a Little Gold did. Not only did it gather **over 2 million plays on Kongregate** and become one of the most played idle games on the portal, but it also started generating a pretty decent income through in-app purchases. I'll get back to the actual numbers a bit later.\n\nThat's why I decided to invest even more time into porting the game and releasing it on mobile devices.\n\nThe game also managed to build an **incredibly friendly and dedicated community on Discord**. These people have been waiting and supporting me throughout the entire process of porting the game. Honestly, I don't think I would have been able to finish the game without their support.\n\nRight now, I'm working on the iOS version of Get a Little Gold, which will hopefully be released in 2026.\n\nAnd as long as people keep playing, I plan to keep updating the game and adding new content.\n\n# What about money?\n\nDuring the 4 years when the game was active on Kongregate, it earned **almost $105,000** (around 90% from in-app purchases and the remaining 10% from ads).\n\nI know that's not much (especially since it was further reduced by Kongregate's commission and taxes), but my monthly \"salary\" still ended up being considerably higher than the average salary in Ukraine at that time. At the same time, I'm fully aware that in many Western countries it would be impossible to live on that income.\n\nAfter releasing the game on Google Play, it now earns **a little over $1,000 per month** on average, and I'm doing my best to keep improving it and hopefully increase that number. I also hope that releasing the game on iOS will help boost the revenue.\n\n# What have I done to promote the game?\n\nFirst of all, my main source of promotion has been players who loved the original Kongregate version. They helped me test the mobile version and became its first players.\n\nAdditionally, a little over 2 years ago I created **a YouTube channel** where I share my development journey and post devlogs. For example, here's a video where I tell the full story of the game in detail: [How I solo created the game that earned more than $100K](https://youtu.be/xUVbQG4_pe0)\n\nFinally, since I don't have any budget to spend on ads, the only other promotion I've done is a couple of Reddit posts. Genre-specific subreddits like r/incremental_games can be a great way to showcase your game and attract some players.\n\nAlso, as a solo game developer with 15 years of experience, I'm fully aware that developers rarely play other developers' games. So, speaking about reddit posts, believe it or not, the one you are reading right now wasn't made to promote my game, but rather to share my somewhat unusual experience, which I hope might be useful to some of you.\n\nWith that said, if anyone decides to give my game a try, I'd really appreciate your thoughts: [Get a Little Gold on Google Play](https://play.google.com/store/apps/details?id=com.TheGamestStudio.GetaLittleGold)\n\nThis was a long post, and I tried to cover everything, but if you still have any questions, feel free to ask them in the comments. And thank you for reading all the way to the end!",
    "score": 326,
    "url": "https://reddit.com/r/gamedev/comments/1ohihpl/what_in_the_gods_name_have_i_been_making_for_12/",
    "created_at": "2025-10-27T16:06:04.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1l4vqe9",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "My film/tv career is over, where to start with game development?",
    "text": "Worked my ass off for 15 years in the camera department. Put over 70 seasons of television on the air. All of it meaningless as the past two years have seen my industry absolutely disappear.\n\nHave always loved games (which doesn’t matter) and I’ve got some solid ideas for simple games focused on narrative design through gameplay elements.\n\nI do have some money to spend on education/equipment if that changes any suggestions. I know there are many posts like this, and I see alot of good suggestions. But if you were 40 and at a crossroads in your career, where would you start if you could do it all over again?\n\n**Update**\n\nI am completely overwhelmed by the response to my post. Thanks everyone for words of encouragement and I am still processing all of this new information. To those who reached out with advice and words of encouragement, thank you! It’s all gonna work out somehow and I’m not giving up!",
    "score": 321,
    "url": "https://reddit.com/r/gamedev/comments/1l4vqe9/my_filmtv_career_is_over_where_to_start_with_game/",
    "created_at": "2025-06-06T15:46:27.000Z",
    "num_comments": 86
  },
  {
    "id": "reddit-1hryl4w",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "5 Games Released on Steam—$48k Revenue Later, Indie Dev Still Feels Out of Reach. What Should I Do Next?",
    "text": "I’ve released **5 games on Steam** over the past few years, earning **$48,302 total revenue** across **11,692 units sold**—but I still can’t make indie dev a full-time career.\n\n**Quick breakdown of my games:**\n\n* **PEGGO!** – $15,613, **5,851 units**. My most consistent seller. Incremental pachinko game with **“Mostly Positive”** reviews.\n* **Dead Unending** – $28,117, **3,524 units**. My highest revenue game ($10 price), but reviews are **Mixed** and burnout hit hard during development.\n* **Incremental Island** – $2,799, **1,029 units**. Launched recently and slowly building momentum.\n* **Portal Puzzle** – $161, **59 units**. Great game but flopped because I skipped marketing entirely.\n* **Level Down** – Launching June 2025. Hoping this one does better.\n\n**Marketing So Far:**\n\n* **Reddit** has been my best tool—consistent sales when I post in relevant subs.\n* **YouTube** occasionally hit big when creators like **Cartoonz** picked up my games, but results have been unpredictable.\n* Steam sales always boost revenue, but only temporarily.\n\n**The Problem:**  \nI’ve graduated with a **CS degree**, and now I’m unsure what’s next. Indie dev is the dream, but it doesn’t feel **sustainable** yet. I’m stuck between pushing harder to grow sales or looking for a more traditional job.\n\n**What I Need Help With:**\n\n* How do I **break out** of this earnings plateau and **scale up** my games?\n* What’s worked for other devs trying to grow from hobby income to **full-time indie dev**?\n* Should I **double down** on my marketing strategies or **pivot** entirely?\n* How do you know when to **stop** pushing a game and move on to the next one?\n\nI’d love to hear advice from anyone who’s made this work—or even from those still trying. Thanks for reading!\n\n**Links to my games for context (feedback always welcome):**\n\n* [PEGGO!](https://store.steampowered.com/app/1684820/PEGGO/)\n* [Dead Unending](https://store.steampowered.com/app/2236240/Dead_Unending/)\n* [Incremental Island](https://store.steampowered.com/app/2847980/Incremental_Island/)\n* [Portal Puzzle](https://store.steampowered.com/app/2611630/Portal_Puzzle/)\n* [Level Down (Upcoming)](https://store.steampowered.com/app/2966910/Level_Down/)",
    "score": 316,
    "url": "https://reddit.com/r/gamedev/comments/1hryl4w/5_games_released_on_steam48k_revenue_later_indie/",
    "created_at": "2025-01-02T17:07:30.000Z",
    "num_comments": 125
  },
  {
    "id": "reddit-1lcstlc",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "The biggest problem people have in game dev has nothing to do with creating games.",
    "text": "Now I’m not claiming to be a famous game developer or even a good one at all, I just do it as a hobby. But I do run a business and have experience in that department.\n\nThe biggest issue I see with people in game development across all skill levels and technical experiences. Is that they fail to understand that they are creating a product and selling a product which is essentially running a business,may that be big or small.\n\nManaging your project (project management) wondering what game (product) to build ? Knowing if people will even like it (user validation) getting people to find your game and buy it (marketing) managing external/internal team help (business management) \n\nBasically all the skills that you will find with running a game project completely fall under all the skills you will find with running any type of business. I’d recommend if you are struggling with any of these, that yes whilst specific game dev resources may help, have a look at general advice/tutorials on project management, marketing, finding team members etc etc . It will all directly apply to your project \n\nAnd in the same sense as running any type of business, it’s always a risk. It’s not a sure fire job with a salary, there are no guarantees and no one is going to hold your hand.\n\nMost people start their passion business as part time evening jobs, it’s no different in game dev. And people quit to work on their dream job being a game dev. If that’s the case, you need to figure out your cash flow not just build a game you like.\n\nBut if you get it right and create a fantastic product that consumers actually want to buy. Then you’re in for winner! \n",
    "score": 304,
    "url": "https://reddit.com/r/gamedev/comments/1lcstlc/the_biggest_problem_people_have_in_game_dev_has/",
    "created_at": "2025-06-16T13:29:00.000Z",
    "num_comments": 177
  },
  {
    "id": "reddit-1pb7uxn",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "How is it that animators are highly in demand, yet wages are so low?",
    "text": "I M21 study illustration in Tokyo but lately have been thinking a lot about animation as well. Practically speaking wages are low for both, so the question is more general for the art industry I guess. In Tokyo, getting an education in animation could easily cost between 5-10 million yen. Meanwhile average salary for animators is like 2 million a year. How do people who do animation professionally survive? Essentially you sink a fortune into learning it and get a barely survivable wage in return. I have heard that the increased demand in anime has lead to a severe shortage of well trained animators. Yet wages remain low. Why? Is the money just not there?\n\nI am getting a little disillusioned with what I‘m doing here. I knew that conditions were tough but not this bad. I‘ve been here for a year and have burnt 3.5 million yen in my parents‘ savings. Lowkey thinking of giving up at this point.\n\nThis type of post might not be what this place is for, I’m not sure, so sorry about that. I just hoped to hear some opinions and perspectives on this.",
    "score": 298,
    "url": "https://reddit.com/r/animation/comments/1pb7uxn/how_is_it_that_animators_are_highly_in_demand_yet/",
    "created_at": "2025-12-01T08:51:08.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1l0aagn",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Making a game doesn't have to be a business",
    "text": "I see a lot of discussion here and in similar areas about wanting to make a game and release it and those talk a lot about marketing, selling, etc. I wanted to make this post because I've always framed it this way too, but honestly, I've gotten a lot of satisfaction from friends, family, participants in game jams, etc playing my games with no commercial business at all. I know we can share on itch, any social media, etc.\n\nCaveat: I have a successful career and im not trying to start a business. Partly because I've run businesses and know that making a game would only be a fraction of the work. Not framing my success with commercial success keeps it fulfilling. Anyone else have similar experiences? \n\nBig note: this is not an \"artists should give away their work\" post. No one is _entitled_ to your art without fair compensation. Just saying that you haven't failed if you choose not to focus on the capital",
    "score": 289,
    "url": "https://reddit.com/r/gamedev/comments/1l0aagn/making_a_game_doesnt_have_to_be_a_business/",
    "created_at": "2025-05-31T23:09:33.000Z",
    "num_comments": 85
  },
  {
    "id": "reddit-1lsw8fv",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Advice from a Game Designer of 15+ years affected by the recent layoffs",
    "text": "I’ve recently been impacted by the madness, and have some free time on my hands now. \n\nI’m considering having some (free) 1-1 calls to answer any questions, provide advice, share my experiences. Whether you’re looking to find ways to grow or are feeling disheartened with the state of things right now. \n\nI believe there is a lot about the discipline that isn’t widely discussed, I’d like to change that. \n\nI have worked in PC, Console, Mobile throughout my career. With big and small publishers, for indies, work for hire, own startup, contracts, freelance, and probably more. My game design experience covers a very broad spectrum of the discipline. \n\nIt would be a candid conversation of what it is really like being a game designer.\n\nJust to state the obvious: I won’t be breaking any NDAs, leaking or sharing any confidential insider info. It’s rough out there right now, and I would like to help.\n\nI’ll try a few of these first and if they go well I might set up a calendar to book directly.",
    "score": 289,
    "url": "https://reddit.com/r/gamedev/comments/1lsw8fv/advice_from_a_game_designer_of_15_years_affected/",
    "created_at": "2025-07-06T08:23:54.000Z",
    "num_comments": 108
  },
  {
    "id": "reddit-1ksri7n",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "37 yrs old no experience whatsoever",
    "text": "I’m a 37 years old dad, working as a longshoreman. I’ve been gaming since I was 5 years old.\n\nLast week I broke both my shinbone and fibula in the right leg, in a nasty fall at work, and I’m in for a pretty long recovery at home. Luckily, I have a pretty good salary and I’ll get paid 90% of it over the next months (Thank god for Quebec’s CNESST).\n\nI’ve been thinking about what I could do, and pondering if I could try making a small game, from scratch, but I have literally **Zero** experience in it, and my laptop is a 2017 Macbook Pro… am I fucked from the get go?\n\nHow could I dip into this hobby, and where should I start from?",
    "score": 238,
    "url": "https://reddit.com/r/gamedev/comments/1ksri7n/37_yrs_old_no_experience_whatsoever/",
    "created_at": "2025-05-22T14:02:39.000Z",
    "num_comments": 208
  },
  {
    "id": "reddit-1j11z0v",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "This is how we gathered 100k wishlists before our demo launch, capitalizing on a successful previous title",
    "text": "Heads up: this thread might not be the most useful for many indie developers out there because the step of releasing a first successful game is a different kind of  challenge.\nBut I wanted to share it for those who might be interested - how we capitalized on a first successful title ([Monster Sanctuary](https://store.steampowered.com/app/814370/Monster_Sanctuary/)), which started as a solo project, to now running a small indie dev team of 14 people working on our second project [Aethermancer](https://store.steampowered.com/app/2288470/Aethermancer/). \n\n([I did write a post mortem about the first project two years ago](https://www.reddit.com/r/gamedev/comments/11oje5z/my_first_game_sold_over_half_a_million_times_how/))\n\n---------------------------\n\nTL;DR - for comparisons sake:\n\n**Monster Sanctuary had**\n\n~2k wishlists on first demo launch (in spring 2018)\n\n~8k On Kickstarter (fall 2018)\n\n~40k on Early Access launch (summer 2019)\n\n~140k on Full launch (fall 2020)\n(tho keep in mind, after EA launch the wishlist number gets inflated quickly and is less important)\n\n**Aethermancer had**\n\n~45k wishlists after first month of steam page launch (in spring 2023)\n\n~100k wishlists on demo launch (10. February 2025)\n\n~150k wishlists after first two weaks of demo launch and going into the steam next fest\n\n~ heading towards scratching 200k wishlists after steam next fest ends\n\n---------------------------\n\n**Before the steampage launch for our second project** \n\nhere are the things I think we did quite well with our first project, which helped greatly getting a good head start on the announcement of our second project later:\n\n- Took the time and polished the first game as much as possible. Took a lot of feedback during the demo and early access and tried to make it as best as possible based on it. Always took high effort to keep\nit as bug free as possible. The most important goal was always to have a great game. This helped greatly to have a good Steam review score on the game.\n\n- Didn't engage in any shady or unpopular business practices, like microtransactions, pay2win, treating our employees/contractors badly.\n\n- Released updates for the game post launch, including a free DLC. Our line of thought was that we rather release the DLC for free so all of our community could enjoy it, we might sell more units of the base game\nthis way and to give something back to our fanbase, which helped to secure their support in the future.\n\n- Engaged a lot with our community, taking feedback, being transparent, but also very active. We also hired our community manager who was doing it voluntarily at that time. He did a great job keeping our\ndiscord alive even after the game released and not let it die. Later we hired another community member as our QA, who also continued to help with community management on the side.\n\n- Hired a part time (later full time) marketing person. Marketing is very important for any game project, no game really sells by itself. Even tho we didn't announce the second project yet, the marketing person helped\ngreatly keeping our community alive and active with content/challenges/raffles/surveys. Also planning our announcement and steampage launch of the second project.\n\n- We stayed within a similar genre for our second project (monster taming) - while still innovating by combining it with Roguelite elements this time.\n\n---------------------------\n\n**What I think we did right for the second project announcement and steampage launch:**\n\n- Launched the steam page right away when first time announcing the project. If you have an existing fanbase, announcing a second project they eagerly await, will be the most viral moment early in the development. \nYou want to cease this opportunity to start gathering wishlists.\n\n- Chosen a good time for launching the steam page: You want to launch it as early as possible to start gathering wishlists, but at the same time you need to have enough to show for the fanbase to be hyped\nand interested in the project. In our case it was after half year of pre-production (while also still working on updates for our first project) and a year working on the prototype. \n\n- We created a first trailer of the game for the announcement - many of the things shown in the trailer were already working in the prototype, \nbut some we specifically just made for the trailer (for example enemies in the overworld had scripted movement)\n[The announcement trailer](https://www.youtube.com/watch?v=iuYiigqbP-Q)\n\n- Before the announcement, we had a longer teaser campaign where we gave hints and riddles for our community to solve\n\n- Plan the announcement well, having most of the team involved - not just the marketing person. Get the word out in as many places as possible, reached out to the contacts we gathered during the development of our first project\nand the people we helped out with something in the past.\n\n- We localized the steam page right from the get go into some languages\n\n- We managed to acquirre enough wishlist additions in a very short time after the steam page launch, which made the steam discovery queue pick up our game and continue to gather many wishlists on a daily basis for almost a month\n\n---------------------------\n\n**What I think we did well on the way to the demo launch:**\n\n- Treat our employees and contractors well. We have rather generous working conditions (for gamedev) - 35h weeks, no crunch, 30 days off per year, flat hierarchy, very democratic, low management but encourage self-involvement. \nIf the project goes very well, everyone will get rev share on top of their salary. Despite majority of our employees and contractors being rather young (many university graduades with barely any professional gamedev work experience) \nI think those working conditions helped greatly still getting the most out of the team, pushing their limits and achieving great results. \n\n- Being constantly active on our existing social media channels, but also open up new ones ([Tik Tok](https://www.tiktok.com/@moi_rai_games_) for example in our case, some shorts there went viral granting us some small wishlist spikes)\n\n- We launched a closed alpha for the upcoming demo in early 2024, with dedicated and vocal community members and raffle winners where everyone could participate. The primary goal was to gather feedback\nand polish the demo.\n\n- Run multiple surveys with the alpha testers to get precise feedback what was working well and fun and what wasn't.\n\n- We pushed the public demo release multiple times, also switched the targeted steam next fest. We did this to polish and rework aspects of the game that were\nnot perceived that well yet based on the feedback we got from our alpha testers. We worked on the demo until it felt right and 'good enough' to show to the public.\n\n- We localized the demo, to have a bigger audience reach.\n\n- We applied to several showcases and got picked up by the Guerrila collective, which gave us another spike of wishlists during mid of 2024. [The trailer we did for the Guerrila Collective](https://www.youtube.com/watch?v=y3OpvooPgUU)\n\n- We released the demo in quite good quality overall (of course still not perfect, as it never is. Vital things were still missing, like for example mouse support).\nBut the demo was polished enough for us the receive an 'overwhelming positive' steam review score quite soonish after launch.\n\n- We gathered a total of 100k wishlists until the demo launch. All of them getting notified on the demo launch helped greatly to have a viral demo launch and getting picked up by the discovery queue of steam again, \nboosting the wishlists to a stunning 150k in matter of two weeks.\n\n- We signed up with a Publisher that we felt would help us well specifically at the marketing aspect. We considered to do self publishing for a long time during the project, but ultimately decided against it. \nPushing the demo multiple times, we felt we could need additional help taking some work off our shoulders. \nWe signed with 'offbrand games' and made the cooperation announcement on the demo launch day. The announcement and their effort on promoting the game helped us greatly having a viral launch of the demo.\n\n- We worked with a indie game marketing agency (Future Friends). They helped us with strategical decisions but also with the outreach to press and content creators. \n(this cooperation started before we decided to sign with a Publisher,  but ultimately we felt it was still worth it and our Publisher also liked the cooperation and might\nwork with them in the future)\n\n- We waited with our first outreach to press &amp; content creators until the demo was out\n\n- This is the [Demo announcement trailer](https://www.youtube.com/watch?v=pDoTiL14oIg)\n\nWe are of course very happy with how the demo launch went so far - but keeping in mind of course all of this was only possible because we had a successful first project and a loyal and active community!",
    "score": 222,
    "url": "https://reddit.com/r/gamedev/comments/1j11z0v/this_is_how_we_gathered_100k_wishlists_before_our/",
    "created_at": "2025-03-01T15:29:12.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1jo1s5z",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Our Story of How Two Idiots Accidentally Became Full Time Paid Game Devs and Somehow Launched a Steam Page",
    "text": "Hey everyone! I’m Baybars, the team lead of an indie studio, Punica Games, based in Istanbul. We just launched the Steam *Coming Soon* page for our first-ever PC game, Fading Light, and after a full year of chaotic effort, mistakes, growth, and learning everything from scratch, it felt like the right time to share our story.\n\nThis post tells the full journey — how we started with almost zero game development experience, what went wrong, what saved us, and why we kept going. There’ll be early concepts, disasters, tiny wins, and all the stuff in between. We hope it helps anyone struggling with the messiness of game dev — or just entertains those who’ve been there before.\n\nStore link to Fading Light: [Wishlist if you're curious](https://store.steampowered.com/app/3528230/Fading_Light/)\n\n\n\n#      Contents of the post:\n\n1. How we accidentally found ourselves developing the game  \n2. Why we struggled with our first proof of concept  \n3. Starting from scratch with zero experience  \n4. Our nightmare with visuals, sound, and voice acting  \n5. The plot-twist savior who saved the project  \n6. How we ruined our first teaser (and partially fixed it)  \n7. What we learned, and what’s next\n\n\n\n***1. How We Accidentally Found Ourselves Developing Our First Game, Fading Light***\n\nAlmost exactly a year ago, I was working full-time as an AI researcher at a mid-sized tech company, simultaneously with my Master’s in AI. My friend Emin, now the game’s programmer, was also at the same company, working in web development. We were in a professional environment — organized, efficient, working with globally known clients. Our company was unusually supportive of young developers: they funded internal R&amp;D, AI research, and even dabbling in game dev through a small internal team called *Punica Games* (back then just two solo devs experimenting with mobile).\n\nOne weekend, they held a **36-hour internal game jam** with a small cash prize — mostly for fun. Emin had dabbled in Unity before; I had zero experience. I have always been a gamer, but my only exposure to game development was watching GMTK videos during lunch and reading an article about the MDA framework. We joined the jam as a joke, partly for the free food, teaming up with a graphic designer who had a pixel art background, plus three others from the company who weren’t even gamers, just to even the team count.\n\nThe jam theme was **\"Symbiosis\"**. We quickly imagined a fantasy setting where the world is completely dark, and survival depends on a symbiotic relationship between a man and a fire spirit. The man can’t navigate the darkness alone, and the fire boy (eventually named Spark) constantly dies unless the man helps him regenerate — thus, *Fading Light* was born.\n\nWe immediately fell in love with the idea — it just *felt* right. The concept clicked with the theme, and we thought, “Maybe this could actually turn into something.” Suddenly, we weren’t just there for the food anymore.\n\nThe next 34 hours were pure madness. Chaos. Bugs. Fights. Mental breakdowns. Here’s a picture of us mid-jam, basically broken but still pushing forward:\n\n[An image of us fussing during the jam](https://imgur.com/a/KZ6cu2b)\n\nDespite everything, we submitted on time. The visuals were rough, the code was worse, but the core idea — this emotional symbiosis mechanic — *worked*. It wasn’t a great jam game. But it was a damn good proof of concept. And somehow, with a good presentation, we won.\n\nHere’s what the jam version looked like: \n\n[Game Jam Version Image](https://imgur.com/a/29jUcjK)\n\n  \nTo our surprise, the company executives approached us afterward. The offer wasn’t glamorous — no funding dump or big promises — but it was real:\n\n&gt;**“We’ll keep paying your salaries and give you time. Show us what you can do.”**\n\nWe took the leap. The original graphic designer couldn’t join us full-time (her role at the company was too essential), but we, two mostly clueless devs, were now officially tasked with turning this game into something real.\n\n  \n2. How (and Why) We Struggled to Come Up with a Good Proof of Concept\n\nAfter the game jam, we were given two weeks to prepare a presentation for the company: something that outlined our vision for the full game — scope, mechanics, design, everything.\n\nWe split the workload. The first week was pure brainstorming — figuring out mechanics, art direction, tone. We aligned on most ideas pretty quickly.\n\nIn the second week, Emin focused solely on the technical side — code structure, modularity, frameworks, configurability, development pipelines. Meanwhile, I (with a bachelors degree in French Literature and thousands of pages written before) took charge of the narrative and worldbuilding.\n\nWhat started as \"some ideas and lore\" quickly became a 60-slide monster document filled with:\n\n* The world’s history  \n* Character backstories and personalities  \n* Psychological profiles  \n* Dialogue samples  \n* Story structure and themes\n\nHere’s a slide from that initial lore doc — sorry, it’s in Turkish: [Dialogue Sample](https://imgur.com/a/JUA6VmH)\n\nWe were hyped. We reviewed each other’s work and were genuinely proud of what we had. Then, the day before the presentation, it hit us like a truck:\n\n**There’s no way we could actually make this game.**\n\nThe scope we envisioned was massive. We were about to walk into a room and say:\n\n&gt;“Hey, this is our first ever game. We’ve never done this before. Give us 3+ years and full salaries so we can build this ambitious, emotionally driven, narrative-rich metroidvania we have in mind. Don’t ask us how we’ll be able to nail it. Just trust us.”\n\nWe already knew the answer: no way in hell!\n\nNaturally, we panicked. Our solution? Bluff.\n\nWe pitched the presentation as a “vision piece.” A dream scenario. An ideal version of the game, if we had unlimited time and money.\n\nBut in reality? We told them we’d massively reduce the scope, shrink the project down to something deliverable in a single year. That’s what we said.\n\nBut that’s *not* what we meant.\n\nOur actual plan was:\n\n&gt;“Let’s pretend we’re making a small game, but secretly try to cram in all the big ideas anyway. We’ll find a way. We’re smart, we’ll figure it out.”\n\nBelieve me guys, this idea sounded way more logical back then than how it sounds now.\n\nWhy did we think this was a good idea? Because we were delusional. Full of false confidence. Still high off our jam win and totally clueless about how difficult game development really is outside of a 36-hour sprint.\n\nWe gave the presentation, pitched the reduced scope. The execs liked it. They didn’t believe we could deliver the *full* thing (rightfully so), but they were open to the smaller version.\n\nSo we struck a deal:\n\n* One year of full-time development  \n* Progress milestones along the way  \n* Art assets provided *occasionally* by the company’s designers when available  \n\nIt was official: we had a year to build the “small” version of *Fading Light*. Just the two of us.\n\nAnd we had absolutely **no idea** how to do it.\n\n\n\n***3. How We Started With Almost Zero Experience After Deciding to Develop the Game***\n\nNow that we had a one-year timespan and a vague plan in place, it was time to… actually make the game.\n\nWhich meant we had to face the uncomfortable truth: **We didn’t know what the hell we were doing.**\n\n# On my side:\n\nIt was my first time using *a game* as a medium for storytelling — something I’d only ever done through novels, plays, and essays before. I knew how to *write*, but I had zero understanding of how to *design* a narrative experience where the player pulls the strings. I’d always been on the playing side of games, never the creating one.\n\nOn top of that, *Fading Light* wasn’t a simple story to tell.\n\nWe weren’t planning to use walls of text, slow-paced cutscenes, or dialogue boxes. And even if we wanted to — we couldn’t. The protagonist, **Noteo**, is illiterate. That single design choice eliminated a lot of traditional storytelling tools. Every narrative beat had to be communicated through visuals, sound design, character behavior, lighting, and level design — and I didn’t even know what a Unity scene looked like, let alone how to plan one.\n\n# On Emin’s side:\n\nHe had to go through the **world’s fastest Unity + C# crash course**. Sure, he made something playable in the jam, but now he was staring down:\n\n* Code architecture  \n* Optimization  \n* Bug tracking  \n* VFX Graph  \n* Shader Graph  \n* Playtesting systems  \n* Game feel, inputs, animation blending  \n* Literally everything  \n\nWe were under fire — and the only way to survive was to learn *everything*, *fast*. And that’s what we did.\n\n# Enter survival mode.\n\nWe went into absolute grind mode. No weekends. No breaks. No real work/life balance. Just relentless reading, prototyping, debugging, storyboarding, failing, redoing, and trying again.\n\nI remember devouring the book **Directing the Story** by Francis Glebas in a day and a half because I needed to storyboard a cutscene without having *any* visual assets.\n\nI was drawing stick figure scenes like a kindergartener. Emin was prototyping animations with rectangles. We were researching things like **how bioluminescence works in nature**, and then trying to build luminance shaders that could simulate merging two separate shadows together — even though we had no assets to test it with yet.\n\nWe were desperate. But we were learning — and slowly, building.\n\n**And somehow… it started coming together.**\n\nAfter a couple of months, Emin had a modular, bug-free project skeleton up and running — with help from a senior dev at the company and some of their custom internal frameworks. He became *shockingly* fast with Unity, given where we started.\n\nOn my side, the narrative was taking shape. We had:\n\n* Deep character profiles  \n* Fully fleshed-out backstories  \n* Psychological arcs  \n* Speaking styles and behavioral quirks  \n* Biomes, narrative progression loops, story events, and more  \n\nAnd most importantly, we had a playable project. Not a full game. Not even a prototype. But something we could tinker with. We could test mechanics — jump height, dash range, attack feedback — and iterate.\n\nHere’s what it looked like in that early stage:\n\n[Unity Rectangles](https://imgur.com/a/0smFgCj)\n\nIt wasn’t much. But for us, it was a miracle.\n\nOur company was happy with the progress. The code was clean, the world was promising, and the passion was visible.\n\nNow, after months of work, it was finally time to do the one thing we’d been waiting for: Start making the game *look* like a real game.\n\nUnfortunately… That's where the real pain began.\n\n\n\n***4. How We Struggled With Early Visual Designs, Music, Sound Effects, and Everything Else***\n\n\n\nAfter months of full-time development, what we had was… Unity rectangles shooting arrows at each other. No art, no effects, no mood — just blocks.\n\nIt was time to move past that and start building the world’s visual identity.\n\nWe were excited. We figured seeing the game in a more polished form would motivate us, help us iterate faster, and give us a clearer direction.\n\nWe were very wrong.\n\nSince we didn’t have a full-time artist on the team, we had to rely on multiple graphic designers from the company. They could contribute when they had spare time — if they weren’t busy with other projects. That alone made things tough.\n\nBut the real problem was this: every artist we worked with had different backgrounds, different skill sets, and different understandings of what we were building. And we had no experience in giving clear, useful art direction.\n\nHere’s an example.\n\nWe finally got a chance to work with one of the *only* senior graphic designers available to us. I gave him a document describing our main character, Noteo, in detail:\n\n* “A mask-like face with a bioluminescent pattern”  \n* “A sheepskin-like cloak to protect him from the cold”  \n* A bunch of references from other metroidvania games to explain the tone and genre  \n\nWhat I *didn’t* include was the most critical information:\n\n* Intended body proportions  \n* Actual art style  \n* Tone of the character (he’s supposed to be a grounded, emotionally damaged survivor)  \n\nSo the designer — completely logically — assumed we wanted something in line with the mainstream metroidvania references we gave him.\n\nThis was the result:\n\n[Cartoon Noteo](https://imgur.com/a/zfQ1M3D)\n\nOof…\n\nIt wasn’t a *bad* design — in fact, it looked great on its own. But it was completely disconnected from what we were aiming for.\n\nWe wanted a balance of realism and stylization. **Noteo** was meant to be the \"real\" one: a cold, grounded character carrying trauma and pain. **Spark**, on the other hand, would be his colorful, stylized counterpart — a literal floating flame child full of energy and mischief. That contrast was the heart of the story.\n\nBut the Noteo we got looked like a cartoon protagonist from a lighter action platformer. He didn’t look like someone you’d relate to. Or believe.\n\nWe told the designer this, and understandably, he was annoyed:\n\n&gt;“Why didn’t you just tell me that from the beginning?”\n\nFair.\n\nLuckily, he was patient. He reworked the design from scratch using more grounded proportions and realism. Around the same time, the designer from the original game jam came back on board to create Spark — and she nailed it in one go.\n\nHere’s how they both looked after all:\n\n[Noteo and Spark](https://imgur.com/a/Ikoa5o1)\n\nSo far, so good. Until our luck ran out.\n\n\n\n# Then everything fell apart.\n\nWe had now used up all our favors with the experienced artists. That left us with less experienced designers, often unfamiliar with game development and spread across multiple disciplines.\n\nI had to coordinate them — try to unify a consistent art style across wildly different skill levels, backgrounds, and time constraints.\n\nAt the same time, I was juggling:\n\n* Trying to design a proper marketing plan  \n* Coordinating asset production  \n* Planning our *Coming Soon* page for Steam  \n\nThe result? Total disaster.\n\nWe had a messy collection of unfinished or mismatched assets. The styles clashed, the proportions varied, and some pieces barely got past the sketch phase even after a month of focused work. Some even looked like literal jokes…\n\n[This is what everything looked like](https://imgur.com/a/dgwx8dp)\n\nAnd just to make things even worse...\n\n# Sound. Music. Voice Acting. More pain.\n\nSound effects and music were *slightly* more manageable. We used licensed sound effects, and a few musician friends chipped in to help us build some initial tracks.\n\nBut voice acting?\n\nThat nearly broke me.\n\nWe knew from early on that voice acting would be key to the emotional tone of the game — especially for Noteo and Spark. But we were in Turkey, and we needed English-speaking voice actors with *very* specific vocal profiles.\n\nWeeks went by. Nothing.\n\nLocal options were limited. Most didn’t speak English well enough for the roles, or didn’t match the voices we were imagining. Hiring native freelancers from abroad was impossible with our non-existent budget and the brutal TL–USD exchange rate. At one point, I even considered paying from my own pocket — but it would’ve bankrupted me before we got past the first few lines.\n\nSo I asked every friend I had to try recording. Nothing usable. Total failure.\n\nGiving up on voice acting wasn’t an option either — the narration design was already built around it. Removing it would’ve meant reworking the entire game’s storytelling approach from the ground up.\n\nAs a last-ditch effort, I decided to try something desperate: **I would voice both characters myself** and then use AI tools to manipulate the recordings.\n\nAt first, the results were awful — no emotion, robotic tones, unnatural pacing. But after hundreds of iterations and tests, I finally got a few clips that sounded… okay.\n\nNot perfect. Not final. But usable as **placeholders**. Enough to show intent.\n\n\n\n# Reality check.\n\nAt this point, several months in, we had a decent **vision** in our heads. We could picture how the game should look, sound, and feel. We even had early plans for the teaser and the Steam page.\n\nWhat we *actually* had was:\n\n* Sloppy, inconsistent visuals  \n* Emotionless placeholder voice acting  \n* Randomized sound effects  \n* Amateur music  \n* Almost nothing animated except Noteo and Spark  \n\nEverything else — mobs, bosses, backgrounds — was either half-finished or completely unusable.\n\nAnimating anything at that point would’ve been a waste of time. We didn’t even want to see those assets moving, let alone expect anyone else to.\n\nWe were dangerously close to burnout. Everything felt like it was falling apart.\n\nAnd that’s exactly when our story took a sudden, unexpected turn...\n\n  \n***5. How a Really Talented Artist (With a Plot Twist) Saved Us From Almost Quitting***\n\nThis is where we used up *all* our remaining luck in a single plot twist.\n\nAt this point, we were six months into development, and things were looking grim. Despite all our work, we had nothing visually coherent to show. The art was inconsistent, the assets unusable, and we’d already burned through all the experienced designers we had access to.\n\nWe were on the verge of surrender. Mentally preparing for the possibility of getting fired and shutting down the project.\n\nThen someone new joined the company, Burcu.\n\nShe was a newly hired junior graphic designer — fresh out of university, just starting her first-ever full-time job after a year of unemployment. Her portfolio didn’t exactly scream “game artist,” which is probably why she hadn’t landed a job earlier.\n\nBut at that point, I had no other options left. I figured I might as well ask her for help.\n\nI showed her what we had, explained the problems, and asked if she’d be willing to try drawing a character for us. She said \"Hmm, let me see what I can do,” and asked for a day.\n\nShe was still in her trial period, which meant she wasn’t locked into any team or project yet. I used that window to get her on board, just for a single test.\n\n# One day later, she delivered an asset.\n\nA fully layered, game-ready character asset — designed from scratch, beautifully composed, polished, and absolutely *on point*. It was fast, it was clean, and it was exactly what we’d been trying (and failing) to get for *months*.\n\nShe didn’t just “draw something pretty.” She *understood* what we were going for — the tone, the mood, the proportions, the lighting, all of it.\n\nI stared at the screen thinking:\n\n&gt;*What if she redesigned everything? What if she fixed the whole visual identity of the game?*\n\nSo I asked her.\n\nShe said:\n\n&gt;“Sure, just tell me what you need.”\n\nHere’s what happened next:\n\n[*Before and after Burcu*](https://imgur.com/a/3sped0j)\n\nAt that moment, it was obvious: we had to get her on the team asap. Full-time. No excuses.\n\nBut there was a problem. We were already running over budget, and we’d been on a losing streak for months. Asking the company to add another salary to our struggling team felt like marching into a boss fight without gear.\n\nStill, we had to try.\n\n# The meeting that changed everything\n\nWe set up a meeting with the company executives — including the big boss himself. We were ready for a fight. We brought our new character designs, our pitch, our reasoning, our desperation.\n\nWe said:\n\n&gt;“This is Burcu’s work. We want her on our team full-time. We need her. Please give us this one shot.”\n\nWe braced for a negotiation.\n\nInstead, the boss looked at the screen, nodded, and said:\n\n&gt;“Yeah, sure. Why not? We were considering putting her on *Fading Light* from the beginning anyway. Also, you’re getting a real budget now — and more help.”\n\nWe just sat there, stunned. We didn’t actually expect the events to turn out like that.\n\nWhat a legend...\n\n# The comeback arc begins\n\nWith that one meeting, everything changed.\n\n* Burcu officially joined the team full-time  \n* We got proper support and more resources  \n* The atmosphere in our tiny team shifted from dread to momentum  \n\nWe suddenly *believed* again. After all the struggle, all the failed assets, all the patchwork coordination — we finally had a real artist. A visual direction. A renewed sense of purpose.\n\nWe felt unstoppable.\n\nAnd naturally, that meant the next lesson was waiting for us — just around the corner.\n\n# 6. How We Ruined Our First Teaser and Had to Do Everything From Scratch\n\nWith Burcu on board and our morale finally repaired, we went into full beast mode.\n\nShe started methodically recreating every asset we had — characters, backgrounds, UI elements, you name it — and it all looked **amazing**. The broken visual identity we’d been struggling with for half a year was finally taking shape. We weren’t just “catching up” — we were *leaping forward*.\n\nMeanwhile:\n\n* I was focused on designing the teaser trailer, finishing leftover assets, and structuring our *Coming Soon* Steam page  \n* Emin was working deep in shaders, VFX, physics-based movement, and some incredibly cursed experiments on Spark’s “head”  \n* And we finally got assigned an **animator** — a part-time co-worker named **Can**, an ambitious intern studying Game Development in his second year  \n\nNow, Can was a beginner. This was his first time animating in a serious pipeline. But at that point, we were all beginners at something. The goal was simple:\n\n***6. How We Ruined Our First Teaser and Had to Do Everything From Scratch***\n\nWith Burcu on board and our morale finally repaired, we went into full beast mode.\n\nShe started methodically recreating every asset we had — characters, backgrounds, UI elements, you name it — and it all looked **amazing**. The broken visual identity we’d been struggling with for half a year was finally taking shape. We weren’t just “catching up” — we were *leaping forward*.\n\nMeanwhile:\n\n* I was focused on designing the teaser trailer, finishing leftover assets, and structuring our *Coming Soon* Steam page  \n* Emin was working deep in shaders, VFX, physics-based movement, and some incredibly cursed experiments on Spark’s “head”  \n* And we finally got assigned an animator — a part-time co-worker named **Can**, an ambitious intern studying Game Development in his second year  \n\nNow, Can was a beginner. This was his first time animating in a serious pipeline. But at that point, we were all beginners at something. The goal was simple:\n\n\"Deliver a teaser video for the *Coming Soon* page launch by the 10-month mark.\"\n\nWe were *finally* experienced enough to start doing this for real… right?\n\nWell.\n\n# We forgot one important detail.\n\nWe didn’t know a thing about cinematography.\n\nWe had a rough storyboard: camera angles, scene descriptions, bits of dialogue, timing.\n\nBut the moment we sat down to actually build the teaser in Unity, **nothing felt right**. Every time we played back a scene, it looked *fine* — but not *impactful*. Not fun. Not emotional. Not memorable.\n\nAnd worst of all — **we couldn’t figure out why**.\n\nThe visuals were there. The music was there. The voices, lighting, movement — all functional.\n\nBut it felt... dead.\n\nMaybe it was because we’d imagined something greater in our heads. Maybe it was just too safe, too slow. Whatever the reason, it didn’t hit the way we wanted. It just wasn’t good enough.\n\n# But we delivered it anyway.\n\nThe deadline came. We exported the teaser and showed it around:\n\n* Some local game publishers  \n* A few local studios  \n* Friends and fellow devs at physical gatherings  \n\nThe reactions were okay:\n\n&gt;“Looks good for a first project.”\n\n&gt;“Hey, this is pretty solid for a first game.” \n\n&gt;“Oh, you made this? That’s impressive.”\n\nBut deep down, we were crushed.\n\nWe didn’t want to be complimented *as first-timers*. We didn’t want people to say, “Great *for a student project*.” We just wanted people to say:\n\n&gt;“This looks like a good game.”\n\nNot “good enough.” Not “promising.” Just **good**.\n\nAnd we knew, in our bones, that this teaser didn’t reflect the soul of the game we were building, or at least, we wanted to build.\n\n# So we asked for more time.\n\nWe sat down with our execs again and told them honestly:\n\n&gt;“We’re not satisfied. We don’t think this trailer represents the game — or us. We want to delay the Steam page launch.”\n\nTo our surprise, they agreed immediately.\n\nAt that point, they had already started believing in the game’s potential — not just because of the teaser, but because of the way the project had recovered from failure after failure.\n\nSo they gave us two more months. No pressure. Just finish it the right way.\n\nAnd this time, we did.\n\nWe kept rebuilding. We reworked assets, improved sound design, replaced placeholder voice acting with better AI-enhanced recordings, and tightened the animation pipeline. We even went back and rewrote whole parts of the teaser storyboard to fit the new tone and pacing.\n\n# And finally, a year in…\n\nWe launched the *Coming Soon* page.\n\nWe still think it’s not perfect. Not even close to what it *could* be with more time and polish. But we knew we had to stop hiding the game and start showing people what we were building.\n\nAfter a year of working in secrecy, this was our new philosophy:\n\n&gt;**Ship the game publicly. Grow with your audience. Let people** ***see*** **the process and hold yourself accountable to them.**\n\nNow we’re no longer building *Fading Light* just for ourselves or for the company funding us.\n\nWe’re building it for the people who will play it — and for the people who are watching.\n\n***7. What We Learned on the Journey — and What’s Next for Us***\n\nNow that *Fading Light* is public, we’re no longer stuck in the one-year deadline we gave ourselves at the start. After long talks with our team and the people supporting the project, we’ve secured more time.\n\nWe now have **around two more years** to continue working on *Fading Light* — this time with a proper schedule, more structured support, and a clearer vision. Our long-term goal?\n\nCreate a **10–12 hour long metroidvania** with high-quality, non-repetitive content that can stand shoulder-to-shoulder with the best in its genre.\n\nIn the short term, our plan is to release a **30–40 minute demo** in the next **seven months**.\n\nBefore that demo drops, we’ll be reworking or redoing a lot of things from scratch — again:\n\n* Character animations  \n* Combat feedback and hit effects  \n* Ragdoll physics  \n* Lighting systems  \n* Sound and voice design  \n* And pretty much anything that doesn’t yet feel *right*  \n\nBut now we’re not polishing for the sake of perfection — we’re iterating for *immersion*. Our focus is making sure every second of the game *feels intentional*.\n\n# What we learned along the way\n\nIf you’re like we were — ambitious, naive, inexperienced — and you still want to build the best possible version of the game in your head...\n\nBe prepared.\n\nIt’s going to be hard. *Really* hard. You’ll learn things you didn’t even know existed. You’ll fail a lot. You’ll lose months of work and question whether anything you’re doing makes sense. And if you’re doing it without a full team, a budget, or experience — it will feel like survival mode.\n\nBut if there’s even a sliver of progress... a hint of growth… If you believe there’s *something* worth chasing inside the chaos…\n\nIt’s worth it.\n\nBecause if you don’t give up — if you stay flexible, stay learning, and keep building — you’ll find a way. It might be messy. It might be full of bad decisions and lucky accidents. But you’ll end up somewhere real. And one day, someone might care about the thing you made.\n\nThat’s what we’re chasing with *Fading Light*. And now that it’s out in the world — even just as a *Coming Soon* page — we’re more committed than ever to delivering what we promised.\n\nThanks for reading this long-winded, ridiculous, personal, and honestly kinda cursed journey.\n\nLastly, if you’ve read this far, thank you. Seriously — it means a lot. We’d love to know what you think about our journey and our game. ",
    "score": 185,
    "url": "https://reddit.com/r/gamedev/comments/1jo1s5z/our_story_of_how_two_idiots_accidentally_became/",
    "created_at": "2025-03-31T12:17:06.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1pgx8je",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I graduated, got rejected from 400 jobs, failed 4-5 startups, and somehow still found my path through indie games (long post but I hope it helps)",
    "text": "Hey guys, I wanted to quickly preface this long post: I'm not here to self promote, I just want to share my journey in case it helps or inspires anyone feeling lost (especially new grads). This past year and a half has been a rollercoaster for me, so buckle up while I tell you how I went from 400+ job rejections to helping **pay out over $250k** to gaming creators.\n\nIn **May 2024**, I graduated with a CS degree from a mid-tier Canadian university with a perfect GPA and at the top of my class. I come from a household where academics were everything so I prioritized studies thinking that's all it took to be successful. After **400+ job rejections** across tech and games, I realized just how wrong I was. I had done everything \"right\" on paper, but the only real projects I had were a bunch of small itch.io games.\n\nI honestly felt like a complete failure. But now that I wasn't focused on studies, I went back to the one thing that's always been constant in my life - indie games. I took time to catch up on games that were rotting on my wishlist and I fell back in love with gaming after sacrificing it for so long to focus on school. That's when I decided I needed to do something in this space.\n\nI live in a small Canadian city with basically no game industry. Hardly any studios and barely even a tech scene tbh. But still, I felt determined to contribute to my local indie game ecosystem somehow, even if I didn't know where to start. So I convinced my three best friends to quit their jobs and take a year to build projects together. This was probably the worst year of my life.\n\nOur first project was an AI-powered pixel art tool, kind of like Aseprite but with \"AI features\". Artists hated it (for valid reasons), and after talking to a bunch of them, we shut that down quickly. Still, we thought AI could be really interesting to help indie game devs so we naively built more AI projects.\n\nOur second attempt was an [AI tool for Unity](https://www.youtube.com/watch?v=Ve5nJfWIxk4) that could build things in-engine from prompts. We actually built a working prototype we were proud of... and then realized we made the classic indie mistake: building something in isolation without taking any feedback.\n\nWhen we finally showed studios, some ghosted us, some told us it didn't solve a real problem, and others bashed us for using AI in general. It was super demoralizing because truthfully, we thought we were onto something. We spent months building it only to get crushed.\n\nAfter that, we bounced between a few other ideas: AI for playtesting, AI for market research, AI for *anything*. If I'm being honest, it was just us desperately trying to chase a trend and disguise it as \"innovation\".\n\nIn **December/January 2025**, things got even worse. We had a very rough co-founder breakup and suddenly went down from 4 -&gt; 3 founders. This caused the startup at the time (IndieBuff) to get spun down.\n\n**February/March 2025** was bleak. No money, no progress, zero morale. The remaining 3 of us all come from immigrant households, so to our parents, we just looked like complete idiots wasting our degrees. I've never felt more ashamed, and we were honestly really close to giving up.\n\nIn **April 2025**, we stopped forcing shitty AI ideas and started fully indulging in indie culture again. We joined game jams, played different indie titles daily, and eventually started a [small TikTok account](https://www.tiktok.com/@jestr.gg) where we highlighted cool indie games we found. None of us had done social media before, so we did it partly out of passion but also to understand why TikTok felt so hard for so many devs we talked to.\n\nTo our surprise, our account was growing pretty fast. A couple vids went viral and suddenly a lot of indie devs and fellow gaming creators were reaching out. We even started consulting indies for free and doing daily content for 3-4 studios for $400/month. It wasn't anything amazing but after a year of failed tech ideas, this was our first real income - and it came entirely from supporting indies directly.\n\nBy **June 2025**, we'd met a lot of short-form creators and something became increasingly obvious: gaming creators want to work with indie devs, but the collaboration ecosystem for TikTok is nowhere near as mature as Twitch or YouTube.\n\nCreators told us:  \n\\- They get ghosted constantly  \n\\- Payments are unreliable or take months  \n\\- Communication is chaotic  \n\\- Without an agent, they're basically invisible\n\nStudios told us:  \n\\- TikTok matters a lot  \n\\- Creator management is overwhelming  \n\\- YouTube/Twitch is becoming too expensive  \n\\- they *want* to work with creators, they just don't know where to start\n\nFor the first time, instead of forcing AI into a non-existent problem, we listened and found very real issues on both sides.\n\nWe put together a tiny website in 1-2 weeks. It was super crude but it let studios:  \n\\- Set a budget  \n\\- Set a CPM (amount to pay per thousand views)  \n\\- let creators make videos  \n\\- automatically track views  \n\\- automatically pay them\n\nWe launched it on July 28th and shared it with our small Discord of \\~15 creators we had befriended.\n\nOur first campaign was for a game called [LORT](https://store.steampowered.com/app/2956680/LORT/), and the results surprised everyone. The studio loved how simple it was, and creators loved the experience. So much so that they started spreading the word.\n\nWe started getting more creators interested, more studios reaching out, and for the first time in over a year, things were moving *upward*.\n\nTo capitalize on the momentum, we lost sleep and kept building. More features, easier onboarding, expansion into other regions - whatever we needed, we did it. I think people saw how hard we were trying, and word spread even faster about \"three young guys you should talk to about games on TikTok.\"\n\nSo where are we at now? Well, since **July 28th, 2025**:  \n\\- We've paid out over **$250,000+ USD** to gaming creators on TikTok, Reels, and Shorts  \n\\- Creators have generated over **50M+ views** for various indie games  \n\\- We now have around **200 creators** from Canada, the US, Germany, France, Australia, Brazil, Spain, and more\n\nIf things continue to grow, I'll be able to take a salary in the new year. It'll be minimum wage, nothing crazy, but I would have never expected I'd be making money from something *we built*, especially after all our horrible ideas.\n\nMy journey is honestly just getting started. I still lose sleep daily worrying that this could all be over tomorrow, but until then I'll keep doing my best to help indies get discovered and help creators get paid.\n\nThe reason I'm posting this isn't to brag or to promote anything. I'm sharing this because I'm someone who's come to realize a very harsh truth: **I'm painfully average**. I'm not particularly talented, my grades didn't matter, I don't live in a big game city, I don't know anyone in the industry, and I had no idea what I was doing when I started.\n\nOnly when I accepted that, did things finally start working. When I stopped chasing trends and started genuinely pursuing my passion - talking to indie devs, hearing their stories, playing more games and helping spread the word for free - *that's* when I accidentally stumbled into a real business.\n\nI know this isn't the most typical post for people building games, but I hope it resonates with anyone feeling lost, especially as a new grad. Don't isolate yourself, be willing to learn, and most importantly - don't give up on your passion!\n\nHappy to answer any questions about the journey so far, mistakes, pivots, or anything else\n\nThanks for reading &lt;3\n\nTL;DR: Graduated with a perfect GPA but still got rejected by 400+ companies. I built and failed 4-5 AI startups but pivoted into TikTok and indie games. Made a small tool to connect creators + devs. In 4 months I paid out $250k+ to creators and generated 50M+ views for indie games. Lesson: Follow your passion, talk to more people, and don't give up.",
    "score": 180,
    "url": "https://reddit.com/r/gamedev/comments/1pgx8je/i_graduated_got_rejected_from_400_jobs_failed_45/",
    "created_at": "2025-12-07T23:40:32.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1k11qmk",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I feel like no matter what I do promotionally, no matter how much advice I follow, our game just does not get wishlists. This maybe suggests that our game is just bad, but we consistently get very positive feedback from people who see and play it. So what am I doing wrong?",
    "text": "The title question is obviously a bit broad and difficult to meaningfully respond to without any context, so here is some context:\n\nWe're a two man team at the moment (used to be 4), we studied professional game design and then a postgrad business course with a focus on game deveopment, applied for an Incubator grant with our game pitch and were successful. The grant was specifically for business expenses, not salaries or anything like that, but allowed us to register a business and we started making our first game. Life got in the way a lot, the project took longer than we expected and all, but we have stuck with it when we can and are finally about to release our game in just a couple of weeks.\n\nOver the course of the whole project I have done hours upon hours of research into marketing indie games on low/no budget, social media promotion etc. and have tried my best as someone who doesn't (well, didn't) really use social media in a personal capacity to follow all of the guidelines, data, and advice I came across. I am very introverted and really dislike promoting myself or things I am involved with so I really had to push myself out of my comfort zone for this, but I did it because it's obviously important if we are hoping for anyone to know our game exists!\n\nSo I have tried to put all the things I've learned into practice over the project. Posting (with admittedly varying degrees of consistency) on Twitter, Instagram, Facebook, and more recently trying Reddit, and have put so much of my time into social media based promotion while trying to manage our business admin and also get dev done. But my efforts seem mostly to be ineffective. We are stuck at 300 wishlists over all this time, and even posts that do pretty well don't seem to really convert into any or many wishlists. We have gained roughly 30 in the last month even though I've been stepping up the promotional efforts. I feel like I am doing things right on paper, and I think we have made a decent game (sometimes😅). I feel like I know what I'm doing to some degree sometimes but others it feels like nothing is really working and I get massive imposter syndrome and it can all be quite disheartening.\n\nSo I feel like the obvious conclusions are:\n\n1. Our game is actually just bad and/or not appealing. While I am certainly open to this being the case, we have put a lot of love and attention and time into our game, I feel that we are at least reasonably competent as devs, and we consistently receive very positive feedback from people who see and play the game. So it's hard to identify what the problem is. When I ask for feedback from other devs it's also all just positive and people say they think our game will do well, but this just doesn't seem to be reflected in the numbers.\n2. I am just actually terrible at promotion! This is certainly highly possible and/or probable. However usually when I put so much time and energy into learning something or achieveing a particular outcome I am able to do so with at least some degree of success. Perhaps I am just fundamentally misunderstanding something important about the whole process, but I am apparently unable to identify what this might be on my own.\n\nWe release in just a couple of weeks and it seems inevitable that despite my efforts it's going to sell like 12 copies and then just fade out of existence. Which is.. demoralising to say the least after everything we've put into it. I am not expecting that we will magically achieve some wild success or anything of course. My expectations are low, but I guess thought my efforts might just do a little more than they are based on feedback we have been getting, and want to learn why this is the case.\n\nI don't want to post our Steam page or anything as this is not supposed to be a promotional post. Hopefully it's okay to mention our game's name so that people can at least have a look around in order to provide feedback if they feel like it, the game is called 'Monch!'. **Edit:** apparently linking here is okay in this context so here is our [Steam](https://store.steampowered.com/app/2079990/Monch/) page.\n\nThank you for your time to anyone who reads through all this, and I hope everyone has a fantastic weekend.\n\n**Edit:** I did not expect to get remotely so many (or any😅) responses, thank you to everyone who has or is taking the time to respond, I hope to be able to reply to everyone if I have the time to, sorry if it takes a bit or if I miss something. ",
    "score": 174,
    "url": "https://reddit.com/r/gamedev/comments/1k11qmk/i_feel_like_no_matter_what_i_do_promotionally_no/",
    "created_at": "2025-04-17T02:03:31.000Z",
    "num_comments": 291
  },
  {
    "id": "reddit-1mn0shq",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "I'm lost.",
    "text": "I am completely lost.  Today I showed mom my new classes for community college and she got upset when \"Art Appreciation 1301\" appeared.  She thinks that it's a waste of money.  I can understand that but she still didnt care when I said that Arts 1301 is one of the core classes.\n\nTurns out, she's also against me doing animation as a career.  I completely have my back against the wall.  She dosent want me to do zoology, she dosent want me to do animation, and she wont pay for either.  I really need to find a way to make money by myself.\n\nMaybe I dont have a game plan, but its clear that she only really cares about the money.  \n\n\nThen my dad came in and spouted the same \"you have no actually passion because you haven't been consistently drawing since childhood\".  At this point, I think convincing them is a total lost cause.  I'm out of options.",
    "score": 173,
    "url": "https://reddit.com/r/animation/comments/1mn0shq/im_lost/",
    "created_at": "2025-08-11T02:05:09.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1mibp3v",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Developing games at Tencent - 02",
    "text": "Part 01 - [https://www.reddit.com/r/gamedev/comments/1mhf7om/developing\\_games\\_at\\_tencent\\_01/](https://www.reddit.com/r/gamedev/comments/1mhf7om/developing_games_at_tencent_01/)  \n\\--------------------------------  \nI honestly didn’t expect my first post to get this much attention. To be fair, a lot of what I wrote last time was me just talking off the top of my head, then turning it into text and translating it to English. So some parts weren’t very precise, hope you don’t mind. And I’m just a regular developer, not someone with access to all the big-picture data. Most of what I say is based on my own impressions and experience.\n\nFor this second post, I want to share a few other thoughts.\n\n  \nA lot of people asked me about foreigners working in China, especially in game development. I’d say yes, there are definitely opportunities. In my company and department, we have quite a few foreign colleagues. They work in English, we work alongside them just fine. But if you’ve worked in game dev for a while, you know that many key problems require frequent, intense communication. If you’re not fluent in the language, it’s really hard to keep up with that kind of fast, back-and-forth problem-solving. That’s probably one reason why it can be tough for foreigners to fully take part in the more core, high-frequency parts of development. I think it’s the same story in Japan or any non-English-speaking country.\n\nAs for English levels in Chinese studios: day-to-day conversations are of course in Chinese, since almost everyone’s Chinese. But the actual work content, like code, is in English. A lot of tools and software are in English too, even if there are Chinese versions. Technical folks like programmers usually read English pretty well, but most people aren’t good at speaking or writing it. Honestly, even this post of mine is translated with AI. In code comments, some devs write in English, some in Chinese, and some just throw in pinyin words if they’re not confident in English. It’s not always easy to read. From what I’ve seen, designers and programmers usually have the best English, while older artists often know only basic terms. If you’re an artist in China and your English is good, you’ll stand out a lot.\n\nNow, about the bigger picture in China. The reality is, most people here aren’t that wealthy yet. The country is developing fast, but compared to Japan, Korea, Europe, or North America, our GDP per capita is still much lower. That shapes a lot of things. For example, in my last post I mentioned why we work so much. A big part of it is just the sheer number of people and the intense competition. The economy’s growth has slowed down a little in recent years. \n\nIn China's mainstream culture, there is still controversy over the rationality of entertainment through video games. Perhaps East Asian culture is not one that agrees that people need entertainment.\n\nSome people were surprised that salaries in Chinese game companies can be higher than in Europe. If you’re talking about Tencent specifically, yeah, the pay can be good because it’s the biggest private internet company in China. But here’s the catch: the benefits and work-life policies don’t really match the salary level. Two examples:\n\n* New hires only get 5 days of paid vacation a year. After 3–5 years, it goes up to 10 days. In Europe, I hear you can get over a month off.\n* Wedding leave is only 3 days where Tencent is based, in Guangdong. So if you get married while working here, you only get 3 days off. Pretty crazy, right? We often envy European colleagues for their vacation policies.\n\nSo if you compare salary to working hours, our hourly rate isn’t that high. But on the flip side, the cost of living in China is much lower than in Europe, so you can actually live more comfortably here on the same income.For example, you can order a delivery online, and it can arrive the next day – very convenient.\n\nThere’s also something I call the “engineer dividend.” China’s education system produces tons of strong STEM graduates, really skilled engineers. But because there are so many of them, competition is brutal and wages are relatively low compared to their skill level. Companies like Tencent can hire a lot of great engineers at a lower cost. If a game hits big, Tencent captures that value. It’s not just Tencent, companies like ByteDance with TikTok and many other Chinese apps are built on this same model: lots of hardworking engineers grinding for relatively low pay compared to Silicon Valley standards.\n\nAbout mobile games: from a technical perspective, making mobile games isn’t easier than AAA. There are tough challenges like performance optimization, network sync, and plenty of other tricky problems. But we all know that tech is only one part of making a game. Whether a game is fun or not doesn’t always depend on the technology behind it.\n\nAnd finally, you can’t really talk about Chinese games without mentioning government regulation. The Chinese government has strict control over all cultural products: books, movies, magazines, and yes, games too. Especially in recent years, for reasons most people know, the rules have tightened. The government can block new games from launching, cut off distribution channels, even shape public opinion in ways that affect the industry. It’s a real risk for companies. That’s why Tencent and other studios are pushing more and more towards overseas markets, and the government actually encourages that — the idea is, “Go make money from foreign players.”\n\n",
    "score": 143,
    "url": "https://reddit.com/r/gamedev/comments/1mibp3v/developing_games_at_tencent_02/",
    "created_at": "2025-08-05T15:05:19.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1pnrk24",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "After the publisher expressed intent to sign, the artist I had worked with for six months no longer wished to continue.",
    "text": "I don’t want to use an overly dramatic title, but this is what just happened.\n\nThe artist and I have been worked remotely. While building the core gameplay loop for our card game, he sometimes had to work overtime at his day job and couldn’t contribute for a week at a time, but fortunately we were always able to keep moving forward. We originally planned to finish the prototype in September, but it was delayed until December. Thankfully, the prototype turned out well, and the feedback from friends who playtested it was very positive.\n\nI pitched the game to four publishers. Three replied, all saying the prototype was good: one said they would discuss internally and call me in a few days, another wanted to see the next demo, and the third said they would talk with me the next day. Since they also run incubator programs, they wanted to discuss whether I’d be willing to work on-site at an incubator.\n\nI excitedly shared all of this with the artist and told him about the incubator opportunity.\n\nbut here’s the issue. The artist simply said he couldn’t do any on-site work. Confused, I asked whether an incubator, or even me paying him a salary equal to his current job.\n\nThe answer was no.\n\nHe then sent a long message explaining his position, almost like a final conclusion. In short, he felt the game wasn’t good enough yet, that working on an indie game would damage his resume, and that money couldn’t make up for the resume gap.\n\nHe wants to continue working at established companies, and believes that any gap in his employment, given the current market, would make it very hard for him to find another job. That reasoning is understandable, I can’t really argue with it.\n\nI’m now reconsidering whether it’s possible to finish the game entirely through remote collaboration.\n\nBut I have two concerns. First, I can’t be sure remote work will be efficient. Second, the long message the artist sent really unsettled me. I’m worried there’s now a gap in trust and confidence between us. He may not truly believe in the project, and that could mean he won’t be able to stick with it until the game is finished. That would be fatal.\n\nSince this just happened, I’ve chosen to withhold details. There’s no outcome yet.\n\n\n\n# Edit:\n\nWhat surprised me the most was that everyone was suggesting I replace the artist, but my gut feeling tells me that changing the artist is not a good idea. My original post was only meant to discuss the efficiency and feasibility of remote collaboration.\n\nI’m also glad that most people were polite and didn’t immediately accuse me or make assumptions about me.\n\nI just had a pleasant conversation with the artist. I still wanted to keep working with him, and he agreed to continue collaborating remotely. The artist said that because the work is remote and he has a full-time job, he can’t provide a large workload or rush work, and I fully accepted that.\n\nThis artist will be responsible for maintaining a consistent art style, reviewing the quality of outsourced work, and designing character concepts (which I think is similar to the role of a concept artist). I will look for outsourcing for card illustrations and visual effects. I hope we can work together all the way through to the completion of the project.\n\nAdditionally, that incubator didn’t sound very good. Especially when I heard “if we damage the incubator’s facilities, we have to compensate,” I felt that publisher was really underestimating me, so I declined.",
    "score": 139,
    "url": "https://reddit.com/r/gamedev/comments/1pnrk24/after_the_publisher_expressed_intent_to_sign_the/",
    "created_at": "2025-12-16T03:23:03.000Z",
    "num_comments": 168
  },
  {
    "id": "reddit-1po8uec",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "VENT - director is scrapping a years work to start a new video with AI \"when its ready\"",
    "text": "Worked for a year and a half for a client. Developed a unique pipeline where I could do 2D animation in 3D enviroments with dynamic camera movements and made the most anatomically accurate characters I have worked on.\n\nIts my best work, and Id say its quite good. My first project that I feel is at professional quality.\n\nDirector loved my work as I was doing it. I was cheaper than other studios he hired and was way higher quality, while also going faster. I dont know how some of these studios exist.\n\nThe director had plans to do some shots in AI and to do post-prod with AI. I warned him it would be challenging if it was possible. AI just isnt trained on projects with this kind of pipeline, and even more traditional styles arent ready for AI. \n\nHe put the project on hold until mid 2025, when he thought AI would be ready\n\nJust found out that he has scrapped the video entirely. This makes sense to a degree, the narrative and directing was non-sensical\n\nBut it was my best work. Im a freelance music video animator. I need to be able to post my work to get clients.\n\nJust found out Ill never be able to post it\n\nIve spent the last 6 months getting licenses for a day-career. I havent had time to animate much on my own, let alone full time. Its going to be hard to bounce back from this to kickstart my career in animation\n\nIts such a bummer. I graduated in 2019 and have struggled hard to get work. That project was the only time I didnt need a day job to pay the bills. It seems like if Im not the director of a project, it never comes out. I helped 3 videos under another director for huge name clients, and all of those videos either never came out or my work wasnt included.\n\nIs this what they mean by \"luck is important\" in animation?\n\nI just want to work\n\nIf you DM me ill show you my reel which has some of that work. I think Im at least mid-level. I can share the reel privately",
    "score": 133,
    "url": "https://reddit.com/r/animation/comments/1po8uec/vent_director_is_scrapping_a_years_work_to_start/",
    "created_at": "2025-12-16T18:01:46.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1o0i6ls",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I made a chart to de-risk gamedev",
    "text": "I made a chart to compare **copies sold** with **time spent** on gamedev in order to obtain a **given annual salary.** (Inspired by XKCD's \"Is It Worth the Time?\")  \nIt's customizable so you can enter in how much you plan to sell your game for and what your profit margins are.\n\nGamedev is only risky if you can't afford to fail, and knowing what you need to achieve before you start is a strong step in the right direction of making wise gamedev decisions.\n\nTo customize it, choose File &gt; Make a Copy and enter in your own Game Cost and Profit Margin\n\n[https://docs.google.com/spreadsheets/d/1LEPf71MaNkSNS2B0q1teu4V0dnijiEIj08ewAhAAFSU/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1LEPf71MaNkSNS2B0q1teu4V0dnijiEIj08ewAhAAFSU/edit?usp=sharing)\n\nI hope this helps!",
    "score": 109,
    "url": "https://reddit.com/r/gamedev/comments/1o0i6ls/i_made_a_chart_to_derisk_gamedev/",
    "created_at": "2025-10-07T15:36:34.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1ka9hu3",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "State of the Games Industry and Job Market in 2025",
    "text": "Hey all, I recently wrote a post [reflecting on the last 5 years](https://kaiwueest.com/insights/layoffs/) in regards to the economy and all the hiring and firing that happened because of it, starting with COVID all the way to today.\n\nI've looked at different sources and just wanted to share some numbers I've come across here with you. According to Amir Savat, the industry is on track to **shed 40'000 roles since 2022 by the end of this year.** [\\[1\\]](https://www.linkedin.com/posts/amirsatvat_2025-games-layoffs-forecast-42225-6328-activity-7320607851230420994-coqh?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAAxzSucB9Xh2rSTniFLco0yOBTZhwKbi_8c) \n\nThese are his recorded layoff numbers:\n\n* 2022: 8'500 \n* 2023: 10'500 \n* 2024: 15'631 \n* 2025: 6'328 (Projected)\n\nHowever, the important data point is that the open roles we are expecting to have this year industry-wide will exceed the layoffs. Annually that's been about **13'500**, a number that has stayed somewhat constant between 10k - 15k, and with turnover included it rises to about 20k. [\\[2\\]](https://venturebeat.com/games/how-amir-satvat-finds-jobs-for-thousands-of-game-industry-people-gdc-talk/)\n\nThat, even on its own, is good news because it means we're stabilizing and recovering. But to quote Rob Fahey: The big question isn’t whether the jobs that went away will come back – they will – but *where* and in *what* form they'll come back.\n\nAnd to look at that I'd like to use Ben Pielstick's and Rich Vogel's insights to describe this shift. [\\[3\\]](https://www.linkedin.com/pulse/game-industry-job-market-shifts-20242025-ben-pielstick-vf5ue/) [\\[4\\]](https://www.linkedin.com/pulse/observations-from-gdc-2025-rich-vogel-tdn6c/)\n\nTo start, experimental, risky and niche stuff like VR/AR development got absolutely destroyed. Platform wise, most open positions are now in PC, followed by mobile, followed by console game development. As you'd expect, with safe games and safe monetization models.\n\nOn a studio level, AAA saw decreases in headcounts, while indie and AA made gains. Outsourcing also continues to increase across the board, with large studios becoming hesitant to build up every pipeline in house. It may explain why Art, QA and Narrative where the hardest hit disciplines. \n\nLastly, regions also experienced differences in job losses and gains. North America, the most expensive labor market, saw the largest losses followed by western Europe. And it's also where the job growth is the slowest. Meanwhile, lower-cost regions like eastern Europe, Asia, Brazil and India are experiencing that growth as jobs are moved and entire new studios are being formed there. \n\nIt's a sad reality, but it is what it is. It's cheaper to hire developers there, which means that a job lost over here has a high chance to end up over there. And even then, this process will take a year or two. Until then, the prospects for entry-level job seekers will remain very tough, and our salaries won't make us jump in joy. The political uncertainty, ranging from trade wars to actual wars, does us no favors here either. And yet, here we are, and many of us will power through it and look back in a couple years, from wherever that may be.\n\nAnyways, those were my 2 cents. I'm not a subject matter expert and just riding the waves like most of you, but if you have any insights or anecdotes to share I think we'd all be happy to read and discuss them.",
    "score": 101,
    "url": "https://reddit.com/r/gamedev/comments/1ka9hu3/state_of_the_games_industry_and_job_market_in_2025/",
    "created_at": "2025-04-28T23:13:57.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1mp78ly",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "I am losing faith in my new artist after previously getting scammed, I'm losing faith.",
    "text": "For context, I've been working on a RPG game for 7 years now (longer unnoficially), this is a world I've escaped in since I was a child and is a labor of love. This game is what I'm going to leave behind because according to doctors, It's unlikely that I'm making it past the age of 45. This is all I have, this is what it means to me. Sorry for the upcoming hefty text, a big part of it is me venting cause I have no friends.\n\nI found my first artist on Deviant Art, his portfolio was polished, his art told stories and he had experience working for a chinese company that mass produced artwork. He quickly connected cause he was craving to quit his job to work on real projects with people who would appreciate his name. Fast forward, we signed a contract I showed him everything about my project, we agreed on 20,000$ which I VERY FOOLISHLY accepted to pay in advance. Side note, those were my savings, I haven't done financially well in a long time due to hardship.\n\nHe started doing the work, it was amazing, but within a month he started slowing down... and the quality of his artwork was nowhere near what he started with. It went from amazing linework, to something a beginner would draw in illustrator it made no sense. When I told him that won't work, he asked for more money. He said my expectations were too high (which I never hid from the start), that my game was too much work and he would only continue if I paid another 20,000... that was a month in and he didn't deliver enough work to get that money's worth yet, even. \n\nSo yeah, I realized I was getting pushed around, getting scammed at that point too. He started gazlighting me and would use nasty personal attacks when I tried to make things right, wished I would shut up and die... then he blocked me everywhere until I threatened to sue... but he's in Thailand and yeah, that just got more complicated cause after that he ghosted me.\n\nThat was an expensive lesson, it demoralized me for an entire year - I barely touched my project during that time.\n\nThen I dug myself out of my hole and knew I'm betraying myself if I don't keep going. I went out and hunted for another artist, this time much more dilligently, I went as far as talk to the people who hired them before to see how that went. Looked at their social media, demanded an interview, and so on. I've learned my lesson.\n\nThen I find my new (current) artist, he has a good reputation, he's super pleasant to speak with, he's connected with his art, he has a beautifully distinctive style that is very close to my vision, we immediately got along and started to discuss everything.\n\nI know I needed a full time artist at this point, or someone who can contribute several hours weekly on my game to fully skin it. Then he asked me for 1,000$... I'm like, ahead or in full? He went \"full\", he loved my project so much, he thought it would succeed and that it could be his break. He wanted his name on the frontlines (aka Game by ME, Artist by HIM), and I was like absolutely but you need more money... like, those are my expectations weekly. Are you sure?\n\nHe kept insisting that it was, and that he'd just make money with all of his other clients (he did a lot of small jobs). We started working, and well... everything was great except that... he was being lazy about my project. Which was my fear when he insisted that 1,000$ was enough.\n\nThen brought back the conversation after a few months, he's barely done any finished artwork I could use. It was all sketches and it seemed he was struggling with consistency (like a character would have 3 holes on a belt, and suddenly no holes, etc). \n\nSo I opened dialogue with him again and he had a bit of a cold response this time, he goes \"well I have other jobs too I need to make money\"... so I was like, wth... instead of acting up, I just offered him more money on the spot. I told him maybe even work out a weekly or monthly salary, tell me how much money you make a month and we can work up from there! Then you can focus on my project!\n\nAnd that wasn't enough? Now his mother died, his doctor told him he can't draw anymore (even though his social media is coming up with new art all the time...), and I don't know I just want to bash my head against the wall.\n\nShould I just fire him and cut loose on that stupid 1k, should I try to continue negotiate with this artist for a weekly/monthly salaray or a bigger flat rate? Or is this enough of a red flag to just run for the hills right now... I'm so tired. I have a massive game with fully funtional systems, on a white canvas, with no art. It makes me weep.\n\nSorry for the heft message, probably no one reading but if you did, thank you for listening.\n\n",
    "score": 89,
    "url": "https://reddit.com/r/gamedev/comments/1mp78ly/i_am_losing_faith_in_my_new_artist_after/",
    "created_at": "2025-08-13T15:15:58.000Z",
    "num_comments": 117
  },
  {
    "id": "reddit-1m43ban",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Analytics of \"An Unfinished Game\" : Results of a blind Steam launch with 1000 wishlist",
    "text": "Hello, I’m Vinzzi, solo dev behind my first silly game called [\"An Unfinished Game\"](https://store.steampowered.com/app/2919990/An_Unfinished_Game/) that quietly released on Steam one month ago on June 19th. I wanted to share the results and analytics as openly as possible to give an idea to other small starting indie devs on what to expect from a Steam launch with relatively low visibility.\n\n**Wishlist :**\n\n* At launch : 1140\n* Currently : 1963 (+800 since launch)\n* Wishlist deletions : 203\n* Wishlist purchases : 118\n* Conversion Rate : 5,5%\n\nHow did I get 1140 wishlists for launch? About 850 came directly from the participation at the Steam Next Fest back in October last year. The remaining 300 came from natural wishlist’s addition (on average 2 per day). I honestly can't recommend enough participating in a Steam Next Fest, it's free visibility at the simple cost of making a free demo version.\n\n**Sales and revenue :**\n\n* The game was sold at a price of 6,99$USD along with a 20% launch discount.\n* Units sold : 229 (half of which came within the first week of launch, remaining during Steam Summer Sales)\n* Units refunded : 14\n* Gross revenue : 1350 $USD\n* Expected net revenue : less than 800$ USD (I have not yet received money from Steam, it should only be at the end of the month, but it’s a guesstimation of gross minus returns, chargeback, taxes, Steam 30% cut and transfer cost).\n\nSince the end of Steam Summer Sales, the sales are stagnating a bit with about 1-2 copies sold per day.\n\n**Other information :**\n\n* Median time played of 1h30 which is honestly good considering it’s about the time it takes to finish a playthrough of my game.\n* I did almost 0 marketing. Only shared in very few Discord servers/Subreddits. As such it was a pretty blind release.\n* The game is not localized, only available in English (almost all sales are from the Anglosphere/Europe).\n* No controller or Steam deck support which can definitely affect sales numbers (a lot of feedback from peeps wishing it had controller support).\n* 21 Steam reviews of the game (0 negative yippie!). So looking at a ratio of about 1 review per 10 copies sold.\n* 4 curators reviewed the game, once again all positive.\n* The free demo was played by about 900 users.\n\n**Conclusion:**\n\nConsidering the game niche nature (comedic walking sim about game development), the fact it’s my first game (far from perfect), and the lack of any marketing, I’m still pretty happy of the results. It was a long journey, lots of ups and downs but I reached the goal of a finished game... or in this case “An Unfinished Game” hehe. If I can, you can too!\n\nThe usual : **Don't expect a masterpiece success on your first attempt, nor should you do it for the money.** I estimate my \"salary\" per hour spent on the game at something like 0.5$/hour, which, spoiler alert, is really far below minimum wage.\n\nI'll end with a shame(full)less plug : If you want to play a silly 3D walking-sim joking about game developpement and the gaming industry in a midday fashion between Stanley Parable and Portal, the [Unfinished Game](https://store.steampowered.com/app/2919990/An_Unfinished_Game/) Testing Facility welcomes you!\n\nThere’s lot more that I could share but I don’t want the post to be too long, so I’ll be in the comment answering questions if anyone have any, AMA!\n\n\\- Vinzzi, Creator of an Unfinished Game.",
    "score": 82,
    "url": "https://reddit.com/r/gamedev/comments/1m43ban/analytics_of_an_unfinished_game_results_of_a/",
    "created_at": "2025-07-19T18:28:07.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1otwsxl",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Game dev compensation: what actually motivates you?",
    "text": "Hey folks, I’m the founder of a small 4 person indie studio. Up until now we’ve just paid everyone a flat salary, but we’re getting ready to expand the team and I’m trying to understand what actually attracts talent and keeps people motivated.\n\nI’ve been considering adding bonuses tied to milestones or revenue. The upside seems obvious when a project does well, but the flip side is rough...those systems might tank morale if a game underperforms.\n\nIf you work in professional game development, how is your compensation set up? Salaries only? Profit sharing? Royalties? Milestone bonuses? What actually motivates you day-to-day?\n\nWould love to hear real experiences.",
    "score": 49,
    "url": "https://reddit.com/r/gamedev/comments/1otwsxl/game_dev_compensation_what_actually_motivates_you/",
    "created_at": "2025-11-11T01:48:05.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1ixvvf4",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "Post-mortem: Tiny Witch - The Game That Didn’t Give Up on Me",
    "text": "Hey everyone! How’s it going? My name is Ramon Barbosa, and I’m the founder of a small indie studio here in Brazil, South America. Alongside me are my wife, Suellen Fernandes, developer Luis Patrocínio, and a great friend, Skullbrow, who helped create the initial artwork for my games.\n\nMy journey in game development began in 2015, during my spare time while working as a developer. To fund the studio, I invested 30% of my salary since my specialty is programming and I needed support in other areas such as game design, art, and sound design. After an eight-hour workday at my main job, I would spend another four hours creating games.\n\nIn 2021, I published my first game. At the end of that same year, in December 2021, I released the second one, which unfortunately didn’t achieve the expected results — it didn’t even reach a thousand dollars in sales on Steam. I started to think that maybe making games wasn’t for me, especially since I had been doing it for a few years and felt like I wasn’t making progress. On top of that, balancing both jobs was becoming increasingly exhausting. But since I had already started developing the demo for a third game, I decided to at least finish it. After completing the demo for *Tiny Witch*, I decided to release it on Steam Next Fest without much expectation. And that’s when everything changed.\n\n**TL;DR**\n\n* *Tiny Witch* made me continue developing games.\n* Participating in Wholesome Games 2022 led to a significant increase in wishlists and coverage on sites like IGN.\n* The demo on Steam Next Fest won over the community, with highly positive feedback.\n* I received funding that allowed me to hire a small team to help me finish the game.\n* The launch had its challenges, such as difficult balancing and criticized controls.\n* The game won the Google Indie Games Fund 2023 and was released on Google Play Pass.\n* Now, I’m working on bringing *Tiny Witch* to consoles and developing an even cozier new game.\n\n\n\n**About the Game**\n\nIn *Tiny Witch*, you play as a little witch who runs a magical store in a town full of dungeon masters. The goal is to fulfill customers’ requests before they become impatient by mixing ingredients, crafting minions, and activating spells to keep up with the demand. The game combines time management and crafting mechanics, requiring agility, organization, and strategy.\n\nAs the store grows, the challenges increase, but new expansion opportunities also arise. The money earned can be used to unlock equipment and decorations, while different stages — such as forest, cave, and desert — bring various requests and customer types. All of this comes with a touch of magic and charming pixel art!\n\n**Game Numbers**\n\nHere are the game’s statistics:\n\n* Lifetime Steam Units: 4,160 units sold on Steam\n* Lifetime Retail Units: 415 activations via Steamworks\n* Lifetime Total Units: 4,575 units in total\n* Lifetime Units Returned: 561 units refunded (13.5% of Steam sales)\n* Lifetime Total DLC Units: 69 DLC units sold\n* Review Score: 71% positive (64 reviews)\n\n**Development Time:**\n\n* 6 months to develop the demo with a team of three professionals\n* 8 to 10 months participating in events and seeking promotional opportunities\n* A few additional months to secure the finishing funding\n* 8 months to finish the game after receiving funding\n\nThese results reflect *Tiny Witch*’s initial performance in the market, highlighting both its strengths and areas for improvement in future projects.\n\n**What Went Right**\n\n**Participation in Wholesome Games 2022**\n\nThis was the real turning point. When *Tiny Witch* appeared at the digital event, the impact was immediate: on the day of the broadcast, the game received 1,507 new wishlists—the highest number in a single day at that time! Additionally, participating in the event allowed for the game to be mentioned on renowned websites like IGN, bringing even more visibility to the project.\n\n**Reception of the Demo**\n\nThe demo on Steam Next Fest was also essential. I wasn’t expecting much, but the community greatly embraced the game. The feedback not only praised the concept but also offered valuable suggestions. This response reignited my motivation to continue.\n\n**Interest from Publishers**\n\nAfter the demo’s success, several publishers reached out to discuss the game’s porting potential. On one hand, this was amazing because it meant something was compelling about the demo and the game itself. On the other hand, I won’t deny that I felt a lot of fear — the doubt about whether I could truly move forward started to weigh on me. Even so, this interest was the push I needed to keep going.\n\n**Final Funding (Finish Funding)**\n\nAfter a few months of negotiations, I finally secured **finished funding** for the game, along with a marketing budget. This financial support was enough to help me complete the game and release it with more content and improvements. While the money didn’t cover my expenses, it allowed me to hire people to support me during development and make it possible to finish the project.\n\n**Launch and Recognition**\n\nDespite the challenges, *Tiny Witch*’s release was the studio’s most successful to date. The recognition didn’t stop there: the game received the Google Indie Games Fund in 2023, enabling its launch on Google Play Pass. This achievement boosted the team’s morale and solidified *Tiny Witch* as the studio’s first major milestone.\n\n**Challenges of Developing Games in Brazil**\n\nHere, I’d like to give a bit of context about what it’s like to develop games in Brazil.\n\nFirst, English is not my native language. Of course, I study and understand how to communicate well, but I still have moments when I get stuck, which can make certain situations, like events and negotiations, more challenging.\n\nThis isn’t a complaint, but a way to show the challenges that developers here face. For example, publishing a game on Steam requires a fee of 100 dollars. Although the conversion isn’t always done at the full exchange rate, the impact of that amount in Brazil is much greater: it represents almost 38% of the minimum wage. In comparison, in the United States, the same amount is about 8% of the federal minimum wage and only 3.5% in Washington state, where the minimum wage is the highest in the country.\n\nThis is just one example of how costs can be heavier here, making every achievement even more special.\n\n**What Went Wrong**\n\n**Difficulties at Launch**\n\nDespite all the effort, the launch didn’t achieve the expected performance. Perhaps the fact that it was released on a Friday, with only 20,000 wishlists, contributed to this. Additionally, the game ended up being more difficult and chaotic than the audience expected. The controls were also criticized for not being as responsive as they should be for this type of game.\n\n**Burnout and Anxiety**\n\nThis was one of the hardest parts. In early 2024, the intense workload — 12-hour days, split between my main job and game development — took its toll. Burnout and anxiety affected my mental health and delayed the necessary updates to address the issues reported by players.\n\n**Undetected Issues During Testing**\n\nEven with QA tests and external playtests, some problems went unnoticed, impacting the game’s initial reception. This highlighted the importance of conducting more extensive testing in different contexts.\n\n**Lessons Learned**\n\n**Keep Going, Even When It Feels Difficult**\n\nThe path isn’t always easy, but each obstacle overcome brings new lessons and opens doors that once seemed unreachable. If *Tiny Witch* taught me anything, the next step might be the one that changes everything.\n\n**Work-Life Balance**\n\nTaking care of your mental health is essential. Overworking not only affects the quality of the game but also prevents you from enjoying your achievements.\n\n**Early Feedback**\n\nReleasing a demo as early as possible is a great way to gather valuable feedback. This input helps adjust development to meet players’ expectations and avoid negative surprises after launch.\n\n**Adjusting Expectations**\n\nEvery developer has their journey. Comparing yourself to others can be discouraging. The best approach is to focus at your own pace and seize the opportunities that come your way.\n\n**More Comprehensive Gameplay Testing**\n\nThorough testing is crucial, but playing the game repeatedly can make certain problems harder to notice. That’s why external testing helps identify issues that only first-time players experience.\n\n**Conclusion**\n\nIf there’s one thing I’ve learned, it’s that *Tiny Witch* didn’t give up on me — and I didn’t give up on it either. The game brought the studio’s first major achievements: media recognition, financial investment, and an international award. Now, I’m focused on porting *Tiny Witch* to consoles and continuing to improve the game within my possibilities. At the same time, I’m developing a new project to create a truly cozy experience — one that feels like sipping hot tea on a late afternoon, wrapped in a blanket, watching the sunset.\n\nAnother important point is that it’s okay to take a break and reassess your plans. That doesn’t mean you won’t succeed — sometimes, you just need a little rest. Know that challenges are part of the journey. And sometimes, the next step might be the one that changes everything. See you next time!\n\n",
    "score": 38,
    "url": "https://reddit.com/r/gamedev/comments/1ixvvf4/postmortem_tiny_witch_the_game_that_didnt_give_up/",
    "created_at": "2025-02-25T14:10:56.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1m7ab7v",
    "subreddit": "gamedev",
    "soc_codes": [
      "15-1252",
      "27-1014"
    ],
    "title": "From software developer to game dev, is it doable today ?",
    "text": "Hello,\n\nI’m a software developer in France, and I’ve been working for almost two years now. I have a typical French background with an engineering degree. I’m mainly focused on backend development, mostly working with Java.\n\nI’m lucky to have a real passion for game development, but I’ve put it aside for too long. Social pressure, higher salaries… but I’m tired of it, and I really want to dive into this passion. I want to grow alongside other developers, be connected with artists, game designers, etc.\n\nI’d love to hear from people who have followed a similar path. Is this kind of career shift easy? Common? If you made the switch, do you regret it?\n\nI’ve been dedicating my free time to Unreal Engine development for about a year now. I’m working on a project that’s moderately advanced, though progress is slower because I’m also handling the artistic side—3D modeling, texturing, animations… which takes more time than the development itself. But I do have something to show—could that help me?\n\nI know these times aren’t ideal for being picky, but I don’t want to work in a “work-for-hire” studio doing mobile ports or ads… I need to be creatively stimulated.\n\nIn France, we have Ubisoft’s graduate program for new graduates, but it requires less than one year of professional experience. That’s unfortunate, as it seemed like an ideal entry point for me.\n\nDo you know of any other similar programs? I’m open to moving abroad, though it might be tricky since my girlfriend would need to be able to come too.\n\nThanks for reading :)\n",
    "score": 31,
    "url": "https://reddit.com/r/gamedev/comments/1m7ab7v/from_software_developer_to_game_dev_is_it_doable/",
    "created_at": "2025-07-23T14:11:10.000Z",
    "num_comments": 46
  },
  {
    "id": "reddit-1jx57tm",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "Constructive Feedback for a first-timer?",
    "text": "Hi! To start, I’m a professional illustrator, graphic designer, and digital product designer. I went to art school hoping to break into the animation industry, but pivoted to graphic design and illustration and have spent my professional career focusing on those 2 items before figuring out how much I enjoy UI/UX design. \n\nHowever, my love for animation remains strong, and last week I downloaded Procreate Dreams to animate one of BookTok’s favorite couple to a scene from “10 Things I Hate About You” (any ACOTAR fans in here?). I dove right in with a pencil test (?) and I would LOVE to hear constructive feedback before I take it further. I have some notes for myself, and would be open to having those validated, as well new ones identified :)\n\nThank you for your time and consideration! \n\nSpecs: 9:16 ratio, 16 secs, 12 fps",
    "score": 30,
    "url": "https://reddit.com/r/animation/comments/1jx57tm/constructive_feedback_for_a_firsttimer/",
    "created_at": "2025-04-12T00:45:41.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1jwhdrk",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "I am accepting the fact that I am probably not going to be able to make it to the big screens and I’m letting my 6 year old self down. Maybe dreams are just false realities.",
    "text": "Going through depressive thoughts. Finally believing I’m not enough. How can I move forward keep motivation knowing others are being accepted and I’m still rejected?\n\nIn reality maybe I just really need a mentor. An art mentor or animation mentor. Where can I find mentorships? I really want someone to walk me through my portfolio since I never had the chance to have advice or aid. I’m willing to put my website here but I get nervous because this is a public domain and I don’t want people to see my information. But either way, I was scrolling through instagram and I saw someone get accepted to an internship I tried applying to but got rejected. I saw their stuff and they seem put together and know what they’re doing. They were also accepted to other internships and had many opportunities for experience and putting their stuff out there. \n\nI never had anyone guide me to how a portfolio should look. Never had anyone look at my website. Never felt prepared and never felt put together like others. I regret not going to higher league art schools like SCAD or schools in LA but with a brother in medical school. My family didn’t have the money for a 80k to 100k tuition for 4 years. I am graduating from UMBC and it was a waste of time and money. As an animation student, I’m leaving the school insecure, disappointed, and frustrated. I never took effective animation courses,never took a class that focused on shading or lighting, no classes in lip syncing or in acting. And seeing others thrive puts me in a depression. My life sucked, I struggled with disabilities and I try to keep moving forward but the more I try. The more I keep letting myself down and others beat me to my dream. \n\nSo, as a graduate this spring. I have no internships. No job. More rejections. Bad works  or pieces I don’t feel proud of. And I guess seeing this person get what I always wanted as an artist put me into a position where I think I need to give up and stop trying to make myself believe I’m a good artist or animator. As someone with ADHD with RSD and anxiety. This affects my ability to stay motivated to finish my final film and I keep telling myself that i’m both stupid academically from my disabilities and now untalented in the creative. So, in the end. I am not fit for anything besides retail or any job that’s not career driven. I could use some advice in seeking other jobs that would sustain me financially away from art. At this point, I don’t believe in my art or myself. ",
    "score": 23,
    "url": "https://reddit.com/r/animation/comments/1jwhdrk/i_am_accepting_the_fact_that_i_am_probably_not/",
    "created_at": "2025-04-11T04:18:24.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1p2v485",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "If i learn this type of animation, will i get a job in US market ?",
    "text": "Im a big cartoon fun, especially of that style, like Rick &amp; Morty, TMM etc\n\nIm watching YT videos, trynna learn it from scratch, but seems like hard af\n\nQuestion is, once i do learn it, can i get a job AND what salary can i expect in that case?",
    "score": 16,
    "url": "https://reddit.com/r/animation/comments/1p2v485/if_i_learn_this_type_of_animation_will_i_get_a/",
    "created_at": "2025-11-21T10:23:18.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1ou9j69",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "How do I muster the energy to create something of my own after a 9-6 job",
    "text": "I’ve been a 3D animation professional for 13 years, and I truly love what I do. But throughout my career, I’ve often found myself in roles where I’m not creatively fulfilled. When I was freelancing, I used to create my own animations and felt more connected to my work—but freelance opportunities are harder to come by now. So I’m currently at a studio job that’s extremely draining. Constant technical issues, unstable rigs, and minimal support have all led to burnout.\n\nBy the time I get home, I just think about the personal work I wish I had the time and energy to create. It’s like I’m stuck in a loop of guilt and frustration, knowing I’m capable of more but not able to get to it.\n\nI’d really love to hear from other artists who work full-time: How do you find the energy to be productive on weekends and still feel fulfilled? Any advice or personal perspective would mean a lot.",
    "score": 13,
    "url": "https://reddit.com/r/animation/comments/1ou9j69/how_do_i_muster_the_energy_to_create_something_of/",
    "created_at": "2025-11-11T13:32:20.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1korjkx",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "10 Years of 2D &amp; 3D Animation: I’ve condensed years of growth into just 3 minutes.",
    "text": "Over the years, I’ve saved every project I worked on. From my very first attempts at learning 2D &amp; 3D animation to professional work for clients like Assassin’s Creed, Different Films &amp; TV Series, the NFL, For Honour, Maxon ZBrush, Mötley Crüe, and more.  \n  \nThis video shows my full journey. It starts with some pretty rough early work and gradually moves toward the level I’m proud to call my career today.  \n  \nI hope it can inspire young talents to keep pushing forward and follow your own creative path.",
    "score": 11,
    "url": "https://reddit.com/r/animation/comments/1korjkx/10_years_of_2d_3d_animation_ive_condensed_years/",
    "created_at": "2025-05-17T12:13:53.000Z",
    "num_comments": 2
  },
  {
    "id": "reddit-1nwi4go",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "Is animation a career worth pursuing in today's world?",
    "text": "Hello everyone, sorry in advance for the pessimistic tone of this post.\n\n\n\nI'm at the point right now, where I have to choose my major, and start working towards my future. I've always wanted to get a job in animation, but seeing how ai video generation is getting better, I'm having second thoughts.\n\n\n\nWithout dumping a whole bunch of questions, i just wanna know, from people who know the industry, will pursuing a career in animation in like 5 years, be possible?",
    "score": 11,
    "url": "https://reddit.com/r/animation/comments/1nwi4go/is_animation_a_career_worth_pursuing_in_todays/",
    "created_at": "2025-10-02T22:28:22.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1jj6je8",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "Is it still worth it to pursue a career in animation at this point?",
    "text": "I'm currently in my third year of high school. I've always wanted to work with animation and art, but nowadays that seems increasingly impossible\n\nIn my country, they don't value this market, I want to do it more abroad. The problem is that with the advancement of these AIs, it seems to me that this market will devalue more and more\n\nNot only that, but does this market even employ people? Or will I go hungry and unemployed with just a diploma?\n\nThe solution to this would be for me to look for another career that I'm interested in. But the problem is: I DON'T HAVE ONE. I literally can't get interested in ANYTHING outside of the arts, unfortunately\n\nI think my destiny will be McDonald's",
    "score": 9,
    "url": "https://reddit.com/r/animation/comments/1jj6je8/is_it_still_worth_it_to_pursue_a_career_in/",
    "created_at": "2025-03-25T00:21:09.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1p5flyr",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "What do I need to buy my daughter who wants to make her own animated shorts/anime.",
    "text": "My kid is 14. Art/drawing has always been her thing and she is very talented, although I know I’m biased as her parent haha. \n\nShe isn’t a beginner in terms of digital art, but only has used an iPad and procreate up till now. She will be a beginner in terms of animation and software though, other than basic stuff available on iPads. \n\nIf I wanted to get her a solid set up for animation, what do I need? \n\nAm I better buying her a graphics tablet and software for her PC? I don’t want to upgrade her iPad when really she only uses it for drawing so maybe a drawing specific tablet would be better. \n\nI built both our pcs for gaming and I’m hoping either one would be capable of running whatever software she’d need. \n\nShe has ADHD and Autism and this is her special interest so ideally need something that’s easier and intuitive to use, that will stand her in good stead for if she chooses a career in this or wants to go to uni for it. \n\nAny advice welcome! ",
    "score": 8,
    "url": "https://reddit.com/r/animation/comments/1p5flyr/what_do_i_need_to_buy_my_daughter_who_wants_to/",
    "created_at": "2025-11-24T12:20:47.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1lr1fmq",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "Can any Animator relate?",
    "text": "Hey! So, I just wanted to come over and vent. I've been studying Animation for over three and a half years now, hoping to graduate with my Honours by the end of this year. I'm in a rock-and-a-hard-place situation in my life right now—one of the aspects really gnawing at me is my career and future.\n\nI have always loved art and telling stories through my work. I consider myself an artist who's actively been trying to improve, adjusting and building upwards with the constructive criticism I receive. This past year or two, I’ve just been feeling in the dumps with my art.\n\nThe second I finish a piece I’ve been working on—after spending hours on it—I feel real accomplishment, like I’ve done something right with my time. Well, that only lasts for about a second, until I realize that there are millions of other artists/animators out there who can make the same thing I made with ten times more charm, ten times more beauty, and ten times more skill.\n\nPeople often tell me to go look at places like Pinterest or Dribbble for inspiration... I only feel like utter trash afterward. My art will never measure up, will never be able to compete. I’m supposed to enter the industry next year, and I can’t imagine companies and clients picking me out of the hundreds of better artists out there.\n\nThe advent of AI just makes things worse. People don’t even have to pay for artists anymore... they can literally just ask a website to make them something, and then boom—not even five seconds, and they have a Leonardo da Vinci–level output. I will never be able to meet the level of my “competitors.”\n\nThe stupid part about this whole thing is that I just simply can’t imagine spending my life working in another industry. Art is my life.\n\nThe average person doesn’t understand what it means to actually be an animator. When I tell someone what my career is, they immediately expect some Disney-level stuff. They never stop to think that it takes tons of people to make something of that level, so they’re also often just utterly disappointed when they see the kindergarten-level garbage I make.\n\nArt has been the only thing I’ve ever been remotely good at my whole life, and to see that being tossed in the furnace is soul-crushing.",
    "score": 8,
    "url": "https://reddit.com/r/animation/comments/1lr1fmq/can_any_animator_relate/",
    "created_at": "2025-07-03T21:28:52.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1omeki0",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "A bit confused regarding my animation career.....",
    "text": "I am a electronics engineering graduate but, switched my career to design and, animation, since I was into the creative field and part of a photography club, which made me switch up my career.\n\nSo, currently I am enrolled in a course for, \"Advanced 3D Animation\" and, the softwares we are being taught are, Photoshop, Illustrator, Premier Pro, Audition, After Effects, Auto desk Maya and, Z-Brush.\n\nI love to illustrate, draw, paint, and I'm into graphic design, photography, videography and, Editing. Now I have started loving 3D animation too.......but this is what overwhelms me.......in what direction should I go in.......\nI am lost and, in doubt about, how do Adobe softwares and Maya and Z-Brush will help me in 3D animation? \nAlso I am a beginner so I would love any advices regarding this! ",
    "score": 8,
    "url": "https://reddit.com/r/animation/comments/1omeki0/a_bit_confused_regarding_my_animation_career/",
    "created_at": "2025-11-02T11:07:38.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1mqwwsf",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "learning 2D animation in 2025 still worth it? Looking for honest advice.",
    "text": "Hey everyone,\n\nI’ve been thinking a lot about starting my journey into 2D animation this year. I’ve always loved hand-drawn/cartoon-style animations and the charm they bring, but I also see a lot of talk about AI tools, 3D animation, and motion graphics taking over the industry.\n\nBefore I commit time and money to learning, I wanted to hear from people who are actually working in the field (or have been learning recently):\n\nIs 2D animation still in demand in 2025?\n\nAre there enough career or freelance opportunities?\n\nIf you started learning now, what software/skills would you focus on?\n\nAny advice on balancing creativity with market demand?\n\nI’m not looking for sugar-coated answers — I want to know the real pros and cons so I can make an informed decision.\n\nThanks in advance to anyone who shares their experience!",
    "score": 6,
    "url": "https://reddit.com/r/animation/comments/1mqwwsf/learning_2d_animation_in_2025_still_worth_it/",
    "created_at": "2025-08-15T12:50:24.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1kh5hml",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "Indie animation red flags",
    "text": "\nI applied for an indie animation project as a background artist that was self-funded because I thought it would be a good start for my career. They asked for pro bono (unpaid) samples, and I made one anyway knowing full well they could use it however they wanted (yes, I know it was stupid and desperate of me). They liked my sample and I was immediately accepted. They told me they were willing to pay 100-300 USD per background (which I didn't mind because it was a show that aligned with my passion), but then they ghosted me shortly after. Later, they came back wanting to negotiate the rate much lower at 100 or less which was the amount they were paying their bg artists. On top of that, they mentioned that other applicants who made samples had ghosted them or didn’t complete their work... but it was strange, because the director was ghosting me pretty often too. It was just one red flag after another.\n\nJudging the current reels for their show, it's inconsistent quality (probably with inconsistent pay). I should've seen that first red flag.\n\nThis is my first time applying for a job in animation, but I also learned my lesson. \n\n",
    "score": 6,
    "url": "https://reddit.com/r/animation/comments/1kh5hml/indie_animation_red_flags/",
    "created_at": "2025-05-07T18:59:56.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1oz2xy7",
    "subreddit": "animation",
    "soc_codes": [
      "27-1014"
    ],
    "title": "How to get into animation?",
    "text": "ive always been fascinated with animation, both 3d and 2d, and ive wanted to be an animator since i was like 10 when i watched 'animator vs animation' on youtube, but ive procrastinated it for sooo long because i had no idea where to start and i was also scared about failing, but then i recently watched arcane and realised id rather fail and have at least tried than not tried at all.\n\nim looking for advice on where to start. probably 3D, im a bit skeptical about getting into 2D cause ive heard its alot more difficult in terms of making a career out of. Would super appreciate any sort of advice. thanks in advance :)",
    "score": 5,
    "url": "https://reddit.com/r/animation/comments/1oz2xy7/how_to_get_into_animation/",
    "created_at": "2025-11-17T01:13:00.000Z",
    "num_comments": 7
  }
]