[
  {
    "id": "reddit-1n1yoj6",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "I made a gift for my daughter's SLP",
    "text": "My daughter is 2.5 years old and absolutely loves her slp. Today was her last session because she is starting preschool where they will now do sessions in school. I wanted to make something or give something to the SLP because she has been so amazing with my daughter and I was able to whip this up last night. It is a crochet mouth puppet.",
    "score": 1090,
    "url": "https://reddit.com/r/slp/comments/1n1yoj6/i_made_a_gift_for_my_daughters_slp/",
    "created_at": "2025-08-28T01:02:09.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1i8ylug",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Both of my parents got early onset dementia…",
    "text": "… and encountering fellow SLPs while managing their care has been an interesting ride.  I just want to offer a few things to think about \n- Be cautious with toxic positivity. Saying things like “that’s still your dad in there!” is REALLY unhelpful. We know. We wouldn’t be at the facility with them and making sure they’re being well cared for if we didn’t know that.  When your dad is attacking people, thinking his daughter is a waitress, and trying to eat legos,  patronizing me by telling me he’s “still my dad” is… not it. \n\n- Similarly, picking end stage dementia patients up for cognitive therapy is a joke. You know it. I know it.  I have never laughed harder than when some eager CF was probably pressured in to picking up my dad for “following directions” when he was at the point of re-enacting the Gulf War in his mind and was completely convinced he was at an airport.  Please push back on your DORs for doing this. For families who are in denial or don’t know as much about the disease process, this can probably lead to some really unrealistic expectations. \n\n- Getting aspiration pneumonia is not my worst nightmare.  Watching my smart and capable parents being incontinent and helpless is.  Please be mindful of diet modifications in this population.  And if families bring in beer and a cheeseburger for their loved one, let them fucking enjoy it.  This isn’t a 50 year old stroke with a high probability of regaining function if they stay healthy - this is a person whose brain is literally disintegrating. The priorities are just not the same. \n\n- This is disease is AWFUL. If a caregiver comes across as angry, it’s probably not at you, and they probably aren’t irredeemable assholes. I’m NOT excusing nasty behavior, but it’s worth giving a little grace.  I know I took a bit more of a tone than I meant to a couple of times with SNF staff and apologized later, but the sandwich generation thing is real and it’s exhausting. \n\nHappy to answer any questions if it’s helpful ",
    "score": 644,
    "url": "https://reddit.com/r/slp/comments/1i8ylug/both_of_my_parents_got_early_onset_dementia/",
    "created_at": "2025-01-24T15:56:21.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1na9r36",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Friendly reminder that it's ok for SLP to just be a job and not your life",
    "text": "I see so many SLPs that make being an SLP their entire life. Obviously they can do what they want but for those of us that want work life balance it's OK to come home and not think about work. It's ok to not have the cutest most amazing materials - sometimes simpler is better. It's ok to do what is best for your client but still set the boundaries of not taking work home. It's ok to not have every session be perfect. That is all. ",
    "score": 570,
    "url": "https://reddit.com/r/slp/comments/1na9r36/friendly_reminder_that_its_ok_for_slp_to_just_be/",
    "created_at": "2025-09-06T20:21:23.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1mfqsm0",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Me and my great grandfather Dr. Charles Van Riper",
    "text": "I'm not a speech pathologist but I work with many as a BCBA. A handful of them tell me they have studied his work with stuttering. He's very well loved and remembered in our family and wanted to know if speech pathologists still study his work in their field. ",
    "score": 563,
    "url": "https://reddit.com/r/slp/comments/1mfqsm0/me_and_my_great_grandfather_dr_charles_van_riper/",
    "created_at": "2025-08-02T13:39:29.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1hza071",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "The longer I'm out of grad school, the more I feel like it was a scam",
    "text": "I know people say this hyperbolically but I'm serious, I really do feel scammed out of time and money. I understand that I got a career in return, but I definitely could've gotten here through better ways. \n\n-My courses often centered the latest and greatesr knowledge of...10-20 years ago. I slaved away learning so much that I'd end up needing to just go back and re-learn. \n\n-I don't think many supervisors realized that the way they saw us, the students, as fair game to bully, often did translate to how they made us be towards our clients. I've had to learn much kinder ways of helping instead of manipulating people into doing what I want them to. \n\n-I really think the whole experience can be done in 4 years. So much of my undergrad experience was the same things rephrased 20 times. It could've easily been the core classes, with an apprenticeship after. \n\n-All of that stress just to make a mediocre salary. I know some of y'all boss babed your way into six figures but I just don't want to hear it, that's not most people.\n\nI could probably keep going, I could probably even write a whole book. I was a first generation, I thought all fields of study are like this, but they aren't. It just feels like all the bullying happens to cover up the fact that the programs often suck at actually teaching us what we need to know! ",
    "score": 537,
    "url": "https://reddit.com/r/slp/comments/1hza071/the_longer_im_out_of_grad_school_the_more_i_feel/",
    "created_at": "2025-01-12T00:16:31.000Z",
    "num_comments": 167
  },
  {
    "id": "reddit-1ja30ca",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "They forgot to remove me from their email chain",
    "text": "For context: I'm a CF and I interviewed with this agency last year. Right after I finished the interview, I got this email. The interviewer was discussing her concerns with the manager. What were her concerns? That I wanted to work part time and also asked for $70/hr. I guess they didn't like that 🙄. When I told her that I wanted 70$/hr she literally looked at me coldly and said something along the lines of: I've never heard of a CF ever making that kind of money. Jokes on her because I found somewhere that pays me 75$/hr. (I live in NYC so these rates are normal). They sent me an offer letter right after.\n\nAnyways, I just wanted you guys to see for yourselves what these agencies think of us! ",
    "score": 535,
    "url": "https://reddit.com/r/slp/comments/1ja30ca/they_forgot_to_remove_me_from_their_email_chain/",
    "created_at": "2025-03-13T03:32:04.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1mepe22",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Today a 4th grader told me “fuck you” and kicked my shin and I went away from it feeling proud of how he handled the situation 🥹",
    "text": "I work with this kid who’s a gestalt language processor through and through. He works with a bunch of ABA folks who don’t really get that “go fuck yourself bitch” is just a gestalt (that we can and should shape into something more productive) that probably just means “I’m really frustrated at this situation!”\n\nA couple weeks ago I told him we were all done and he said “please don’t go.” Ugh my heart. \n\nHe’s honestly one of my favorite kids to work with. He always tells me “go away” and “stop. Shut up.” And I do. \n\nBut today I presented him with 4 blank maps (Europe, Africa, Asia, South America) so we could go through and name the countries. Sessions happen in the classroom, there were only 15 minutes left, and he told me he wanted to do all of them. I told him there wasn’t enough time and we should just pick one and get started.\n\n“But I want to do all of them” \n\n“Really?? We just don’t have enough time to do them all but it’s pretty rad you wanna do them all dude. Let’s pick just one.”\n\n“No, all of them.”\n\n“I hear you man. 15 minutes is not enough time to finish all four of these.”\n\n“No. I want to finish all of them today.” \n\n(3 circles of relatively well-regulated communication, and the longest grammatical utterances I’ve seen him produce by far?!)\n\n“I know. We could work on all four at the same time but not finish…”\n\n“Fuck you!” *starts softly kicking my shin* “this one.” *points to Europe map.*\n\n“It sounds like you’re frustrated. Don’t kick me bro. Ima give you a minute.” He walks away. “Thanks for stopping.” I gave him a couple minutes to process his frustration, called him back, and we labeled as many European countries as we could. Proud of him 😅\n\n\n\n ",
    "score": 531,
    "url": "https://reddit.com/r/slp/comments/1mepe22/today_a_4th_grader_told_me_fuck_you_and_kicked_my/",
    "created_at": "2025-08-01T06:46:30.000Z",
    "num_comments": 23
  },
  {
    "id": "reddit-1ic0lsa",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Where are the SLPs that said \"the new administration won't do anything to impact OUR jobs\"?",
    "text": "Please, help me understand how a pause on federal loans and grants won't impact SLPs who work in Title 1 schools? Or specifically federally funded positions (e.g., my first school position as a contracted SLP) in the schools? \nhttps://www.cnn.com/2025/01/27/politics/white-house-pauses-federal-grants-loan-disbursement/index.html",
    "score": 516,
    "url": "https://reddit.com/r/slp/comments/1ic0lsa/where_are_the_slps_that_said_the_new/",
    "created_at": "2025-01-28T12:38:03.000Z",
    "num_comments": 249
  },
  {
    "id": "reddit-1nxdu13",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Every year I get more shocked at my current preschoolers",
    "text": "I know this might sound like a first world problem and I am in no way complaining or lambasting the younger generation. I'm also not writing this to judge parents because I know we are all out here just trying to survive this hell-scape. But as a preschool SLP, I continue to be shocked at how each year the skill level/interest in certain toys decreases. I work primarily with 3-5 year olds. I started out in the ECSE space and saw firsthand the benefit of the smaller classroom and the structure and routine has on the kids. \n\nI now travel to various daycares and preschools and am shocked this year with how many kids do not know Old Macdonald when I sing it. They don't know how to put together potato head (and it's not a fine motor issue). Kids need extensive modeling to complete peg puzzles. Lots of lack of impulse control. I have 4 year olds who are more interested in Labubus and quoting something from YouTube that is wildly inappropriate. It just makes me feel kinda sad for some reason? Anyone else working in early childhood noticing these things?",
    "score": 481,
    "url": "https://reddit.com/r/slp/comments/1nxdu13/every_year_i_get_more_shocked_at_my_current/",
    "created_at": "2025-10-03T22:56:53.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1iaj2il",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Unpopular opinion: I think our jobs are pretty good",
    "text": "I’ve been an SLP for over 10 years. My pay has ranged vastly, from $40k to $120k. I love the work I do. I know there’s a lot of people unhappy with their jobs in this sub, but I think this career can actually be pretty good. The caveat is that it is HIGHLY dependent on your location. For example, California is a great place to be an SLP. In my area, there are tons of jobs and the pay is decent. Over the years, I’ve talked with friends in other industries who would LOVE to have the job security and benefits that we do. I’ve also made equal to more money than my friends in other industries (other health professions, design, business, and tech included). Is it perfect? Definitely not. But I remind myself that a job is a job, and often work will feel like work. I like my job, and I feel fortunate to be in a career that pays the bills, gives me ample time off, and allows me to help people. ",
    "score": 472,
    "url": "https://reddit.com/r/slp/comments/1iaj2il/unpopular_opinion_i_think_our_jobs_are_pretty_good/",
    "created_at": "2025-01-26T16:35:22.000Z",
    "num_comments": 128
  },
  {
    "id": "reddit-1nqdq9y",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "We need to have the screentime conversation with parents",
    "text": "Recently, at school, I’ve been trying to get really brave and tell parents the truth: your kid is very very negatively impacted by their unrestricted screen access at home. \n\nYou know it, I know it, and it’s literally stunting future generations. It’s a giant crisis and it’s never discussed or said out loud because God forbid a parent ever feels shame over their parenting choices. \n\nFuck that. It’s the truth. I recently had an IEP for a kid who’s close to grade level in cognitive functioning and language but who’s in the most restrictive setting for behaviors. And what does every behavior center around? The fact that he has no tolerance for non-preferred activities, whatsoever. No emotional regulation. No ability to attend to something if it’s not short form content on a screen. \n\nAnd that’s because at home he has completely unrestricted access to YouTube kids on an iPad. \n\nSo I said it, at the meeting. I said school is filled with things that are annoying and hard to do. And if outside of school he’s only on a screen that floods dopamine and is completely pleasurable with no demands, it makes it harder for us at school. And I recommended a screen detox. \n\nYou should to! We are one of the few jobs in society where we get a real up close look at what screentime does, as a whole, for these children. We should be shouting it from the rooftops! ",
    "score": 434,
    "url": "https://reddit.com/r/slp/comments/1nqdq9y/we_need_to_have_the_screentime_conversation_with/",
    "created_at": "2025-09-25T17:56:31.000Z",
    "num_comments": 90
  },
  {
    "id": "reddit-1kg6pm9",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "I love being an SLP.",
    "text": "There's definitely some negativity floating around here, some of it justified, some possibly exaggerated, but I want to share a different viewpoint, especially for anyone thinking about SLP school, currently working through it, or who has recently graduated. Treating as an SLP is genuinely rewarding. Every day, you have the incredible opportunity to positively and directly influence someone's life. Whether it's helping them communicate their wants/needs, helping them finally come off the G-tube, or even just bein the person with them for emotional support. The relationships you form with your clients are deeply meaningful; they remember small details about your life, bring you thoughtful gifts, and truly care about your well-being.\n\nThere's nothing quite like having a new client come in and say, \"Someone recommended you because they think you're fantastic.\" Sure, by the end of the day, I'm mentally exhausted and often find myself heading to bed earlier than usual. But the important part is this: I never dread waking up in the morning (well, except for maybe the documentation 🙈). I genuinely enjoy my time spent working with clients, and the days go by crazy fast.\n\nI get why there's plenty of venting here because our field does 100% have its issues, and these can sometimes overshadow all the positives. However, I wanted to share my experience and reassure anyone on the fence: being a speech therapist can be an exceptionally fulfilling career when your pursuing it for the right reasons.\n\nEdit: Hopefully can uplift some of you guys and balance out some of the negativity on this thread. Someone just recommended another post on here for a [documentation assistant](http://trynonotes.com) that they have been using for their notes and maybe it can make the absolute worst part of the job a bit easier lol. ",
    "score": 429,
    "url": "https://reddit.com/r/slp/comments/1kg6pm9/i_love_being_an_slp/",
    "created_at": "2025-05-06T15:02:41.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1k4k6jr",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "The longer I've been in this profession, the more clear it becomes that I've been absolutely lied to.",
    "text": "I'm aware this might sound exaggerated, but it's sincerely how I feel, robbed of both time and money. Sure, I got a career out of it, but there had to have been more efficient and beneficial ways to reach this point.  \n\\-So many of my courses presented outdated information as cutting-edge, material often from 10-20 years ago. I spent countless hours learning content that ultimately required extensive relearning later on or better yet are completely unusable in practice. \n\n\\-I don't think most supervisors realized how their attitude towards students, often harsh and unnecessarily critical, affected how we interacted with our own clients. I’ve had to intentionally unlearn manipulative approaches and replace them with more compassionate, genuine methods.\n\n\\-Honestly, the entire experience could easily fit into a concise four-year timeline. Undergrad frequently felt repetitive, covering the same topics multiple times in slightly different ways. We could have just focused on core classes and transitioned directly into apprenticeships. Learning with real world experience.\n\nAll that stress and financial burden, only to earn a pretty average salary. Yes, I know a few people have leveraged their way to six figures, but they're the exception, not the standard.\n\nI could ramble on this endlessly. As someone who has been in this profession for over 13 years, I've realized there are simpler and healthier paths to achieve the same career outcomes. The exploitative work environment and harsh criticisms often seem designed more to hide the deficiencies of the education rather than genuinely prepare us for real-world roles.\n\n  \nEdit: Wow, all the engagement on here been wild to see. Glad to know I'm not the only one feeling the same way at atleast. Someone had just sent me [this](http://trynonotes.com) yesterday from the PT subreddit, to help reduce some of the documentation BS we have to deal with. Haven't tried it out yet but I'll let y'all know how it goes. Hopefully reclaim some of my remaining sanity. ",
    "score": 414,
    "url": "https://reddit.com/r/slp/comments/1k4k6jr/the_longer_ive_been_in_this_profession_the_more/",
    "created_at": "2025-04-21T18:05:59.000Z",
    "num_comments": 145
  },
  {
    "id": "reddit-1l2vtit",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "The preschoolers are doomed!",
    "text": "Over 25 years in schools and the preschoolers coming in have changed drastically. Years ago, 3 year olds mainly just wanted attention and while there were behaviors many were from frustration of not being able to communicate. Years ago, I could get most preschoolers to play with me and engage. Now it is the opposite. Because I don't blink, am not a phone, or make different noises, kids show little to no interest. The 3 year olds want to be left alone, look at toys without playing with them and have very little interest in others. It's very frustrating. We also use to have kids complete tasks, use words to request items, and not let them run away if they didn't want to do something. It's all changed and I don't agree with it. I used to see preschoolers really improve with speech and now I see kids who prefer to look at the smart board/ videos and have difficulty attending and processing language. Sad and I don't see it ever changing!",
    "score": 407,
    "url": "https://reddit.com/r/slp/comments/1l2vtit/the_preschoolers_are_doomed/",
    "created_at": "2025-06-04T03:44:31.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1mk2k74",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "He was 8, had no AAC, and was pulling at his throat in frustration. Now he code-switches, advocates for words at school, and calls it his “talking iPad.”",
    "text": "I just have to share one of the most meaningful AAC experiences I’ve ever had.\n\nI’ve been working with a 9-year-old who speaks mostly English, while his mom speaks mostly Spanish. His speech is extremely hard to understand. When I first met him (he was 8), he didn’t have any other way to communicate besides his voice. One session early on, he got so frustrated trying to tell me something that he literally started pulling at his mouth and throat. I’ll never forget it. He was trying so hard, and it broke my heart — but I could tell he had so much language. He just needed another way to say it.\n\nSo I started AAC trials. I had just found out about AbleNet, which offers free iPad trials with full access to communication apps. It was honestly life-changing for my caseload. I started trialing apps for several kids, but with this one, we landed on something I’d never used before. It described itself as autism-friendly, and he just clicked with it immediately. I tried introducing Proloquo2Go later on, but he panicked and started breathing hard until we went back. That app became his voice, and he made it crystal clear he didn’t want that to change.\n\nAnd now? He uses it with his verbal speech. He speaks in full sentence frames and then fills in nouns or harder-to-say words using AAC. And not just one word — sometimes two or three per sentence.\n\nOne of my favorite examples:\n“[AAC: walrus] is half [AAC: seal] and half [AAC: hippo].”\n\nHe says the sentence, then tags in his talking iPad to drop in all the content words. It’s amazing. Are you kidding? That’s expressive, intentional, independent language. He picked that up from modeling and now he does it on his own. He’s code-switching like a pro.\n\nBut it took time. Like, a lot of time. There were entire sessions where all I did was sit there editing his app while he pointed to things and told me what he wanted added. One time he pointed at a favorite animal and said, “put it on there,” which turned into a whole new folder. We’ve spent hours building categories — animals, animatronics, emotions, game-based phrases, all of it. He was so involved in the process. He built this with me.\n\nAnd then this happened:\nOne day he came into the room, sat down, and said, “Oh my god, I have something.” He ran off to a little closet and came back holding a note card. It had a word written on it — something his teacher had helped him write down at school because he wanted it added to his talking iPad. He saved it just for me. He thought about his AAC, about our sessions, and about building his voice while he was at school. That moment brought me to tears.\n\nAnd this week? I introduced him to his new SLP — an older male clinician he’d never met. As soon as we sat down, unprompted, he said,\n“I gotta get my talking iPad.”\nI hadn’t even brought it up yet. He ran to get it, came back, and immediately started showing off all his pages. He was so excited to share his words. By the end of that 30-minute visit, he was talking in full sentences, code-switching, and using both AAC and verbal speech better than I’ve ever seen him do with me. It was incredible.\n\nHe also now uses his talker to regulate. If he’s frustrated, he grabs it and finds the words. Recently, when I couldn’t understand him, he used a phrase I had programmed months ago during a game — “let’s hide” — while pointing under something. He meant “under.” I never taught that as a target. It was something he had internalized and used in context to get his meaning across. That’s the kind of communication we all dream of helping kids build.\n\nSo I just want to say:\n\n• Don’t underestimate older kids.\n\n• Don’t expect AAC to be quick or easy.\n\n• Don’t limit it to one word at a time.\n\n• Don’t assume “verbal” is always the final goal.\n\n• And please, trust your kids when they show you what works for them.\n\nHe calls it his talking iPad. And honestly, I think I will too from now on. Because that’s exactly what it is — it’s his voice.\n\nVoice doesn’t have to mean verbal.\nAnd success doesn’t always show up fast, but when it does, it’s unforgettable.",
    "score": 399,
    "url": "https://reddit.com/r/slp/comments/1mk2k74/he_was_8_had_no_aac_and_was_pulling_at_his_throat/",
    "created_at": "2025-08-07T15:06:12.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1ovdt55",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "ASHA is out of touch.",
    "text": "Under paid and over worked staff in schools, hospitals and care facilities. No legislative direction. No Union, No vision for the field and this is the lead story in their junk magazine.\nRaise you hand if you think this organization is as worthless as their RagMag.\n\n",
    "score": 374,
    "url": "https://reddit.com/r/slp/comments/1ovdt55/asha_is_out_of_touch/",
    "created_at": "2025-11-12T18:51:11.000Z",
    "num_comments": 108
  },
  {
    "id": "reddit-1lxxiuo",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "A peek into Speech and Language Therapy in Germany",
    "text": "Hey everyone!\n\nThought I’d drop in with a little cultural exchange from Germany—specifically about what it’s like to be a Speech and Language Therapist over here (or as we call it, Logopädin/Logopäde). If you’ve ever wondered how SLP works in other parts of the world, here’s a slice of life from the land of sausage, structure, and slightly absurd paperwork. I am in training to become one myself and been reading on here for quite a while now. Most of the formal work talk like ASHA and school district positions and stuff I don't really get because it is so different in Germany. I thought I might want to share, so you could compare how it sounds for you and if moving abroad would be attractive.\n\nMost SLPs in Germany work in private practices, not in schools. If a child needs therapy, their pediatrician writes a referral, and they go to a local practice usually after school. Same goes for adults, whether it’s post-stroke aphasia, voice issues, or dysphagia after head and neck cancer treatment. The good news is: health insurance usually covers the cost (yay universal healthcare!), although adults often have a small co-pay.\n\nNow, here’s where the fun begins. Since most therapy is funded by public health insurance, the bureaucracy is no joke. If a doctor's referral has the wrong code or date? You might not get paid. So we spend a good chunk of time doing paperwork and making sure everything aligns exactly with what the doctor ordered. And yes, it gets tedious. But it also keeps us very, very organized. 😅 Our reports that we write for the doctors are pretty short and basic and usually only have 3-4 sentences, we have to send one after each referral usually.\n\nSLP education in Germany is a bit different too. You don’t need a Master’s to practice—most therapists go through a 3-year vocational program after high school, though academic degrees (like a Bachelor’s or Master’s) are slowly becoming more common but you don't need it. Once you're licensed, you're good to go. The training covers a broad range: speech, language, voice, fluency, and swallowing disorders, for both children and adults. Most students start working while they are already in training.\n\nOur caseloads are pretty mixed. Pediatric language delays and articulation issues are super common, but adult neuro cases (like aphasia, dysarthria, and apraxia) are also a big part of the job. There’s less focus here on things like accent modification or social communication for ASD, the later one is almost fairly unknown and not covered in the voccational training or degree. If you work with ASD, you'll have to do extra courses after graduation that you have to pay for (Fortbildung). \nVoice disorders are a bit rare but also not completely uncommon, most people don't like treating but I do.\n\nIf you're an SLP from abroad and thinking about working here, it’s doable—but not without its hurdles. You’ll need a pretty solid grasp of German (usually B2 or C1 level), and there’s a formal recognition process for your degree that can take a while. But once you're through it, there’s a super extremely high demand for therapists especially in rural areas. I had 10 interviews in three weeks once I sent out applications. The pay is somewhere between 20-30€/h depending on your skill level, your experience and where you live and in which setting you work. So somewhere between 3.300-4.200€ is realistic before taxes. We have universal healthcare that gets deducted from your pay and pays for all of your health expenses that are critical and needed, there is a national retirement programme and some employers offer a private retirement programme too. Minimum amount of payed annual leave is 20 days, more average is 28-30 days. Most practices pay for your additional further training courses (small ones) which you have to do to keep your licenses, you have to gain a certain amount of points per year, those trainings start at 300€+. \n\nIf you work in a hospital, community service place or kindergarden you'll be on a union contract which is set. \n\nCulturally it might be a bit of a  difference because I know that some anglo-phone therapy approaches like Lidcombe Stuttering programs are super praised based and that is something we are not too familiar with in Germany. Also in the studies that were carried out in Germany with that program, parents reported having a hard time praising their kids so much. In fact I have some kids in therapy where I am 100% sure that I praise them 10 times more then their parents ever would.\n\nSo, that’s the scene! A mix of meaningful work, solid insurance coverage, and enough paperwork to make you fluent in medical German. 😄 Happy to answer any questions if you’re curious about how it compares to your country!\n\nLiebe Grüße from Germany 👋🇩🇪🥨🍻",
    "score": 373,
    "url": "https://reddit.com/r/slp/comments/1lxxiuo/a_peek_into_speech_and_language_therapy_in_germany/",
    "created_at": "2025-07-12T10:47:35.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1mcs0dw",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "SLPs: STOP Accepting Low Paying Jobs — It Hurts ALL of Us!",
    "text": "Hey fellow SLPs (especially new grads),\nwe need to have a serious heart-to-heart. If you’re about to accept a position offering $30... $40... even under $50 an hour — STOP. Please. Think again.\n\nThis isn't just about your paycheck — this is about our entire profession. When we accept low wages, we set the bar lower for everyone. It gives employers permission to undervalue our education, our clinical training, our licensure, and the impact we make. And trust me, THEY ARE WATCHING!\n\nWe hold Master’s degrees. We complete 1,650+ hours of supervised clinical work. We endure national exams, state licenses, continuing ed, and caseloads that stretch us to our limits. So why are we settling for less than what we’re worth? No one should be accepting anything less than $50/hour as a brand new SLP. That’s the minimum baseline for the expertise we bring to the table.\n\nWhen one of us accepts crumbs, it reinforces the idea that that’s all we’re worth. When all of us demand fair compensation, we raise the standard for our profession. Change starts with us. Advocacy starts with us. Respect starts with us.\n\nSo to every new grad: I know it’s tempting to take the first offer. The loans are real, the pressure is high — I’ve been there. But please, don’t undervalue yourself. Ask for more. Negotiate. Walk away from jobs that don’t respect your worth. Because when you fight for yourself, you fight for all of us!",
    "score": 362,
    "url": "https://reddit.com/r/slp/comments/1mcs0dw/slps_stop_accepting_low_paying_jobs_it_hurts_all/",
    "created_at": "2025-07-30T00:14:25.000Z",
    "num_comments": 117
  },
  {
    "id": "reddit-1j810w3",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Tobii Dynavox after deciding to nickel and dime disabled people with Snap Monthly (they just lost my whole school of 60 device users)",
    "text": "Sure Tobii, at LEAST 30% of our families live in poverty, they can definitely afford 120/year for the rest of their child's life. You bloodsucking corpos. \n\nOn the plus side, my school of 60 upcoming device users are now completely transitioned away from TD Snap. That's 3000$ they'll never see, plus all the extras for my eye gaze kids and kids who would have had dedicated TD devices through insurance. I hope it hurts as bad as a parent choosing between medicine or their child's words for the month! \n\nAnyways, unrelated, who else LOVED playing Luigi's Mansion as a kid? :)",
    "score": 352,
    "url": "https://reddit.com/r/slp/comments/1j810w3/tobii_dynavox_after_deciding_to_nickel_and_dime/",
    "created_at": "2025-03-10T15:18:27.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1jlh4dw",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "We need to talk about the amount of \"unlearning\" needed in this field.",
    "text": "After graduating in 2022, the amount of \"unlearning \" I had to do has been unreal. I really can't think of any other field where this is the case (with maybe the exception being teaching? And even then it's more of changing/developing your own teaching style after student teaching). I understand that speech is a learn as you go job But I just feel like so many of us are already prone to imposter syndrome post grad and it is just not a good feeling when you want to grow as a therapist and feel competent but you feel like everything you're doing is somehow wrong because maybe that professor or supervisor you had was teaching you methods from 10+ years ago that are largely either a) rejected or b) not considered best practice or relevant to kids today. And don't even get me started on the constant stream of social media SLPs telling us that what we're doing is wrong and we need \\_\\_\\_\\_ course to help.\n\nSo shoutout to my early career SLPs out there who are probably amazing therapists and giving it all to their kids while also unlearning and re-learing (probably outside of contract hours) the best ways to support their caseloads while also navigating the hellscape that is the current educational climate and sped politics. Also shoutout to my younger therapists who get looked down upon by older therapists who think we are incompetent because maybe our therapy styles don't look the same.\n\nI don't even know if this will make sense to anyone but wanted to post this in case anyone is feeling the same and needed the validation. ",
    "score": 331,
    "url": "https://reddit.com/r/slp/comments/1jlh4dw/we_need_to_talk_about_the_amount_of_unlearning/",
    "created_at": "2025-03-27T23:29:18.000Z",
    "num_comments": 116
  },
  {
    "id": "reddit-1mcqxnv",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Finally feeling what people mean when they say we have a lack of upward mobility",
    "text": "As a first generation college student, the idea of making what my parents made combined in my first year out of school sounded amazing. And honestly, it is. But I did feel a sting when my friend \"John\" told me about how his lawyer job is going. We graduated around the same time, making about the same salary fresh out of school. Like me, he was also working late nights to get work done with occasional weekend work. While I did try to set boundaries at work, having a workaholic boss only made that so possible. Unlike me, John actually gets recognition and pay raises for his hard work. He went from a salary of $55k to $95k in just two years. \n\nIt frustrates me that pink collar jobs are not valued in the way that male dominated professions are. We get thanked through cookies and pizza, and there's always an army of people ready to call us \"negative\" for complaining. I don't understand why people can't accept that two things can be true at once, I can like what I do and the impact I make, while wishing society respected and valued us more than they currently do. \n\nNo one tells John to remember his \"why\", he doesn't need an appreciation week, he doesn't have to carefully word a complaint to avoid rocking the boat. Obviously he has complaints of his own, but his paycheck is not one of them. \n",
    "score": 290,
    "url": "https://reddit.com/r/slp/comments/1mcqxnv/finally_feeling_what_people_mean_when_they_say_we/",
    "created_at": "2025-07-29T23:25:32.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1jw3gr4",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Times have changed",
    "text": "It makes me sad to read so many posts from SLPs who are miserable in their professional life because unfortunately that carries over to our personal lives. The knowledge that we spent tens of thousands of dollars and 6 years of our lives on something that brings misery with little hope for a brighter future, is truly soul crushing. I want all of you to know that it’s not a problem with you, it’s a pervasive issue with our field. \n\nThe children and the nature of the job have changed. When I first started my career in 1995, I had a mixture of language impaired students, artic and maybe 2 fluency students each year. Occasionally I would get a student with a communication device or cochlear implant, but nothing too difficult to handle. I did not have single child with autism on my caseload for the first five years. I was able to do thematic units and had interesting, lively conversations, even with my kindergarten children. The self contained children I saw were more like a resource child today. Therapy was fun, behavioral issues were rare, and I didn’t feel like I had to put on a performance to keep their attention. I truly enjoyed the first 5 or so years. I left the schools in 2009 and began working in EI. In 2018 my friend had a school contract and asked me to help her 2 days a week so being a good friend I consented. Things had changed so much in the 9 years since I had left the schools. It was no longer about providing therapy, it was simply managing behaviors.  Even though I only worked there 2 days per week I was exhausted by the end of each day. At the end of that school year I told my friend that I loved her dearly but I just couldn’t do the schools anymore. My schooling from the early 90s had not prepared me for the reality that school based clinician deal with daily. Even in EI, a job that I absolutely loved for the first 10 years, has changed dramatically since Covid. \n\nMy coworkers daughter is currently in graduate school to be one an SLP and one of her instructors told the class that there has not been a significant increase in the number of children with autism over the past 25 years. I don’t know if the instructor was just lying so as to not scare her class or just poorly informed, but nonetheless, she lied. I think herein lies part of the problem. So many instructors in undergrad and graduate programs never worked in a clinical setting. They have been in academia their entire career. The ones who did work clinically for a time haven’t done so in a very long time, so they don’t understand what our new reality looks like.  They can’t prepare students for the real world because they are out of touch with the real world. From our undergraduate programs to ASHAs propaganda, gaslighting is the name of the game. We need honesty and full disclosure at the undergraduate level regarding lack of salary growth, lack of professional advancement, unreasonable employer expectations, etc., so students can make an informed decision before wasting so much time and money on graduate school. \n\n",
    "score": 288,
    "url": "https://reddit.com/r/slp/comments/1jw3gr4/times_have_changed/",
    "created_at": "2025-04-10T17:24:45.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1n0ynmb",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "An open letter to everyone who has said \"there will always be a need\"",
    "text": "I don't say this to shame anyone, rather, to call the community in to reflect on what we have been lucky enough to have never experienced. \n\nSo many of y'all have ignored the warning cries from disabled HCPs for years now and we are starting to see the collective consequences of this. \n\nWhen I made posts months, even years ago, many hand waved my concerns as \"fear mongering\", citing that there will always been a need for our services. Yes, there truly always will be a need. But needs do not always get met. \n\nI want to be vulnerable about where I am right now and maybe it can help y'all to understand where our clients are. I have a complex, rare condition that is incredibly expensive. It's not just the hundreds of dollars in medications, it's all of the tools and supplements that insurance doesn't cover. I'm getting to a point where I'm starting to have to pick and choose what I take care of and what gets put off. \n\nTherapy, of any kind, is easily one of the costs that adds up the fastest. The co-pays aren't just once every few months, they're usually once a week or bi-weekly. \n\nI'm getting to a point where everything is so expensive that I am going without. I cut my own hair, my hobbies are cheap, I shop at thrift stores, and I only go out with friends to do something fun maybe once or twice a month. I'm starting to eat less to save on food bills. I've been prioritizing protein to feel less hungry and keep my blood sugar up throughout the day. It horrifies me that this is where I am, and I make above the national average for a salary. \n\nSo yes, if it came between food, medicine, and therapy, therapy services would be the first to get dropped. So to everyone asking \"why are we having low census? Where did everyone go?\" They didn't go anywhere, they're going without. \n\nSo what does that look like? It looks like children having a lateral lisp due to tooth decay. It looks like your students begging for a snack because they want to save it in case they don't have dinner that night. And soon, if we don't fight back, our clients are either going to continue to decline, and some may die. This is where we are guys. ",
    "score": 269,
    "url": "https://reddit.com/r/slp/comments/1n0ynmb/an_open_letter_to_everyone_who_has_said_there/",
    "created_at": "2025-08-26T21:35:39.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1ppg71o",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Glorified Profession",
    "text": "Was thinking about this recently, does anyone else feel like grad school and social media glorifies the slp profession? I feel like back in grad school, professors would act as if we would change lives completely and disregard the burn out in the field. Or even the amount of paperwork to do. Even salary was never spoken about. I feel like sometimes we were believed to be mislead into the field due to the lack of SLPs. Any thoughts? ",
    "score": 228,
    "url": "https://reddit.com/r/slp/comments/1ppg71o/glorified_profession/",
    "created_at": "2025-12-18T03:06:23.000Z",
    "num_comments": 81
  },
  {
    "id": "reddit-1k6hvjo",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "This might encourage you",
    "text": "Many SLPs feel imposter syndrome at some point in their career, I think this is due to a variety of reasons: our massive scope, competitiveness of graduate school, assumptions made by other professionals or the public regarding what we do, subjectivity of certain disorders and therapy data, etc. \n\nThe other day I was listening to a podcast hosted by a doctor who interviews other medical professionals and/or researchers. They were discussing the prevalence of misinformation and content nowadays making huge click baity claims based on misinterpretation or limited data from scientific studies. For example, short form content saying \"NEVER eat eggs because they contain cholesterol!!\" Without offering any nuance. \n\nThey continued to discuss signs of whether someone is an actual expert or not, and they both agreed that experts will often sound UNSURE of themselves because they know how much nuance goes into any medical decision or claim. They don't have a short simple answer because they recognize many issues are not black and white. For example, eggs are bad compared to what? For who? In what quantity? Etc. \n\nI really resonated with this as I often feel like I sound unsure when sharing information on communication disorders. For example, when a parent says a student often can't find a word... my brain is spinning! That could be a sign of slow processing speed, language issue, fluency issue, articulation issue, combination of issues; I have so many questions and thoughts because it's so nuanced! Theres not one answer to why they strugggle to find a word, and what do you mean by find a word??thinking of it? Producing it? \nAdditionally, the correct treatment method also requires lots of nuance-- what works for one may not work for another because of all the variables. I used to see my hesitation or uncertainty as weakness. Now I know the hesitancy comes from a large amount of knowledge and experience which directs me to not jump to conclusions before getting the full background and symptoms. And I think that's better than having a quick and simple answer for everything. Hopefully this encourages you if you've ever doubted yourself! ",
    "score": 221,
    "url": "https://reddit.com/r/slp/comments/1k6hvjo/this_might_encourage_you/",
    "created_at": "2025-04-24T02:53:55.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1mel0lc",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "You are walking around here like you are someone important",
    "text": "I’m a SNF SLP and I had a nurse say this to me the other day because I was walking quickly in the hallway and looking for patient charts (not interrupting her job in any way )\n\nUnrelated but I spoke with a family friend recently who told me she was always so proud of me for getting good grades and being a high achiever. She really thought I was going to do something big with my career. \n\nI take some solace knowing that I make more money than both of these people, but I just wonder why SLPs have such little respect. \n\nPersonally these interactions didn’t make me feel any strong emotions so definitely not looking for a cheer up here just it’s so strange to me how similar professions are so much more respected. ",
    "score": 210,
    "url": "https://reddit.com/r/slp/comments/1mel0lc/you_are_walking_around_here_like_you_are_someone/",
    "created_at": "2025-08-01T02:42:11.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1kaotc5",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Please god, let's end 1099 jobs",
    "text": "Or at the very least, can we please end them being the ones that dominate the job market? I am so tired of going on Indeed/LinkedIn and seeing fee for service jobs being the main ones. I'm 27, I want benefits, I want insurance, I want PTO. It would be nice to have a prep period, or heck, LUNCH time. I'd love to not have to hustle to see 9-10 kids back to back daily 5 days a week. It's nice being 1099 now as a single woman with no kids who has the luxury of being at home. In fact, I'm home right now on a day I probably wouldn't be entitled to if I worked direct hire since I have taken a lot of unpaid days off for mental health reasons. One of my coworkers (who is an OT but also 1099 for a diff agency) raves about being 1099 because she can take off whenever, it's flexible for when her kids are sick, but she also is married and probably gets health insurance through her husband. \n\nGone are the days where getting hired as a therapist for a school district was based on your own merits. Most of the people I know who were lucky enough to land a direct hire job either had some sort of personal/familial connection to staff already or they were just insanely lucky. \n\n1099s are just a predatory tactic to get new grads/younger therapists trapped into a system that looks good (hey, it's nice to not have taxes taken out of a monthly paycheck!) but when you dig deeper, you realize how truly fucked you are for the future. At the risk of sounding dramatic, this whole thing is making me want to just jump ship and find a new career. Maybe then I wouldn't need to take all these unpaid days off because I am so burnt out and my mental health is in the pits. ",
    "score": 209,
    "url": "https://reddit.com/r/slp/comments/1kaotc5/please_god_lets_end_1099_jobs/",
    "created_at": "2025-04-29T14:07:02.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1n5bn0j",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "We are generalists",
    "text": "I have been thinking about the field of Speech Language Therapy a lot lately.   I have come to a conclusion, maybe others also have.   We are generalists at least most of us are.   In our field, I am like the primary care physician or the family doctor.   I know just enough about our vast scope of practice, but do not know enough of it in depth.    We do not expect our primary care physician to be all knowing about all aspects of the body.  Why are there expectations from others in places of power that a SLP is the specialist in all things communication?   This field has broken my heart.   I try not to care.   \nI wish the field would be more honest about how the majority of us are just generalists.   I am a little emotional about this.   I am still in recovery from years of burnout and disappointment.  I no longer want to blame myself.  I have done that enough.   Please as kind as you can.   This career is all I have.  There is not second income to prop me up while I recover from the burnout and disappointment.   Thank you for listening.   ",
    "score": 204,
    "url": "https://reddit.com/r/slp/comments/1n5bn0j/we_are_generalists/",
    "created_at": "2025-09-01T01:21:35.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1psbnnh",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Why being a newer SLP feels like drowning:",
    "text": "Back in 1980, becoming a speech-language pathologist was expensive, but federal grants were more generous, tuition was lower, and wages were closer to the cost of living. ASHA had just launched its first Continuing Education program, which added some costs but was still manageable.\n\nToday, tuition, CE requirements, and the cost of living have skyrocketed, while early-career clinicians often earn just enough to barely cover expenses. Many are living paycheck to paycheck, and single parents supporting children and teens are especially hard hit—they’re not just struggling; they’re drowning, all while doing the work they trained for: helping people.\n\nWe became SLPs to help children, teens, and adults communicate, often at our own financial or emotional expense, yet very few are treated like public servants. Meanwhile, older clinicians often enjoy financial stability, lower debt, and higher pay—a stark generational divide created by decades of rising costs, stagnant wages, and a system where profits often benefit administration rather than frontline clinicians.\n\nBecause of this, I propose that we think carefully about taking on students in workplaces that are likely to exploit them or fail to support their growth. We have a responsibility to train the next generation ethically and sustainably, not to perpetuate systems that leave new clinicians drowning",
    "score": 186,
    "url": "https://reddit.com/r/slp/comments/1psbnnh/why_being_a_newer_slp_feels_like_drowning/",
    "created_at": "2025-12-21T17:17:41.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1khsf94",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "I miss who I was before this field.",
    "text": "I feel like this field has made me jaded to society. I honestly miss being a student and I miss how naive I was before I started working in this field. Seeing how people/society/people who supposedly want to \"help\" disabled kids treat disabled kids is disheartening. The lack of adequate training on how to deal with behaviors gives me immense amounts of stress. I ruminate all the time about situations, mistakes, what I could/should have done differently. If I had known half of the things we would deal with on a daily basis, I don't think I would have chosen this career at all. ",
    "score": 181,
    "url": "https://reddit.com/r/slp/comments/1khsf94/i_miss_who_i_was_before_this_field/",
    "created_at": "2025-05-08T15:07:18.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1mdrra6",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "The Price of Negotiation",
    "text": "Hi everyone. Just wanted to share my story, lessons learned, and frustration with the lack of respect for our profession. \n\nAn SLP position at a university research school opened in my area. A few people reached out to me about applying. My initial reaction was no- I’m happy where I am and I’m concerned about pay. But then I changed my mind as the school has a strong reputation and my 3.5 year old and 10 month old could attend in the future if I’m an employee and bypass the lottery system to gain admission. I was hopeful that the pay was negotiable and better than what I heard 8 years ago or so. The pay was not listed on the application site. It said “commensurate with experience.”\n\nThe applicant pool and interview process was competitive. First round, I was interviewed by a panel of 3 and scored on a rubric. I was told 1 or 2 people would make it to the second round of interviews with admin. I was overjoyed to hear that I made it to the second round. I had no idea if it was just me, or me and one other. \n\nI had my second interview and was informed afterwards that I would be getting a job offer- so exciting! I received the job offer the next morning and the pay was much, much lower than what I could have imagined. Yes, the benefits were amazing, but the salary was close to what I made as a CF 15 years PRIOR in my state (under 50K). I should have asked about the salary range early on, and that’s on me. But I was unclear who was making the offer- the school or the university. Anyways, I knew I needed to attempt to negotiate my salary.\n\nI asked the school director who I would make contract negotiations with. The director said themselves, so I proceeded to send a respectful letter detailing my experience, trainings, and credentials that warranted an increased offer. I specified a salary and communicated that I was open to negotiating that number (number was consistent with employment standards when negotiating). I also inquired about stipends for licensure and CEUs as that was not listed in the contract. All communications were via email. I was soooooo nervous about asking for “more.”(AKA a well deserved compensation 😑)\n\nI got a response about 5 hours later stating the director could not meet my request, and the offer was being RESCINDED. I was shocked- I was not even given the opportunity to negotiate lower or take the original offer. I expressed confusion, as I was under the impression I would have the opportunity to negotiate given I inquired about who I would negotiate with. I asked where the breakdown was. The response said: “We base our salary scale on years of experience in K-12. The distance between our numbers is too big to get close to what you need. I have other candidates with more experience in a public school setting. I feel like that will be a better fit for us.”\n\nFrom the first interview, the “SLP Search Committee” recommended me. At no point did the director express concern that I didn’t have enough experience in a public school setting. It felt like she double downed and had ZERO respect for me.\n\nMy initial internal response is bananas 🍌 tbh. I QUESTIONED MYSELF.  “Did I ask for too much?” “Did I fail my kids?”. That’s a product of how SLPs are treated- none of us should feel like we don’t deserve that, let alone basic human decency. \n\nI’ve had time to process. I’m proud of myself for standing up for what I deserve. What we, as SLPs, deserve. \n\nTLDR: My incredibly low job offer was rescinded at my first attempt to negotiate. I spiraled and questioned my requests before realizing my value. Sending love to anyone at any point in this SLP field- our knowledge and skills are worthy of more.\n\nEDIT/UPDATE: Edit=Typos + TDLR ~~&gt; TLDR 🫣\n\nUpdate= I wish I could say I am this strong person that can get immediately past this all. But to feel so proud of yourself of achieving what appeared to be a competitive job offer, to then getting low-balled and further devalued was a gut-punch. I have struggled with feelings of deception, eroded self-esteem, and loss of motivation. Time will heal this, but you all have made it faster with your comments, words of encouragement, and shared experiences. I am so thankful for you all 💜🩷🩵\n\nUniversity pay scales are public record. The person who\nmade me feel less-than by asking for more than $49,000 after 15 years experience made $132,000+ as principal before becoming director. It makes me sick and I will not be silent. This is for all SLPs 🫶🏻👊🏻",
    "score": 175,
    "url": "https://reddit.com/r/slp/comments/1mdrra6/the_price_of_negotiation/",
    "created_at": "2025-07-31T04:06:30.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1p8ya0i",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "So much at risk employment in this field",
    "text": "Some of the things I wish other SLPs would have disclosed to me before starting this journey.\n\n\\- Ability to drive and own your own vehicle is a must. This isn't like floor nursing or teaching where you show up to the same building for the length of your career.  This is a highly mobile services based career and the U.S. largly depends on personal vehicle travel, not public transportation for most metro areas.  Not everyone can or should be on the road and we shouldn't be encouraging it for people who aren't skilled in driving or are uncomfortable with it.  Nevermind the cost of owning and maintaing a vehicle vs your actual net salary as an SLP. That's another discussion. \n\n\\-High risk of physical violence in peds. This is due to the nature of the children's disabilties. You need to learn to be skilled in preventing personal risk of injury and that will come with time. Grad schools don't teach it. \n\n\\- Choose your hard. So many different settings but so few full time hours with comprehensive benefits. If single, not married or head of household, you might be in a difficult place especially considering the healthcare and affordable housing crisis in this country. \n\n\\- People who don't want to work schools often promote teletherapy as an alternative but those are mostly school jobs too. If you think in person instruction is difficult, teletherapy can be even harder because you have no control over setting or the students. Also-no union. As a contract therapist you could lose your teletherapy job at any point.  Those contract companies have no investment in keeping their SLPs.  Also-be prepared to shell out a good chuck of your net pay towards high deductible health insurance. \n\n\\-Like everything else, it's a crapshoot.  So many bad jobs out there that the good ones are rarely available because they're keepers.  It's a therapy job. We have all the same problems that social work and counselors have. What makes it worse is the lack of union protected jobs with benefits that at the very least provide stability and protection to the therapist. These environments are all dysfunctional, so definitely make sure you have your own rights protected before walking into a landmine situation. Places who don't do their job properly will always look for a way to dodge responsibility.  Ethics are never first for these settings, so you need to be prepared for that and act accordingly even if it means considering resignation. ",
    "score": 163,
    "url": "https://reddit.com/r/slp/comments/1p8ya0i/so_much_at_risk_employment_in_this_field/",
    "created_at": "2025-11-28T15:54:39.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1p5ukce",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "ASHA's Capitol Hill Day",
    "text": "I know that ASHA gets a lot of flak for their advocacy (or lack thereof), and I figured I'd share my experience with Capitol Hill Day last week. I'm not supporting ASHA, I'm not criticizing ASHA, and I'm not saying whether this was *enough* advocacy (or a good use of their funds). Also, I'm not an ASHA employee, I'm an SLP faculty that started off as a school-based SLP.\n\nThis year's Capitol Hill Day was last Tuesday, right before the convention started. I think the overlap with the convention made it easier for most of us to attend, because this was their largest Hill Day by a huge margin. There were about 300 ASHA members attending, and about 300 meetings scheduled with legislator's offices. (I think 40-50 meetings were planned with actual legislators, and the remainder with legislative aides. It was a busy day on the Hill, so I'm not sure if many legislators backed out at the last minute and sent their aides.) ASHA scheduled all of these meetings for us, and ensured that there were no scheduling conflicts, double-bookings, etc. Personally, I was involved in 5 meetings: Legislative teams for both of my state's senators, my house representative, and two other house reps for other SLPs that were part of my \"team\" for the day. ASHA scheduled all of these meetings for us, and sent information to the legislative teams in preparation for the meetings. They even had an app for us to download to stay organized.\n\nI was impressed with the ASHA advocacy team's preparation. They provided *literally* hundreds of pages of information that we could use to prepare, including a 7-page \"cheat-sheet\" providing information about 18 issues relevant to our professions, which also named the relevant House and Senate bills so that we could ask legislators to for their support on specific efforts. They also prepared fact sheets on every single representative &amp; senator that people would meet with--which was hundreds--which included information about relevant committees that they serve on, personal connections between legislators and the field of CSD, bills that they've sponsored or co-sponsored... everything that we needed to meet with these legislative teams. I could tell at a glance that one of the reps served on an Education committee, and another was part of an Autism caucus. \n\nASHA also hosted webinars, Zoom \"office hours,\" and an in-person session on the morning of Hill Day. There were multiple lobbyists, advocacy experts, and subject matter experts (e.g., an expert on education, IDEA, and relevant legislation). I follow politics obsessively, but even then, their support was the only reason I felt confident enough to meet with legislators, and their cheat-sheet was helpful when speaking with the legislative teams. I had shown up that day ready to focus on IDEA funding, but when I was talking with Republican teams and realized that funding education was a non-starter, I was able to pivot and talk about telehealth and the interstate compact--issues that might *actually* be able to garner bipartisan support and make our field a bit better.\n\nThe event itself seemed pretty organized. There were shuttles running between the Hill and the convention center, and I appreciated that. ASHA has a field office just 5-10 minutes from the Hill, and I stopped by for some free snacks. It wasn't large or extravagant, but I could see how helpful it would be for advocacy teams to have a \"base of operations\" near the Hill. I definitely got the impression that the advocacy team is working year-round, not just this one day per year.\n\nI know that critics of ASHA say that they aren't doing enough to advocate for us. Following this event, my main takeaways are:\n\n* The government is partisan. It doesn't matter how much ASHA advocates for us if anyone with an (R) next to their name refuses to discuss funding IDEA, Medicaid, Medicare, etc. I've been underpaid my whole career, first as a school SLP and now as a faculty, but there's only so much that ASHA can do when salaries are set by local school districts, and bazillionaires are lobbying against anything resembling funding for the common man.\n\n* ASHA does a *lot* of advocacy. Don't think that Capitol Hill Day is an excuse for ASHA to offload their responsibility to advocate, because they poured a lot of money and effort into this, and realistically legislators *are* more receptive and responsive to their constituents than a political lobbyist. Based on my experiences, both on Capitol Hill Day and previous experience volunteering with my state SLP association, I just don't think people realize that ASHA is actually trying.\n\n* If we want better, we need to *do* better. We need to elect better politicians. And whether we vote for our representatives or not, we need to let them know what we think. Maybe we can make a difference. Maybe not, because maybe they are beholden to billionaires instead of constituents. But either way, I'm going to go down swinging. I hope to see some of you at the next Capitol Hill Day. Or volunteering with a state association.\n\nI know I'm risking getting downvoted to hell by saying nice things about ASHA, but I'm happy to answer any questions. Did anyone else participate? What were your experiences?",
    "score": 161,
    "url": "https://reddit.com/r/slp/comments/1p5ukce/ashas_capitol_hill_day/",
    "created_at": "2025-11-24T21:59:46.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1lc4bmn",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "No more cf jobs",
    "text": "I don’t want to rant too much bc I’m exhausted over this and worrying myself sick. I’m not sure what to do at this point. I moved to Colorado to start my career in a private practice for adults that had me going to SNF/ALF/ILF buildings on our campus. Since hearing about Medicare part b billing rule, I was laid off within the day. No hate toward my company, bc it’s small and now they also need a fully licensed SLP to take over the caseload since I was the only full time SLP. It sucks for everyone, but at the end of the day business can still run and I’m left with no job. I’ve been looking for new jobs and I cannot find a single job taking CFs anymore. I can’t believe how much schooling I did and money spent towards it only to feel like my degree is now useless. Every job I applied for has since changed their listing to require an SLP with their C’s. What can I do now?? I’m starting to panic considering I just moved and have no money! Am I really going to have to leave this field after only working in it for 3 weeks? Any advice is appreciated or if anyone knows anyone around Denver/Boulder hiring please let me know!!! ",
    "score": 161,
    "url": "https://reddit.com/r/slp/comments/1lc4bmn/no_more_cf_jobs/",
    "created_at": "2025-06-15T16:24:14.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1o9eman",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "I love my job!",
    "text": "Going against the trend here to say that I love my job! I work birth to 3 home health for a nonprofit clinic. Every day is a little different. I’m exposed to so many different cultures and I really get to connect with children and their families. I get to play, every single day. I get to empower parents to take an active role in supporting their child’s development. I see meaningful progress in my kids. And my work-life balance is pretty unbeatable, between frequent scheduled breaks and ending my day at 4:00. \n\nOf course some days are difficult. I’m still a fairly new SLP (only a year and a half in) so imposter syndrome shows up often. But then I get sessions like the one I had earlier this week, where I was able to support my client with ASD in having meaningful moments of connection with his peers. It was a session filled with joy and lots of laughs. I love that I get to focus on functional communication goals. \n\nI’m learning so much about this field, breaking into specialty areas like feeding therapy, and I get to collaborate with OTs and special educators daily. There are definitely parts of my job I would improve (my salary being one of them LOL) but overall, I’m very happy with where I’m at. I’m really grateful that this is the job I get to work and the career I chose to pursue. ",
    "score": 160,
    "url": "https://reddit.com/r/slp/comments/1o9eman/i_love_my_job/",
    "created_at": "2025-10-17T22:03:12.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1kz5jfe",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "My thoughts on fix SLPs recent podcast",
    "text": "Not sure where else to chat about this so I'm putting it here. Fix SLP's latest podcast was about the lack of proper mentorship and guidance new SLPs get. I usually love their podcasts but I felt disappointed in this one. Instead of getting into the root of systemic issues at play, it felt like a long ad for the mentorship collaborative. This mentorship collaborative seeks to profit off of the fact that many CFs are not getting the mentorship they need at work and are left on their own to figure it out for themselves. I can see charging mentors for learning to be better mentors as they are already established in their careers. But a new grad is a vulnerable person, who may be strattled with debt and doesn't need any additional costs to get off the ground. New grads shouldn't be expected to pay for their own training. Another factor is mentors from outside their own community may not know or understand any local factors (culture, history, etc) at play that influence care. ",
    "score": 150,
    "url": "https://reddit.com/r/slp/comments/1kz5jfe/my_thoughts_on_fix_slps_recent_podcast/",
    "created_at": "2025-05-30T14:24:33.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1mvwdh7",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Unpopular take on this sub: grad school was worth the debt",
    "text": "To preface…each person’s experience is their own and is valid in its own right. This is my personal journey. \n\nI graduated undergrad with a very broad degree, didn’t know exactly what I wanted to do. I worked in a school as a para. Enjoyed the work but the pay was low and little opportunity to move up as a career. I met the SLP at the school and learned about the field of speech therapy. I live in the Midwest and there is a huge shortage of SLPs where I live. That was a big plus. Applied for grad school and was accepted.\n\nDuring grad school I worked as a home health aide for seniors. It was a great learning experience. The pay was low and it was hard work. \n\nI’ve worked in various SNFs since I graduated 6 years ago. I genuinely enjoy working with the SNF population. For me personally, the positives really outweigh the negatives. \n\nAll this to say—grad school and a Master’s degree really opened the door to make more money and have a flexible, rewarding career. I make enough money where paying back my student loans is very manageable. (I’ve also researched the best way to go about paying them). I have first-hand experience working jobs with lower pay and minimal upward mobility. \n\nEach person has their own circumstances. There are many individual factors. Just wanted to share my own experience with grad school being worth the debt. ",
    "score": 146,
    "url": "https://reddit.com/r/slp/comments/1mvwdh7/unpopular_take_on_this_sub_grad_school_was_worth/",
    "created_at": "2025-08-21T00:33:47.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1jvilxo",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Related service vs teachers",
    "text": "Second post of the day sorry. \n\nToday my SPED teacher and I were discussing salaries. \n\nThey said they think teachers and related service should be on different pay scales. \n \nI said I agree. \n\nThey said they’re working on it with our union. \n\nI said wow yay. \n\nThen they said it’s because teachers work so much harder, deserve to be paid way more, and are much more important than related service providers. \n\nI said wait oh no. \n\n🙃🙃🙃",
    "score": 140,
    "url": "https://reddit.com/r/slp/comments/1jvilxo/related_service_vs_teachers/",
    "created_at": "2025-04-09T22:25:16.000Z",
    "num_comments": 53
  },
  {
    "id": "reddit-1lwttzg",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Parent wants me to babysit but expects language therapy, ethically weird?",
    "text": "Looking for advice from fellow SLPs. All through grad school, I babysat for families in one neighborhood for $20/hr. Sometimes they would ask me random speech/language related questions but I never felt like a boundary was crossed. I was also just a student so it was honestly good practice at times learning how to communicate with parents and informally practicing play based strategies with their little ones. After graduating last year and starting my CF, I let them know I wouldn’t be babysitting regularly anymore. The families were ofc super understanding and wished me the best of luck in my career (one even gave me a $500 graduation gift). Since they had always been so good to me, I let them know if they ever really were in a bind on a weekend, they could always reach out in a last min emergency, \n\nOne family (with a 2 YO girl who I only ever watched 2x) recently asked me to babysit on Saturday. I had no plans so I agreed to help out more so as a favor with no expectation to ask for higher then $20/hr. While there, the mom repeatedly asked me about her daughter’s speech/language, told me to “do my thing to stimulate her language,”. She even asked if I could come 1–2 Saturdays a month to “play and help develop her language.”\n\nTo me, this crosses a line. Babysitting ≠ therapy. I ended up asking for $25 an hour that day due to this situation, which she had no problem with. I then explained kindly that while I’m happy to help when I can, my rate would be higher ($35/hr) to reflect the skill set I bring as an SLP, which she obvi acknowledged and is trying to capitalize on “informally”. I made it very clear this rate is no where near that of a therapy charge and I would NOT be formally providing therapeutic intervention. She sent me a novel explaining how that rate is extremely above the market price for an “experienced babysitter with 25+ years of experience. I politely said I understand if that is above what she is comfortable paying and wished her well. Months later she asked me to babysit and said she would pay me $35 an hour with the expectation I would be “explicitly working on language” while I’m there. \n\nI honestly feel like this is ethically a messy situation but am curious if others have experienced anything like this, and how you navigate this blurry area between “babysitting” and informal therapy? ",
    "score": 140,
    "url": "https://reddit.com/r/slp/comments/1lwttzg/parent_wants_me_to_babysit_but_expects_language/",
    "created_at": "2025-07-11T01:12:41.000Z",
    "num_comments": 61
  },
  {
    "id": "reddit-1lvn1de",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Don’t listen to the negativity! You will find your dream job!",
    "text": "This is just a reminder that our job is a good job! We just can’t settle and have to keep pushing to get the best position. I was billable, worked my butt off to build my caseload, got somewhat decent paychecks, then out of no where lost all my patients because my PP made insurance changes. I was in another PP where it was churn and burn, seeing 10-18 patients a day and killing my car (did home health on the side with PP). So disappointed and thought being an SLP was a mistake even though I love what we do. Finally, I found my perfect job. Only 8 patients a day are allowed in order to maximize the hour with your pt, amazing benefits (retirement, sick days, PTO), healthy environment where I can continue to grow and learn as an SLP, and salary! Keep looking, keep pushing, and never settle fellow SLP’s! Great jobs are out there!",
    "score": 139,
    "url": "https://reddit.com/r/slp/comments/1lvn1de/dont_listen_to_the_negativity_you_will_find_your/",
    "created_at": "2025-07-09T16:20:19.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1ku9aov",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "My boyfriend seems to think I can make 200 - 300,000 dollars in this field.",
    "text": "Y’all I mean is this even possible? I make $100,000 with three jobs … and I’m stressed af, thinking about going back to my nice old $80,000 salary for peace of mind. If this is possible it’s definitely something I wanna strive for. But I don’t want to be a slave to money and get burnt out!!! \n\nFor reference my boyfriend is in medical school… so he’s gonna make a lot of money lollllll\nHe knows that I have a lot of plans and dreams to attain on my own ",
    "score": 137,
    "url": "https://reddit.com/r/slp/comments/1ku9aov/my_boyfriend_seems_to_think_i_can_make_200_300000/",
    "created_at": "2025-05-24T11:21:03.000Z",
    "num_comments": 177
  },
  {
    "id": "reddit-1nc57sf",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Tired of working with special ed.",
    "text": "Im tired of the biting the scratching going home with bruises....... it makes me resent them. This whole career is just a sham. Sincerely a frustrated slp. ",
    "score": 130,
    "url": "https://reddit.com/r/slp/comments/1nc57sf/tired_of_working_with_special_ed/",
    "created_at": "2025-09-09T00:53:16.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1kk2hq3",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "What is your SLP hot take?",
    "text": "Just thought it would be fun to hear if y’all have some unpopular (or any kind of) opinions or funny quips about our career. \n\nA few of mine:\n\n1. The Telepathy Taps opened my world to being able to spell to communicate. (Not facilitated communication or S2C, but just the idea of spelling on an AAC device that opens to world of communication more than AAC for people who are able to do this)\n\n2. I hate that most of our jobs are contract. \n\n3. We aren’t taught about behavior management enough\n\n4. SLPA’s are barely equipped to do their jobs with the training we get unless you have a supervisor who actually cares (which is rare). (Also I’m a SLPA I’m not throwing shade just speaking from experience.)\n\n5. I wish we got payed to do notes and plan. ",
    "score": 122,
    "url": "https://reddit.com/r/slp/comments/1kk2hq3/what_is_your_slp_hot_take/",
    "created_at": "2025-05-11T14:37:28.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1n3quue",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "I'm just not passionate about this career 🤷‍♀️",
    "text": "I had a career that I was passionate about, but I had to walk away due to physical limitations.\n\nI like being a speech therapist in schools and working with elementary kids, but I admit I have absolutely no motivation to learn new things and I am very skeptical about a lot of theories that are out there. This is my fourth year and I admit I think this field is wrought with pseudoscience (I realize that this will earn me a bunch of downvotes) and every day, I swear, I feel more and more the impostor when I am trying to pretend to be interested in theory-based conversations with my peers.\n\nMy survival mode is switched on with the number of referrals I'm getting and just trying to keep up with my caseload, meetings, and the \"usual\" stuff we have to do. It's pretty obvious that something is wrong when my less experienced assistant knows more than me and is more motivated and passionate than I am.\n\nI miss my old career where I felt like I could actually make an objective difference, using actual science and medicine. It was in the medical field, and I worked with adults and it was fairly one on one. \n\nSo I guess I'm wondering if I'm like a fish out of water and if I should just work in the medical field as an SLP? I don't think I could go back to working in a SNF, as I had my fill of that previously in my medical career. I also don't enjoy being held to a high productivity standard. Also, I get paid about $30 per hour more than I would get paid as a medical SLP.\n\nI think if I could work with swallowing patients and brain science, I would probably light up a little bit more. I realize that there is more liability, and that is scary. Working with kids in the school is pretty chill in terms of expectations, and I absolutely recognize and appreciate that blessing.\n\nMaybe I need to move to a middle school setting? I don't think I can continue on this way for much longer. So. Many. Evaluations.\n\nTL; DR… I'm just feeling quite lost and wondering if working in the elementary setting is just not for me. Does anyone have any other suggestions that would involve a little bit more objective science, less evaluations, and less stress?\n\n\n\n\n\n",
    "score": 111,
    "url": "https://reddit.com/r/slp/comments/1n3quue/im_just_not_passionate_about_this_career/",
    "created_at": "2025-08-30T02:57:47.000Z",
    "num_comments": 126
  },
  {
    "id": "reddit-1kozxpy",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "I’m exhausted. Let’s vent",
    "text": "I’m getting pretty burnt out. Not just with difficult parents, but with being injured just trying to do my job. I’ve been bit VERY hard by a kid (pics attached- day of vs day after). When I switched to in home care I got attacked my a dog and a year and a half later I still have problems with my knee (pitbull bit both of my knees). Those pics are very graphic so obviously not going to attach. \n\nAnyone else experience stuff like this? Feel free to vent here. At this point I don’t feel safe doing my job and I struggle to think of a setting that could actually be safe. Seriously considering a career change. ",
    "score": 107,
    "url": "https://reddit.com/r/slp/comments/1kozxpy/im_exhausted_lets_vent/",
    "created_at": "2025-05-17T18:36:07.000Z",
    "num_comments": 106
  },
  {
    "id": "reddit-1kbhoyf",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Too busy collecting money that they actually have to post that on their website when trying to be contacted. WTF are we doing here? ASHA is such a scam.",
    "text": "We need a new organization that actually represents us. We need a national union. ASHA doesn’t serve us in any meaningful way. Salary/ Compensation has been stagnant for over a DECADE, if not longer. There is no national caseload limit or support for one in states / counties without it (school setting). No lobbying success other than making sure states and companies continue to want those CCCs. And they can’t even stand up for the Neurodivergent population so many of us serve each day - in the face of a tyrannical government regime saying Autistic people will never love. Never pay taxes. Cmon. WTF?  Cowards. ",
    "score": 104,
    "url": "https://reddit.com/r/slp/comments/1kbhoyf/too_busy_collecting_money_that_they_actually_have/",
    "created_at": "2025-04-30T14:19:43.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1lannk1",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Can we collectively break up with ASHA? Form a separate licensing board? Also, a question about ASHA’s financial transparency",
    "text": "Hi SLPs!\n\nWith everything going on regarding the CMS Medicare changes and CFs, as well as being a FixSLP follower, I have been questioning more and more the value of ASHA and the seemingly nefarious business practices they engage in to hold power over clinicians through the CCC product. This led into a deep dive of non-profit financials. One thing that stuck out to me about ASHA, beyond their ridiculous revenue numbers, is how much “expenses” they supposedly have and the categories these expenses supposedly fall under. \n\nAccording to the the records on non-profit explorer, ASHA made over $73 MILLION in revenue in 2023. They reported ~$72M in expenses for that same year. Looking at these pictures and the breakdown, they are claiming ~$33 MILLION in “other salaries and wages.” I have no idea if I’m understanding all of this correctly, but isn’t that a really high number? I didn’t realize they employed enough people to get to a number that big… \n\nComparing it to APTA (see pictures), ASHA spends ~$20 MILLION more in that category. Just looking at the different between the two (ASHA vs. APTA), it’s shocking. \n\nHow was a professional organization able to get so much power and have so much control over the licensing of their constituents? The more I learn about them, the more wild it all seems. \n\nAm I interpreting this right? I really hope not, but if so, how is that possible? Can we ever separate from ASHA and make our own licensing board similar to how OT and PT are licensed separately from their respective membership organizations? ",
    "score": 83,
    "url": "https://reddit.com/r/slp/comments/1lannk1/can_we_collectively_break_up_with_asha_form_a/",
    "created_at": "2025-06-13T18:40:51.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1kvu86e",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Are we ever going to be able to retire given the therapy contract market?",
    "text": "I spent my whole career as an SLP focusing on just finding full time work with health insurance.\n\nMy CFY was only $45K (11 years ago). Student loans never stopped, the options for advancement never came. I tried to pivot to SNF and spent my 30's stressing about the 15-25 hours of work I would get in that setting. Never mind retirement, I was worried about making the rent.  I went back to schools because there was no other guranteed income in any other setting, even though it was still hourly work the hours were solid for the 180 days of the school calendar.\n\nI just don't see how this field is producing good long term financial outcomes given the market we are in (assuming this is your sole income). There's hardly anymore salary work available with benefits. And even if you were fortunate enough to find those jobs, the burnout factor of high intensity caseloads makes alot of SLPs consider part time work instead to save their mental health.\n\nHow are you guys planning for the future, those who are also in precarious markets with 1099's, or Fee for Service work, contracts with no benefits? Do you know of any financial strategies around the system since Speech is largely all now unpredictable work?",
    "score": 79,
    "url": "https://reddit.com/r/slp/comments/1kvu86e/are_we_ever_going_to_be_able_to_retire_given_the/",
    "created_at": "2025-05-26T13:21:58.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1pcf17j",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Feeling so stuck in my job",
    "text": "I’ll start off by saying I am NOT happy. In my current setting but also in my life honestly. My physical and mental health are failing. This is my 5th year as an elementary school SLP, and while my caseload appears to be lower than a lot of the folks in this forum, my motivation is gone. I am burnt to a crisp and am extremely unmotivated to even show up to work.\n\nThe thing is, it feels impossible to change settings with the amount of burn out/executive dysfunction I’m trying to mitigate. I tried acute care in grad school and did not like it. Outpatient/private practice sounds like I would likely become burnt out even faster than I’m feeling right now. I found a position on a school-based evaluation team (my dream), went through the interview process, and was even offered the job, only to be offered a salary that was so much lower than my current pay that I had to turn it down. All the job postings I see for SLPs are for other school-based positions, which I feel like is going to encounter similar problems as my current job. What should I do? I feel a lot of shame that I am failing at my current position.",
    "score": 53,
    "url": "https://reddit.com/r/slp/comments/1pcf17j/feeling_so_stuck_in_my_job/",
    "created_at": "2025-12-02T17:44:31.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1p9m1og",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "being an slp (student) in a country where no one cares about diversity or marginalized populations",
    "text": "this is a bit of a rant lol. i’m an slp student in my last semester at a brazilian institution (im brazilian american) and i’m just so incredibly frustrated with this field in this country. the people are incredibly individualistic. like, to the point where people refuse to share any resources with you so you don’t “become better” than them. the course culture is stronger than the US, every single person with more than 1000 followers is selling you a course and a mentorship and they are comparatively MUCH more expensive relative to the salary the average SLP makes here. \n\nbut, honestly, what really frustrates me is the fact that if you say the words “cultural competence/sensitivity/responsiveness” nobody will even know what you’re talking about because they don’t care about that! they don’t teach it at uni. there is NO mention of bilingualism in any textbook, class, course. and when you bring it up they tell you it’s not important! that not that much of the population is bilingual and we don’t have to learn about it at all! \n\nthe amount of times professors have been very explicitly racist towards me (i’m indigenous) is insane. one told me i couldn’t touch the patients because i was “dirty” due to my cultural body painting (very similar to henna). another said that “indian women” go to the middle of the forest to give birth and when i corrected her that most of us are born in hospitals she said that it’s because the ones in our region are “acultured” and that’s why we wear clothes (????). \n\nwhenever i talk about indigenous health i have to basically explain that indigenous people are people, too. that we can live in houses and go to school. and it’s not a small minority of people that are prejudiced, it’s genuinely most. \n\nmost people in my degree are also very very christian and there is no separation of church and state. i’ve had professors say things like that those who are christian recover better from illnesses than those who are atheist (this was in intro to research), and my ethics professor had us debate using the bible as a source (?? i’ve never read the bible). and i’ve been victim to religious racism and attempts at conversion because people think that there’s some sort of overarching indigenous religion even though most indigenous people here are christian.\n\nalso, a grand total of three people respect my pronouns and i’ve seen so much misgendering and transphobia towards trans patients.\n\ni loved the idea of being a speech language pathologist and i do actually love the essence of the field but i can’t be proud of being in a field that’s so non-inclusive. my mental health is in the gutter and the only reason i haven’t dropped out is because i have so little time left. i worry about my future job prospects and i’m sad this is what i’ve wasted years of my life on and it might lead to nothing at all. \n\nthanks if anybody’s made it this far. also, if anyone has recommendations on scientific articles that discuss cultural competence, bilingualism, minority populations, etc please send them my way, i’m trying to compile stuff for my bachelor’s thesis (speech is a five year bachelor’s degree like most health fields here). also appreciate any advice or words of encouragement :/. i sometimes see discussions on here or posts by american slps and i just get sad about how much more aligned with my values it all seems. i hate it here.",
    "score": 46,
    "url": "https://reddit.com/r/slp/comments/1p9m1og/being_an_slp_student_in_a_country_where_no_one/",
    "created_at": "2025-11-29T10:47:04.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1k81osr",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "People who work in private practice: why?",
    "text": "I want to preface this that I am fairly early in my career (CF), so I don’t have a lot of experience working in a variety of settings yet. I love my current job and am not looking to change it, just looking for insight into why folks have chosen to take the direction they have.\n\nSo my question is: SLPs who work in private practice, why did you choose to work in private practice? What does this specific setting provide you that you can’t get elsewhere? What keeps you coming back? What kind of clinician would you recommend seek out a position in a private practice? \n\nAbsolutely no shade towards any PP SLPs, but everything I hear about working private practice sounds like a nightmare. Long hours, massive caseloads with only 30 minutes for a session, only being paid for direct therapy time,  no medical benefits, doing your own billing. It only really seems appealing to individuals who are in a dual-income household with a salaried partner. Am I missing something here? I appreciate that I’m looking at PP through the lens of my own personal and career priorities. I’d really like to hear others’ experiences working in private practice, because I really do think our field is unique in that there are *so* many types of careers one can build. \n",
    "score": 42,
    "url": "https://reddit.com/r/slp/comments/1k81osr/people_who_work_in_private_practice_why/",
    "created_at": "2025-04-26T01:45:27.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1lhs7vw",
    "subreddit": "slp",
    "soc_codes": [
      "29-1127"
    ],
    "title": "Public school district didn't renew my contract and now hasn't paid me—SLPs, has this happened to you?",
    "text": "Hi everyone,  \n  \nI'm an SLP in Massachusetts, and after finishing my first year as a public school district employee, I was non-renewed. I found out on May 20th that my contract wouldn't be continued, which was disappointing—but I wasn't shocked, since I'd heard that at least 17 other educators at the high school were let go too, and likely more across the district.  \nWhat's worse is that the district told me (in writing, on June 2nd) that I would be paid the remainder of my salary—5 paychecks' worth—on June 20th. But I only received one paycheck on that date. They still owe me two months worth of pay.  \n  \nI've emailed Payroll but haven't gotten a response. A former colleague told me they're also owed thousands, so this might be part of a larger internal mess. I'll be calling first thing Monday, and I plan to talk to the union president too.  \n  \nHave any of you gone through something like this before?  \n  \nAny tips on how to navigate this professionally while protecting myself legally and financially?\n\nWould you file a wage complaint with the MA Attorney General, or wait?\n\nThanks so much. This field can feel isolating sometimes, so I appreciate the support.",
    "score": 41,
    "url": "https://reddit.com/r/slp/comments/1lhs7vw/public_school_district_didnt_renew_my_contract/",
    "created_at": "2025-06-22T16:36:51.000Z",
    "num_comments": 11
  }
]