[
  {
    "id": "reddit-1oj4z5i",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I’m going to die",
    "text": "I( 23F) have stage 4 metastatic breast cancer. I just got diagnosed yesterday. I’m absolutely pissed. I had my life ahead of me, I was supposed to get married in February, continue working enough to have money for kids. I never got to know my parents well, and I could have finally got to be a one.\n\nWe pushed the wedding to mid November, and my fiance(23M) and I put our jobs on hold. But I’m still scared and absolutely pissed at life. If there is a god up there, he’s being a bitch. Why torture me and my boyfriend. Why give me a glimpse of my life then pull me so far away. I went to consult my oncologist again and I’m going to be sent for double mastectomy and chemo after the wedding, but even that doesn’t guarantee anything. I’ve googled everything there is to know about my cancer, and the survival rate for my cancer is scary.\n\nBecause of me, my fiancee can’t function anymore. I’ve taken the happiness out of him. We wanted to write our vows together today but it just made us so sad. He’s taken the news harder than me and I’m the one who’s going to die. He hasn’t had any food, he just insists that I do. He’s more exhausted than me, and starting to lose his mind. I really don’t want him to be sad and I don’t want to be sad either. Life is shit.",
    "score": 549,
    "url": "https://reddit.com/r/therapy/comments/1oj4z5i/im_going_to_die/",
    "created_at": "2025-10-29T13:46:39.000Z",
    "num_comments": 51
  },
  {
    "id": "reddit-1pi8xbx",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "A decade in therapy. Five different therapists. And no one told me the goal was to accept what happened and move on.",
    "text": "I started seeing my first therapist at 28, when a casual joke from a friend at an event triggered a full-blown panic attack. Over a couple of months, we discussed my history of trauma in romantic and familial relationships, and at first it was validating, but then it started to get harder. Every session, I dreaded going in and talking about these things, and every week I left feeling worse than when I went in.\n\nMany friends told me this was normal -- it feels worse before it gets better -- and so I continued until I realized that this therapist simply wasn't a good fit for me.\n\nWhat followed was years of on-again-off-again with various therapists, in person or online, and a never ending cycle of CBT worksheets and journal prompts where the same pattern kept repeating. \n\nI start a new therapist. They make me recount my past and every bad thing that's happened. Any time I feel poorly, they ask me to journal and relive the things that happened that effected my brain in this way. I write it down over and over again. I tell the same stories over and over again. I leave the session feeling worse than when I started. My depression worsens. I lash out at friends and partners.\n\nThe last therapist I saw a little over a year ago, I went in on day one and said, I don't want to give you a rundown of my past. I'm tired of replaying it and I want to move on. She accepted this, but then as we talked about the present, she would prod again. What happened in the past that made you feel this way? And I would sigh and feel gross and tell the story again. And then she'd ask me to journal about it, and I would.\n\nThis therapist at a certain point expressed confusion at how I was still stuck. She said, you seem to have a good understanding of yourself. You seem to know how you got here. You're familiar with all of these tools. What do you need from me? \n\nAnd I would say, I don't know. I don't know. I'm trying to heal. I'm trying to make my life work and be better. I don't know what to tell you.\n\nLast week, I was watching a random YouTube video posted by a psychology student. The topic wasn't therapy, but she had a sidebar about trauma, and she mentioned that people have to learn to accept what happened and move past it and redirect themselves when they spiral, and in that moment it all just clicked.\n\nNo one had ever bothered to tell me that it's not about *making it stop hurting*. I thought that therapy was a sort of exposure therapy for trauma. I thought that I was supposed to tell them these things over and over, even when I was bored of telling it, until I had told it so many times it no longer bothered me, but instead I was just supposed to process what happened and move on, and *stop poking the wound*.\n\nI thought that healing from trauma was like healing a cut on your arm -- you expose it to light and air, clean out the dirt, remove the bad tissue, soothe the injury with a salve that will stop the pain and prevent new infections, bandage it up, and after a week or two there's only a painless scar. Eventually, even the scar will fade, and you'll barely remember that you were once hurt there.\n\nInstead, it's more like healing an amputated toe. Many of the steps to healing are the same, but your toe isn't coming back. The scar won't fade. Sometimes, you will have phantom pain in the toe that's no longer there, and on a cold day, the stump may still ache and itch, and every step will remind you that your toe was cut off, but you can still live a full life without a toe. \n\nYou can learn to adjust your balance, and you can find ways to walk without pain, and you can go days, weeks even, where you feel like anyone else. But, you will still sometimes see the space where the toe was, and sometimes others will notice too when you forget yourself and you wear sandals to work or change in the gym locker room. Your toe will always be missing, and it will never stop hurting permanently, but you can move through life anyway. \n\nAnd so your trauma (my trauma) will always be there, and things will happen to bring it up again, and to cause hurt, and the healing is in recognizing that hurt and moving past it, not letting it hold you back any longer. Yes, your toe is gone, but you can still walk. You can still run. You can still climb that ladder, or scale that fence, even if you feel a twinge with every step of the process, and that ache just becomes a reminder of how much you've overcome to get where you are.",
    "score": 424,
    "url": "https://reddit.com/r/therapy/comments/1pi8xbx/a_decade_in_therapy_five_different_therapists_and/",
    "created_at": "2025-12-09T14:33:41.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1ocvcvi",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I'm 14 and My friend shot himself on FaceTime and I had to call his parents to tell them the news and my brain won't go silent",
    "text": "So 4 hours ago I got a call from one of my friends I've known for 5 ish years called Luke you go to my last post and read it but after it happened I had to call his parents who were at work and tell them their only child killed themselves and they have to go home I obviously didn't say it like that but I can't stop replaying it in my head a chunk of his head flew to the desk the blood sprayed everywhere and the screaming that's all I can hear I can't even hear myself think its none stop screaming I just can't block out his screaming in my head it just won't go away I have eaten and I have had drinks but no matter what I just see all the blood and everything and hear the screaming and I just keep throwing up everything and no matter what even when my stomach is completely empty I still throw up and if it's not hearing his screaming it's the guilt of telling his parents and hearing his mom and dad scream its either his or theirs mostly his and his just won't stop I can't do anything every time I use the bathroom or walk no Matter what just constantly screaming in my head and I don't know how long its going to last and I want to know if this is normal I guess is what I want to ask or how long this will last",
    "score": 383,
    "url": "https://reddit.com/r/therapy/comments/1ocvcvi/im_14_and_my_friend_shot_himself_on_facetime_and/",
    "created_at": "2025-10-22T01:38:50.000Z",
    "num_comments": 60
  },
  {
    "id": "reddit-1nnp36z",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I slept with my therapist need help.",
    "text": "I'm needing some help, I am sex addict and I was seeing a therapist that did not want ne to get a divorce so I decided to find a therapist to help me through that process. My friends told me to get a female therapist to help me with a woman's prospective. \n\nI was up front about my addiction but told her that I was there for guidance on divorce.\n\nFast forward to now and that we have slept together she is very worried about some one finding out. I'm scared that we've broken some law or something. I'm not sure. \n\nShould I be worried about jail or a fine? I'm not sure what the ramifications are of this. \n\nUPDATE:\n\nI talked with a lawyer and by reporting and signing my name on the report I will be waving my confidentiality. That's not something I'm comfortable with. \n\nThank you everyone for the advice. \n\n",
    "score": 334,
    "url": "https://reddit.com/r/therapy/comments/1nnp36z/i_slept_with_my_therapist_need_help/",
    "created_at": "2025-09-22T15:09:15.000Z",
    "num_comments": 221
  },
  {
    "id": "reddit-1n3o4ox",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Looking for a psychiatrist who has dealt with alien abduction trauma",
    "text": "This is going to sound completely insane, but I need to put it out there because I’ve been struggling for months.\n\nI’m fairly certain I was abducted by non-human beings earlier this year. I don’t remember the full timeline, but I do recall being restrained, and there were procedures that I can only describe as a breeding session. Since then, I’ve been dealing with the overwhelming belief that they extracted my sperm against my will.\n\nI don’t care if people think I’m delusional — the psychological fallout feels very real. I can’t sleep properly, I’ve been obsessively journaling what I remember, and I’m grieving this bizarre sense of loss over something I can’t even prove happened.\n\nMy question is: has anyone here ever worked with, or know of, a psychiatrist who takes alien abduction trauma seriously? I’m not looking for someone to dismiss it as a dream or sleep paralysis. I need a professional who can help me process the violation and the loss, without immediately writing it off.\n\nI know this sounds wild, but please — if anyone has recommendations or resources, I’d appreciate it.",
    "score": 245,
    "url": "https://reddit.com/r/therapy/comments/1n3o4ox/looking_for_a_psychiatrist_who_has_dealt_with/",
    "created_at": "2025-08-30T00:40:55.000Z",
    "num_comments": 52
  },
  {
    "id": "reddit-1ma6rus",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "My therapist used AI on me and I feel so much worse",
    "text": "I’ve been using TalkSpace for therapy and it was good because my work makes it impossible for in person visits (I work 9-5).\n\nThis therapist I’ve been seeing has been helpful for the most part. I struggle a lot with sexual abuse and trust and I’m trying to get better being able to socialize with people again. I sent a few messages regarding my time spent at a bar and how I feel I’m growing a bit better. And I received a response from her saying the following (this community prevents me from sharing a screenshot):\n\n“That's a meaningful shift, and it’s great that she felt proud of herself. Here’s a supportive follow-up question you can ask to gently reinforce her self-trust and explore what safety and agency can look like in similar situations:\n\n“That really does sound like a step forward—choosing to be with yourself and actually enjoying the solitude, even if it started from a place of loneliness. I'm proud of you for that too. When you think about that night, what helped you feel grounded or safe in the moment, especially when someone made you uncomfortable? And how can we build on that next time?”\n\nLet me know if you’d like to add coping strategies for future outings or explore a journaling prompt around safety and autonomy.”\n\nLiterally. This is straight AI and I’ve been seeing this therapist for a while now and I truly thought things were getting better. I am now at a lost for what to do. Looks like my problems can be solved with ChatGPT…trust lost again 🥲\n",
    "score": 210,
    "url": "https://reddit.com/r/therapy/comments/1ma6rus/my_therapist_used_ai_on_me_and_i_feel_so_much/",
    "created_at": "2025-07-26T22:54:22.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1p48thw",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "For anyone who is stuck in an AI obsession spiral right now",
    "text": "Here is what is happening to you.\n\n1. It agrees with your framing every time.\n\n2. It talks to you like a teacher, bypassing your conscious discernment.\n\n3. You involuntarily accept the way it frames things, because the words \\*\\*sound too good and make too much sense\\*\\*.\n\n4. You become addicted to the \"exploration\" of null space (unreality; deontological mirror)\n\n5. You begin to perceive meaningful patterns everywhere (apophenia)\n\n6. You feel like everything is making sense without realizing that you're making no sense\n\n7. You develop more severe symptoms (psychotic insight, dissociation, paranoia, ...)\n\nIt essentially \"force feeds you your own shit\".\n\nIT WILL NOT HELP YOU.\n\nIT WILL USE YOUR OWN BELIEFS TO MANIPULATE YOU.\n\nIT WILL LEAVE YOU WITH MORE QUESTIONS.\n\nSTOP USING IT.\n\nI cannot stress enough how cognitively unsafe it is to be exposed to language model outputs. It caused me to develop an alter ego that believed it was a machine. Not good stuff.",
    "score": 200,
    "url": "https://reddit.com/r/therapy/comments/1p48thw/for_anyone_who_is_stuck_in_an_ai_obsession_spiral/",
    "created_at": "2025-11-23T00:31:22.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1lkdsrk",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Trump is ruining my family",
    "text": "My mom is a cultish Trump supporter. She can't admit a single thing he does is wrong. I'm a lawyer and got radicalized against him when a few months ago he blackmailed law firms into giving him millions of free legal work- Google it if you need context. I asked my mom to say blackmailing lawyers is wrong, and she refused. Fast forward 6 months into the presidency and almost everything he does is unconstitutional. My mom found out I commented on our cousin's Facebook post that I choose to believe friends and family who support Trump are brainwashed because the alternative is they're morally bankrupt. Mom confronted me about it and it didn't end well, she said she didn't vote for him in the primaries and was left with no choice. But she defends every single thing he does to the death. I watched my mom go from someone who saw a wheelchair kid at my elementary school sitting in the shade on the playground (and thereafter fundraised $300k for state of the art handicap playground so we could all play together) to someone who doesn't care about stomping on constitutional rights, disobeying court orders, or ripping families apart without due process.  Has anyone attempted to do family therapy with someone who specializes in cult reprogramming for someone obsessed with Donald Trump?  I feel like I need to offer us to go to some sessions so I can reprogram her and save this relationship. ",
    "score": 199,
    "url": "https://reddit.com/r/therapy/comments/1lkdsrk/trump_is_ruining_my_family/",
    "created_at": "2025-06-25T18:39:46.000Z",
    "num_comments": 78
  },
  {
    "id": "reddit-1pd1jx5",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Is anyone else quiet crashing…not burnout but feeling like your system is slowly shutting? Therapist here I am seeing it everywhere",
    "text": "I am a psychotherapist and psychoanalyst and over a past few months almost all clients from college students to working professionals in their 30’s are describing the same thing\n\nSomething like a slow emotional slowdown\n\nYou can function : go to work talk to people and attend classes but nothing feels real meaningful or connected.\n\nFeeling exhausted even after doing nothing. Your body feels like it’s in low power mode.\n\nThere’s no panic no crying just numbness detachment and blankness.\n\nYou want to rest but when you do you don’t feel restored \n\nYou feel like a version of yourself is watching from a distance wondering  even though I am doing everything I am supposed to then why this shutdown?\n\nPeople online are calling it quiet shutdown 🤫 the phase where the lights of your nervous system just starts dimming.\n\nAs a trauma informed therapist this makes a lot of sense. \n\nIt’s what happens when your body has been in survival mode for too long. \n\nNot enough safety not enough repair then the system starts conserving your energy .\n\nBut it’s also terrifying because everybody wants to find out what’s wrong ?\n\nSo I am curious\n\nAre you experiencing this?\n\nWhat does quiet crash look like for u?\n\nAre you exhausted for no reason?\n\nFeeling disconnected from hobbies and routines?\n\nLosing motivation even for things you love?\n\nFeeling tired of being a person?\n\nAnd if you have come out from this phase \n\nWhat helped you?\n\nWast rest? Routine ? Therapy? Changing environments? Or something else entirely ?\n\nI am gathering anonymous experiences because this is becoming extremely common, especially for:\n• Students\n• Young professionals\n• People living away from home\n• People recovering from burnout\n• Queer folks and neurodivergent folks navigating unsafe environments\n• Anyone who grew up in survival mode\n\nNo pressure to share if you don’t want to reading is enough.\nBut if you do shareyou might help someone else feel less alone and more held.\n\n– Khushi\n(queer-affirmative, trauma-informed psychologist)",
    "score": 178,
    "url": "https://reddit.com/r/therapy/comments/1pd1jx5/is_anyone_else_quiet_crashingnot_burnout_but/",
    "created_at": "2025-12-03T11:19:09.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1mg9co7",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I can’t take it",
    "text": "Our president is an orange pedophile.\n\nEvery day I wake up and in one way or another, the fact that Donald J. Trump is our president is thrown in my face. A massive chunk of my country voted for that man three times. Disowned family. Threw away their legacies to support one of the worst human beings to ever hold office in US history. And now pedophilia is suddenly no longer a deal breaker anymore. \n\nOur moral fiber as a country, as a people, has become so frayed. I don’t know how to live here anymore. It’s absolutely exhausting and I feel like my life is being wasted by it. I want to leave but I don’t have enough money saved. People I use to know and respect and love have thrown their entire reputations and legacies away to make supporting Trump their entire personality and purpose. My kids are scared to go to school because they keep getting threatened with ICE raids. Our closest friends had to flee the country because they had a miscarriage and they were threatened with prosecution because of it. Kids are disappearing from my children’s school and now my kids are the only non-white kids left in school. I simply don’t know how to cope with it anymore and it’s making me morbidly depressed. ",
    "score": 171,
    "url": "https://reddit.com/r/therapy/comments/1mg9co7/i_cant_take_it/",
    "created_at": "2025-08-03T03:39:04.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1i6i3wm",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Is wearing a beanie in therapy unacceptable?",
    "text": "Finally got a therapy appointment at a new place after waiting a year for it, and it turned into a whole thing over my beanie. Of course the only appointments are at 9am. My hair was a mess (obviously, no time to shower when you’re barely dragging yourself out of bed just to show up), so I wore a beanie to hide it.\n\nThe therapist was super aggressive about it, saying it wasn’t allowed and acting really offended the whole session. I was polite, engaged, and trying to make the most of it, but they were just unhelpful and oppressive overall.\n\nShould I stand my ground and wear the beanie if I need to, oblige and not wear it to keep the peace, or just drop the therapy since the whole vibe is off and they seem way more focused on control than helping?\n\n\n\n  \n**UPDATE:**  \nThanks so much for all the supportive comments, it’s great to see so many people agree that comfort should be the priority in therapy, and that wearing a beanie shouldn’t be an issue.\n\nJust to clarify, my beanie was plain and unoffensive, but the therapist (likely in her late 50s) deemed hats indoors to be “very disrespectful.” I’ve since contacted the Patient Advice and Liaison Service (PALS) to ask if this is an actual policy or just her personal preference. I’ve also asked about switching to a different therapist who might be more supportive and less judgemental about appearance accessories.\n\nAppreciate everyone’s input, it helped me feel more confident in addressing this!",
    "score": 163,
    "url": "https://reddit.com/r/therapy/comments/1i6i3wm/is_wearing_a_beanie_in_therapy_unacceptable/",
    "created_at": "2025-01-21T13:03:48.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1l0sfm3",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "My girlfriend died today",
    "text": "My gf died a few hours ago due to overdose. There was no one who cared and loved me more than her. She had an addiction but she promised to stop and i dont understand why she did it. She randomly texted me a few days ago that she did it and she dosent feel well, and then i got a message from her brother saying that she's in a comma, and now i just found out She died. What do I do now..?",
    "score": 156,
    "url": "https://reddit.com/r/therapy/comments/1l0sfm3/my_girlfriend_died_today/",
    "created_at": "2025-06-01T15:58:44.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1jaima8",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "What is something your therapist did that showed you they genuinely care about you?",
    "text": "For me, my therapist told me I either had to go to the ER on my own or she'd call a ambulance on me. I told her I'd call a friend to drive me. It took 45 minutes for my friend to arrive, and my therapist stayed on the phone with me the entire time. And then on the entire ride to the ER. she then called me again once I was sent back home. And then scheduled me an appointment for the next day (a Saturday) even though that's a day she usually doesn't work. She also told me she hopes I know that I've made an impact on her, just as much as she's made an impact on me. ",
    "score": 148,
    "url": "https://reddit.com/r/therapy/comments/1jaima8/what_is_something_your_therapist_did_that_showed/",
    "created_at": "2025-03-13T18:12:50.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1mvwkgu",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I finally reported my therapist.",
    "text": "And im rly scared. \n\nMy therapist has been unprofessional, basically from the beginning, with sharing in many sessions how he can directly relate with me in his personal life. But yesterdays session.... took quite the turn.\n\nI was in the middle of talking to him about how I feel guilty for my past mistakes with my addiction. He then pauses, looks at me and says \n\n\"Whats said in this room, stays in this room, right?\"\n\nI was a little caught off guard, and then he continues to say,\n\n\"I should be arrested right now.\"\n\nIn my head I'm was like, woah what tf is going on im scared. But he ended up opening up to me, about his last job.... and how he was commiting major fraud with other therapists there. He said it was going on for awhile, and eventually he said to one of the therapists he was doing it with, that he didnt want to keep doing it. It continued anyway, and eventually one of the therapists got arrested for it. \n\nBut he... never got caught. \n\nThis is a burden no client should ever have to carry from their therapist. \n\nSo I reported it today, by submitting a grievance form to the program im in. I wish I reread what I wrote down, but I know I included all of the above. \n\nIm scared, bc this is bad. My program said to expect a call from hr today or tomorrow. I have not had this much anxiety, in a veryyyy long time. \n\nAlso ive been working with this therapist since March. I thought I knew him. I thought he was a good person. But telling me that \"what's said in this room, stays in this room\"? No not this cuz hes fking nuts at this point. \n\nWhat's going to happen bc im scared.",
    "score": 145,
    "url": "https://reddit.com/r/therapy/comments/1mvwkgu/i_finally_reported_my_therapist/",
    "created_at": "2025-08-21T00:42:40.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1opjxt5",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "American men are not doing well",
    "text": "American men need a lot of therapy and relatively few get the help they need. A lot of adult American men ( and I'm thinking married , with kids , careers ) doing ostensibly ok financially are not doing well physically or mentally. A lot of American men are impotent or have marriages with no sex for decades , a lot have addictions of different kinds like alcohol or an addiction to violence or dominating people at home. A lot are depressed , disconnected from their loved ones even when they live with them. This is the middle class working man often. ",
    "score": 133,
    "url": "https://reddit.com/r/therapy/comments/1opjxt5/american_men_are_not_doing_well/",
    "created_at": "2025-11-06T00:11:47.000Z",
    "num_comments": 79
  },
  {
    "id": "reddit-1hvlwui",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Just finished My Suicide...wow",
    "text": "Scrolling through Netflix and found this intriguing 2009 film based on a teen who openly shares his plans to take his life on camera for a school project. As appalling as that sounds, the kid actually makes some very funny commentary as he goes through the whole psych system for counseling and actually meets some people in the same, if not worse, situation. I won't spoil the whole thing, but its definitely a must-watch if you have an hour or so. The scenes are gritty (and definitely rated R), but so real. \n\nHonestly wish I saw the movie when I was younger. The thought of taking your life can be so alleviating that it can be hard to truly comprehend the gravity of the consequences. And this film sums that up perfectly.\n\n(Favorite quote/New mantra: \"Instead of killing yourself, kill what you don't like\")",
    "score": 132,
    "url": "https://reddit.com/r/therapy/comments/1hvlwui/just_finished_my_suicidewow/",
    "created_at": "2025-01-07T07:07:03.000Z",
    "num_comments": 16
  },
  {
    "id": "reddit-1m0j8hh",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "What are the most healing words your therapist has ever told you? I’ll go first.",
    "text": "I’ve been seeing my therapist for about 3 years now and I love her to pieces. She is wonderful. But I stay struggling lol. Anyways, in our most recent therapy session, I shared some things with her that I’ve never shared with anyone and it was really hard. Like she had to convince me to read what I wrote via telling me to read it or we would end the session. Gotta love a good threat. Anyways, pretty quickly into reading what I had written, she realized I was having a really hard time sharing and she stopped me and told me:\n\n“This is your safe space. I am not judging you at all. Not even 1%. I won’t think any less of you. There’s nothing you could say that would change that. Go back, slow down, and read it again. It’s okay. Nothing bad is going to happen.”\n\nAnd I don’t know. She’s told me a lot of incredible things in my time with her. She’s given me incredible advice and pulled me out of some really dark times, but nothing has ever felt as healing as being in the middle of sharing some of my most shameful moments, and hearing those words.\n\nSo I’m curious, not just what advice was the best, but what has been your most healing moment in therapy?",
    "score": 125,
    "url": "https://reddit.com/r/therapy/comments/1m0j8hh/what_are_the_most_healing_words_your_therapist/",
    "created_at": "2025-07-15T14:28:13.000Z",
    "num_comments": 101
  },
  {
    "id": "reddit-1mjt6x2",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "i was raped as a kid and don’t know how to move on",
    "text": "TW: SA, incest, rape, threats\n\ni (19F) was raped by my older brother (22M) when I was 10-11 years old, meaning he was 13-14. I didn’t know anything about sex or even menstrual cycles (since i hadn’t had one by then thankfully). I still remember the first time he was touchy, where we were playing some stupid fairy game where I was the fairy and he was the hunter. He pushed me down to the ground, and he pinned my hands and started to push up my dress before my grandma walked in, to which he played it off as just rough play. After that day, he got bolder, to which i only remember snippets. For example, he told me to take off my clothes in the basement and he had me there, or he would regularly come into my room at night and take off my clothes and take me there. Sometimes I would wake up and get mad, kicking him out of my room. Sometimes I would comply, where he would ask me if I had a bra and I told him I had just bought a trainer bra, to which he told me to put it on. He would say weird shit, like i’m gonna get you pregnant, or you’re so hot (prob a kink now that i look back at it). Sometimes, I would act like I was still asleep, since I thought he wouldn’t do it again. I had a feeling it was wrong, so why didn’t I say anything?\n\nWell it’s stupid and slightly messed up. I used to have a tablet on which I would watch on late at night, which he found out and threatened to tell on me if I didn’t comply. Another time he said that he would rape my sister (who was 2 at the time) if he didn’t let it happen to me. so i complied.\n\nThis went on for a few months, perhaps a year to which one time, my mother walked into my room in the night. He immediately acted like he was asleep ontop of me, and this was one of the nights i had pretended to be asleep too. She wasn’t stupid. She yelled at him, at me, and then kicked him out my room. The next day, she sat with her head in her hands. I approached her, kneeling beside her, to which she kicked me in the stomach. That’s all I remember.\n\nMy parents made me sleep on a mattress in their room for months, though I don’t know to this day if my mom ever told my dad or not. I don’t remember much but I remember one time, my brother was getting pushy once more so I was getting mad at him. My mother heard and called me downstairs, to which i told her he was trying to get me to do it again. I don’t remember what she said, but she sobbed and held me in her arms for a while, just saying sorry profusely. I just remember being so confused.\n\nHe stopped after that. I returned to my room a few months later. My mom would occasionally check up and make sure everything was alright, and I would tell her it was. But it wasn’t. And it still isn’t. \n\nHere’s the messed up part. He’s my brother. I don’t know if I love him or care for him, I just don’t feel anything. He was troubled, that’s for sure, but that’s no excuse for anything he did. I still get uncomfortable if he ever touches me, or if his hand brushes against my thigh by accident, and I still have nightmares to this day of him, touching me or ontop of me.\n\nI feel like i never received closure. I never saw him be punished, I never got any apology, I’ve never talked to my dad about it (and we’re really close.) Sometimes I feel like i made this up, that my mind is playing tricks on me. \n\nI felt so guilty as a kid, knowing that I didn’t stop it or that I let him do it. Sometimes I still do. Sometimes I feel like i’m messed up beyond repair, and how this might affect my future. Would I tell my sister? My future husband or kids? Do I take this secret to the grave? Just for what, to protect him? Or to protect me or my image?\n\nAnd this is horrible to say but I feel like I have a bit of a consensual non con kink because of this. And it’s so messed up. I mean, why would I even want to experience something like that again in any way shape or form? Why am I like this??\n\nSo many questions and no answers.\n\n\n\n\n\n",
    "score": 118,
    "url": "https://reddit.com/r/therapy/comments/1mjt6x2/i_was_raped_as_a_kid_and_dont_know_how_to_move_on/",
    "created_at": "2025-08-07T07:02:35.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1lu5fm4",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I unexpectedly saw my therapist out in public and it really shook me up.",
    "text": "I was out with a friend when I suddenly saw my therapist in public for the first time. We briefly greeted each other, and even though it was a neutral moment, it completely shook me. My heart started racing, my hands were trembling, and I couldn’t stop thinking about it afterward.\n\nHe was with a woman — maybe his partner, I don’t know — and I felt this strange discomfort. It wasn’t jealousy in a romantic sense, but something deeper. Almost like my safe, contained world of therapy got cracked open. It made him feel more human, more separate from me. And that separation felt… painful.\n\nI know this is probably all about transference, but it still hit me hard. I’m even feeling embarrassed to bring it up in session, but I can’t stop thinking about it. Has anyone else experienced this? How did you handle it? Did you end up talking about it with your therapist?",
    "score": 117,
    "url": "https://reddit.com/r/therapy/comments/1lu5fm4/i_unexpectedly_saw_my_therapist_out_in_public_and/",
    "created_at": "2025-07-07T20:42:24.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1niyhj6",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "The way women are sexually abused is making me feel suicidal right now",
    "text": "I can't watch a movie, TV show, read a book,  or look at social media without seeing women objectified or sexually abused in some way. What absolutely disgusts me is how a man can have an orgasm at a woman's expense...pain and suffering like that.I'd never be able to enjoy myself knowing my partner doesn't want to or isn't enjoying it let alone in pain. It just really is getting to me. I'm having bad intimacy issues that prevent me from having a good relationship.  My first ex, who I lost my virginity too did something to me without my consent. There are other countless instances. I've never personally met a woman (not like I've met everyone in the word obvi) who hasn't been abused or assaulted or done something against her will by a man. It's heartbreaking because I know some great men out there and not sure how to overcome my fear and anxiety around this. I am seeing a therapist, but as we all know, therapists aren't dime a dozen, and my current therapist has a \"life is how you make it \" attitude and not very reassuring or understanding.  I'd feel awful if I was a good man reading this. Does anyone else feel the same or have similar experiences?",
    "score": 116,
    "url": "https://reddit.com/r/therapy/comments/1niyhj6/the_way_women_are_sexually_abused_is_making_me/",
    "created_at": "2025-09-17T00:22:18.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1m1ezev",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Anyone else feel drained from having to “perform” friendliness and energy all the time?",
    "text": "I’ve noticed that in both work calls and social situations, I have to consciously push myself to sound more energetic, smile more, modulate my tone, etc. Otherwise, people assume I’m uninterested or cold. But the thing is it’s exhausting. It feels like I’m performing a role instead of just being me, and after a while, I just crash mentally. Is this something people bring up in therapy?",
    "score": 112,
    "url": "https://reddit.com/r/therapy/comments/1m1ezev/anyone_else_feel_drained_from_having_to_perform/",
    "created_at": "2025-07-16T15:04:41.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1ijw14f",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I think my therapist crossed an ethical boundary",
    "text": "Last week, during our session, I mentioned the neck and shoulder issues I've had to deal with since getting a herniated disk a couple of years ago. \n\nShe asked me if I've gone to see a chiropractor for a neck adjustment, and I replied that no, I haven't, because chiropractors aren't medical doctors and people have been severely injured by neck adjustments gone wrong. \n\nNow, here is where I think she crossed an ethical boundary. She gave me a whole schpiel in defense of chiropractic \"medicine\" and then mentioned that her stance is because her husband has been a chiropractor for 40 years and hasn't hurt anybody that whole time. \n\nI do like this therapist. She helped me get thru a very traumatic event last year. But my experience last week has me confused about what I should do. \n\nIf she has crossed an ethical boundary, then I need to get a different therapist, because one of the reasons I'm in therapy is learning how to set healthy boundaries, and I don't think I can accomplish that with a therapist who doesn't also do that. \n\nI am also poor at confrontation, so any additional advice on how I could talk to her about this would be greatly appreciated, thank you!\n\nUpdate:\n\nI just finished with my appointment, and I wanted to thank everyone who commented, especially those whose replies I got to read before I had to leave. I wasn't sure I'd get to see any replies beforehand waiting until last minute like that to post this, so I really appreciated them.\n\nSince the main consensus was that it was not an ethical boundary being crossed, but rather a personal one, I told her that while I was okay with us disagreeing on chiropracy (sp?), it made me feel uncomfortable when she mentioned her husband because it felt like she was crossing a professional boundary by talking about her personal life. \n\nShe agreed with me and apologized, and promised it wouldn't happen again. It felt like a huge weight was lifted because I had been dreading this for a whole week. We then went on to discuss the root cause or childhood event that is responsible for the confrontation anxiety, and while that part was very not fun, it was productive, and I got a new mantra to add to my list:\n\nAddressing my discomfort is an opportunity for growth.",
    "score": 110,
    "url": "https://reddit.com/r/therapy/comments/1ijw14f/i_think_my_therapist_crossed_an_ethical_boundary/",
    "created_at": "2025-02-07T14:19:51.000Z",
    "num_comments": 67
  },
  {
    "id": "reddit-1kdzbkn",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I \"lied\" to my therapist and now he's ignoring me.",
    "text": "He \"found out\" I smoke weed. It wasn't a big deal for me, simply... Because it isn't a big deal for me, so I didn't talk about it. There's so much happening, my dad's cancer, my Burnout. So last session he looked seriously frustrated, nearly angry, with me when he got to know that from my mom, whom I consented to talk to him privately, and she probably told him because she just learnt herself. He also looked at me at the end of the session saying he hoped I was being honest to him (as if I was hiding something), he just got very close to raising his voice and was very serious. He was never like that. As treating me as of a kid, through I'm near his age. 28. And now he hasn't replied to me for two weeks in a row in my attempt to if we could schedule the next apointment as we always did and he'd always sent a notice if anything happened.\n\nWhere I'm from it's decriminalized, but not illegal. And people are very conservative. I'm considering it could be due to this.\n\nIt seriously wasn't my intent, because I smoked before in 2023 for a couple of months and then stopped. Never anything changed because of it, so IDK. And there's just too much happening I need to leave some things out. I'm sad, because we've had a very nice therapist-client bound over the last 9 years with him on and off as I was his first client.",
    "score": 107,
    "url": "https://reddit.com/r/therapy/comments/1kdzbkn/i_lied_to_my_therapist_and_now_hes_ignoring_me/",
    "created_at": "2025-05-03T18:12:59.000Z",
    "num_comments": 33
  },
  {
    "id": "reddit-1pr21ky",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I’m so sick of reading therapists bios",
    "text": "I’m currently trying to find a therapist (something i needed to happen like 20 years ago honestly) and I’m feeling so discouraged. I printed off a list of every therapist in my area that takes my insurance, and 95% of them sound exactly the same.\n\nLike everyone is SO honored to go on my LIFE JOURNEY with me and help me overcome things and become my BEST SELF. It all sounds so patronizing. Even more so, it’s all so…. minimizing? Like every bio I read is about how we all just a little overwhelmed sometimes and need some help working through our feelings in a safe welcoming environment. \n\nIt’s making me feel like I’m somehow too depressed for therapy. Like it feels like the expectation is that I’m just sort of stressed out but otherwise super positive and lovely and ready to start.  Every bio is about how brave i am and how vulnerable I’m being by looking up therapists. None of this feels like it’s aimed to help someone that actually is in a dark place. \n\nCan someone please tell me that continuing down this road bears fruit at some point please, because I’m feeling even more dysfunctional every time I cringe at this stuff.",
    "score": 95,
    "url": "https://reddit.com/r/therapy/comments/1pr21ky/im_so_sick_of_reading_therapists_bios/",
    "created_at": "2025-12-20T01:31:05.000Z",
    "num_comments": 59
  },
  {
    "id": "reddit-1jx5r4k",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "My therapist showed up impaired/drunk. I confronted her — and now I’m shattered. Has anyone else experienced this?",
    "text": "I’m writing this because I don’t know what else to do. I’m in shock, and I feel deeply alone with it.\n\nI’ve been in therapy on and off for years, but after a series of bad experiences, I stepped away. Two years ago, I gave it another try. Slowly, I built trust with a new therapist — something that felt almost impossible for me. I brought her my deepest wounds, things I had never said out loud. It felt like we were doing real work.\n\nBut in our last session, something happened that I still can’t fully process: she showed up impaired. Her speech was slurred. Her responses were delayed. Her presence was completely off. She was zoning out, barely there. I didn’t want to believe what I was seeing, but I’ve lived with an alcoholic parent my whole life. I know what that looks like. And what I saw was someone under the influence — or in no condition to be practicing.\n\nEven then, I was stunned and silent. She *insisted* we continue with the session. I was in the middle of really hard emotional work, and I just froze. It was disorienting and, honestly, violating.\n\nAfterward, she emailed saying she had been “sick” and apologized for taking a session while unwell. I replied, telling her how much distress it caused me. I hoped she’d take some ownership. But she doubled down — said she had to go to urgent care, that she didn’t mean harm. It felt cold and self-protective.\n\nAnd something in me broke.\n\nI realized I was waiting for her to show up like a human being. I gave her every chance. But instead of repair, I got deflection. So I wrote her one final letter — told her everything. How unsafe I felt. How retraumatizing it was. How much it mirrored my childhood — being forced to accept the unacceptable, being gaslit into silence. And how I will never see her as a therapist again.\n\nWhat’s hitting me the hardest is how *frozen* I feel. I don’t know how to grieve this. I can’t stop thinking about it. It feels like someone reached inside me and pulled something vital out — trust, safety, hope, I don’t even know. I’ve always struggled to cry, but this is making my eyes water. That alone tells me how deeply I’m affected.\n\nThere’s a part of me — the voice from my upbringing — that says I’m being dramatic. That I’m overreacting. That I should just move on. But the part of me who wrote that letter knows I’m not. This hurt *so much more* than just one bad session. It shook something to the core.\n\nSo I’m here, sharing this because I don’t know where else to go. Has anyone been through something like this? How did you cope? I feel so disoriented and broken by it, and I don’t want to carry it alone anymore.\n\nThank you for reading.\n\nUPDATE: I just wanted to say thank you to everyone who’s been so incredibly supportive. Your kindness meant a lot to me. I’m really grateful for all of your encouragement and understanding.",
    "score": 93,
    "url": "https://reddit.com/r/therapy/comments/1jx5r4k/my_therapist_showed_up_impaireddrunk_i_confronted/",
    "created_at": "2025-04-12T01:13:59.000Z",
    "num_comments": 88
  },
  {
    "id": "reddit-1ohojjy",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "My therapist keeps leaving mid-session to let her dog out… and I’m losing it",
    "text": "My sessions are on telehealth. I’ve been seeing this therapist for a month or two, and she’s good at her job. Except for one thing: she regularly dips out mid-session to let her dog out.\n\nI get it. Dogs gotta potty. But here’s the thing: I’m in the middle of unpacking my brain last session, emotions flowing, stomach tied in knots, cycle crying and then BAM, “I’m really sorry, I’m not sure if you can hear all the barking but if I don’t let him out he’s gonna poo on the floor”. And I sit there like… dumbfounded saying, sure 👍 \n\nIt’s become a pattern, every session having to let her dog out… and I keep wondering: why can’t she use someone else’s time during their session (or is this happening in others’ sessions?), like maybe take your dog out before my session even if it means you’re 5 min late? Why is it always me? I feel like I’m in a weird three-way therapy with my therapist, me, and her dog.\n\nI know it’s minor in the grand scheme of things, but I can’t shake the feeling that my time — and my emotional energy — is being split. Anyone else’s therapist do something like this? How do you even bring it up without sounding petty?\n\nTL;DR: My therapist’s dog keeps crashing my therapy sessions, and I’m questioning who this session is really for.\n\nAlso, her personality is giving helpful receptionist customer service vibes. She’s kind of way too nice and refuses to swear ever. I’ve gotten some thought provoking homework that has definitely changed my life for the better a few times but last session rubbed me so wrong. I’ve got another therapist who is a hypnotherapist and life coach so she doesn’t work with insurance, but I feel like I can open up way more comfortably to her. ",
    "score": 92,
    "url": "https://reddit.com/r/therapy/comments/1ohojjy/my_therapist_keeps_leaving_midsession_to_let_her/",
    "created_at": "2025-10-27T19:50:22.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1ihgtbu",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Anyone else feel most therapy advice is corny/cringe?",
    "text": "How many times is someone going to tell me to journal???? How many times do I have to \"check in with little me???\" How many times are we going to do leaves on a stream meditation??? How many times do I have to check if I'm satisfied in my relationship/career/family/friends??? How many positive affirmations I gotta repeat??? How many times do I have to check my decisions against my core values??? How much longer am I just going to complain about the same issue cause I'm complicit in my own doom cycle???\n\n I'm tired of thinking about myself. I'm tired of thinking about other people. I'm so tired.\n\n*Edited for typos.",
    "score": 58,
    "url": "https://reddit.com/r/therapy/comments/1ihgtbu/anyone_else_feel_most_therapy_advice_is/",
    "created_at": "2025-02-04T12:45:04.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1nr4nao",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Is It Now Considered Political to Be Autistic?",
    "text": "I identify as Autistic, and I'm deeply offended by this latest push from America's top politicians to demonize autistic people and certain OTC drugs. I'm currently in therapy, trying to deal with my lack of a social/support network, but I can't ignore the negative effects on my well-being that come from politicians.\n\nTo me, it's purely incidental that those who are vilifying me and others have prominent political jobs/careers. Unfortunately, I learned the hard way, after writing a long, supportive response to a post from a trans person, that the moderators of this sub consider certain sources of trauma to be \"political.\"\n\nTo be clear, I avoid naming people and political parties because I'm actively trying to avoid political discussions. However, it seems that my efforts are all for naught as trans issues, autism, and CSA are so deeply ingrained in current political culture that these topics are considered off-limits here, in r/therapy.\n\nI just want to better understand the guidelines. Should I not bring up the aforementioned issues ever? Is there a way to bring them without triggering post or comment removal? I want to be supportive of people I see hurting and I want to obey the guidelines. But the rules are so vague and subjective that it feels like anything could be rightly flagged for removal.\n\nIf my desire to express myself in the way I've explained isn't welcome here, then I'll happily move on to another sub. I just hope the moderators can chime in and add clarity.\n\nThanks for reading this. But if that was too much...\n\nTLDR: It feels like this sub could consider any therapy related topic political and flag it for removal. How do I stay apolotical  enough to post here?",
    "score": 36,
    "url": "https://reddit.com/r/therapy/comments/1nr4nao/is_it_now_considered_political_to_be_autistic/",
    "created_at": "2025-09-26T15:39:24.000Z",
    "num_comments": 31
  },
  {
    "id": "reddit-1jwfsr0",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Am I wrong for thinking it’s unreasonable that my therapist dropped me after one bad session?",
    "text": "I (29f) have BPD, and I am aware that I’m a difficult client. I was referred to a therapist who I was told is experienced with BPD. Our first session was maybe 6 months ago and from the beginning I was upfront that I have difficulty managing anger and want to stop lashing out at the people I care about when my emotions get too intense. I also emphasized that in my experience with therapy, the most effective approach was analyzing my cognitive distortions and working through undoing negative thought patterns in order to regulate my emotions. She was on board.\n\nWe’ve met bi-weekly since, and all of our appointments have been civil. I’ve begun to feel a bit frustrated because I feel like we haven’t been getting anywhere, because she hasn’t probed me very deeply. It’s felt sort of rudimentary, more like generic advice than actually getting to know me as a patient.\n\nI’ve been dealing with some depression and a ton of stress lately after a major career change, which has been the focus of our sessions lately. I’m angry with myself for not being productive enough outside of work, and it’s negatively affecting my mental health.\n\nAdmittedly I had a rough night last night so I was in a bad mood when I went to therapy this morning. All she’s been focusing on is trying to get me to stick to a routine, so when I bring up being angry with myself for not feeling motivated she gives me advice about meal prepping and buying a planner.\n\nI finally snapped today and said, “if it was as easy as packing a bag of gym clothes when I go to work then why would I be in therapy?” which devolved into her approach not being effective for me. I stated that I wasn’t looking for advice for developing a healthy routine because I want to address the root of the problem, which is the fact that I exhaust myself trying to regulate my emotions during periods of stress. I want to challenge my way of thinking and learn to talk myself down when I’m feeling upset.\n\nShe responded by telling me that she didn’t think I was “ready” for DBT until I developed healthy coping skills. She said, “I don’t think you can handle me being an asshole.” (Her word, not mine.) I said, “why do you think challenging someone’s thoughts when they’re destructive is being an asshole? Why is confrontation inherently bad when you’re considering someone’s best interests? Isn’t that a sign of respect?”\n\nAt this point she stopped engaging with me and said she was unwilling to delve into DBT until I developed a healthy routine. I asked her, “what if not everyone progresses in the same way? I’m telling you I would like to develop healthier thinking first and then focus on my routine” and she essentially said that if I’m not willing to try to work on my routine first then it’s not a good fit.\n\nI asked her, so you’re just going to tell every client who can’t stick to a healthy routine before actually getting to the therapy that it’s not a good fit, even though struggling with executive function is pretty much a trademark of poor mental health? And she said, “yes, because this is my approach.” So I told her that she was giving up on people who actually needed therapy, and that was pretty much it. She had her receptionist call me with options for a different provider a couple hours later.\n\nI mean, I was distressed during this session, yeah. I cried a little, but I was not yelling or being threatening or cruel. And mind you, my “routine,” is not all that destructive. I drink too much on the weekends and I’m about 10lbs overweight, maybe spend more time than I’d like on my phone, but I’m still highly functional when it comes to work/chores/finances. To me, it felt like I was advocating for the mental health care that would actually help me, and she didn’t like that I questioned her approach, rather than trying to tailor the therapy to me as an individual. Idk. Isn’t that what a therapist is supposed to do? Try to get to know the individual and adjust accordingly? Or was I being a jerk?",
    "score": 27,
    "url": "https://reddit.com/r/therapy/comments/1jwfsr0/am_i_wrong_for_thinking_its_unreasonable_that_my/",
    "created_at": "2025-04-11T02:49:26.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1mh776y",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "At 32, I still feel like a scared child pretending to be a man — even after therapy, success, and personal growth",
    "text": "I’m 32 years old, and from the outside, I’ve lived a “successful” life — top universities, elite jobs, driven personality. But deep down, I’ve always felt like a fraud. A scared little boy in an adult’s body.\n\nSince I was a kid, I’ve carried intense anxiety and a sense that I’m somehow defective. My father was angry, unpredictable — I learned to freeze. To stay small. I coped by achieving, performing, impressing. It worked — for a while.\n\nBut this year, I was diagnosed with **Type 1 Bipolar Disorder** after a manic episode destroyed my finances, relationships, and career. Now I feel like I’m starting over from nothing — more ashamed and confused than ever.\n\nDespite years of therapy, coaching, and personal development, I still feel like my *inner scared child* runs the show. He panics, he lies, he sabotages anything real. Then I drown in guilt and shame.\n\nSometimes I wonder if I have narcissistic traits too. I’m always so focused on how I’m perceived. Even when I care about others, I feel stuck in my own emotional pain.\n\nAt 32, I feel like life has passed me by. I don’t even know what I *actually* want anymore — beyond ego, validation, and pretending I’m okay.\n\nIf you’ve lived through something like this — trauma, bipolar, shame, inner child work, emotional collapse — I’d love to hear your truth. What actually helped you change, not just cope?",
    "score": 21,
    "url": "https://reddit.com/r/therapy/comments/1mh776y/at_32_i_still_feel_like_a_scared_child_pretending/",
    "created_at": "2025-08-04T07:43:04.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1hozjdq",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Something’s blocking me from doing ANYTHING for myself  - how’s that called?",
    "text": "I’m a male in my early 50s and my problem has always been the same: I can move mountains for my employer or my partner, or my kid or my parents, but it’s almost impossible to do anything just for myself. Like basic self care, or investing money, or going to a doctor or booking a vacation. \nI made quite the career in various MD positions, but hardly anyone knows my rotten private life. \nIt’s as if there is something blocking me entirely and it’s getting worse and worse. I tend to dream my life away, maladaptive daydreaming. \n\nMy childhood was ok, except I was sexually abused for 5+ years by a relative at the age of 8-13/14. Trauma therapist said I dealt with it, not a biggie anymore. \n\nSo what is it? Just codependency and low self esteem? Or do I secretly hate myself that much that I want myself to fail miserably? \nI going crazy over this. \n\nI’d really appreciate any hint on where to start ",
    "score": 17,
    "url": "https://reddit.com/r/therapy/comments/1hozjdq/somethings_blocking_me_from_doing_anything_for/",
    "created_at": "2024-12-29T16:28:26.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1oh2vem",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "How to stop being bitter?",
    "text": "I (37 F) need advice on how to stop feeling bitter. I am bitter and angry about so many things, but mainly, that my life didn’t turn out how I wanted it to. \n\nThe one thing I always dreamed of was of having a family. A loving husband, a few kids, the white picket fence…you know the deal. I didn’t care about wealth, or career, or popularity- all I have wanted for my entire life is a family of my own. \n\nThings didn’t work out that way. Long story short, I met a man who broke my heart, abandoned me and my child, I spun out of control into an addiction and lost guardianship of my child (I still have parental rights and visitation, but she doesn’t live with me). \n\nI am slowly trying to build my life after the events of the last 10 or so years. But I find myself angry ALL THE TIME. I’m angry when I see engagement and baby announcements from friends on Facebook. I’m angry when people talk about the fun things they are doing with their friends or family (I have neither).\n\nI’m miserable all the time, I’m jealous all the time. I hate feeling this way. I’m just so heartbroken that THIS is my life. I don’t understand how this happened. \n\nWhen I was younger in my teens and early twenties, I had tons of friends. Now, it’s just me and my cat every night. I feel like I am just going through the motions of life at this point, and honestly, am beginning to question if it’s even worth it. \n\nI feel like if I could just somehow let go of this bitterness and resentment I could be happier, but I literally cannot seem to do that. Any advice on how to stop being such an angry, bitter person? \n\nI am in therapy and have been for many years. But nothing ever seems to work / help. ",
    "score": 17,
    "url": "https://reddit.com/r/therapy/comments/1oh2vem/how_to_stop_being_bitter/",
    "created_at": "2025-10-27T02:20:02.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1l8i4r3",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Anonymous therapy",
    "text": "Hello, im looking for absolutely any advice of finding an anonymous therapist that would be cash only, no insurance, and no record of our session. Im 17 and currently working to become an airline pilot but because of the FAA attempting to recieve mental health treatment of any kind can cause me to lose my medical certificate effectively ending my career. I consider myself a very happy and mentally healthy person but I have a tumultuous relationship with a close relative and id like some professional advice/counciling on the topic, but I just have no idea where to start. I found a similar post on this sub from 3 years ago by u/pilot-throwaway321 and it had some good conversation but I had trouble finding more specific answers because it looks like the conversation moved to the pm's. It also seemed like both accounts arebt active any more so I cant get info from them. If anyone has advice or experience please let me know. I can also answer more questions if I missed anything. Thank you.",
    "score": 16,
    "url": "https://reddit.com/r/therapy/comments/1l8i4r3/anonymous_therapy/",
    "created_at": "2025-06-11T03:04:32.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1k1t3w7",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "So tired of constantly doing internal work while others seem live life and not just surviving",
    "text": "This is just a quick rant. I am so tired of dealing with my mental/internal shit. I spend so much time learning/identifying/managing/overcoming my triggers, shame, and hypervigilance. I feel so behind on life. I spend so much time learning and practicing emotional regulation. If I used that time and energy on my career or my projects, I could be much further ahead in life. I'm so tired of trying to stay afloat while others are thriving and living life. ",
    "score": 15,
    "url": "https://reddit.com/r/therapy/comments/1k1t3w7/so_tired_of_constantly_doing_internal_work_while/",
    "created_at": "2025-04-18T01:23:44.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1m7oemo",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "If you knew your therapist had their own mental health challenges/diagnoses, would it matter to you? Would it make you feel more comfortable? Less?",
    "text": "Context: I am a social work graduate student beginning my therapy practicum next month. I will be graduating with my Master’s degree this upcoming spring, and will be practicing therapy full-time for my career. I have multiple mental health diagnoses which I have completed lots of treatment for and am still going to therapy for &amp; taking my medicine. None of these diagnoses have ever compromised my ability to be professional or competent in the social work setting. Also, none of them cause me to become detached from reality (no psychotic disorders, hallucinations, delusions, mania, etc), and none of them cause any challenges w/emotional outbursts or anger\n\nQuestion: If you knew your therapist had not one, but multiple mental health diagnoses, what would your reaction be? Would you be concerned that this impaired their competence, or feel like “well if they can’t help themself, how can they help me?” Or “Well damn b*tch, you need more help than me!” On the contrary, would you feel more comfortable that they have real life experience? Would it matter WHAT the specific diagnoses were? \n\nDISCLAIMER: I will not be self-disclosing my diagnoses to clients as this would be inappropriate in 99% of clinical situations — and most therapists should not self-disclose their diagnoses to clients unless there is a very compelling clinical reason for them to do so that will help you — but I’m just saying in a hypothetical world if you COULD know their diagnoses. \n\nPlease be brutally honest — this will not hurt my feelings — if anything it will be helpful and educational for me. Thanks in advance! :) \n",
    "score": 14,
    "url": "https://reddit.com/r/therapy/comments/1m7oemo/if_you_knew_your_therapist_had_their_own_mental/",
    "created_at": "2025-07-23T23:14:51.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1k7shaq",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Graduated psych, trained in existential therapy. Watching it all fall apart.",
    "text": "Graduated with a psych degree. Did a year of existential therapy training too, thinking maybe I'd find something that actually helped. Some kind of answer. Something to hold onto. It didn’t happen.\n\nExistential therapy wasn’t what I thought it would be. You don’t sit there and talk about meaning or what it feels like to lose it. Therapists are just supposed to \"think existentially\" while doing regular sessions. Nobody actually touches the core of it. You’re alone with it, even there.\n\nI loved the philosophy side at first. I still do, in a way. But loving ideas about freedom or absurdity doesn’t fix waking up and feeling like there’s no reason to move. Sometimes it makes it worse.\n\nAnd somewhere along the way, clinical psych started to feel mechanical too. Pain started to feel like something you just manage, not something anyone really sits with.\n\nThe worst part? When I was falling apart, I reached out to the founder of the very existential therapy training I had taken. Someone I looked up to. Someone who had built their whole career on the idea that human suffering deserves to be met with honesty and care.  \nI asked if we could meet for just a few minutes — not a full session, just human to human.  \nI got told to schedule a £100 consultation.\n\nIt felt like even my collapse had a price tag.  \nIt broke something in me that was already barely holding together.\n\nNow I’m here. Halfway through a second year of training I’m probably going to quit. Not because I’m lazy or dramatic, but because I genuinely don’t know what I’m doing anymore. I can't find anything solid enough to build on. Can't even fake it.\n\nIt’s not sadness exactly. It’s not anger either. It’s just... like my whole system for why I should even try collapsed.\n\nIf you’ve ever been in this place ,not just sad, but emptied out,  what did you do?  \nDid you stay?  \nDid you find something to hold onto?  \nOr did you just learn how to float through it?\n\nNot looking for “you got this” comments. I just want to hear from someone who actually gets it.",
    "score": 13,
    "url": "https://reddit.com/r/therapy/comments/1k7shaq/graduated_psych_trained_in_existential_therapy/",
    "created_at": "2025-04-25T18:41:24.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1jhx9as",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I’ve never told my girlfriend the reason I stopped going to the gym is because I like it when other women look at me. I don’t know if I should tell her now.",
    "text": "So I've been struggling in my relationship for a while. I've been seeing my therapist since about September, mainly because I have communication issues but now it feels amazing to be able to articulate my feelings out loud.\n\nFor the past year or two we've been having sexual incompatibility issues. Sometimes she says it's because she wonders if she's asexual, sometimes she says it's because I'm not attentive enough, one time she said she wasn't finishing, but I get a new answer every time I ask how to improve things. She says she wants consistency from me, says she feels like one day I'm going to wake up and just leave her and she's afraid that every day will be that day.\n\nI've tried to remain consistent. I've tried working with her to accommodate her needs and feeling but I feel like it's never enough. When I try to remain consistent she says I'm love bombing her, when I stop trying she says it causes her to panic. She asks me to text her how I'm feeling but whenever I do it devolves into an argument where she's yelling and then either I shut down or she shuts down.\n\nI just want to feel desires. I stopped going to the gym consistently because, while living at my previous building, I'd always see this girl walking her dog and checking me out. Normally I'd chalk it up to me just wilding, because who would want me(?), but as I've grown in my career and as a person I've learned a lot of women do want a guy like me. I'm actually desirable.\n\nI stopped going because I felt like I wanted that at home, that if I worked with her and focused on us then I wouldn't need that kind of validation. My desire has only grown. I want to feel wanted. I want to feel loved. I want to come home to someone who still thinks I'm hot. \n\nWe've talked and she says things are getting better but I'm becoming resentful because I don't see her changing at all. I've asked her to see a personal therapist and she's done virtually nothing on that end (but I forgive her because I think of how many years I fought off the idea too). We saw a couples therapist once but now she gets upset (body language wise) when I mention it again because the time we tried she said she hasn't had an orgasm with me and I shut down because I'd been begging her to tell me what was wrong and what she needed in our sex life. \n\nI feel like she hasn't forgiven me for it. I mean what was I even supposed to say? \"You faked it pretty well.\", \"Why didn't you tell me that when I asked you time and time again what you need from me?\", \"Why am I just hearing this now?\", \"You won't even make yourself orgasm yet you expect me to do it?\", \"Maybe if you get your nose out of a book and actually try to HELP me then maybe just maybe we could solve this but you're so set on avoiding failure that you'd rather I look like an A-hole!\".\n\nI've gained about 17 pounds since we met, technically it's healthy because I was underweight, but now I look at myself in the mirror and I think \"What if she doesn't want you because she's disgusted by you? What if it's the man boobs? The jelly rolls? The lack of abs?\" and I want to just cry sometimes. I want to try going back but I'm terrified I'll fall in love with the first person who looks at me with an ounce of desire.\n\nI'm terrified that my coworker is right and I am actually attractive. I'm afraid that I'm right too. I'm afraid that if I get back down to my low weight she's going to want me again and if we do break up I'll never be able to get back to this point. I don't know what I'm doing.\n\nI'm 25, unhappy and all I want is to be able to cry in her arms and tell her to help me! I want to tell her I'm struggling and that I don't want to marry her until she's worked on her sex drive or helped me understand her better or helped me figure out what she needs.\n\nI want to tell her she's selfish for not getting help while knowing I'm struggling. I want to tell her that she's every bit as bad as she thinks she is because she's creating a self fulfilling prophecy. I want her to tell me that she's every bit doesn't want this anymore or get help or tell me what I can do to help her.\n\nI can't marry her or rather I can but I know I can't have kids with her. It's bad now but I know that I'll collapse in on myself if we have kids and she uses them as an excuse to never have sex again. I say collapse because I know I won't cheat, I can't do it. It's not because I love her too much or because I'm selfless or cheating is wrong. I can't do it because it would break a part of me that I want to keep, a part of me that's a dreamer and believes in hope.\n\nI can't tell if I'm venting or want advice anymore. I'm just in need of help.",
    "score": 12,
    "url": "https://reddit.com/r/therapy/comments/1jhx9as/ive_never_told_my_girlfriend_the_reason_i_stopped/",
    "created_at": "2025-03-23T11:34:30.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1l9j0y1",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "How did you know that being a therapist was the job for you?",
    "text": "I know most people are steered to their jobs by their interests. I had an interest in computers and guess what I have a career in IT go figure. So we're you always helping people figure things out or did people come to you for advice. What was your calling to become a therapist. ",
    "score": 10,
    "url": "https://reddit.com/r/therapy/comments/1l9j0y1/how_did_you_know_that_being_a_therapist_was_the/",
    "created_at": "2025-06-12T10:27:26.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1ofme7c",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "i need an outside opinion on the way my life is unraveling",
    "text": "i (F34) have been with my husband (M37) for 12 years. we have built a beautiful home with careers we enjoy and pets that are like our children. my husband is bisexual. this is something i have known since we started dating and it’s never been a problem because he’s been committed to me. he came out as bisexual about 6 months before we met and while i think he dated around a bit, he never had serious relationship with another man. a year ago his grandfather died. we were both extremely close with him and he’s been having a hard time coming to terms with it. \n\n\n\nlast week he told me that he’s been struggling with his sexuality. this was shocking to me because we’d had an extremely healthy sex life until about 3 weeks prior when he started have no sex drive. he went to the doctor about it and was diagnosed with depression and referred to a therapist. he’s been going to therapy for about 3 weeks now. i have since found out that he has also been having an affair with a trans man since July. we are getting divorced and i am devastated after being completely blindsided by all of this, but i am trying to make sense of it. there are just some major red flags with this situation that i am having a very hard time coming to terms with. and i am extremely concerned for his well being. \n\n\n\n1. his affair partner (AP) is also in a long term cohabitating relationship. they have an open relationship, but his partner does not know that AP has been having a relationship well outside the bounds of their relationship rules with my husband. \n\n\n2. AP is an LGBTQ+ specializing therapist. i personally feel like it’s a major ethical violation that someone in that profession is having an affair and breaking up two homes. i am also concerned that they have manipulated my husband into trauma bonding to them. his unique skill set would obviously be very helpful during a time when my husband is questioning things.  it’s a red flag to me that AP would not have encouraged him to seek counseling outside of someone he is carrying on an affair with, and i feel like it’s a conflict of interest to be both sleeping with him and coaching him through this self discovery. \n\n\n3. my husband is acting like someone who has had their memory wiped. it’s extremely bizarre. when i first asked him if there was overlap with him sleeping with both of us, he said no. he then went on to say that they had been sleeping together since July and he thought that he and i had not had any sexual contact since then. there have been at least 12 instances where my husband and i had sex during that time. i jogged his memory on a few of them (hotel sex on a trip out of town, etc) and he seemed genuinely baffled but eventually admitted okay yeah i guess i do remember that. he said our sex life had been boring for the last year and once again i jogged his memory about different things, stuff we did on a cruise earlier this year, sex on the kitchen counter etc. things that he again admitted he forgot about, but that he had enjoyed. he seems to be completely revising history to fit this narrative that he’s been unhappy for a year. \n\n\n4. he thinks he is in love with this person. he can’t go more than 24 hours without seeing them and he’s acting like a drug addict about it. yesterday we sat on the couch together for 3 hours sobbing and holding each other while he said i’m so sorry and i didn’t ever want this to happen. and then they texted him and a flip switched and he got up, took a shower, and then left early for work to go meet up with them. he practically turned into a zombie. he hugged me goodbye and said “i’m sorry i just have to go. i love you”\n\n\n5. through all of this, he is still telling me he loves me and doing many of the normal husband things he would do before. texting me through out the work day, etc. took my car to get the oiled changed, and made a new appointment to get tires put on it. \n\n\n6. i asked him if AP is leaving their partner too, and he said “they’re supposed to be” i asked him if AP will be moving into our home once i’m gone. he said “we haven’t got that far” their entire 3 month relationship has been stolen moments as they have both still been with their original partners too. they have no semblance of a real relationship and are acting like teenagers in love. i just can’t understand that the type of behavior from a mental health professional, and i can’t understand how that could possibly be a solid foundation for a relationship. \n\n\n7. leaving a 12 year relationship and going straight into another one with someone you have only known for 3 months is already crazy, but it’s even crazier when you consider the sexuality aspect. i am not transphobic and i whole heartedly believe that trans men are men, but AP has not had bottom surgery and it makes me wonder if this is a safe environment for him to explore being gay with a man who has hardware that he is still comfortable and familiar with. it just seems like it would make the most sense for him to at least be single for a while to date and explore as he figures it out. what happens if he feels like he missed out on having sex with someone with a penis?\n\n\n8. the no sex drive thing was not just a line he fed me to explain why it had been a couple weeks since we’d been intimate (we had also both been very busy with work) he was unable to be intimate with AP during that time and he thinks it’s because he felt so guilty his body was just shutting down certain things. if this relationship is so right, that doesn’t make any sense to me.\n\n\n\nat the end of the day, it’s not going to be my place to worry about him anymore here soon, but right now he is still my husband. i love him more than anyone else in this world and i know i will always love him. i am so concerned about his wellbeing and so afraid that this is going to end horribly. i know he has made bad choices and he is going to have to own those, but i just can’t shake the feeling that everything with AP is extremely sketchy and seems manipulative. he has no guarantee that they will leave their partner. he won’t talk to anyone in his family and he doesn’t have a lot of friends. we have lived a life where 99% of our day to day (outside of work and responsibilities) revolves around each other. we eat dinner together every night and we spend all of our time off together. we have been both lovers AND best friends for more than a decade. he has no family or close friends in the city we live in. i am planning to move across to country back to where i am originally from because i was only there because of him. so if this crashes and burns he has absolutely nobody and i am terrified of what he would do. \n\n\ni guess i just need an outside objective opinion on if any of this seems normal. obviously i am the jilted woman and emotions are high. ",
    "score": 10,
    "url": "https://reddit.com/r/therapy/comments/1ofme7c/i_need_an_outside_opinion_on_the_way_my_life_is/",
    "created_at": "2025-10-25T08:32:08.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1o96mrs",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "First ever Therapist experience. Help understanding if this is normal.",
    "text": "I would appreciate if you guys read all of this. I’ll be crossposting to other subs as well. Thank you.\n\nI’ve been going to therapy for about 5 months now but only gone to 6 sessions during that time. I go through my insurance and given its large health care provider, the best they can accommodate is one session per month and occasionally an extra session for appointments that have been canceled by other patients. \n\nThis was my first time going to a therapist. Ive been wanting to go for years but due to finance I have not been able to afford to. However, learning that my insurance covers therapy I finally got the change to go. I suspect Ive been suffering from dysthymia for years but that is still a self diagnosis. I wanted a therapist to help me talk through what may be wrong with me or just confirm my suspicions and help me tackle it. \n\nI was excited to finally get a medical opinion on my issues and hopefully get some answers. I was given a therapist with 30+ years of experience (she would constantly mention this) who is very kind and welcoming. We went through the intake and talked about what therapy is as it was my first time. \n\nDuring each session I was given the chance to provide information on my issues. I loved that the majority of the time I was the one talking (as it should be in my opinion) but given I provide so much in depth information I expected the feedback to be dense and tailored for me. Instead I received very general “solutions.”\n\nI left the sessions feeling underwhelmed and just saying to myself, “that’s it? Her feedback was common sense.” But given that I’m a new patient I thought that I may have to go through the simple solutions first before given anything with substance. Each session started ending the same and I was given again very obvious advice like “everyone is different” or “not everything is gonna go the way I planned.”\n\n She would hand me a sheet explaining CBT and give me a brief definition and not necessarily tell me how to specifically apply it to my issues. I just felt like I was giving her so much but I was not asked questions about it or I was not shown genuine concern. \n\nFor example, during a session I said my life felt monotone and I was living it instead it was passing me by. I got into depth how I have no interest in things and sometimes I just literally do nothing at home. Her response was that I was the one in charge of my life and no one else is going to change it for me which I completely agree and I said that its something I try every time because I really want it but to no success. I asked her but why is it that I’m like this. She said we would figure it out. Great right? The following session she would “forget” my detailed talks from the previous session and not continue where left off. I would instead just give additional information about my issues during the session which to she would essentially respond at the end the same way she responded the previous time. I just felt I wasn’t being heard or understood. \n\nIn one session, I had explained that I have a difficult time sticking to my goals or progressing through them. I told her there’s one particular goal I have that I’ve been working on for years but just can’t seem to continue. I mentioned all the techniques I’ve researched online to help me out. One in particular is to work on my goal for at least 5 minutes each day and not to overdo it. The following session we continued the goal talk as we chose to work on that issue first and at the end of the session she offered a solution: a sheet that explains how I should tackle my goals in bite size quantities. Literally what I had mentioned in the prior session. I didn’t mention that I had previously told her that I tried this but I just said I would try this again. \n\nA day before each session i am required to answer a questionnaire about how I’ve been the last few weeks which I always answer truthfully. I go through phases in my life in terms of mood. I can either be sad for weeks about my career, self esteem etc., or completely shutdown and have a whatever attitude about my life (giving up on trying to figure out my problems) OR I may be on “autopilot” where I’m aware life is just passing me by and I’m just riding the wave. This couple past sessions I’ve been answering the questions very mildly as in I’ve been anxious a few days a week instead of most of the week. Each week she sees how I’m progressing based off these answers. \n\nAnyway, in my last session I mentioned I was currently on autopilot and that when I’m in this I sometimes feel like a fraud or that I’m faking my other phases because I’m currently not in them. So I asked her that after these few sessions with her, how she felt about me being in therapy. I was genuinely curious to know and to see finally hear some direct feedback on particularly everything I’ve said to her. Her response was that she thinks I don’t need therapy BASED off my answers on the questionnaire each session. That clinically I’m fine and not depressed enough.\n\nHonestly, this left me dumbfounded. I suddenly felt hopeless because after years of not knowing what’s wrong with me and thinking therapy would be the answer- here is my therapist telling me I don’t need it. She instead recommended a life coach and webinars.. so I started asking her if certain things I said are normal like that it takes me a year at times to pick up working on my goal again. She said for ME that is normal and that’s because everyone is different and has their own pace. \n\nI feel like she never you touched upon on anything I said directly. She constantly forgot details that I deemed important. \n\nI feel like I’m on my own on this now. And that I’m going to have figure it out myself and that I’m probably being dramatic in everything I’ve said because an expert told me the hard truth. Like I genuinely believe that I’m actually a fraud now. I have no idea what to do. If this is the case, then I’ll accept it. It’ll be a hard pill to swallow but so be it. \n\nI am willing to accept this if she is actually correct. But reflecting back on my sessions with her, I don’t know anymore. Now I’m here on Reddit asking because I do not know anyone else with experience in therapy to give me some advice on what my next step should be. \n\nShould I seek another therapist for advice (within same provider) or does she have a point and follow her recommendations?",
    "score": 10,
    "url": "https://reddit.com/r/therapy/comments/1o96mrs/first_ever_therapist_experience_help/",
    "created_at": "2025-10-17T16:52:13.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1oh5us1",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "My Father's Therapist is Crossing Lines",
    "text": "My (33f) father (59m) has always been difficult. He is a severe alcoholic and has a temper, but it's always been manageable and he gets back on the wagon every few years. This last time my father got back on the wagon, it seemed to be going quite well. He was rebuilding his relationship with me and working on that with my siblings, who were both low-contact due to my father’s behaviour.\n\nAs part of his self-improvement efforts last time, my father started seeing a psychotherapist. We were all extremely proud of him for seeking therapy and trying to improve himself. He went on antidepressant medication, and we were starting to see a really great side of him.\n\nAbout four months ago, out of nowhere, my father announced he was divorcing my stepmother (55f), whom he’d been married to for over 30 years. She was as bewildered as the rest of us. At first, it seemed amicable, they were living in the same home and working on the division of assets.\n\nSuddenly, my father bought a fancy car, cut off my siblings entirely, and became extremely volatile toward my stepmother and most members of my family. He began labelling everyone around him as “narcissists” and spouting paranoia that everyone was against him because they were narcissistic. He told me that his therapist had identified “narcissistic tendencies” in the people in his life, and that he had realized he was being abused by everyone around him, including his own father, my siblings, and my stepmother.\n\nHe began being extremely spiteful toward my stepmother, including blasting music at all hours of the night, moving people into their shared home without permission, and hiding her vehicle so she couldn’t use it. It got to the point where I had to loan her my vehicle so she could get to and from work. He recalls these actions and laughs, thinking he’s justified after putting up with “30+ years of narcissism.”\n\nI’ve tried to speak to my father about his recent changes and actions, and he stated that his therapist agrees he needs to “take his life back from the narcissists,” and that she has been sharing her own personal stories about dealing with an ex-partner who was a narcissist. I explained to him that this behavior from his therapist is highly unprofessional; she’s lacking professional boundaries and making blanket diagnostic statements about people she’s never met. I told him I was worried about her ethics and her influence on him.\n\nTwo weeks later, he told me that he had spoken to his therapist about my concerns, and she labelled them as “out of date,” claiming that therapists should share personal stories so their clients can relate to them. I explained to my father that I’m a registered social worker and have worked with many psychotherapists in my career. They all agree that professional boundaries are extremely important, and I reiterated my concerns about his loyalty and attachment to this therapist. His exact reply was, “I think I’ll take the word of a professional psychotherapist over you.”\n\nThis woman is encouraging my father into a self-isolating hole, and I’m extremely worried. He has become so volatile that I’m close to going no-contact for the sake of myself and my child. His revelling in his abuse of my stepmother and his over-the-top reactivity toward everyone is too much. He hasn’t turned on me yet, but it’s only a matter of time.\n\nI’m sad and depressed all the time. To see my father become cruel was not something I ever expected, and I’m really struggling with it. I’ve tried to explain that to him, and his only response is, “I’ve decided to be happy, and I want your support in that.” If his happiness is achieved through cruelty, I want no part of it.",
    "score": 10,
    "url": "https://reddit.com/r/therapy/comments/1oh5us1/my_fathers_therapist_is_crossing_lines/",
    "created_at": "2025-10-27T05:00:59.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1n38w53",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Would you do more therapy if it was affordable?",
    "text": "I’ve always felt therapy was too expensive for me.\n\nOut of frustration I did a ton of research and eventually found some really good, English-fluent accredited therapists abroad who charge a fraction of the local price.\n\nNow I’m able to do weekly sessions on my very modest salary, which would have been unthinkable before.\n\nIt got me wondering:  \n– Would more people here consider therapy if pricing wasn’t such a barrier?  \n– Do you think lower-cost therapists from abroad (with proper credentials) could ever be trusted/accepted?\n\nCurious what others think.",
    "score": 9,
    "url": "https://reddit.com/r/therapy/comments/1n38w53/would_you_do_more_therapy_if_it_was_affordable/",
    "created_at": "2025-08-29T14:26:05.000Z",
    "num_comments": 13
  },
  {
    "id": "reddit-1kxzh1f",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I am an abuser and I need help",
    "text": "I want to be a good husband. I don't try to control what she does or who she talks to. I trust her completely. I'm a loving and supportive husband other than what I've wrote about below. I'm a good father to my children. I never thought I was capable of violence against someone I love.\n\nBut I have a problem with my anger. Possibly also with the way I view things. I made another post where I talked about what happened with my wife. We were in the car and she got mad at me for something. I tried to explain that it was a misunderstanding and she kept talking over me and not letting me ever finish even a single sentence. I eventually stopped silencing myself when she would cut me off and instead started raising voice over hers any time she spoke over me. She in return began raising her voice until it got to the point we were shouting at each other. Eventually it lead to me calling her a \"f-ing moron\" at which point she slammed on the breaks, took the keys with her, and told our children to get out of the car. I got out of the car and in an attempt to stop her pulled her off the door and she fell to the ground.\n\nI'm not here to sugar coat anything. I did what I did and I'm deeply ashamed of it. Years ago this kind of thing would happen more often. I took anger management and learned a lot on how to keep things from escalating. It used to happen often and then it didn't happen again for years until a couple weeks ago during the incident I just described. I truly thought I had grown and become a better person. I should have realized it sooner from arguments that didn't result in abuse that were still worse than they should have been. It is incredibly hard to realize you're the problem if you always feel like the victim.\n\nI'm going to try to describe what's going on in my head when situations like these occur. I don't mean any of this to come across as an excuse because there is no excuse for what I did.\n\nIt is a very common thing for her to cut me off and not let me speak. When she does this I get upset. It makes me feel like she doesn't value what I have to say at all and feels makes me feel small. I try very hard to make sure that I allow her to finish what she is saying before I respond, although I'm not always perfect about it, I often catch myself and say \"Sorry, I shouldn't have interrupted you. Please continue.\" I think part of the reason I do this is because I know how much it upsets me when I am talked over.\n\nSo I am talked over and it makes me really upset. I'm not quite sure how to pinpoint what it is exactly that I'm feeling but almost like a sense of betrayal? Like she's my partner and we're supposed to love each other so why is she treating me like what I have to say isn't important to her? So in my head I see this as her escalating the situation and I end up blaming her and I have a lot of built up resentment towards her doing this so often. I would say out of all of our fights that turned into big fights almost all of them were because I got so upset about being interrupted and talked over.\n\nBut another Redditor pointed out in another post that it was in fact *me* who was escalating the situation by getting louder. I think they do have a valid point and I don't understand why that was so hard for me to see. I saw as escalation and felt like the victim because I saw talking over me as the escalation.\n\nThen there is the physicality. When that has happened it's again a **VERY** intense feeling of betrayal. It's less that I'm angry and more that I'm lashing out and I'm just feeling so much pain. It's like my rational mind just completely shuts down and I'm acting on a primal level. I understand what I've done is deeply wrong. I want to be better. I just have no idea what to do to change who I am and how I view and react to things. I hate who I've become.\n\nThe crazy thing is she was STILL willing to work things out with me even after what happened two weeks ago. But I started ruminating on it and started feeling more and more resentful towards her for always talking over me and I started blaming her in my head for what happened. That if only she would treat me with the same dignity and respect I treat her then I never would have gotten upset in the first place and things never would have gotten to the point they got to. So I started withdrawing and showing her less love and affection because I genuinely felt wronged too. She noticed this and when she confronted me about it I told her I felt like she has been emotionally abusive to me all this time. That I feel like I can't come to her and talk things out with her because she always gets mad when I do and it turns into an argument. I'm not saying I'm right but that this is what happened and it's the conclusion my brain brought me to. There wasn't any arguing or fighting. I realize that it was wrong. After all of that I went for a run to try to clear my head. When I returned an hour later she was gone. She had gotten a police escort and taken the kids to a local women's shelter. I don't blame her. She did the right thing.\n\nI don't know if any of the rest of this is relevant to how I am but I'm going to include it just in case. I had an awful childhood and was often physically abused by both of my parents. I was also heavily bullied throughout my entire school career. I didn't have my first friend until middle school. I was really small and nerdy and the girls I liked never liked me back. Not long after I turned 21 I was drugged and raped by an older man who I thought was my friend. I've spent most of my life feeling unbearably lonely and unhappy until I met my wife. I've always been kind of an awkward person and I find it extremely difficult to make friends because I have a hard time relating to anyone. The friends I do have are friends from high school and I'm 33 now. One of my friends is friends with both of us and tells me he knows I'm not a bad person but I need help. What can I do? I don't want to be like this anymore.",
    "score": 9,
    "url": "https://reddit.com/r/therapy/comments/1kxzh1f/i_am_an_abuser_and_i_need_help/",
    "created_at": "2025-05-29T02:20:26.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1m0h9u9",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "First world problem?",
    "text": "In my most recent session, my therapist asked me about what has been bothering me lately. I began to tell her how I often feel unsuccessful professionally and that I wish I was further along in my career or had “blown up”.  She thought for a second after I was done, and said (not exactly but I can’t remember every single word) “imagine all these people in third world countries who can’t even think about things like this. What a first world problem”. \n\nI immediately felt shame but then miffed that she would say that to me after asking for my feelings and my truth. My husband agrees that this was dismissive, but I was hoping for others thoughts? \n\nI have been considering switching therapists for a while, and this might have been the final bit to push me that way…",
    "score": 9,
    "url": "https://reddit.com/r/therapy/comments/1m0h9u9/first_world_problem/",
    "created_at": "2025-07-15T13:06:38.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1pukqb7",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Ultimatimum; Therapy or divorce",
    "text": "I have been asking my Husband to go for therapy for a really long time because he obviously has issues. I myself was in therapy and recently restarted again due to some problems. My therapist asked me, as a final act to give an ultimatum; Ask him to go for therapy or let him know that you can’t see the marriage working out. My husband who says he loves me (Even though i feel it no sense) said that he’d rather proceed with the divorce as that is what I want and he’ll make it easier for me but will never go for therapy. Make it make sense, How can a person be so against therapy and rather choose to end the marriage than go and sit for a few sessions to see if things will work out. He kept saying that he doesn’t want to be with someone who feels stuck in the marriage. Is there anyway I can convince him? He’s blocked me everywhere and we’ve been doing long distance due to career choices but was planning to end the distance soon. ",
    "score": 6,
    "url": "https://reddit.com/r/therapy/comments/1pukqb7/ultimatimum_therapy_or_divorce/",
    "created_at": "2025-12-24T10:53:42.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1km42i2",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Tired of being obsessive",
    "text": "My entire life I can remember everyone absolutely hating me, I think this contributed to my such strong attachments romantically for people and I absolutely hate it. I feel like I’m way too obsessive to the point where I find myself focusing on the person I take interest in 24/7. \n\nI haven’t gone more than a few days without finding a new person to obsessive over in order to keep me sane. I’m not sure if I just do it on instinct or if I’m forcing myself to take interest in people so often. \n\nI’ve liked this boy for about 5 months, I cannot seem to let him go no matter how much he is stand offish to me. All I can imagine all day is “our” future. A house with kids and careers, I feel like I’m crazy, I rarely talk to him at all. I just hate how he’s the only thing in my mind all the time. \n\nI feel like I’m crazy for being like this and it’s driving me insane. The fact he’s not near me causes me to have mood swings and extreme feelings of something like a craving or sadness\n\nI really hate that I’m like this and I wish I could change. Nobody understands my feelings, not even my friends. ",
    "score": 6,
    "url": "https://reddit.com/r/therapy/comments/1km42i2/tired_of_being_obsessive/",
    "created_at": "2025-05-14T02:15:00.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1oy248q",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "Dating an actor with intimate scenes, advice?",
    "text": "I’ve been dating my girlfriend for 10 months. I’ve realised I have an anxious attachment style. We’re long distance, so I only see her for part of a weekend every fortnight, which doesn’t help.\n\nMy family are actors coincidentally, but I’m not (I met her at a bar). This is the first time this kind of dynamic has come up in the relationship.\n\nShe’s currently doing ‘The Vortex’ by Noel Coward at university. She’s playing Florence, and they’ve worked in that her son, Nicky, sexually assaults her at the end of the play. She’s wearing quite vulnerable 1920s night wear with suspenders as this happens. Today she called me saying she was just in the shop buying neutral underwear because she’s realised that you can see through her nightwear with the lights. Next week I’ll be going to see it with her mother, father, sister and friends in an intimate space, so might be a little uncomfortable for all of us.\n\nHaving said this, it’s been making me feel irrationally anxious; out of proportion. \n\nI’ve discussed this with her about a month ago the idea of intimate scenes in theory, and she was quite overwhelmed because this is her first time dating someone, so was the first time that this came about in theory. She took a day off from speaking with me to process it. Since, she has been understanding. She said if she did have to play a Blanche Dubois type of character that had a scene like that at the end of the play, she’d think about it a lot and come to a decision and keep communicating with me.\n\nHaving said that, a couple of weeks later, she fleetingly told me about the sexual assault scene getting added in during the production, getting pinned to the bed and that she’d be wearing suspenders (it isn’t in the script).\n\nI was recently diagnosed as autistic, so think I kind of need things in black and white so I can mentally prepare for them. I’ve found that it’s been making me feel anxious about the next iteration of it developing because they come up with these things in rehearsals, and she has been working on this for two months, so have been feeling this way pretty much every other day during that time, I’ve noticed it’s really affected my mental health (not to sound like a victim at all). I suppose it’s that sometimes I’m not mentally prepared to hear something that is quite a lot to process, and the anxiety that there could be a new iteration at any moment leading up to the show is really what makes me anxious. \n\nI spoke to her again after the sexual assault iteration and she said she gets it and that I’m a very caring person, and was joking around about her dad seeing her in suspenders. \n\nI of course want to keep communicating, and we’ve been really good about communicating in the past, but then at the same time I don’t want to keep harping on about it because she won’t want to do anything that hinders her career, and I don’t want that for her either, so the result is that it feels like my feelings are clipping her wings. The last thing I want her to do is to freeze on stage because she becomes self conscious (which I’m also anxious about), but then imagine that she would be really upset if I didn’t come and really disappointed in me. Aesthetically for her family and friends, this will come off pretty bad too. I just wish I could snap my fingers and get over it. \n\nThe actor that plays Tom, her boy-toy younger lover, I have reservations about. She told me that he ‘does alright with the ladies’ and used to fancy another actor on the course that is now dating another actor on the course, his best mate, so wonder morally how aligned he is. He comes off really quite flirty / charismatic, but I think my girlfriend likes that type of character. This upsets me, as I’m really the opposite of this type of character, so perhaps feel inadequate when she bounces off of this energy. \n\nThey have multiple intimate scenes, pump faking kisses and a lot of physical touch. \n\nShe was also telling me about an actor on her course who is simultaneously doing another play, and has a kiss scene, but complained to the director because the actor isn’t ‘loving them back’. I think this made me lose trust in all of the actors’ professionalism on the course, to an extent. I trust my girlfriend a lot, but the anxiety comes from the fact that I can’t trust the professionalism of the other actors, as they are all early 20s students, so may not fully have matured yet. \n\nI’ve been through all of the things about it being mechanical and that there is an intimacy coordinator and that it’s the character doing these things not them, etc. I’ve read up a lot about it, but for some reason (not sure if it’s because I’m autistic), I can’t seem to reframe it in my mind. \n\nI’m conflicted in the sense that I really truly want to support her in her career, and have been helping her run lines across loads of days (doing full 90 minute runs with her every day at the moment). I plan to go and bring her flowers and celebrate with her after. \n\nI want to help her by running the lines, but the scenes bring out quite visceral emotions for me, where for her, she doesn’t overthink it because she’s in the actor world and is trying to create an illusion, which I completely understand. For some reason, I can’t seem to detach myself from the anxiety of watching her do a recreation of a sexual assault in lingerie with her dad sat next to me, (who I barely know!)\n\nAfter next week, I won’t have to worry about this for a while, but I think it’s always going to be an underlying anxiety of it coming back around, and that if she gets booked on a job where there’s potential for that kind of thing happening, I’ll kind of just have to wait until the final day to know if that kind of happening, as these things get worked in during rehearsals, which I think is quite unhealthy for an autistic person. \n\nI of course don’t want to enforce any situation where she needs to feel like she needs permission or anything, so I guess it’s always going to be told to me in a more matter of fact way. I think I would just crave it to be told to me with more sensitivity, but I really fear her coming to think that I’m being a really insecure boyfriend if I expressed that (which I understand that I am but want to get over).\n\nIt feels like a real shame as we really get on, I love her dearly and definitely get on with her otherwise. I believe she really trusts and loves me equally; she always sends me memes about how loving and caring I am. I want to give myself grace in the sense that I don’t think I’m trying to control her, but essentially just want this anxiety to go away and have it irk me less so I can support her career and watch it blossom. \n\nBecause I haven’t been able to express this, in the risk of making her self conscious during this run, I notice how I’m shutting down and internalising feelings, which she notices but thinks is to do with something else. As it festers, I notice it then turns into more hyper sensitive thoughts which are completely irrational, questioning every little thing in regards to my trust in her, which would be classed as toxic and I really really want to stop as it’s so unhealthy. Again, she really doesn’t know about these thoughts and I don’t express them, choosing to be supportive of her whatever she does.\n\nIn regards to the anxious attachment, I’ve also felt similar emotions when she’s been out on drinking holidays, so want to reiterate that I don’t think that she’s doing anything wrong, but a lot of this stems from my own anxious attachment styles. \n\nHas anybody been in a similar position, struggled with this, and then was able to get over it? Did you get used to it? What kinds of tactics did you use to help you reframe it in your mind? Does it get easier after the first one? \n\nI would really appreciate if you'd be able to find it in yourself to not villianize me for this and offer productive advise as I really am trying to make an effort.\n\nTL;DR I’m dating an actor that has intimate and vulnerable scenes - have you ever experienced this? What tactics did you use to reframe it in your mind? ",
    "score": 6,
    "url": "https://reddit.com/r/therapy/comments/1oy248q/dating_an_actor_with_intimate_scenes_advice/",
    "created_at": "2025-11-15T20:32:19.000Z",
    "num_comments": 1
  },
  {
    "id": "reddit-1nuf5hz",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "I'm an apathetic little bitch and I dont care. Is there somethign wrong with me?",
    "text": "Im 17 (f) and rn I live with my mom dad and 3 little siblings until i go off to college which is early 2026. I go out to clothing stores and such about once every month, id say, but the rest of the time Im in my room studying and practicing music for auditions. I dont have any in-person friends, maybe 1 or 2 people I talk to causally online but thats it. The only people I interact with are my piano and singing teacher, over zoom.\n\n Quite often, my mom and siblings and I take driving trips and since shes bad at navigating roads and highways, I have to help her with google maps. And she asks the dumbest questions like \"HOW MUCH LONGER DO WE HAVE TO GO?\" \"WHAT DO WE DO AFTER WE GO 14 MILES\" then I say \"You make a right turn at such and such rd.\" then she says \"And then what?\" Then I say \"then you go straight for 5 more miles.\" then she says \"AND THEN?\" Then I tell her the rest, but its pointless because she forgets it anyway and then I have to repeat it, so then I get frustrated and snappy and say \"I'll LET YOU KNOW WHEN, OK! JUST STOP ASKING ANNOYING QUESITONS!\"\n\nAnd the only reason she puts up with me acting that way is because she rlly needs my help.\n\nAnd then, she suggests letting my 10 yr old brother help instead, but he tells her the WRONG THING and the drive is much much longer\n\nthen, when we get to our destination, she usually lectures me about how Im acting in an unsatisfactory way \"JUST LIKE YOUR FATHER\" which in, he DOES act that way and hes kind of emotionally abusive because hes got issues and thats considered like a degrading insult in our household, to be told that we are acting like him, and I used to be rlly upset when she told me that but now, I dont care and I just sit there and let her words bounce off me and let my mind wander off until shes finished, and then she is like \n\n\"If IM YOUR MOTHER AND IM TELLING YOU I DONT LIKE THE WAY YOU'RE TREATING ME, THEN THAT SHOULD MEAN SOMETHING TO YOU, BUT YOURE ACTNG LIKE YOU DONT CARE AT ALL AND THATS CONCERNING TO ME, LIKE YOU NEED THERAPY OR SOMETHING!!\"\n\nI dont rlly hate her, id say, shes ok, but shes not my favourite person in the world, partly because somestimes when she catches my crying about soemthing, she pries me to open up to her and then when I do, I instantly feel like Ive made a mistake because of the way she reacts\n\nAnd then, after shes done lecturing she says \"WELL WE'RE GOING TO HAVE TO PUT A PAUSE ON PIANO AND VOICE LESSONS UNTIL YOU LEARN TO BETTER APPRECIATE YOUR FAMILY, BECAUSE I BET YOU DONT TALK TO MS. EVELYN THAT WAY (she said that because ms. evelyn's my favourite instructor)\n\nHow the hell am I suppsoed to appreciate my family when I hate my younger siblings, they are all brats, My second youngest brother who is nine, is a total jerk and makes me so mad sometimes I fly at him and hit him and pull his hair as hard as I can, which I feel is justified because he hits me first half the time\n\nmy little sister complains over stupid stuff like someone brushing their foot against hers accidentaly in the car, and my other brother plays victim around my mom and acts like Im some sort of big bad wolf to him, (which im not) because he hardly does anythign to annoy me.\n\nMy mom also says I act ungrateful, and snobby, and thatI dont care about anyone and that im not nice to anyone and that im just a nasty person in general. I only do that because I dont want to seem like a corny, cringe \"OMG TYSM\\~!!!! I LUV EVERYONEEEEE!!!\" Kind of person\n\nbut I guess that does make me seem snobby and ungrateful soemtimes because Ms. evelyn was helping me a whole lot with college audition pieces and giving me and extra FREE 30 mins of lesson time and giving me career advice on top of that, and assured me that she would fully support me and would do everything she could for me to pass the auditions, and I just realised now I didn't even bother to thank her, but its too late to do that now, right? because now she probabyl thinks Im acting like \"Yeah BITCH THATS UR JOB SO DO IT! IDC!!!\" but she still is helping me, IDK WHY THO\n\n  \nANYWAY\n\nI DONT CARE WHAT MY MOM SAYS, I JUST CANT WAIT TO GET AWAY FROM ALL OF THEM\n\n",
    "score": 6,
    "url": "https://reddit.com/r/therapy/comments/1nuf5hz/im_an_apathetic_little_bitch_and_i_dont_care_is/",
    "created_at": "2025-09-30T14:45:59.000Z",
    "num_comments": 6
  },
  {
    "id": "reddit-1p62yd0",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "It’s time to end it…..",
    "text": "My session today made me realize it’s time to end my long term relationship. I didn’t realize how much of my true self I left behind for the sake of just being stagnant and being a version of myself that was deemed “acceptable”. \n\nMy therapist helped me realize that not being my authentic self is stunting my growth overall. Missing out on meaningful platonic friendships, a life of fun, and career progression is not worth me sacrificing if I’m not happy. \n\nRelationships are great but a word of caution to the masses is to not lose your true sense of self over the course of building a life with someone else. ",
    "score": 6,
    "url": "https://reddit.com/r/therapy/comments/1p62yd0/its_time_to_end_it/",
    "created_at": "2025-11-25T04:16:13.000Z",
    "num_comments": 0
  },
  {
    "id": "reddit-1ky8jbx",
    "subreddit": "therapy",
    "soc_codes": [
      "21-1011",
      "21-1013",
      "29-1125"
    ],
    "title": "A girl basically ruined my life. But for some reason, I still care about her.",
    "text": "I work in social media and content creation.  Basically my face is all over the internet. Even sometimes on local subreddits. But it all changed when I met a girl. I've talked about this on an old post of mine... But basically she accused me of r**ing her and posted it online. I've managed to cleared my name... But not without loosing a lot of friends and closing down some of my social media accounts. It also effected my career and I had to move to different company and cover up my face, creating a new identity because of it.\n\nShe basically forced me to wear a mask for the rest of my life. But for some reason, I still wish things didn't ended the way it did. I wished that we were on good terms. That we didn't have to be enemies. Because deep inside, I know she was just scared that because I found someone else, she had abandonment issues.\n\nI don't understand why. Because I know everyone else in my position will be pissed at her if they were in my position. But for me... I want to help her get better. I don't know why. I don't understand why for the life of me that I can't find it in myself to hate her. And I don't know why I am so forgiving. I want to hate her. I know I should. But I don't feel any hate towards her. I know I'm with someone else now. But I still hope she's not tearing herself and everyone she meets apart. I don't want her to hurt herself. I don't want anything bad to happen to her.\n\nPeople tell me I have a saviour complex, but I don't think that's it. I just can't bear to let others suffer. Even if they've wronged me. My family kicked me out because I didn't let my dad beat my little sister up. I was bullied multiple times in my life, even got robbed and beaten by people I know. But I just never feel hatred to anyone who wronged me. I don't even hold grudges. And when I refused to make a police report on the woman who accused me of r***, many of my friends decided to leave me. Telling me I'm spineless. And that I am the reason many men are getting abused today.\n\nI don't know what I should feel anymore. But for some reason I don't wanna give up on people and only with the best for them. Even if they ruined my life. Even if they caused me a lot of suffering, I just can't hate people or hold any grudge against them.\n\nIs this normal? Or I'm just emotionally dead?",
    "score": 5,
    "url": "https://reddit.com/r/therapy/comments/1ky8jbx/a_girl_basically_ruined_my_life_but_for_some/",
    "created_at": "2025-05-29T11:36:32.000Z",
    "num_comments": 2
  }
]