[
  {
    "id": "reddit-1hthm71",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "It finally happened to me! ",
    "text": "I’ve been a vet tech for 21 years, I never thought I would live to experience this question.\n\nA client asked me if we were sure that his cat was a male. I looked puzzled because he was a long time client and his cat was like 15 years old, we also neutered him as a kitten.\n\nI asked him why he thought we were wrong about the cat being male. He looked at me, completely straight faced and said “I can feel her nipples”\n\nI explained to him as professionally as possible (even though the inner child inside me was screaming to get out to laugh hysterically) that males have nipples too. \n\nI’ve been asked some incredibly odd questions over the years, I just thought the nipples question was an urban legend.",
    "score": 512,
    "url": "https://reddit.com/r/Veterinary/comments/1hthm71/it_finally_happened_to_me/",
    "created_at": "2025-01-04T16:09:13.000Z",
    "num_comments": 39
  },
  {
    "id": "reddit-1jgyiqb",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Coping with Anesthetic Death",
    "text": "Had a pretty awful day today. I'm a newer grad (class of 2024) and I just had my first anesthetic death. The patient was brachycephalic but super inbred (pocket bully). Everything anesthetic-wise was going well - I changed my protocol for him to try and reduce respiratory depression (dex, torb and induction w/ ketamine and midazolam). Vitals were all stable and wnl during anesthesia. The surgery was ~30 minutes long and then we recovered. We had two doctors with him at all times - I was monitoring anesthesia as we have a new tech who is not registered yet so I don't let her monitor alone and the other dr was doing surgery. I went to recover and noticed he was turning blue...started manual ventilation immediately, along with CPR as his heart rate was decreasing plus epi and atropine. Drugs were also reversed immediately and he was never extubated. But we lost him and it hurts so much. The owner is obviously not happy (paid $5000 for the dog) and I'm scared. I feel like I killed him. I don't know how to cope\n\n  \nEdit: Thank you all so much for your kind words, support and advice, I needed it ",
    "score": 494,
    "url": "https://reddit.com/r/Veterinary/comments/1jgyiqb/coping_with_anesthetic_death/",
    "created_at": "2025-03-22T02:38:29.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1i9qc3k",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "I am morally against TNR",
    "text": "I've spent my entire career after vet school in the ER/ICU, but before that I worked in the shelter system and of course did my time in my school's TNR/shelter medicine program which was a big part of our curriculum, before people tell me I just need to go spend time in a low cost clinic/shelter and I'd understand. \n\nFor the life of me, I can't wrap my head around how TNR is in anyway ethical or aligns with the oath we take to act in the best interest of our patients. Maybe it's my perspective as an ER vet, but there is just nothing ethical about releasing a cat to freeze to death, be bit by a car, die of preventable diseases, etc. Not to mention the absolute decimation of native wildlife, public health risks, property damage, etc. Not to mention, the vast majority of the \"feral\" cats I came across working in shelter med were not even feral. There's also plenty of research about the ineffectiveness of TNR. \n\nWe speak about humane euthanasia being the best option for many of our patients, so why are we so opposed to it for feral cats (as in those of us in vet med, I understand the public doesn't view humane euthanasia the same way) We don't just release stray dogs that are unable to be socialized and placed in indoor homes, right? Why is releasing cats to die a painful drawn out death somehow viewed completely okay in our field? \n\nIs there anyone else in the field that feels this way? \n\nI am genuinely open to changing my perspective and hearing from other view points from others in the field from others about TNR, just looking to have a healthy conversation about the issue among those of us in vet med. ",
    "score": 427,
    "url": "https://reddit.com/r/Veterinary/comments/1i9qc3k/i_am_morally_against_tnr/",
    "created_at": "2025-01-25T16:13:50.000Z",
    "num_comments": 695
  },
  {
    "id": "reddit-1mfefuf",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "When will Marty Becker be held accountable?",
    "text": "For years, colleagues—especially women—have voiced concerns about his outdated, ego-driven, and often inappropriate behavior. From credible reports of sexual misconduct to allegations that his “Fear Free” empire was built on the uncredited work of Dr. Sophia Yin, a brilliant Asian veterinarian whose legacy deserves far more respect than this industry has given her, Becker has repeatedly been elevated while others are silenced.\n\nVeterinary Practice News recently published a commentary so disconnected from the current state of veterinary medicine, it felt like a parody. In it, Becker dismisses modern diagnostics in favor of “Star Trek”-style intuition and resurrects tired boomer-era tropes about younger veterinarians being lazy or “unwilling to work.” This kind of rhetoric is not just insulting—it’s dangerous. It undermines the challenges this generation of vets is facing, from burnout to student debt to the evolution of the human–animal bond, where pets are now treated as family members, not property.\n\nWhat’s worse? VPN quietly pulled the piece after backlash—no editorial transparency, no accountability, just protectionism. Every person Becker named in that article was a man. Every outdated take he espoused was left to linger, unchallenged, until public pressure made it inconvenient.\n\nAnd now, he’s publishing delusional self-promotional content calling himself “America’s Veterinarian”? Enough.\n\nThis profession deserves better. Elevate new voices. Honor the legacies we stole from. Stop giving egotists like Becker a pass because they have a platform.",
    "score": 392,
    "url": "https://reddit.com/r/Veterinary/comments/1mfefuf/when_will_marty_becker_be_held_accountable/",
    "created_at": "2025-08-02T01:47:45.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1okw9zm",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Will this tattoo screw up my chance at a job?",
    "text": "Hey everyone to cut a long story short I got a tattoo of a cat smoking (photo attached) maybe a year/ two years ago. I’ve just been offered a job at a really big important veterinary. I’m only administration/ reception but this is my first job in veterinary. I went in today to hand in my passport for right to work checks and they also gave me a tunic to try on which shows my tattoo on my inner arm. I’m not sure if I’m just stressing myself out for nothing or if I should be legitimately worried about it. Please someone let me know!",
    "score": 296,
    "url": "https://reddit.com/r/Veterinary/comments/1okw9zm/will_this_tattoo_screw_up_my_chance_at_a_job/",
    "created_at": "2025-10-31T14:35:36.000Z",
    "num_comments": 66
  },
  {
    "id": "reddit-1ii3e54",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Dating a veterinarian, I'm not sure if our relationship is sustainable because of their work life balance, looking for input from others in the field.",
    "text": "I have been dating a veterinarian for about six months now; we have grown very close during this time; however, by far, the most significant strain on our relationship is their work-life balance. They are up at 5:30 am every day, out the door at 6:15, at the office til 7 pm, then work on completing their records at home til 11 pm, only to do it all over again the next day. \n\nThe records typically spill over onto Saturdays as well, meaning the first half of the day is spent waiting for them to finish so we can have some time together. They are under enormous stress and pressure and care deeply for their patients. They are working at a national pet healthcare company about a year and a half out from vet school. \n\nThey are incredibly smart, caring, and genuinely compassionate, but it's a schedule that I feel is neither healthy for them nor our relationship. I am incredibly proud and supportive of the work that they put in, and it is more important than anything I have ever done. My concern is, at what point does it become unsustainable? And not to be selfish, but we only get a handful of hours throughout the entire week to spend together. \n\nI want a happy, healthy relationship with them where we get to spend time together and not have their work affect every waking moment. How do others in the field balance their work and personal lives in this field?\n\n**Edit: Thank you everyone for all your responses, I have read every comment and response here and am taking them all into consideration. I appreciate the recommendations and insight you all have shared. I know its a tough role you all have to take on, and I am grateful we have so many good people so committed to the wellbeing of all animals.**",
    "score": 221,
    "url": "https://reddit.com/r/Veterinary/comments/1ii3e54/dating_a_veterinarian_im_not_sure_if_our/",
    "created_at": "2025-02-05T05:55:59.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1m46pah",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Fear Free founder, Dr. Marty Becker, slams new generation of vets",
    "text": "In case you’re unfamiliar with Dr. Marty Becker, he’s the guy who took Dr. Sophia Yin’s low-stress handling philosophy, put a trademark on it, and turned it into the Fear Free empire (which made him a multi-millionaire). \n\nHe’s getting a ton of backlash for this article because it glorifies “old school” vets while portraying younger vets as lazy, overly reliant on tech, and less committed to patient care. The whole thing feels tone-deaf and dismissive, ignoring the real challenges vets face today like burnout, massive student debt, and toxic corporate culture. People are calling it outdated and completely out of touch with the profession.",
    "score": 217,
    "url": "https://reddit.com/r/Veterinary/comments/1m46pah/fear_free_founder_dr_marty_becker_slams_new/",
    "created_at": "2025-07-19T20:50:41.000Z",
    "num_comments": 97
  },
  {
    "id": "reddit-1ly2pft",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "I love my job",
    "text": "This week I helped with 3 cataract surgeries, fixed a rectal prolapse, cut a surgical colic, a couple lameness, a choke, a sick foal, a couple asthma cases, and helped with a clinical vaccine trial. This sub is so much doom and gloom, I wanted to offer a positive opinion on the Veterinary profession. I am a horse doctor and couldn't imagine not being a veterinarian. It can be anything you want and the DVM opens so many doors to alternate careers you have never considered.",
    "score": 207,
    "url": "https://reddit.com/r/Veterinary/comments/1ly2pft/i_love_my_job/",
    "created_at": "2025-07-12T15:08:00.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1mu8bh6",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "This sub makes me insanely sad",
    "text": "I joined this sub out of curiosity because I thought of maybe perusing veterinary medicine, specifically something focused in more exotics. But, I always see people ask “is being a veterinarian worth it?” And all the comments are filled with NO! \n\nIt’s just really a let down because this career choice was seriously one of my first ones, but it just seems like the most miserable job in the fucking universe with the way some of you talk about it…\n\nI’m not being rude AT ALL, I guess I’m just disappointed and this sub is discouraging as hell into a field that I’m pretty interested in. ",
    "score": 179,
    "url": "https://reddit.com/r/Veterinary/comments/1mu8bh6/this_sub_makes_me_insanely_sad/",
    "created_at": "2025-08-19T04:11:20.000Z",
    "num_comments": 106
  },
  {
    "id": "reddit-1k63tqe",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Failed out of Veterinary School, Despairing",
    "text": "Good morning. Anonymous throwaway account for hopefully obvious reasons.\n\nLast year, I flunked out of a certain vet school that I don’t want to name but can probably be guessed if you have any idea which AVMA accredited vet school likes to fail out their students. The school operates on an accelerated schedule (3.25 instead of 4 years) so it’s not 1:1, but in normal vet school terms (which I’ll translate to the rest of this post for ease of my dear readers), I was in the last semester at the end of my 3rd year and failed a class which took me out. I was unable to repeat as I already had to repeat a semester in my first year.\n\nI feel like garbage and everything since has just been making it worse. I was really hoping to be able to transfer at least some of my already completed coursework and transfer to another school on their second or third year classes but most vet schools have a no transfer policy, and of the ones that accept transfers, all of the ones I’ve seen don’t accept transfers from a student who was academically dismissed from another vet school/require you to be currently in good standing. Not to mention my in-vet school GPA not being very high. High enough that the AVMA says “Yes, this qualifies you to be a doctor” (one failed class notwithstanding), but not high enough for any vet school too say “Yes, you can be a doctor”\nThis means that my only real option is to start over and apply fresh to vet schools. I have come to terms with that being what I have to do, but it doesn’t mean I’m particularly looking forward to it. The thought of having to redo all of the first year coursework fills me with inconsolable dread.\n\nIt feels like I just wasted years of my life, but worse because in some ways I feel like I’ve moved backwards. I’m way deeper in debt now, my vet school GPA is worse than my undergraduate GPA, and instead of recognizing how much I’ve already done, it seems like vet schools look at me worse than someone straight out of undergrad and that doors are closed shut in my face.\n\nI’ve completed the entire didactic/book learning portion of vet school. Every lecture, every lab taken. I have performed multiple surgeries during my time in school, and my practice NAVLE results predicted that I would pass the actual NAVLE. Yet I have nothing to show for it. Being 75% of a vet doesn’t get you anything. I might as well be 0% of a vet.\n\nI’m trying to find a balance right now between filling out my VMCAS to start reapplying for schools and not thinking about it all because every time I consider my situation I get a mixture of depression, anger, dread, anxiety, etc. and it saps all of my energy. Talking to my therapist helps a little, but not really. It doesn’t actually change my situation or solve things. I know that I still want to be a veterinarian. It’s been my lifelong goal, and I am still fully committed to this path. I love the work, I love thinking through challenging cases and doing surgery and seeing a treatment plan help a patient feel better. I know this is what I will do, I know this is something that I can do. I just need someone somewhere to believe the same and extend me the chance.\n\nAfter being in the situation that I’m in, I’ve become uniquely passionate about increasing accessibility to veterinary education and breaking down barriers to people becoming veterinarians. It doesn’t make much sense to me that someone can do 3 years of veterinary school and have that mean nothing. It doesn’t make much sense to me that getting into veterinary school in the first place is such a limited and arduously obtained opportunity, especially in light of the dire need we have for veterinarians. It doesn’t make much sense to me that students in veterinary school can have to wait entire semesters to get their deserved accommodations granted. It doesn’t make much sense to me that the only two models of vet school (in the US) are “4 years of extremely rigorous, fast paced, fire-hose of information where you miss every important event outside of school” or “What if we did it even faster?”. I don’t know exactly what the solution is but I see myself one day sitting on some sort of AVMA panel to help solve some of these issues. I don’t believe in “Embrace the suck, everybody goes through it” or “We had it bad/even worse so you have to have it just as bad too”, I believe in “What can we do to make things better for the people who come next”.\n\nI apologize if this comes across as rambley, disjointed, or vaguely ranty at times. I just needed to get this off my chest a bit. Most people I know who fail out of vet school fail out much earlier on (in the first year), not at the end of their third year. Being in this situation has been deeply embarrassing and quite difficult for me. To anyone who read this and knows me, you probably recognize my situation and long-windedness, hello friends, I hope clinics is treating you well!\n\nNOMV\nHave a nice day\n\n-Someone who was not good at Large Animal Surgery lecture",
    "score": 178,
    "url": "https://reddit.com/r/Veterinary/comments/1k63tqe/failed_out_of_veterinary_school_despairing/",
    "created_at": "2025-04-23T16:40:45.000Z",
    "num_comments": 56
  },
  {
    "id": "reddit-1j1538q",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Meds that should exist in vet med but don’t",
    "text": "ETA: yes I know #1 is a terrible idea and would never work and would definitely get abused, esp on humans. When it’s time, I will end up using an at-home euth service. They are just so expensive (rightfully so) that I think so many people can’t afford it. But selfishly, I wish I had an option that was peaceful and it could just be me and him in the end (since he’s scared of everyone he doesn’t know). But yeah - overall for gen pop - very bad 🙃\n\nOk I know this is controversial, but after working in the field for 20 years, there are two things that have come up over and over with clients (and myself, tbh) that they wish existed. Go ahead and roast me lol I can take it. \n\nFirst - a tablet that can be prescribed and sent home with a patient to euthanize at home. Clients are always saying that they know it’s time and they wish they would just pass in their sleep, etc. So instead of having to bring their pet into the hospital to euthanize, they give the tablet at home and the pet “falls asleep” and then heart stops. \n\nSecond - something you can give a cat that temporarily dyes the color of their urine. This would be either for multi cat households when you maybe have a cat with history of UO, to make sure they are urinating, or a cat urinating outside the box and you need to be able to find it in your house. \n\nI obv will not be inventing these things, and I know especially #1 will never happen, but as I currently have an 18 year old cat who has all of the diseases you can name and hanging on by a thread.. these are things I would consider. \n\nCurious what doesn’t exist that you wish did?",
    "score": 167,
    "url": "https://reddit.com/r/Veterinary/comments/1j1538q/meds_that_should_exist_in_vet_med_but_dont/",
    "created_at": "2025-03-01T17:42:54.000Z",
    "num_comments": 166
  },
  {
    "id": "reddit-1kag5hd",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Does the guilt go away?",
    "text": "I'm a boarded criticalist going into my 6th year of practice, have spent all 6 years in large specialty hospitals or academic settings. It is genuinely my passion. \n\nI guess my guilt stems from the fact that I am paid a fair wage for my work, yet every single day I sit with clients that can't afford treatment. I know I can't save them all, and I wholly believe that euthanasia is a gift - that doesn't make it any easier to have to hand clients a 5 digit estimate for treatment, and then have to tell them that the other option is humane euthanasia if they can't some how manage to pull $10,000 out of their ass (and yes I am aware that carecredit exists) within a matter of hours. \n\n\nI don't have any control over these prices, I \"accidentally\" have patients fall on the radiology machine or accidentally run bloodwork patients quite often, advocate for our angel fund, etc, but I still just come home every day with a crippling guilt that I can't provide every single patient with the care they need,  meanwhile I live a very comfortable life, rich? No, but I'm able to provide my kid with a life I didn't have and afford to live in our high cost of living area. \n\nI have a therapist, who actually is a former LVT and veterinary social worker, and I talk about these feelings often, but it's just something I think about constantly. \n\nI work in two local municipal shelters a few times a month, and I guess I thought that this would help somewhat mitigate the guilt - and it doesn't. I work with my shelter patients and think about how they're probably here because their owners couldn't afford the cost of vet care, etc. \n\nI recently stepped into a leadership position within our residency/internship program at our hospital, and I'm incredibly passionate about teaching, but it doesn't really provide much a relief or make me feel better about my role etc. \n\nAt this point, I see myself burning out, at least of working in the ICU, within the next few years. It's what I love, but I just feel like I can't do 20+ years of it. ",
    "score": 163,
    "url": "https://reddit.com/r/Veterinary/comments/1kag5hd/does_the_guilt_go_away/",
    "created_at": "2025-04-29T05:09:09.000Z",
    "num_comments": 41
  },
  {
    "id": "reddit-1k9whgv",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Palmoplantar hyperkeratosis in a 13yo spayed female Cocker Spaniel",
    "text": "Comes in every three months to have these growths trimmed. I feel more like a gardener than a vet at this point. ",
    "score": 162,
    "url": "https://reddit.com/r/Veterinary/comments/1k9whgv/palmoplantar_hyperkeratosis_in_a_13yo_spayed/",
    "created_at": "2025-04-28T14:10:16.000Z",
    "num_comments": 40
  },
  {
    "id": "reddit-1osu68t",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "I lost my eye, should I quit vet school?",
    "text": "I'm not looking for sympathy but I would like to hear your thoughts.\n\nI have lost my left eye this summer and with that, my depth perception.\n\nI'm in my second year, I will of course talk with my university about this but I was wondering what you all think and if you have any advice. Any vets on here that don't have depth perception?\n\nEdit: thank you everyone for your replies!",
    "score": 149,
    "url": "https://reddit.com/r/Veterinary/comments/1osu68t/i_lost_my_eye_should_i_quit_vet_school/",
    "created_at": "2025-11-09T20:42:20.000Z",
    "num_comments": 68
  },
  {
    "id": "reddit-1n8nji9",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "No one talks about how mentally difficult rotations are. I come home crying every night.",
    "text": "I’m currently 6 weeks into my final year rotations. Alongside being with a group of girls that hate me, I also have to work alongside vets who get enjoyment out of berating me. I can sense and see the smugness on their faces. I just feel so alone and targeted. Today it just all amounted and I broke down in front of the vet. I’m so embarrassed but I’m also sick of having to find places to go cry. I ended up taking the blame for my crying and he told me to grow thicker skin and get used to the berating. I’ve never been this type of person but these environments are so horrible to work in. I have no one to complain to about this. My tutor doesn’t care, my uni won’t change me into a different group, etc. ",
    "score": 148,
    "url": "https://reddit.com/r/Veterinary/comments/1n8nji9/no_one_talks_about_how_mentally_difficult/",
    "created_at": "2025-09-04T21:59:59.000Z",
    "num_comments": 45
  },
  {
    "id": "reddit-1ocyajr",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "I hate my this career",
    "text": "I’ve been a vet for 7 years and I can’t say there was ever a time during my career that I’ve been happy. Full disclosure:  this post is a rant and I’m not looking for advice, but if anyone feels in a similar way, feel free to show a comment. This career sucks. I wish I knew what I was getting myself into before I went to veg school. I volunteered for vets- never had the chance to work with one for pay in undergrad, and to be honest, I found a job working with kids during undergrad and enjoyed that more. But because I worked my behind off for an A average in undergrad just to get into vet school, I decided to just go. Once I got there, I hated vet school.  My school had no autonomy. Everyone took the same classes for the entire degree. No electives.  I did extremely well academically but mostly because, from high school onwards, I was taught to perform. I thought about quitting but then by the time I considered, I was already in significant student loan debt so I stuck it out just to get something for my troubles. But since going into practice, I’ve hated nearly every moment of it. Dog and cat practice was mind numbingly boring for me. I moved on to exotic pet practice, which started off interesting but soon also became routine and boring. I wanted to do zoo med, but so does everyone else so I could never compete with the kids who spent every summer in South Africa during vet school knocking down elephants and rhinos, so I was never selected for an internship or residency. Excellent grades don’t really get you much in the grand scheme of things, and that’s all I really had. Management sucked in every practice I ever worked in. Managers didn’t care, or only cared about money, or cared about making you feel inferior and tried to bully and belittle you for all you were worth- this has been my experience. I’m bored in vet med. I don’t like people and I don’t enjoy reading other peoples’ research and trying to use it to practice.  I don’t want to “care” for anything, and I don’t enjoy the emotional side of vet med- it’s not my calling. I don’t really care if I make a client happy. I’m just there to do a job. I honestly want to go back and get my PhD in zoology so I can go out into the field and conduct research on what I find interesting. At this rate, I’m in debt for life. I may as well be a slave to something I have an interest in rather than something that feels like a prison sentence. ",
    "score": 139,
    "url": "https://reddit.com/r/Veterinary/comments/1ocyajr/i_hate_my_this_career/",
    "created_at": "2025-10-22T04:03:34.000Z",
    "num_comments": 110
  },
  {
    "id": "reddit-1m06j4p",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "I’m being haunted by a case of mine and I don’t know if I’ll ever get over it",
    "text": "I’m a new grad and a few months ago I received probably the worst phone call of my life in which an emergency veterinarian informed me that a patient of mine had been euthanized as a direct result of a surgery I was a part of. \n\nI won’t go into too much detail, but this was a surgery in which I was assisting (but mostly watching) my boss with a procedure I had never performed or even observed— the goal was that he would teach me how to do it. It’s an uncommon but not super rare surgery. Apparently at some point he removed the incorrect anatomical structure resulting in irreversible damage to the dog. The dog had strange anatomy to begin with, but I feel like I should have known something was wrong, I just trusted this vet with &gt;20 years of experience. \n\nUnfortunately, as this dog was under my schedule, I was listed as the sole surgeon… To make matters even worse, this owner was a veterinary worker at our largest referral hospital. My boss was nice enough to file the legal report under his name, but to this owner and every doctor/staff involved at the referral center (many of which I see their pets for general wellness), I am some stupid overconfident “doctor” who blatantly killed a patient. I feel like my reputation in general, but especially in this region, is forever tainted.\n\nI cannot stop thinking about this. I feel awful for the dog. I feel awful for the owner. I feel awful for myself for being caught in this mess not even a YEAR into my career. Every time I start to feel confident about being a vet again, I remember this and go back to square one. I’ve sought therapy but if I’m being honest I already want to quit this career. \n\nPlease advise. ",
    "score": 133,
    "url": "https://reddit.com/r/Veterinary/comments/1m06j4p/im_being_haunted_by_a_case_of_mine_and_i_dont/",
    "created_at": "2025-07-15T02:52:17.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1pg7fkz",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "US Veterinarian Salaries Just Hit ~$180K on Average (2025)",
    "text": "I was honestly shocked when I saw this, but the average salary for veterinarians in the US is now around $180K, with senior vets pushing almost $240K. That puts them among the fastest-growing earners in healthcare, right up there with dentists and physicians.\n\nEntry-level vets are reportedly starting around $130K, which is wild considering not that long ago vet medicine was seen as a passion career with meh pay. Now demand is exploding due to (according to Indeed): \n1. Massive growth in pet ownership \n2. Higher spending on pet healthcare \n3. Shortages of vets in many regions\n\nAt the same time, vets still deal with insane workloads, emotional burnout, and huge student loan debt.. so it's not all sunshine and puppies.\n\nStill... I never thought I'd see the day where being a vet becomes one of the most financially competitive medical careers.",
    "score": 115,
    "url": "https://reddit.com/r/Veterinary/comments/1pg7fkz/us_veterinarian_salaries_just_hit_180k_on_average/",
    "created_at": "2025-12-07T02:51:37.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1leb8zw",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "I just cannot believe everyone is miserable in this field",
    "text": "I've been in uni for 8 years, trying to finish my Veterinary Medicine degree. It's a lot of time because I had some mental health difficulties, but I'm back on track and only need 2 more years to finish. Most of my uni friends and colleagues have finished already and are working. \nI hear and read vets talking about how miserable, soul draining of a job this is, how it's the worst thing they have faced and they all wish they chose something else as a career. All of the time. Everywhere.\nIt is EXHAUSTING and sometimes takes away my motivation to finish something that I have worked (and am working) incredibly hard for. But even when I don't know if I want to, I gain my motivation back. It's not even a conscious effort. I am just determined so deep into my core to ve a vet that I feel my brain works on its own to make me feel that it's worth it.\n\nAnd maybe because of this deep determination or maybe because I am delusional, but I just can't believe it is like that for everyone. I can't believe there is no way a vet can be happy and have a good relationship with their job. Sometimes I want to, because I feel I'm not being realistic, but I swear my mind can't do it. There has to be people who are doing good, a possibility to be happy with this job. ",
    "score": 114,
    "url": "https://reddit.com/r/Veterinary/comments/1leb8zw/i_just_cannot_believe_everyone_is_miserable_in/",
    "created_at": "2025-06-18T07:46:55.000Z",
    "num_comments": 64
  },
  {
    "id": "reddit-1otqkzf",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "OPEN LETTER: Appeal for Moral Leadership in a Moment of Crisis",
    "text": "To: Dr. Michael Q. Bailey, President, American Veterinary Medical Association\n\nDear Dr. Bailey,\n\nWe write anonymously, out of fear of retaliation but also out of deep respect. We are Black veterinary graduates and students who have taken—or are preparing to take—the North American Veterinary Licensing Examination (NAVLE). Many of us have endured repeated, unexplained failures despite strong academic performance and high ICVA self-assessment scores.\n\nWe know you inherited these circumstances only months ago. We also know you as a Tuskegee alumnus and the first Black president of the AVMA—a man whose own story embodies what fairness in this profession should look like. You did not create the NAVLE system, yet its outcomes fall hardest on students who look like you once did.\n\nIn recent weeks, a pre-litigation letter addressed to the AVMA, ICVA, and NBME has circulated widely across veterinary campuses. The allegations and evidence it contains—of racially motivated score manipulation and systemic fraud—are shocking but tragically familiar. They echo what we have witnessed firsthand: that no matter how well prepared, and no matter how high our predictive scores on self-assessments, students of color are far more likely to fail the NAVLE, while equally or less-prepared white classmates pass.\n\nDespite the seriousness of these claims, the letter offers a straightforward remedy that could immediately restore trust: that the ICVA submit to an independent audit of all NAVLE raw data, scoring decisions, equating formulas, and DIF analyses by a reputable psychometric firm—just as other professional licensing exams do as standard practice. Such transparency is not radical; it is a basic safeguard every profession owes its candidates and the public.\n\nYet, to date, the ICVA has refused this reasonable request. Most troubling, the AVMA —our profession’s leading organization, which has relied on NAVLE outcome data in decisions affecting schools like Tuskegee University, your alma mater and the nation’s oldest historically Black veterinary college—has issued no public call for that audit.\n\nIf the AVMA and its leadership continue to remain silent, it will appear complicit. The Association must take a clear public stand in demanding an independent audit or risk losing all legitimacy as the voice of veterinary medicine. There can be no neutrality when the integrity of licensure itself—and the trust of an entire generation—is at stake.\n\nIf there is nothing to hide, there is nothing to fear from an audit. But if the allegations prove true, justice must follow. Lives and careers have been destroyed; families bankrupted; and the mental-health toll has been unbearable. Those responsible should face both civil and criminal accountability. An AVMA that refuses to stand for fairness cannot continue to claim to represent the profession.\n\nWe understand that as AVMA President you may not have unilateral authority over every decision or statement. But you can speak as Dr. Michael Bailey—veterinarian, scientist, and leader of conscience. There are moments in history when institutions cross moral boundaries that individuals cannot ignore. Silence in such moments becomes complicity. We ask you to consider whether this is one of those times—when personal integrity defines legacy.\n\nWe ask you, as an individual, to say what the profession most needs to hear:\n\n“The NAVLE must undergo a full, independent audit and review of its design, scoring, and equating processes by qualified third-party psychometric experts. Only such a review can determine whether systemic bias or other irregularities exist and restore confidence in the licensing process. The AVMA must publicly call for this audit or risk losing the legitimacy it has earned over more than a century.”\n\nThose words, spoken in your own name, would demonstrate moral clarity and protect the integrity of every veterinarian—past, present, and future. They would also reassure those of us sitting for the exam that our efforts will be measured by science, not suspicion.\n\nHistory will record who chose fairness when silence felt safer. We believe you are that person.\n\nWith respect and hope,\n\nA Coalition of Impacted Black Veterinary Candidates\n\n(Names withheld for safety)",
    "score": 108,
    "url": "https://reddit.com/r/Veterinary/comments/1otqkzf/open_letter_appeal_for_moral_leadership_in_a/",
    "created_at": "2025-11-10T21:28:15.000Z",
    "num_comments": 115
  },
  {
    "id": "reddit-1lckyvo",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "A Patients Death is haunting me and I don't know what to do",
    "text": "I'm currently a veterinarian working in two different hospitals, I work 6 days a week and see multiple patients go through the hospital (I am basically in charge of all hospitalized patients in both hospitals while another doctor gives consults) but this patient will haunt me for the rest of my career if I decide to continue.\n\n  \nLast week on Monday, we only had two patients hospitalized, one stable dog and the other who was stable and had a urinary catheter in because she had a tumor that was blocking the urethra almost completely so she couldn't pee without it. It had been impossible to put the catheter in so the job was to take care of it. I was careful when I measured her urine output and made sure to attach it to her properly and that it was still in and decided to take her for a walk (she only defecated outside so it was a typical walk) but the kennel she was in is broken, I swear I only turned around once she was out but somehow the catheter got stuck on the kennel doors broken bar and it slipped out. \n\n\n\nWe tried to get it back in but it wasn't possible unless she was under anesthesia. We checked with ultrasound and X-rays to make sure the urethra wasn't damaged and luckily there were no signs and she was urinating normally so we decided to give her a day to rest to try again. We tried again the next day and we couldn't do it (I wasn't the doctor who tried). I wasn't there when they tried again and it didn't work (it was the one day I didn't work) and finally on the last try they were able to get it in but the dog started to suffer. Took X-Rays and they realized during one of the 3 attempts they punctured the urethra and the dog had uroabdomen and the biopsy came back showing that the dog had **Urothelial carcinoma**. It had already invaded the kidney as well so they decided to euthanise since the dog already had a fever, was in pain, and the cancer had progressed involving the bladder, urethra and kidney.\n\n  \nI wasn't there, I arrived when they were performing the necropsy and they were able to get to confirm the everything. I didn't go into the necropsy and i feel like everyone blames me and I can't breathe. I feel so guilty, I feel so horrible, and I feel constantly suffocated. I don't want to do this anymore, I feel like I messed up so bad and there's no going back, I became a vet to help animals not to kill them and it feels like I killed them. I just can't anymore, every day since Wednesday (the day she died) I haven't been the same. I just don't know how to go on or even call myself a veterinarian anymore. I don't know who to talk to or if i should just quit. I don't know what to do anymore...",
    "score": 84,
    "url": "https://reddit.com/r/Veterinary/comments/1lckyvo/a_patients_death_is_haunting_me_and_i_dont_know/",
    "created_at": "2025-06-16T05:37:04.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1mkk7gh",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "From Vet school dreams to endless Job rejections",
    "text": "Hey everyone,\nI just wanted to get this off my chest because it’s been a long ride and honestly, I’m tired.\n\nI graduated as a Doctor of Veterinary Medicine back in South Asia. I had big dreams — helping animals, building my career, and making a difference. Fast forward to now, I’m in the U.S., thinking it would be a fresh start.\n\nSince I got here, I’ve applied for what feels like hundreds of jobs — not just in my field, but in literally anything I could find. From veterinary clinics to admin roles, customer service, retail… you name it. And the rejections? Oh, they’ve been plenty. Sometimes I don’t even hear back. Sometimes it’s a polite “we’ve decided to move forward with other candidates,” and sometimes it’s just silence.\n\nI’m volunteering at a clinic right now, trying to keep my skills alive, but it’s unpaid. Every day I ask myself — am I doing enough? Or am I just watching my dreams slip away?\n\nI know many immigrants go through this “start from zero” phase, but it’s exhausting when you feel like your degree, your hard work, and your experience don’t mean much here.\n\n\n\nIf anyone has been through something similar — how did you cope? How did you keep going without losing yourself?\n\nJust needed to share. Thanks for reading.\n",
    "score": 67,
    "url": "https://reddit.com/r/Veterinary/comments/1mkk7gh/from_vet_school_dreams_to_endless_job_rejections/",
    "created_at": "2025-08-08T03:09:10.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1i0j1uc",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Is it common in vet med to do something against what you want?",
    "text": "Hello,\n\nIm interested in pursuing school to become a veterinarian, but there are a few questions I have about the career that is currently stopping me. \n\nOne concern that I have is the lack of control regarding euthanasia. I have heard many vets say that you cannot care more about the clients, and at the end of the day, it's what the client want for their pets that matters. I understand that aspect since there are many possibilities why clients are unable to give their pets the best treatment available, and many times it can be due to financial reasons. \n\nMy question is, is it common euthanize patients because the clients cannot afford treatment, and are there usually other alternatives? How often do you have to carry out a treatment that you don't necessarily feel like is the right thing to do? \n\nThank you and any advice is appreciated!",
    "score": 66,
    "url": "https://reddit.com/r/Veterinary/comments/1i0j1uc/is_it_common_in_vet_med_to_do_something_against/",
    "created_at": "2025-01-13T17:17:37.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1kc9336",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "New Grad - Did I make the wrong choice?",
    "text": "Hey, guys. This is going to be a long, rambling post, so please bear with me. I am a new grad. I started practicing mid-March. At first, I was really happy and excited. This is my dream career. I spent ten years in college to get here. I graduated with honors and have always been passionate about animals and medicine. But the last three weeks or so, I have been horribly depressed and anxious. I constantly feel like an idiot and don’t trust myself. I feel like I’m not cut out for this. I go home and sob. I can’t stop thinking about cases and what I may have done wrong. Maybe I made the wrong recommendations. What if the animal gets sick, gets worse, or doesn’t get better because of me? Will the owners blame me? Will other vets tell owners that I’m the reason their animal is doing poorly? Will they come after my license? On top of that, I’m in so much debt that it feels like I’ll never climb out. I don’t know what to do anymore. I just feel so dejected. Is this normal? \n\nI work in GP. The hospital I chose had two other doctors on staff, which is why I chose it (so I wouldn’t have days where I was alone). But two weeks after I started, one of the doctors resigned. So now my training is going to end four weeks early and I’ll start having solo days next week. \n\nThank you if you’ve read all that. I’m just looking for advice from people that have been in my shoes. ",
    "score": 66,
    "url": "https://reddit.com/r/Veterinary/comments/1kc9336/new_grad_did_i_make_the_wrong_choice/",
    "created_at": "2025-05-01T13:44:25.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1jehvj9",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Have I been blacklisted from every clinic in my town?",
    "text": "This is a throwaway account. I (23F) was supposed to apply for vet school this cycle, but unfortunately, that’s not happening (and probably never will happen). \n\nI graduated from college last May with a B.S in Biology and a minor in chemistry with honors. I also did Penn Foster’s vet assistant program on top of that and got my diploma in 2021. Four months after graduating with my biology degree, I landed a job as a vet assistant at one NAVE clinic in Henderson (I live in Vegas). Although the environment was toxic (because everyone in treatment was walking on eggshells around the lead vet, who was very volatile), I managed to push through every shift, put my skills to the test, and learn a lot about the field from the other doctors and techs (I should also mention that I’m neurodivergent, but still managed to get things done efficiently and was even praised for picking up these skills very quickly). Unfortunately, one of those days, I screwed up and made a medication error (gave insulin to the wrong hospitalized patient) that got me fired one month into the job. I’m not making any excuses, as I know it was 100% my fault and I’ve been beating myself up about it ever since. \n\nSince then, every hospital that I’ve applied to either opens my application and never gets back to me, or straight up rejects my application. Almost every clinic in town belongs to NAVE, and it has me wondering if there’s a chance I’ve been blacklisted from all these clinics. Even private practices and other companies (PetMedic, Animal Care Clinic) have ghosted or rejected me which has me wondering if they’ve been tipped off about my mistake. I’ve even emailed places to see if I could at least shadow, but most places can’t due to insurance (which is understandable). This whole situation has greatly affected my mental health, and has me questioning if I’m even meant to be in the field anymore. I don’t have any other options, and leaving town is out of the question. \n\nIt just sucks because I was very early into my career in the veterinary field, and I feel like this one mistake shouldn’t be the reason why I’m completely shunned from the profession for the rest of my life. I already have the schooling, GPA, and (non-clinical) animal experience. I’m even studying for my GRE at the moment. But the clinical experience is the missing piece to my vet school application puzzle. I was trying to take a year off after undergrad to gain clinical experience, and now the cycle is about to open in two months and I have nothing to show for it. There’s nothing more I wanted to do than work in the vet field (although wildlife conservation is a close second), but I guess it’s all just a pipe dream now. I feel like I worked very hard to get to where I am and I ruined everything. At this point, I’m just considering giving up entirely. \n\nEDIT: I forgot to mention that this job is not on my resume, and I currently work at a dog daycare. ",
    "score": 65,
    "url": "https://reddit.com/r/Veterinary/comments/1jehvj9/have_i_been_blacklisted_from_every_clinic_in_my/",
    "created_at": "2025-03-18T22:28:59.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1nnh9z3",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "I joined this sub to inspire me to take the leap and go to vet school. It's all I've wanted as a kid. All I see is regret and depression.",
    "text": "i totally understand and its valid. ive always known that vet school is hard and people fail a lot and can become depressed so i can see myself in the same position too. if so many smart minds who actually got accepted into vet school can struggle with it, then i dont see why i would succeed. my confidence falters very easily when i fail, and it seems quite easy to do so here so i may as well stick to alternative animal related careers. maybe the education system should make it a little easier to ease the global demand for vets",
    "score": 57,
    "url": "https://reddit.com/r/Veterinary/comments/1nnh9z3/i_joined_this_sub_to_inspire_me_to_take_the_leap/",
    "created_at": "2025-09-22T08:52:29.000Z",
    "num_comments": 43
  },
  {
    "id": "reddit-1i8y79y",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "New Grad Salary Ranges",
    "text": "What is a competitive new grad mixed animal salary? Obviously I know it depends on the practice location and some other factors, but I had a recruiter reach out to me the other week and $85,000-$100,000 was the range for new grads for mixed animal.\n\nNot that I’m trying to be rude or get some crazy starting salary of $120,000+, but I feel like anything below $100,000 isn’t competitive enough anymore for even mixed when they are in higher demand and usually require relocation to underserved areas. \n\nWhat is your experience in salary ranges for the current job market, particularly when it comes to mixed animal positions? \n\nThanks in advance!",
    "score": 41,
    "url": "https://reddit.com/r/Veterinary/comments/1i8y79y/new_grad_salary_ranges/",
    "created_at": "2025-01-24T15:38:43.000Z",
    "num_comments": 36
  },
  {
    "id": "reddit-1m7bkh8",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Discovered vastly underpaid. Now what?",
    "text": "Posting for a friend who doesn't do reddit\n\nSmall animal GP in suburban Florida, closing on 10 years out. Been at this clinic for more than half that time. Salary 120k, production 21%, 10 days PTO, 3 days CE, 1k CE. Works 4 10s and rotating half day Saturday. No negative accrual, but production doesn't take into account days off. Does dentistry and surgery, and has excellent reviews by name online. Has the most appointments booked of all the docs. \n\n She just saw a posting for her clinic offering 110k+ to new grads. \n\nHas not been able to make production due to hospital having been overstaffed with doctors (2 more full-time than it could handle). Did make production when clinic was appropriately staffed a few years ago, between 1-2k a month. \n\nWhat should she ask for in her negotiation with current leadership/what should she look for in a new job? ",
    "score": 40,
    "url": "https://reddit.com/r/Veterinary/comments/1m7bkh8/discovered_vastly_underpaid_now_what/",
    "created_at": "2025-07-23T15:00:18.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1lwm677",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "I’m tired and burnt out. Please help me get thru this week",
    "text": "Just as the title says. I signed a contract thinking I’d be on procedures (I love dentistry) a year ago but my job has yet to put me on procedures. I’m GETTING BURNT OUT \n\n\nI’m basically doing all their med work ups which is fine as I’m IM trained, but we are in a VERY economically depressed area. (meaning many euthanasias) I constantly take appointments four days a week. I’m tired yet I cannot have my salary or hours cut. I put in pto for August to just the-calibrate myself. \n\nBackground-I’ve been in practice almost 15 years. I did a PhD and a large animal IM residency. At my old clinic I did one day of week of dentistry which was great to be able to catch up on things and just rest. Now I’m on appointments with almost all sick kiddos constantly. I should have just done ER and done that salary. \n\nThis may sound like a terrible practice but it isn’t. I love the team. I’ve asked multiple times to be on procedures. I’m in tears today because I think I may have hit my breaking point. I cannot go on. I’m always like this. I think I can get thru it until I just can’t. No one has seen the signs \n\nIt’s sad. I’m not a bad person. I just can’t take this much longer. \n\nI’ve asked why I cannot get a dental day. I don’t get an answer. I think it’s because our medical director wants to take all the procedures. \n\nSadly it might be time for me to move on. I feel REALLY sad. \n\nPlease help. Now I’m the bad guy for taking ten minutes of my day to help myself. \n\nThis profession kinda sucks honestly. ",
    "score": 36,
    "url": "https://reddit.com/r/Veterinary/comments/1lwm677/im_tired_and_burnt_out_please_help_me_get_thru/",
    "created_at": "2025-07-10T19:44:28.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1oyfe8d",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "What else can I do with a Vet degree?",
    "text": "Back again, posted here a year ago, still in the same boat sadly. Worked in a couple of different hospitals and ended up back in my same hospital and still it feels like every day this career drains me more and more. I have looked into just starting my own doggie/cat daycare and saving up to open up a horse ranch of my dreams (which was my original plan long ago) but on my salary I can't save even for 5 seconds. \n\n  \nI just have no idea what to do, I still feel like i know nothing no matter what I study, still feel every toxic worker is horrible, and the salary in my country is trash the more I've investigated (For vet techs it's around 8-10 thousand pesos a month before taxes and for vets its around 20-30 thousand pesos a month before taxes and thats me being kind). It feels like vets around me just want to screw everyone around them over, there is always someone who thinks you're an idiot, and no matter what you do they focus on the one time you have messed up. \n\n  \nSo at this point I'm just looking at what I can do with this degree and I gave my blood and sweat for so I can save up and have something I'll finally be happy with. If anyone knows what that is please let me know. Thank you.",
    "score": 28,
    "url": "https://reddit.com/r/Veterinary/comments/1oyfe8d/what_else_can_i_do_with_a_vet_degree/",
    "created_at": "2025-11-16T07:20:32.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1n1j3ng",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Salary Help",
    "text": "I'm a 2021 graduate- so 4 years of experience. \n\nI work 36 hrs/week with every 3rd Saturday (8am-12pm).\n\nI do NOT perform surgery- I was diagnosied with an autoimmune disease two years ago that randomly plagues me with double vision. I do not plan on going back to performing surgery anytime soon, if at all. \n\nMy NET (not gross) revenue for the clinic is going to be $800-820k for the fiscal year which ends next month. \n\nMy base salary is 120k plus corporate bonus/commision schedule. I'll make $150k this year with my commision added in. \n\nAdditional \"things\": 4 weeks of PTO, 1 week of sick pay, partial pay of benefits per month (compay maybe puts in \\~100/month and I pay the rest). \n\nLocation: Southwestern ON- no need to worry about health insurance \n\nI want a higher base salary and think somehwere in the realm of 130-135k. Is this reasonable? I don't want to demand it but I also am getting tired of my current clinic and am thinking of jumping shit(p). I know I would likely get closer to 130-135k starting anew. ",
    "score": 28,
    "url": "https://reddit.com/r/Veterinary/comments/1n1j3ng/salary_help/",
    "created_at": "2025-08-27T14:48:24.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1nb9rtl",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "ER doctor schedules",
    "text": "Hi colleagues and friends. I currently work at a 24/7 specialty/referral practice as an ER doctor and am looking for insight on an appropriate schedule. \n\nI work a rotating schedule; our shifts are 7a-7p, 12-12, 2-2, 7p-7am. Frequently I have less than 2-3 days to rotate between shifts, even day to night and vice versa. Is this the norm elsewhere? \n\nI also regularly work 4 shifts/week. My shifts usually end up being 13-14 hours, and I am so beyond burnt out. I took this job with the understanding 12 shifts/month would be full time. What is considered full time at your ER?\n\nThe clinic is corporate-owned, all ER doctors are salaried with no commission. They consider 40h/week full time which clearly doesn’t translate for 12h shifts. I personally feel like they are getting extra bang for their buck off of us ER doctors with this calculation. \n\nI’m willing to accept that maybe I’m just too burnt out after 5 years in ER, but deep down I can’t shake the feeling that that these corporate overlords are fucking us. If you’ve made it this far - I appreciate the time. May your cases be smooth and your clients be nice. \n\n",
    "score": 28,
    "url": "https://reddit.com/r/Veterinary/comments/1nb9rtl/er_doctor_schedules/",
    "created_at": "2025-09-08T00:40:29.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1i5tqzl",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Where my veterinary oncologists at?",
    "text": "I'm a 3rd year vet student considering going for a medical oncology residency and i'm trying to weigh options on a few paths to get there. It's really hard to find data on medical oncologists work/life balance, salary, long term QOL, etc. Any advice and insight is appreciated!\n\nTo give some background, i'm also a non-traditional student and by the time I graduate i'll be 31, and honestly the hours and low pay during internship/residency scare me a little. if i went straight into a rotating internship then residency I would be 35 before i would be making any money, buy a house, contribute to retirement, etc. ...and that's if i were to get into a residency on the first try... but i'm up for it if there's light at the end of the tunnel!\n\nOutside of the objective parts of the decision making, I realllly love oncology and if money/time wasn't a consideration, I wouldn't be hesitating in pursuing it.\n\n**Here are some thoughts/questions i've been weighing, and any info/advice is appreciated!**\n\n1. **Academic vs private small animal rotating internship/residency:** would doing a private internship (VCA, NVA, etc.) help, hurt, or not really influence my chances at an academic residency?\n2. **Academic vs private residency quality:** I hear mixed thoughts on whether to go private/academic and it also seems somewhat specialty specific. I don't think I want a career in academia, and the 80k salary for private internships/residencies really takes the weight off as far as financial stress, but do you think there's a difference in quality of academic vs private programs? Ultimately, I want to pursue a program that allows me to learn as much as I can and be the best clinician I can be, but if all things are equal, then 80k/yr sounds pretty great\n3. **I'm also considering going straight into corporate ER (VEG, NVA, etc) for a few years to save some money then going for an internship/residency.** Has anyone that has taken this path? would i be able to go straight into a residency program without an internship? Is this a bad idea? Does it help/hurt my chances at a residency?\n4. **General recommendations on small animal rotating internships/residency programs.** I'm considering these, but any comments and/or recommendations?\n   1. Academic,  CSU, NCSU, UTK\n   2. Private: NVA/Ethos, VCA\n5. **Salary:** I'm having a hard time finding recent data on medical oncologist salaries, **300-350k + 20-23% production** is my best guess on salary range right out of residency. Am I accurate or way off?\n6. **Work Life balance and QOL:** can anyone speak about what your hours, benefits, and general QOL are like in private/corporate practice?",
    "score": 28,
    "url": "https://reddit.com/r/Veterinary/comments/1i5tqzl/where_my_veterinary_oncologists_at/",
    "created_at": "2025-01-20T16:12:06.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1ittjvr",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "New Grad Starting Salary",
    "text": "hi! looking for opinions! \n\ngonna be a new grad in may and planning to go into ER w established mentorship in california \n\nwas wanting to know what other recent/new grads have signed for ! (base + production %, sign on bonus, etc)\n\nedit: I would be in Central Valley California ! Would love info for the bay area for future reference too :)",
    "score": 22,
    "url": "https://reddit.com/r/Veterinary/comments/1ittjvr/new_grad_starting_salary/",
    "created_at": "2025-02-20T08:09:28.000Z",
    "num_comments": 26
  },
  {
    "id": "reddit-1jc0eeu",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "European countries where I can work as a vet speaking English (at first)",
    "text": "Hi, I'm a vet student about to graduate and I am looking for jobs, and I'm wondering which countries I should be applying for.\n\nEnglish is my native language, so I've applied in England and Ireland not to much success, mostly because the new graduate programs of all the big clinics are already full and I start applying quite late.\n\nIm studying in Spain so my Spanish is good enough, however the salaries here are very low and I'd only consider staying here as a last resort (which is the advice all the local vets have given me)\n\nI was wondering if for example the Netherlands, or Scandinavian countries would be better to apply to as they speak good English there and I would be able to work while learning the local language?",
    "score": 21,
    "url": "https://reddit.com/r/Veterinary/comments/1jc0eeu/european_countries_where_i_can_work_as_a_vet/",
    "created_at": "2025-03-15T17:32:14.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1o18k75",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Contract",
    "text": "I’m a new soon to be 2026 grad and wanted opinions on an offer I have received. It’s a small animal GP in northern Virginia.\n\nBase salary: 125,000\nProduction: 20% services, 5% products \n\nSign on bonus: 20,000 its owed back if I leave before 1 year but if I do leave it’s pro rated so I don’t owe the full amount back \n\nPTO: 120 hours (vacation and sick total)\n\n3 paid CE days with 2,500 reimbursement \n\nAfter 1 year the production goes up to 21% and 6% and year 2 to 22% and 7% where it is capped\n\nNo negative accrual \nNo non compete \n\nEdit:\nThey do pay for all my licensing and subscriptions I want like vin, plumbs, vetgirl etc\n\nWould countering with 130,000 base, 25,000 sign on bonus and a tuition reimbursement program (I’ve seen some companies do 200-500 a month) be too much to ask for?",
    "score": 18,
    "url": "https://reddit.com/r/Veterinary/comments/1o18k75/contract/",
    "created_at": "2025-10-08T12:04:32.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1ov3h70",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Corporate clinics and salaries",
    "text": "I’ve been out of vet school since 2012 and in and out of both general practice and industry since that time in Canada. For the first half of my career I was in non corporate private practices, and the practices which I have worked in for the second half have been corporate owned.\n\nOver the last 5 years, I feel like I’ve seen an uptick in salaries for veterinarians, both my own and friends in the profession. Has anyone else noticed this in North America? And if so, do you think it may have something to do with corporate clinics being willing to pay more compared to private? (Or perhaps associates feel less guilty asking for salary increases compared to private owners). Could it have something to do with Covid and veterinary costs increasing? Or am I just imagining it all?!",
    "score": 16,
    "url": "https://reddit.com/r/Veterinary/comments/1ov3h70/corporate_clinics_and_salaries/",
    "created_at": "2025-11-12T12:11:20.000Z",
    "num_comments": 24
  },
  {
    "id": "reddit-1lri0ax",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "any board certified veterinary dentists here?",
    "text": "Hi everyone,\n\nI’m considering pursuing a career as a board-certified veterinary dentist in the United States and would love to hear from anyone with experience or insights in this field. I have a few specific questions:\n\n**1. How competitive is it to become a board-certified veterinary dentist (AVDC Diplomate) in the U.S.?**\n\n* How hard is it to get into a residency program?\n* What’s the typical path (internship, networking, etc.)?\n* Any tips for improving my chances?\n\n**2. What is the quality of life (QOL) like for board-certified veterinary dentists?**\n\n* How are the work hours, work-life balance, and job satisfaction?\n* Is burnout common, or is the schedule more manageable compared to other specialties?\n\n**3. What is the expected income for board-certified veterinary dentists?**\n\n* What’s the average starting salary and earning potential (including production bonuses, etc.)?\n* How does it compare to general practitioners and other specialties?\n\n**4. What are the current trends in the U.S. veterinary dentistry market?**\n\n* Is demand for dental specialists growing?\n* Are there any notable changes in technology, client awareness, or practice models?\n\nAny personal experiences, advice, or recent data would be greatly appreciated! Thanks in advance for your help.\n\nWould love to hear from anyone currently in the field or who has recently gone through the process!",
    "score": 16,
    "url": "https://reddit.com/r/Veterinary/comments/1lri0ax/any_board_certified_veterinary_dentists_here/",
    "created_at": "2025-07-04T12:52:26.000Z",
    "num_comments": 7
  },
  {
    "id": "reddit-1jh75gi",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "fresh out of residency veterinary neurologist salary",
    "text": "hi! i was wondering if anyone knows what salary i could expect right after residency should i decide to do a veterinary neurology residency after veterinary school. i'm class of 2029, so it's a bit into the future, but i'm just trying to get an idea for loans purposes what my situation could look like should i decide to go down that route. thanks!",
    "score": 15,
    "url": "https://reddit.com/r/Veterinary/comments/1jh75gi/fresh_out_of_residency_veterinary_neurologist/",
    "created_at": "2025-03-22T12:17:34.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1kjn9qb",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Could really use some job advice",
    "text": "I graduated in 2020 and felt like I had a bit of a hard time getting a job. Everyone was pandemic scared and not hiring. I ended up taking a job with Banfield in the area my spouse works. It was great for about 6 months and then deteriorated quickly. Took me a year but with the help of my mentor/friend I found my current job \n\nThere are (or were) lots of great things about it. My schedule is flexible, I only work 4 days a week and get 10 days PTO and I can take off fairly short notice, they cover my health insurance COMPLETELY (nothing comes out of my check), I have my own office, I get lots of freedom to practice medicine how I want, they pay for my CE. I could probably think of more if pressed. \n\nThe cons: low salary (I was ok with this because health insurance and only 4 day work week), I'm on 1099 (independent contractor) instead of W2 (employee) so I have to pay quarterly taxes and they're obviously higher than they would be if I were on W2. After thorough contemplation I decided I was ok with that trade off for the QOL upgrade I got by working there. \n\nMy bosses are very kind and, ultimately I think, good people. The problem started about 1.5 years ago. They hired a 4th doctor. I felt like that was too many for this small practice, but said doctor was not earning a full salary at the time. He had let his license lapse and so needed CE and clinical hours to renew it. He went to school with one of my bosses so they wanted to help him get back on his feet.  None of this is really about him, he's so kind/compassionate and an excellent doctor. When he renewed his license they hired him on full time at full salary and I started to get worried. I genuinely don't think this clinic can support 4 docs but I decided to just see what would happen. I went from being mostly booked every day to only having 4-8 appointments each day since the appointments were spread between us. The receptionists were told to prioritize booking me before him but it never seemed to happen.\n\nLast year around August boss 1 pulled us into a meeting and said the clinic was struggling a bit. He assured us we are earning enough to cover ourselves, but wanted us to start sending home techs if things got slow. When Christmas rolled around it got worse. Boss 1 and office manager brought us individually into a meeting and handed us a contract that involved a significant pay cut, 5 day work week, 5 days PTO + insurance, OR 10 days PTO without insurance, I was also told they were going to crack down on how flexible time off was and if we needed a day it needed to be approved or we needed to work a shift to make up for it. I did not receive my usual Christmas bonus last year. I never signed the new contract and they didn't really follow through on any of it except for the pay cut. I had no contract previously so they can really pay me what they feel like and my only recourse is to leave. \n\nI immediately started looking for new jobs but I think people are scared about the economy and no local clinics are hiring. It feels an awful lot like when I was job hunting in 2020. I checked VCA but the nearest clinic they have hiring is 2.5 hours away. I applied at 2 emergency clinics, both of whom were extremely enthusiastic about meeting me, interviewing me, and having me work a trial shift, only to ghost me afterward. I called my mentor and asked if she knew anyone, she gave me one lead but when I contacted them they said they weren't hiring doctors at the moment. I even applied back at Banfield (different clinic to my previous one) and my application moved to \"inactive\" after about a week.\n\nSo I've just been putting up with it and not so silently fuming while I try to figure out a new job situation. Boss 2 pulled me aside 2 weeks ago and told me he was cutting his own salary to supplement mine and \"new\" docs. Last week's paycheck I received a significant raise so he definitely followed through. I was told that he is thinking about retiring so he's cutting his hours now and hoping his clients will start seeing me and new doc. I just.. don't know how sustainable this is. What happens when we hit slow season this year? His clients are like a cult; they love him and I think they'll just go to a new clinic if he isn't available (clients that really like him generally hate Boss 1 and they're hit or miss about me and new doc).\n\nI know if it comes down to them having to let someone go it's going to be me. New doc earns more for the clinic than me. It's partially because he's a wizard at convincing people to run diagnostics and partly because I try sooo hard to keep my diagnostics within people's budget and I know it lowers my overall production because I don't push. I think if it came to it boss 2 would fight for me but boss 1 would probably just pick the better option on paper. The techs and receptionists will unabashedly say I'm their favorite but that won't matter much in the grand scheme. \n\nLooking online for jobs isn't helping. The only ones listed are for Banfield/VCA. I feel like cold calling/visiting clinics to ask if they're hiring is stupid. My only real doctor friends in the industry are my old mentor and new doc and they've said word of mouth is the best way to get a job in our industry. I do have tech friends that helped me get my ER interviews and they basically told me it isn't my fault I was ghosted so I don't think it's me/my resume that is the problem. I can elaborate on what they said if anyone wants to know. I just want some reassurance and for y'all to give me job hunting tips. Thanks for reading the ramble",
    "score": 15,
    "url": "https://reddit.com/r/Veterinary/comments/1kjn9qb/could_really_use_some_job_advice/",
    "created_at": "2025-05-10T23:25:57.000Z",
    "num_comments": 14
  },
  {
    "id": "reddit-1pmft09",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Any DVM’s who have taken time off to start a family?",
    "text": "My husband and I are wanting to start a family, I am a veterinarian, he is not. We are fortunate enough that we can get by on only his salary for a while, but I am both excited and terrified at the thought of putting my career on hold for a few years to raise little ones. I am also specialized which brings an additional layer of difficulty because it’s not like private practice where there are positions more commonly in my area. I am wondering if anyone has ever resigned from their job for any period of time beyond maternity leave to start a family and what that looked like for you. Did you have trouble finding a job or getting back to work after year(s) away? Do people do this? ",
    "score": 15,
    "url": "https://reddit.com/r/Veterinary/comments/1pmft09/any_dvms_who_have_taken_time_off_to_start_a_family/",
    "created_at": "2025-12-14T14:49:24.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1kapar2",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Burned out, quit my job at a toxic clinic, and now I feel lost—starting to wonder if I even belong in small animal practice anymore",
    "text": "I used to work as a veterinarian in a clinic where my boss micromanaged everything and constantly went on power trips. It was toxic. She’d say stuff like, “I’m not questioning that big salary of yours,” and “I’m your boss, not your staff.” Like, what even is that supposed to mean? Every day felt like walking on eggshells, trying to do my job while being constantly belittled or undermined.\n\nI finally hit my limit and quit. And now… I just feel hollow. I thought I’d feel relief, but instead, I feel worthless. Like I failed. Like maybe I wasn’t strong enough to handle it. I keep asking myself if I made the right decision, even though deep down I know I couldn’t keep going like that.\n\nWhat’s worse is that it’s made me question if I even belong in small animal practice anymore. I loved the medicine, the animals, even the clients (most of the time). But now it feels like this was a sign—a huge, glaring one—that maybe this part of vet med isn’t for me.\n\nI don’t know. I just feel raw and open, like everything I built up was stripped away. Has anyone else been here? How do you start over when everything you thought you wanted starts to feel like the wrong path?",
    "score": 14,
    "url": "https://reddit.com/r/Veterinary/comments/1kapar2/burned_out_quit_my_job_at_a_toxic_clinic_and_now/",
    "created_at": "2025-04-29T14:28:20.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1ma17ep",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Deciding to Specialize?",
    "text": "I am a current 4th year veterinary student. I am interested in working with exotic pets, especially reptiles and small mammals, but I am not sure if I should specialize. I was originally planning on just going straight into a GP that also sees exotics after graduation. However, after I completed an externship at an exotics-only clinic, I am not so sure about what I want to do anymore. I loved the wide variety of species that we saw at that clinic, as well as the huge variation in complexity of the cases, ranging from wellness appointments to boarded specialist ear surgeries. I am currently doing an externship at a GP that also sees exotics, and although there are a fair amount of exotics cases, I still don't feel as excited to go to the clinic every day as I did at the exotics-only clinic. I have a couple more externships at mixed GP/exotics practices before I graduate to get a better feel for what this career path would entail. \n\n  \nTo anyone that has specialized, how did you know to go down that path? I guess I am nervous about having to do internships and residencies and spending 4+ more years before going into practice and having a more normal work/life balance and salary. \n\n  \nAny sort of advice or anecdotes are greatly appreciated!",
    "score": 14,
    "url": "https://reddit.com/r/Veterinary/comments/1ma17ep/deciding_to_specialize/",
    "created_at": "2025-07-26T18:54:24.000Z",
    "num_comments": 10
  },
  {
    "id": "reddit-1mv2ndp",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Manager taking PTO down to the minute?",
    "text": "I’m a new(ish) grad. Been out a couple of years but only been at my current clinic as a vet for about a year. Not sure if this is a normal thing and curious about y’all’s take. \n\nBasically my medical director makes us take PTO down to the minute. Even if we finish early we are required to sit in our chairs until 6pm when the clinic closes. I have a 30min block for records at the end of my schedule and this is especially frustrating when I finish everything early and want to go home. If we want to leave 30min (or even 10 min early!) we are required to take PTO. \n\nI don’t think I would care so much if I didn’t stay late to finish things 99% of the time and we are salary pay so no overtime. Those rare days when I finish early I want to go home! Not sit and stare at VIN or my computer wasting time. \n\nMy frustration bubbled over a few weeks ago because I came into the clinic not feeling well thinking I could truck through the day. I couldn’t and ended up changing my schedule around (another dr had an opening at the end of the day) and leaving an hour early (mind you this means I only had to move 1 appointment since my last “appointment” is a records block). I told my MD and she said that’s fine because it’s coming out of my PTO anyway (I.e. had I left during my records block she would’ve taken 30 min PTO, now she takes an hour). \n\nIn addition, every so often the clinic is only open until noon (half day). If a dr takes PTO during these days instead of taking 4 hours (the amount of time the clinic is open for) they take a full 8 hours since we are “taking a full day off it needs to be reflected as such in the PTO.” \n\nMy non-DVM manager is much more lenient about the leaving early thing, but it still frustrates me. Is this a normal practice??  ",
    "score": 14,
    "url": "https://reddit.com/r/Veterinary/comments/1mv2ndp/manager_taking_pto_down_to_the_minute/",
    "created_at": "2025-08-20T02:27:11.000Z",
    "num_comments": 18
  },
  {
    "id": "reddit-1ji5pfi",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Specializing in surgery",
    "text": "Hi all, I just got admitted for the c/o 2029 at my IS vet school. I realize that its probably too early to be thinking about this but the type A in me cant help but plan. Im interested in specializing, potentially in SA surgery. Im working as an assistant in soft tissue surgery and I find it very interesting. I realize that its a competitive specialty. What are some things I should be doing in vet school to be as competitive as possible, besides good grades? Do you all think the post-residency salary/lifestyle is worth the extra training? Thanks!",
    "score": 14,
    "url": "https://reddit.com/r/Veterinary/comments/1ji5pfi/specializing_in_surgery/",
    "created_at": "2025-03-23T18:14:20.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1mbqou1",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "What’s it like being a veterinarian in Dubai? Salary expectations, job roles, and overall experience?",
    "text": "Hi everyone,  \nI’m a small animal vet with just under 2 years of post-grad experience from the UK, currently practicing in a general practice setting. I’m planning to move to Dubai soon and was hoping to get some insight from those already working there (or who’ve worked there in the past).\n\nFrom what I’ve gathered, it seems that you need 5 years of post-grad experience to be licensed as a veterinary surgeon in the UAE. So in the meantime, I may have to work under a vet license as a **vet technician** or assistant.\n\n**I’d love to know from you:**\n\n* What is the veterinary scene like in Dubai? (Types of clinics, work culture, caseloads, client expectations, etc.)\n* What are realistic **salary expectations** for someone in my situation (i.e., working as a vet tech/assistant until I hit the 5-year mark)?\n* Are there any clinics you’d recommend or avoid based on experience?\n* How is work-life balance generally, especially in corporate chains vs independent practices?\n* Is there demand for vets with international degrees or specialist interests (I’m particularly interested in internal medicine and cardiology in the long run)?\n* Any licensing/logistical tips for the move and transition?\n\nI’d really appreciate any honest feedback or even just a general feel for what it’s like working there. I’m excited but want to go in informed.\n\nThanks so much in advance!",
    "score": 13,
    "url": "https://reddit.com/r/Veterinary/comments/1mbqou1/whats_it_like_being_a_veterinarian_in_dubai/",
    "created_at": "2025-07-28T20:01:42.000Z",
    "num_comments": 5
  },
  {
    "id": "reddit-1jf2vgi",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Thinking about dermatology",
    "text": "I am going to begin my first year of vet school next year, and have always dreamt about specializing. As of now, dermatology really excites me. Would any dermatologist be able to share their path taken to do this role, pros and cons about the position, the nature of getting into the programs, and annual salary? Thanks!!",
    "score": 13,
    "url": "https://reddit.com/r/Veterinary/comments/1jf2vgi/thinking_about_dermatology/",
    "created_at": "2025-03-19T17:43:07.000Z",
    "num_comments": 8
  },
  {
    "id": "reddit-1jmfjb3",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Reptile vet?",
    "text": "Hi! I’m a teenager in community college and an undecided major. I’ve switched from accounting to wanting to do plenty of other things yet I’ve never settled on anything. Growing up poor with parents who didn’t go to college, I’ve always thought I “needed” to get a job that makes the most money, not one that I am passionate about. But as someone that has owned reptiles for years (leopard gecko and a sulcata) I feel like I have finally realized where my passions are. I really want to delve into the field of exotic animal care, but the only things I see on Reddit are people regretting it due to their salary, but all these posts were around 6 years ago. I’m just wondering if I can get any input on those who are exotic vets and how you feel about what you do. Thank you! ",
    "score": 13,
    "url": "https://reddit.com/r/Veterinary/comments/1jmfjb3/reptile_vet/",
    "created_at": "2025-03-29T05:38:48.000Z",
    "num_comments": 9
  },
  {
    "id": "reddit-1ogeuxp",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Starting Salary as a “New” Grad",
    "text": "North Chicago Suburb \n\n2023 grad - just passed NAVLE this year. Been working as technician for past 2 years with private practice who is offering job as doctor now.\n\n$115k salary - what was originally offered when graduated.\n\nSince it has been 2 years, I was looking to negotiate base salary to at least $120k due to cost of living now, student loan payments, etc.\nIs it crazy for me to try and negotiate a little more?",
    "score": 12,
    "url": "https://reddit.com/r/Veterinary/comments/1ogeuxp/starting_salary_as_a_new_grad/",
    "created_at": "2025-10-26T07:56:09.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1mxznx3",
    "subreddit": "Veterinary",
    "soc_codes": [
      "29-1131"
    ],
    "title": "Quitting my first associate job after a couple of months",
    "text": "Hey guys. I will try to keep this brief but I am a new grad who just started an associate position in may and already want to leave. Back in May I was choosing between the position I ended up taking (GP close to current home) and an emergency job with structured mentoring but relocation to MA. I have always wanted to be in an emergency setting, but moving to MA was just not feasible for my partner and I at the time, and although we have always wanted to move away from home we both agreed that we would only move to CO or IL (just preference). So I ended up taking this GP job, and after 4 months I am miserable. I love my staff (techs, assistants, reception) but the doctor that owns the practice and his wife who is the manager are ... not the greatest. There were some red flags I ignored, the use of the word \"family\" thrown around alot during my prelim interviews. I feel like I got the old bait and switch as a new grad. Was promised structured mentorship ( I only work with my senior doc boss 2x a week), they are consistently going away, and when they are there they are either overwhelmed and having a temper tantrum or in their office with the door shut making calls, so i feel like no matter what i do im bothering them when i need help. They assured me that their practice was a GP yet also urgent care/emergency and I would be able to see and cut walk in emergencies and be overseen with those. However, whenever an emergency comes in (which is far and few between) I end up having to transfer as I have a day full of appointments and am usually short staffed so cannot take the FB into the OR, etc. Also if a FUO comes in I really cant do much because our resources are limited, and then I would have to unblock and then still transfer regardless for hospitalization. My biggest frustration is that I placed major emphasis on surgery being a strong passion of mine and I was met with reassurance I would have so much surgery at their clinic, yet it has been 4 months and I have not one single surgery booked. I feel like I see the same 20 cases a day and overall just feel like GP is boring for me and not as stimulating as I'd hoped (NO shade GP as a field i just dont think its for me) I really have always thrived in very fast paced environments. All of the staff talks badly about our two owners and their attitude. My manager (wife) gaslights everyone and \"forgets\" conversations had about important topics. We are pushed to make money and kind of focus on that and I dont like it. \n\n  \nOverall I am worried about my ability in 3-5 years if i stay here with no structured mentorship, not much exposure to emergent cases, variable cases, and no surgery in sight. Especially because my favorite part of veterinary medicine IS surgery. With that being said, The same emergency clinic that I almost took a job from back in may reached back out to me last weekend and asked me if i would be interested in taking a training/permanent position out in IL. It would start in October. The thought of taking this job is elating to me and seems like a no brainer, exactly what I want and in the location my spouse and I want to be in long term. This job offers better mentorship, better salary/benefits/PTO, etc. and definitely has the opportunity for me to cut when those ER surgical cases come through. \n\n  \nI guess my question is what should I do? I feel immense guilt to leave the practice after only 4 months and put my notice in. Especially because they are so close and \"family-like\" I feel they are going to take this personal no matter how i word it. I know vet med is a small place and I dont want to burn any bridges, but almost feel its inevitable no matter how i go about this. my contract has nothing in it about quitting except that I need to give a 60d notice, which is perfect because if i put it in this week that would bring me to my start date in Oct. I have also never quit an associate job before, do I need to write a letter? send an email prior to talking to them to give them the heads up? I plan on having a conversation with them to just say that GP just is not working for me and Im not happy in this field of medicine so have chosen another opportunity. Any help would be appreciated. ",
    "score": 11,
    "url": "https://reddit.com/r/Veterinary/comments/1mxznx3/quitting_my_first_associate_job_after_a_couple_of/",
    "created_at": "2025-08-23T12:05:17.000Z",
    "num_comments": 20
  }
]