[
  {
    "id": "reddit-1k9w3b7",
    "subreddit": "VetTech",
    "soc_codes": [
      "29-2056"
    ],
    "title": "I didn't ask, ma'am.",
    "text": "We had a dog come in for vomiting and the owner approved an estimate for around $600. The time to pay comes and she goes, \"Can you give me about 3 hours? You can hang onto my dog.\" and we agree. Sure enough, 3 hours later she comes in with the money. She pulls it out of her bra, slaps it on the counter and declares loudly to the packed lobby, \"My dog is damn lucky I'm so good at sucking dick.\" ",
    "score": 721,
    "url": "https://reddit.com/r/VetTech/comments/1k9w3b7/i_didnt_ask_maam/",
    "created_at": "2025-04-28T13:53:22.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1lb01y5",
    "subreddit": "VetTech",
    "soc_codes": [
      "29-2056"
    ],
    "title": "Can we show some love to our LGBTQIA+ veterinary professionals this pride month?",
    "text": "In light of a recent transphobic post made in this subreddit I think we should pour some love and attention into celebrating our queer family in this field.\n\nThis field is and will always be open to all walks of life. I, as a queer man myself, have found love, passion, and family in this field and I reflect that back towards all vet staff professionals that I meet. This goes for clients too! \n\nWe live in troubling times and i believe our veterinary hospitals should be a safe space for all clients to not have to worry about bigotry and ridicule while they focus on worrying about their precious pets.\n\n",
    "score": 693,
    "url": "https://reddit.com/r/VetTech/comments/1lb01y5/can_we_show_some_love_to_our_lgbtqia_veterinary/",
    "created_at": "2025-06-14T04:30:53.000Z",
    "num_comments": 94
  },
  {
    "id": "reddit-1kjezbv",
    "subreddit": "VetTech",
    "soc_codes": [
      "29-2056"
    ],
    "title": "Documenting Saves Lives. Thank You, Vet Techs.",
    "text": "Hi everyone, I run a small animal rescue and I wanted to share a story that has stayed with me. It’s an example of the power of good documentation, and to the vet techs who do it every single day, even when it feels like it doesn’t matter, thank you.\n\nA few months ago, I was at our municipal shelter dropping off some cats for TNR when I overheard a little fluffy dog being denied intake. I spoke to the owner and offered to help: I’d take the dog in, get her vetted, and rehome her responsibly. The owner agreed, and that’s how I met Princess.\n\nFrom the moment I got her in my car, something felt wrong. She was visibly uncomfortable, aggressive in a way that didn’t match her breed’s usual nippiness, and had discharge from her vulva. I knew we had a problem.\n\nI begged the former owner for her medical records and, after a lot of back-and-forth, finally received them. What I read in those records gave me chills.\n\nThe vet tech had documented everything.\n\nPrincess had been diagnosed with pyometra nine months prior. That same tech had documented the owners’ repeated denials of surgery, of pain meds, of antibiotics. They noted the excuses, the no-shows, and even logged that the owners rescheduled with another vet but still never showed up. That vet tech called the situation out for what it was, neglect, and it was all in the chart. They created a detailed timeline that no one could dispute.\n\nWe rushed Princess to our vet. Her infection had progressed. She was septic and she needed emergency surgery. We raised funds and got her the care she deserved. But shortly after, the previous owners came after us. Legally. Claimed we “stole” their dog. Claimed we sought treatment for their “property” without permission.\n\nBut thanks to that incredible vet tech’s notes, our lawyer was able to prove a pattern of documented medical neglect. Princess was legally relinquished. She stayed with us. She’s recovered and has been adopted into a family experienced with her breed who loves her so so much.\n\nA few weeks later, we visited the clinic where the vet tech worked. We brought a thank-you note and a small gift card. When we explained who we were and who Princess was, she broke down crying. She said she had been so worried and felt helpless. That she had thought about Princess every day since.\n\nSo this post is for all of you vet techs: thank you. Thank you for what you see, what you endure, and what you write down even when it feels futile. That charting you do, it matters. It saves lives. You may not always get to see the outcome, but I promise you, your words echo far beyond the exam room.\n\nPlease, don’t stop documenting. Even when you’re burnt out. Even when it feels like nobody reads it. We did. And it saved a life. ",
    "score": 691,
    "url": "https://reddit.com/r/VetTech/comments/1kjezbv/documenting_saves_lives_thank_you_vet_techs/",
    "created_at": "2025-05-10T17:02:25.000Z",
    "num_comments": 17
  },
  {
    "id": "reddit-1j43pzq",
    "subreddit": "VetTech",
    "soc_codes": [
      "29-2056"
    ],
    "title": "Wild how you never see or hear of RN’s getting on their knees and scrubbing the grout on their floors when things are “slow”",
    "text": "Must be nice to not be treated as an indentured servant. Having to earn every penny they make while at work. Having their license and schooling respected enough to not have to be janitors when their rich bosses don’t think they are working hard enough for their shitty pay. \nThere is zero respect as a tech. From your bosses to the clients. It’s far and in between. I shouldn’t have to work myself to the bone every millisecond I’m at work. \nWe should be treated like licensed professionals. Not little worker-bees that need to be working every second they are in the building. \nI’m leaving this toxic, disrespectful field. Finding a job where calling out isn’t the end of the world. Where working from home is an option when there 3ft of snow on the ground. Where your bosses don’t expect you to be a janitor when you are finished recovering a patient from a traumatic surgery. This career isn’t worth it. ",
    "score": 626,
    "url": "https://reddit.com/r/VetTech/comments/1j43pzq/wild_how_you_never_see_or_hear_of_rns_getting_on/",
    "created_at": "2025-03-05T14:01:11.000Z",
    "num_comments": 73
  },
  {
    "id": "reddit-1ihaue9",
    "subreddit": "VetTech",
    "soc_codes": [
      "29-2056"
    ],
    "title": "My coworker was mauled today",
    "text": "TW: serious injury from dog bite\n\nI'm a shelter tech and my coworker is a kennel tech. They took this dog out on leash for a routine walk. I expressed discomfort at how the dog was acting towards them, but I've been a little overly cautious in the past and they're an experienced kennel tech, so I didn't press.\n\nMy coworker went to put the dog back in its kennel and it turned on them. They called for help on their walkie. I ran into the room and heard them screaming. The kennel techs had managed to get the dog off them and onto a Ketch pole. My coworkers face was turning white, so I grabbed them and pulled them back to our treatment area and sat them down. My team lead called 911 while I applied pressure to the worst wound with a towel. There were holes all over their uniform from where the dog punctured. I talked my coworker through their breathing to keep them from hyperventilating and passing out until paramedics showed up and took them to the hospital.\n\nI don't think they'll be returning to the shelter after this and I can't blame them. I wasn't even on the receiving end of the attack and I'm rattled as hell. I came home and scrubbed their blood off my pants with OxiClean and then just paced around my house for an hour. I've been in animal care/vet med for almost a decade and I've never seen something so severe happen. The dog did give warnings, but they were subtle and the dog was so fast to escalate, and the fact that it kept coming after them is terrifying. Be safe out there, guys. Amd watch out for each other.",
    "score": 613,
    "url": "https://reddit.com/r/VetTech/comments/1ihaue9/my_coworker_was_mauled_today/",
    "created_at": "2025-02-04T05:45:29.000Z",
    "num_comments": 74
  },
  {
    "id": "reddit-1kmvozs",
    "subreddit": "VetTech",
    "soc_codes": [
      "29-2056"
    ],
    "title": "My work had a contest to make a promotion shirt and here’s what I made.",
    "text": "So I didn’t win lol but got a shoutout for it. The original had my works logo on the top but I cut that out. Hope it’s ok to post this, I’ve made other shirts on spreadshop so I’ll post a link in the comments. Thanks and keep on keeping on. \n",
    "score": 602,
    "url": "https://reddit.com/r/VetTech/comments/1kmvozs/my_work_had_a_contest_to_make_a_promotion_shirt/",
    "created_at": "2025-05-15T01:04:40.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1ozdpgc",
    "subreddit": "VetTech",
    "soc_codes": [
      "29-2056"
    ],
    "title": "Very sad case",
    "text": "Tonight I had the most tragic case of all my time in vet med. I have been working in vet med for around a year and a half and I work currently in emergency. An owner came in today and surrendered a dog which had parvo to us. It was called as a stat and it actively died on the table. The owner later came in with 9 puppies which on the phone he said he had went back to the place he found the first dog and found them. Which later his wife slipped up while talking to me and said they have had these puppies for 2 days. He surrendered all 9 of them to us and every single one of them had parvo. We had to euthanize all of them as the shelter wouldn’t pay for 9 puppies to be hospitalized. I think the worst part is that I felt nothing. I wasn’t sad and I didn’t get upset. I even tried being upset but I felt 0 emotions. I feel like a monster like I should be guilty for feeling nothing. It’s not important I just have this guilt that I feel like I should feel a different way but I don’t. Either way I thought I’d share because it’s by far the worst case I’ve ever had. ",
    "score": 588,
    "url": "https://reddit.com/r/VetTech/comments/1ozdpgc/very_sad_case/",
    "created_at": "2025-11-17T11:19:37.000Z",
    "num_comments": 91
  }
]