[
  {
    "id": "reddit-1i6kug7",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "A man tried to pull on my septum ring",
    "text": "Not even a hello. Not a single word, not even a 'how are you' first. I approached them, placed cutlery down, said my usual, \"Hey guys! How are we doing today?\" and try to make eye contact with everyone. My eyes meet this man's, maybe 50 years old. Like slow motion his grubby man-child fingers start to rise, towards my nose in a pinching formation. I didn't realize at first what he was doing, until his hand was near my chin. I RECOILED, unable to hid the utter confusion, disgust, and genuine horror on my face. This man, his eyes locked on mine, asks, \"What's that? Something to pull on?\"\n\nUtter and visceral shock. I work in a sports bar. I've had weird comments, gross stares, and uncomfortably rejected people. Never has a grown man tried to pull on my facial piercings in front of, get this, his wife and children.\n\nI had no words that wouldn't have gotten me fired. I turned and walked out back, the pale horror on my face. Co worked asked what happened, and my screaming started. Cause what else do I do? We all had a solid laugh about it, and I went back out, said something like \"Anyways! What can I get you?\" and served them like it never happened. His poor daughter was mortified. Makes me have a crazy theory this wasn't the first time.\n\nEdit to add: I see a lot of people commenting on my management team sucking in this situation which sometimes, they do, but I'm fairly certain if I'd gone to them, they'd have kicked him out. I just didn't tell them.\n\nI have a good relationship with one, and she actually didn't even know it happened until a few months ago, because I just never brought it up. If it happened now, I 100% would not tolerate it. They're actually pretty good for banning people lol, we have quite the roster of people who are just told \"OUT!\" When they enter\n",
    "score": 6988,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1i6kug7/a_man_tried_to_pull_on_my_septum_ring/",
    "created_at": "2025-01-21T15:16:52.000Z",
    "num_comments": 316
  },
  {
    "id": "reddit-1iarl4n",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "A lady called to warn us about her husband",
    "text": "Officially had one of the wildest experiences in my 4 years of serving last night. \nGot sat with a two and a half top. A husband, wife, and their new baby in a stroller. When the hostess came to let me know I got sat, she informed me that the wife at the table called ahead of time to let us know that her husband was going to be very picky and difficult. \n\nBefore I  even got greet them, they asked to switch tables two times for whatever reason. Once they were finally situated, I go to greet them, and the husband let me know immediately that they were ready to order. He proceeds to order around $130 worth of appetizers, entrees, dessert, AND gets three different drinks for himself, all in one go. His wife, quiet as a mouse, just orders a drink. During his order, he was so aggressive making demands and asking  in-depth questions about every single food item he was ordering and modifying it in some way. And every few seconds while he was ordering, he’d bark and remind me that he wanted it “I WANT IT HOT. FRESH. DELICOUS.” I filled a notebook page with this guy’s order. He also asked his wife if she wanted a tequila shot, and she shook her head no. He turned to me and said “gotta set the mood right, ya know? we just had a baby” and smirked and chuckled at me which I did not acknowledge in any way. \n\nThey got their drinks, and I was told by my coworker that the wife said she didn’t like her drink and wanted to replace it. Their food started coming out while the replacement was being made, and as I was dropping the new drink off, the husband looks at me and says, “yeah, we got a BIG problem. i didn’t like ANY of it.” and i apologized and said i would be right back with my manager. i immediately went to go grab my manager and tell him what happened, and as we are walking back to the table, they are GONE. they LEFT without paying their bill. we had to just comp the whole thing, but it was absolutely bananas. i’ve had tables leave without paying their tab, but it’s never been intentional. absolutely wild man. ",
    "score": 6844,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1iarl4n/a_lady_called_to_warn_us_about_her_husband/",
    "created_at": "2025-01-26T21:52:16.000Z",
    "num_comments": 213
  },
  {
    "id": "reddit-1i2bja4",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Guest called me a B**** twice within seconds of entering the restaurant. ",
    "text": "This happened last Saturday and I'm still mentally replaying the interaction, so I decided to write it out to try to move my brain on from it. \n\nI (42m) work as a server at a busy neighborhood bar with good food near a major sports arena in a top 3 US city. An NHL game ended around 10 pm on Saturday, and as expected we got the third rush of the night within 30 minutes of the final whistle. The table nearest to the door had opened up, and it being the only available table in the room combined with the fact that our establishment does not generally need a host so we don't have one, it was quickly beset upon. As it was still covered in empty glassware and food detritus, I rushed to clear it and clean the tabletop to make room for new guests. A group of four men in their mid to late 40s who had ordered drinks at the bar stood over it as I cleaned, and I said \"just give me one second to clean this table for you guys\". \n\nThe conversation that followed is the most ludicrously rude interaction I have had with a guest in my 29 years in the business:  \n\n**GUEST:** *(laughing to his buddies)* Yeah, clean my table, bitch!\n\n**ME:** *(finishing cleaning the table)* Excuse me, do you want to rephrase that?\n\n**GUEST:** *(still laughing)* Yeah, clean my FUCKING table bitch!\n\n**ME:** *(finished cleaning, guest now seated)* Did you seriously just call me a bitch twice within seconds of meeting me?\n\n**GUEST:** Yeah man, it's just a joke!\n\n**ME:** Calling someone you don't know a bitch isn't a joke that's even remotely funny.   \n\n**GUEST:** Its all good dude!\n\n**ME:** No, it's not all good. Do you want to stay in this bar? Because if you do, I'm going to need an apology out of you, am I clear? \n\n**GUEST:** Whoa, you're fucking serious?\n\n**ME:** Do I look like I'm fucking joking? You're out of here if I don't get a sincere apology out of you this second.\n\n**GUEST:** Jesus fucking Christ man, I was LAUGHING the WHOLE TIME! It was clearly a joke! You gotta be fucking kidding me!?\n\n**ME:** The joke is that you called the grown man cleaning your table a bitch in front of your buddies, not once, but twice. Fucking look me in the eyes and apologize, cuz I ain't your bitch.  \n\n**GUEST:** *(leaning towards me and making the sarcastic beg-for-forgiveness hands)* I'm *soooooooooooo* fucking *sorrrrrrrry*!!!!\n\nAt this point, I looked over to the friend who was still present (the other two had gone to the bathroom or something, I don't really care, it's not important) and asked \"is this is your friend? You support this kinda shit?\" This guy, who is clearly uncomfortable at this point, says \"Hey I just met him tonight but he seems like an ok guy.\" \n\nI'm a fairly new employee who has had some awkward interactions with a very small number guests that turned out to be long-time regulars. Our regulars (of whom there are HUNDREDS going back 15 years) are extremely protective of this bar, which is an amazingly warm and welcoming neighborhood joint with a truly beautiful family vibe that can sometimes get a bit raucous. You can say I'm a bit on eggshells about my job security, and I let that fear of losing what is an amazing job stop me from just throwing these assholes out myself, for fear that they might have the owners on speed dial and be able to manipulate the facts against me. I went and reported my interaction to management, stating that I thought I'd be able to handle them myself going forward. Management promptly ejected them from the building, which I'm grateful for my superior having my back. The assholes tried to stop me to offer a proper sincere apology, which was obviously WAAAAAAY too late by that point. \n\nI got over it and finished the shift, but you know what sucks? It's days later and I can't help but feeling shitty for it probably appearing to them that I had to go get someone else to kick them out for me. \n\nSo if you're reading this guys, fuck you. If I had worked here longer than 6 months, I would have been hustling your ass out the door myself without a second thought. \n\n\n\n\n\n ",
    "score": 5665,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1i2bja4/guest_called_me_a_b_twice_within_seconds_of/",
    "created_at": "2025-01-15T23:52:56.000Z",
    "num_comments": 237
  },
  {
    "id": "reddit-1j09xng",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "The Jesus people are really getting out of control.",
    "text": "\"If you died right now and were standing at the gates of heaven, and they asked you why you should be let in, what would you say?\" - The man at one of my tables yesterday. \n\n\nI told him that was a loaded question, that I don't talk about religion at work, and could I get anything else for them? \n\n\nHe told me if I recited the sinners prayer with him I would get into heaven. I told him I had work to do.\n\n\nThey tipped 20% and left me a miniature Bible (which I gave to my coworker because whatever religion makes you think it's okay to harass people at their job about the afterlife is *not* my jam) so that was cool I guess but like **damn**. What's up with these people wanting to \"save\" everyone??",
    "score": 5298,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1j09xng/the_jesus_people_are_really_getting_out_of_control/",
    "created_at": "2025-02-28T15:14:06.000Z",
    "num_comments": 494
  },
  {
    "id": "reddit-1ivbns9",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Guest had food Door Dashed into my restaurant",
    "text": "I swear on everything holy that this is a true story that happened tonight.\n\nMy restaurant is right across the street from a Spring Training baseball field in Arizona. When a game lets out, crowds of people literally walk across the street and come to our place. We get slammed.\n\nMy coworker got a 14 top tonight...toddlers to retirees. One of the parents in the group ordered in Door Dash, to their table at our restaurant!\n\nYou will never believe this, but here you go: They ordered the Door Dash *from our own restaurant*. The host literally walked the food over to the table from the expo window. The manager came over to ask, \"WTF?\" and the mom said, \"I had to feed my baby!\" Did she think it would be faster? (It wasn't. The food they ordered when they were sat was already on the table. Seafood doesn’t take long to boil.) Did she not want to tip (a 14 top is an auto grat)? It cost her $17 more to order it that way. Also, we're a seafood boil restaurant. Her \"baby\" was maybe nine years old, and there's a fucking McDonald's across the street!!!\n\nI am just baffled.",
    "score": 5202,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ivbns9/guest_had_food_door_dashed_into_my_restaurant/",
    "created_at": "2025-02-22T05:35:49.000Z",
    "num_comments": 253
  },
  {
    "id": "reddit-1io8a0v",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Sure, talk to my manager because of your kid's dirty diaper.",
    "text": "Served a young couple for a few happy-hour apps today. They had two 1, maybe 2-year-olds with them. Things were all fine and chill until I noticed the mom was yanking one of the kids pants up while laying them down in the booth...\n\nSure enough, yep, casually sitting next to them was an open dirty diaper.\n\nI just walked away, giving them the benefit of the doubt that they'd quickly dispose of it.\n\nNope. It stayed right there for the rest of their meal. When they asked \"Can we just pay on here?\" (pointing at the tablet) I took the tablet and said \"Absolutely, I'll go get your check ready for you and be right back.\"\n\nI wasn't planning on giving it back and letting them pay until they cleaned up the fucking diaper. When I came back to clean up their dishes I said \"I'll be right back with your check. In the mean time, if you wouldn't mind making sure that \\[softly gesturing towards the diaper\\] makes it into the bathroom trash cash? Thanks so much.\" They seemed taken aback, but agreed.\n\nI was back in 2 seconds and the diaper wasn't on the booth seat any more, but they certainly didn't have time to go to the bathroom, and I honestly thought they just threw it on the floor. Thankfully (??) they just laid it, open, on the top of their stroller. Whatever.\n\nAt this point, I'll admit I went a step perhaps too far into petty. I handed her a sani rag and said, again, as politely as I ever am, \"Would you mind making sure the seat is sanitized for the next guest?\"\n\nShe went off. \"You're bringing this up too much, what is your problem? Everybody pees. You're mentioning this too much. I'm sure everyone does it.\"\n\nI couldn't help myself. I know I should de-escalate, yada yada.\n\nI said \"In my 5 years serving that is the first time I've ever seen someone do that.\"\n\nLong story short she yelled about me to my manager. Wanted to not have to pay for her $40 5-course half-price-app meal. My manager said she'd talk to me, but wouldn't be comping anything on the bill.\n\nOh, and best part, she said to my manager that she wanted to \"Enjoy her meal and leave it there like she should be able to.\" So she fully planned on leaving it if I didn't make her take it.\n\nI asked my manager wtf she said to that. \"Nothing. I kept my fucking mouth shut or I would've lost my job.\"",
    "score": 5127,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1io8a0v/sure_talk_to_my_manager_because_of_your_kids/",
    "created_at": "2025-02-13T02:01:30.000Z",
    "num_comments": 215
  },
  {
    "id": "reddit-1l5cmu0",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Well it happened to us, ICE snatched one of our bussers",
    "text": "I just need to vent, so mods, feel free to delete .\n\nHe was 28, he has a daughter. He had an appointment with immigration, and ICE grabbed him. He worked hard. Insisted on talking in English so he could get better.  He helped me with my Spanish.  \n\nI just..don't know. \n\n3 and half more years of seeing friends taken by masked government agents. I don't know if I can do it.  \n\nHow the hell is this industry going to survive?\n\nTalk to me reddit, I'd love to keep my mind busy.\n",
    "score": 4906,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1l5cmu0/well_it_happened_to_us_ice_snatched_one_of_our/",
    "created_at": "2025-06-07T04:47:47.000Z",
    "num_comments": 340
  },
  {
    "id": "reddit-1kke5cj",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "A Husband Ended His Marriage at My Tabl",
    "text": "This happened back in 2020, but I still think about it more often than I probably should. It is one of those nights that stuck with me.\n\nI was working as a server at a quiet bistro in a small coastal town. It was a mid-week dinner shift, not too busy. A couple in their early thirties came in, and they seemed genuinely excited to be out together. The woman mentioned that it was their first proper evening out since their toddler had started preschool. She looked really happy to have a reason to dress up and enjoy some time to herself.\n\nThey ordered a bottle of wine, shared an appetizer, and even laughed a bit at the beginning. It felt like one of those sweet, calm nights when everything seems to be going well. But as the evening progressed, their energy changed. The conversation became quieter. She started checking her phone more often, and he looked like he was waiting for something. By the time I brought out their entrees, the tension was undeniable.\n\nThat was when I noticed the pale blue envelope on the table. It was placed next to his plate, and his wedding ring was resting on top of it. She was not eating anymore. She just sat there, eyes red, tears quietly running down her cheeks.\n\nHe told me he would take his meal to go and asked for separate checks. He paid and left shortly after.\n\nI did not know what to do except bring her tissues and try to be as kind as possible. She told me, in a broken voice, that he had been having an affair since she was pregnant. That night, he told her he was leaving to start a new life with the other woman and their child. The envelope contained divorce papers. She had no idea it was coming.\n\nMy manager comped her meal and called a car to take her home. She thanked me softly and walked out, still in shock.\n\nI never saw her again, but I think about her often. I wonder how she and her child are doing now. I hope she found some peace, some strength, and a life better than the one that was taken from her at that table.",
    "score": 4835,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1kke5cj/a_husband_ended_his_marriage_at_my_tabl/",
    "created_at": "2025-05-11T23:16:50.000Z",
    "num_comments": 153
  },
  {
    "id": "reddit-1j9sg1y",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Clean coffee pots save lives.",
    "text": "A little info: I was pretty much the only one who paid attention to little details and got the little details taken care of.\n\nI used to be a server/bartender at a golf course. I didn’t recall any of the coffee pots being cleaned in the last three years so I decided “let’s see if these bitches are dirtier than the line cook’s mom!” I peeped inside one and holy hell, it was beyond disgusting. Like, I was about to barf disgusting.\n\nOn a slow day when I had no tables, I spent time cleaning and sanitizing every coffee pot we had (there had to be at least 30 of them).\n\nThe next day, we’re having a lunch rush and a regular customer asked me if we’d changed coffee brands because the coffee was so much more tasty than it was last week. This regular was one of the ones who insisted on sitting in my section because I wasn’t afraid of all her food “requirements” and she thought I was awesome for some strange reason.\n\nHer: did you switch to a better brand of coffee? It’s so much better! The coffee has been a bit shot as of late!\n\nMe: I gave the coffee pots and the machines a serious cleaning. \n\nHer: ……..\nThen she bursts out laughing and says good on me.\n\nThe general manager overheard and said “nobody has ever cleaned those since I’ve been here!”\n\nMe: 🤢🤮\n\nI got promoted to shift supervisor after that. Wheeee!!",
    "score": 4715,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1j9sg1y/clean_coffee_pots_save_lives/",
    "created_at": "2025-03-12T19:24:01.000Z",
    "num_comments": 149
  },
  {
    "id": "reddit-1ifq98c",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Cried in front of table",
    "text": "\nOn Friday, I worked from 9:30 AM to 5:00 PM at a Mexican restaurant. Due to everything that’s going on with ICE, no one showed up. We usually have 7 cooks, 6 servers, a cashier (who  had to also serve), a busboy, a hostess, and a dishwasher. We only had 2 servers (not including the cashier that had to serve), and 3 cooks (our busboy had to help the cooks), and I had to bring out my own chips and salsa. I had to bus most of my tables, seat people, bring out my food, and make margaritas, do side work, and reset my tables . I was so stressed out. I took a table’s order with my mind, and right after, I took another table’s drink order. I had tables back to back, and at one point, had about 12 tables at the same time. I was doing fine until I forgot one of the drinks at a table. When I brought out the drinks, I informed the table that we were very understaffed, and they were the sweetest and very understanding. For some reason, I just broke down. Kinda embarrassed still. ",
    "score": 4229,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ifq98c/cried_in_front_of_table/",
    "created_at": "2025-02-02T05:31:30.000Z",
    "num_comments": 76
  },
  {
    "id": "reddit-1irf7eo",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "No Green Stuff",
    "text": "Five-top.  Get drinks out and ready to take order.  Fully grown man (FGM) is first to order.\n\nFGM: \"House Burger, no lettuce, no tomato, no onions, no cheese, no avodaco (sic).  With fries and two ranches.\"\n\nMe: \"...So you just want a burger and a bun?\"\n\nFGM: \"Well I need bacon.  NO GREEN STUFF!\"\n\nOkay.  I take the rest of the table's order, totally normal, and put it into the kitchen as a plain burger on a bun, add bacon.  The order comes up, I drop it on the table.  One minute goes by and FGM is pointing and waving at me.  I swing by the table.  \n\nFGM: \"I SAID NO GREEN STUFF!!\"  He is pointing at two pickle slices on the side of the plate, touching nothing.  \"I need a new burger!  There's green stuff touching my stuff!\"\n\nMe: \"Right away, sir.\"  I remove the plate, put it in the hot window.  Chef asks what's wrong, I say absolutely nothing, I've got a snowflake.  Chef nods.  I go check on my other tables and come back to the kitchen.  I pull the pickles off the plate and re-deliver the same half-dead burger to FGM.  He smirks and tells me I should learn to listen better.  Mmm-k.  Apparently I'm a f-ing moron for not typing NO GREEN STUFF!! into the order.  \n\nHe never mentioned anything about allergies or sensitivities to foods.  I believe he just never consumes vegetables.  Grow up.  ",
    "score": 4052,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1irf7eo/no_green_stuff/",
    "created_at": "2025-02-17T08:25:45.000Z",
    "num_comments": 429
  },
  {
    "id": "reddit-1lssktw",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "i caught a dine and dash group",
    "text": "today my coworker had a dine and dash on a $200 table. we were just coming off of a super busy dinner service when he noticed that one of his tables was nowhere to be found. he was very panicked so i helped him go through his receipts to see if maybe he had cashed them out and just forgot or if they had actually left. there was no cash on the table, no billfold, and no receipts that matched what their total bill was.\n\nsince i had just been cut and had no open tables, i decided to check other restaurants and bars on our street and actually found them at a bar not far away. i had a chat with the bar manager and showed him proof that we had no payment from them, so he confronted them while i waited outside with their security. \n\nthey came out and tried to argue that their bill was paid, but i showed them all the same information i showed the bar manager. one of the ladies tried to justify why they had left, claiming they waited for 30 minutes for their bill, nobody came out to check with them, they tried to get our attention to pay, etc. i simply said theft is theft and that there were two other servers that could have gotten their bill if they were finished instead of leaving without paying. i had even brought them a round of drinks when my coworker was busy with another table and i had other tables around them so it’s not like they didn’t have a server nearby that they could have spoken to.\n\nthe lady even said “you’re lucky we came here and didn’t just go home” to which i said, “you’re lucky i haven’t called my boss or the cops to handle this”. it’s important to note, this table had made a reservation so we had their information in our books and could have easily tracked them down with police assistance. thankfully i was able to get what was owed and bring it back to my coworker after 10 minutes of back and forth between me, the group, and the bar staff/security. they were promptly kicked out and banned from both the bar and our restaurant.\n\ni’ve had dine and dashes before, but never anything over $100, let alone $200. i’m happy i was able to get the money for my coworker and also grateful that this group was stupid enough to walk to another bar down the street. i know situations where dine and dashes actually get caught are pretty rare, so i feel like the universe was on our side with this one. ",
    "score": 3908,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1lssktw/i_caught_a_dine_and_dash_group/",
    "created_at": "2025-07-06T04:27:35.000Z",
    "num_comments": 130
  },
  {
    "id": "reddit-1m6f2qo",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "“I have a 6:45” “No, You have a “Right now”",
    "text": "So I’m usually a server, but today I decided to cover a hostess shift at the restaurant I work at. We’re located in a high end hotel, and the hotel is hosting some kind of work conference, so we were a little busier than normal.\n\nWe’re a reservation-based restaurant, especially during events like this. We try to pace out the floor to not drown the kitchen or the servers. Simple enough, right?\nWell, that went out the window the moment this lady walked up to the host stand. \n\nShe was polite at first, but before I could even say, “Welcome in,” she cut me off mid-sentence.\nI glance at the iPad, trying to find her name, and I asked if she had a reservation, she said no, so I looked at the iPad and found a slot for her. It was like 6:07 when this happened.\nso I hit her with the:\n“Okay, I see a 6:45 reservation—”\nAnd she immediately interrupts me:\n“No. You have a ‘right now,’ and I’d like to speak to the manager.”\n\nAt this point, I’m flustered because 1) I’m not used to dealing with this kind of aggressive energy, and 2) I’m a naturally shy person who tends to get talked over.\n\nBut I stay respectful, excuse myself, and go to the back to look for a manager. Surprise! I can't freaking find him. So I return to the front and tell her “I’ll see what I can do.”\n\nThat’s when she hits me with:\n“I just spent $6,000 on a venue at the hotel for this conference, so I need to be sat NOW.”\n\nLady.\nI don’t care if you spent $6,000, $60,000, or $6. You don’t get to talk to me like that. But again..i don't tell her that, I’m shy, I let her bulldoze me, and I seat her anyway. I put her in a section close to the kitchen, hoping to minimize the damage.\n\nBut of course, it doesn’t stop there. The poor server who got her table?\nShe’s bullying him too, ordering things that aren’t even on the menu and just generally being impossible.\n\nThen comes the cherry on top: My general manager pulls me aside and says,\n“Why were you being disrespectful to that guest?”\nApparently, that rude woman pulled my manager to the side and told her that I was being very rude to her when I barely exchanged any words to the lady to begin with.\n\nI explained everything. Exactly how it went down, from the second she walked up to the host stand, to the entitled attitude, to the fact that I tried to find him when she asked for him.\n\nHis response?\n“Well, why were you ass-kissing?”\n\nLike… HUH??\nI literally just told you the sequence of events. I don’t know who this woman is. I treated her like I treat every other guest with basic respect. \n\nIt took a whole bartender for them to pull the GM to the side for him to finally see how rude that lady was to me. \n\nEventually, the GM admitted the lady was insane but still told me we were just gonna let this slide because she’s spending a lot of money at the hotel.\n\nThis isn’t even the first time something like this has happened to me when I’ve helped at the host stand. As a server, yeah I get frustrated with hosts sometimes, but honestly?\n\nAfter working just two hostess shifts, the amount of disrespect hosts deal with is insane. And higher ups are just ok with the team being treated like that so long as the perp has money. \n\nYeah, best believe I'm already looking for other places to go because that's not it. \n\nEdit: Just found out she’s the CEO of work conference there haha..",
    "score": 3297,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1m6f2qo/i_have_a_645_no_you_have_a_right_now/",
    "created_at": "2025-07-22T14:08:31.000Z",
    "num_comments": 216
  },
  {
    "id": "reddit-1nwar6i",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Customer tried to pay with a picture of his credit card.",
    "text": "A man in his 30s finished his meal, I brought the check, and he whips out his phone, opens his photo gallery, and holds up a picture of his credit card. I told him I couldn't run that. He got genuinely angry and said, \"It's the same numbers! How is this any different than Apple Pay?\" My manager had to explain what a physical card was. I don't get paid enough for this.",
    "score": 3180,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1nwar6i/customer_tried_to_pay_with_a_picture_of_his/",
    "created_at": "2025-10-02T17:49:56.000Z",
    "num_comments": 21
  },
  {
    "id": "reddit-1j6db2y",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "underage hostess wanted alcohol",
    "text": "i’m a server at a corporate sushi chain and my coworker, a 19y/o hostess came into the restaurant with three of her friends on a busy friday night. I know she’s underage but the whole table proceeded to order drinks, and when i asked for ID she started saying “(manager x)” is cool with it and “you won’t get in any trouble”. I denied her and her friends drinks, and they left me $5 (in singles) on a $80 food tab, with a 50% discount. I was really busy when she came in but i gave her good service regardless. I really don’t understand how she could put me in that situation but her mom works in the kitchen and she’s a “nepo baby” of the restaurant. I still think it’s entitled and inappropriate to put me in a position of either serving a bunch of underage kids or being “uncool” or whatever. I just don’t want to get in trouble. Wondering if I should tell my boss or let bygones be bygones. \n\nedit: \n\n-“manager x” is NOT COOL with me serving minors and never said that, but is a generally chill stoner guy and employees regularly exploit that\n\n- I am 24F, so no sexual harassment or intentions exist in this situation \n\n-I’m not a prude about laws or underage drinking, at 19 I had a fake ID that I used regularly. I don’t have a problem with her drinking in general- but it’s not acceptable in my section at my job \n\n- thank you for all the advice and people reaching out empowering me to tell the truth. you guys have a lot of faith in me to stand up for the right thing and i really do appreciate all the advice and kind words \n\n",
    "score": 3168,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1j6db2y/underage_hostess_wanted_alcohol/",
    "created_at": "2025-03-08T09:05:32.000Z",
    "num_comments": 171
  },
  {
    "id": "reddit-1ikp6cl",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Largest tip I’ve ever received. Wasn’t even my table",
    "text": "I bartend at night at a chain restaurant. Our morning bartender is my arch nemesis. He’s the worst. Doesn’t clean up after himself (leaves broken glass laying around, the whole bar is sticky cause he doesn’t get a towel for the sani bucket most of the time, if he spills something he leaves it for someone else), doesn’t restock anything, doesn’t know the measurements for our prep even though he’s worked there for two years ??,  super lazy, pawns all of his tables off on others by 3:30 so he can leave right at 4 when I get there. \n\nYesterday, Morning Bartender just had one guy at the bar, no tables otherwise. The man had already ordered and was just waiting on his food, and already had two drinks. My manager was counting down Morning Bartenders drawer when he turns to me and says “does she know I’m transferring him to her?” I stopped taking his tables when he asked to transfer them to me, so he stopped asking, now he just leaves. I didn’t figure I’d be taking that guy at the bar since his food was almost out, but Morning Bartender is always in a rush out the door. I took over, the guy got his food and the only thing I got for him the rest of the time he was there was one single shot of tequila. That’s it. Dude left a $200 tip, Morning Bartender won’t see a penny of it. \n\nBefore I get anyone saying “you don’t know what he has going on outside of work, maybe he’s in a rush for a good reason” he’s not. I know exactly what he has going on outside of work, all he does is share his business, and it’s fucking girls 20 years younger than him and going to the “studio” to work on his “rap career”. He’s 40. ",
    "score": 3002,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ikp6cl/largest_tip_ive_ever_received_wasnt_even_my_table/",
    "created_at": "2025-02-08T15:03:11.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1iul1k6",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "A guest passed away during the dinner shift last night",
    "text": "Trigger warning: choking and death are discussed in this post.\n\nI work at Texas Roadhouse. Last night, a guest died during the dinner shift. He choked to death.\nI had no idea someone was choking until it was too late. No one made a big scene. No one tried to alert everyone or ask loudly if there was a doctor or nurse in the establishment. \n\nI spoke with a couple of colleagues who were closer to the scene. None of the managers attempted to perform the heimlich. ⅔ of them did not know how to perform the heimlich. A server attempted to do it, chest compressions, and mouth to mouth on the guest. Another server called the police.\n\nStaff were instructed to stay away, “go run food”, and to get back to work. Specifically, a 16 y/o bussboy, who was watching in shock and horror, was told by the manager to immediately go clean several dirty tables. He told her “are you being serious right now?” and she responded that he’d better do it. Instead of allowing him a minute to process the traumatic event that he was seeing. I cannot confirm this part but someone told me that apparently, the store owner texted the managers asking if they were “still making money.”\n\nThere was zero support from the managers. No meeting was called. Many people who work in the kitchen did not even know that it happened. One manager casually mentioned that if anyone needed to talk, that he’d be in the office, though he did not seem serious. They constantly have “alley rallies”/ staff meetings in the kitchen when they want to demand us to sell gift cards, but they couldn’t call a meeting last night after the event to simply ask if their staff were okay. Servers were crying but had to immediately return to running food and serving their tables, while the deceased man lay on the restaurant floor, laying in his own, bodily fluids. The managers did not ask one time if anyone was alright. They did not run through the restaurant to help this man. They did not seem sad. They did not try to save this man’s life at all. They were so unbothered, it was very disturbing. \nAt the end of the night, I overheard a manager talking about how when someone passes away, all of their bodily fluids leak out. How insensitive can these people be? No freaking respect. He was a human being. People loved him deeply.\n\nThe employee who tried to save the man’s life? She was never interviewed for any sort of incident report. They closed her section, she rolled silverware and went home. And one of the managers stated that the server should not have touched the choking individual, because of a potential lawsuit against the company..\n\nThe managers are callous people who only care about money. Their incompetence of how to do the heimlich, their lack of concern for the poor gentleman who lost his life in THEIR restaurant, and their lack of care for their staff who were having a hard time was absolutely unbelievable. These managers have created a toxic work environment for who knows how long, and last night was the heartbreaking breaking point. All of it felt so wrong and someone should be held responsible for this. \n\nShould things have returned to business as usual that quickly?? Am I overreacting or…         \n",
    "score": 2956,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1iul1k6/a_guest_passed_away_during_the_dinner_shift_last/",
    "created_at": "2025-02-21T07:07:24.000Z",
    "num_comments": 332
  },
  {
    "id": "reddit-1ok59bu",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "To regulars who come in daily and never tip: We hate you",
    "text": "My coworkers and I will roll our eyes whenever they come in and inwardly groan. What especially pisses us off is when they act all buddy-buddy with us like we’re friends. Like no dude, we can’t stand you and want you to leave. We once had a regular say he should get a discount(!!!!) because he’s such a loyal customer. This dude NEVER TIPS. We talk shit about you when you’re not here, bro. We often argue over who has to take these people’s tables. If you go to a restaurant a lot and start to think that because you’re on good terms with everyone it’s okay if you don’t tip, please rethink this. It’s annoying but whatever when a rando doesn’t tip. When it’s a regular? Waaaaaay more aggravating. Like if you like us so much, why tf are you stiffing us? You’re making us work for free. I just had to get this rant off my chest.",
    "score": 2952,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ok59bu/to_regulars_who_come_in_daily_and_never_tip_we/",
    "created_at": "2025-10-30T17:00:32.000Z",
    "num_comments": 77
  },
  {
    "id": "reddit-1jxkj6j",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Mac &amp; Cheese contains noodles??",
    "text": "I work in a restaurant and we have a mac &amp; cheese dish.  It does have shrimp so the menu description says \"Shrimp, x &amp; x cheese, and parm topping\" usual right?  I have 2 older woman come in and one of them orders the mac and cheese, perfect put the order in, food comes out fast, I go to drop plates.  As the dish touches the table she goes \"ummmm what's this?\".  Confused I respond, \"your mac and cheese?\".  She very quickly snaps \"This has noodles!  I'm allergic to noodles!\".  Record scratch moment, me and the woman she's with both look STUNNED.  I begin trying to explain that the \"mac\" in mac and cheese, is macaroni noodles.  She went back and forth with me for a good 5 minutes arguing that noodles aren't in the description on the menu,  that she could have never expected this to have noodles like ma'am we never expected to have to state noodles will come with a mac &amp; cheese?!  This was like 6 months ago but I truly do not think I will ever forget the older woman who didn't know that mac &amp; cheese, was a pasta dish! 😂😂 (edited for spelling/grammatical error)  ",
    "score": 2766,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1jxkj6j/mac_cheese_contains_noodles/",
    "created_at": "2025-04-12T15:58:58.000Z",
    "num_comments": 222
  },
  {
    "id": "reddit-1mm4s97",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "CaN yOu CoVeR mY sHiFt?",
    "text": "I am 36 years old. My coworkers are mainly in their 20s. I come from 11 years at a corporate desk job and find it HORRIFYING that our group chat goes off ALL THE TIME with \n(1) Can anyone cover me tonight?\n(2) Can anyone cover me tomorrow \n(3) Can anyone cover me on X/Y/Z\n\nAnd if you don't answer they private message you or corner you next time you're in AND try to guilt trip you with a terrible excuse. \n\nI have a young child at home that I homeschool, my husband works a full time physical job, and I started working here with an agreement from the big man that I am available 3 days a week. Even if I wanted to work more, i don't make babysitter money. \n\nIn the last 3 months since starting, I've picked up six extra shifts. I asked for someone to switch with me (not even cover me) for one day the end of September and CRICKETS. So, that 6th shift was the absolute last time I will cover someone. I told someone today \"no I can't cover your shift and don't ask me in the future\" because of how bitter I am about it. \n\nLast Sunday they called me 7am to ask if I could come in for breakfast. I said no sorry I'm not available today. They called me AGAIN at 3pm and asked if I could come in for dinner. \n\nUgh 😤 thanks for listening to my rant!!",
    "score": 2722,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1mm4s97/can_you_cover_my_shift/",
    "created_at": "2025-08-10T00:33:23.000Z",
    "num_comments": 198
  },
  {
    "id": "reddit-1pn0g7v",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "It's dangerous cold out there y'all, let's look out for each other",
    "text": "I'm a server in a small town in the Midwest, it's 3°f (-16.11 c). It was dead af tonight, so I got out in the second round of cuts, and went to the gas station for my nightly redbull. As I was paying, an 18-19yo kid walked in, shivering. He was in just a hoodie, wet chef pants, and soaked nonslips. His lips were blue, and he looked miserable. No coat, no hat, no gloves, no scarf. Just using the last open warm place to warm up a little.   \n    \nHe walked out a minute later and started trudging through the snow, and when he bypassed the only other car in the lot, I rolled my window down. \"Are you walking?\" I yelled. He said yes, I told him it was too cold and to get in, I have a son his age and would want someone to give him a ride if he needed it.      \n     \nHe's the dishwasher for another store in my town, and we all know that dishies are last out and get soaked through. He lives 3 miles from his store, and doesn't even have a hat or coat, no car, not even a bike. There's no public transit here, and we're a small enough town that if you order a rideshare at this hour, it'll just never come. I gave him a ride in my car, made sure he got inside, and gave him the gloves off my hands as I have more.          \n      \nI'm frankly disgusted that his manager let him walk out of there alone, and didn't offer him a ride. This isn't the kind of weather you let kill your coworkers, and it damn well could. So if you see a coworker walking home this winter, underdressed for the weather, or wet, maybe just offer to help them? It's too hard out here y'all, it's too cold. Stay warm and safe this winter!!",
    "score": 2644,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1pn0g7v/its_dangerous_cold_out_there_yall_lets_look_out/",
    "created_at": "2025-12-15T06:22:19.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1jif6h4",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Second customer I saw this morning ruined my day.",
    "text": "I work in a small but very busy local bakery. We can wear whatever we'd like and today I were a sweatshirt from my college days. I'm in my 30s but look young. The following exchange happened:\n\nCustomer: -points to my shirt- oh do you go there?\n\nMe: I did, quite a while ago. \n\nCustomer: I've heard it's become a really good school.\n\nMe: yeah, they've expanded it a lot. It's completely different now than when I was there.\n\nCustomer: is that where you got your education?\n\nMe: yep!\n\nCustomer: -smirks- so is that why you're here, selling donuts? \n\nI managed to produce a smile and politely explain that I have young kids at home (excluded the part that both have high support needs and various therapies), which sent him off on a tangent about how \"kids do better in life if their mom is home with them\" but how it's such a burden for dads to \"make everything else work.\"  \nAlso about how he's diabetic and shouldn't be eating donuts.  Sir. Why are you even here then? ",
    "score": 2530,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1jif6h4/second_customer_i_saw_this_morning_ruined_my_day/",
    "created_at": "2025-03-24T01:16:59.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1l6ruyv",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "i quit over a college graduation update: celebrity visited and had an awful experience",
    "text": "LMFAOOOOOOOOO i just got the best update ever. about a month ago i posted on here that i quit my restaurant because they refused to let me go to my partner’s college graduation - and let me just say, it was a great decision, I’ve been doing so much better without it. it was a wonderful graduation i was so thankful to spend time with him and his family. and i already have a new job somewhere else that is so much better - wellll i just got news that a prominent sports commentator/celebrity visited my old restaurant since he is in the area for a soccer tournament, and had a HORRIFIC experience there (didn’t get food or water for over an hour, management was rude and incompetent, overall awful experience) and he talked about his horrible experience on his podcast, accidentally name dropped the restaurant and now people are review bombing the place. im sitting back and eating my popcorn enjoying this right now 🤣 just wanted to tell you guys bc im getting a kick out of this, i almost feel like this is karma atp lmaoooooo",
    "score": 2371,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1l6ruyv/i_quit_over_a_college_graduation_update_celebrity/",
    "created_at": "2025-06-09T00:57:14.000Z",
    "num_comments": 29
  },
  {
    "id": "reddit-1j6j8ys",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "“I wasn’t expecting good service”",
    "text": "I bartend at the red hot chain restaurant. Last night three ladies came and sat at my bar, they each had a couple margaritas and they all ordered some variation of the same appetizer. Kitchen messed up the sauces on one of their chicken tenders but I got it fixed in less than 5 minutes. They had no problems other than that. \n\nThey asked for their checks, each check was about $30 individually, two paid in cash one paid on card. One lady paying in cash paid with a $100 bill and I watched her lay $3 down on the bar while the other two were still paying. The other lady paying in cash gave me exact change, and the third lady paying card says to me “I wasn’t expecting to get such good customer service, I would’ve brought money to leave you a tip. You should get a raise though, matter of fact bring out your manager, I’ll tell him you deserve a raise” \n\nI said “oh thank you that’s very sweet, I understand” \n\nBut I don’t understand. These ladies, clearly, don’t usually tip anywhere. She preemptively didn’t “bring” money for a tip because she was expecting there to be a problem. SO WHY EVEN COME HERE IF YOU THINK THERES GONNA BE A PROBLEM ?! \n\nI don’t look at my tips throughout the night, because I know there a lot of people who come to this restaurant because it’s cheap and they don’t want to tip. I get stiffed at least once a shift, I like to think it’s the nature of this type of restaurant and not me being bad at serving. So I wouldn’t have known that she didn’t tip me on card had she not made this big huge statement that she wasn’t leaving a tip. \n\nIn total, I made $3 on $90 from them. A little more than 3%. \nI tip out 4% to our food runners. \n\nTip your servers. Put your shopping cart back. Be a good person. \n\n",
    "score": 2281,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1j6j8ys/i_wasnt_expecting_good_service/",
    "created_at": "2025-03-08T15:15:57.000Z",
    "num_comments": 70
  },
  {
    "id": "reddit-1ieo2ys",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Why do people think that food should be free for kids?",
    "text": "I don't understand this. You don't go to the grocery store and tell the cashier you're buying food for kids and expect to not be charged. Why do people do it at restaurants?\n\nI'm a bartender in a restaurant. We make a ton of fresh squeezed juices. The kids menu comes with a free fountain drink, but there's an additional charge for fresh juice or anything bottled like Root Beer. I've had several times servers tell me that guest complain about this.\n\nWe do a lot of private events. One time a guest approached me and asked if her kid could get a small dish of pasta. I offered to get her a kids menu and she looked annoyed saying \"I just want a few pieces of pasta and maybe some orange slices.\" Right. The kids menu.\n\nI was just reading another sub where a parent is annoyed she's expected to pay for a kid at a buffet when the kid eats only a few grains of rice and edamame. My response was you don't have to go there if you don't like the prices, but you can't go and complain when you're charged per person. (Likely a policy that came from too many customers trying to share plates.)\n\nETA: I assumed it would be obvious (since this is a hospitality sub) that kids eating free referred to businesses. There was apparently some confusion thinking it meant school lunches. It did not ",
    "score": 2271,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ieo2ys/why_do_people_think_that_food_should_be_free_for/",
    "created_at": "2025-01-31T20:12:55.000Z",
    "num_comments": 206
  },
  {
    "id": "reddit-1ixh1h7",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "The effort to try to trick your server/bartender cannot be worth it.",
    "text": "I work at a tiny taphouse that is right next to a very popular small-business wing place. \n\n  \nWe only sell beer and pre-packaged foods/snacks (no kitchen) at the taphouse. However, we tell people that they can bring their own food in if they want, which is allowed because we don't make food ourselves. Many customers choose to bring wings over from next door. We have even worked out a little discount between the both of our places where if you show a beer receipt from us over at the wing place you get a discount, and if you show us a wing receipt you get a dollar off your beer. We share a lot of the same customers, so the owners just thought that would be a nice thing to promote business for both places. \n\n  \nThe wing place does serve beer, but only basics like Bud and Coors light, Corona, etc. We are a craft beer taphouse and sell a lot of different types of beer. \n\n  \nDue to both places selling beer, and our discount partnership, some people get confused and think we are the same business that is separated into two parts. Understandable! But, we have signs everywhere saying that alcohol can't go between facilities. I explain this to customers that say they have never been in before as well.  \n\n\n\nThis guy comes in and says and it's his first time in the taphouse. He says he has friends getting wings next door. To immediately nip any confusion in the bud, I explain that his friends are welcome to come eat their wings over here, and get beers with him, but he can't take one of our beers next door and they can't bring any beer in here. He starts to scoff and complain, saying that the \"kid working at the counter next door told him he could bring it over there\". Yeah, right. I explain that employee is mistaken, and it is not allowed. He also got mad that I asked for his ID. \n\n\n\nHe decides on a beer and I pour him a pint. He says he just wants one while he waits for the food to be ready. He pays and then proceeds to walk out the door with his beer. \n\n\n\nI stop him. I explain again that he can't bring the beer over there, but his friends can bring the wings over here. He starts to get mad and says he would not have purchased one of our beers if he had known that, but he doesn't want any of \"the shit beer next door\".\n\n\n\nSir. I explained it less than 5 minutes ago. Twice. You said okay.  I say that I am sorry for the confusion, but he has to finish his beer here or have his friends come over with their food. He starts to chug his beer dramatically and I resist the urge to laugh. He leaves.  \n\n  \n10 minutes later he comes back in. I ask him if he and his friends changed their mind about coming over. He says no, but he wants some beer to-go. (We offer some cans and 32 oz crowlers to-go). Before I pour the beer, I let him know he won't be able to drink this to-go beer next door. He huffs and says, \"YEAH, I GET IT.\" I offer to hold the crowler in the cooler for him until he and his friends are ready to go so it stays cold. He brushes me off, says they are taking their food to-go anyway, closes his tab again, and leaves with the crowler. I have an idea of what this guy is trying to do, but I'll take his money before confronting him. \n\n  \nI wait about two minutes and then ask someone to watch the bar for me. I go next door. I see this guy at a table sneakily pouring beer into a glass from the crowler. Nope. \n\n  \nI go up to the wing place manager/owner and let them know what's going on. The manager goes over and tells him and his friends they'll have to leave. He starts to tell the manager I said it was okay for him to being the beer over. I say NO, I did not! The guy looks a little sheepish and starts to sputter a bunch of angry toddler sounds. They all start to leave while the guy starts yelling about how we're all idiots. His friends looked embarrassed and one of them kept saying to him, \"Dude! What the hell! Why are you always an asshole?\" The manager actually ended up letting the guy's friends stay, because they didn't do anything wrong. The guy was mad his friends wouldn't leave with him. \n\n  \nI get it. I don't really drink Coors or Bud either. But you could have just come over and had your wings and watched the same exact game on TV, and had good beer at our place. Instead, now neither place wants to serve you ever again. How did that work out for you? ",
    "score": 2240,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ixh1h7/the_effort_to_try_to_trick_your_serverbartender/",
    "created_at": "2025-02-24T23:56:23.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1lbi6t9",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Walk in 9 top tried to get me fired 3rd day on the job",
    "text": "It’s my third day on the floor at my new job. It’s an upscale (one step below fine dining) restaurant that had us train for 2 weeks, learn the menu and pass a certification in order to even serve. After many nights of shadowing and studying, I passed and I’m getting my own sections. \n\nWe’re typically reservation only aside from the bar (which seats 35) unless it’s empty on the off chance. This group of 9 older people came in and I was given them. They said they had only an hour and 30 mins and I informed them that our kitchen is from scratch so everything is made to order and takes time. They say it’s fine and I go ahead and get their orders in. \n\nTwo people order the fried chicken, which is written on the menu as being “worth the wait” cause it takes 15-20 mins to cooks. I tell them this and suggest a chicken sandwich instead but they wanted the plate. \n\nI put in their orders and after 9 mins (my manager/expo checked the ticket) they flagged me down and asked when their food would be coming out. I said minimum 10-15 mins and that they’re a large party and there are tables ahead of them. They’re upset and complaining. \n\nI’m smiling and apologizing. I let the manager know and he’s like fine we’ll rush their order. About 5 mins later they tell me to just make everything to go. The kitchen had already started plating and now we had to scramble to make it to go. \n\nAs the food starts coming out they ask me for their tickets and I start dividing it up. My manager puts the 18% auto grat on since it was a party above 8 ( standard written corporate policy). I start separating their tickets but now they’re flagging down another manager and asking for items to be taken off and this and that. \n\nMy manager tells me to go greet my new table and when I come back one of the guests are telling my manager that I had an attitude and that I was throwing their to go food at them. (???????) As they’re leaving they’re telling me that I got lucky making so much money off of them for food that’s not even worth the price nor being made from scratch. (Our menu is 30-80 dollars on average) I tell them that I’m sorry and to have a nice day. \n\nAnother two tell my manager that I swore at them (I’m literally a crybaby pushover I don’t do this to my enemies let alone customers who determine my pay). My manager asks to speak to me in the kitchen and I’m just overwhelmed and start sobbing. \n\nI’ve been unemploymed for a while and I’m in the red on my credit card and have no more savings. This job is my last life line right now. All this and the fear of getting fired just had me boohoo crying. \n\nThankfully my manager said he saw the situation and knows they’re lying and that I’m okay and not gonna get fired lol. They let me go take a breather but I was literally weeping while rolling silver lol. \n\nAnd like this isn’t my first server job nor hospitality job. I’ve had guests yell at me call me slurs and etc, but this situation just really got to me. \n\nSo yeah, that’s my rant. Now I’m heading to my closing shift. ",
    "score": 2150,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1lbi6t9/walk_in_9_top_tried_to_get_me_fired_3rd_day_on/",
    "created_at": "2025-06-14T20:24:34.000Z",
    "num_comments": 54
  },
  {
    "id": "reddit-1m196hk",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Pico de gallo girl",
    "text": "Friday night, 30 minutes before close, I get sat a table of three. A little disheartening, but hey, money is money. I greet them and ask what they’d like to drink. Guy one orders a normal drink, girl two orders a normal drink, girl 3 wants hot tea. Ok fine. Annoying but it’s my job so here damn. \n\nI bring them their drinks and ask what they’d like to order. Everyone orders and girl three asks what sides we have. I start naming everything under the sun I can think of: truffle fries, garlic fries, onion rings, ceaser salad, mashed potatoes, etc etc. She decides on a side of broccolini and fries. After that she asks me what our best proteins are. I tell her shrimp and chicken are my favorites and she decides on a shrimp taco. \n\nHere comes my favorite part:\n\nHer: “Do you guys have pico de gallo?”\n\nMe: “No, I’m so sorry, we don’t. I wish we did tho :(“ \n\nHer (in a condescending butthole tone): “you have onions don’t you..? You have tomato’s don’t you..? You have cilantro don’t you..?”\n\nMe( plastering the fattest most sarcastic smile on my face): “yes we do.”\n\nHer: “..Then you can make it can’t you?” \n\nI’ve never wanted to sock someone in the face more in my life if I’m being honest 😭 \n\nEdit: I wrote this super late and forgot to include this: When I went back to make the pico girls tea, we were out of the tea glasses bc we keep all of them on the same shelf and a server accidentally dropped it. So I brought it out in a paper cup and even explained that to her. She still got mildly annoyed and said “that’s ghetto” 😭 I just laughed it off and agreed with her for the sake of my tip. And they still did tip me so it worked.  ",
    "score": 2120,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1m196hk/pico_de_gallo_girl/",
    "created_at": "2025-07-16T10:36:13.000Z",
    "num_comments": 194
  },
  {
    "id": "reddit-1jbai5m",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "A customer stole my food as I was about to go home",
    "text": "I just finished my shift and ordered boneless wings to go, extra wet so that they wouldn’t be dry by the time I got home. I went up front to the host stand to get my stuff together and leave, just like always, and I set my to go bag, with the bright yellow ticket reading my name and on the order taped on the bag, on the bottom shelf of a tall rack next to the host stand. \n\nThe rack is used for to go orders, but only the top shelf, while the other three shelves are regularly used for storage. We also have a sign on top of the rack that says to not take to go orders off the rack, let the host do it.\n\nI stepped away for a minute to call someone, was gone less than 5 minutes, and came back to find my food was gone. The host just came up front, she had gone to the kitchen after I stepped away, and I asked her if she had seen my food. She was really confused, then said it was possible that a customer could have taken it. She said she had just checked a guy out while I was away and told him it would still be a few minutes for his order, and she went to the kitchen to check on the order.\n\nWell, he was gone now so we called him. I listened to the whole call, she told him he had the wrong order and needed to come back because his order was still being made. And he said, “I’m going home first and will make sure it’s the wrong order.”\n\n….No, we’re telling you that is the wrong order. You JUST left, all you had to do was turn around!\n\n10 minutes later he calls us back. He says, “After taking a look at the order and the ticket on the bag, it’s the wrong order.”\n\n…Yeah, that is what we TOLD YOU!\n\nHe came back and didn’t even apologize for taking someone else’s order. He just barely stuck his head inside, handed it over, grabbed his, and made sure he got his ranch before leaving without another word.\n\nI was so upset about it, and by the time I got home the wings were dry. This guy is a regular to go order customer, who took the bag that was at the bottom shelf, at the floor, and assumed it was his after being told his wasn’t ready. Then left without telling anyone.\n\nWhat goes through people’s heads when they do things like this? He looked and talked to us like HE was the one being inconvenienced. I told another host about this and they said it was perfectly fine and nothing wrong about it, but that they’re only saying that because they like him.\n\n\nEDIT: Adding that, though it’s technically next to the host stand, the rack is mostly behind it, so a customer actually has to talk to a host to get their order, besides the sign on the rack saying to talk to a host for an order and not grab bags. This customer, a guy who orders to go every week, the second the host walked away to check the kitchen after telling him his food wasn’t ready, just grabbed my food off the bottom shelf and left. The bottom shelf is storage, my food was surrounded by spray bottles, other cleaning supplies, boxes, and lost and found things. It was also separated from other to go orders by 3 shelves, being on this bottom shelf that touches the floor and has storage on it.",
    "score": 2055,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1jbai5m/a_customer_stole_my_food_as_i_was_about_to_go_home/",
    "created_at": "2025-03-14T18:23:02.000Z",
    "num_comments": 112
  },
  {
    "id": "reddit-1j2bsjs",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "That time our restaurant was overtaken by Promise Keepers",
    "text": "The earlier post about the after church crowds on Sundays reminded me of a traumatic experience early in my career. \n\nAt the time, I worked at a regional, now defunct chain of family restaurants. Our clientele was largely local, but as we shared a parking lot with a small motor inn, and were located just off the freeway, we had our fair share of budget travelers. \n\nOne weekend, the Promise Keepers were in town. If you have never heard of them, they’re a national evangelical Christian men’s group who would hold these big rallies in football stadiums all over the country. Remember the budget motor inn next door? Yep, sold out with PKs.\n\nI show up to work the breakfast shift that fine Saturday, and things start off normal, pretty slow actually. Then the PKs start rolling in. Some alone, some in small groups. Then before you know it, the rest of them are flooding the lobby and out the front door. It wouldn’t have been so bad if they had actually read and adhered to the “Please Wait to be Seated” sign. Instead, like a proverbial plague of locusts they swarmed the restaurant, sitting where they wanted, all at once, all expecting immediate service because dammit, we can’t be late for the rally!\n\nIf you think the Sunday holier than thou crowd is bad, there was literally no comparison to this group. Rude, misogynistic, and of course crappy tippers. Quite frankly, the nail in the coffin to my becoming a liberal agnostic feminist. Did I mention the separate checks? This was 30+ years ago when it wasn’t easy to do. \n\nThanks for the trip down memory lane. May you all be blessed with comfortable shoes, good health, and big tips!",
    "score": 1649,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1j2bsjs/that_time_our_restaurant_was_overtaken_by_promise/",
    "created_at": "2025-03-03T05:45:13.000Z",
    "num_comments": 95
  },
  {
    "id": "reddit-1kp68rz",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "The time I got $400 dollar revenge on an abusive customer",
    "text": "Burner account because even though this was a decade ago (I was 21 working my way through college), I'm not risking any trouble.\n\n\nTen years ago, I worked at a now-defunct restaurant in the Baltimore Harbor. We were a fairly busy restaurant, especially for brunch, but unfortunately, most of our FOH staff was incredibly unreliable. The day was July 5th, which was a Sunday, and we expected to be incredibly busy because it was a holiday weekend. When I showed up, only 3 of our 7 servers, 1 of our 2 bartenders, and half the expected amount of BOH had come into shift. So as you can expect, I was SWAMPED with tables. What was supposed to be just the patio section of 6 tables, I now had the patio and part of the inside, a combined 12-tables section. Honestly, it was hell, but I was somehow keeping up with everything. My guests could tell we were understaffed, and most were pretty understanding that I wasn't as attentive as I’d like to be; I think because they saw me running around so much.\n\nAnyways, it's towards the end of the shift, and I get a table of 3 gentlemen who from the jump seemed like they were going to be a pretty needy table. I go over, greet them, and ask if they wanted to start with drinks. They said they'd need a minute. Maybe 3 minutes pass, I come back, and before I can ask about drinks, they tell me I took too long and then they ask for my name and tell me it was rude that I didn't introduce myself by name. If I wanted better tips, I should start doing so. For context, for whatever reason, our owner didn't want us introducing ourselves by name, only as their server, but could tell them if they asked. I told them this policy but happily provided my name. I asked if they wanted to put in some drinks, and they obliged. I ring in the drinks, and about 5 minutes later, they wave me down and before the drinks are delivered, tell me they all decided they changed their minds and wanted completely different drinks. I had to run over to our ONE bartender for the entire restaurant and tell her not to make the drinks, while she was halfway done. She was understandably pissed.\n\nI put in the new drinks and then go back to see if they're ready for apps and entrees, they say yes, and order. Five minutes later, a man from the table comes to talk to me while I'm at another table, and they again decide they changed their minds on their orders and wanted to change the appetizers. I had to excuse myself from the other table, flag down the chef, and explain the situation. If you remember, the BOH is also extremely short-staffed, so he is also rightfully furious.\n\nSo we now have a pissed server, a pissed bartender, and a pissed chef.\n\nMy service manager calls for hands, and I bring over their appetizers. Five minutes later, their entrees come out. As I check to see if they have everything and if everything is okay, they tell me it's not. They were upset the entrees came too close to the appetizers, so they want them comped and a round of free drinks for the hassle. I told them I’d speak to my manager. I explained to my manager, and now she's angry too. She goes over to talk to the table, and when she came back, she says to comp one app, but nothing else.\n\nThe last piece of the puzzle has been collected.\nEveryone now hates this table.\n\nAt this point, I’ve had enough and stayed clear of this table as much as I could other than to fill waters and pre-bus. Towards the end of the service, one of the men asked me how long I’d been doing this. I told him, and he told me I should quit and find something else to do because I was really bad at it. I just laughed it off, walked away, printed their check, and dropped it off. I had my manager run the card, but I didn't want to go back. After they left, I went to pick up the check, and of course, they stiffed me; they left me $2 on a $130 bill. As I started clearing the rest of the table and the napkins, I saw that this man left his Audi key FOB under his napkin. I quickly put it in my pocket to bring to the host when I had time.\n\nA few hours later, the host got a call from the guy asking if we had found a key. The host said nothing had turned up yet, but she'd check with your server.\nApparently, when she said this, the guest made a comment about how I probably stole it because I looked like the type. As the host told me this, I kind of just lost it internally. I told her I hadn't seen it, and a plan was devised.\n\nI proceeded to walk to the back of the restaurant, out the back door, and tossed the keys into the Baltimore harbor. Not my proudest moment, but after all said and done, I think it was well deserved. And man was it satisfying.",
    "score": 1601,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1kp68rz/the_time_i_got_400_dollar_revenge_on_an_abusive/",
    "created_at": "2025-05-17T23:26:40.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1keuw0j",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "I ugly cried at work",
    "text": "We have a couple sets of guests who always keep us on our toes. The lowest they ever tip is 30%. They regularly tip 100%. Every once in a while, they tip for Jesus. Honestly it’s great from their perspective. They always get the best service because their tips are always great but never really based on night to night service or bill total. You can give the same service one night and get 30% and give the same service the next night and get 100%. The point is that they always get great service because you never know how they’ll tip. \nAnyway, so average night at the bar, they come in after having dinner so it was just drinks. Same as always, regular jokes and banter, tell them goodnight as they leave. Then I picked up the slip. \nIn very intentionally legible print, they wrote $1000 in the tip line for a bill that was under $100. \nI stared at it for a minute. Then everything went blurry. Honestly the most generous tip I’ve ever received at a time I really needed it. I’m still behind the bar with guests as I start ugly crying. Someone came to comfort me with a hug and I had to tell them that no, I’m happy. I was so touched. I haven’t seen them since but when I do I’m definitely going to let them know how much I appreciated that. Once in a career blessing from good regulars. ",
    "score": 1452,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1keuw0j/i_ugly_cried_at_work/",
    "created_at": "2025-05-04T21:26:14.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1j816bb",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "First Time I Ever Had to do This",
    "text": "Lemme start this off by saying I love weed. Marijuana is literally the best thing for my anxiety, and if there's a benefit you can glean from it, I suggest you try it. Hell, I'm even smoking right now!\n\nA couple nights ago, I didn't have the busiest floor, but like a two-top every ten feet kinda deal. This dude walks in... and he *reeked*. Skunks, loud, and thick. Like, I could taste him before smelling him kinda dealio. \n\nAnd my other guests could too. While this guy looked over the menu to order, I watched my other guests begin to murmer and make comments. I was annoyed by all this, for sure, but I also felt embarrassed for him.\n\n\"My dude, can you step out for five minutes and come back in? We can do this all over again.\"\n\nHe looked at me confused. \"Everything ok?\"\n\nSo whisper to him, \"Oh yeah, it's just... we can *smell* you.\"\n\nHe gets it, nods his head, and scurries out, but the smell lingers behind him for longer than he stands there! \n\nWhen he comes back in, it's a much different story and he's aired out. I was happy he could sit at my bar and enjoy himself, and watch the Celtics beat out the Lakers. I know Luka's gonna have a great career, but what the Mavs' ownership is doing is the real assault to our senses.",
    "score": 1397,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1j816bb/first_time_i_ever_had_to_do_this/",
    "created_at": "2025-03-10T15:25:04.000Z",
    "num_comments": 55
  },
  {
    "id": "reddit-1ioy9j1",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Disturbing secrets of your favorite restaurant",
    "text": "I worked at a very popular restaurant chain as a waitress, I won’t put the name of it, but I’ll give a hint “the red fruit, and buzzing bees”.\nAlmost every dish should be considered poison.\nEspecially the broccoli. When a kid would beg their parents for fries and the parent made them go for the healthier choice, broccoli, I felt sick knowing they would have been so much better off with the fries. I’ll just list off the horrible food practices this chain partakes in,\n\n1. Heating up mashed potatoes, broccoli, Mac and cheese, *sometimes* cut up cooked chicken and soups in very thin plastic baggies. The box they come in states “DO NOT MICROWAVE”.\nI’ve had to pull off broccoli from the baggie on the expo line, leaving holes in the baggie and apparent plastic melted into the broccoli.\nEvery customer, child and baby that eats these are left with billions of micro plastics in their body, yet have no idea of this.\n\n2. The staff (servers, cooks, hosts, even managers) picks food off your plate with bare hands and eats it whenever they feel like it. I bet this is a common thing in fast food and restaurants, but it truly is so disappointing seeing that so commonly in this restaurant and definitely can’t be left unsaid. \n \n3. In this location particularly and the other location the city over, the ice machines have black mold growing in them, which the servers pick out of drinks all the time before serving them, if the drink is dark, like berry bash Mountain Dew, “they won’t even notice”… disgusting. \n\nIf you know what restaurant I’m talking about, I truly would never dine there, ever. Not to mention,  their $17 Salmon is a tiny little frozen packaged fillet, you can make 100% better at home.",
    "score": 1306,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ioy9j1/disturbing_secrets_of_your_favorite_restaurant/",
    "created_at": "2025-02-14T00:41:12.000Z",
    "num_comments": 144
  },
  {
    "id": "reddit-1m2as9s",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "He Brought His Mom",
    "text": "Thursday night, it wasn’t going to be that busy. My spot over-staffs the place to death and I had a shit section. \nSo I had the mindset that I was going to make more money than anyone that night. A game. \n\nLast call for happy hour, every drink was an up sell, I took every table offered to me regardless of the distance from my section. I was remembering names. My tips that night were 40-50% from a lot of these guests.\n\nMy last table was two dudes playing pool. When one started to flirt (in an atrocious way), while I didn’t flirt back, I thought, this could be my best tip yet.\n\nHe kept asking for my number. This man could have been my father.  I told him gently I don’t give my number out at work. After he continued, I handed him a pen and said “you can give me yours.” \nThis way, he doesn’t feel rejected, and I could just throw it in the trash. \nI slip it in my apron and carry on with my closing duties. \n\nPrince Charming offers to pay for his friend as well, and thinkng he’s trying to flex, I leave him with the handheld POS to input the gratuity. \n\nHe reminds me to call him and they leave. \n\n17%. My lowest tip at that restaurant as a whole. \n\nThe other servers and I were laughing at how much of a loser he is, and I joked about texting him “was there something wrong with your service today?” \nThey thought it would be so funny, and so I did, immediately realizing my mistake as now he knew my number. \n\nSure enough, the FaceTime calls start rolling in. He wants me to come get cash from him as a proper tip. Of course I would never do this. \nHe claims he’s fallen in love, love at first sight. He’s head over heels. \n\nOh boy. I tell him I’m not interested, to have a nice life, and I block. \n\nWell the next day, I get a phone call. It’s his mother. \n\nShe thought I would be at work. Her son had brought her there to meet me. His MOTHER. Said I was the one. But I needed mom’s approval first. \n\nThis is a new one for me, guys. ",
    "score": 1267,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1m2as9s/he_brought_his_mom/",
    "created_at": "2025-07-17T15:36:43.000Z",
    "num_comments": 71
  },
  {
    "id": "reddit-1ludr8r",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Served a table who thought my uterus should whitewash my kids…",
    "text": "So I work at a European pub, which already draws a certain type of crowd. Had this table for brunch yesterday husband and wife.\n\nWe got to talking about the gold cup. They were big time yappers and I am too. It was easy to get a long with them, where I could share personal things and they shared about themselves too. All cool, is how I build regulars. I mentioned how hype it was that Guatemala (where I was born) beat Canada because our sports are criminally underfunded. Husband decides to quiz me: “Well if it was Guatemala vs USA, who would you cheer for?” I said Guate, because they deserve a win. Dude got legit butthurt I didn’t say USA. Like sorry for rooting for the underdog country I still have deep ties to? My bad for wanting my people to have a moment of joy.  Through out their time there, they made such nasty comments…like his wife mentioned how she was glad she didn’t have girls because se they would have been strippers or have done 🌽 \n\nWhat left me BAFFLED was that the husband said I was to “too tall” to be Guatemalan. Mind you, I am 5’3. All Guatemalans are supposed to be “fun sized” I guess. Just a caricature of the indigenous person. \n\nIt gets better. Later I mentioned my boyfriend (he’s Swedish) and showed them a picture. Guy literally says, “Oh I bet you hope your kids get his genes.” 🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡🤡\nYeah, because clearly I am just using him for the melanin dilution. His wife was gorgeous and but still complicit, sitting there giggling through it all. Literally entertaining so much ignorance. \n\nI smiled, I laughed, I went along with it, thinking maybe I would get a decent tip for the emotional labor of being their exotic exhibit. Didn’t happen. \n\nThey even asked if I could serve them again next week. 💀💀💀💀\n\nWent in the back after and absolutely crashed out to the other servers. Because I’m so damn tired of my whole existence being about me being the stereotype of my country. I am fellow American who likes the same greasy bar food they do.\n\nI’m still so emotionally exhausted, I have faced subtle racism here and there. It sucks, but I guess I was friendly enough to these folks that they just felt comfortable enough to show the pieces of 💩 they are. ",
    "score": 1243,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ludr8r/served_a_table_who_thought_my_uterus_should/",
    "created_at": "2025-07-08T02:54:30.000Z",
    "num_comments": 58
  },
  {
    "id": "reddit-1i59lag",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Got so busy we were forced to close. ",
    "text": "I am not actually a server, im a front desk agent and the hotel i work for has a restaurant. Usually during the winter down season they are lucky to see 10 tables a day, so only 1 waitres and 1 chef is scheduled. \n\nLast night was definitely a outlier. We got so busy that i had to leave the desk unattended to go help serve, and even with 2 servers we couldn't keep up. We called our managers so they could come help us since they were supposed to be back from dropping off the hotel's GM at the airport, but instead of getting help, we were told \"Figure it out, we arent close\". We were also running out of stuff and couldnt get more without a managers key, so the 3 of us decided to close the doors, finish serving who was already there and not seat anyone else, closing 2hrs early, because we couldnt handle it. \n\nWhen our managers got back, i was yelled at for leaving the desk unattened, and the chef and waitress were yelled at for closing early. I still think we were in the right, you cant possibly expect 2 servers and 1 chef to keep cranking out back to back $1000 hours while running out of product with a at capacity restaurant full of drinking hockey fans cheering on their loosing team, and with 2 tables that needed special accommodation for disabilities. Its just not reasonable and not what we signed up for. ",
    "score": 1196,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1i59lag/got_so_busy_we_were_forced_to_close/",
    "created_at": "2025-01-19T21:27:55.000Z",
    "num_comments": 87
  },
  {
    "id": "reddit-1i8kmel",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Girl tried stealing my tips",
    "text": "So at work today I work at a little cafe/ restaurant small business owned, She started waving me down to take her order when i had 10 tables sit all at the same time that didn’t even have menus or waters yet (mind you this was 2 minutes after our doors opened) so I said one minute, I also had 4 bills of drinks I had to make. I went to go drop menus off at tables and she started telling me her order. I politely tell her I am not ready to take her order and my other server goes over and takes it. She was sitting for not even 3 minutes before doing all of this which frustrated me. Fast forward to her coming to pay, her bill was $25.90 and she handed me 25$ I told her that she’s short 90 cents and she GRABS OUR TIP JAR AND SAYS “oh there’s no money in here i can use??”. I was so shocked that she had the audacity to do that I was speechless. Finally I said no sorry and she asks me if i had any money to cover her. My manager just said it’s okay it’s 90 cents i’ll get it and she walked away. No tip AND she wants to USE OUR TIPS. This was the craziest story i’ve ever encountered while serving I had to share 😂",
    "score": 1078,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1i8kmel/girl_tried_stealing_my_tips/",
    "created_at": "2025-01-24T02:06:44.000Z",
    "num_comments": 102
  },
  {
    "id": "reddit-1o7w3g1",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Awful tippers that come back",
    "text": "I treat first time guests with the best service I can. If they tip bad, I know it’s not me. I’ve had tables who were so high maintenance that tipped me amazing and I have had tables who treat me like we are besties and tip me below 5%.\n\nI had a family who said I was the best server ever. So high maintenance but I just did my best. Six refills for the parents each. The husband kept talking about cosplays I should do (not cause I showed interest, but because of people he thought I looked like???) the wife was complaining about everything. The children were in behaved and the parents did so little to try to discipline or calm them down. I had to find some obscure syrup for the son to use cause he liked it and we had it like two years ago. Tipped me 2 bucks on 100. \n\nNow I’ve seen this family come in over and over again, and by the luck of god it’s always after or before I clock in that they are already sat with a different server. I have warned every server to not serve them well as they will run you down and tip you nothing. \n\nI overheard them complaining that every server they’ve gotten was awful every time  they go out except me. My godly coworker who is much more straightforward and deadpan than me says “oh yeah I remember, you tipped her $2 on $100. I guess those other awful servers are really missing out on that two percent tip” \n\nIt just felt nice to watch the dad be shameful and the mom get so mad, but had so little to say. Felt so validating. ",
    "score": 1078,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1o7w3g1/awful_tippers_that_come_back/",
    "created_at": "2025-10-16T03:46:02.000Z",
    "num_comments": 98
  },
  {
    "id": "reddit-1i40unm",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "\"We've never been treated this poorly!\"",
    "text": "I have worked in some real shitholes, over the last 25+ years. Diners, Dives, and Dance Clubs.\n\nI currently manage a wine-focused, just-under-fine-dining restaurant; I figure my crazy story days are over.\n\nWelp, nope.\n\nIt's a busy-ass night, our town is doing an annual Restaurant Week. I'm running the door. There's a table of 4 middle-aged women celebrating a birthday, I assume we were not their first stop on the night. They all get the 3-course RW option and share some wine bottles.\n\nSomewhere between the second and third course/bottle, one of the women is overcome with nausea and proceeds to dip her head below the table and unload. Her server, a woman of similar age, brings her a champagne bucket and many napkins; trying to keep the situation as discreet as possible. The server quickly gets all the deserts boxed up, the checks dropped, and all seems well as can be assumed.\n\nThe ladies stay at the table. Laughing, reminiscing, and enjoying their night, for 30 more minutes! As though there are not two trash bags of vomitous rags surrounding them, and a pint of baby-bird food on the ground, under them.\n\nI finally had to go and ask them to leave. The scent was in the air, and their table was en route to the bathroom.\n\nAs these debutantes made their way out the door, they found the need to complain to my 17-year-old hostess that \"We've never been treated this poorly at a restaurant.\" Which begs the question, where do you go on a normal Friday?",
    "score": 1070,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1i40unm/weve_never_been_treated_this_poorly/",
    "created_at": "2025-01-18T05:43:48.000Z",
    "num_comments": 50
  },
  {
    "id": "reddit-1mzgxjf",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Most stupid thing I’ve experienced in my career",
    "text": "I work at a comedy club and we have prepaid food and drink packages. This couples package has 2 drinks each on it, she orders two Hennessy lemon drops (that itself should be illegal) and decides to make them doubles for 5 dollars extra each. \n\nAt last call she asks me for a double Henny shot which is extra because they used their drink tickets. I charge her card and after giving back the check she complains it’s rang in as a double Henny not a single plus 5 bucks. I explain I can’t do that because she used her tickets so I charged her a double and they are the same price. \n\nAfter the show she complains to my manager for over 10 minutes about how I misled her and she made him reserve the order and charge her the way she wanted. It’s the same price down to the penny, a single plus 5 is the exact same price as a double. \n\nPeople are insane. ",
    "score": 742,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1mzgxjf/most_stupid_thing_ive_experienced_in_my_career/",
    "created_at": "2025-08-25T04:21:51.000Z",
    "num_comments": 75
  },
  {
    "id": "reddit-1j1lq45",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "What’s The Dumbest Thing A Customer Has Ever Said To You?",
    "text": "I was recently reminded of a story that happened to me years ago. While I’m no longer a server, I did it for many years and wanted to share the story here, as well as ask for similar stories from all of you.\n\nI was working as a server at Red Robin about 20 years ago. They’re all over the US, so I assume most people here know what they are, but for those who don’t, it’s a typical American family burger joint with loud colors.\n\nWe had coasters with lame jokes on them. One of them at the time said, “If hamburgers are from Hamburg, does that mean cheeseburgers are from Cheeseburg?” After dropping off a table’s drinks, a young woman held up the coaster, showed it to me, and asked, “What’s the answer to this riddle?” It’s one of the few times I found myself completely at a loss for words and didn’t know how to respond without making her feel like an idiot. Luckily, her boyfriend said, “Honey, no…” after doing a literal facepalm and noticing my jaw agape. I then just turned around and walked away, trying not to laugh.\n\nThere are a million dumb questions I’ve been asked in my service career, but for some reason, this one is especially memorable. So now I ask you all — what’s the dumbest thing a customer has ever said to you?",
    "score": 501,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1j1lq45/whats_the_dumbest_thing_a_customer_has_ever_said/",
    "created_at": "2025-03-02T07:48:27.000Z",
    "num_comments": 261
  },
  {
    "id": "reddit-1i36oc7",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Paying and eating in a restaurant does not give you entitlement to make the worker's life more difficult ! WHY DO PEOPLE DO THIS ? DO YOU HAVE ANY CONSCIENCE ?",
    "text": "The restaurant closes at 11:00 PM and sure enough there is 1 table left that has finished eating 1 hour ago and has only drinks on the table. 10:55 PM I ask to bring the bill to the table because restaurant is closing soon, sure enough they want to order one last drink. ( OK I REALLY CANT DENY THEM I NEED TO BE POLITE). So I bring them last drinks knowing they will need time to finish it up and the bill.\n\n11:00 PM. I turn off the music. Restaurant is closed. Sure enough they are waving hands calling me and ask me why did I turned the music off they were enjoying it. I explained I need to close the restaurant. They wanted me to leave the music for just few more minutes. ( OK I DONT WANT TO BUT I NEED TO BE POLITE). So I leave the music on for 15 more minutes.\n\n11:15 PM I turn off the music and I start doing shift money counting thinking they will leave after I finish up what is left to close. Sure enough I hear them \"EXCUSE ME WAITER !!!\"....I go to their table and they want another drink. This is when I deny them and say sorry the cash register is closed I can't bring you anymore drinks we are closed for the night.\n\n  \n11:40 PM. I've done everything I need to close the restaurant even changed my clothes from working outfit to civilian and I am waiting for them to leave. I can't trow them out or be rude when I already said multiple times we are closed.\n\n  \n11:45 PM. They call me again. Asking to turn back on the music and to bring them more drinks. I said I can't do that we have closed and I need to lock the door. I turned off the AC which I kept for almost an hour running after closing so they don't get cold its winter. They start asking me to give them a bottle of wine to go and they will pay tomorrow. I explained I CANT DO THAT, I can't give them anything without a bill.\n\n  \nThey started complaining how they payed a bill over 300€ and gave me a 5€ tip and I should be more hospitable to them, that I am a bad server for not giving them what they want and keep constantly asking me \"WHY\" \"WHY\" \"WHY\" when I said multiple time we have closed. They left a bad review, send a e-mail mentioning my name and that I refused to serve them. Of course I had trouble the next day with the Owner and the Manager.\n\n  \nThis is what I really wanted to say but I could not:\n\n  \nA) READ THE CLOSING TIME ON GOOGLE\n\nB) CLOSED MEANS NO MORE ORDERS, FINISH UP AND LEAVE\n\nC) I DON'T GET PAYED OVERTIME IF I DID I WOULD EARN 50% MORE EACH HOUR, MORE THEN THE TIP YOU LEFT ME\n\nD) I HAVE A LIFE, I HAVE A MORNING SHIFT, I NEED SLEEP, I WORKED FOR 9 HOURS ON FEET, I NEED REST\n\nE) I STAYED FOR AN HOUR OVERTIME BECAUSE OF YOU, I LEFT THE MUSIC TURNED ON AND AC SO YOU DONT GET COLD\n\nF) WHY DO YOU NEED TO COMPLAIN AND USE MY NAME TO SEND AN E-MAIL, WHY DO YOU NEED TO MAKE MY JOB MORE DIFFICULT\n\nG) I DONT CARE HOW MUCH MONEY YOU HAVE SPEND HERE, I DON'T GET ANY % OF IT, I HAVE A FIXED SALARY NO MATTER IF WE HAVE 10€ OF TRAFFIC OR 100000€\n\nH) I CANT GIVE A FREE DRINKS ON A PROMISE TO PAY TOMORROW THIS WILL GET ME FIRED IF FOUND OUT\n\nI) GO TO A NIGHT CLUB AND DRINK THERE THEY WORK UNTIL MORNING\n\n  \nYes I wrote it like I was yelling because that is what was going in my mind, but I needed to keep my mouth shut.",
    "score": 423,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1i36oc7/paying_and_eating_in_a_restaurant_does_not_give/",
    "created_at": "2025-01-17T02:54:34.000Z",
    "num_comments": 103
  },
  {
    "id": "reddit-1i63wse",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Got yelled at by 4 women last night. ",
    "text": "So this is my first post on here. I work at a really popular (and truthfully overcrowded lol) bar/restaurant in NYC. \n\nLast night I was covering a friend who was sick, and I typically avoid working there at night because the nighttime crowd comes with some very entitled, intense people. \nWhen I start the table off, everything is great, we’re chatting, vibes are good. They put in their apps, and then  8 minutes after they order their entrees. I made sure to send their meals AFTER the apps hit the table. However, I wasn’t informed that the kitchen was backed up, and it took a little while for their apps to come out. Once they did, everything still was okay, but the entrees came out too soon, about 10 mins after their apps, and they snapped out of no where. I had never seen that reaction before. They began yelling at me, and our food runners and I was shocked and a little taken aback. They blamed me for the food coming out too soon, and how the apps weren’t enjoyable because of this interruption, and how this was ruining their evening “completely.” I went to apologize, and every solution I offered, they interrupted and finally one of them said “Just do SOMETHING” \nI had a full section and other tables, and some of them shifted in their seats to see who was yelling. So I calmly took the food, and cried. Which I hate. When I get yelled at I immediately freeze and cry. \n\nMy coworker had to take care of them while I was trying to pull it together.i explained what happened to my manager, and he told me to take a second to let it out and that he would go and talk to them. My manager went up to them and told them that they made me cry because of their reaction. THATS when they got really upset. they continued to be rude to me every time I went over to check on them. Claiming they didn’t yell at me, and that I should make it right. I then offered free drinks- that didn’t work, they said they didn’t want “free shit” they wanted a good night that was “ruined”. I tried fixing it with free dessert-that didn’t work. I even had a table ask me if I was okay when I approached them, so that was indicative that these ladies were being louder than I realized. Eventually my manager took one of their steaks off the bill. And they didn’t say anything else. I hid in the back while they left because I was worried they’d yell at me again. \n\nIt was really humiliating, and I felt bad because I certainly wasn’t trying to ruin anyone’s evening. My manager told me there was nothing I did wrong. But I don’t know. I have some anxiety about returning to work for my next shift. This isn’t my main career, it’s my day job/side hustle, but I really enjoy making people happy and giving them a positive experience, and I just kept fucking it up. I don’t know.\n\nEDIT: wow. Thanks for the support from all of you. I was beating myself all night trying to figure out what I did wrong and if this was my karma. But I forget, sometimes it’s just people being people. Thank you&lt;3",
    "score": 318,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1i63wse/got_yelled_at_by_4_women_last_night/",
    "created_at": "2025-01-20T23:03:29.000Z",
    "num_comments": 148
  },
  {
    "id": "reddit-1i9evwe",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Cheapo customer flips me a nickel for my tip, but all my other tables triple their tip in solidarity.",
    "text": "So I was a career server in a Vegas casino at a restaurant with a constant line out the door. We were always slammed. This night I had an 8 table station, 4 deuces, 1 six top, and 4 four tops( we had runners). The host leads a group to my 6 top, a middle aged couple, 3 teens, and the mother of the wife. When the man sees the auto gratuity of 18% for 6 or more customers on the menu he immediately ORDERS his wife and MIL  to grab the open deuce that the other host is just going to sit. States no way is he tipping 18% and then proceeds to place  his tables order, and nastily orders me to get his wife and MIL orders. \nWe were on a POS system with about \n60 tables total in the restaurant. So the orders came into the kitchen by table number and I have no control of the sequence the kitchen is getting them in. \nBasically I put in both orders but other servers are also putting in orders so there could be my order for the man’s table, then other servers orders, then his wife’s.  My boss asks me what’s going on when the host had to backtrack the couple she had tried to sit at my deuce. I explain the situation and he gets an evil grin on his face and tells me he’ll handle it.  He then directs the kitchen to immediately fire the wife’s tables order and to wait to make the AH order.\nThe ladies order is expedited and they are served very quickly and the AH order doesn’t come for about 20 minutes. \nThe man is practically foaming at the mouth yelling at me. “ where’s my food? What’s taking so long?” And quite a bit more verbal harassment.\nI calmly explain that the kitchen fires the orders as they come in by table number and obviously since they are sitting at different tables they are coming at different times. \nThe wife and MIL are clearly embarrassed and being very nice to me, the kids are just hanging their heads trying to melt out of the whole situation. \nAt the end of their meal I drop the 2 separate checks and he lurches out of his chair and gives me the cash for both checks. I return the receipts and move on to my next task. \nI know I’m not getting tipped but I certainly wasn’t expecting him to holler something rude to me as he very fragrantly flips a nickel to me right in front of all my other customers. It soared through the air and dropped in front of me and you could have cut the tension with a knife. I DID NOT pick it up. \nHowever every single one of my tables that witnessed this aberrant behavior double, triple, and quadruple tipped me. And my boss also comped 2 of their entrees so I would not be screwed. \nAll in all I made a ton of money extra because everyone made up for his crappy cheapo self. \nThis happened in 1995 and I still laugh when I think about it!!",
    "score": 309,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1i9evwe/cheapo_customer_flips_me_a_nickel_for_my_tip_but/",
    "created_at": "2025-01-25T04:18:51.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1ix1ak3",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Egotistical College Student Servers",
    "text": "My entire career from 17 till 34 has been in or adjacent areas of Hospitality. The top group of infuriating co-worker demographics is 19-23 y.o. Wealthy college students.\n\nYou know the type; \n“Don’t need to work so it’s a hobby”\n“Parents force them to get the job one to two days a week to experience ‘real life’.”\n“Only there to try to meet people.”\n\nI could go on.\n\nI have a new one in my work/ life right now. And after the 99th time of having to babysit him and tell him to either do some work or at least help. I “snapped” and said, “everytime I look up you’re on your phone man. We’ve got stuff to do.” \n\nHis response was, “Settle down.”  \nThe attitude is, “this is my world you’re my guest.”\n\nTo wrap up. DEAR RESTAURANT OWNERS, STOP HIRING HOBBY WORKERS! And if you guys keep letting kids run over you Or coworkers like this then good staff will leave you year over year.\n\n",
    "score": 142,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1ix1ak3/egotistical_college_student_servers/",
    "created_at": "2025-02-24T12:51:32.000Z",
    "num_comments": 19
  },
  {
    "id": "reddit-1j9n0r8",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Toxic Local Coffee Shop",
    "text": "This is my very first time doing this. I worked at White Noise Coffee a locally own coffee shop in NYC. When I was hired, my job description was just barista but on the first day training was all rushed, expected me to learn all the POS and make drink on the same day then on my second day do KITCHEN, at that time they recently open a kitchen area and expected for all barista to cook restaurant style quality. They taught me once and made me do 5 orders right aways on a rush hour, while one of the owner, Han a Korean man, yelled by your ear and throwing tantrums, while Han's wife vanessa and also owner, just watch us getting abused while having a smirk on her face. Because I was not able to cook, Han threw all the utensils and pan to the sink and told me to was everything before I leave for my shift as well as if I did not clean properly it would come out from my paycheck. Naturally I quit over the phone with Vanessa and I commented in how the workplace is very toxic she decided to laugh and says \"I thought you were better, Han's attitude is like this because he was an accountant\" which made no sense at all!\n\n \nLater on in my coffee career, I met ex workers from White Noise who also everyone commented in how terrible that place was, which brings me to the topic of one particular worker who stayed long enough to know better the owners and ask why all this attitude which was: \"I want White Noise to serve like a fine dining experience, and why I am so tough to employees? It is to filter the strong ones with the weak ones\" funny enough, all the good barista that were in White Noise are the people that I met.  One way I would describe White Noise on how terrible was it, it was like \"The Bear\" the TV show, but worse because Han will physically pull and push you if you were making a small mistake.\n\n \nThank you for reading my rant",
    "score": 133,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1j9n0r8/toxic_local_coffee_shop/",
    "created_at": "2025-03-12T15:44:33.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1l95y73",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Is my manager stealing from us?",
    "text": "Hello all. This might be long but some background info is necessary.\n\nA few months ago I started working as a bartender in an entertainment venue in CA. I've worked in the service industry before, but this is my first time behind the bar. It's a larger entertainment venue with a bar and restaurant inside, for some context. My manager is the Bar and Restaurant Manager of the venue and works on a salary. He is typically with us every shift, will often do work on his computer when it's slow, and then bartends with us when it picks up.\n\nIn the past, he has told my coworkers and me that because he is on salary, he can't take from our tips. Here is where the confusion lies. About a month ago my coworkers and I were doing the math, and realizing that we were being severely underpaid on credit card tips. I asked my manager about this, and his response was that California takes a  \"crazy stupid\" amount from our tips (he said 40%.) I knew this was untrue, but decided not to push it and instead just made note of that.\n\nFlash forward a few weeks, I start taking pictures of the shift review at the end of the night to document the CC tips we are making versus receiving. My manager saw me and inquired, and I told him that I want to see just how much is being taken out for \"taxes.\" He then casually admitted that he splits the credit card tips between whoever is working a shift, including himself. For context, a typical shift is me, the chef (only one per night,) himself, and maximum one other server/bartender if its busy.\n\nHe tried to play it off as though he is actually being generous, as he only includes himself in the credit card tip pool and not the cash. This is true, but about 80% of our tips are CC, so we never go home with much cash anyway. He even threw in a line about how at other bars, a lead bartender (himself in this case, I guess) will take up to 70% of the tips for themselves, implying we should be grateful he splits them as he does.\n\nNow, I am still under the impression that even though he bartends a shift with us, he should not be receiving tips as he is on salary as the Bar/Restaurant Manager. If it weren't for the excuses and lying in the past, I probably wouldn't doubt that he has the right to tips, but here we are. Is there a loophole I'm missing that allows him to split tips with us? If not, what are our next steps here? Any and all advice is greatly appreciated.\n\nTL;DR My manager is on salary but has been splitting CC tips evenly between myself, him, and the other bartenders on shift. He works shifts at the bar with us when it is busy, does that earn him tips?",
    "score": 132,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1l95y73/is_my_manager_stealing_from_us/",
    "created_at": "2025-06-11T22:18:07.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1pog5hv",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Working at a first watch restaurant.....",
    "text": "Working at a First Watch breakfast brunch restaurant is the most overstimulating place I've ever worked at in my entire career as a server of 25 years. That is all.",
    "score": 98,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1pog5hv/working_at_a_first_watch_restaurant/",
    "created_at": "2025-12-16T22:48:23.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1mv39k4",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Wage Theft?",
    "text": "Hi, I have been working at a restaurant part time while applying for jobs and taking some exams. I just landed a great job and finished all my testing this career is in the finance sector. So I noticed some discrepancy on my pay stubs also very vague as to where they are getting this number they pay me. The restaurant I work at takes cash tips at the end of each day we staple the cash to the receipt and they “pay it back” on our checks or direct deposits. \n\nI added up my last paycheck shift pay+debit and credit tips and that was the amount they paid me not a single cent from cash tips. They also make us move orders paid in cash so they can void them and never report that money for a tax break but that’s not the point. Last paycheck (a week agos pay) I vividly remember getting many people giving me cash tips. But since we don’t log them and can only see the debit and credit tips owed to us on the computer I have no way of actually seeing how much they are skimming me by. \n\nDoes anyone have any tips or ideas or actions I can take? This is horrible me and my coworkers bust our asses and upsell the shit out of the mediocre food just for them to keep 100% of our cash tips and get mad when we ask questions about the tip pooling breakdown and the percentages we get. \n\nMy last paycheck was $563\n18.62 hours worked shift pay $12 an hour (223.44)\nMy tips were “340” and after doing the math just from credit and debit I was owed 352 in tips if anyone wanted the math assuming a 60-40 split with my busboy one day  and a 50-50 split with my server another day and 100% take home on the third because I am the only one scheduled ",
    "score": 44,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1mv39k4/wage_theft/",
    "created_at": "2025-08-20T02:56:25.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1o9mrgb",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "i’m not cut out for this job",
    "text": "\nafter this nightmare shift tonight i’m completely 100% convinced now that serving just isn’t for me. i didn’t read the notes on the chit that was handed to me and i just quickly threw it away after getting it and kept it moving. \n\ni go on with the table as normal and i get them desserts and they eventually pay and leave. then they stop my manager at the front and tell him it was the worst service they’ve ever had, i didn’t acknowledge their birthday or anniversary, and i didn’t keep their drinks full (i did keep their drinks full idk where this came from). \n\nbut i feel like garbage about the birthday and anniversary thing and my manager is absolutely shitty with me. i know i am better than that and honestly at this point im contemplating just not showing up anymore and finding a different career. what do you all think. should i just find a new job? \n\nedit: forgot to add that i completely lost it after my manager got mad at me and i couldn’t stop crying the rest of the night. ",
    "score": 39,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1o9mrgb/im_not_cut_out_for_this_job/",
    "created_at": "2025-10-18T04:45:18.000Z",
    "num_comments": 22
  },
  {
    "id": "reddit-1kfc8hq",
    "subreddit": "TalesFromYourServer",
    "soc_codes": [
      "35-3031"
    ],
    "title": "Being asked to work ad hoc but otherwise not on schedule normally",
    "text": "I started working summer 2024 as a front of house member in a brunch restaurant in the UK. I worked weekends only but it was a constant rota of myself coming in both days, every weekend until November. I understood that they needed to cut down due to the slow season and even had occasions where they’d cancel my shifts at short notice.\n\nPost January, I’ve been only put on the schedule sporadically, sometimes once every 3 to 4 weeks. However, since March until May, I haven’t been assigned a shift at all on the schedule but I’ve seen new staff added to the group chat and on the rota.\n\nYesterday, they asked last minute for me to come in to work due to unplanned absence. The managers were cheerful, welcoming and grateful to see me when I turned up. However, when I took my first order and I tried logging into the ordering system, my user profile had been deleted. I had to use the other staff’s profile for the shift. I’m not on the upcoming week’s rota too. Neither side have mentioned the elephant in the room (not being scheduled on the rota, text messages requesting time off not being answered with a response either way, my user profile being deleted on the system).\n\nThey were pleasant to my face but these signs have led me to look for tonnes of other weekend jobs for a more consistent side income for the summer (I work a Mon-Fri full time career job too). I have begun applying to loads and loads of jobs but the UK jobs market is dark this year due to government tax increases.\n\nIf I happen to land a new part time job, how risky would it be to leave without working a notice (I’m not sure and highly doubt they’d schedule me as normal anyway)? Whenever I filled out paperwork, I do not recall any notice period being stipulated or any minimum hours being written down.\n\nJust for added context: my work ethic is something praised amongst staff at all levels (managers, baristas and floor staff) within the restaurant even if it’s “only my side job”. I’m punctual and I’ve never ever called in sick. My text messages about time off were sent in spring and were about 3 weekends off the following month (they were never replied to).",
    "score": 11,
    "url": "https://reddit.com/r/TalesFromYourServer/comments/1kfc8hq/being_asked_to_work_ad_hoc_but_otherwise_not_on/",
    "created_at": "2025-05-05T13:56:04.000Z",
    "num_comments": 9
  }
]