[
  {
    "id": "reddit-1m0ikto",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Built myself a railing for my front steps from scratch",
    "text": "I didn’t feel like spending money on a cookie cutter railing so I bought some 16gauge 2x1 tubing and got to work. Got it cut up with an abrasive chop saw and used my Lincoln 140 mig to assemble. I just got a super powerful 6” Metabo angle grinder that smoothed out the welds like butter. Had to borrow a hammer drill to dig out the bolt holes on my steps but beyond that I got this done completely solo. I’m particularly happy with how the curved ends came out. Only thing left to do is prime and paint. My wife is happy with it so I know I did good.",
    "score": 11057,
    "url": "https://reddit.com/r/Welding/comments/1m0ikto/built_myself_a_railing_for_my_front_steps_from/",
    "created_at": "2025-07-15T14:01:48.000Z",
    "num_comments": 428
  },
  {
    "id": "reddit-1ip01qs",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Are glass welders welcome here?",
    "text": "Semi-serious question here, I used to share my work with glass on a welders forum and people there seemed interested.\n\nI am not a welder, but I am a glass blower who welds fused Quartz glass. The company I work for does scientific glass blowing and some of that involves welding pieces together, and I handle all of that work at my shop. \n\nI'm sharing a pic of a rod rack I recently made 3 of for a customer, it's made of 12mm Quartz rod and measures 19\"x15\"x7.5\" for reference.\n\nI respect what you guys do, I consider all fabricators kin! Please let me know if you want to know anything about it or have comments, and thank you for looking.",
    "score": 4326,
    "url": "https://reddit.com/r/Welding/comments/1ip01qs/are_glass_welders_welcome_here/",
    "created_at": "2025-02-14T02:14:14.000Z",
    "num_comments": 229
  },
  {
    "id": "reddit-1i5h8tr",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Boss man say I'm not worth more than 30$/h ",
    "text": "I think he's right, I'm not that good at welding that's why I'm leaving to become a welding instructor at the end of next month..\n\nBeen welding 7 years, the 2 first year I was a wire monkey fabricating gooseneck for lowboy trailer in a cery big custom semi trailer compagny, i was the only guy who could read the complex drawing so i did all the complex stuff.. then I did a lot of repair job in the trucking industry for 2 year and now I'm in a small custom fab shop, been here for almost 3 year but it's time to go, ain't paying for shit, bad ambiance and my health is worth more than 30$/h (see my other post for reference)\n\nBefore Christmas I've been approached by my old welding instructor to give welding lesson at night with the school.. I love it and I guess I do a good job at that since he they offerd me a full time instructor job starting at the end of next month!\n\nCouple tig weld pic since that what people want to see.\n\nAnd little complimentary info just for giggle, at my current job there are only 2 welder, the other dude learned to weld on YouTube and on open corner joint he weld super cold because full penetration weld are ugly on the inside, then he complain when his shit come back after 2 month saying he don't understand why it broke.. ",
    "score": 3521,
    "url": "https://reddit.com/r/Welding/comments/1i5h8tr/boss_man_say_im_not_worth_more_than_30h/",
    "created_at": "2025-01-20T03:40:48.000Z",
    "num_comments": 480
  },
  {
    "id": "reddit-1lfx4is",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Boss's truck with 600k miles",
    "text": "M17 started working at my family friend's welding company, its just me and him and his son, and our work truck is...interesting. It has no a/c, he said the speedometer broke so he bought a new one but it broke too so he decided to just get rid of it completely. He bought some aftermarket gauges and only the oil pressure gauge works. Half of the paint has flaked off the truck. The radio works great tho. The ignition switch quit working on him so he suited it up with push-to-start (she's basically a cadillac) And it leaks nearly every fluid possible...except gas. She's a 2003 chevy silverado 3500 8.1L gas, not diesel. It had trans replaced at around 300k and new motor put in it 250k according to boss, nothing else has broken since He bought it brand new. Boss man makes decent money so I asked him why he doesnt buy a new truck and he says \"this one is perfectly fine, I dont have to worry about keeping her nice and pretty and dont worry about scratching it or hitting it with any metal.\" So I guess wtv floats his boat :P",
    "score": 2669,
    "url": "https://reddit.com/r/Welding/comments/1lfx4is/bosss_truck_with_600k_miles/",
    "created_at": "2025-06-20T06:37:37.000Z",
    "num_comments": 254
  },
  {
    "id": "reddit-1k9h93z",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Welds on a Battleship (USS Wisconsin)",
    "text": "My battleship visit photo dump. now that I'm a welder professionally, I wanted to see how good the welds on these things look after almost 80 years. found a couple of old welding machines on the ship as well. overall a really cool way to spend my birthday. ",
    "score": 1581,
    "url": "https://reddit.com/r/Welding/comments/1k9h93z/welds_on_a_battleship_uss_wisconsin/",
    "created_at": "2025-04-27T23:12:02.000Z",
    "num_comments": 200
  },
  {
    "id": "reddit-1jdm8p4",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Vertical Uphill w/ .045 flux core. Once it clicked it became probably the easiest and most enjoyable weld I do.",
    "text": "I know it’s nothing too crazy but a year ago I had never touched a welder in my life. Much easier to learn on the job than any class/schooling",
    "score": 1084,
    "url": "https://reddit.com/r/Welding/comments/1jdm8p4/vertical_uphill_w_045_flux_core_once_it_clicked/",
    "created_at": "2025-03-17T20:02:21.000Z",
    "num_comments": 142
  },
  {
    "id": "reddit-1m39xsc",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "My Teen Son Ditched Kinesiology for Welding?! Help Me Get Him Set Up at Home (Proud Parent Needs Advice!)",
    "text": "Okay Welding Redditors, I am requesting your collective wisdom!\n\nMy 17-year-old son was set on continuing his education as a kinesiologist after high school… but then something happened. He got a job as a farm hand this summer, and his boss started teaching him MIG welding. Now he’s absolutely hooked. He comes home excited to talk about welds, penetration (I try not to giggle like a 12 year old), and how satisfying it is to see things he’s worked on hold together. His boss told him he’s doing really well “for a first timer” and suggested he get a small welder for home to keep practicing.\n\nNow here’s where I need help:  \n\\- What would you recommend for a beginner’s welder for at-home practice?  \n\\- He’s learning MIG on the farm—should we get him a MIG for home too, or would it make sense to start him on TIG to broaden his skills? How hard is it to transfer from MIG to TIG?  \n\\- Any other gear or tools we should grab to set up a safe space for him to practice? (welding helmet suggestions would be great!)  \n(Located in South-Western Ontario)\n\nI’m just so proud of him for discovering something he’s passionate about and taking the initiative to build real skills that could turn into a career after high school if he wants it. I know nothing about welding beyond what I’ve googled, so any advice from the people who actually do this would mean the world to me (and him).\n\nThanks in advance from a proud but clueless parent.",
    "score": 984,
    "url": "https://reddit.com/r/Welding/comments/1m39xsc/my_teen_son_ditched_kinesiology_for_welding_help/",
    "created_at": "2025-07-18T18:23:49.000Z",
    "num_comments": 335
  },
  {
    "id": "reddit-1kay3bx",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "mike rowe saying half of the welders that went through his foundation make MID 6 FIGURES!?!",
    "text": "a week or so ago mike rowe went on theo von’s podcast and said half of the welders that went through his foundation are making mid six figures… making it sound like a totally normal and reasonable salary for a welder to have.\n\ni know few welders who have made 250k+ working 7 days a week 12hrs or more for a entire year… ive met very few traveling pipeline welders with their own rig who probably could make 300k+ if they were away from their family for the entire year.\n\nsoooo wtf is he talking about? the only thing i can think of is people who own their own company and don’t actually weld anymore and have plenty of employees who weld and probably make around 60k….",
    "score": 491,
    "url": "https://reddit.com/r/Welding/comments/1kay3bx/mike_rowe_saying_half_of_the_welders_that_went/",
    "created_at": "2025-04-29T20:29:54.000Z",
    "num_comments": 317
  },
  {
    "id": "reddit-1jcp7u2",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Major career milestone for me. Finished my apprenticeship in July, and last night I finally got the chance to weld some waterwall tube joints for the first time as a journeyman boilermaker. All the xrays shot clean and I couldn’t be prouder. What a high!",
    "text": "",
    "score": 466,
    "url": "https://reddit.com/r/Welding/comments/1jcp7u2/major_career_milestone_for_me_finished_my/",
    "created_at": "2025-03-16T16:24:37.000Z",
    "num_comments": 37
  },
  {
    "id": "reddit-1k0i3mc",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Unfortunately no longer a smoke eater",
    "text": "Hello, 19M here hoping this reaches out to other young people or even someone teetering on the idea of one. These units are EXPENSIVE but yk what else is? A new pair of lungs. I have asthma as well as alpha-1 and was told I wouldn’t be able to weld because of it. Well 2 years later I’m still doing it and love the trade. Want this to be my career so I invested in my future. Probably one of the best decisions I will make/have made. ",
    "score": 350,
    "url": "https://reddit.com/r/Welding/comments/1k0i3mc/unfortunately_no_longer_a_smoke_eater/",
    "created_at": "2025-04-16T11:29:55.000Z",
    "num_comments": 47
  },
  {
    "id": "reddit-1jvsl9w",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "To upper management.",
    "text": "I don't care how much you spent on a fancy new fixture. If its out of tolerance, then I'm going to spend all night getting all of my part within tolerance.\n\nI don't care if I'm clocked into the right job 100% of the time, If the paperwork is fucked up or if the computer system is down (like it is atleast 3 times a week) then I'm not fucking with it. I'm not going to be walking back and forth between my station and the computer 1000 times a day.\n\n If you want accurate time on jobs, then fix the fucking paperwork. That's literally what you pay a paper pusher 3x my salary to do. (And they next time I have a paper pusher come down and tell me that it's my job to find job numbers and add steps to the job I'm going to lose my shit)\n\nIf you want better productivity quit promoting lazy ass kisser that don't know how to do their jobs and then expect me to pick up their slack.\n\nI can fix parts that aren't broke correctly, I can fill in gaps that are too wide. But I'm not a fucking miracle worker, I can't fix stupid, I can't fix lazy and I most certainly can't fix stupid lazy fucking people.\n\nTL:DR, paper pushers don't know how to run a welding shop",
    "score": 169,
    "url": "https://reddit.com/r/Welding/comments/1jvsl9w/to_upper_management/",
    "created_at": "2025-04-10T08:00:42.000Z",
    "num_comments": 30
  },
  {
    "id": "reddit-1mz7mgq",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "I. LOVE. WELDING.",
    "text": "No other way to say it, I fucking love it!\n\nI bounced around from job to job and finally pulled the trigger on a welding course (3 years ago) and that lead to my current job and what I hope will be my career (3 years in). I love watching the puddle, seeing how it reacts when you move things around or have contamination or burn through or porosity, especially love when you lay a beautiful bead! \n\nFuck, I love welding so much, it's now my side gig! I get to go out and do different things, on my time, choose the work I want to do, I get to do it how I want, I get to figure out new techniques on the job, I get to design some things I' building for others, I get to market myself. I get to be creative with how I do things.\n\nI FUCKING LOVE WELDING! GOD DAMN IT FEELS GOOD!",
    "score": 146,
    "url": "https://reddit.com/r/Welding/comments/1mz7mgq/i_love_welding/",
    "created_at": "2025-08-24T21:10:59.000Z",
    "num_comments": 34
  },
  {
    "id": "reddit-1kqwcac",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Beginner welding class. Had an hour to burn after completing my final. Meet Crankenstein",
    "text": "32 yo married/father of two little ones. Zero welding experience. Decided to pursue a Bachelors degree and go back to school. Wanted to dip my toes in academia by starting off with a class that’d be fun and practical to my career as a Municipal Operator. Now I’m hooked. 10/10 would do it again. ",
    "score": 137,
    "url": "https://reddit.com/r/Welding/comments/1kqwcac/beginner_welding_class_had_an_hour_to_burn_after/",
    "created_at": "2025-05-20T04:33:29.000Z",
    "num_comments": 15
  },
  {
    "id": "reddit-1o4pf64",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "1g flat position - mig , and a 3G both with backer",
    "text": "I'm learning welding thru school as another potential career path, some days I feel like I do great, other days it's like beating my head against the wall (first picture is 1G and second is 3G, the 3G is getting x rayed) any words are appreciated especially from folks in the field ",
    "score": 102,
    "url": "https://reddit.com/r/Welding/comments/1o4pf64/1g_flat_position_mig_and_a_3g_both_with_backer/",
    "created_at": "2025-10-12T13:43:08.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1nem8d9",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Why is it so hard to find a welding job?? i graduated from a welding program that is known in my area i’ve applied to 50 jobs no one has gotten back to me. the career service lady helped me make a resume so i send that in and no one gets back to me. any advice?",
    "text": "",
    "score": 79,
    "url": "https://reddit.com/r/Welding/comments/1nem8d9/why_is_it_so_hard_to_find_a_welding_job_i/",
    "created_at": "2025-09-11T22:13:46.000Z",
    "num_comments": 160
  },
  {
    "id": "reddit-1hqh08t",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Who wants to weld spaceships?",
    "text": "It was asked, so here's my attempt.   You're probably not going to get to weld in space, but some of these are good jobs.   The best part about aerospace is it's clean and indoors.   The worst part is it's mild production welding. Yes it's lower volume and critical (high quality), but's still repetitive and mgmt is right on top of you.   Pay isn't as high as pipes.  Tig AWS D17.1 is usually the cost of entry, but maybe half these jobs are welding operators; EB, Laser, Resistance, Friction stir, orbital machine....  \n\nProtip - don't apply thru indeed or any third party site if you can avoid.   Go to the real company's website and apply directly.\n\nBlue Origin\n\n* [Laser / Welding guy in Washington $33/hr](https://blueorigin.wd5.myworkdayjobs.com/BlueOrigin/job/Arlington-WA/Welder-Laser-Operator-I--M-A-_R47285)\n* [Orbital Tube welder in FL ](https://blueorigin.wd5.myworkdayjobs.com/BlueOrigin/job/Space-Coast-FL/Orbital-Tube-Welder-LVL-2---D-Shift_R47534)\n* [Robot guy in Washington up to $63](https://blueorigin.wd5.myworkdayjobs.com/BlueOrigin/job/Seattle-WA/Sr-Robot-Operator_R48573)... damn!\n* [TIG in FL](https://blueorigin.wd5.myworkdayjobs.com/BlueOrigin/job/Space-Coast-FL/Welder-III_R48419-1)\n* [Easier TIG in FL](https://blueorigin.wd5.myworkdayjobs.com/BlueOrigin/job/Space-Coast-FL/Welder-II_R48420)\n\nSpaceX\n\n* [Pipe welding, ground support, TX unto $30/hr](https://boards.greenhouse.io/spacex/jobs/7777321002?gh_jid=7777321002)\n* [EB welder in CA upto $38](https://boards.greenhouse.io/spacex/jobs/7774024002?gh_jid=7774024002)\n* [Night shift combo welder in FL $38](https://boards.greenhouse.io/spacex/jobs/7683422002?gh_jid=7683422002)\n* [Tig welder on the starship $30](https://boards.greenhouse.io/spacex/jobs/7521869002?gh_jid=7521869002)\n* [everything else](https://www.spacex.com/careers/jobs?search=welder)\n\nNorthrop\n\n* [Millwright in Utah](https://www.northropgrumman.com/jobs/non-cjcs/general/united-states-of-america/utah/magna/r10181253/maintenance-mechanic-millwright)\n* [Maintenance guy in MS](https://www.northropgrumman.com/jobs/FacilitiesReal-Estate/Facilities-Mult-Func/United-States-of-America/Mississippi/Iuka/R10176861/maintenance-technician-34)\n\nBoeing\n\n* [Maintenance mechanic ](https://jobs.boeing.com/job/hazelwood/maintenance-mechanic/185/74679232416)\n\nPursuit\n\n* [Resistance welding in CT](https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=3f003dc7-1976-44db-b5e0-0c1851def895&amp;ccId=19000101_000001&amp;type=JS&amp;lang=en_US&amp;selectedMenuKey=CareerCenter&amp;jobId=517858)\n* [TIG in CT](https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=3f003dc7-1976-44db-b5e0-0c1851def895&amp;ccId=19000101_000001&amp;type=JS&amp;lang=en_US&amp;selectedMenuKey=CareerCenter&amp;jobId=457213)\n* [Tig in MA](https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=3f003dc7-1976-44db-b5e0-0c1851def895&amp;ccId=19000101_000001&amp;type=JS&amp;lang=en_US&amp;selectedMenuKey=CareerCenter&amp;jobId=516849)\n* [Tig in FL](https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=3f003dc7-1976-44db-b5e0-0c1851def895&amp;ccId=19000101_000001&amp;type=JS&amp;lang=en_US&amp;selectedMenuKey=CareerCenter&amp;jobId=517920)\n* [Inspection &amp; NDT](https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=3f003dc7-1976-44db-b5e0-0c1851def895&amp;ccId=19000101_000001&amp;type=JS&amp;lang=en_US&amp;selectedMenuKey=CareerCenter)\n\nOther\n\n* [Tig in AZ](https://www.indeed.com/viewjob?jk=a9a2af2cc17cfe24&amp;q=aerospace%20welder&amp;tk=1igcoovci20i80aa&amp;from=web&amp;advn=2908750213860246&amp;adid=438008145&amp;ad=-6NYlbfkN0CeH4wbW9NHALu1E_qc763ZV-h9U2ujyXSOG9dhf7k0FppX9oUxmUd-ITJIsnACicxHlamt0KvPgTX_ijOifu0N_hGMs86aXB4W4ZdvYBIfb_BjoOaHxDa66NKZWhdjQOmQZXSncIKRbCnyInfkhvCSI3BxF_SAHHhS357J77oDaWWreUEVHT-blnjJ0K2i-brKFSYyPyl81TvojA2Fsd3IsE7VHv6X791KSkBMqaiFL9jtoqROeTAj-2SKwOBch8tCIa_2CmFVHDPmtOwRkUVRwlo90iuvTjsTlVvk3vPa178L3iEEwJgKC5l-O5bH-QIHjkyWCWT_Xn6jY8VhbzUIZGsOQeDInNLOrASPFoUh3WL0e-002sNiRs3sZZ53L6ec5OrHjMwPpGpm5-Ffpwo3jYQsyRUQLltfBDW1b7RSq3YEn_J3XURa3mfscJYY0Pyw8yNLjADq12RbfgKRE5C3yMVPFpu12qqH5dAtEH70ZzIol_RFZsDiDt9bke_kLT24wM75nKcUyY3SDvZnsb7p&amp;pub=4a1b367933fd867b19b072952f68dceb&amp;camk=nUmJqO2E8riX4VgI1OjZAQ%3D%3D&amp;xkcb=SoB46_M33M5sKsy0oR0LbzkdCdPP&amp;xpse=SoDm6_I33M59kJyLK50IbzkdCdPP&amp;xfps=b2aa66e0-d09d-4d2d-85c5-56ccf482054d&amp;vjs=3)\n* [Tig in SanFran upto $55](https://job-boards.greenhouse.io/astranis/jobs/4015607006)\n* [Tig in KY ](https://www.indeed.com/viewjob?jk=72ac08ea95b82cf4&amp;tk=1igcpe948glhi85k&amp;from=serp&amp;vjs=3)\n* [Everything else according to indeed](https://www.indeed.com/jobs?q=aerospace+welding&amp;l=&amp;from=searchOnHP&amp;vjk=8618430eee9ff6bf)\n\ndisclaimer - I'm not associated with these jobs.  Stop DMing me resumes.   I'm just trying to show what types of job are out there.",
    "score": 76,
    "url": "https://reddit.com/r/Welding/comments/1hqh08t/who_wants_to_weld_spaceships/",
    "created_at": "2024-12-31T15:30:08.000Z",
    "num_comments": 35
  },
  {
    "id": "reddit-1hxqpiq",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Nearly gotten taken out by exploding die grinder discs twice today. ",
    "text": "So I finally completed a week finally on the floor of my second welding job in my career and was watching how people were welding this week. We have a 4 day 10 hours a week work week. I was not the one grinding and two of disks exploded on a pneumatic die grinder. Please for the love of GOD do not put anymore pressure on your grinding wheels than needed to grind. Also remember to read your grinders max rated RPM and the disk/attachment max rpm to ensure safety of you and those around you. People expect you home after your shift don’t make them a widow. \n\n(I don’t know at the moment the brand but I do know that max RPM of the disks were 19,700ish but both had a rpm difference of around the low double digits) ",
    "score": 68,
    "url": "https://reddit.com/r/Welding/comments/1hxqpiq/nearly_gotten_taken_out_by_exploding_die_grinder/",
    "created_at": "2025-01-09T23:37:43.000Z",
    "num_comments": 42
  },
  {
    "id": "reddit-1mou3wq",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "2nd layoff this year.",
    "text": "Made a career change at 35, graduated the welding program at cc last year. Found a decent starter wage job in a structural fab shop. I love the work, I picked up the process pretty quick. They laid me off mid March and called me back in in may.  Spent all summer running 5/10's (while also working a part time night gig) just to get laid off again after 2 months. They said they want me to come back when they find more work but I'm leaning more towards fuck this place. ",
    "score": 65,
    "url": "https://reddit.com/r/Welding/comments/1mou3wq/2nd_layoff_this_year/",
    "created_at": "2025-08-13T03:48:01.000Z",
    "num_comments": 44
  },
  {
    "id": "reddit-1i0bjbz",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "First TIG T's - should I stick to it?",
    "text": "I know that these welds are far from perfect, but I'd like opinions from others. Based off my first ever TIG T welds, do you think it's worth trying to pursue it for a career, or stick to MIG and get experience elsewhere?\n\nMy current situation is as follows:\n\nLevel 2 welding course (UK), learning stick and MIG. I'm at a stage where I've pretty much completed the course's requirements. I'm learning TIG to enter a national competition. \n\nIf I leave the college now, I can get an entry level MIG job, and work my way up from that. Or, I can return in September and complete a level 3 course which includes TIG. This will delay my career by a year but might help in jumping up the ladder initially. \n\nAll courses are free, and I know for certain that welding is what I want to do. I'm also currently doing some automotive body repairs in my own time. I just can't decide what option is the better one for me. I'm turning 20 this year and feel as though remaining in education is holding me back from the 'real world'. \n\n",
    "score": 64,
    "url": "https://reddit.com/r/Welding/comments/1i0bjbz/first_tig_ts_should_i_stick_to_it/",
    "created_at": "2025-01-13T11:01:53.000Z",
    "num_comments": 27
  },
  {
    "id": "reddit-1l1p8wv",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "when will robots become a serious threat to the welding job market ?",
    "text": "When will welders start to struggle getting pay or jobs because of robots ? Is there still hope for a healthy career in the upcoming years ?",
    "score": 63,
    "url": "https://reddit.com/r/Welding/comments/1l1p8wv/when_will_robots_become_a_serious_threat_to_the/",
    "created_at": "2025-06-02T18:13:13.000Z",
    "num_comments": 89
  },
  {
    "id": "reddit-1hy6uws",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Who wants to be a Welding Engineer?",
    "text": "The answer is:&gt;!no one!!!!&lt;\n\nBut seriously, we all eventually get tired of being burnt, and sore, and black snot.   Maybe you realized welding doesn't pay as much as advertised.   Maybe you're tired of micro managing bosses. Maybe your 6 hour commute sucks.  Either way CWI and Weld Eng are great escape plans.   What better way to ease into retirement than a desk job.\n\nPay probably overlaps high end welders.  If you weld pipe you'll take pay cut.  [Glassdoor says we make $85-149k.](https://www.glassdoor.com/Salaries/welding-engineer-salary-SRCH_KO0,16.htm)\n\nSo how do you become a WE?   You typically need a BS (4 year degree in welding or something like it).  If you have a AAS you might be halfway done already.   A lot of WE are converted mech engineers or metallurgists, some of them are good, but IMO they have an uphill battle.  The first two years are similar to normal weld training like at a community college.   The last two years are more program mgmt, automated processes, designing, codework, etc.\n\nI'm sure there are other's but here are the main schools offering 4 years of welding-ish training.  In my experience each school is tailored toward their local industries;  The majority of Ferris grads go into automotive.   The Texas guys are hitting oil &amp; gas.    But they are pretty interchangeable.\n\n* [Ohio State](https://engineering.osu.edu/welding-engineering)\n* [Ferris State (Michigan)](https://www.ferris.edu/CET/design-mfg/welding/homepage.htm)\n* [LeTourneau (Texas)](https://www.letu.edu/academics/engineering/materials-joining.html)\n* [Penn College](https://www.pct.edu/academics/et/welding-metal-fabrication)\n* [Colorado School of Mines](https://cwjcr.mines.edu/)\n* [Waterloo (Canada)](https://uwaterloo.ca/mechanical-mechatronics-engineering/welding-and-joining-specialization)",
    "score": 57,
    "url": "https://reddit.com/r/Welding/comments/1hy6uws/who_wants_to_be_a_welding_engineer/",
    "created_at": "2025-01-10T15:26:22.000Z",
    "num_comments": 65
  },
  {
    "id": "reddit-1m9y6v4",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Is it worth applying for a 5-year apprenticeship at 29 years old?",
    "text": "I'm really struggling to find a long-term career, and this is one of the areas I can see myself in, since I like doing physical stuff. But I feel too old now. \n\nI look at non-union jobs, and the pay seems very low for hot, dirty jobs that want you to be available for overtime and long shifts.",
    "score": 57,
    "url": "https://reddit.com/r/Welding/comments/1m9y6v4/is_it_worth_applying_for_a_5year_apprenticeship/",
    "created_at": "2025-07-26T16:50:57.000Z",
    "num_comments": 57
  },
  {
    "id": "reddit-1j3xtnk",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Learning to walk the cup.",
    "text": "Have worked with sheet metal for the last 8 years. Wanted to learn to walk the cup, so I took a class at my local community college. Welded it 3g open root, 1/8” gap. Don’t mind the arc marks lol, been using a pedal my whole welding career still getting use to scratch start. ",
    "score": 55,
    "url": "https://reddit.com/r/Welding/comments/1j3xtnk/learning_to_walk_the_cup/",
    "created_at": "2025-03-05T07:34:51.000Z",
    "num_comments": 3
  },
  {
    "id": "reddit-1juksn7",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Bored",
    "text": "The “how did I do” posts after 30 seconds of welding are starting to be as boring as the “what are these welds worth an hour” posts we saw not too long ago. I’m not trying to be a hater, I understand what it’s like to be excited but honestly what feedback are we supposed to give other than it’s horrible but it takes time. Practice and then practice more. Go watch Jody and the rest of them, take a class, weld until your arms fall off, build something, put the work in then get the feedback. We aren’t keeping any book of secrets hidden that would allow you to stack dimes with 6010 2 minutes into your welding career. There are videos explaining everything you can possibly think of, it’s not our responsibility to explain what reverse polarity is 5x a week. All of those weldporn Instagram guys started exactly where you are, put the hood time in and it will come. Until then, it’s getting old repeating the same thing over and over. ",
    "score": 53,
    "url": "https://reddit.com/r/Welding/comments/1juksn7/bored/",
    "created_at": "2025-04-08T18:28:42.000Z",
    "num_comments": 38
  },
  {
    "id": "reddit-1jzcfo5",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Is the welding trade growing in popularity?",
    "text": "Recently started as a pipefitter’s apprentice, now whenever I bring up my job to anyone around my age (18) they’re always like “oh cool I’m gonna be a welder too I’m taking a welding class in school” etc etc. Do y’all think welding is becoming a more popular career choice for highschoolers?\n\nEdit: Thanks everyone for all the replys. You've given me a lot to think about, and a lot less worry",
    "score": 53,
    "url": "https://reddit.com/r/Welding/comments/1jzcfo5/is_the_welding_trade_growing_in_popularity/",
    "created_at": "2025-04-14T22:51:54.000Z",
    "num_comments": 49
  },
  {
    "id": "reddit-1n4cb1z",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Full time welders: is this profession hard on your body physically?",
    "text": "Hey y’all.\n\nI bought a harbor freight welder a few years ago and I really enjoyed the process of learning how to weld. I’m contemplating taking classes this fall at my local community college to eventually become a certified welder. It’s about a year and a half long program, but I’m really excited to learn how to officially   Weld.\n\nI do, however, have a nagging hip problem. I’ve torn the labrum twice in my hip and had surgery on it. I’m 30 years old and at this point, I have medium to moderate daily pain symptoms from my hip.   I mainly just well as a hobby. \n\nI know welding isn’t as strenuous on the body as like being a construction worker or something like that. I know it’s a decent amount of standing or crouching. But is this line of work going to break my body physically? \n\nOr do you think I could manage the pain and not be breaking my body every day doing welding.\n\nI’ve never done welding as a profession so I don’t really know what the day today looks like. Would love any full-time welders thoughts on this.\n\nTL;DR : I have a nagging hip problem and I’m wondering if doing welding full-time as a career will make it worse, and if welding is a very physically strenuous activity on the body. \n\n",
    "score": 50,
    "url": "https://reddit.com/r/Welding/comments/1n4cb1z/full_time_welders_is_this_profession_hard_on_your/",
    "created_at": "2025-08-30T20:53:59.000Z",
    "num_comments": 80
  },
  {
    "id": "reddit-1hpvgwx",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Who wants to weld internationally?",
    "text": "I've had the opportunity to work in \\~dozen countries. Usually inspecting/auditing, sometimes troubleshooting, rarely actually welding. IME companies prefer to hire low-cost locals. The big exception is when the US government is paying and insists on US citizen welders. It gets asked here occasionally, so here are a few leads.\n\n* [Spain](https://careers.kbr.com/us/en/job/KIVKBRUSR2096997EXTERNALENUS/UABOS-Spain-Corrosion-Control-Specialist-Welder)\n* [Baghdad](https://www.amentumcareers.com/jobs/welder-baghdad-iraq-1e37d600-5069-4cbd-bc2c-c38819e86a63?source=workday&amp;utm_source=workday)\n* [Canada](https://tradesmen.jobs/abbotsford-bc/welder-journeyman/8584FADEEB3C455F97CE4D84C3A34776/job/) (it's technically international)\n* [US domestic jobs](https://www.usajobs.gov/Search/Results?jt=Welder) that may occasionally do international travel\n* [Random international jobs that weld](https://www.clearancejobs.com/jobs?loc_country=3432,3465,3477,3205,3515,3420&amp;keywords=weld&amp;sort_info=timestamp+desc), but aren't exactly welders\n\nMore important than these specific postings, save those links.   USA jobs, Clearance jobs and tradesman probably account for 90% of international welding jobs.",
    "score": 46,
    "url": "https://reddit.com/r/Welding/comments/1hpvgwx/who_wants_to_weld_internationally/",
    "created_at": "2024-12-30T19:38:32.000Z",
    "num_comments": 20
  },
  {
    "id": "reddit-1k5ynak",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Is the CWI cert worth it?",
    "text": "Been in the welding and metal trades for around 7 years, 5 being military. I live in the south, very LCOL and I make around 32/hr at my current job running MIG. Super easy job, defense contractor so great benefits and great potential for upwards mobility. Anyways, I have one more step to go as a welder and then I'm topped out (36/hr I think), and then I can either pivot into management (around 40-50/hr working 50 hours a week average) or I can get into CWI. It's all visual, and they are salaried at 85k I think, and can only work 40/hrs a week. My other option would be trying to pivot into the engineering dept, but typically they want guys with 15 years experience in the industry (they actually prefer people without degrees if you can believe that). \n\nAnyhow, how much of a game changer was having a CWI certification? Did it help explore other avenues outside of strictly welding? (Ie management, engineering, teaching, QA, etc etc) ",
    "score": 16,
    "url": "https://reddit.com/r/Welding/comments/1k5ynak/is_the_cwi_cert_worth_it/",
    "created_at": "2025-04-23T13:04:20.000Z",
    "num_comments": 12
  },
  {
    "id": "reddit-1mg2f6t",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "The Pain",
    "text": "As a 32-year-old male seeking a career change, I recently discovered a government-funded, two-month welding course focused on SMAW. Within the program, it was possible to earn two welding licenses, contingent upon successfully passing the tests. I completed the course, achieving a license in flat welding but unfortunately not in horizontal welding. Now, I am actively searching for employment in this field, yet I've encountered difficulties securing even a single interview, as employers seem to primarily seek MIG welders rather than SMAW welders. I feel compelled to express my opinion that these government-funded welding programs should either prioritize teaching MIG welding or extend the program's duration to encompass both welding techniques. Consequently, I am currently employed at a warehouse earning $20 per hour, while observing welding job postings offering salaries between $25 and $32, which is disheartening.",
    "score": 8,
    "url": "https://reddit.com/r/Welding/comments/1mg2f6t/the_pain/",
    "created_at": "2025-08-02T21:55:20.000Z",
    "num_comments": 32
  },
  {
    "id": "reddit-1jdxxxn",
    "subreddit": "Welding",
    "soc_codes": [
      "51-4121"
    ],
    "title": "Salary",
    "text": "Hey so I'm in welding school it's my first semester and I'm taking kind of a deep dive into the information of welding. Allot of people you CA always make loads of money, but when I look at jobs in Southern California I see allot of 20/hr jobs. I was wondering if it's possible to make atleast 50 - 60k maybe even 70 going farther in the career like learning how to TIG multiple alloys, and learning fabrication  and also learning cad. Maybe even having your own welder and tools. I'd really like to have my own shop and just is it possible to have a life within this field also? Sorry if this is a dumb question. ",
    "score": 8,
    "url": "https://reddit.com/r/Welding/comments/1jdxxxn/salary/",
    "created_at": "2025-03-18T05:30:55.000Z",
    "num_comments": 26
  }
]